
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  	
	
	ФОИспользоватьСкользящееПланирование = ПолучитьФункциональнуюОпцию("торо_ИспользоватьСкользящееПланирование");
	ФОНазначениеНаРемонтыСУчетомРисков   = ПолучитьФункциональнуюОпцию("торо_НазначениеНаРемонтСУчетомРисков");
	
	Если ФОИспользоватьСкользящееПланирование Тогда
		Для каждого Элемент Из Элементы.ГруппаГлубинаПланирования.ПодчиненныеЭлементы Цикл
			Элемент.ТолькоПросмотр = Истина;
		КонецЦикла; 
		Элементы.ГруппаОтборыПоИсполнителям.Заголовок = Элементы.ГруппаОтборыПоИсполнителям.Заголовок + ", план работ";
	Иначе
        Элементы.ВидПлана.Видимость                             = Ложь;
        Элементы.ФормаСохранитьПланПодразделения.Видимость      = Ложь;
        Элементы.ГруппаПланРабот.Видимость                      = Ложь;
        Элементы.ДеревоРемонтыГруппаРедактируемыеДаты.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ОтобразитьНезапланированныеРемонты.Видимость = Ложь;
	Элементы.НезапланированныеРемонтыГруппа.Видимость	  = Ложь;
	
	Организация = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			"НастройкиТОиР",
			"ОсновнаяОрганизация",
			Истина);
			
	ПоказыватьВнешниеОснования		= Истина;
	ПоказыватьДефекты               = Истина;
	ПоказыватьРемонтыППР            = Истина;
	ПоказыватьРемонтыРегламентные   = Истина;
	
	ДатаОтсчета = ТекущаяДата();
	
	ГруппироватьПоИсполнителю = 0;
	ВерхнийУровень = "4";
	НижнийУровень  = "2";
	
	ДиаграммаГантаПодразделения.ОтображатьЗаголовок = Ложь;
	ДиаграммаГантаПодразделения.ОтображатьЛегенду   = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВариантГруппировкиПриИзменении(Элементы.ВариантГруппировки);
	СформироватьЗаголовокСвернутойГруппы(Элементы.ПоказыватьВнешниеОснования);
	УстановитьЗаголовкиКолонок();
	РемонтыТаблицаИДиаграммаПриСменеСтраницы(Элементы.РемонтыТаблицаИДиаграмма,Элементы.РемонтыТаблицаИДиаграмма.ТекущаяСтраница);
	
	Если ФОИспользоватьСкользящееПланирование Тогда
	    ВидПланаПриИзменении(Элементы.ВидПлана);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.торо_ПланРаботПодразделения") Тогда
		ПланРабот = ВыбранноеЗначение;
		ОбновитьЗаголовокКнопкиПланРабот();
		СтруктураДанныхПлана = ПолучитьСтруктуруДанныхИзСохраненногоПлана(ПланРабот);
		ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураДанныхПлана);
		
		ВидыРемонтов.Очистить();
		ВидыРемонтов.ЗагрузитьЗначения(СтруктураДанныхПлана.ВидыРемонтовМассив);
		ВидПланаПриИзменении(Элементы.ВидПлана);
		Элементы.ОтобразитьНезапланированныеРемонты.Видимость = Истина;
		Элементы.НезапланированныеРемонтыГруппа.Видимость	  = Истина;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ПАРАМЕТРЫ_ПЕЧАТИ_ОбщийПланРабот" Тогда
		
		Исполнители = ПодразделениеИсполнитель.ВыгрузитьЗначения();
	
		Для каждого ЭлементСписка Из Контрагент Цикл
			Исполнители.Добавить(ЭлементСписка.Значение);
		КонецЦикла; 
		
		МассивУточнениеИсполнителя = Бригада.ВыгрузитьЗначения();
		
		Для каждого ЭлементСписка Из ДоговорКонтрагента Цикл
			МассивУточнениеИсполнителя.Добавить(ЭлементСписка.Значение);
		КонецЦикла;
		
		СтруктураПараметровКоманды = Новый Структура();
	    СтруктураПараметровКоманды.Вставить("ГруппироватьПо", ?(НижнийУровень = "1", "Объектам ремонта", "Видам работ"));
	    СтруктураПараметровКоманды.Вставить("ИнтервалРазбиения", Детализация);
	    СтруктураПараметровКоманды.Вставить("ДатаНачала", Параметр.ДатаНачала);
	    СтруктураПараметровКоманды.Вставить("ДатаОкончания", Параметр.ДатаКонца);
		СтруктураПараметровКоманды.Вставить("ОтборФормы", Параметр.ОтборФормы);
	    СтруктураПараметровКоманды.Вставить("Организация", Организация);
	    СтруктураПараметровКоманды.Вставить("ВидПлана", ВидПлана);
	    СтруктураПараметровКоманды.Вставить("ВидПлана", ВидПлана);
		СтруктураПараметровКоманды.Вставить("Исполнители", Исполнители);
		СтруктураПараметровКоманды.Вставить("МассивУточнениеИсполнителя", МассивУточнениеИсполнителя);
		СтруктураПараметровКоманды.Вставить("ПоказыватьРемонтыППР", ПоказыватьРемонтыППР);
		СтруктураПараметровКоманды.Вставить("ПоказыватьРемонтыРегламентные", ПоказыватьРемонтыРегламентные);
		СтруктураПараметровКоманды.Вставить("ПоказыватьДефекты", ПоказыватьДефекты);
		СтруктураПараметровКоманды.Вставить("ПоказыватьВнешниеОснования", ПоказыватьВнешниеОснования);
		
		торо_Печать.НапечататьДокумент("Обработка.торо_ОбщийПланРабот",
									   "ПФ_MXL_МакетПланаРемонтовНаПериод",
									   ПланРабот, СтруктураПараметровКоманды);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	#Область ПериодичностьПриИзменении
	СписокВыбора = Новый Массив;
	Элементы.Детализация.ТолькоПросмотр = Ложь;
	
	Если Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
		Если КоличествоПериодов = 1 Тогда
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.торо_ДетализацияПлана.Год"));
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.торо_ДетализацияПлана.Месяц"));
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.торо_ДетализацияПлана.Неделя"));
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.торо_ДетализацияПлана.День"));
		Иначе
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.торо_ДетализацияПлана.Год"));
		КонецЕсли;
		
	Иначе   
		Если ЗначениеЗаполнено(Периодичность) Тогда
			
			Если Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") 
				ИЛИ Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
				СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.торо_ДетализацияПлана.Неделя"));
				СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.торо_ДетализацияПлана.День"));
			Иначе
				СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.торо_ДетализацияПлана.Час"));
			КонецЕсли; 
		КонецЕсли;
		
	КонецЕсли; 	
	
	Элементы.Детализация.СписокВыбора.ЗагрузитьЗначения(СписокВыбора);
	
	НайдЗначение = СписокВыбора.Найти(Детализация);
	
	Если НайдЗначение = Неопределено Тогда
		Детализация = Неопределено;
	КонецЕсли; 
	
	Если СписокВыбора.Количество() = 1 Тогда
		Элементы.Детализация.ТолькоПросмотр = Истина;
		Детализация = СписокВыбора[0];
	КонецЕсли;
	
	#КонецОбласти
	
	#Область ДетализацияПриИзменении
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("Год"   , Ложь);
	Соответствие.Вставить("Месяц" , Ложь);
	Соответствие.Вставить("Неделя", Ложь);
	Соответствие.Вставить("День"  , Ложь);
	Соответствие.Вставить("Час"   , Ложь);
	
	Если Детализация = ПредопределенноеЗначение("Перечисление.торо_ДетализацияПлана.Год") Тогда
		
		Соответствие["Год"]   = Истина;
		Соответствие["Месяц"] = Истина;
		
	ИначеЕсли Детализация = ПредопределенноеЗначение("Перечисление.торо_ДетализацияПлана.Месяц") Тогда
		
		Соответствие["Месяц"] = Истина;
		
	ИначеЕсли Детализация = ПредопределенноеЗначение("Перечисление.торо_ДетализацияПлана.Неделя") Тогда
		Соответствие["Неделя"]  = Истина;
		
	ИначеЕсли Детализация = ПредопределенноеЗначение("Перечисление.торо_ДетализацияПлана.Час") Тогда
		
		Соответствие["Час"]  = Истина;
		Соответствие["День"]  = Истина;
		
	ИначеЕсли Детализация = ПредопределенноеЗначение("Перечисление.торо_ДетализацияПлана.День") Тогда
		Соответствие["День"]  = Истина;
	Иначе
		Соответствие["Неделя"]= Истина;
		Соответствие["День"]  = Истина;
	КонецЕсли; 
	
	Для каждого ЭлементНастройки Из ДиаграммаГантаподразделения.ОбластьПостроения.ШкалаВремени.Элементы Цикл
		НастройкаИспользования = Соответствие.Получить(Строка(ЭлементНастройки.Единица));
		Если НЕ НастройкаИспользования = Неопределено Тогда
			ЭлементНастройки.Видимость = НастройкаИспользования;
		КонецЕсли; 
	КонецЦикла;
	
	#КонецОбласти
	
	#Область ГруппироватьПоПриИзменении
	СписокВыбораВерхнийУровень = Элементы.ВерхнийУровень.СписокВыбора;
	СписокВыбораВерхнийУровень.Очистить();
	Если ГруппироватьПоИсполнителю = 1 Тогда
		// >> [Деснол] [Ушаков А.Д.] [26.09.2019] 
		СписокВыбораВерхнийУровень.Добавить("1", НСтр("es='División / Contraparte';ru='Подразделение / Контрагент';en='Department / Contractor'"));
		СписокВыбораВерхнийУровень.Добавить("2", НСтр("es='Unidad + Equipo / Contraparte + Contrato';ru='Подразделение + Бригада / Контрагент + Договор';en='Division + Team / Contractor + Contract'"));
		СписокВыбораВерхнийУровень.Добавить("3", НСтр("es='Equipo / contrato';ru='Бригада / Договор';en='Team / Contract'"));

		//СписокВыбораВерхнийУровень.Добавить("1", "Подразделение / Контрагент");
		//СписокВыбораВерхнийУровень.Добавить("2", "Подразделение + Бригада / Контрагент + Договор");
		//СписокВыбораВерхнийУровень.Добавить("3", "Бригада / Договор");
		// << [Деснол] [Ушаков А.Д.] [26.09.2019] 
		
	Иначе
		// >> [Деснол] [Ушаков А.Д.] [26.09.2019] 
		СписокВыбораВерхнийУровень.Добавить("4", НСтр("es='División / Contraparte';ru='Подразделение / Контрагент';en='Department / Contractor'"));
		//СписокВыбораВерхнийУровень.Добавить("4", "Подразделение / Контрагент");
		// << [Деснол] [Ушаков А.Д.] [26.09.2019] 
	КонецЕсли; 
	
	#КонецОбласти

	#Область ОбновитьЗаголовокВГруппеДерева
	// >> [Деснол] [Ушаков А.Д.] [26.09.2019] 
	Если ВерхнийУровень = "1" Тогда
		Текст1 = НСтр("es='Contratista (Unidad, contraparte)';ru='Исполнитель (Подразделение, контрагент)';en='The contractor (Department, contractor)'");
	ИначеЕсли ВерхнийУровень = "2" Тогда
		Текст1 = НСтр("es='Contratista | Aclaración de intérprete';ru='Исполнитель | Уточнение исполнителя';en='Artist / clarification of the artist'");
	ИначеЕсли ВерхнийУровень = "3" Тогда
		Текст1 = НСтр("es='Aclaración del contratista (equipo, contrato)';ru='Уточнение исполнителя (Бригада, договор)';en='Clarification of the contractor (Team, contract)'");
	Иначе
		Текст1 = НСтр("en='Owner EI';es='Propietario O';ru='Владелец ОР'");
	КонецЕсли;
	
	Если НижнийУровень = "1" Тогда
		Текст2 = НСтр("es='Reparar objetos';ru='Объекты ремонта';en='Repair objects'");
	Иначе
		Текст2 = НСтр("es='Tipos de reparacion';ru='Виды ремонта';en='Types of repair'");
	КонецЕсли; 

	//Если ВерхнийУровень = "1" Тогда
	//	Текст1 = "Исполнитель (Подразделение, контрагент)";
	//ИначеЕсли ВерхнийУровень = "2" Тогда
	//	Текст1 = "Исполнитель | Уточнение исполнителя";
	//ИначеЕсли ВерхнийУровень = "3" Тогда
	//	Текст1 = "Уточнение исполнителя (Бригада, договор)";
	//Иначе
	//	Текст1 = "Владелец ОР";
	//КонецЕсли; 
	//
	//Если НижнийУровень = "1" Тогда
	//	Текст2 = "Объекты ремонта";
	//Иначе
	//	Текст2 = "Виды ремонта";
	//КонецЕсли; 
	// << [Деснол] [Ушаков А.Д.] [26.09.2019] 

	Элементы.ДеревоРемонтыГруппаИерархия.Заголовок = Текст1;
	Элементы.ДеревоРемонтыГруппа2.Заголовок        = Текст2;
	
	#КонецОбласти
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидПланаПриИзменении(Элемент)
	
	ВидыРемонтов.Очистить();
	
	ДанныеПоВидуПлана = ПолучитьДанныеПоВидуПлана(ВидПлана);
	
	МассивРемонтов = ДанныеПоВидуПлана.МассивРемонтов;
	ВидыРемонтов.ЗагрузитьЗначения(МассивРемонтов);

	ЗаполнитьЗначенияСвойств(ЭтаФорма, ДанныеПоВидуПлана,"Периодичность, КоличествоПериодов, Детализация, ВидИсполнителяРабот");
	
	ПериодичностьПриИзменении(Элементы.Периодичность);
	ДетализацияПриИзменении(Элементы.Детализация);
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантГруппировкиПриИзменении(Элемент)
	
	СписокВыбораВерхнийУровень = Элементы.ВерхнийУровень.СписокВыбора;
	СписокВыбораВерхнийУровень.Очистить();
	
	Если ГруппироватьПоИсполнителю = 1 Тогда
		// >> [Деснол] [Ушаков А.Д.] [26.09.2019] 
		СписокВыбораВерхнийУровень.Добавить("1", НСтр("es='División / Contraparte';ru='Подразделение / Контрагент';en='Department / Contractor'"));
		СписокВыбораВерхнийУровень.Добавить("2", НСтр("es='Unidad + Equipo / Contraparte + Contrato';ru='Подразделение + Бригада / Контрагент + Договор';en='Division + Team / Contractor + Contract'"));
		СписокВыбораВерхнийУровень.Добавить("3", НСтр("es='Equipo / contrato';ru='Бригада / Договор';en='Team / Contract'"));
		
		//СписокВыбораВерхнийУровень.Добавить("1", "Подразделение / Контрагент");
		//СписокВыбораВерхнийУровень.Добавить("2", "Подразделение + Бригада / Контрагент + Договор");
		//СписокВыбораВерхнийУровень.Добавить("3", "Бригада / Договор");
		// << [Деснол] [Ушаков А.Д.] [26.09.2019] 

		Если ВерхнийУровень = "4" Тогда
			ВерхнийУровень = "1";
		КонецЕсли; 
		
	Иначе
		// >> [Деснол] [Ушаков А.Д.] [26.09.2019] 
		СписокВыбораВерхнийУровень.Добавить("4", НСтр("es='División / Contraparte';ru='Подразделение / Контрагент';en='Department / Contractor'"));
		//СписокВыбораВерхнийУровень.Добавить("4", "Подразделение / Контрагент");
		// << [Деснол] [Ушаков А.Д.] [26.09.2019] 
		Если НЕ ВерхнийУровень = "4" Тогда
			ВерхнийУровень = "4";
		КонецЕсли; 
	КонецЕсли; 
	
	УстановитьЗаголовкиКолонок();

КонецПроцедуры

&НаКлиенте
Процедура ВерхнийУровеньПриИзменении(Элемент)
	УстановитьЗаголовкиКолонок();
КонецПроцедуры

&НаКлиенте
Процедура НижнийУровеньПриИзменении(Элемент)
	УстановитьЗаголовкиКолонок();
КонецПроцедуры

&НаКлиенте
Процедура ВидИсполнителяРаботПриИзменении(Элемент)
	Если ВидИсполнителяРабот = ПредопределенноеЗначение("Перечисление.торо_ДетализацияИсполнителя.Подразделение") Тогда
		Элементы.Бригада.Доступность = Ложь;
		Бригада = Неопределено;
	Иначе
		Элементы.Бригада.Доступность = Истина;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьПриИзменении(Элемент)
	
	ЗаполнитьСписокВыборкаДетализации();
	ДетализацияПриИзменении(Элементы.Детализация);
	
КонецПроцедуры

&НаКлиенте
Процедура ДетализацияПриИзменении(Элемент)

	Соответствие = Новый Соответствие;
	Соответствие.Вставить("Год"   , Ложь);
	Соответствие.Вставить("Месяц" , Ложь);
	Соответствие.Вставить("Неделя", Ложь);
	Соответствие.Вставить("День"  , Ложь);
	Соответствие.Вставить("Час"   , Ложь);
	
	Если Детализация = ПредопределенноеЗначение("Перечисление.торо_ДетализацияПлана.Год") Тогда
		
		Соответствие["Год"]   = Истина;
		
	ИначеЕсли Детализация = ПредопределенноеЗначение("Перечисление.торо_ДетализацияПлана.Месяц") Тогда
		
		Соответствие["Месяц"] = Истина;
		
	ИначеЕсли Детализация = ПредопределенноеЗначение("Перечисление.торо_ДетализацияПлана.Неделя") Тогда
		
		Соответствие["Неделя"]  = Истина;
		
	ИначеЕсли Детализация = ПредопределенноеЗначение("Перечисление.торо_ДетализацияПлана.Час") Тогда
		
		Соответствие["Час"]  = Истина;
		Соответствие["День"] = Истина;
		
	ИначеЕсли Детализация = ПредопределенноеЗначение("Перечисление.торо_ДетализацияПлана.День") Тогда
		
		Соответствие["День"]  = Истина;
		
	Иначе
		Соответствие["Неделя"]= Истина;
		Соответствие["День"]  = Истина;
	КонецЕсли; 
	
	Для каждого ЭлементНастройки Из ДиаграммаГантаподразделения.ОбластьПостроения.ШкалаВремени.Элементы Цикл
		НастройкаИспользования = Соответствие.Получить(Строка(ЭлементНастройки.Единица));
		Если Не НастройкаИспользования = Неопределено Тогда
			ЭлементНастройки.Видимость = НастройкаИспользования;
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолосаРегулированияДиаграммыГантаПриИзменении(Элемент)
	Если ПолосаРегулированияДиаграммыГанта < 1 Тогда
		ДиаграммаГантаПодразделения.ПоддержкаМасштаба = ПоддержкаМасштабаДиаграммыГанта.ВсеДанные;
		ДиаграммаГантаПодразделения.УстановитьПолныйИнтервал(ДатаОтсчета, ДатаОкончания);
	Иначе
		ДиаграммаГантаПодразделения.ПоддержкаМасштаба 				= ПоддержкаМасштабаДиаграммыГанта.Период;
		ДиаграммаГантаПодразделения.ЕдиницаПериодическогоВарианта 	= ТипЕдиницыШкалыВремени["День"];
		ДиаграммаГантаПодразделения.КратностьПериодическогоВарианта = 101 - ПолосаРегулированияДиаграммыГанта;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РемонтыТаблицаИДиаграммаПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ВидимостьДляДиаграммы = Элементы.РемонтыТаблицаИДиаграмма.ТекущаяСтраница = Элементы.ДиаграммаРемонтов;
	Элементы.ГруппаНастройкиДиаграммы.Видимость = ВидимостьДляДиаграммы;
	Элементы.ОтображениеЛегенды.Видимость       = ВидимостьДляДиаграммы;
КонецПроцедуры

#Область ЗаполениеСписковОтбора
&НаКлиенте
Процедура ПодразделениеИсполнительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураПодбора = Новый Структура;
    СтруктураПодбора.Вставить("МассивВыбранных"                          , ПодразделениеИсполнитель.ВыгрузитьЗначения());
    СтруктураПодбора.Вставить("ТипЗначений"                              , Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
    СтруктураПодбора.Вставить("ИспользоватьВариантУчетаИерархииЭлементов", Истина);
    СтруктураПодбора.Вставить("ФОИспользоватьСкользящееПланирование"     , ФОИспользоватьСкользящееПланирование);
	СтруктураПодбора.Вставить("Заголовок"                                , НСтр("es='La selección por las subdivisiones-ejecutores';ru='Отбор по подразделениям-исполнителям';en='Selection by implementing unit'")); 
	
	ОткрытьПодбор(СтруктураПодбора, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеИсполнительОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Не ВыбранноеЗначение = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		ПодразделениеИсполнитель.Очистить();
		ПодразделениеИсполнитель.ЗагрузитьЗначения(ВыбранноеЗначение);
		
		БригадаОбработкаВыбора(Элементы.Бригада, ОтобратьБригадыПоМассивуПодразделений(ВыбранноеЗначение, Бригада.ВыгрузитьЗначения()), Ложь);
		
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеВладелецНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.Контрагенты"));
	МассивТипов.Добавить(Тип("СправочникСсылка.СтруктураПредприятия"));
	
	СтруктураПодбора = Новый Структура;
    СтруктураПодбора.Вставить("МассивВыбранных"                          , ВладелецОР.ВыгрузитьЗначения());
    СтруктураПодбора.Вставить("ТипЗначений"                              , Новый ОписаниеТипов(МассивТипов));
    СтруктураПодбора.Вставить("ИспользоватьВариантУчетаИерархииЭлементов", Истина);
	СтруктураПодбора.Вставить("Заголовок"                                , НСтр("es='La selección por los propietarios de la maquinaria';ru='Отбор по владельцам оборудования';en='Selection by equipment owners'")); 

	ОткрытьПодбор(СтруктураПодбора, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеВладелецОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Не ВыбранноеЗначение = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		ВладелецОР.Очистить();
		ВладелецОР.ЗагрузитьЗначения(ВыбранноеЗначение);
	КонецЕсли; 
КонецПроцедуры
 
&НаКлиенте
Процедура БригадаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураПодбора = Новый Структура;
    СтруктураПодбора.Вставить("МассивВыбранныхПодразделений", ПодразделениеИсполнитель.ВыгрузитьЗначения());
    СтруктураПодбора.Вставить("МассивВыбранных"             , Бригада.ВыгрузитьЗначения());
    СтруктураПодбора.Вставить("ТипЗначений"                 , Новый ОписаниеТипов("СправочникСсылка.торо_РемонтныеБригады"));
    СтруктураПодбора.Вставить("Заголовок"                   , НСтр("es='La selección por las brigadas';ru='Отбор по бригадам';en='Brigade selection'")); 
	
	ОткрытьПодбор(СтруктураПодбора, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура БригадаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ВыбранноеЗначение = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		Бригада.Очистить();
		Бригада.ЗагрузитьЗначения(ВыбранноеЗначение);
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура КонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	СтруктураПодбора = Новый Структура;
	СтруктураПодбора.Вставить("МассивВыбранных" , Контрагент.ВыгрузитьЗначения());
	СтруктураПодбора.Вставить("ТипЗначений"     , Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	СтруктураПодбора.Вставить("Заголовок"       , НСтр("es='La selección por los contratantes';ru='Отбор по контрагентам';en='Counterparty selection'")); 
	
	ОткрытьПодбор(СтруктураПодбора, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура КонтрагентОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Не ВыбранноеЗначение = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		Контрагент.Очистить();
		Контрагент.ЗагрузитьЗначения(ВыбранноеЗначение);
		
		ДоговорКонтрагентаОбработкаВыбора(Элементы.ДоговорКонтрагента, ОтобратьДоговорыПоМассивуКонтрагентов(ВыбранноеЗначение, ДоговорКонтрагента.ВыгрузитьЗначения()), Ложь);

	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураПодбора = Новый Структура;
    СтруктураПодбора.Вставить("МассивВыбранных"            , ДоговорКонтрагента.ВыгрузитьЗначения());
    СтруктураПодбора.Вставить("МассивВыбранныхКонтрагентов", Контрагент.ВыгрузитьЗначения());
    СтруктураПодбора.Вставить("ТипЗначений"                , Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
    СтруктураПодбора.Вставить("Заголовок"                  , НСтр("es='La selección por los contractos de los contratantes';ru='Отбор по договорам контрагентов';en='Contractor selection'")); 
	
	ОткрытьПодбор(СтруктураПодбора, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ВыбранноеЗначение = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		ДоговорКонтрагента.Очистить();
		ДоговорКонтрагента.ЗагрузитьЗначения(ВыбранноеЗначение);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ВидыРемонтовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураПодбора = Новый Структура;
    СтруктураПодбора.Вставить("МассивВыбранных"            , ВидыРемонтов.ВыгрузитьЗначения());
    СтруктураПодбора.Вставить("ТипЗначений"                , Новый ОписаниеТипов("СправочникСсылка.торо_ВидыРемонтов"));
    СтруктураПодбора.Вставить("Заголовок"                  , НСтр("es='La selección según los tipos de las reparaciones';ru='Отбор по видам ремонтов';en='Selection by type of repair'")); 
	
	ОткрытьПодбор(СтруктураПодбора, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыРемонтовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ВыбранноеЗначение = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		ВидыРемонтов.Очистить();
		ВидыРемонтов.ЗагрузитьЗначения(ВыбранноеЗначение);
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРемонтаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.торо_ОбъектыРемонта"));
	МассивТипов.Добавить(Тип("СправочникСсылка.торо_СписокОбъектовРегламентногоМероприятия"));

	СтруктураПодбора = Новый Структура;
    СтруктураПодбора.Вставить("МассивВыбранных"            , ОбъектРемонта.ВыгрузитьЗначения());
    СтруктураПодбора.Вставить("ТипЗначений"                , Новый ОписаниеТипов(МассивТипов));
    СтруктураПодбора.Вставить("Заголовок"                  , НСтр("es='La selección por los objetos de la reparación';ru='Отбор по объектам ремонта';en='Selection of repair objects'"));
	СтруктураПодбора.Вставить("ИспользоватьВариантУчетаИерархииЭлементов", Истина);
	
	ОткрытьПодбор(СтруктураПодбора, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРемонтаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Не ВыбранноеЗначение = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		ОбъектРемонта.Очистить();
		ОбъектРемонта.ЗагрузитьЗначения(ВыбранноеЗначение);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗаголовокСвернутойГруппы(Элемент)
	
	ЗаголовокСвернутойГруппы = НСтр("es='Sacar la información по%1';ru='Выводить информацию по%1';en='Display information on%1'");
	
	МассивСтрокДокументов = Новый Массив;
	
	Если ПоказыватьРемонтыППР Тогда
		МассивСтрокДокументов.Добавить(НСтр("en=' PPM schedules';es=' A los planes-gráficos ППР';ru=' план-графикам ППР'"));
	КонецЕсли;
	
	Если ПоказыватьРемонтыРегламентные Тогда
		МассивСтрокДокументов.Добавить(НСтр("es=' A los gráficos de las medidas de reglamento';ru=' графикам регламентных мероприятий';en=' regulatory schedules'"));
	КонецЕсли;
	
	Если ПоказыватьДефекты Тогда
		МассивСтрокДокументов.Добавить(НСтр("es=' A las demandas por los defectos';ru=' заявкам по дефектам';en=' defect claims'"));
	КонецЕсли;
	
	Если ПоказыватьВнешниеОснования Тогда
		МассивСтрокДокументов.Добавить(НСтр("es=' A las demandas por las razones exteriores';ru=' заявкам по внешним основаниям';en=' external applications'"));
	КонецЕсли;

	Элементы.ГруппаВыводитьИнформациюПо.ЗаголовокСвернутогоОтображения = СтрШаблон(ЗаголовокСвернутойГруппы, СтрСоединить(МассивСтрокДокументов, ","));
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоРемонты

&НаКлиенте
Процедура ДеревоРемонтыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СоответствиеИменПолейРеквизитамДерева = Новый Соответствие;
	СоответствиеИменПолейРеквизитамДерева.Вставить("ДеревоРемонтыДокументОснование", "ДокументОснование");
	СоответствиеИменПолейРеквизитамДерева.Вставить("ДеревоРемонтыПланПодразделения", "ПланПодразделения");
	СоответствиеИменПолейРеквизитамДерева.Вставить("ДеревоРемонтыЕстьЗаявка"       , "Заявка");
	
	ИмяПоляДляОткрытияЗначения = СоответствиеИменПолейРеквизитамДерева.Получить(Поле.Имя);
	
	Если Не ИмяПоляДляОткрытияЗначения = Неопределено И ЗначениеЗаполнено(ДеревоРемонты.НайтиПоИдентификатору(ВыбраннаяСтрока)[ИмяПоляДляОткрытияЗначения]) Тогда
		ОткрытьЗначение(ДеревоРемонты.НайтиПоИдентификатору(ВыбраннаяСтрока)[ИмяПоляДляОткрытияЗначения]);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРемонтыДатаОкончанияРедактируемаяПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоРемонты.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		ПроверитьДатыРемонтовВСтроке(ТекущиеДанные);
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ДеревоРемонтыДатаНачалаРедактируемаяПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоРемонты.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		ПроверитьДатыРемонтовВСтроке(ТекущиеДанные);
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ДеревоРемонтыКрайняяДатаЗавершенияРедактируемаяПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ДеревоРемонты.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		ПроверитьДатыРемонтовВСтроке(ТекущиеДанные);
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьФормуНастроек(Команда)
	ОткрытьФорму("Обработка.торо_ОбщийПланРабот.Форма.ФормаНастройки",, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПостроитьОбновить(Команда)
	
	МожноВыполнитьПостроение = Истина;
	
	СписокПроверяемыхПолей = Новый СписокЗначений;
	СписокПроверяемыхПолей.Добавить(ДатаОтсчета, "Дата отсчета");
	СписокПроверяемыхПолей.Добавить(КоличествоПериодов, "Количество периодов");
	СписокПроверяемыхПолей.Добавить(Периодичность, "Периодичность");
	СписокПроверяемыхПолей.Добавить(Детализация, "Детализация");
	СписокПроверяемыхПолей.Добавить(ВерхнийУровень, "Верхний уровень");
	СписокПроверяемыхПолей.Добавить(НижнийУровень, "Нижний уровень");
	
	Для каждого ЭлементСписка Из СписокПроверяемыхПолей Цикл
		Если Не ЗначениеЗаполнено(ЭлементСписка.Значение) Тогда
			ШаблонСообщения = НСтр("es='%1';ru='Не заполнено поле %1';en='The field%1 is not filled'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ЭлементСписка.Представление);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			
			МожноВыполнитьПостроение = Ложь;
		КонецЕсли;
	КонецЦикла; 
	
	Если Не МожноВыполнитьПостроение Тогда
		Возврат;
	КонецЕсли; 
	
	ДеревоРемонты.ПолучитьЭлементы().Очистить();
	
	СтруктураДанныхПервогоУровня = Новый Структура();
	СтруктураДанныхВторогоУровня = Новый Структура();
	СтруктураДанныхУровеньДанные = Новый Структура();
	
	ПроставитьСвойстваОтображенияВСтруктурах(СтруктураДанныхПервогоУровня, СтруктураДанныхВторогоУровня, СтруктураДанныхУровеньДанные);
	
	ЗаполнитьСписокРемонтовНаСервере(СтруктураДанныхПервогоУровня, СтруктураДанныхВторогоУровня, СтруктураДанныхУровеньДанные);
	
	РазвернутьДерево();

КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьНезапланированныеРемонты(Команда)
	
	МожноВыполнитьПостроение = Истина;
	
	СписокПроверяемыхПолей = Новый СписокЗначений;
	СписокПроверяемыхПолей.Добавить(ДатаОтсчета, "Дата отсчета");
	СписокПроверяемыхПолей.Добавить(КоличествоПериодов, "Количество периодов");
	СписокПроверяемыхПолей.Добавить(Периодичность, "Периодичность");
	СписокПроверяемыхПолей.Добавить(Детализация, "Детализация");
	СписокПроверяемыхПолей.Добавить(ВерхнийУровень, "Верхний уровень");
	СписокПроверяемыхПолей.Добавить(НижнийУровень, "Нижний уровень");
	
	Для каждого ЭлементСписка Из СписокПроверяемыхПолей Цикл
		Если Не ЗначениеЗаполнено(ЭлементСписка.Значение) Тогда
			ШаблонСообщения = НСтр("es='%1';ru='Не заполнено поле %1';en='The field%1 is not filled'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ЭлементСписка.Представление);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			
			МожноВыполнитьПостроение = Ложь;
		КонецЕсли;
	КонецЦикла; 
	
	Если Не МожноВыполнитьПостроение Тогда
		Возврат;
	КонецЕсли; 
	
	ДеревоРемонты.ПолучитьЭлементы().Очистить();
	
	СтруктураДанныхПервогоУровня = Новый Структура();
	СтруктураДанныхВторогоУровня = Новый Структура();
	СтруктураДанныхУровеньДанные = Новый Структура();
	
	ПроставитьСвойстваОтображенияВСтруктурах(СтруктураДанныхПервогоУровня, СтруктураДанныхВторогоУровня, СтруктураДанныхУровеньДанные);
	
	ЗаполнитьСписокРемонтовНаСервере(СтруктураДанныхПервогоУровня, СтруктураДанныхВторогоУровня, СтруктураДанныхУровеньДанные, Истина);
	
	РазвернутьДерево();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьПланПодразделения(Команда)
	
	Если ЗначениеЗаполнено(ПланРабот) Тогда
		СохранитьПланПодразделенияПродолжение(КодВозвратаДиалога.Да, ПланРабот);
	Иначе
		ИмеющийсяПлан = НаУказанныйПериодУжеИмеютсяДокументы(ПланРабот, Организация, ВидПлана, ДатаОтсчета, Периодичность, КоличествоПериодов);
		Если Не ИмеющийсяПлан = Неопределено Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("СохранитьПланПодразделенияПродолжение", ЭтаФорма, ИмеющийсяПлан);
			ТекстВопроса = НСтр("es='Para el período indicado es creado ya el documento %1. ¿Cumplir la renovación de los datos en ello?';ru='На указанный период уже создан документ %1. Выполнить обновление данных в нем?';en='The document %1 has already been created for the specified period. Perform data update in it?'");
			ТекстВопроса = СтрШаблон(ТекстВопроса, ИмеющийсяПлан);
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Иначе
			СохранитьПланПодразделенияПродолжение(КодВозвратаДиалога.Да, Неопределено);
		КонецЕсли; 
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПланРабот(Команда)
	ПланРабот = Неопределено;
	ОбновитьЗаголовокКнопкиПланРабот();
	Элементы.ОтобразитьНезапланированныеРемонты.Видимость = Ложь;
	Элементы.НезапланированныеРемонтыГруппа.Видимость	  = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПланРабот(Команда)
	Если ЗначениеЗаполнено(ПланРабот) Тогда
		ОткрытьЗначение(ПланРабот);
	Иначе
		ОткрытьФорму("Документ.торо_ПланРаботПодразделения.Форма.ФормаВыбора",Новый Структура("Отбор", Новый Структура("Проведен", Истина)), ЭтаФорма);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсе(Команда)
	
	Если Элементы.РемонтыТаблицаИДиаграмма.ТекущаяСтраница = Элементы.ДиаграммаРемонтов  Тогда
		Для каждого ТочкаДиаграммыГанта Из ДиаграммаГантаПодразделения.Точки Цикл
			ДиаграммаГантаПодразделения.СвернутьТочку(ТочкаДиаграммыГанта, Истина);
		КонецЦикла;
	Иначе
		СвернутьДерево();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсе(Команда)
	
	Если Элементы.РемонтыТаблицаИДиаграмма.ТекущаяСтраница = Элементы.ДиаграммаРемонтов  Тогда
		Для каждого ТочкаДиаграммыГанта Из ДиаграммаГантаПодразделения.Точки Цикл
			ДиаграммаГантаПодразделения.РазвернутьТочку(ТочкаДиаграммыГанта, Истина);
		КонецЦикла;    
	Иначе
		РазвернутьДерево();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтображениеЛегенды(Команда)
	
	Элементы.ОтображениеЛегенды.Пометка = НЕ Элементы.ОтображениеЛегенды.Пометка;
	Элементы.ГруппаЛегенда.Видимость = Элементы.ОтображениеЛегенды.Пометка;

КонецПроцедуры

&НаКлиенте
Процедура ПечатьПланаРабот(Команда)
	
	ДатаОкончания = ОбщегоНазначенияУТКлиентСервер.РассчитатьДатуОкончанияПериода(ДатаОтсчета, Периодичность, КоличествоПериодов);
	
	СтруктураПараметр = Новый Структура("ДокППР");
	СтруктураПараметр.Вставить("ВидПлана",					  ВидПлана);
	СтруктураПараметр.Вставить("ПланРабот",					  ПланРабот);
	СтруктураПараметр.Вставить("ДатаНачала", 				  ДатаОтсчета);
	СтруктураПараметр.Вставить("ДатаОкончания", 			  ДатаОкончания);
	СтруктураПараметр.Вставить("ИнтервалРазбиения", 		  Детализация);
	СтруктураПараметр.Вставить("КлючНазначенияИспользования", "ПАРАМЕТРЫ_ПЕЧАТИ_ОбщийПланРабот");
	
	ОткрытьФорму("Обработка.торо_ОбщийПланРабот.Форма.ФормаВводаПериода", СтруктураПараметр);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте 
Процедура СохранитьПланПодразделенияПродолжение(Результат, ИмеющийсяПланРабот) Экспорт
	
	Отказ = Ложь;
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		СохранитьПланНаСервере(ИмеющийсяПланРабот, Отказ);
	Иначе
		СохранитьПланНаСервере(, Отказ);
	КонецЕсли;	
	
	Если Не Отказ Тогда
		
		ДеревоРемонты.ПолучитьЭлементы().Очистить();
		
		СтруктураДанныхПервогоУровня = Новый Структура();
		СтруктураДанныхВторогоУровня = Новый Структура();
		СтруктураДанныхУровеньДанные = Новый Структура();
		
		ПроставитьСвойстваОтображенияВСтруктурах(СтруктураДанныхПервогоУровня, СтруктураДанныхВторогоУровня, СтруктураДанныхУровеньДанные);
		
		ЗаполнитьСписокРемонтовНаСервере(СтруктураДанныхПервогоУровня, СтруктураДанныхВторогоУровня, СтруктураДанныхУровеньДанные);
		
		РазвернутьДерево();
		
		ОбновитьЗаголовокКнопкиПланРабот();
		
	КонецЕсли;
	
КонецПроцедуры
 
&НаСервереБезКонтекста 
Функция НаУказанныйПериодУжеИмеютсяДокументы(ПланРабот, Организация, ВидПлана, ДатаОтсчета, Периодичность, КоличествоПериодов)
	
	Запрос = Новый Запрос;
	# Область ТекстЗапроса
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_ПланРаботПодразделения.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.торо_ПланРаботПодразделения КАК торо_ПланРаботПодразделения
	               |ГДЕ
	               |	НЕ торо_ПланРаботПодразделения.ПометкаУдаления
	               |	И НЕ торо_ПланРаботПодразделения.Ссылка = &Ссылка
	               |	И торо_ПланРаботПодразделения.ОрганизацияПлана = &Организация
	               |	И торо_ПланРаботПодразделения.ВидПлана = &ВидПлана
	               |	И торо_ПланРаботПодразделения.ДатаОтсчета = &ДатаОтсчета
	               |	И торо_ПланРаботПодразделения.ПериодичностьПланирования = &ПериодичностьПланирования
	               |	И торо_ПланРаботПодразделения.КоличествоПериодов = &КоличествоПериодов
	               |	И торо_ПланРаботПодразделения.Проведен";
	# КонецОбласти
	Запрос.УстановитьПараметр("Ссылка"                   , ПланРабот);
    Запрос.УстановитьПараметр("Организация"              , Организация);
    Запрос.УстановитьПараметр("ВидПлана"                 , ВидПлана);
    Запрос.УстановитьПараметр("ДатаОтсчета"              , ДатаОтсчета);
    Запрос.УстановитьПараметр("ПериодичностьПланирования", Периодичность);
    Запрос.УстановитьПараметр("КоличествоПериодов"       , КоличествоПериодов);

	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Возврат Выборка.Ссылка;	
		КонецЦикла; 
	КонецЕсли; 
	
	Возврат Неопределено;
	
КонецФункции
 
&НаСервере
Процедура ЗаполнитьСписокРемонтовНаСервере(СтруктураДанныхПервогоУровня, СтруктураДанныхВторогоУровня, СтруктураДанныхУровеньДанные, ВыводСНезапланированными = Ложь)
	
	ДатаОкончания = ОбщегоНазначенияУТКлиентСервер.РассчитатьДатуОкончанияПериода(ДатаОтсчета, Периодичность, КоличествоПериодов);
	
	Запрос = Новый Запрос;
	
	Если Не ЗначениеЗаполнено(ПланРабот) ИЛИ ВыводСНезапланированными Тогда
		# Область ТекстЗапроса
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_АктуальныеПлановыеДатыРемонтов.IDРемонта КАК IDРемонта,
		|	торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала КАК ДатаНачала,
		|	торо_АктуальныеПлановыеДатыРемонтов.ДатаОкончания КАК ДатаОкончания,
		|	торо_АктуальныеПлановыеДатыРемонтов.КрайняяДатаЗавершения КАК КрайняяДатаЗавершения,
		|	торо_АктуальныеПлановыеДатыРемонтов.ДокументОснование КАК ДокументОснование,
		|	торо_АктуальныеПлановыеДатыРемонтов.ДокументНачалаЦепочки КАК ДокументНачалаЦепочки,
		|	торо_АктуальныеПлановыеДатыРемонтов.ОбъектРемонта КАК ОбъектРемонта,
		|	""ППР"" КАК ИсточникДанных
		|ПОМЕСТИТЬ ВТ_АктуальныеДаты
		|ИЗ
		|	РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК торо_АктуальныеПлановыеДатыРемонтов
		|ГДЕ
		|	&ПоказыватьРемонтыППР
		|	И торо_АктуальныеПлановыеДатыРемонтов.ДокументНачалаЦепочки ССЫЛКА Документ.торо_ПланГрафикРемонта
		|	И торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала >= &НачалоПериода
		|	И торо_АктуальныеПлановыеДатыРемонтов.ДатаОкончания <= &ОкончаниеПериода
		|	И (НЕ &ИспользоватьОтборПоОР
		|			ИЛИ торо_АктуальныеПлановыеДатыРемонтов.ОбъектРемонта В (&ОбъектРемонта))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_АктуальныеПлановыеДатыРемонтов.IDРемонта,
		|	торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала,
		|	торо_АктуальныеПлановыеДатыРемонтов.ДатаОкончания,
		|	торо_АктуальныеПлановыеДатыРемонтов.КрайняяДатаЗавершения,
		|	торо_АктуальныеПлановыеДатыРемонтов.ДокументОснование,
		|	торо_АктуальныеПлановыеДатыРемонтов.ДокументНачалаЦепочки,
		|	торо_АктуальныеПлановыеДатыРемонтов.ОбъектРемонта,
		|	""РМ""
		|ИЗ
		|	РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК торо_АктуальныеПлановыеДатыРемонтов
		|ГДЕ
		|	&ПоказыватьРемонтыРегламентные
		|	И торо_АктуальныеПлановыеДатыРемонтов.ДокументНачалаЦепочки ССЫЛКА Документ.торо_ГрафикРегламентныхМероприятийТОиР
		|	И торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала >= &НачалоПериода
		|	И торо_АктуальныеПлановыеДатыРемонтов.ДатаОкончания <= &ОкончаниеПериода
		|	И (НЕ &ИспользоватьОтборПоОР
		|			ИЛИ торо_АктуальныеПлановыеДатыРемонтов.ОбъектРемонта В (&ОбъектРемонта))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_АктуальныеПлановыеДатыРемонтов.IDРемонта,
		|	торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала,
		|	торо_АктуальныеПлановыеДатыРемонтов.ДатаОкончания,
		|	торо_АктуальныеПлановыеДатыРемонтов.КрайняяДатаЗавершения,
		|	торо_АктуальныеПлановыеДатыРемонтов.ДокументОснование,
		|	торо_АктуальныеПлановыеДатыРемонтов.ДокументНачалаЦепочки,
		|	торо_АктуальныеПлановыеДатыРемонтов.ОбъектРемонта,
		|	""СПД""
		|ИЗ
		|	РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК торо_АктуальныеПлановыеДатыРемонтов
		|ГДЕ
		|	&ПоказыватьДефекты
		|	И торо_АктуальныеПлановыеДатыРемонтов.ДокументНачалаЦепочки ССЫЛКА Документ.торо_ВыявленныеДефекты
		|	И торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала >= &НачалоПериода
		|	И торо_АктуальныеПлановыеДатыРемонтов.ДатаОкончания <= &ОкончаниеПериода
		|	И (НЕ &ИспользоватьОтборПоОР
		|			ИЛИ торо_АктуальныеПлановыеДатыРемонтов.ОбъектРемонта В (&ОбъектРемонта))
		|	И НЕ торо_АктуальныеПлановыеДатыРемонтов.ДокументОснование ССЫЛКА Документ.торо_ВыявленныеДефекты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_АктуальныеПлановыеДатыРемонтов.IDРемонта,
		|	торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала,
		|	торо_АктуальныеПлановыеДатыРемонтов.ДатаОкончания,
		|	торо_АктуальныеПлановыеДатыРемонтов.КрайняяДатаЗавершения,
		|	торо_АктуальныеПлановыеДатыРемонтов.ДокументОснование,
		|	торо_АктуальныеПлановыеДатыРемонтов.ДокументНачалаЦепочки,
		|	торо_АктуальныеПлановыеДатыРемонтов.ОбъектРемонта,
		|	""СПВО""
		|ИЗ
		|	РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК торо_АктуальныеПлановыеДатыРемонтов
		|ГДЕ
		|	&ПоказыватьВнешниеОснования
		|	И торо_АктуальныеПлановыеДатыРемонтов.ДокументНачалаЦепочки ССЫЛКА Документ.торо_ВнешнееОснованиеДляРабот
		|	И торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала >= &НачалоПериода
		|	И торо_АктуальныеПлановыеДатыРемонтов.ДатаОкончания <= &ОкончаниеПериода
		|	И (НЕ &ИспользоватьОтборПоОР
		|			ИЛИ торо_АктуальныеПлановыеДатыРемонтов.ОбъектРемонта В (&ОбъектРемонта))
		|	И НЕ торо_АктуальныеПлановыеДатыРемонтов.ДокументОснование ССЫЛКА Документ.торо_ВыявленныеДефекты
		|	И НЕ торо_АктуальныеПлановыеДатыРемонтов.ДокументОснование ССЫЛКА Документ.торо_ВнешнееОснованиеДляРабот
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОбъектРемонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_АктуальныеДаты.IDРемонта КАК IDРемонта,
		|	ВТ_АктуальныеДаты.ДатаНачала КАК ДатаНачала,
		|	ВТ_АктуальныеДаты.ДатаОкончания КАК ДатаОкончания,
		|	ВТ_АктуальныеДаты.КрайняяДатаЗавершения КАК КрайняяДатаЗавершения,
		|	ВТ_АктуальныеДаты.ДокументОснование КАК ДокументОснование,
		|	ВТ_АктуальныеДаты.ДокументНачалаЦепочки КАК ДокументНачалаЦепочки,
		|	ВТ_АктуальныеДаты.ОбъектРемонта КАК ОбъектРемонта,
		|	ВТ_АктуальныеДаты.ИсточникДанных КАК ИсточникДанных,
		|	ВЫБОР
		|		КОГДА торо_ОбъектыРемонта.ВнешнийОбъект
		|			ТОГДА торо_ОбъектыРемонта.Контрагент
		|		ИНАЧЕ торо_ОбъектыРемонта.Подразделение
		|	КОНЕЦ КАК ВладелецОР,
		|	торо_ОбъектыРемонта.Приоритет КАК КритичностьОборудования,
		|	ЛОЖЬ КАК Регламентный
		|ПОМЕСТИТЬ ВТ_АктульныеДатыСОтборомОР
		|ИЗ
		|	ВТ_АктуальныеДаты КАК ВТ_АктуальныеДаты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|		ПО ВТ_АктуальныеДаты.ОбъектРемонта = торо_ОбъектыРемонта.Ссылка
		|ГДЕ
		|	(НЕ &ИспользоватьОтборПоВладельцу
		|			ИЛИ (торо_ОбъектыРемонта.ВнешнийОбъект
		|					И торо_ОбъектыРемонта.Контрагент В (&Владелец)
		|				ИЛИ торо_ОбъектыРемонта.Подразделение В (&Владелец)))
		|	И (торо_ОбъектыРемонта.Организация = &Организация
		|			ИЛИ &ИспользоватьОтборПоВсемОрганизациям)
		|	И НЕ ВТ_АктуальныеДаты.ДокументНачалаЦепочки.Организация ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_АктуальныеДаты.IDРемонта,
		|	ВТ_АктуальныеДаты.ДатаНачала,
		|	ВТ_АктуальныеДаты.ДатаОкончания,
		|	ВТ_АктуальныеДаты.КрайняяДатаЗавершения,
		|	ВТ_АктуальныеДаты.ДокументОснование,
		|	ВТ_АктуальныеДаты.ДокументНачалаЦепочки,
		|	ВТ_АктуальныеДаты.ОбъектРемонта,
		|	ВТ_АктуальныеДаты.ИсточникДанных,
		|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.торо_ПриоритетыОбъектовРемонта.ПустаяСсылка),
		|	ИСТИНА
		|ИЗ
		|	ВТ_АктуальныеДаты КАК ВТ_АктуальныеДаты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_СписокОбъектовРегламентногоМероприятия КАК торо_СписокОбъектовРегламентногоМероприятия
		|		ПО ВТ_АктуальныеДаты.ОбъектРемонта = торо_СписокОбъектовРегламентногоМероприятия.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ГрафикРегламентныхМероприятийТОиР КАК торо_ГрафикРегламентныхМероприятийТОиР
		|		ПО ВТ_АктуальныеДаты.ДокументНачалаЦепочки = торо_ГрафикРегламентныхМероприятийТОиР.Ссылка
		|ГДЕ
		|	(НЕ &ИспользоватьОтборПоВладельцу
		|			ИЛИ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) В (&Владелец))
		|	И (торо_ГрафикРегламентныхМероприятийТОиР.Организация = &Организация
		|			ИЛИ &ИспользоватьОтборПоВсемОрганизациям)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	IDРемонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ОтмененныеРемонтыСрезПоследних.ID КАК ID
		|ПОМЕСТИТЬ ВТ_ОтмененныеРемонты
		|ИЗ
		|	РегистрСведений.торо_ОтмененныеРемонты.СрезПоследних(
		|			,
		|			ID В
		|				(ВЫБРАТЬ
		|					ВТ_АктульныеДатыСОтборомОР.IDРемонта КАК IDРемонта
		|				ИЗ
		|					ВТ_АктульныеДатыСОтборомОР КАК ВТ_АктульныеДатыСОтборомОР)) КАК торо_ОтмененныеРемонтыСрезПоследних
		|ГДЕ
		|	торо_ОтмененныеРемонтыСрезПоследних.Отменен
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_АктульныеДатыСОтборомОР.IDРемонта КАК IDРемонта,
		|	ВТ_АктульныеДатыСОтборомОР.ДатаНачала КАК ДатаНачала,
		|	ВТ_АктульныеДатыСОтборомОР.ДатаОкончания КАК ДатаОкончания,
		|	ВТ_АктульныеДатыСОтборомОР.КрайняяДатаЗавершения КАК КрайняяДатаЗавершения,
		|	ВТ_АктульныеДатыСОтборомОР.ДокументОснование КАК ДокументОснование,
		|	ВТ_АктульныеДатыСОтборомОР.ДокументНачалаЦепочки КАК ДокументНачалаЦепочки,
		|	ВТ_АктульныеДатыСОтборомОР.ОбъектРемонта КАК ОбъектРемонта,
		|	ВТ_АктульныеДатыСОтборомОР.ИсточникДанных КАК ИсточникДанных,
		|	ВТ_АктульныеДатыСОтборомОР.ВладелецОР КАК ВладелецОР,
		|	ВТ_АктульныеДатыСОтборомОР.КритичностьОборудования КАК КритичностьОборудования,
		|	ВТ_АктульныеДатыСОтборомОР.Регламентный КАК Регламентный
		|ПОМЕСТИТЬ ВТ_НеотмененныеРемонты
		|ИЗ
		|	ВТ_АктульныеДатыСОтборомОР КАК ВТ_АктульныеДатыСОтборомОР
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтмененныеРемонты КАК ВТ_ОтмененныеРемонты
		|		ПО ВТ_АктульныеДатыСОтборомОР.IDРемонта = ВТ_ОтмененныеРемонты.ID
		|ГДЕ
		|	ВТ_ОтмененныеРемонты.ID ЕСТЬ NULL
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	IDРемонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ID КАК ID,
		|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
		|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
		|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Исполнитель КАК Исполнитель,
		|	ЗНАЧЕНИЕ(Справочник.торо_РемонтныеБригады.ПустаяСсылка) КАК УточнениеИсполнителя
		|ПОМЕСТИТЬ ВТ_ППР
		|ИЗ
		|	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(
		|			,
		|			&ПоказыватьРемонтыППР
		|				И ID В
		|					(ВЫБРАТЬ
		|						ВТ_ИДРемонтов.IDРемонта
		|					ИЗ
		|						ВТ_НеотмененныеРемонты КАК ВТ_ИДРемонтов)
		|				И (НЕ &ИспользоватьОтборПоВР
		|					ИЛИ ВидРемонтныхРабот В (&ВидыРемонтов))) КАК торо_ПлановыеРемонтныеРаботыСрезПоследних
		|ГДЕ
		|	НЕ торо_ПлановыеРемонтныеРаботыСрезПоследних.Замещен
		|	И НЕ торо_ПлановыеРемонтныеРаботыСрезПоследних.Отменен
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_РемонтыСрезПоследних.ID КАК ID,
		|	торо_РемонтыСрезПоследних.ВидРемонта КАК ВидРемонта
		|ПОМЕСТИТЬ ВТ_ВидыРемонтаВОиВД
		|ИЗ
		|	РегистрСведений.торо_Ремонты.СрезПоследних(
		|			,
		|			ID В
		|					(ВЫБРАТЬ
		|						ВТ_НеотмененныеРемонты.IDРемонта КАК IDРемонта
		|					ИЗ
		|						ВТ_НеотмененныеРемонты КАК ВТ_НеотмененныеРемонты
		|					ГДЕ
		|						ВТ_НеотмененныеРемонты.ИсточникДанных В (""СПД"", ""СПВО""))
		|				И Регистратор ССЫЛКА Документ.торо_ЗаявкаНаРемонт) КАК торо_РемонтыСрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ВыявленныеДефектыСрезПоследних.ID КАК ID,
		|	торо_ВыявленныеДефектыСрезПоследних.КритичностьДефекта КАК КритичностьДефекта
		|ПОМЕСТИТЬ ВТ_ДефектыКритичность
		|ИЗ
		|	РегистрСведений.торо_ВыявленныеДефекты.СрезПоследних(
		|			,
		|			ID В
		|				(ВЫБРАТЬ
		|					ВТ_НеотмененныеРемонты.IDРемонта КАК IDРемонта
		|				ИЗ
		|					ВТ_НеотмененныеРемонты КАК ВТ_НеотмененныеРемонты)) КАК торо_ВыявленныеДефектыСрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ЗаявкиПоРемонтамСрезПоследних.Регистратор КАК Заявка,
		|	торо_ЗаявкиПоРемонтамСрезПоследних.IDРемонта КАК IDРемонта,
		|	ВЫБОР
		|		КОГДА торо_ЗаявкиПоРемонтамСрезПоследних.Исполнитель = НЕОПРЕДЕЛЕНО
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|		ИНАЧЕ торо_ЗаявкиПоРемонтамСрезПоследних.Исполнитель
		|	КОНЕЦ КАК Исполнитель,
		|	ВЫБОР
		|		КОГДА торо_ЗаявкиПоРемонтамСрезПоследних.УточнениеИсполнителя = НЕОПРЕДЕЛЕНО
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.торо_РемонтныеБригады.ПустаяСсылка)
		|		ИНАЧЕ торо_ЗаявкиПоРемонтамСрезПоследних.УточнениеИсполнителя
		|	КОНЕЦ КАК УточнениеИсполнителя
		|ПОМЕСТИТЬ ВТ_ЗаявкиВсе
		|ИЗ
		|	РегистрСведений.торо_ЗаявкиПоРемонтам.СрезПоследних(
		|			,
		|			IDРемонта В
		|				(ВЫБРАТЬ
		|					ВТ_НеотмененныеРемонты.IDРемонта КАК IDРемонта
		|				ИЗ
		|					ВТ_НеотмененныеРемонты КАК ВТ_НеотмененныеРемонты)) КАК торо_ЗаявкиПоРемонтамСрезПоследних
		|ГДЕ
		|	НЕ торо_ЗаявкиПоРемонтамСрезПоследних.Отменен
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Заявка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ЗаявкиВсе.IDРемонта КАК IDРемонта,
		|	ВТ_ЗаявкиВсе.Исполнитель КАК Исполнитель,
		|	ВТ_ЗаявкиВсе.УточнениеИсполнителя КАК УточнениеИсполнителя,
		|	ВТ_ЗаявкиВсе.Заявка КАК Заявка
		|ПОМЕСТИТЬ ВТ_НеотмененныеЗаявкиИсполнители
		|ИЗ
		|	ВТ_ЗаявкиВсе КАК ВТ_ЗаявкиВсе
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОтмененныеЗаявки КАК торо_ОтмененныеЗаявки
		|		ПО ВТ_ЗаявкиВсе.Заявка = торо_ОтмененныеЗаявки.Заявка
		|			И ВТ_ЗаявкиВсе.IDРемонта = торо_ОтмененныеЗаявки.ИДРемонта
		|ГДЕ
		|	торо_ОтмененныеЗаявки.Заявка ЕСТЬ NULL
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	IDРемонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	торо_НарядыПоРемонтам.IDРемонта КАК IDРемонта
		|ПОМЕСТИТЬ ВТ_Наряды
		|ИЗ
		|	РегистрСведений.торо_НарядыПоРемонтам КАК торо_НарядыПоРемонтам
		|ГДЕ
		|	торо_НарядыПоРемонтам.IDРемонта В
		|			(ВЫБРАТЬ
		|				ВТ_НеотмененныеРемонты.IDРемонта КАК IDРемонта
		|			ИЗ
		|				ВТ_НеотмененныеРемонты КАК ВТ_НеотмененныеРемонты)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	IDРемонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	торо_АктыПоРемонтам.IDРемонта КАК IDРемонта
		|ПОМЕСТИТЬ ВТ_Акты
		|ИЗ
		|	РегистрСведений.торо_АктыПоРемонтам КАК торо_АктыПоРемонтам
		|ГДЕ
		|	торо_АктыПоРемонтам.IDРемонта В
		|			(ВЫБРАТЬ
		|				ВТ_НеотмененныеРемонты.IDРемонта КАК IDРемонта
		|			ИЗ
		|				ВТ_НеотмененныеРемонты КАК ВТ_НеотмененныеРемонты)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	IDРемонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	торо_ОстановочныеРемонтыСрезПоследних.IDЗависимого КАК ID_Ремонта
		|ПОМЕСТИТЬ ВТ_Остановочные
		|ИЗ
		|	РегистрСведений.торо_ОстановочныеРемонты.СрезПоследних(
		|			,
		|			IDЗависимого В
		|				(ВЫБРАТЬ
		|					ВТ_НеотмененныеРемонты.IDРемонта КАК IDРемонта
		|				ИЗ
		|					ВТ_НеотмененныеРемонты КАК ВТ_НеотмененныеРемонты)) КАК торо_ОстановочныеРемонтыСрезПоследних
		|ГДЕ
		|	НЕ торо_ОстановочныеРемонтыСрезПоследних.Отвязан
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID_Ремонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВТ_ППР.ID КАК ID_Ремонта,
		|	ВТ_ППР.ОбъектРемонтныхРабот КАК ОбъектРемонта,
		|	ВТ_ППР.ВидРемонтныхРабот КАК ВидРемонта,
		|	ВЫБОР
		|		КОГДА &ГруппироватьПоИсполнителю
		|			ТОГДА ЕСТЬNULL(ВТ_Заявки.Исполнитель, ВТ_ППР.Исполнитель)
		|		ИНАЧЕ NULL
		|	КОНЕЦ КАК Исполнитель,
		|	ВЫБОР
		|		КОГДА &ГруппироватьПоИсполнителю
		|			ТОГДА ЕСТЬNULL(ВТ_Заявки.УточнениеИсполнителя, ВТ_ППР.УточнениеИсполнителя)
		|		ИНАЧЕ NULL
		|	КОНЕЦ КАК УточнениеИсполнителя,
		|	ВТ_Заявки.Заявка КАК Заявка,
		|	ВЫБОР
		|		КОГДА ВТ_Заявки.Заявка ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьЗаявка
		|ПОМЕСТИТЬ ВТ_РемонтыСОтборомПоИсполнителю
		|ИЗ
		|	ВТ_ППР КАК ВТ_ППР
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НеотмененныеЗаявкиИсполнители КАК ВТ_Заявки
		|		ПО ВТ_ППР.ID = ВТ_Заявки.IDРемонта
		|ГДЕ
		|	(НЕ &ИспользоватьОтборПоИсполнителю
		|			ИЛИ ВТ_Заявки.Исполнитель В (&Исполнители)
		|			ИЛИ ВТ_ППР.Исполнитель В (&Исполнители))
		|	И (НЕ &ИспользоватьОтборПоУточнениюИсполнителя
		|			ИЛИ ВТ_Заявки.УточнениеИсполнителя В (&УточнениеИсполнителя))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_ПлановыеМероприятияСрезПоследних.ID,
		|	торо_ПлановыеМероприятияСрезПоследних.СписокОбъектов,
		|	торо_ПлановыеМероприятияСрезПоследних.ВидМероприятия,
		|	ВЫБОР
		|		КОГДА &ГруппироватьПоИсполнителю
		|			ТОГДА торо_ПлановыеМероприятияСрезПоследних.Исполнитель
		|		ИНАЧЕ NULL
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ГруппироватьПоИсполнителю
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.торо_РемонтныеБригады.ПустаяСсылка)
		|		ИНАЧЕ NULL
		|	КОНЕЦ,
		|	NULL,
		|	ЛОЖЬ
		|ИЗ
		|	РегистрСведений.торо_ПлановыеМероприятия.СрезПоследних(
		|			,
		|			&ПоказыватьРемонтыРегламентные
		|				И ID В
		|					(ВЫБРАТЬ
		|						ВТ_ИДРемонтов.IDРемонта
		|					ИЗ
		|						ВТ_НеотмененныеРемонты КАК ВТ_ИДРемонтов)
		|				И (НЕ &ИспользоватьОтборПоВР
		|					ИЛИ ВидМероприятия В (&ВидыРемонтов))
		|				И ВЫБОР
		|					КОГДА &ИспользоватьОтборПоУточнениюИсполнителя
		|						ТОГДА ЗНАЧЕНИЕ(Справочник.торо_РемонтныеБригады.ПустаяСсылка) В (&УточнениеИсполнителя)
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК торо_ПлановыеМероприятияСрезПоследних
		|ГДЕ
		|	НЕ торо_ПлановыеМероприятияСрезПоследних.Отменен
		|	И (НЕ &ИспользоватьОтборПоИсполнителю
		|			ИЛИ торо_ПлановыеМероприятияСрезПоследних.Исполнитель В (&Исполнители))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_НеотмененныеРемонты.IDРемонта,
		|	ВТ_НеотмененныеРемонты.ОбъектРемонта,
		|	ВТ_ВидыРемонтаВОиВД.ВидРемонта,
		|	ВЫБОР
		|		КОГДА &ГруппироватьПоИсполнителю
		|			ТОГДА ВТ_Заявки.Исполнитель
		|		ИНАЧЕ NULL
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ГруппироватьПоИсполнителю
		|			ТОГДА ВТ_Заявки.УточнениеИсполнителя
		|		ИНАЧЕ NULL
		|	КОНЕЦ,
		|	ВТ_Заявки.Заявка,
		|	ИСТИНА
		|ИЗ
		|	ВТ_НеотмененныеРемонты КАК ВТ_НеотмененныеРемонты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВидыРемонтаВОиВД КАК ВТ_ВидыРемонтаВОиВД
		|		ПО ВТ_НеотмененныеРемонты.IDРемонта = ВТ_ВидыРемонтаВОиВД.ID
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НеотмененныеЗаявкиИсполнители КАК ВТ_Заявки
		|		ПО ВТ_НеотмененныеРемонты.IDРемонта = ВТ_Заявки.IDРемонта
		|ГДЕ
		|	(НЕ &ИспользоватьОтборПоИсполнителю
		|			ИЛИ ВТ_Заявки.Исполнитель В (&Исполнители))
		|	И (НЕ &ИспользоватьОтборПоУточнениюИсполнителя
		|			ИЛИ ВТ_Заявки.УточнениеИсполнителя В (&УточнениеИсполнителя))
		|	И (НЕ &ИспользоватьОтборПоВР
		|			ИЛИ ВТ_ВидыРемонтаВОиВД.ВидРемонта В (&ВидыРемонтов))
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID_Ремонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_СкользящийПлан.ID_Ремонта КАК ID_Ремонта,
		|	торо_СкользящийПлан.Регистратор КАК ПланРабот,
		|	ВЫБОР
		|		КОГДА торо_СкользящийПлан.ВидПлана = &ВидПлана
		|			ТОГДА торо_СкользящийПлан.ДатаНачалаРемонта >= торо_СкользящийПлан.ДатаНачалаБазовогоПериода
		|					И торо_СкользящийПлан.ДатаНачалаРемонта <= торо_СкользящийПлан.ДатаОкончанияБазовогоПериода
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ВБазовомПериоде
		|ПОМЕСТИТЬ ТаблицаИмеющихсяПлановРазвернутая
		|ИЗ
		|	РегистрСведений.торо_СкользящийПланРабот.СрезПоследних(
		|			,
		|			ID_Ремонта В
		|				(ВЫБРАТЬ
		|					ВТ_НеотмененныеРемонты.IDРемонта КАК IDРемонта
		|				ИЗ
		|					ВТ_НеотмененныеРемонты КАК ВТ_НеотмененныеРемонты)) КАК торо_СкользящийПлан
		|ГДЕ
		|	торо_СкользящийПлан.ВидПлана В(&ВидыПлана)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_СкользящийПлан.ID_Ремонта,
		|	торо_СкользящийПлан.Регистратор,
		|	ВЫБОР
		|		КОГДА торо_СкользящийПлан.ВидПлана = &ВидПлана
		|			ТОГДА торо_СкользящийПлан.ДатаНачалаРемонта >= торо_СкользящийПлан.ДатаНачалаБазовогоПериода
		|					И торо_СкользящийПлан.ДатаНачалаРемонта <= торо_СкользящийПлан.ДатаОкончанияБазовогоПериода
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|ИЗ
		|	РегистрСведений.торо_СкользящийПланРегламентныхМероприятий.СрезПоследних(
		|			,
		|			ID_Ремонта В
		|				(ВЫБРАТЬ
		|					ВТ_НеотмененныеРемонты.IDРемонта КАК IDРемонта
		|				ИЗ
		|					ВТ_НеотмененныеРемонты КАК ВТ_НеотмененныеРемонты)) КАК торо_СкользящийПлан
		|ГДЕ
		|	торо_СкользящийПлан.ВидПлана В(&ВидыПлана)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID_Ремонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаИмеющихсяПлановРазвернутая.ID_Ремонта КАК ID_Ремонта,
		|	ТаблицаИмеющихсяПлановРазвернутая.ПланРабот КАК ПланРабот
		|ПОМЕСТИТЬ ТаблицаИмеющихсяПланов
		|ИЗ
		|	ТаблицаИмеющихсяПлановРазвернутая КАК ТаблицаИмеющихсяПлановРазвернутая
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID_Ремонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаИмеющихсяПлановРазвернутая.ID_Ремонта КАК ID_Ремонта
		|ПОМЕСТИТЬ РемонтыБазовогоПлана
		|ИЗ
		|	ТаблицаИмеющихсяПлановРазвернутая КАК ТаблицаИмеющихсяПлановРазвернутая
		|ГДЕ
		|	ТаблицаИмеющихсяПлановРазвернутая.ВБазовомПериоде
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID_Ремонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ПланРаботПодразделенияСписокРемонтовПлана.ID КАК IDРемонта
		|ПОМЕСТИТЬ ВТ_РемонтыПлана
		|ИЗ
		|	Документ.торо_ПланРаботПодразделения.СписокРемонтовПлана КАК торо_ПланРаботПодразделенияСписокРемонтовПлана
		|ГДЕ
		|	торо_ПланРаботПодразделенияСписокРемонтовПлана.Ссылка = &ПланРабот
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	IDРемонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РемонтыСОтборомПоИсполнителю.ID_Ремонта КАК ID_Ремонта,
		|	ВТ_РемонтыСОтборомПоИсполнителю.ОбъектРемонта КАК ОбъектРемонта,
		|	ВТ_РемонтыСОтборомПоИсполнителю.ВидРемонта КАК ВидРемонта,
		|	ВТ_РемонтыСОтборомПоИсполнителю.Исполнитель КАК Исполнитель,
		|	ВТ_РемонтыСОтборомПоИсполнителю.УточнениеИсполнителя КАК УточнениеИсполнителя,
		|	ВТ_РемонтыСОтборомПоИсполнителю.Заявка КАК Заявка,
		|	ВТ_НеотмененныеРемонты.ДатаНачала КАК ДатаНачала,
		|	ВТ_НеотмененныеРемонты.ДатаОкончания КАК ДатаОкончания,
		|	ВТ_НеотмененныеРемонты.КрайняяДатаЗавершения КАК КрайняяДатаЗавершения,
		|	ВТ_НеотмененныеРемонты.ДатаНачала КАК ДатаНачалаИсходная,
		|	ВТ_НеотмененныеРемонты.ДатаОкончания КАК ДатаОкончанияИсходная,
		|	ВТ_НеотмененныеРемонты.КрайняяДатаЗавершения КАК КрайняяДатаЗавершенияИсходная,
		|	ВТ_НеотмененныеРемонты.ДокументОснование КАК ДокументПлановыхДат,
		|	ВТ_НеотмененныеРемонты.ДокументНачалаЦепочки КАК ДокументОснование,
		|	ВТ_НеотмененныеРемонты.ИсточникДанных КАК ИсточникДанных,
		|	ВТ_НеотмененныеРемонты.ВладелецОР КАК ВладелецОР,
		|	ВТ_НеотмененныеРемонты.КритичностьОборудования КАК КритичностьОборудования,
		|	ВТ_ДефектыКритичность.КритичностьДефекта КАК КритичностьДефекта,
		|	ВТ_НеотмененныеРемонты.Регламентный КАК Регламентный,
		|	ВТ_РемонтыСОтборомПоИсполнителю.ЕстьЗаявка КАК ЕстьЗаявка,
		|	ВЫБОР
		|		КОГДА ВТ_Наряды.IDРемонта ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьНаряд,
		|	ВЫБОР
		|		КОГДА ВТ_Акты.IDРемонта ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьАкт,
		|	ВЫБОР
		|		КОГДА ВТ_Остановочные.ID_Ремонта ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьОстановочный,
		|	ТаблицаИмеющихсяПланов.ПланРабот КАК ПланПодразделения,
		|	ВЫБОР
		|		КОГДА &ВыделятьНезапланированные И ВТ_РемонтыПлана.IDРемонта ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК НезапланированныйРемонт
		|ИЗ
		|	ВТ_РемонтыСОтборомПоИсполнителю КАК ВТ_РемонтыСОтборомПоИсполнителю
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НеотмененныеРемонты КАК ВТ_НеотмененныеРемонты
		|		ПО ВТ_РемонтыСОтборомПоИсполнителю.ID_Ремонта = ВТ_НеотмененныеРемонты.IDРемонта
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДефектыКритичность КАК ВТ_ДефектыКритичность
		|		ПО ВТ_РемонтыСОтборомПоИсполнителю.ID_Ремонта = ВТ_ДефектыКритичность.ID
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Наряды КАК ВТ_Наряды
		|		ПО ВТ_РемонтыСОтборомПоИсполнителю.ID_Ремонта = ВТ_Наряды.IDРемонта
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Акты КАК ВТ_Акты
		|		ПО ВТ_РемонтыСОтборомПоИсполнителю.ID_Ремонта = ВТ_Акты.IDРемонта
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остановочные КАК ВТ_Остановочные
		|		ПО ВТ_РемонтыСОтборомПоИсполнителю.ID_Ремонта = ВТ_Остановочные.ID_Ремонта
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаИмеющихсяПланов КАК ТаблицаИмеющихсяПланов
		|		ПО ВТ_РемонтыСОтборомПоИсполнителю.ID_Ремонта = ТаблицаИмеющихсяПланов.ID_Ремонта
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РемонтыПлана КАК ВТ_РемонтыПлана
		|		ПО ВТ_РемонтыСОтборомПоИсполнителю.ID_Ремонта = ВТ_РемонтыПлана.IDРемонта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РемонтыБазовогоПлана КАК РемонтыБазовогоПлана
		|		ПО ВТ_РемонтыСОтборомПоИсполнителю.ID_Ремонта = РемонтыБазовогоПлана.ID_Ремонта
		|ГДЕ
		|	&УсловиеПоНезапланированным
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВЫБОР
		|		КОГДА &ПоВидам
		|			ТОГДА ВТ_РемонтыСОтборомПоИсполнителю.ВидРемонта.Наименование
		|		ИНАЧЕ ВТ_РемонтыСОтборомПоИсполнителю.ОбъектРемонта.Наименование
		|	КОНЕЦ,
		|	ВТ_НеотмененныеРемонты.ДатаНачала";
		# КонецОбласти
		
		Если ВыводСНезапланированными Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоНезапланированным",
			      "	(РемонтыБазовогоПлана.ID_Ремонта ЕСТЬ NULL
					|	ИЛИ НЕ ВТ_РемонтыПлана.IDРемонта ЕСТЬ NULL)");
		Иначе
			Запрос.УстановитьПараметр("УсловиеПоНезапланированным", Истина);
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ВыделятьНезапланированные", ВыводСНезапланированными);

	Иначе
		#Область ТекстЗапроса
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ПланРаботПодразделенияСписокРемонтовПлана.ID КАК ID_Ремонта,
		|	торо_ПланРаботПодразделенияСписокРемонтовПлана.ОбъектРемонта КАК ОбъектРемонта,
		|	ВЫРАЗИТЬ(торо_ПланРаботПодразделенияСписокРемонтовПлана.ОбъектРемонта КАК Справочник.торо_ОбъектыРемонта) КАК ОРДляПолученияВладельца,
		|	торо_ПланРаботПодразделенияСписокРемонтовПлана.ВидРемонта КАК ВидРемонта,
		|	торо_ПланРаботПодразделенияСписокРемонтовПлана.ДокументОснование КАК ДокументОснование,
		|	торо_ПланРаботПодразделенияСписокРемонтовПлана.ДатаНачала КАК ДатаНачала,
		|	торо_ПланРаботПодразделенияСписокРемонтовПлана.ДатаОкончания КАК ДатаОкончания,
		|	торо_ПланРаботПодразделенияСписокРемонтовПлана.КрайняяДатаЗавершения КАК КрайняяДатаЗавершения,
		|	торо_ПланРаботПодразделенияСписокРемонтовПлана.ДатаНачалаРемонтаИсходная КАК ДатаНачалаРемонтаИсходная,
		|	торо_ПланРаботПодразделенияСписокРемонтовПлана.ДатаОкончанияРемонтаИсходная КАК ДатаОкончанияРемонтаИсходная,
		|	торо_ПланРаботПодразделенияСписокРемонтовПлана.КрайняяДатаЗавершенияИсходная КАК КрайняяДатаЗавершенияИсходная,
		|	торо_ПланРаботПодразделенияСписокРемонтовПлана.Регламентный КАК Регламентный,
		|	торо_ПланРаботПодразделенияСписокРемонтовПлана.ИсточникДанных КАК ИсточникДанных
		|ПОМЕСТИТЬ вт_СохраненныеДанныеПлана
		|ИЗ
		|	Документ.торо_ПланРаботПодразделения.СписокРемонтовПлана КАК торо_ПланРаботПодразделенияСписокРемонтовПлана
		|ГДЕ
		|	торо_ПланРаботПодразделенияСписокРемонтовПлана.Ссылка = &ПланРабот
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID_Ремонта,
		|	Регламентный
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_ЗаявкиПоРемонтамСрезПоследних.IDРемонта КАК IDРемонта,
		|	торо_ЗаявкиПоРемонтамСрезПоследних.Исполнитель КАК Исполнитель,
		|	торо_ЗаявкиПоРемонтамСрезПоследних.УточнениеИсполнителя КАК УточнениеИсполнителя,
		|	торо_ЗаявкиПоРемонтамСрезПоследних.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ Заявки
		|ИЗ
		|	РегистрСведений.торо_ЗаявкиПоРемонтам.СрезПоследних(
		|			,
		|			Регистратор ССЫЛКА Документ.торо_ЗаявкаНаРемонт
		|				И IDРемонта В
		|					(ВЫБРАТЬ
		|						вт_СохраненныеДанныеПлана.ID_Ремонта КАК ID_Ремонта
		|					ИЗ
		|						вт_СохраненныеДанныеПлана КАК вт_СохраненныеДанныеПлана)) КАК торо_ЗаявкиПоРемонтамСрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	IDРемонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ID КАК ID,
		|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Исполнитель КАК Исполнитель,
		|	ЛОЖЬ КАК Регламентный
		|ПОМЕСТИТЬ ПлановыеРемонты
		|ИЗ
		|	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(
		|			,
		|			ID В
		|				(ВЫБРАТЬ
		|					вт_СохраненныеДанныеПлана.ID_Ремонта КАК ID_Ремонта
		|				ИЗ
		|					вт_СохраненныеДанныеПлана КАК вт_СохраненныеДанныеПлана
		|				ГДЕ
		|					НЕ вт_СохраненныеДанныеПлана.Регламентный)) КАК торо_ПлановыеРемонтныеРаботыСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_ПлановыеМероприятияСрезПоследних.ID,
		|	торо_ПлановыеМероприятияСрезПоследних.Исполнитель,
		|	ИСТИНА
		|ИЗ
		|	РегистрСведений.торо_ПлановыеМероприятия.СрезПоследних(
		|			,
		|			ID В
		|				(ВЫБРАТЬ
		|					вт_СохраненныеДанныеПлана.ID_Ремонта КАК ID_Ремонта
		|				ИЗ
		|					вт_СохраненныеДанныеПлана КАК вт_СохраненныеДанныеПлана
		|				ГДЕ
		|					вт_СохраненныеДанныеПлана.Регламентный)) КАК торо_ПлановыеМероприятияСрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID,
		|	Регламентный
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_ОстановочныеРемонтыСрезПоследних.IDЗависимого КАК IDЗависимого
		|ПОМЕСТИТЬ Остановочный
		|ИЗ
		|	РегистрСведений.торо_ОстановочныеРемонты.СрезПоследних(
		|			,
		|			IDЗависимого В
		|				(ВЫБРАТЬ
		|					вт_СохраненныеДанныеПлана.ID_Ремонта КАК ID_Ремонта
		|				ИЗ
		|					вт_СохраненныеДанныеПлана КАК вт_СохраненныеДанныеПлана)) КАК торо_ОстановочныеРемонтыСрезПоследних
		|ГДЕ
		|	НЕ торо_ОстановочныеРемонтыСрезПоследних.Отвязан
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	IDЗависимого
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ " + ?(ГруппироватьПоИсполнителю = 0, "РАЗЛИЧНЫЕ", "") + "
		|	вт_СохраненныеДанныеПлана.ID_Ремонта КАК ID_Ремонта,
		|	вт_СохраненныеДанныеПлана.ОбъектРемонта КАК ОбъектРемонта,
		|	вт_СохраненныеДанныеПлана.ВидРемонта КАК ВидРемонта,
		|	вт_СохраненныеДанныеПлана.ДокументОснование КАК ДокументОснование,
		|	вт_СохраненныеДанныеПлана.ДатаНачала КАК ДатаНачала,
		|	вт_СохраненныеДанныеПлана.ДатаОкончания КАК ДатаОкончания,
		|	вт_СохраненныеДанныеПлана.КрайняяДатаЗавершения КАК КрайняяДатаЗавершения,
		|	вт_СохраненныеДанныеПлана.ДатаНачалаРемонтаИсходная КАК ДатаНачалаРемонтаИсходная,
		|	вт_СохраненныеДанныеПлана.ДатаОкончанияРемонтаИсходная КАК ДатаОкончанияРемонтаИсходная,
		|	вт_СохраненныеДанныеПлана.КрайняяДатаЗавершенияИсходная КАК КрайняяДатаЗавершенияИсходная,
		|	вт_СохраненныеДанныеПлана.Регламентный КАК Регламентный,
		|	вт_СохраненныеДанныеПлана.ИсточникДанных КАК ИсточникДанных,
		|	ВЫБОР
		|		КОГДА НЕ вт_СохраненныеДанныеПлана.ОРДляПолученияВладельца = ЗНАЧЕНИЕ(Справочник.торо_ОбъектыРемонта.ПустаяСсылка)
		|			ТОГДА ВЫБОР
		|					КОГДА вт_СохраненныеДанныеПлана.ОРДляПолученияВладельца.ВнешнийОбъект
		|						ТОГДА вт_СохраненныеДанныеПлана.ОРДляПолученияВладельца.Контрагент
		|					ИНАЧЕ вт_СохраненныеДанныеПлана.ОРДляПолученияВладельца.Подразделение
		|				КОНЕЦ
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.торо_ОбъектыРемонта.ПустаяСсылка)
		|	КОНЕЦ КАК ВладелецОР,
		|	ВЫБОР
		|		КОГДА Заявки.IDРемонта ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьЗаявка,
		|	ВЫБОР
		|		КОГДА Остановочный.IDЗависимого ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьОстановочный,
		|	ВЫБОР
		|		КОГДА &ГруппироватьПоИсполнителю
		|			ТОГДА ЕСТЬNULL(Заявки.Исполнитель, ЕСТЬNULL(ПлановыеРемонты.Исполнитель, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)))
		|		ИНАЧЕ NULL
		|	КОНЕЦ КАК Исполнитель,
		|	ВЫБОР
		|		КОГДА &ГруппироватьПоИсполнителю
		|			ТОГДА ЕСТЬNULL(Заявки.УточнениеИсполнителя, ЗНАЧЕНИЕ(Справочник.торо_РемонтныеБригады.ПустаяСсылка))
		|		ИНАЧЕ NULL
		|	КОНЕЦ КАК УточнениеИсполнителя,
		|	вт_СохраненныеДанныеПлана.ОРДляПолученияВладельца.Приоритет КАК КритичностьОборудования,
		|	торо_ВыявленныеДефектыСрезПоследних.КритичностьДефекта КАК КритичностьДефекта,
		|	ЕСТЬNULL(Заявки.Регистратор, ЗНАЧЕНИЕ(Документ.торо_ЗаявкаНаРемонт.ПустаяСсылка)) КАК Заявка
		|ПОМЕСТИТЬ вт_Итоговая
		|ИЗ
		|	вт_СохраненныеДанныеПлана КАК вт_СохраненныеДанныеПлана
		|		ЛЕВОЕ СОЕДИНЕНИЕ Заявки КАК Заявки
		|		ПО вт_СохраненныеДанныеПлана.ID_Ремонта = Заявки.IDРемонта
		|		ЛЕВОЕ СОЕДИНЕНИЕ Остановочный КАК Остановочный
		|		ПО вт_СохраненныеДанныеПлана.ID_Ремонта = Остановочный.IDЗависимого
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВыявленныеДефекты.СрезПоследних(
		|				,
		|				ID В
		|					(ВЫБРАТЬ
		|						вт_СохраненныеДанныеПлана.ID_Ремонта КАК ID_Ремонта
		|					ИЗ
		|						вт_СохраненныеДанныеПлана КАК вт_СохраненныеДанныеПлана)) КАК торо_ВыявленныеДефектыСрезПоследних
		|		ПО вт_СохраненныеДанныеПлана.ID_Ремонта = торо_ВыявленныеДефектыСрезПоследних.ID
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПлановыеРемонты КАК ПлановыеРемонты
		|		ПО вт_СохраненныеДанныеПлана.ID_Ремонта = ПлановыеРемонты.ID
		|			И вт_СохраненныеДанныеПлана.Регламентный = ПлановыеРемонты.Регламентный
		|ГДЕ
		|	ВЫБОР
		|		КОГДА вт_СохраненныеДанныеПлана.ИсточникДанных = ""ППР""
		|			ТОГДА &ПоказыватьРемонтыППР
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|	И ВЫБОР
		|		КОГДА вт_СохраненныеДанныеПлана.Регламентный
		|			ТОГДА &ПоказыватьРемонтыРегламентные
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|	И ВЫБОР
		|		КОГДА вт_СохраненныеДанныеПлана.ИсточникДанных = ""СПД""
		|			ТОГДА &ПоказыватьДефекты
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|	И ВЫБОР
		|		КОГДА вт_СохраненныеДанныеПлана.ИсточникДанных = ""СПВО""
		|			ТОГДА &ПоказыватьВнешниеОснования
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|	И (НЕ &ИспользоватьОтборПоВР
		|		ИЛИ вт_СохраненныеДанныеПлана.ВидРемонта В (&ВидыРемонтов))
		|	И (НЕ &ИспользоватьОтборПоОР
		|		ИЛИ вт_СохраненныеДанныеПлана.ОбъектРемонта В (&ОбъектРемонта))
		|	И (НЕ &ИспользоватьОтборПоВладельцу
		|		ИЛИ ВЫБОР
		|				КОГДА вт_СохраненныеДанныеПлана.ОРДляПолученияВладельца.ВнешнийОбъект
		|					ТОГДА вт_СохраненныеДанныеПлана.ОРДляПолученияВладельца.Контрагент В (&Владелец)
		|				ИНАЧЕ вт_СохраненныеДанныеПлана.ОРДляПолученияВладельца.Подразделение В (&Владелец)
		|			КОНЕЦ)
		|	И (НЕ &ИспользоватьОтборПоИсполнителю
		|		ИЛИ Заявки.Исполнитель В (&Исполнители) ИЛИ ПлановыеРемонты.Исполнитель В (&Исполнители))
		|	И (НЕ &ИспользоватьОтборПоУточнениюИсполнителя
		|		ИЛИ Заявки.УточнениеИсполнителя В (&УточнениеИсполнителя))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_Ремонты.Регистратор КАК Регистратор,
		|	торо_Ремонты.ID КАК ID,
		|	торо_Ремонты.ДатаНачалаПлан КАК ДатаНачалаПлан,
		|	торо_Ремонты.ДатаОкончанияПлан КАК ДатаОкончанияПлан
		|ПОМЕСТИТЬ ВТ_РемонтыРегистраторы
		|ИЗ
		|	РегистрСведений.торо_Ремонты КАК торо_Ремонты
		|ГДЕ
		|	торо_Ремонты.ID В
		|			(ВЫБРАТЬ
		|				вт_Итоговая.ID_Ремонта КАК ID_Ремонта
		|			ИЗ
		|				вт_Итоговая КАК вт_Итоговая)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_РемонтыРегистраторы.ID КАК ID
		|ПОМЕСТИТЬ ВТ_НарядыПоРемонтам
		|ИЗ
		|	ВТ_РемонтыРегистраторы КАК ВТ_РемонтыРегистраторы
		|ГДЕ
		|	(ТИПЗНАЧЕНИЯ(ВТ_РемонтыРегистраторы.Регистратор) = ТИП(Документ.торо_НарядНаВыполнениеРемонтныхРабот)
		|			ИЛИ ТИПЗНАЧЕНИЯ(ВТ_РемонтыРегистраторы.Регистратор) = ТИП(Документ.торо_НарядНаРегламентноеМероприятие))
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_РемонтыРегистраторы.ID КАК ID
		|ПОМЕСТИТЬ ВТ_АктыПоРемонтам
		|ИЗ
		|	ВТ_РемонтыРегистраторы КАК ВТ_РемонтыРегистраторы
		|ГДЕ
		|	(ТИПЗНАЧЕНИЯ(ВТ_РемонтыРегистраторы.Регистратор) = ТИП(Документ.торо_АктОВыполненииРегламентногоМероприятия)
		|			ИЛИ ТИПЗНАЧЕНИЯ(ВТ_РемонтыРегистраторы.Регистратор) = ТИП(Документ.торо_АктОВыполненииЭтапаРабот))
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_СкользящийПланРаботСрезПоследних.ID_Ремонта КАК ID_Ремонта,
		|	ЛОЖЬ КАК Регламентный,
		|	торо_СкользящийПланРаботСрезПоследних.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ТаблицаИмеющихсяПланов
		|ИЗ
		|	РегистрСведений.торо_СкользящийПланРабот.СрезПоследних(
		|			,
		|			Регистратор = &ПланРабот
		|				И ID_Ремонта В
		|					(ВЫБРАТЬ
		|						ВТ_Итоговая.ID_Ремонта КАК ID_Ремонта
		|					ИЗ
		|						вт_Итоговая КАК ВТ_Итоговая
		|					ГДЕ
		|						НЕ ВТ_Итоговая.Регламентный)) КАК торо_СкользящийПланРаботСрезПоследних
		|ГДЕ
		|	торо_СкользящийПланРаботСрезПоследних.ВидПлана В(&ВидыПлана)
		|
		|СГРУППИРОВАТЬ ПО
		|	торо_СкользящийПланРаботСрезПоследних.ID_Ремонта,
		|	торо_СкользящийПланРаботСрезПоследних.Регистратор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_СкользящийПланРегламентныхМероприятийСрезПоследних.ID_Ремонта,
		|	ИСТИНА,
		|	торо_СкользящийПланРегламентныхМероприятийСрезПоследних.Регистратор
		|ИЗ
		|	РегистрСведений.торо_СкользящийПланРегламентныхМероприятий.СрезПоследних(
		|			,
		|			Регистратор = &ПланРабот
		|				И ID_Ремонта В
		|					(ВЫБРАТЬ
		|						ВТ_Итоговая.ID_Ремонта КАК ID_Ремонта
		|					ИЗ
		|						вт_Итоговая КАК ВТ_Итоговая
		|					ГДЕ
		|						ВТ_Итоговая.Регламентный)) КАК торо_СкользящийПланРегламентныхМероприятийСрезПоследних
		|ГДЕ
		|	торо_СкользящийПланРегламентныхМероприятийСрезПоследних.ВидПлана В(&ВидыПлана)
		|
		|СГРУППИРОВАТЬ ПО
		|	торо_СкользящийПланРегламентныхМероприятийСрезПоследних.ID_Ремонта,
		|	торо_СкользящийПланРегламентныхМероприятийСрезПоследних.ДатаНачалаРемонта,
		|	торо_СкользящийПланРегламентныхМероприятийСрезПоследних.ДатаОкончанияРемонта,
		|	торо_СкользящийПланРегламентныхМероприятийСрезПоследних.Регистратор
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID_Ремонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ОтмененныеРемонтыСрезПоследних.ID КАК ID
		|ПОМЕСТИТЬ ВТ_Отмененые
		|ИЗ
		|	РегистрСведений.торо_ОтмененныеРемонты.СрезПоследних(
		|			,
		|			ID В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					вт_Итоговая.ID_Ремонта КАК ID
		|				ИЗ
		|					вт_Итоговая КАК вт_Итоговая)) КАК торо_ОтмененныеРемонтыСрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_Итоговая.ID_Ремонта КАК ID_Ремонта,
		|	вт_Итоговая.ОбъектРемонта КАК ОбъектРемонта,
		|	вт_Итоговая.ВидРемонта КАК ВидРемонта,
		|	вт_Итоговая.ДокументОснование КАК ДокументОснование,
		|	вт_Итоговая.ДатаНачала КАК ДатаНачала,
		|	вт_Итоговая.ДатаОкончания КАК ДатаОкончания,
		|	вт_Итоговая.КрайняяДатаЗавершения КАК КрайняяДатаЗавершения,
		|	вт_Итоговая.ДатаНачалаРемонтаИсходная КАК ДатаНачалаИсходная,
		|	вт_Итоговая.ДатаОкончанияРемонтаИсходная КАК ДатаОкончанияИсходная,
		|	вт_Итоговая.КрайняяДатаЗавершенияИсходная КАК КрайняяДатаЗавершенияИсходная,
		|	вт_Итоговая.Регламентный КАК Регламентный,
		|	вт_Итоговая.ИсточникДанных КАК ИсточникДанных,
		|	вт_Итоговая.ВладелецОР КАК ВладелецОР,
		|	вт_Итоговая.ЕстьЗаявка КАК ЕстьЗаявка,
		|	ВЫБОР
		|		КОГДА ВТ_НарядыПоРемонтам.ID ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьНаряд,
		|	ВЫБОР
		|		КОГДА ВТ_АктыПоРемонтам.ID ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьАкт,
		|	вт_Итоговая.ЕстьОстановочный КАК ЕстьОстановочный,
		|	ВЫБОР
		|		КОГДА &ГруппироватьПоИсполнителю
		|			ТОГДА 
		|				ВЫБОР
		|					КОГДА вт_Итоговая.Исполнитель = НЕОПРЕДЕЛЕНО
		|						ТОГДА ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|					ИНАЧЕ вт_Итоговая.Исполнитель
		|				КОНЕЦ
		|		ИНАЧЕ NULL
		|	КОНЕЦ КАК Исполнитель,
		|	ВЫБОР
		|		КОГДА &ГруппироватьПоИсполнителю
		|			ТОГДА
		|				ВЫБОР
		|					КОГДА вт_Итоговая.УточнениеИсполнителя = НЕОПРЕДЕЛЕНО
		|						ТОГДА ЗНАЧЕНИЕ(Справочник.торо_РемонтныеБригады.ПустаяСсылка)
		|					ИНАЧЕ вт_Итоговая.УточнениеИсполнителя
		|				КОНЕЦ
		|		ИНАЧЕ NULL
		|	КОНЕЦ КАК УточнениеИсполнителя,
		|	вт_Итоговая.КритичностьОборудования КАК КритичностьОборудования,
		|	вт_Итоговая.КритичностьДефекта КАК КритичностьДефекта,
		|	вт_Итоговая.Заявка КАК Заявка,
		|	ЕСТЬNULL(ТаблицаИмеющихсяПланов.Регистратор, ЗНАЧЕНИЕ(Документ.торо_ПланРаботПодразделения.ПустаяСсылка)) КАК ПланПодразделения,
		|	ВЫБОР
		|		КОГДА ВТ_Отмененые.ID ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Отменен,
		|	ЛОЖЬ КАК НезапланированныйРемонт
		|ИЗ
		|	вт_Итоговая КАК вт_Итоговая
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НарядыПоРемонтам КАК ВТ_НарядыПоРемонтам
		|		ПО вт_Итоговая.ID_Ремонта = ВТ_НарядыПоРемонтам.ID
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АктыПоРемонтам КАК ВТ_АктыПоРемонтам
		|		ПО вт_Итоговая.ID_Ремонта = ВТ_АктыПоРемонтам.ID
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаИмеющихсяПланов КАК ТаблицаИмеющихсяПланов
		|		ПО вт_Итоговая.ID_Ремонта = ТаблицаИмеющихсяПланов.ID_Ремонта
		|			И вт_Итоговая.Регламентный = ТаблицаИмеющихсяПланов.Регламентный
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Отмененые КАК ВТ_Отмененые
		|		ПО вт_Итоговая.ID_Ремонта = ВТ_Отмененые.ID
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВЫБОР
		|		КОГДА &ПоВидам
		|			ТОГДА вт_Итоговая.ВидРемонта.Наименование
		|		ИНАЧЕ вт_Итоговая.ОбъектРемонта.Наименование
		|	КОНЕЦ,
		|	вт_Итоговая.ДатаНачала"; 
		#КонецОбласти 
	КонецЕсли; 
	
	ПервыйУровеньИтоги = "";
	ПервыйУровеньГруппировка = "";
	ВторойУровеньГруппировка = "";
	
	// Итоги первого уровня
	Если ВерхнийУровень = "1" Тогда 
		ПервыйУровеньГруппировка = "Исполнитель";
	ИначеЕсли ВерхнийУровень = "2" Тогда
		ПервыйУровеньИтоги = "МАКСИМУМ(Исполнитель)";
		ПервыйУровеньГруппировка = "УточнениеИсполнителя";
	ИначеЕсли ВерхнийУровень = "3" Тогда 
		ПервыйУровеньГруппировка = "УточнениеИсполнителя";
	Иначе
		ПервыйУровеньГруппировка = "ВладелецОР";
	КонецЕсли; 
	
	Если НижнийУровень = "1" Тогда
		ВторойУровеньГруппировка = "ОбъектРемонта";
	Иначе
		ВторойУровеньГруппировка = "ВидРемонта";		
	КонецЕсли; 
	
	ТекстИтогов = "ИТОГИ";
	
	Если НЕ ПервыйУровеньИтоги = "" Тогда
		ТекстИтогов = ТекстИтогов + Символы.ПС + ПервыйУровеньИтоги;
	КонецЕсли;
	
	ТекстИтогов = ТекстИтогов + Символы.ПС + "ПО" + Символы.ПС + ПервыйУровеньГруппировка;
	ТекстИтогов = ТекстИтогов + Символы.ПС + "," + Символы.ПС + ВторойУровеньГруппировка;
	
	Запрос.Текст = Запрос.Текст + Символы.ПС + ТекстИтогов;
			
	УстановитьПараметрыЗапросаДляЗаполнения(Запрос);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ПостроитьДиаграммуГантаДляППР(ДиаграммаГантаПодразделения, СтруктураДанныхПервогоУровня, СтруктураДанныхВторогоУровня, РезультатЗапроса);
	
	ДиаграммаГантаПодразделения.УстановитьПолныйИнтервал(ДатаОтсчета, ДатаОкончания);
	ДиаграммаГантаПодразделения.ОтображатьЛегенду = Ложь; 
	
	ВывестиРезультатЗапросаВДеревоФормы(РезультатЗапроса, СтруктураДанныхПервогоУровня, СтруктураДанныхВторогоУровня, СтруктураДанныхУровеньДанные);
 
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыЗапросаДляЗаполнения(Запрос)
	
	Исполнители = ПодразделениеИсполнитель.ВыгрузитьЗначения();
	
	Для каждого ЭлементСписка Из Контрагент Цикл
		Исполнители.Добавить(ЭлементСписка.Значение);
	КонецЦикла; 
	
	МассивУточнениеИсполнителя = Бригада.ВыгрузитьЗначения();
	
	Для каждого ЭлементСписка Из ДоговорКонтрагента Цикл
		МассивУточнениеИсполнителя.Добавить(ЭлементСписка.Значение);
	КонецЦикла; 
	
	ВидыПлана = Новый Массив;
	
	Если ВидПлана = Справочники.торо_ВидыСкользящихПланов.Долгосрочный Тогда
		
		ВидыПлана.Добавить(Справочники.торо_ВидыСкользящихПланов.Оперативный);
		ВидыПлана.Добавить(Справочники.торо_ВидыСкользящихПланов.Среднесрочный);
		ВидыПлана.Добавить(Справочники.торо_ВидыСкользящихПланов.Годовой);
		ВидыПлана.Добавить(Справочники.торо_ВидыСкользящихПланов.Долгосрочный);
		
	ИначеЕсли ВидПлана = Справочники.торо_ВидыСкользящихПланов.Годовой Тогда
		
		ВидыПлана.Добавить(Справочники.торо_ВидыСкользящихПланов.Оперативный);
		ВидыПлана.Добавить(Справочники.торо_ВидыСкользящихПланов.Среднесрочный);
		ВидыПлана.Добавить(Справочники.торо_ВидыСкользящихПланов.Годовой);
		
	ИначеЕсли ВидПлана = Справочники.торо_ВидыСкользящихПланов.Среднесрочный Тогда
		
		ВидыПлана.Добавить(Справочники.торо_ВидыСкользящихПланов.Оперативный);
		ВидыПлана.Добавить(Справочники.торо_ВидыСкользящихПланов.Среднесрочный);
		
	ИначеЕсли ВидПлана = Справочники.торо_ВидыСкользящихПланов.Оперативный Тогда
		
		ВидыПлана.Добавить(Справочники.торо_ВидыСкользящихПланов.Оперативный);
		
	ИначеЕсли ВидПлана = Справочники.торо_ВидыСкользящихПланов.Стратегический Тогда 
		
		ВидыПлана.Добавить(Справочники.торо_ВидыСкользящихПланов.Оперативный);
		ВидыПлана.Добавить(Справочники.торо_ВидыСкользящихПланов.Среднесрочный);
		ВидыПлана.Добавить(Справочники.торо_ВидыСкользящихПланов.Годовой);
		ВидыПлана.Добавить(Справочники.торо_ВидыСкользящихПланов.Стратегический);
		ВидыПлана.Добавить(Справочники.торо_ВидыСкользящихПланов.Долгосрочный);
		
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("ВидыРемонтов", ВидыРемонтов.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("Владелец", ВладелецОР.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("Исполнители", Исполнители);
	Запрос.УстановитьПараметр("ИспользоватьОтборПоВладельцу", ВладелецОР.Количество()   > 0);
	Запрос.УстановитьПараметр("ИспользоватьОтборПоВР", ВидыРемонтов.Количество() > 0);
	Запрос.УстановитьПараметр("ИспользоватьОтборПоИсполнителю", Исполнители.Количество()  > 0);
	Запрос.УстановитьПараметр("ИспользоватьОтборПоОР", ОбъектРемонта.Количество()> 0);
	Запрос.УстановитьПараметр("НачалоПериода", ДатаОтсчета);
	Запрос.УстановитьПараметр("ОбъектРемонта", ОбъектРемонта.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("ОкончаниеПериода", ДатаОкончания);
	Запрос.УстановитьПараметр("ПоказыватьВнешниеОснования", ПоказыватьВнешниеОснования);
	Запрос.УстановитьПараметр("ПоказыватьДефекты", ПоказыватьДефекты);
	Запрос.УстановитьПараметр("ПоказыватьРемонтыППР", ПоказыватьРемонтыППР);
	Запрос.УстановитьПараметр("ПоказыватьРемонтыРегламентные", ПоказыватьРемонтыРегламентные);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПланРабот", ПланРабот);
	Запрос.УстановитьПараметр("ПоВидам", НижнийУровень = "2");
	
	Запрос.УстановитьПараметр("ИспользоватьОтборПоВсемОрганизациям",Не ЗначениеЗаполнено(Организация));
	Запрос.УстановитьПараметр("ИспользоватьОтборПоУточнениюИсполнителя", МассивУточнениеИсполнителя.Количество() > 0);
	Запрос.УстановитьПараметр("УточнениеИсполнителя", МассивУточнениеИсполнителя);
	Запрос.УстановитьПараметр("ГруппироватьПоИсполнителю", ГруппироватьПоИсполнителю = 1);
	
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("ДатаОтсчета", ДатаОтсчета);

	Запрос.УстановитьПараметр("ВидыПлана", ВидыПлана);
	Запрос.УстановитьПараметр("ВидПлана", ВидПлана);

КонецПроцедуры

&НаСервере
Процедура ВывестиРезультатЗапросаВДеревоФормы(РезультатЗапроса, СтруктураДанныхПервогоУровня, СтруктураДанныхВторогоУровня, СтруктураДанныхУровеньДанные)
	
	ВыборкаПервыйУровень = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПервыйУровень.Следующий() Цикл
		СтрокаПервогоУровня = ДеревоРемонты.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПервогоУровня, ВыборкаПервыйУровень);
		ЗаполнитьЗначенияСвойств(СтрокаПервогоУровня, СтруктураДанныхПервогоУровня);
		
		ВыборкаВторойУровень = ВыборкаПервыйУровень.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаВторойУровень.Следующий() Цикл
			
			СтрокаВторогоУровня = СтрокаПервогоУровня.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаВторогоУровня, ВыборкаВторойУровень);
			ЗаполнитьЗначенияСвойств(СтрокаВторогоУровня, СтруктураДанныхВторогоУровня);
			
			ВыборкаДанные = ВыборкаВторойУровень.Выбрать();
			
			Пока ВыборкаДанные.Следующий() Цикл
				СтрокаДанные = СтрокаВторогоУровня.ПолучитьЭлементы().Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДанные, ВыборкаДанные);
				ЗаполнитьЗначенияСвойств(СтрокаДанные, СтруктураДанныхУровеньДанные);	
			КонецЦикла; 
			
		КонецЦикла; 
	КонецЦикла; 

КонецПроцедуры

&НаСервереБезКонтекста 
Функция ПолучитьДанныеПоВидуПлана(ВидПлана)
	
	Возврат Справочники.торо_ВидыСкользящихПланов.ПолучитьДанныеПоВидуПлана(ВидПлана);
	 	
КонецФункции

&НаКлиенте 
Процедура УстановитьЗаголовкиКолонок()
	
	// >> [Деснол] [Ушаков А.Д.] [26.09.2019] 
	Если ВерхнийУровень = "1" Тогда
		Текст1 = НСтр("es='Contratista (Unidad, contraparte)';ru='Исполнитель (Подразделение, контрагент)';en='The contractor (Department, contractor)'");
	ИначеЕсли ВерхнийУровень = "2" Тогда
		Текст1 = НСтр("es='Contratista | Aclaración de intérprete';ru='Исполнитель | Уточнение исполнителя';en='Artist / clarification of the artist'");
	ИначеЕсли ВерхнийУровень = "3" Тогда
		Текст1 = НСтр("es='Aclaración del contratista (equipo, contrato)';ru='Уточнение исполнителя (Бригада, договор)';en='Clarification of the contractor (Team, contract)'");
	Иначе
		Текст1 = НСтр("en='Owner EI';es='Propietario O';ru='Владелец ОР'");
	КонецЕсли;
	
	//Если ВерхнийУровень = "1" Тогда
	//	Текст1 = "Исполнитель (Подразделение, контрагент)";
	//ИначеЕсли ВерхнийУровень = "2" Тогда
	//	Текст1 = "Исполнитель | Уточнение исполнителя";
	//ИначеЕсли ВерхнийУровень = "3" Тогда
	//	Текст1 = "Уточнение исполнителя (Бригада, договор)";
	//Иначе
	//	Текст1 = "Владелец ОР";
	//КонецЕсли; 
	// << [Деснол] [Ушаков А.Д.] [26.09.2019] 
	
	// >> [Деснол] [Ушаков А.Д.] [26.09.2019] 
	Если НижнийУровень = "1" Тогда
		Текст2 = НСтр("es='Reparar objetos';ru='Объекты ремонта';en='Repair objects'");
	Иначе
		Текст2 = НСтр("es='Tipos de reparacion';ru='Виды ремонта';en='Types of repair'");
	КонецЕсли; 
	
	//Если НижнийУровень = "1" Тогда
	//	Текст2 = "Объекты ремонта";
	//Иначе
	//	Текст2 = "Виды ремонта";
	//КонецЕсли; 
	// << [Деснол] [Ушаков А.Д.] [26.09.2019] 

	Элементы.ДеревоРемонтыГруппаИерархия.Заголовок = Текст1;
	Элементы.ДеревоРемонтыГруппа2.Заголовок        = Текст2;
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДерево()
	
	Дерево = ДеревоРемонты.ПолучитьЭлементы();
	
	Для Каждого Строка Из Дерево Цикл    
		ИдентификаторСтроки = Строка.ПолучитьИдентификатор();
		Элементы.ДеревоРемонты.Развернуть(ИдентификаторСтроки, Истина);
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте 
Процедура СвернутьДерево()
	
	Дерево = ДеревоРемонты.ПолучитьЭлементы();
	
	Для Каждого Строка Из Дерево Цикл    
		Элементы.ДеревоРемонты.Свернуть(Строка.ПолучитьИдентификатор());
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ПроставитьСвойстваОтображенияВСтруктурах(СтруктураДанныхПервогоУровня, СтруктураДанныхВторогоУровня, СтруктураДанныхУровеньДанные)
	
	Если ВерхнийУровень = "1" Тогда // отобразить на первом уровне только исполнителя
		
		СтруктураДанныхПервогоУровня.Вставить("ОтображатьИсполнитель", Истина);
		СтруктураДанныхПервогоУровня.Вставить("ОтображатьВладелец", Ложь);
		СтруктураДанныхПервогоУровня.Вставить("ОтображатьВидРемонта", Ложь);
		СтруктураДанныхПервогоУровня.Вставить("ОтображатьДанные", Ложь);
		СтруктураДанныхПервогоУровня.Вставить("ОтображатьОбъектРемонта", Ложь);
		СтруктураДанныхПервогоУровня.Вставить("ОтображатьУточнениеИсполнителя", Ложь);
		
	ИначеЕсли ВерхнийУровень = "2" Тогда
		
		СтруктураДанныхПервогоУровня.Вставить("ОтображатьИсполнитель", Истина);
		СтруктураДанныхПервогоУровня.Вставить("ОтображатьВладелец", Ложь);
		СтруктураДанныхПервогоУровня.Вставить("ОтображатьВидРемонта", Ложь);
		СтруктураДанныхПервогоУровня.Вставить("ОтображатьДанные", Ложь);
		СтруктураДанныхПервогоУровня.Вставить("ОтображатьОбъектРемонта", Ложь);
		СтруктураДанныхПервогоУровня.Вставить("ОтображатьУточнениеИсполнителя", Истина);
		
	ИначеЕсли ВерхнийУровень = "3" Тогда 
		
		СтруктураДанныхПервогоУровня.Вставить("ОтображатьИсполнитель", Ложь);
		СтруктураДанныхПервогоУровня.Вставить("ОтображатьВладелец", Ложь);
		СтруктураДанныхПервогоУровня.Вставить("ОтображатьВидРемонта", Ложь);
		СтруктураДанныхПервогоУровня.Вставить("ОтображатьДанные", Ложь);
		СтруктураДанныхПервогоУровня.Вставить("ОтображатьОбъектРемонта", Ложь);
		СтруктураДанныхПервогоУровня.Вставить("ОтображатьУточнениеИсполнителя", Истина);
		
	Иначе
		
		СтруктураДанныхПервогоУровня.Вставить("ОтображатьИсполнитель", Ложь);
		СтруктураДанныхПервогоУровня.Вставить("ОтображатьВладелец", Истина);
		СтруктураДанныхПервогоУровня.Вставить("ОтображатьВидРемонта", Ложь);
		СтруктураДанныхПервогоУровня.Вставить("ОтображатьДанные", Ложь);
		СтруктураДанныхПервогоУровня.Вставить("ОтображатьОбъектРемонта", Ложь);
		СтруктураДанныхПервогоУровня.Вставить("ОтображатьУточнениеИсполнителя", Ложь);
		
	КонецЕсли; 
	
	Если НижнийУровень = "1" Тогда
		
		СтруктураДанныхВторогоУровня.Вставить("ОтображатьИсполнитель", Ложь);
		СтруктураДанныхВторогоУровня.Вставить("ОтображатьВладелец", Ложь);
		СтруктураДанныхВторогоУровня.Вставить("ОтображатьВидРемонта", Ложь);
		СтруктураДанныхВторогоУровня.Вставить("ОтображатьДанные", Ложь);
		СтруктураДанныхВторогоУровня.Вставить("ОтображатьОбъектРемонта", Истина);
		СтруктураДанныхВторогоУровня.Вставить("ОтображатьУточнениеИсполнителя", Ложь);
		
	Иначе
		
		СтруктураДанныхВторогоУровня.Вставить("ОтображатьИсполнитель", Ложь);
		СтруктураДанныхВторогоУровня.Вставить("ОтображатьВладелец", Ложь);
		СтруктураДанныхВторогоУровня.Вставить("ОтображатьВидРемонта", Истина);
		СтруктураДанныхВторогоУровня.Вставить("ОтображатьДанные", Ложь);
		СтруктураДанныхВторогоУровня.Вставить("ОтображатьОбъектРемонта", Ложь);
		СтруктураДанныхВторогоУровня.Вставить("ОтображатьУточнениеИсполнителя", Ложь);
		
	КонецЕсли; 
	
	СтруктураДанныхУровеньДанные.Вставить("ОтображатьВидРемонта", ?(СтруктураДанныхВторогоУровня.ОтображатьВидРемонта, Ложь, Истина));
	СтруктураДанныхУровеньДанные.Вставить("ОтображатьДанные", Истина);
	СтруктураДанныхУровеньДанные.Вставить("ОтображатьОбъектРемонта", ?(СтруктураДанныхВторогоУровня.ОтображатьВидРемонта, Истина, Ложь));
	
КонецПроцедуры

&НаКлиенте 
Процедура ЗаполнитьСписокВыборкаДетализации()
	
	СписокВыбора = Новый Массив;
	Если Не ФОИспользоватьСкользящееПланирование Тогда
	    Элементы.Детализация.ТолькоПросмотр = Ложь;
	КонецЕсли; 

	Если Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
		Если КоличествоПериодов = 1 Тогда
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.торо_ДетализацияПлана.Год"));
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.торо_ДетализацияПлана.Месяц"));
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.торо_ДетализацияПлана.Неделя"));
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.торо_ДетализацияПлана.День"));
		Иначе
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.торо_ДетализацияПлана.Год"));
		КонецЕсли;
		
	Иначе   
		Если ЗначениеЗаполнено(Периодичность) Тогда
			
			Если Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") 
				Или Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
				СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.торо_ДетализацияПлана.Месяц"));
				СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.торо_ДетализацияПлана.Неделя"));
				СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.торо_ДетализацияПлана.День"));
			Иначе
				СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.торо_ДетализацияПлана.Час"));
			КонецЕсли; 
		КонецЕсли;
		
	КонецЕсли; 	
	
	Элементы.Детализация.СписокВыбора.ЗагрузитьЗначения(СписокВыбора);
	
	НайдЗначение = СписокВыбора.Найти(Детализация);
	
	Если НайдЗначение = Неопределено Тогда
		Детализация = Неопределено;
	КонецЕсли; 
	
	Если СписокВыбора.Количество() = 1 Тогда
		Элементы.Детализация.ТолькоПросмотр = Истина;
		Детализация = СписокВыбора[0];
	КонецЕсли; 

	
КонецПроцедуры

&НаКлиенте 
Процедура ОткрытьПодбор(СтруктураПодбора, Элемент)
	
	ОткрытьФорму("Обработка.торо_ОбщийПланРабот.Форма.ФормаПодбораВСписок", СтруктураПодбора, Элемент,,ВариантОткрытияОкна.ОтдельноеОкно,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервереБезКонтекста 
Функция ОтобратьБригадыПоМассивуПодразделений(МассивПодразделений, МассивБригады)
	
	Запрос = Новый Запрос;
	# Область ТекстЗапроса
	Запрос.Текст = "ВЫБРАТЬ
	|	торо_РемонтныеБригады.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.торо_РемонтныеБригады КАК торо_РемонтныеБригады
	|ГДЕ
	|	торо_РемонтныеБригады.Подразделение В (&Подразделение)
	|	И торо_РемонтныеБригады.Ссылка В (&Ссылка)";
	# КонецОбласти
	
	Запрос.УстановитьПараметр("Подразделение", МассивПодразделений);
	Запрос.УстановитьПараметр("Ссылка"       , МассивБригады);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Новый Массив;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		
		Массив = Новый Массив;
		Пока Выборка.Следующий() Цикл
			Массив.Добавить(Выборка.Ссылка);	
		КонецЦикла; 
		
		Возврат Массив;
	КонецЕсли; 
	
КонецФункции

&НаСервереБезКонтекста 
Функция ОтобратьДоговорыПоМассивуКонтрагентов(МассивКонтрагентов, МассивДоговоры)
	
	Запрос = Новый Запрос;
	# Область ТекстЗапроса
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |ГДЕ
	               |	ДоговорыКонтрагентов.Ссылка В(&Ссылка)
	               |	И ДоговорыКонтрагентов.Контрагент В(&Контрагент)";
	# КонецОбласти
	
	Запрос.УстановитьПараметр("Контрагент", МассивКонтрагентов);
	Запрос.УстановитьПараметр("Ссылка"    , МассивДоговоры);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Новый Массив;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		
		Массив = Новый Массив;
		Пока Выборка.Следующий() Цикл
			Массив.Добавить(Выборка.Ссылка);	
		КонецЦикла; 
		
		Возврат Массив;
	КонецЕсли; 
	
КонецФункции

&НаСервере
Процедура СохранитьПланНаСервере(ПланРаботДляЗаписи = Неопределено, Отказ)
	
	// Проверка на наличие документов на этот период
	Если ПланРаботДляЗаписи = Неопределено Тогда
		Если Не НаУказанныйПериодУжеИмеютсяДокументы(ПланРабот, Организация, ВидПлана, ДатаОтсчета, Периодичность, КоличествоПериодов) = Неопределено Тогда
			ТекстСообщения = НСтр("es='Para el período indicado hay ya unos documentos creados el Plan de los trabajos';ru='На указанный период уже имеются созданные документы План работ';en='For the indicated period, already created documents are available. Work plan'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	
	Если ДеревоРемонты.ПолучитьЭлементы().Количество() = 0 Тогда
	    ТекстСообщения = НСтр("es='de las reparaciones. Es imposible conservar el plan de los trabajos';ru='Не заполнена таблица ремонтов. Невозможно сохранить план работ';en='The repair table is not filled. Unable to save work plan'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		Возврат;
	КонецЕсли; 
	
	ОрганизацияДокумента = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			"НастройкиТОиР",
			"ОсновнаяОрганизация",
			Справочники.Организации.ПустаяСсылка());
			
	Если ЗначениеЗаполнено(Организация) Тогда
	    ОрганизацияДокумента = Организация;
	ИначеЕсли Не ЗначениеЗаполнено(ОрганизацияДокумента) Тогда
	    ТекстСообщения = НСтр("es='En el tratamiento y en los ajustes de usuario no es rellenada la organización. Es imposible conservar el plan de las reparaciones';ru='В обработке и в пользовательских настройках не заполнена организация. Невозможно сохранить план ремонтов';en='In processing and in user settings, the organization is not populated. Unable to save repair plan'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		Возврат;
	КонецЕсли;
	
	СозданНовый = Ложь;
	Если ЗначениеЗаполнено(ПланРаботДляЗаписи) Тогда
		Документ = ПланРаботДляЗаписи.ПолучитьОбъект();
	Иначе
		Документ = Документы.торо_ПланРаботПодразделения.СоздатьДокумент();
		СозданНовый = Истина;
	КонецЕсли; 
	
    Документ.Организация               = ОрганизацияДокумента;
	Документ.ОрганизацияПлана          = Организация;
    Документ.Дата                      = ДатаОтсчета;
    Документ.ВидПлана                  = ВидПлана;
    Документ.ДатаОтсчета               = ДатаОтсчета;
    Документ.ПериодичностьПланирования = Периодичность;
    Документ.Ответственный             = Пользователи.АвторизованныйПользователь();
    Документ.ТочностьПланирования      = Детализация;
    Документ.КоличествоПериодов        = КоличествоПериодов;
	
	ТаблицаСРемонтамиИсходная    = Документ.СписокРемонтовПлана.Выгрузить();

	Если Не ЗначениеЗаполнено(ПланРабот) Тогда  //если не редактируется план, то ремонты из документов не сохраняем
		Документ.СписокВидовРемонта.Очистить();
		Документ.СписокРемонтовПлана.Очистить();
		ТаблицаСРемонтамиИсходная.Очистить(); 
	КонецЕсли; 
		
	Для каждого ЭлементСписка Из ВидыРемонтов Цикл
		
		МассивСтрок = Документ.СписокВидовРемонта.НайтиСтроки(Новый Структура("ВидРемонта", ЭлементСписка.Значение));
		
		Если МассивСтрок.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		НС = Документ.СписокВидовРемонта.Добавить();
		НС.ВидРемонта = ЭлементСписка.Значение;
		
	КонецЦикла; 
	
	ТаблицаСРемонтамиИзОбработки = ТаблицаСРемонтамиИсходная.СкопироватьКолонки();
	
	Для каждого СтрокаПервыйУровень Из ДеревоРемонты.ПолучитьЭлементы() Цикл
		Для каждого СтрокаВторойУровень Из СтрокаПервыйУровень.ПолучитьЭлементы() Цикл
			Для каждого ДетальнаяЗапись Из СтрокаВторойУровень.ПолучитьЭлементы() Цикл
								
				НС = ТаблицаСРемонтамиИзОбработки.Добавить();
				ЗаполнитьЗначенияСвойств(НС, ДетальнаяЗапись);
				НС.ДатаНачалаРемонтаИсходная    = ДетальнаяЗапись.ДатаНачалаИсходная;
				НС.ДатаОкончанияРемонтаИсходная = ДетальнаяЗапись.ДатаОкончанияИсходная;
				НС.ID                           = ДетальнаяЗапись.ID_Ремонта;
								
			КонецЦикла; 
		КонецЦикла; 
	КонецЦикла; 
	
	
	Запрос = Новый Запрос;
	
	# Область ТекстЗапроса
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаСРемонтамиИзОбработки.ID КАК ID,
	               |	ТаблицаСРемонтамиИзОбработки.ОбъектРемонта КАК ОбъектРемонта,
	               |	ТаблицаСРемонтамиИзОбработки.ВидРемонта КАК ВидРемонта,
	               |	ТаблицаСРемонтамиИзОбработки.ДокументОснование КАК ДокументОснование,
	               |	ТаблицаСРемонтамиИзОбработки.ДатаНачала КАК ДатаНачала,
	               |	ТаблицаСРемонтамиИзОбработки.ДатаОкончания КАК ДатаОкончания,
	               |	ТаблицаСРемонтамиИзОбработки.КрайняяДатаЗавершения КАК КрайняяДатаЗавершения,
	               |	ТаблицаСРемонтамиИзОбработки.ДатаНачалаРемонтаИсходная КАК ДатаНачалаРемонтаИсходная,
	               |	ТаблицаСРемонтамиИзОбработки.ДатаОкончанияРемонтаИсходная КАК ДатаОкончанияРемонтаИсходная,
	               |	ТаблицаСРемонтамиИзОбработки.КрайняяДатаЗавершенияИсходная КАК КрайняяДатаЗавершенияИсходная,
	               |	ТаблицаСРемонтамиИзОбработки.Регламентный КАК Регламентный,
	               |	ТаблицаСРемонтамиИзОбработки.ИсточникДанных КАК ИсточникДанных
	               |ПОМЕСТИТЬ ТаблицаСРемонтамиИзОбработки
	               |ИЗ
	               |	&ТаблицаСРемонтамиИзОбработки КАК ТаблицаСРемонтамиИзОбработки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаСРемонтамиИзОбработки.ID КАК ID,
	               |	ТаблицаСРемонтамиИзОбработки.ОбъектРемонта КАК ОбъектРемонта,
	               |	ТаблицаСРемонтамиИзОбработки.ВидРемонта КАК ВидРемонта,
	               |	ТаблицаСРемонтамиИзОбработки.ДокументОснование КАК ДокументОснование,
	               |	МИНИМУМ(ТаблицаСРемонтамиИзОбработки.ДатаНачала) КАК ДатаНачала,
	               |	МАКСИМУМ(ТаблицаСРемонтамиИзОбработки.ДатаОкончания) КАК ДатаОкончания,
	               |	МАКСИМУМ(ТаблицаСРемонтамиИзОбработки.КрайняяДатаЗавершения) КАК КрайняяДатаЗавершения,
	               |	ТаблицаСРемонтамиИзОбработки.ДатаНачалаРемонтаИсходная КАК ДатаНачалаРемонтаИсходная,
	               |	ТаблицаСРемонтамиИзОбработки.ДатаОкончанияРемонтаИсходная КАК ДатаОкончанияРемонтаИсходная,
	               |	ТаблицаСРемонтамиИзОбработки.КрайняяДатаЗавершенияИсходная КАК КрайняяДатаЗавершенияИсходная,
	               |	ТаблицаСРемонтамиИзОбработки.Регламентный КАК Регламентный,
	               |	ТаблицаСРемонтамиИзОбработки.ИсточникДанных КАК ИсточникДанных
	               |ПОМЕСТИТЬ вт_ДанныеДляЗаписи
	               |ИЗ
	               |	ТаблицаСРемонтамиИзОбработки КАК ТаблицаСРемонтамиИзОбработки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТаблицаСРемонтамиИзОбработки.ID,
	               |	ТаблицаСРемонтамиИзОбработки.ОбъектРемонта,
	               |	ТаблицаСРемонтамиИзОбработки.ВидРемонта,
	               |	ТаблицаСРемонтамиИзОбработки.ДатаНачалаРемонтаИсходная,
	               |	ТаблицаСРемонтамиИзОбработки.ДатаОкончанияРемонтаИсходная,
	               |	ТаблицаСРемонтамиИзОбработки.КрайняяДатаЗавершенияИсходная,
	               |	ТаблицаСРемонтамиИзОбработки.Регламентный,
	               |	ТаблицаСРемонтамиИзОбработки.ИсточникДанных,
	               |	ТаблицаСРемонтамиИзОбработки.ДокументОснование
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	торо_ПланРаботПодразделенияСписокРемонтовПлана.ID КАК ID,
	               |	торо_ПланРаботПодразделенияСписокРемонтовПлана.ОбъектРемонта КАК ОбъектРемонта,
	               |	торо_ПланРаботПодразделенияСписокРемонтовПлана.ВидРемонта КАК ВидРемонта,
	               |	торо_ПланРаботПодразделенияСписокРемонтовПлана.ДокументОснование КАК ДокументОснование,
	               |	торо_ПланРаботПодразделенияСписокРемонтовПлана.ДатаНачала КАК ДатаНачала,
	               |	торо_ПланРаботПодразделенияСписокРемонтовПлана.ДатаОкончания КАК ДатаОкончания,
	               |	торо_ПланРаботПодразделенияСписокРемонтовПлана.КрайняяДатаЗавершения КАК КрайняяДатаЗавершения,
	               |	торо_ПланРаботПодразделенияСписокРемонтовПлана.ДатаНачалаРемонтаИсходная КАК ДатаНачалаРемонтаИсходная,
	               |	торо_ПланРаботПодразделенияСписокРемонтовПлана.ДатаОкончанияРемонтаИсходная КАК ДатаОкончанияРемонтаИсходная,
	               |	торо_ПланРаботПодразделенияСписокРемонтовПлана.КрайняяДатаЗавершенияИсходная КАК КрайняяДатаЗавершенияИсходная,
	               |	торо_ПланРаботПодразделенияСписокРемонтовПлана.Регламентный КАК Регламентный,
	               |	торо_ПланРаботПодразделенияСписокРемонтовПлана.ИсточникДанных КАК ИсточникДанных
	               |ПОМЕСТИТЬ вт_ДанныеИзДокумента
	               |ИЗ
	               |	&ТаблицаСРемонтамиИсходная КАК торо_ПланРаботПодразделенияСписокРемонтовПлана
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(вт_ДанныеДляЗаписи.ID, вт_ДанныеИзДокумента.ID) КАК ID,
	               |	ЕСТЬNULL(вт_ДанныеДляЗаписи.ОбъектРемонта, вт_ДанныеИзДокумента.ОбъектРемонта) КАК ОбъектРемонта,
	               |	ЕСТЬNULL(вт_ДанныеДляЗаписи.ВидРемонта, вт_ДанныеИзДокумента.ВидРемонта) КАК ВидРемонта,
	               |	ЕСТЬNULL(вт_ДанныеДляЗаписи.ДокументОснование, вт_ДанныеИзДокумента.ДокументОснование) КАК ДокументОснование,
	               |	ЕСТЬNULL(вт_ДанныеДляЗаписи.ДатаНачала, вт_ДанныеИзДокумента.ДатаНачала) КАК ДатаНачала,
	               |	ЕСТЬNULL(вт_ДанныеДляЗаписи.ДатаОкончания, вт_ДанныеИзДокумента.ДатаОкончания) КАК ДатаОкончания,
	               |	ЕСТЬNULL(вт_ДанныеДляЗаписи.КрайняяДатаЗавершения, вт_ДанныеИзДокумента.КрайняяДатаЗавершения) КАК КрайняяДатаЗавершения,
	               |	ЕСТЬNULL(вт_ДанныеДляЗаписи.ДатаНачалаРемонтаИсходная, вт_ДанныеИзДокумента.ДатаНачалаРемонтаИсходная) КАК ДатаНачалаРемонтаИсходная,
	               |	ЕСТЬNULL(вт_ДанныеДляЗаписи.ДатаОкончанияРемонтаИсходная, вт_ДанныеИзДокумента.ДатаОкончанияРемонтаИсходная) КАК ДатаОкончанияРемонтаИсходная,
	               |	ЕСТЬNULL(вт_ДанныеДляЗаписи.КрайняяДатаЗавершенияИсходная, вт_ДанныеИзДокумента.КрайняяДатаЗавершенияИсходная) КАК КрайняяДатаЗавершенияИсходная,
	               |	ЕСТЬNULL(вт_ДанныеДляЗаписи.Регламентный, вт_ДанныеИзДокумента.Регламентный) КАК Регламентный,
	               |	ЕСТЬNULL(вт_ДанныеДляЗаписи.ИсточникДанных, вт_ДанныеИзДокумента.ИсточникДанных) КАК ИсточникДанных
	               |ИЗ
	               |	вт_ДанныеДляЗаписи КАК вт_ДанныеДляЗаписи
	               |		ПОЛНОЕ СОЕДИНЕНИЕ вт_ДанныеИзДокумента КАК вт_ДанныеИзДокумента
	               |		ПО вт_ДанныеДляЗаписи.ID = вт_ДанныеИзДокумента.ID";
	# КонецОбласти
	
	Запрос.УстановитьПараметр("ТаблицаСРемонтамиИзОбработки", ТаблицаСРемонтамиИзОбработки);
	Запрос.УстановитьПараметр("ТаблицаСРемонтамиИсходная"   , ТаблицаСРемонтамиИсходная);
	
	РезультатЗапроса = Запрос.Выполнить();
	 
	Документ.СписокРемонтовПлана.Очистить();
	Документ.СписокРемонтовПлана.Загрузить(РезультатЗапроса.Выгрузить());
	
	ВидДокумента = Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_ПланРаботПодразделения;
	мИспользоватьСогласованиеДокументов = торо_РаботаССогласованиями.ПроверитьИспользованиеСогласованияДокументов(ВидДокумента);

	РежимЗаписи = РежимЗаписиДокумента.Запись;
	
	Если Не мИспользоватьСогласованиеДокументов Или Документ.Проведен Тогда
		РежимЗаписи = РежимЗаписиДокумента.Проведение;
	КонецЕсли; 
	
	Попытка 
		Документ.ДополнительныеСвойства.Вставить("ИзОбработки", Истина);
		Документ.Записать(РежимЗаписи);
		Сообщение = Новый СообщениеПользователю;
		ТекстСообщения = НСтр("es='%1 documento %2';ru='%1 документ %2';en='%1 document%2'"); 
		Сообщение.Текст = СтрШаблон(ТекстСообщения,?(СозданНовый, "Создан", "Изменен"), Документ.Ссылка);
		Сообщение.Сообщить(); 
		
		ПланРабот = Документ.Ссылка;
		
	Исключение
		Сообщение = Новый СообщениеПользователю;
		ТекстСообщения = НСтр("es='No consiguió conservar el plan de los trabajos.';ru='Не удалось сохранить план работ.';en='Failed to save work plan.'"); 
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецПопытки; 
	
КонецПроцедуры

// Процедура выполняет построение диагрммы Ганта для графика ППР
//
// Параметры:
//  Диаграмма - диаграмма Ганта.
//  ИсхДанные - таблица значений исходных данных.
//
&НаСервере
Процедура ПостроитьДиаграммуГантаДляППР(Диаграмма, СтруктураДанныхПервогоУровня, СтруктураДанныхВторогоУровня, РезультатЗапроса = Неопределено) 
	
	//////////////////////////////////////////////////////
	ТекДата = ТекущаяДата();
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Булево"));
	
	//ОписаниеТ = новый ОписаниеТипов(МассивТипов);
		
	Диаграмма.Очистить();
	Диаграмма.АвтоОпределениеПолногоИнтервала = Ложь;
		
	СерияРемонт = Диаграмма.Серии.Добавить();
	СерияРемонт.Текст = "График ремонта";
		
	ВыборкаПервыйУровень = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПервыйУровень.Следующий() Цикл
		
        ЗаголовокТочки = "";
		
		Если СтруктураДанныхПервогоУровня.ОтображатьВладелец Тогда
			Если ЗначениеЗаполнено(ВыборкаПервыйУровень.ВладелецОР) Тогда
				ЗаголовокТочки = ВыборкаПервыйУровень.ВладелецОР;
			Иначе
				ЗаголовокТочки = "<Владелец ОР не указан>";
			КонецЕсли;
			
		ИначеЕсли СтруктураДанныхПервогоУровня.ОтображатьИсполнитель Тогда
			
			Если ЗначениеЗаполнено(ВыборкаПервыйУровень.Исполнитель) Тогда
				ЗаголовокТочки = Строка(ВыборкаПервыйУровень.Исполнитель);
			Иначе
				Если ТипЗнч(ВыборкаПервыйУровень.Исполнитель) = Тип("СправочникСсылка.СтруктураПредприятия") Тогда
					ЗаголовокТочки = "<Подразделение-исполнитель не указано>";
				Иначе
					ЗаголовокТочки = "<Контрагент-исполнитель не указан>";
				КонецЕсли; 
			КонецЕсли; 
			
			Если СтруктураДанныхПервогоУровня.ОтображатьУточнениеИсполнителя Тогда
				
				Если ЗначениеЗаполнено(ВыборкаПервыйУровень.УточнениеИсполнителя) Тогда
					ЗаголовокТочки = ЗаголовокТочки + "/" + Строка(ВыборкаПервыйУровень.УточнениеИсполнителя);
				Иначе
					Если ТипЗнч(ВыборкаПервыйУровень.УточнениеИсполнителя) = Тип("СправочникСсылка.торо_РемонтныеБригады") Тогда
						ЗаголовокТочки = ЗаголовокТочки + "/" +"<Ремонтная бригада не указана>";
					Иначе
						ЗаголовокТочки = ЗаголовокТочки + "/" +"<Договор контрагента не указан>";
					КонецЕсли; 
				КонецЕсли; 

			КонецЕсли;
			
		ИначеЕсли СтруктураДанныхПервогоУровня.ОтображатьУточнениеИсполнителя Тогда 
			Если ТипЗнч(ВыборкаПервыйУровень.УточнениеИсполнителя) = Тип("СправочникСсылка.торо_РемонтныеБригады") Тогда
				ЗаголовокТочки = "<Ремонтная бригада не указана>";
			Иначе
				ЗаголовокТочки = "<Договор контрагента не указан>";
			КонецЕсли;
		КонецЕсли; 
		
		ТочкаПервыйУровень = Диаграмма.Точки.Добавить();
		ТочкаПервыйУровень.Текст = ЗаголовокТочки;
		
		ВыборкаВторойУровень = ВыборкаПервыйУровень.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаВторойУровень.Следующий() Цикл
			
			ТочкаВторойУровень = ТочкаПервыйУровень.Точки.Добавить();
			
			Если СтруктураДанныхВторогоУровня.ОтображатьВидРемонта Тогда
				ТочкаВторойУровень.Текст = ВыборкаВторойУровень.ВидРемонта;
			Иначе
				ТочкаВторойУровень.Текст = ВыборкаВторойУровень.ОбъектРемонта;		
			КонецЕсли; 
			
			ВыборкаДанные = ВыборкаВторойУровень.Выбрать();
			
			СоответствиеТочек = Новый Соответствие;
			
			Пока ВыборкаДанные.Следующий() Цикл
				
				Если СтруктураДанныхВторогоУровня.ОтображатьВидРемонта Тогда //если на втором уровне виды ремонта, значит на 3 объекты
					
					Если СоответствиеТочек.Получить(ВыборкаДанные.ОбъектРемонта) = Неопределено Тогда
						ДетальныеЗаписи = ТочкаВторойУровень.Точки.Добавить();
						СоответствиеТочек.Вставить(ВыборкаДанные.ОбъектРемонта, ТочкаВторойУровень.Точки.Индекс(ДетальныеЗаписи));
					Иначе
						ДетальныеЗаписи = ТочкаВторойУровень.Точки.Получить(СоответствиеТочек.Получить(ВыборкаДанные.ОбъектРемонта));
					КонецЕсли; 
					
					Текст = ВыборкаДанные.ОбъектРемонта;
					
				Иначе
					Если СоответствиеТочек.Получить(ВыборкаДанные.ВидРемонта) = Неопределено Тогда
						ДетальныеЗаписи = ТочкаВторойУровень.Точки.Добавить();
						СоответствиеТочек.Вставить(ВыборкаДанные.ВидРемонта, ТочкаВторойУровень.Точки.Индекс(ДетальныеЗаписи));
					Иначе
						ДетальныеЗаписи = ТочкаВторойУровень.Точки.Получить(СоответствиеТочек.Получить(ВыборкаДанные.ВидРемонта));
					КонецЕсли; 
					
					Текст = ВыборкаДанные.ВидРемонта;		
					
				КонецЕсли;
				
				ДетальныеЗаписи.Текст = Текст;
				
				ВставитьИнтервал(Диаграмма, ВыборкаДанные,ТочкаПервыйУровень, ТочкаВторойУровень, ДетальныеЗаписи, СерияРемонт, ТекДата);
				
			КонецЦикла; 
			
		КонецЦикла; 
	КонецЦикла; 
КонецПроцедуры // ПостроитьДиаграммуГантаДляППР()

 &НаСервере
Процедура ВставитьИнтервал(Диаграмма, Выборка, ТочкаОРР, ТочкаВРР, ДетЗаписи, СерияРемонт, ТекДата)
	
	ЦветВыполненогоППР 						= WebЦвета.Синий;
	ЦветЗапланированногоППР 				= WebЦвета.Васильковый;	
	
	ЦветВыполненогоМероприятия 				= WebЦвета.ТемноЗеленый;
	ЦветЗапланированногоМероприятия			= WebЦвета.ЖелтоЗеленый;	
	
	ЦветВыполненогоСметыПоДефектам 			= WebЦвета.Красный;
	ЦветЗапланированногоСметыПоДефектам 	= WebЦвета.Кирпичный;
	
	ЦветВыполненогоСметыПоПредписаниям		= WebЦвета.Желтый;
	ЦветЗапланированногоСметыПоПредписаниям	= WebЦвета.Оранжевый; 	
	
	ЦветВыполненого				= WebЦвета.Синий;	
	ЦветИзмененного 			= WebЦвета.Томатный;
	ЦветОтмененного 			= WebЦвета.Красный;
	ЦветЗапланированного 		= WebЦвета.Васильковый;
	ЦветЗамещенногоИсходного 	= WebЦвета.СеребристоСерый;
	ЦветИсходного 				= WebЦвета.ГолубойСоСтальнымОттенком;
	ЦветЗамещенного 			= WebЦвета.СветлоСерый;

	
	ЦветИнтервала = ЦветЗапланированного;
	ТекДата = ТекущаяДата();
	
	Если Выборка.НезапланированныйРемонт Тогда
	    ЦветИнтервала = WebЦвета.ТемноСерый;
	ИначеЕсли Выборка.ИсточникДанных = "ППР" Тогда
		ЦветИнтервала = ?(КонецДня(Выборка.ДатаОкончания) < ТекДата, ЦветВыполненогоППР,  ЦветЗапланированногоППР);	
	ИначеЕсли Выборка.ИсточникДанных = "РМ" Тогда
		ЦветИнтервала = ?(КонецДня(Выборка.ДатаОкончания) < ТекДата, ЦветВыполненогоМероприятия,  ЦветЗапланированногоМероприятия);	
	ИначеЕсли Выборка.ИсточникДанных = "СПД" Тогда
		ЦветИнтервала = ?(Выборка.ДатаОкончания < ТекДата, ЦветВыполненогоСметыПоДефектам,  ЦветЗапланированногоСметыПоДефектам);
	ИначеЕсли Выборка.ИсточникДанных = "СПВО" Тогда
		ЦветИнтервала = ?(Выборка.ДатаОкончания < ТекДата, ЦветВыполненогоСметыПоПредписаниям,  ЦветЗапланированногоСметыПоПредписаниям);
	КонецЕсли;
	
	Значение = Диаграмма.ПолучитьЗначение(ТочкаОРР, СерияРемонт);
	Значение.Редактирование = Ложь;
	
	Интервал = Значение.Добавить();
	Интервал.Начало = Выборка.ДатаНачала;
	Интервал.Конец = ?(Выборка.ДатаОкончания > Выборка.ДатаНачала, Выборка.ДатаОкончания, Выборка.ДатаНачала + 3600);
	
	Если Выборка.ИсточникДанных <> "СПВО" И Выборка.ИсточникДанных <> "СПД" Тогда
		Интервал.Конец = КонецДня(Интервал.Конец);
	КонецЕсли;
	
	Интервал.Цвет   = ЦветИнтервала;	
	Интервал.Текст  = Строка(Интервал.Начало) + " - " + Строка(Интервал.Конец); 					
	
	Значение = Диаграмма.ПолучитьЗначение(ТочкаВРР, СерияРемонт);
	Значение.Редактирование = Ложь;
	
	Интервал = Значение.Добавить();
	Интервал.Начало = Выборка.ДатаНачала;
	Интервал.Конец  = ?(Выборка.ДатаОкончания > Выборка.ДатаНачала, Выборка.ДатаОкончания, Выборка.ДатаНачала + 3600);
	
	Если Выборка.ИсточникДанных <> "СПВО" И Выборка.ИсточникДанных <> "СПД" Тогда
		Интервал.Конец = КонецДня(Интервал.Конец);
	КонецЕсли;
	
	Интервал.Цвет   = ЦветИнтервала;		
	Интервал.Текст  = Строка(Интервал.Начало) + " - " + Строка(Интервал.Конец); 					

	Значение = Диаграмма.ПолучитьЗначение(ДетЗаписи, СерияРемонт);
	Значение.Редактирование = Ложь;
	
	Интервал = Значение.Добавить();
	Интервал.Начало = Выборка.ДатаНачала;
	Интервал.Конец  = ?(Выборка.ДатаОкончания > Выборка.ДатаНачала, Выборка.ДатаОкончания, Выборка.ДатаНачала + 3600);
	
	Если Выборка.ИсточникДанных <> "СПВО" И Выборка.ИсточникДанных <> "СПД" Тогда
		Интервал.Конец = КонецДня(Интервал.Конец);
	КонецЕсли;
	
	Интервал.Цвет   = ЦветИнтервала;		
	Интервал.Текст  = Строка(Интервал.Начало) + " - " + Строка(Интервал.Конец); 					
	Интервал.Расшифровка = Выборка.ID_Ремонта;
	
КонецПроцедуры
 
&НаКлиенте 
Процедура ОбновитьЗаголовокКнопкиПланРабот()
	Элементы.ВыбратьПланРабот.Заголовок = ?(ЗначениеЗаполнено(ПланРабот), Строка(ПланРабот), НСтр("es='Escoger el plan de los trabajos';ru='Выбрать план работ';en='Choose a work plan'"));
	
	Элементы.Организация.ТолькоПросмотр = ЗначениеЗаполнено(ПланРабот);
	Элементы.ВидПлана.ТолькоПросмотр = ЗначениеЗаполнено(ПланРабот);
	Элементы.ДатаОтсчета.ТолькоПросмотр = ЗначениеЗаполнено(ПланРабот);
КонецПроцедуры

&НаСервереБезКонтекста 
Функция ПолучитьСтруктуруДанныхИзСохраненногоПлана(ПланРабот)
	
	Запрос = Новый Запрос;
	# Область ТекстЗапроса
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_ПланРаботПодразделения.ОрганизацияПлана КАК Организация,
	               |	торо_ПланРаботПодразделения.ВидПлана КАК ВидПлана,
	               |	торо_ПланРаботПодразделения.ДатаОтсчета КАК ДатаОтсчета,
	               |	торо_ПланРаботПодразделения.ПериодичностьПланирования КАК Периодичность,
	               |	торо_ПланРаботПодразделения.ТочностьПланирования КАК Детализация,
	               |	торо_ПланРаботПодразделения.КоличествоПериодов КАК КоличествоПериодов,
	               |	торо_ПланРаботПодразделения.СписокВидовРемонта.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		ВидРемонта КАК ВидРемонта
	               |	) КАК СписокВидовРемонта
	               |ИЗ
	               |	Документ.торо_ПланРаботПодразделения КАК торо_ПланРаботПодразделения
	               |ГДЕ
	               |	торо_ПланРаботПодразделения.Ссылка = &ПланРабот";
	# КонецОбласти
	Запрос.УстановитьПараметр("ПланРабот", ПланРабот);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();                                                                                                                 
		СтруктураВозврата = Новый Структура("Организация, ВидПлана, ДатаОтсчета, Периодичность, Детализация, КоличествоПериодов, ВидыРемонтовМассив");
		
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);
		
		МассивВидовРемонтов = Новый Массив;
		
		ВыборкаРемонты = Выборка.СписокВидовРемонта.Выбрать();
		
		Пока ВыборкаРемонты.Следующий() Цикл
			МассивВидовРемонтов.Добавить(ВыборкаРемонты.ВидРемонта);	
		КонецЦикла; 
		
		СтруктураВозврата.ВидыРемонтовМассив = МассивВидовРемонтов;
		
		Возврат СтруктураВозврата;
		
	КонецЕсли; 
	
	Возврат Новый Структура;
КонецФункции //

&НаКлиенте 
Процедура ПроверитьДатыРемонтовВСтроке(ТекущиеДанные)
	
	Если ТекущиеДанные.ДатаНачала > ТекущиеДанные.ДатаОкончания Тогда
		Сообщение = Новый СообщениеПользователю;
		ТекстСообщения = НСтр("es='La fecha de la terminación de la reparación no puede ser antes de fecha del comienzo de la reparación';ru='Дата окончания ремонта не может быть раньше даты начала ремонта';en='The end date for repairs cannot be earlier than the start date for repairs'"); 
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить(); 
		ТекущиеДанные.ДатаОкончания = ТекущиеДанные.ДатаНачала;
	КонецЕсли; 
	
	Если ФОНазначениеНаРемонтыСУчетомРисков И ТекущиеДанные.КрайняяДатаЗавершения < ТекущиеДанные.ДатаОкончания Тогда
		Сообщение = Новый СообщениеПользователю;
		ТекстСообщения = НСтр("es='La fecha extrema de la terminación no puede ser antes de fecha de la terminación de la reparación';ru='Крайняя дата завершения не может быть раньше даты окончания ремонта';en='The deadline for completion cannot be earlier than the end date for repairs.'"); 
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить(); 
		ТекущиеДанные.КрайняяДатаЗавершения = ТекущиеДанные.ДатаОкончания;
	КонецЕсли; 
		
КонецПроцедуры

&НаСервере
Процедура ДиаграммаГантаПодразделенияПриОкончанииРедактированияИнтервалаНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти
