// >> [Деснол] [КПИ] [19.11.2020]
&НаСервере
Процедура Расш_гкс_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	ДобавитьНовыеЭлементы();
КонецПроцедуры
// << [Деснол] [КПИ] [19.11.2020]

// >> [Деснол] [КПИ] [19.11.2020]
&НаСервере
Процедура ДобавитьНовыеЭлементы()
	НЭлем = Элементы.Добавить("гкс_ГруппаКод", Тип("ГруппаФормы"));
	НЭлем.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НЭлем.ОтображатьЗаголовок = Ложь;
	Элементы.Переместить(Элементы.Код, Элементы["гкс_ГруппаКод"]);
	Элементы.Переместить(Элементы["гкс_ГруппаКод"],ЭтаФорма,Элементы.Родитель);
	//
	НЭлем = Элементы.Добавить("гкс_ТипРабот", Тип("ПолеФормы"), Элементы["гкс_ГруппаКод"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Объект.гкс_ТипРабот";	
КонецПроцедуры
// << [Деснол] [КПИ] [19.11.2020]