
#Область СлужебныеПроцедурыИФункции

// Общее

Функция ВерсияОбмена()
	
	Возврат 2012;
	
КонецФункции

Функция ПроверитьДобавитьРегистрациюУстройства(ИДУстройства, ИмяУстройства, ИмяПользователя)
	УстановитьПривилегированныйРежим(Истина);
	
	СозданНовый = Ложь;
	
	Узел = ПолучитьУзелПланаОбмена(ИДУстройства);
	Если НЕ ЗначениеЗаполнено(Узел) Тогда
		НовыйУзел = ПланыОбмена.mobileBrigades.СоздатьУзел();
		НовыйУзел.ИДМобильногоУстройства = ИДУстройства;
		НовыйУзел.Наименование = ИДУстройства;
		НовыйУзел.ИмяУстройства = ИмяУстройства;
		НовыйУзел.ПоследнийПользователь = ИмяПользователя;
		НовыйУзел.ДатаПоследнегоСоединения = ТекущаяДата();
		НовыйУзел.УстановитьНовыйКод();
		НовыйУзел.Записать();
		Узел = НовыйУзел.Ссылка;
		СозданНовый = Истина;
	КонецЕсли;
	
	Если Не ИмяПользователя = Узел.ПоследнийПользователь Тогда
		
		ОбъектУзла = Узел.ПолучитьОбъект();
		ОбъектУзла.ДатаПоследнегоСоединения = ТекущаяДата();
		ОбъектУзла.ПоследнийПользователь = ИмяПользователя;
		
		Попытка
			ОбъектУзла.Записать();
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("es='La excepción';ru='Исключение';en='An exception'"), УровеньЖурналаРегистрации.Предупреждение, 
				Метаданные.WebСервисы.ExchangeMobileBrigades,,ОписаниеОшибки());
		КонецПопытки;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СозданНовый;
КонецФункции

Функция ПроверитьДобавитьРегистрациюУстройстваБригады(Запрос, ИмяУстройства, ИмяПользователя)
	Возврат Обработки.торо_МобильныеПриложения.ПроверитьДобавитьРегистрациюУстройстваБригады_Session(Запрос, ИмяУстройства, ИмяПользователя);
КонецФункции

Функция ПолучитьУзелПланаОбмена(ИДУстройства)
	Узел = ПланыОбмена.mobileBrigades.НайтиПоРеквизиту("ИДМобильногоУстройства", ИДУстройства);
	Возврат Узел;
КонецФункции

Функция Hello()
	
	СисИнфо = Новый СистемнаяИнформация;
	СтрокаВерсии = СисИнфо.ВерсияПриложения;
	ИмяОбработки = ?(Лев(СтрокаВерсии, 3) = "8.2" ИЛИ Лев(СтрокаВерсии, 3) = "8.3", "торо_ЗащитаУправлениеРемонтами82", "торо_ЗащитаУправлениеРемонтами");
	
	УИД = Строка(Новый УникальныйИдентификатор());
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	
	Ч0 = Строка(ГСЧ.СлучайноеЧисло(1,7));
	Ч0 = 3;
	КоличествоДней = Цел((ТекущаяДата() - Дата(2014,1,1,0,0,0))/86400);
		
	КоличествоДнейСтрока = Формат(КоличествоДней, "ЧГ=0");
	Пока СтрДлина(КоличествоДнейСтрока) <4 Цикл
		КоличествоДнейСтрока = "0"+КоличествоДнейСтрока;
	КонецЦикла;
	Ч1 =  Лев(КоличествоДнейСтрока,1);
	Ч2 =  Сред(КоличествоДнейСтрока,2,1);
	Ч3 =  Сред(КоличествоДнейСтрока,3,1);
	Ч4 =  Прав(КоличествоДнейСтрока,1);
	
	Уид = Строка(Ч0)+ Сред(УИД,2,Ч0)+Ч1+Сред(УИД,Ч0+2,Ч0)+Ч2+Сред(УИД,Ч0*2+2,Ч0)+Ч3+Сред(УИД,Ч0*3+2,Ч0)+Ч4+ Прав(УИД,31-Ч0*4);
	
	Возврат Уид;
	
КонецФункции

// Выгрузка данных в МП

Функция ПолучитьОР(Все, ИДУстройства)
	
	Если Все Тогда
		Возврат ПолучитьВсеОР();
	КонецЕсли;
	
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокОР");
	ТипОР = ФабрикаXDTO.Тип("android", "ОР");
	
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	Узел = ПолучитьУзелПланаОбмена(ИДУстройства);
	Выборка = ПланыОбмена.ВыбратьИзменения(Узел,1, Метаданные.Справочники.торо_ОбъектыРемонта);

	Пока Выборка.Следующий() Цикл
		
		Попытка
			ТекущийОР = Выборка.Получить();
		Исключение
			УдалитьРегистрациюИзмененийПривилегированно(Узел, Выборка);
			Продолжить;
		КонецПопытки;
		
		Если ТипЗнч(ТекущийОР) = Тип("УдалениеОбъекта") Тогда
			// Удаление объекта не передаем в основную ИБ.
			ПланыОбмена.УдалитьРегистрациюИзменений(Узел, ТекущийОР);
			Продолжить;
		КонецЕсли;
		
		ОР = ФабрикаXDTO.Создать(ТипОР);
		ОР.ГУИД = Строка(ТекущийОР.Ссылка.УникальныйИдентификатор());
		ОР.Код = ТекущийОР.Код;
		ОР.Наименование =ТекущийОР.Наименование;
		ОР.РодительКод = ?(ЗначениеЗаполнено(ТекущийОР.Родитель),ТекущийОР.Родитель.Код,0);
		ОР.Организация    = ?(ЗначениеЗаполнено(ТекущийОР.Организация),ТекущийОР.Организация.Код,0);
		ОР.ЭтоГруппа = ТекущийОР.ЭтоГруппа;
		ОР.ПометкаУдаления = ТекущийОР.ПометкаУдаления;
		Если НЕ ТекущийОР.ЭтоГруппа Тогда
			ОР.ДатаВыпуска = ТекущийОР.ДатаВыпуска;
			ОР.РемонтнаяГруппа =?(ЗначениеЗаполнено(ТекущийОР.ТиповойОР),ТекущийОР.ТиповойОР.Код,0);
			ОР.ИнвентарныйНомер = ТекущийОР.ИнвентарныйНомер;
			ОР.Комментарий    = ТекущийОР.Комментарий;
			ОР.Контрагент   = Строка(ТекущийОР.Контрагент);
			ОР.Подразделение    =?(ЗначениеЗаполнено(ТекущийОР.Подразделение),ТекущийОР.Подразделение.Код,0);
			ОР.ШтрихКод = ТекущийОР.ШтрихКод;
			ОР.ДатаВводаВЭксплуатацию = ТекущийОР.ДатаВводаВЭксплуатацию ;
			ОР.НомерПаспорта    = ТекущийОР.НомерПаспорта ;
			ОР.Направление    = ?(ЗначениеЗаполнено(ТекущийОР.Направление),ТекущийОР.Направление.Код,0);
			ОР.ЗаводскойНомер = ТекущийОР.ЗаводскойНомер;
			ОР.ТехНомер = ТекущийОР.ТехНомер;
			ОР.Широта = ТекущийОР.Широта;
			ОР.Долгота = ТекущийОР.Долгота;
			ОР.Высота = ТекущийОР.Высота;
			Если ЗначениеЗаполнено(ТекущийОР.Приоритет) Тогда
				ОР.Приоритет = Строка(ТекущийОР.Приоритет.УникальныйИдентификатор());
			Иначе
				ОР.Приоритет = Неопределено;
			КонецЕсли;
		КонецЕсли;
		Список.ОР.Добавить(ОР);
		
		ПланыОбмена.УдалитьРегистрациюИзменений(Узел, ТекущийОР);
	КонецЦикла;
	
	Если Список.ОР.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьВсеОР()
	
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокОР");
	ТипОР = ФабрикаXDTO.Тип("android", "ОР");	
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ОбъектыРемонта.Код КАК Код,
		|	торо_ОбъектыРемонта.Ссылка КАК Ссылка,
		|	торо_ОбъектыРемонта.Наименование КАК Наименование,
		|	торо_ОбъектыРемонта.Родитель КАК Родитель,
		|	торо_ОбъектыРемонта.ДатаВыпуска КАК ДатаВыпуска,
		|	торо_ОбъектыРемонта.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	торо_ОбъектыРемонта.Комментарий КАК Комментарий,
		|	торо_ОбъектыРемонта.Контрагент КАК Контрагент,
		|	торо_ОбъектыРемонта.Организация КАК Организация,
		|	торо_ОбъектыРемонта.Подразделение КАК Подразделение,
		|	торо_ОбъектыРемонта.ТиповойОР КАК ТиповойОР,
		|	торо_ОбъектыРемонта.ШтрихКод КАК ШтрихКод,
		|	торо_ОбъектыРемонта.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
		|	торо_ОбъектыРемонта.НомерПаспорта КАК НомерПаспорта,
		|	торо_ОбъектыРемонта.ЭтоГруппа КАК ЭтоГруппа,
		|	торо_ОбъектыРемонта.Направление КАК Направление,
		|	торо_ОбъектыРемонта.ЗаводскойНомер КАК ЗаводскойНомер,
		|	торо_ОбъектыРемонта.ТехНомер КАК ТехНомер,
		|	торо_ОбъектыРемонта.ПометкаУдаления КАК ПометкаУдаления,
		|	торо_ОбъектыРемонта.Широта КАК Широта,
		|	торо_ОбъектыРемонта.Долгота КАК Долгота,
		|	торо_ОбъектыРемонта.Высота КАК Высота,
		|	торо_ОбъектыРемонта.Приоритет КАК Приоритет
		|ИЗ
		|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|
		|УПОРЯДОЧИТЬ ПО
		|	торо_ОбъектыРемонта.ЭтоГруппа ИЕРАРХИЯ,
		|	торо_ОбъектыРемонта.Наименование";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();

	Пока Выборка.Следующий() Цикл
		ОР = ФабрикаXDTO.Создать(ТипОР);
		ОР.ГУИД = Строка(Выборка.Ссылка.УникальныйИдентификатор());
		ОР.Код = Выборка.Код;
		ОР.Наименование =Выборка.Наименование;
		ОР.РодительКод = ?(ЗначениеЗаполнено(Выборка.Родитель),Выборка.Родитель.Код,0);
		ОР.Организация    = ?(ЗначениеЗаполнено(Выборка.Организация),Выборка.Организация.Код,0);
		ОР.ЭтоГруппа = Выборка.ЭтоГруппа;
		ОР.ПометкаУдаления = Выборка.ПометкаУдаления;
		Если НЕ Выборка.ЭтоГруппа Тогда
			ОР.ДатаВыпуска = Выборка.ДатаВыпуска;
			ОР.РемонтнаяГруппа = ?(ЗначениеЗаполнено(Выборка.ТиповойОР),Выборка.ТиповойОР.Код,0);
			ОР.ИнвентарныйНомер = Выборка.ИнвентарныйНомер;
			ОР.Комментарий    = Выборка.Комментарий;
			ОР.Контрагент   = Строка(Выборка.Контрагент);
			ОР.Подразделение    =?(ЗначениеЗаполнено(Выборка.Подразделение),Выборка.Подразделение.Код,0);
			ОР.ШтрихКод = Выборка.ШтрихКод;
			ОР.ДатаВводаВЭксплуатацию = Выборка.ДатаВводаВЭксплуатацию;
			ОР.НомерПаспорта    = Выборка.НомерПаспорта;
			ОР.Направление    = ?(ЗначениеЗаполнено(Выборка.Направление),Выборка.Направление.Код,0);
			ОР.ЗаводскойНомер = Выборка.ЗаводскойНомер;
			ОР.ТехНомер = Выборка.ТехНомер;
			ОР.Широта = Выборка.Широта;
			ОР.Долгота = Выборка.Долгота;
			ОР.Высота = Выборка.Высота;
			Если ЗначениеЗаполнено(Выборка.Приоритет) Тогда
				ОР.Приоритет = Строка(Выборка.Приоритет.УникальныйИдентификатор());
			Иначе
				ОР.Приоритет = Неопределено;
			КонецЕсли;
		КонецЕсли;
		Список.ОР.Добавить(ОР);		
	КонецЦикла;
	
	Если Список.ОР.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьОрганизации(Все, ИДУстройства)
	
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокОрганизаций");
	ТипФабрики = ФабрикаXDTO.Тип("android", "Организации");	
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	ЗаполнитьСписокДаннымиБазовогоСправочника(Все, ИДУстройства, Список.Организации, ТипФабрики, "Организации");
	
	Если Список.Организации.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьВидыДефектов(Все, ИДУстройства)
	
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокВидовДефектов");
	ТипФабрики = ФабрикаXDTO.Тип("android", "ВидыДефектов");	
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	ЗаполнитьСписокДаннымиБазовогоСправочника(Все, ИДУстройства, Список.ВидыДефектов, ТипФабрики, "торо_ВидыДефектов",, Истина);
		
	Если Список.ВидыДефектов.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСклады(Все, ИДУстройства)
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокСкладов");
	ТипФабрики = ФабрикаXDTO.Тип("android", "Склады");	
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	ИмяСправочника = "Склады";
	
	Если Все Тогда
		Выборка = Справочники[ИмяСправочника].Выбрать();	
	Иначе
		Узел = ПолучитьУзелПланаОбмена(ИДУстройства);
		Выборка = ПланыОбмена.ВыбратьИзменения(Узел, 1, Метаданные.Справочники[ИмяСправочника]);	
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		Если Все Тогда
			ТекущийОбъект = Выборка;
		Иначе
			ТекущийОбъект = Выборка.Получить();
			Если ТипЗнч(ТекущийОбъект) = Тип("УдалениеОбъекта") Тогда
				ПланыОбмена.УдалитьРегистрациюИзменений(Узел, ТекущийОбъект);
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если ТекущийОбъект = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ДобавляемыйОбъект = ФабрикаXDTO.Создать(ТипФабрики);
		ДобавляемыйОбъект.УИД = Строка(ТекущийОбъект.Ссылка.УникальныйИдентификатор());
		ДобавляемыйОбъект.Наименование = ТекущийОбъект.Наименование;
		ДобавляемыйОбъект.ЭтоГруппа = ТекущийОбъект.ЭтоГруппа;
		
		Если ЗначениеЗаполнено(ТекущийОбъект.Родитель) Тогда
			ДобавляемыйОбъект.УИДРодителя = Строка(ТекущийОбъект.Родитель.УникальныйИдентификатор());
		Иначе
			ДобавляемыйОбъект.УИДРодителя = "";
		КонецЕсли;
		
		ДобавляемыйОбъект.ПометкаУдаления = ТекущийОбъект.ПометкаУдаления;
		
		Список.Склады.Добавить(ДобавляемыйОбъект);
		
		Если Не Все Тогда
			ПланыОбмена.УдалитьРегистрациюИзменений(Узел, ТекущийОбъект);
		КонецЕсли;
	КонецЦикла;
		
	Если Список.Склады.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;
КонецФункции

Функция ПолучитьВидыРемонтов(Все, ИДУстройства)
	
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокВидовРемонтов");
	ТипФабрики = ФабрикаXDTO.Тип("android", "ВидыРемонтов");	
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	ЗаполнитьСписокДаннымиБазовогоСправочника(Все, ИДУстройства, Список.ВидыРемонтов, ТипФабрики, "торо_ВидыРемонтов",, Истина);
		
	Если Список.ВидыРемонтов.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТехОперации(Все, ИДУстройства)
	
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокТехОпераций");
	ТипФабрики = ФабрикаXDTO.Тип("android", "ТехОперации");	
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	ЗаполнитьСписокДаннымиБазовогоСправочника(Все, ИДУстройства, Список.ТехОперации, ТипФабрики, "торо_ТехнологическиеОперации",, Истина);
		
	Если Список.ТехОперации.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТехКарты(Все, ИДУстройства)
	
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокТехКарт");
	ТипФабрики = ФабрикаXDTO.Тип("android", "ТехКарты");	
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	ЗаполнитьСписокДаннымиБазовогоСправочника(Все, ИДУстройства, Список.ТехКарты, ТипФабрики, "торо_ИдентификаторыТехКарт",, Истина);
		
	Если Список.ТехКарты.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьЕдиницыИзмерения(Все, ИДУстройства)
	
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокЕдиницИзмерения");
	ТипФабрики = ФабрикаXDTO.Тип("android", "ЕдиницыИзмерения");	
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	ЗаполнитьСписокДаннымиБазовогоСправочника(Все, ИДУстройства, Список.ЕдиницыИзмерения, ТипФабрики, "ЕдиницыИзмерения");
	
	Если Список.ЕдиницыИзмерения.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;

КонецФункции

Функция ПолучитьНоменклатуру(Все, ИДУстройства)
		
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокНоменклатуры");
	ТипФабрики = ФабрикаXDTO.Тип("android", "Номенклатура");	
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	ЗаполнитьСписокДаннымиБазовогоСправочника(Все, ИДУстройства, Список.Номенклатура, ТипФабрики, "Номенклатура",, Истина);
		
	Если Список.Номенклатура.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьИспользованиеХарактеристик()

	Возврат Константы.торо_ИспользоватьХарактеристикиНоменклатуры.Получить();
	
КонецФункции

Функция ПолучитьВидыНоменклатуры(Все, ИДУстройства)
		
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокВидовНоменклатуры");
	ТипФабрики = ФабрикаXDTO.Тип("android", "ВидыНоменклатуры");	
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	ЗаполнитьСписокДаннымиБазовогоСправочника(Все, ИДУстройства, Список.ВидыНоменклатуры, ТипФабрики, "ВидыНоменклатуры",, Истина);
		
	Если Список.ВидыНоменклатуры.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;

КонецФункции

Функция ПолучитьХарактеристикиНоменклатуры(Все, ИДУстройства)
	
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокХарактеристикНоменклатуры");
	ТипФабрики = ФабрикаXDTO.Тип("android", "ХарактеристикиНоменклатуры");
	Список = ФабрикаXDTO.Создать(ТипСписок);

	ЗаполнитьСписокДаннымиБазовогоСправочника(Все, ИДУстройства, Список.ХарактеристикиНоменклатуры, ТипФабрики, "ХарактеристикиНоменклатуры");
	
	Если Список.ХарактеристикиНоменклатуры.Количество() = 0 Тогда 
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьПричиныДефектов(Все, ИДУстройства)
	
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокПричинДефектов");
	ТипФабрики = ФабрикаXDTO.Тип("android", "ПричиныДефектов");	
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	ЗаполнитьСписокДаннымиБазовогоСправочника(Все, ИДУстройства, Список.ПричиныДефектов, ТипФабрики, "торо_ПричиныДефектов");
		
	Если Список.ПричиныДефектов.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьРемонтныеГруппы(Все, ИДУстройства)
	
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокРемонтныхГрупп");
	ТипФабрики = ФабрикаXDTO.Тип("android", "РемонтныеГруппы");	
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	ЗаполнитьСписокДаннымиБазовогоСправочника(Все, ИДУстройства, Список.РемонтныеГруппы, ТипФабрики, "торо_ТиповыеОР",,Истина);
		
	Если Список.РемонтныеГруппы.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;
		
КонецФункции

Функция ПолучитьКритичностиДефектов(Все, ИДУстройства)
	
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокКритичностейДефекта");
	ТипФабрики = ФабрикаXDTO.Тип("android", "КритичностиДефекта");	
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	ЗаполнитьСписокДаннымиБазовогоСправочника(Все, ИДУстройства, Список.КритичностиДефекта, ТипФабрики, "торо_КритичностьДефекта");
		
	Если Список.КритичностиДефекта.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьУсловияВыявления(Все, ИДУстройства)
	
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокУсловийВыявленияДефекта");
	ТипФабрики = ФабрикаXDTO.Тип("android", "УсловияВыявленияДефекта");	
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	ЗаполнитьСписокДаннымиБазовогоСправочника(Все, ИДУстройства, Список.УсловияВыявленияДефекта, ТипФабрики, "торо_УсловияВыявленияДефекта");
			
	Если Список.УсловияВыявленияДефекта.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьПодразделения(Все, ИДУстройства)
	
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокПодразделений");
	ТипФабрики = ФабрикаXDTO.Тип("android", "Подразделения");	
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	ЗаполнитьСписокДаннымиБазовогоСправочника(Все, ИДУстройства, Список.Подразделения, ТипФабрики, "СтруктураПредприятия",,Истина);
	
	Если Список.Подразделения.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьБригады(Все, ИДУстройства)
	
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокБригад");
	ТипФабрики = ФабрикаXDTO.Тип("android", "РемонтныеБригады");	
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	ЗаполнитьСписокДаннымиБазовогоСправочника(Все, ИДУстройства, Список.Элементы, ТипФабрики, "торо_РемонтныеБригады",,Истина, Истина);
	
	Если Список.Элементы.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьНаправления(Все, ИДУстройства)
	
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокНаправления");
	ТипФабрики = ФабрикаXDTO.Тип("android", "Направления");
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	ЗаполнитьСписокДаннымиБазовогоСправочника(Все, ИДУстройства, Список.Направления, ТипФабрики, "торо_НаправленияОбъектовРемонтныхРабот");
		
	Если Список.Направления.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьПриоритетыОР(Все, ИДУстройства)
	
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокПриоритетовОР");
	ТипФабрики = ФабрикаXDTO.Тип("android", "ПриоритетыОР");	
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	ЗаполнитьСписокДаннымиБазовогоСправочника(Все, ИДУстройства, Список.ПриоритетыОР, ТипФабрики, "торо_ПриоритетыОбъектовРемонта");
		
	Если Список.ПриоритетыОР.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСтруктуруИерархии(ИмяПользователя)
	
	ТипСтруктура = ФабрикаXDTO.Тип("android", "СтруктураИерархии");
	СтруктураИерархии = ФабрикаXDTO.Создать(ТипСтруктура);
	
	ИерархияДляМобильногоПриложения = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"НастройкиТОиР",
		"ИерархияДляМобильногоПриложения",
		Справочники.торо_СтруктурыОР.ПустаяСсылка(),,
		ИмяПользователя);
		
	Если ЗначениеЗаполнено(ИерархияДляМобильногоПриложения) Тогда
		СтруктураИерархии.Ссылка = Строка(ИерархияДляМобильногоПриложения.УникальныйИдентификатор());
		СтруктураИерархии.Наименование = ИерархияДляМобильногоПриложения.Наименование;
	Иначе
		СтруктураИерархии.Ссылка = "";
		СтруктураИерархии.Наименование = "";
	КонецЕсли;	
	
	Возврат СтруктураИерархии;	
		
КонецФункции

Функция ПолучитьИерархиюОР(Все, ИДУстройства, ИДСтруктуры, СписокОР)
	
	СтруктураИерархии = Справочники.торо_СтруктурыОР.ПолучитьСсылку(Новый УникальныйИдентификатор(ИДСтруктуры));
	Если НЕ ЗначениеЗаполнено(СтруктураИерархии) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИзменяетсяДокументами = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураИерархии, "ИзменяетсяДокументами");
	
	ТипСписок = ФабрикаXDTO.Тип("android", "ИерархияОРСписок");
	ТипФабрики = ФабрикаXDTO.Тип("android", "ЭлементИерархииОР");
	ТипОР = ФабрикаXDTO.Тип("android", "ОР");
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	Если СписокОР <> Неопределено Тогда
		
		СписокОРДляОбновления = Новый Массив;
		Для каждого ЭлементСписка из СписокОР.ОР Цикл
			ОбъектРемонта = Справочники.торо_ОбъектыРемонта.ПолучитьСсылку(Новый УникальныйИдентификатор(ЭлементСписка.ГУИД));
			СписокОРДляОбновления.Добавить(ОбъектРемонта);
		КонецЦикла;
				
		Выборка = ПолучитьВыборкуДанныхИерархииИзРегистра(СтруктураИерархии, ИзменяетсяДокументами, СписокОРДляОбновления);
		
	ИначеЕсли Все Тогда
		
		Выборка = ПолучитьВыборкуДанныхИерархииИзРегистра(СтруктураИерархии, ИзменяетсяДокументами);
		
	Иначе
		
		Узел = ПолучитьУзелПланаОбмена(ИДУстройства);
		
		Если ИзменяетсяДокументами = Истина Тогда
			ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(Узел,1,Метаданные.РегистрыСведений.торо_РасположениеОРВСтруктуреИерархии);
			// данные второго регистра не нужны, очищаем сразу
			ПланыОбмена.УдалитьРегистрациюИзменений(Узел, Метаданные.РегистрыСведений.торо_ИерархическиеСтруктурыОР);
		Иначе
			ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(Узел,1,Метаданные.РегистрыСведений.торо_ИерархическиеСтруктурыОР);
			// данные второго регистра не нужны, очищаем сразу
			ПланыОбмена.УдалитьРегистрациюИзменений(Узел, Метаданные.РегистрыСведений.торо_РасположениеОРВСтруктуреИерархии);
		КонецЕсли;
		
		СписокОРДляОбновления = Новый Массив;
		
		Пока ВыборкаИзменений.Следующий() Цикл
			НаборЗаписей = ВыборкаИзменений.Получить();
			
			Если ТипЗнч(НаборЗаписей) = Тип("УдалениеОбъекта") Тогда
				СписокОРДляОбновления.Добавить(НаборЗаписей.Ссылка);
			ИначеЕсли ТипЗнч(НаборЗаписей) = Тип("РегистрСведенийНаборЗаписей.торо_ИерархическиеСтруктурыОР") 
				ИЛИ ТипЗнч(НаборЗаписей) = Тип("РегистрСведенийНаборЗаписей.торо_РасположениеОРВСтруктуреИерархии") Тогда
				Для каждого Запись из НаборЗаписей Цикл
					СписокОРДляОбновления.Добавить(Запись.ОбъектИерархии);
				КонецЦикла;
			КонецЕсли;
			
			ПланыОбмена.УдалитьРегистрациюИзменений(Узел, НаборЗаписей);
		КонецЦикла;	

		Выборка = ПолучитьВыборкуДанныхИерархииИзРегистра(СтруктураИерархии, ИзменяетсяДокументами, СписокОРДляОбновления);
		
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		ДобавляемыйОбъект = ФабрикаXDTO.Создать(ТипФабрики);
		
		ОбъектРемонта = ФабрикаXDTO.Создать(ТипОР);
		ОбъектРемонта.ГУИД = Строка(Выборка.ОбъектРемонта.УникальныйИдентификатор());
		ОбъектРемонта.Код = Выборка.ОбъектРемонтаКод;
		ОбъектРемонта.Наименование = Выборка.ОбъектРемонтаНаименование;
		ОбъектРемонта.ЭтоГруппа = Выборка.ОбъектРемонтаЭтоГруппа;
		ДобавляемыйОбъект.ОбъектРемонта = ОбъектРемонта;
		
		Если Выборка.НеВИерархии = Истина Тогда
			ДобавляемыйОбъект.Родитель = Неопределено;
		Иначе
			Родитель = ФабрикаXDTO.Создать(ТипОР);
			Если ЗначениеЗаполнено(Выборка.Родитель) Тогда
				Родитель.Код = Выборка.РодительКод;
				Родитель.Наименование = Выборка.РодительНаименование;
				Родитель.ЭтоГруппа = Выборка.РодительЭтоГруппа;
			Иначе
				Родитель.Код = "";
				Родитель.Наименование = "";
				Родитель.ЭтоГруппа = Ложь;
			КонецЕсли;
			ДобавляемыйОбъект.Родитель = Родитель;
		КонецЕсли;
		
		Список.ИерархияОР.Добавить(ДобавляемыйОбъект);							
	КонецЦикла;
	
	Возврат Список;
	
КонецФункции

Функция ПолучитьСостояниеОР(КодОбъектаРемонта)
	
	ОбъектРемонта = НайтиОРпоКоду(КодОбъектаРемонта);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_ТекущееСостояниеОРСрезПоследних.ВидЭксплуатации КАК ВидЭксплуатации
	               |ИЗ
	               |	РегистрСведений.торо_ТекущееСостояниеОР.СрезПоследних(&ТекущаяДата, ОбъектРемонта = &ОбъектРемонта) КАК торо_ТекущееСостояниеОРСрезПоследних";
	
	Запрос.УстановитьПараметр("ОбъектРемонта", ОбъектРемонта);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Строка(Выборка.ВидЭксплуатации);
		
	Иначе
	
		Возврат "Данные недоступны";
	
	КонецЕсли;
	
КонецФункции

Функция ПолучитьВерсииТехКарт(Все, ИДУстройства)
	
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокВерсийТехКарт");
	ТипФабрики = ФабрикаXDTO.Тип("android", "ВерсииТехКарт");
	ОперацииТипСписок = ФабрикаXDTO.Тип("android", "СписокОперацийТехКарты");
	ОперацииТипФабрики = ФабрикаXDTO.Тип("android", "ОперацииТехКарты");
	ФайлыТипСписок = ФабрикаXDTO.Тип("android", "СписокФайловТехКарты");
	ФайлыТипФабрики = ФабрикаXDTO.Тип("android", "ФайлыТехКарты");
	
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_ТехКарты.Ссылка КАК Ссылка,
	               |	торо_ТехКартыСписокОпераций.ID КАК ID,
	               |	торо_ТехКартыСписокОпераций.Операция КАК Операция,
	               |	торо_ТехКартыСписокОпераций.Продолжительность КАК Продолжительность,
	               |	торо_ТехКартыСписокОпераций.Количество КАК Количество,
	               |	торо_ТехКартыСписокОпераций.НормаВремениВСекундах КАК НормаВремениВСекундах,
	               |	торо_ТехКарты.ДатаПринятия КАК ДатаПринятия
	               |ИЗ
	               |	Справочник.торо_ТехКарты КАК торо_ТехКарты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ТехКарты.СписокОпераций КАК торо_ТехКартыСписокОпераций
	               |		ПО торо_ТехКартыСписокОпераций.Ссылка = торо_ТехКарты.Ссылка";
	
	ЗапросДляФайлов = Новый Запрос;
	ЗапросДляФайлов.Текст = "ВЫБРАТЬ
	                         |	торо_ТехКартыПрисоединенныеФайлы.Ссылка КАК Ссылка,
							 |  торо_ТехКартыПрисоединенныеФайлы.ВладелецФайла КАК Владелец, 
	                         |	торо_ТехКартыПрисоединенныеФайлы.Наименование КАК Наименование,
	                         |	торо_ТехКартыПрисоединенныеФайлы.Расширение КАК Расширение
	                         |ИЗ
	                         |	Справочник.торо_ТехКартыПрисоединенныеФайлы КАК торо_ТехКартыПрисоединенныеФайлы
	                         |ГДЕ
	                         |	НЕ торо_ТехКартыПрисоединенныеФайлы.ПометкаУдаления";

	
	Если НЕ Все Тогда
		
		ТипМетаданных = Метаданные.Справочники.торо_ТехКарты;
		
		Узел = ПолучитьУзелПланаОбмена(ИДУстройства);
		Выборка = ПланыОбмена.ВыбратьИзменения(Узел, 1, ТипМетаданных);
		
		МассивСсылок = Новый Массив;
		МассивОбъектов = Новый Соответствие;
		
		Пока Выборка.Следующий() Цикл
			ТекущийОбъект = Выборка.Получить();
			
			Если ТипЗнч(ТекущийОбъект) = Тип("УдалениеОбъекта") Тогда
				ПланыОбмена.УдалитьРегистрациюИзменений(Узел, ТекущийОбъект);
				Продолжить;
			КонецЕсли;
			
			Если ТекущийОбъект = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			МассивСсылок.Добавить(ТекущийОбъект.Ссылка);
			МассивОбъектов.Вставить(ТекущийОбъект.Ссылка, ТекущийОбъект);
		КонецЦикла;
		
		Запрос.Текст = Запрос.Текст + " ГДЕ торо_ТехКарты.Ссылка В(&МассивСсылок)";
		Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
		
		ЗапросДляФайлов.Текст = ЗапросДляФайлов.Текст + " И торо_ТехКартыПрисоединенныеФайлы.ВладелецФайла В(&МассивСсылок)";
		ЗапросДляФайлов.УстановитьПараметр("МассивСсылок", МассивСсылок);
		
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + " ИТОГИ ПО Ссылка";
	
	Результат = Запрос.Выполнить();
	ВыборкаЭлементов = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаФайлов = ЗапросДляФайлов.Выполнить().Выбрать();
	
	Пока ВыборкаЭлементов.Следующий() Цикл
		
		ДобавляемыйОбъект = ФабрикаXDTO.Создать(ТипФабрики);
		
		ТехКарта = ВыборкаЭлементов.Ссылка;
		
		ДобавляемыйОбъект.ГУИД =				Строка(ТехКарта.УникальныйИдентификатор());
		ДобавляемыйОбъект.Код =					ТехКарта.Код;
		ДобавляемыйОбъект.Наименование =		ТехКарта.Наименование;
		ДобавляемыйОбъект.ЭтоГруппа =			ТехКарта.ЭтоГруппа;
		ДобавляемыйОбъект.ПометкаУдаления =		ТехКарта.ПометкаУдаления;
		
		ДобавляемыйОбъект.ДатаПринятия = 		ВыборкаЭлементов.ДатаПринятия;
		
		Если НЕ ЗначениеЗаполнено(ТехКарта.Родитель) Тогда
			ДобавляемыйОбъект.Родитель = Неопределено;
		Иначе
			ОбъектРодитель = ФабрикаXDTO.Создать(ТипФабрики);
			
			ОбъектРодитель.Родитель = Неопределено;
			ОбъектРодитель.Код = ТехКарта.Родитель.Код;
			ОбъектРодитель.Наименование = ТехКарта.Родитель.Наименование;
			
			ДобавляемыйОбъект.Родитель = ОбъектРодитель;
		КонецЕсли;
		
		ФайлыТК = ФабрикаXDTO.Создать(ФайлыТипСписок);
		Пока ВыборкаФайлов.Следующий() Цикл
			Если ВыборкаФайлов.Владелец = ТехКарта Тогда
				Файл = ФабрикаXDTO.Создать(ФайлыТипФабрики);
				
				Файл.ГУИД = Строка(ВыборкаФайлов.Ссылка.УникальныйИдентификатор());
				Файл.Наименование = ВыборкаФайлов.Наименование;
				Файл.Расширение = ВыборкаФайлов.Расширение;
				
				ФайлыТК.ФайлыТехКарты.Добавить(Файл);
			КонецЕсли;
		КонецЦикла;	
		ВыборкаФайлов.Сбросить();
		ДобавляемыйОбъект.Файлы = ФайлыТК;
		
		Операции = ФабрикаXDTO.Создать(ОперацииТипСписок);
		
		ВыборкаОпераций = ВыборкаЭлементов.Выбрать();
		
		Пока ВыборкаОпераций.Следующий() Цикл
			
			Если ВыборкаОпераций.ID = NULL
				Или ВыборкаОпераций.Операция = NULL
				Или ВыборкаОпераций.Продолжительность = NULL
				Или ВыборкаОпераций.НормаВремениВСекундах = NULL
				Или ВыборкаОпераций.Количество = NULL Тогда
				Продолжить;
			КонецЕсли;
			
			Операция = ФабрикаXDTO.Создать(ОперацииТипФабрики);
			
			Операция.ID = ВыборкаОпераций.ID;
			Операция.Продолжительность = ВыборкаОпераций.Продолжительность;
			Операция.НормаВремениВСекундах = ВыборкаОпераций.НормаВремениВСекундах;
			Операция.Количество= ВыборкаОпераций.Количество;
			
			Если ТипЗнч(ВыборкаОпераций.Операция) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
				Операция.Операция = "о";
			ИначеЕсли ТипЗнч(ВыборкаОпераций.Операция) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда
				Операция.Операция = "т";
			КонецЕсли;
			
			Операция.ГУИД = Строка(ВыборкаОпераций.Операция.УникальныйИдентификатор());
			
			Операции.ОперацииТехКарты.Добавить(Операция);
			
		КонецЦикла;
		
		ДобавляемыйОбъект.Операции = Операции;
		
		Список.ВерсииТехКарт.Добавить(ДобавляемыйОбъект);
		
		Если НЕ Все Тогда
			Если Не МассивОбъектов[ТехКарта] = Неопределено Тогда
				ПланыОбмена.УдалитьРегистрациюИзменений(Узел, МассивОбъектов[ТехКарта]);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Список.ВерсииТехКарт.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьВерсииТехКарт_Регистр(Все, ИДУстройства)
	
	ТипСписок = ФабрикаXDTO.Тип("android", "рс_СписокВерсииТехКарт");
	ТипФабрики = ФабрикаXDTO.Тип("android", "рс_ВерсииТехКарт");	
	Список = ФабрикаXDTO.Создать(ТипСписок);	
	
	Если Все Тогда
		Выборка = РегистрыСведений.торо_ВерсииТехКарт.СрезПоследних();
		Если Выборка = Неопределено Тогда
			Возврат Неопределено;	
		КонецЕсли;
		Для каждого ТекущийОбъект из Выборка Цикл
			ДобавляемыйОбъект = ФабрикаXDTO.Создать(ТипФабрики); 
			ДобавляемыйОбъект.ИдентификаторТехКарты = ?(ЗначениеЗаполнено(ТекущийОбъект.ИдентификаторТехКарты), ТекущийОбъект.ИдентификаторТехКарты.Код, 0);
			ДобавляемыйОбъект.ТехКарта = ?(ЗначениеЗаполнено(ТекущийОбъект.ТехКарта),ТекущийОбъект.ТехКарта.Код, 0);
			ДобавляемыйОбъект.Период = ТекущийОбъект.Период;
			Список.рс_ВерсииТехКарт.Добавить(ДобавляемыйОбъект);							
		КонецЦикла;		
	Иначе
		Узел = ПолучитьУзелПланаОбмена(ИДУстройства);
		Выборка = ПланыОбмена.ВыбратьИзменения(Узел, 1, Метаданные.РегистрыСведений.торо_ВерсииТехКарт);
		Пока Выборка.Следующий() Цикл
			НаборЗаписей = Выборка.Получить();	
			
			Если ТипЗнч(НаборЗаписей) = Тип("УдалениеОбъекта") Тогда
				ПланыОбмена.УдалитьРегистрациюИзменений(Узел, НаборЗаписей);
				Продолжить;
			КонецЕсли;
			
			Если ТипЗнч(НаборЗаписей) = Тип("РегистрСведенийНаборЗаписей.торо_ВерсииТехКарт") Тогда
				Для каждого ТекущийОбъект из НаборЗаписей Цикл
					ДобавляемыйОбъект = ФабрикаXDTO.Создать(ТипФабрики); 
					ДобавляемыйОбъект.ИдентификаторТехКарты = ?(ЗначениеЗаполнено(ТекущийОбъект.ИдентификаторТехКарты),ТекущийОбъект.ИдентификаторТехКарты.Код, 0);
					ДобавляемыйОбъект.ТехКарта = ?(ЗначениеЗаполнено(ТекущийОбъект.ТехКарта),ТекущийОбъект.ТехКарта.Код, 0);
					ДобавляемыйОбъект.Период = ТекущийОбъект.Период;
					Список.рс_ВерсииТехКарт.Добавить(ДобавляемыйОбъект);
				КонецЦикла;
				
				ПланыОбмена.УдалитьРегистрациюИзменений(Узел, НаборЗаписей);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если Список.рс_ВерсииТехКарт.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСотрудников(Все, ИДУстройства)
	
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокСотрудников");
	ТипФабрики = ФабрикаXDTO.Тип("android", "Сотрудники");	
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	ЗаполнитьСписокДаннымиБазовогоСправочника(Все, ИДУстройства, Список.Сотрудники, ТипФабрики, "Сотрудники");
	
	Если Список.Сотрудники.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьКвалификации(Все, ИДУстройства)
	
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокКвалификаций");
	ТипФабрики = ФабрикаXDTO.Тип("android", "Квалификации");	
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	ЗаполнитьСписокДаннымиБазовогоСправочника(Все, ИДУстройства, Список.Квалификации, ТипФабрики, "торо_КвалификацииРемонтногоПерсонала");
	
	Если Список.Квалификации.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьОРПоШК(ШтрихКод)
	
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокОР");
	ТипОР = ФабрикаXDTO.Тип("android", "ОР");	
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ОбъектыРемонта.Код КАК Код,
	|	торо_ОбъектыРемонта.Ссылка КАК Ссылка,
	|	торо_ОбъектыРемонта.Наименование КАК Наименование,
	|	торо_ОбъектыРемонта.Родитель КАК Родитель,
	|	торо_ОбъектыРемонта.ДатаВыпуска КАК ДатаВыпуска,
	|	торо_ОбъектыРемонта.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	торо_ОбъектыРемонта.Комментарий КАК Комментарий,
	|	торо_ОбъектыРемонта.Контрагент КАК Контрагент,
	|	торо_ОбъектыРемонта.Организация КАК Организация,
	|	торо_ОбъектыРемонта.Подразделение КАК Подразделение,
	|	торо_ОбъектыРемонта.ТиповойОР КАК ТиповойОР,
	|	торо_ОбъектыРемонта.ШтрихКод КАК ШтрихКод,
	|	торо_ОбъектыРемонта.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
	|	торо_ОбъектыРемонта.НомерПаспорта КАК НомерПаспорта,
	|	торо_ОбъектыРемонта.ЭтоГруппа КАК ЭтоГруппа,
	|	торо_ОбъектыРемонта.Направление КАК Направление,
	|	торо_ОбъектыРемонта.ЗаводскойНомер КАК ЗаводскойНомер,
	|	торо_ОбъектыРемонта.ТехНомер КАК ТехНомер,
	|	торо_ОбъектыРемонта.ПометкаУдаления КАК ПометкаУдаления,
	|	торо_ОбъектыРемонта.Широта КАК Широта,
	|	торо_ОбъектыРемонта.Долгота КАК Долгота,
	|	торо_ОбъектыРемонта.Высота КАК Высота
	|ИЗ
	|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	|ГДЕ
	|	торо_ОбъектыРемонта.ШтрихКод = &ШтрихКод";
	
	Запрос.УстановитьПараметр("ШтрихКод", ШтрихКод);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();

	Пока Выборка.Следующий() Цикл
		ОР = ФабрикаXDTO.Создать(ТипОР);		
		ОР.Код = Выборка.Код;
		ОР.Наименование =Выборка.Наименование;
		ОР.РодительКод = ?(ЗначениеЗаполнено(Выборка.Родитель),Выборка.Родитель.Код,0);
		ОР.Организация    = ?(ЗначениеЗаполнено(Выборка.Организация),Выборка.Организация.Код,0);
		ОР.ЭтоГруппа = Выборка.ЭтоГруппа;
		ОР.ПометкаУдаления = Выборка.ПометкаУдаления;
		Если НЕ Выборка.ЭтоГруппа Тогда
			ОР.ДатаВыпуска = Выборка.ДатаВыпуска;
			ОР.РемонтнаяГруппа = ?(ЗначениеЗаполнено(Выборка.ТиповойОР),Выборка.ТиповойОР.Код,0);
			ОР.ИнвентарныйНомер = Выборка.ИнвентарныйНомер;
			ОР.Комментарий    = Выборка.Комментарий;
			ОР.Контрагент   = Строка(Выборка.Контрагент);
			ОР.Подразделение    =?(ЗначениеЗаполнено(Выборка.Подразделение),Выборка.Подразделение.Код,0);
			ОР.ШтрихКод = Выборка.ШтрихКод;
			ОР.ДатаВводаВЭксплуатацию = Выборка.ДатаВводаВЭксплуатацию;
			ОР.НомерПаспорта    = Выборка.НомерПаспорта;
			ОР.Направление    = ?(ЗначениеЗаполнено(Выборка.Направление),Выборка.Направление.Код,0);
			ОР.ЗаводскойНомер = Выборка.ЗаводскойНомер;
			ОР.ТехНомер = Выборка.ТехНомер;
			ОР.Широта = Выборка.Широта;
			ОР.Долгота = Выборка.Долгота;
			ОР.Высота = Выборка.Высота;
		КонецЕсли;
		Список.ОР.Добавить(ОР);		
	КонецЦикла;
	
	Если Список.ОР.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьИерархиюОРПоШК(ИДСтруктуры, ШтрихКод)
	
	СтруктураИерархии = Справочники.торо_СтруктурыОР.ПолучитьСсылку(Новый УникальныйИдентификатор(ИДСтруктуры));
	Если НЕ ЗначениеЗаполнено(СтруктураИерархии) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИзменяетсяДокументами = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураИерархии, "ИзменяетсяДокументами");
	
	ТипСписок = ФабрикаXDTO.Тип("android", "ИерархияОРСписок");
	ТипФабрики = ФабрикаXDTO.Тип("android", "ЭлементИерархииОР");
	ТипОР = ФабрикаXDTO.Тип("android", "ОР");
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	СписокОРДляОбновления = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ОбъектыРемонта.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	|ГДЕ
	|	торо_ОбъектыРемонта.ШтрихКод = &ШтрихКод";
	
	Запрос.УстановитьПараметр("ШтрихКод", ШтрихКод);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();

	Пока Выборка.Следующий() Цикл
		СписокОРДляОбновления.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Выборка = ПолучитьВыборкуДанныхИерархииИзРегистра(СтруктураИерархии, ИзменяетсяДокументами, СписокОРДляОбновления);
	
	Пока Выборка.Следующий() Цикл
		ДобавляемыйОбъект = ФабрикаXDTO.Создать(ТипФабрики);
		
		ОбъектРемонта = ФабрикаXDTO.Создать(ТипОР);
		ОбъектРемонта.Код = Выборка.ОбъектРемонтаКод;
		ОбъектРемонта.Наименование = Выборка.ОбъектРемонтаНаименование;
		ОбъектРемонта.ЭтоГруппа = Выборка.ОбъектРемонтаЭтоГруппа;
		ДобавляемыйОбъект.ОбъектРемонта = ОбъектРемонта;
		
		Если Выборка.НеВИерархии = Истина Тогда
			ДобавляемыйОбъект.Родитель = Неопределено;
		Иначе
			Родитель = ФабрикаXDTO.Создать(ТипОР);
			Если ЗначениеЗаполнено(Выборка.Родитель) Тогда
				Родитель.Код = Выборка.РодительКод;
				Родитель.Наименование = Выборка.РодительНаименование;
				Родитель.ЭтоГруппа = Выборка.РодительЭтоГруппа;
			Иначе
				Родитель.Код = "";
				Родитель.Наименование = "";
				Родитель.ЭтоГруппа = Ложь;
			КонецЕсли;
			ДобавляемыйОбъект.Родитель = Родитель;
		КонецЕсли;
		
		Список.ИерархияОР.Добавить(ДобавляемыйОбъект);							
	КонецЦикла;
	
	Возврат Список;
	
КонецФункции

Функция ПолучитьЗаявкиНаРемонт(Все, ИДУстройства)
	
	Подразделение = ПолучитьПодразделениеУстройства(ИДУстройства);
	Бригада = ПолучитьБригадуУстройства(ИДУстройства);
	
	Если Подразделение = Неопределено ИЛИ Бригада = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокЗаявокНаРемонт");
	ТипФабрики = ФабрикаXDTO.Тип("android", "ЗаявкиНаРемонт");	
	ОперацииТипСписок = ФабрикаXDTO.Тип("android", "СписокРемонтныхРабот");
	ОперацииТипФабрики = ФабрикаXDTO.Тип("android", "РемонтныеРаботы");
	МатериалыТипСписок = ФабрикаXDTO.Тип("android", "СписокМатериалов");
	МатериалыТипФабрики = ФабрикаXDTO.Тип("android", "Материалы");
	КвалификацииТипСписок = ФабрикаXDTO.Тип("android", "СписокТрудовыхЗатрат");
	КвалификацииТипФабрики = ФабрикаXDTO.Тип("android", "ТрудовыеЗатраты");
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка КАК Ссылка,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаНачала КАК ДатаНачала,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаОкончания КАК ДатаОкончания,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ДокументИсточник КАК ДокументИсточник,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ID КАК ID,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ОписаниеРемонта КАК ОписаниеРемонта
	|ПОМЕСТИТЬ ВТ_ДанныеЗаявок
	|ИЗ
	|	Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК торо_ЗаявкаНаРемонтРемонтыОборудования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.ИсполнителиПоРемонтам КАК торо_ЗаявкаНаРемонтИсполнителиРемонтныхРабот
	|		ПО торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка = торо_ЗаявкаНаРемонтИсполнителиРемонтныхРабот.Ссылка
	|			И торо_ЗаявкаНаРемонтРемонтыОборудования.ID = торо_ЗаявкаНаРемонтИсполнителиРемонтныхРабот.РемонтыОборудования_ID
	|ГДЕ
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка В(&МассивСсылок)
	|	И торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка.Проведен = ИСТИНА
	|	И торо_ЗаявкаНаРемонтИсполнителиРемонтныхРабот.Исполнитель = &Подразделение
	|	И торо_ЗаявкаНаРемонтИсполнителиРемонтныхРабот.УточнениеИсполнителя = &Бригада
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	ID";
	
	Если Все Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка В(&МассивСсылок)", "ИСТИНА");	
		
	Иначе
		
		ТипМетаданных = Метаданные.Документы.торо_ЗаявкаНаРемонт;
		
		Узел = ПолучитьУзелПланаОбмена(ИДУстройства);
		Если Не ЗначениеЗаполнено(Узел) Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Выборка = ПланыОбмена.ВыбратьИзменения(Узел, 1, ТипМетаданных);
		
		МассивСсылок = Новый Массив;
		МассивОбъектов = Новый Соответствие;
		
		Пока Выборка.Следующий() Цикл
			Попытка
				ТекущийОбъект = Выборка.Получить();
			Исключение
				УдалитьРегистрациюИзмененийПривилегированно(Узел, Выборка);
				Продолжить;
			КонецПопытки;
			
			Если ТипЗнч(ТекущийОбъект) = Тип("УдалениеОбъекта") Тогда
				ПланыОбмена.УдалитьРегистрациюИзменений(Узел, ТекущийОбъект);
				Продолжить;
			КонецЕсли;
			
			Если ТекущийОбъект = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			МассивСсылок.Добавить(ТекущийОбъект.Ссылка);
			МассивОбъектов.Вставить(ТекущийОбъект.Ссылка, ТекущийОбъект);
		КонецЦикла;
		
		Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Бригада", Бригада);
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_СтатусыДокументовЗаявокУстановленныеСрезПоследних.ИзменяемыйДокумент КАК Документ,
	|	торо_СтатусыДокументовЗаявокУстановленныеСрезПоследних.СтатусДокумента КАК СтатусДокумента
	|ПОМЕСТИТЬ ВТ_СтатусыДокументов
	|ИЗ
	|	РегистрСведений.торо_СтатусыДокументовЗаявокУстановленные.СрезПоследних(
	|			,
	|			ИзменяемыйДокумент В
	|				(ВЫБРАТЬ
	|					ВТ_ДанныеЗаявок.Ссылка КАК Ссылка
	|				ИЗ
	|					ВТ_ДанныеЗаявок КАК ВТ_ДанныеЗаявок)) КАК торо_СтатусыДокументовЗаявокУстановленныеСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_СтатусыРемонтовВЗаявкахСрезПоследних.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт,
	|	торо_СтатусыРемонтовВЗаявкахСрезПоследних.ИДРемонта КАК ИДРемонта,
	|	торо_СтатусыРемонтовВЗаявкахСрезПоследних.Статус КАК Статус,
	|	торо_СтатусыРемонтовВЗаявкахСрезПоследних.КомментарийКСтатусу КАК КомментарийКСтатусу
	|ПОМЕСТИТЬ ВТ_СтатусыРемонтов
	|ИЗ
	|	РегистрСведений.торо_СтатусыРемонтовВЗаявках.СрезПоследних(
	|			,
	|			(ЗаявкаНаРемонт, ИДРемонта) В
	|				(ВЫБРАТЬ
	|					ВТ_ДанныеЗаявок.Ссылка КАК Ссылка,
	|					ВТ_ДанныеЗаявок.ID КАК ID
	|				ИЗ
	|					ВТ_ДанныеЗаявок КАК ВТ_ДанныеЗаявок)) КАК торо_СтатусыРемонтовВЗаявкахСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗаявкаНаРемонт,
	|	ИДРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ДанныеЗаявок.Ссылка КАК Ссылка,
	|	ВТ_ДанныеЗаявок.Ссылка.Дата КАК Дата,
	|	ВТ_ДанныеЗаявок.Ссылка.Номер КАК Номер,
	|	ВТ_ДанныеЗаявок.Ссылка.ПометкаУдаления КАК ПометкаУдаления,
	|	ВТ_ДанныеЗаявок.Ссылка.Проведен КАК Проведен,
	|	ВТ_ДанныеЗаявок.Ссылка.Комментарий КАК Комментарий,
	|	ВТ_ДанныеЗаявок.Ссылка.Организация КАК Организация,
	|	ВТ_ДанныеЗаявок.Ссылка.Организация.Код КАК ОрганизацияКод,
	|	ВТ_ДанныеЗаявок.Ссылка.Подразделение КАК Подразделение,
	|	ВТ_ДанныеЗаявок.Ссылка.Подразделение.Код КАК ПодразделениеКод,
	|	ВТ_ДанныеЗаявок.ОбъектРемонта КАК ОбъектРемонта,
	|	ВТ_ДанныеЗаявок.ОбъектРемонта.Код КАК ОбъектРемонтаКод,
	|	ВТ_ДанныеЗаявок.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	ВТ_ДанныеЗаявок.ВидРемонтныхРабот.Код КАК ВидРемонтныхРаботКод,
	|	ВТ_ДанныеЗаявок.ДатаНачала КАК ДатаНачала,
	|	ВТ_ДанныеЗаявок.ДатаОкончания КАК ДатаОкончания,
	|	ВТ_ДанныеЗаявок.ДокументИсточник КАК ДокументИсточник,
	|	ВТ_ДанныеЗаявок.ID КАК ID,
	|	ВТ_ДанныеЗаявок.ОписаниеРемонта КАК ОписаниеРемонта,
	|	ЕСТЬNULL(ВТ_СтатусыРемонтов.Статус, ВТ_СтатусыДокументов.СтатусДокумента) КАК СтатусДокумента,
	|	ЕСТЬNULL(ВТ_СтатусыРемонтов.КомментарийКСтатусу, """") КАК КомментарийКСтатусу,
	|	торо_ВыявленныеДефекты.КритичностьДефекта КАК КритичностьДефекта,
	|	ЕСТЬNULL(торо_ВыявленныеДефекты.ДефектОписание, """") КАК ДефектОписание,
	|	ЕСТЬNULL(торо_ВыявленныеДефекты1.ДатаОбнаружения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаИнцидента,
	|	ЕСТЬNULL(торо_ВыявленныеДефекты1.КонтактноеЛицоИнициатора, """") КАК КонтактноеЛицоИнициатора
	|ИЗ
	|	ВТ_ДанныеЗаявок КАК ВТ_ДанныеЗаявок
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтатусыДокументов КАК ВТ_СтатусыДокументов
	|		ПО ВТ_ДанныеЗаявок.Ссылка = ВТ_СтатусыДокументов.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтатусыРемонтов КАК ВТ_СтатусыРемонтов
	|		ПО ВТ_ДанныеЗаявок.Ссылка = ВТ_СтатусыРемонтов.ЗаявкаНаРемонт
	|			И ВТ_ДанныеЗаявок.ID = ВТ_СтатусыРемонтов.ИДРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефекты
	|		ПО ВТ_ДанныеЗаявок.ДокументИсточник = торо_ВыявленныеДефекты.Регистратор
	|			И ВТ_ДанныеЗаявок.ID = торо_ВыявленныеДефекты.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефекты1
	|		ПО ВТ_ДанныеЗаявок.ДокументИсточник = торо_ВыявленныеДефекты1.Ссылка
	|ГДЕ
	|	НЕ ЕСТЬNULL(ВТ_СтатусыРемонтов.Статус, ВТ_СтатусыДокументов.СтатусДокумента) В (&СтатусВыполнен)
	|ИТОГИ ПО
	|	Ссылка";
	
	Если Все Тогда
		// При полной загрузке не загружаем уже закрытые заявки. 
		// Но при загрузке измененных такой отбор делать не нужно.
		МассивВыполненныхСтатусов = Новый Массив;
		МассивВыполненныхСтатусов.Добавить(Перечисления.торо_СтатусыДокументов.Выполнен);
		МассивВыполненныхСтатусов.Добавить(Перечисления.торо_СтатусыДокументов.Устранен);
		МассивВыполненныхСтатусов.Добавить(Перечисления.торо_СтатусыДокументов.Отклонен);
		МассивВыполненныхСтатусов.Добавить(Перечисления.торо_СтатусыДокументов.ОтказИсполнителя);
		МассивВыполненныхСТатусов.Добавить(Перечисления.торо_СтатусыДокументов.ОтказПодразделения);
		
		Запрос.УстановитьПараметр("СтатусВыполнен", МассивВыполненныхСтатусов);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "НЕ ЕСТЬNULL(ВТ_СтатусыРемонтов.Статус, ВТ_СтатусыДокументов.СтатусДокумента) В (&СтатусВыполнен)", "ИСТИНА");
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	ВыборкаЗаявок = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаЗаявок.Следующий() Цикл
		
		Заявка = ВыборкаЗаявок.Ссылка;
		ВыборкаРемонтов = ВыборкаЗаявок.Выбрать();
		
		Пока ВыборкаРемонтов.Следующий() Цикл
			
			ДобавляемыйОбъект = ФабрикаXDTO.Создать(ТипФабрики);
			
			// Основная информация
			ДобавляемыйОбъект.Дата = ВыборкаРемонтов.Дата;
			ДобавляемыйОбъект.Номер = ВыборкаРемонтов.Номер;
			ДобавляемыйОбъект.ПометкаУдаления = ВыборкаРемонтов.ПометкаУдаления;
			ДобавляемыйОбъект.Проведен = ВыборкаРемонтов.Проведен;
			ДобавляемыйОбъект.УИДДокументаВБазеТОиР = Строка(Заявка.УникальныйИдентификатор());
			ДобавляемыйОбъект.Подразделение = ВыборкаРемонтов.ПодразделениеКод;
			ДобавляемыйОбъект.Организация = ВыборкаРемонтов.ОрганизацияКод;
			
			СтатусДокумента = ?(ВыборкаРемонтов.СтатусДокумента = Перечисления.торо_СтатусыДокументов.Выполняется, 
								Перечисления.торо_СтатусыДокументов.Зарегистрирован, ВыборкаРемонтов.СтатусДокумента);
								
			ДобавляемыйОбъект.СтатусДокумента = XMLСтрока(СтатусДокумента);
			ДобавляемыйОбъект.Комментарий = ВыборкаРемонтов.Комментарий;
			ДобавляемыйОбъект.КомментарийКСтатусу = ВыборкаРемонтов.КомментарийКСтатусу;
			
			// Ремонт оборудования
			ДобавляемыйОбъект.ID = ВыборкаРемонтов.ID;
			ДобавляемыйОбъект.ОбъектРемонта = ВыборкаРемонтов.ОбъектРемонтаКод;
			ДобавляемыйОбъект.ВидРемонта = ВыборкаРемонтов.ВидРемонтныхРаботКод;
			ДобавляемыйОбъект.ДатаНачала = ВыборкаРемонтов.ДатаНачала;
			ДобавляемыйОбъект.ДатаОкончания = ВыборкаРемонтов.ДатаОкончания;
			ДобавляемыйОбъект.ОписаниеРемонта = ВыборкаРемонтов.ОписаниеРемонта;
			
			Если ЗначениеЗаполнено(ВыборкаРемонтов.КритичностьДефекта) Тогда
				ДобавляемыйОбъект.КритичностьДефекта = Строка(ВыборкаРемонтов.КритичностьДефекта.УникальныйИдентификатор());
			Иначе
				ДобавляемыйОбъект.КритичностьДефекта = Неопределено;
			КонецЕсли;
			
			// Данные дефекта
			ДобавляемыйОбъект.ДатаИнцидента = ВыборкаРемонтов.ДатаИнцидента;
			ДобавляемыйОбъект.КонтактноеЛицоИнициатора = Строка(ВыборкаРемонтов.КонтактноеЛицоИнициатора);
			ДобавляемыйОбъект.ДефектОписание = ВыборкаРемонтов.ДефектОписание;
				
			// Операции
			Операции = ФабрикаXDTO.Создать(ОперацииТипСписок);
			
			РемРаботы = Заявка.РемонтныеРаботы;
			
			Для Каждого Работа Из РемРаботы Цикл
				
				Если Не Работа.РемонтыОборудования_ID = ВыборкаРемонтов.ID Тогда
					Продолжить;
				КонецЕсли;
				
				Операция = ФабрикаXDTO.Создать(ОперацииТипФабрики);
				
				Операция.ID = Работа.ID;
				Операция.Родитель_ID = Работа.Родитель_ID;
				Операция.Количество = Работа.Количество;
				Операция.Картинка = Работа.Картинка;
				
				Префикс = "";
				
				Если ТипЗнч(Работа.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
					Префикс = "о";
				ИначеЕсли ТипЗнч(Работа.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда
					Префикс = "т";
				КонецЕсли;
				
				Операция.РемонтнаяРабота = Префикс + Работа.РемонтнаяРабота.Код;
				
				Если ТипЗнч(Работа.Исполнитель) = Тип("СправочникСсылка.Контрагенты") Тогда
					Операция.Исполнитель = Строка(Работа.Исполнитель);
					Операция.Бригада = Строка(Работа.ДоговорБригада);
					Операция.ИсполнительКонтрагент = Истина; 
				Иначе
					Операция.Исполнитель = ?(ЗначениеЗаполнено(Работа.Исполнитель),XMLСтрока(Работа.Исполнитель.УникальныйИдентификатор()),Неопределено);
					Операция.Бригада = ?(ЗначениеЗаполнено(Работа.ДоговорБригада),XMLСтрока(Работа.ДоговорБригада.УникальныйИдентификатор()),Неопределено);
					Операция.ИсполнительКонтрагент = Ложь; 
				КонецЕсли;
				
				Операции.РемонтныеРаботы.Добавить(Операция);
				
			КонецЦикла;
			
			ДобавляемыйОбъект.Операции = Операции;
			
			// Материалы
			Материалы = ФабрикаXDTO.Создать(МатериалыТипСписок);
			
			МатЗатраты = Заявка.МатериальныеЗатраты;
			
			Для Каждого Материал Из МатЗатраты Цикл
				
				Если Не Материал.РемонтыОборудования_ID = ВыборкаРемонтов.ID Тогда
					Продолжить;
				КонецЕсли;
				
				Ном = ФабрикаXDTO.Создать(МатериалыТипФабрики);
				
				Ном.ID = Материал.ID;
				Ном.Количество = Материал.Количество;
				Ном.Номенклатура = Материал.Номенклатура.Код;
				Ном.ХарактеристикаНоменклатуры = Материал.ХарактеристикаНоменклатуры.Код;
				Ном.КоличествоЕдиниц = Материал.КоличествоЕдиниц;
				
				Материалы.Материалы.Добавить(Ном);
				
			КонецЦикла;
			
			ДобавляемыйОбъект.Материалы = Материалы;
			
			// Квалификации
			Квалификации = ФабрикаXDTO.Создать(КвалификацииТипСписок);
			
			ТрудЗатраты = Заявка.ТрудовыеЗатраты;
			
			Для Каждого Затрата Из ТрудЗатраты Цикл
				
				Если Не Затрата.РемонтыОборудования_ID = ВыборкаРемонтов.ID Тогда
					Продолжить;
				КонецЕсли;
				
				Кв = ФабрикаXDTO.Создать(КвалификацииТипФабрики);
				
				Кв.ID = Затрата.ID;
				Кв.ВремяРаботы = Затрата.ВремяРаботы;
				Кв.Квалификация = Затрата.Квалификация.Код;
				Кв.Количество = Затрата.Количество;
				
				Квалификации.ТрудовыеЗатраты.Добавить(Кв);
				
			КонецЦикла;
			
			ДобавляемыйОбъект.Квалификации = Квалификации;
			
			Список.ЗаявкиНаРемонт.Добавить(ДобавляемыйОбъект);
			
		КонецЦикла;
		
		Если Не Все Тогда
			Если Не МассивОбъектов[Заявка] = Неопределено Тогда
				ПланыОбмена.УдалитьРегистрациюИзменений(Узел, МассивОбъектов[Заявка]);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Список.ЗаявкиНаРемонт.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСтатусыЗаявок(СписокИдЗаявок, ИДУстройства)
	
	Подразделение = ПолучитьПодразделениеУстройства(ИДУстройства);
	Бригада = ПолучитьБригадуУстройства(ИДУстройства);
	
	Если Подразделение = Неопределено ИЛИ Бригада = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаЗаявок = Новый ТаблицаЗначений;
	ТаблицаЗаявок.Колонки.Добавить("Заявка", Новый ОписаниеТипов("ДокументСсылка.торо_ЗаявкаНаРемонт"));
	ТаблицаЗаявок.Колонки.Добавить("УИДДокументаВБазеТОиР", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(36)));
	ТаблицаЗаявок.Колонки.Добавить("ИДРемонта", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(36)));
	
	Для каждого Элемент из СписокИдЗаявок.Элементы Цикл
		СсылкаНаДокумент = Документы.торо_ЗаявкаНаРемонт.ПолучитьСсылку(Новый УникальныйИдентификатор(Элемент.УИДДокументаВБазеТОиР));
		НоваяСтрока = ТаблицаЗаявок.Добавить();
		НоваяСтрока.Заявка = СсылкаНаДокумент;
		НоваяСтрока.УИДДокументаВБазеТОиР = Элемент.УИДДокументаВБазеТОиР;
		НоваяСтрока.ИДРемонта = Элемент.ИДРемонта;
	КонецЦикла;
	
	МассивСтатусовДляУдаления = Новый Массив;
	МассивСтатусовДляУдаления.Добавить(Перечисления.торо_СтатусыДокументов.Отклонен);
	МассивСтатусовДляУдаления.Добавить(Перечисления.торо_СтатусыДокументов.ОтказИсполнителя);
	МассивСтатусовДляУдаления.Добавить(Перечисления.торо_СтатусыДокументов.ОтказПодразделения);


	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	                |	ТаблицаЗаявок.Заявка КАК Заявка,
	                |	ТаблицаЗаявок.УИДДокументаВБазеТОиР КАК УИДДокументаВБазеТОиР,
	                |	ТаблицаЗаявок.ИДРемонта КАК ИДРемонта
	                |ПОМЕСТИТЬ ТаблицаЗаявок
	                |ИЗ
	                |	&ТаблицаЗаявок КАК ТаблицаЗаявок
	                |
	                |ИНДЕКСИРОВАТЬ ПО
	                |	Заявка,
	                |	ИДРемонта
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                |	торо_СтатусыДокументовЗаявокУстановленныеСрезПоследних.ИзменяемыйДокумент КАК Документ,
	                |	торо_СтатусыДокументовЗаявокУстановленныеСрезПоследних.СтатусДокумента КАК СтатусДокумента
	                |ПОМЕСТИТЬ ВТ_СтатусыДокументов
	                |ИЗ
	                |	РегистрСведений.торо_СтатусыДокументовЗаявокУстановленные.СрезПоследних(
	                |			,
	                |			ИзменяемыйДокумент В
	                |				(ВЫБРАТЬ
	                |					ТаблицаЗаявок.Заявка КАК Ссылка
	                |				ИЗ
	                |					ТаблицаЗаявок КАК ТаблицаЗаявок)) КАК торо_СтатусыДокументовЗаявокУстановленныеСрезПоследних
	                |
	                |ИНДЕКСИРОВАТЬ ПО
	                |	Документ
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                |	торо_СтатусыРемонтовВЗаявкахСрезПоследних.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт,
	                |	торо_СтатусыРемонтовВЗаявкахСрезПоследних.ИДРемонта КАК ИДРемонта,
	                |	торо_СтатусыРемонтовВЗаявкахСрезПоследних.Статус КАК Статус,
	                |	торо_СтатусыРемонтовВЗаявкахСрезПоследних.КомментарийКСтатусу КАК КомментарийКСтатусу
	                |ПОМЕСТИТЬ ВТ_СтатусыРемонтов
	                |ИЗ
	                |	РегистрСведений.торо_СтатусыРемонтовВЗаявках.СрезПоследних(
	                |			,
	                |			(ЗаявкаНаРемонт, ИДРемонта) В
	                |				(ВЫБРАТЬ
	                |					ТаблицаЗаявок.Заявка КАК Ссылка,
	                |					ТаблицаЗаявок.ИДРемонта КАК ИДРемонта
	                |				ИЗ
	                |					ТаблицаЗаявок КАК ТаблицаЗаявок)) КАК торо_СтатусыРемонтовВЗаявкахСрезПоследних
	                |
	                |ИНДЕКСИРОВАТЬ ПО
	                |	ЗаявкаНаРемонт,
	                |	ИДРемонта
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	                |	ТаблицаЗаявок.Заявка КАК Заявка,
	                |	ТаблицаЗаявок.УИДДокументаВБазеТОиР КАК УИДДокументаВБазеТОиР,
	                |	ТаблицаЗаявок.ИДРемонта КАК ИДРемонта,
	                |	ВЫБОР
	                |		КОГДА торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка ЕСТЬ NULL
	                |			ТОГДА ИСТИНА
	                |		ИНАЧЕ ЛОЖЬ
	                |	КОНЕЦ КАК Удалить
						 |ИЗ
						 |	ТаблицаЗаявок КАК ТаблицаЗаявок
						 |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК торо_ЗаявкаНаРемонтРемонтыОборудования
						 |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.ИсполнителиПоРемонтам КАК торо_ЗаявкаНаРемонтИсполнителиРемонтныхРабот
						 |			ПО торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка = торо_ЗаявкаНаРемонтИсполнителиРемонтныхРабот.Ссылка
						 |				И торо_ЗаявкаНаРемонтРемонтыОборудования.ID = торо_ЗаявкаНаРемонтИсполнителиРемонтныхРабот.РемонтыОборудования_ID
						 |				И (торо_ЗаявкаНаРемонтИсполнителиРемонтныхРабот.Исполнитель = &Подразделение)
						 |				И (торо_ЗаявкаНаРемонтИсполнителиРемонтныхРабот.УточнениеИсполнителя = &Бригада)
						 |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СтатусыДокументов КАК ВТ_СтатусыДокументов
						 |			ПО торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка = ВТ_СтатусыДокументов.Документ
						 |				И (НЕ ВТ_СтатусыДокументов.СтатусДокумента В (&СтатусыДляУдаления))
						 |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СтатусыРемонтов КАК ВТ_СтатусыРемонтов
						 |			ПО торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка = ВТ_СтатусыРемонтов.ЗаявкаНаРемонт
						 |				И торо_ЗаявкаНаРемонтРемонтыОборудования.ID = ВТ_СтатусыРемонтов.ИДРемонта
						 |				И (НЕ ВТ_СтатусыРемонтов.Статус В (&СтатусыДляУдаления))
						 |		ПО ТаблицаЗаявок.Заявка = торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка
						 |			И ТаблицаЗаявок.ИДРемонта = торо_ЗаявкаНаРемонтРемонтыОборудования.ID
						 |			И (торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка.Проведен)";

	
	Запрос.УстановитьПараметр("ТаблицаЗаявок", ТаблицаЗаявок);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Бригада", Бригада);
	Запрос.УстановитьПараметр("СтатусыДляУдаления", МассивСтатусовДляУдаления);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокСтатусовЗаявокНаРемонт");
	ТипФабрики = ФабрикаXDTO.Тип("android", "СтатусЗаявкиНаРемонт");
	
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	Пока Выборка.Следующий() Цикл
		ЭлементСписка = ФабрикаXDTO.Создать(ТипФабрики);
		ЭлементСписка.УИДДокументаВБазеТОиР = Выборка.УИДДокументаВБазеТОиР;
		ЭлементСписка.ИДРемонта = Выборка.ИДРемонта;
		ЭлементСписка.Удалить = Выборка.Удалить;
				
		Список.Элементы.Добавить(ЭлементСписка);
	КонецЦикла;
	
	Если Список.Элементы.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьОбновляемоеРасстояние(ИДУстройства)
	Узел = ПолучитьУзелПланаОбмена(ИДУстройства);
	Если Не ЗначениеЗаполнено(Узел) Тогда
		Возврат 0;
	КонецЕсли;
	
	Расстояние = Узел.ОбновляемоеРасстояние;
	
	Если Расстояние = 0 Тогда
		Возврат Константы.торо_ОбновляемоеРасстояниеПоУмолчанию.Получить();
	Иначе
		Возврат Расстояние;
	КонецЕсли;
КонецФункции


Функция ПолучитьЗначенияГеоконтроля(ИДУстройства)
	
	Узел = ПолучитьУзелПланаОбмена(ИДУстройства);
	Если Не ЗначениеЗаполнено(Узел) Тогда
		Возврат 0;
	КонецЕсли;
	
	Геоконтроль = Узел.Геоконтроль;
	Погрешность = Узел.ПогрешностьГеоконтроля;
	
	Если Погрешность = 0  Тогда
		Погрешность = Константы.торо_ПогрешностьГеоконтроляПоУмолчанию.Получить();
	КонецЕсли; 
	
	ТипСтруктуры = ФабрикаXDTO.Тип("android", "СтруктураЗначенийГеоконтроля");
	СтруктураЗначений = ФабрикаXDTO.Создать(ТипСтруктуры);
	СтруктураЗначений.Геоконтроль = Геоконтроль;
	СтруктураЗначений.ПогрешностьГеоконтроля = Погрешность;
	
	Возврат СтруктураЗначений;
	
КонецФункции

Функция ПолучитьУИДПодразделенияУстройства(ИДУстройства)
	
	Подразделение = ПолучитьПодразделениеУстройства(ИДУстройства);
	Если ЗначениеЗаполнено(Подразделение) Тогда
		Возврат  XMLСтрока(Подразделение.УникальныйИдентификатор());
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ПолучитьУИДБригадыУстройства(ИДУстройства)
	
	Бригада = ПолучитьБригадуУстройства(ИДУстройства);
	Если ЗначениеЗаполнено(Бригада) Тогда
		Возврат  XMLСтрока(Бригада.УникальныйИдентификатор());
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ПолучитьФайлТехКарты(ГУИД)
	
	НовыйУИД = Новый УникальныйИдентификатор(ГУИД);
	СсылкаНаФайл = Справочники.торо_ТехКартыПрисоединенныеФайлы.ПолучитьСсылку(НовыйУИД);
	ПрисоединенныйФайл = СсылкаНаФайл.ПолучитьОбъект();
	
	Если ПрисоединенныйФайл <> Неопределено Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		                |	ДвоичныеДанныеФайлов.ДвоичныеДанныеФайла КАК ДвоичныеДанныеФайла
		                |ИЗ
		                |	РегистрСведений.ДвоичныеДанныеФайлов КАК ДвоичныеДанныеФайлов
		                |ГДЕ
		                |	ДвоичныеДанныеФайлов.Файл = &СсылкаНаФайл";
		
		Запрос.УстановитьПараметр("СсылкаНаФайл", СсылкаНаФайл);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда 
			ДвоичныеДанныеФайла = Base64Строка(Выборка.ДвоичныеДанныеФайла.Получить());
			Возврат ДвоичныеДанныеФайла;
		Иначе
			Возврат "Не удалось загрузить файл";
		КонецЕсли;
	 Иначе 
		 Возврат "Не удалось загрузить файл";
	КонецЕсли;
		
КонецФункции

Функция ПолучитьНевыполненныеОперации(УИДЗаявкиВБазеТОиР, ИДРемонта)
	
	ОперацииТипСписок = ФабрикаXDTO.Тип("android", "СписокРемонтныхРабот");
	ОперацииТипФабрики = ФабрикаXDTO.Тип("android", "РемонтныеРаботы");
	
	Операции = ФабрикаXDTO.Создать(ОперацииТипСписок);
	
	НовыйУИД = Новый УникальныйИдентификатор(УИДЗаявкиВБазеТОиР);
	СсылкаНаЗаявку = Документы.торо_ЗаявкаНаРемонт.ПолучитьСсылку(НовыйУИД);
	Заявка = СсылкаНаЗаявку.ПолучитьОбъект();
	
	Если Заявка <> Неопределено Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	торо_ЗаявкаНаРемонтРемонтныеРаботы.ID КАК ID,
		               |	торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтнаяРабота КАК РемонтнаяРабота,
		               |	торо_ЗаявкаНаРемонтРемонтныеРаботы.Родитель_ID КАК Родитель_ID,
		               |	торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		               |	торо_ЗаявкаНаРемонтРемонтныеРаботы.Количество КАК Количество,
		               |	торо_ЗаявкаНаРемонтРемонтныеРаботы.Картинка КАК Картинка,
		               |	торо_ЗаявкаНаРемонтРемонтныеРаботы.Исполнитель КАК Исполнитель,
		               |	торо_ЗаявкаНаРемонтРемонтныеРаботы.ДоговорБригада КАК ДоговорБригада
		               |ПОМЕСТИТЬ ВТ_ТаблицаРемонтовОборудования
		               |ИЗ
		               |	Документ.торо_ЗаявкаНаРемонт.РемонтныеРаботы КАК торо_ЗаявкаНаРемонтРемонтныеРаботы
		               |ГДЕ
		               |	торо_ЗаявкаНаРемонтРемонтныеРаботы.Ссылка = &СсылкаНаЗаявку
		               |	И торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтыОборудования_ID = &ИДРемонта";
		
		торо_ЗаполнениеДокументов20.ДополнитьЗапросПроцентами(Запрос, Перечисления.торо_ВидДокумента.ЗаявкаНаРемонт);
		
		Запрос.УстановитьПараметр("СсылкаНаЗаявку", СсылкаНаЗаявку);
		Запрос.УстановитьПараметр("ИДРемонта", ИДРемонта);
		
		Результат = Запрос.Выполнить();
		РемРаботыСПроцентами = Результат.Выгрузить();

		МассивСтрок = РемРаботыСПроцентами.НайтиСтроки(Новый Структура("Родитель_ID", ""));
		Для каждого Строка Из МассивСтрок Цикл
			СтруктураПолученная = ПроцентВыполненияПодчиненных(РемРаботыСПроцентами, Строка);
		КонецЦикла;
		
		Для каждого Работа Из РемРаботыСПроцентами Цикл
			
			Операция = ФабрикаXDTO.Создать(ОперацииТипФабрики);
			
			Операция.ID = Работа.ID;
			Операция.Родитель_ID = Работа.Родитель_ID;
			Операция.Количество = Окр(Работа.ПроцентВыполненияРабот*Работа.Количество/100);
			Операция.Картинка = Работа.Картинка;
			
			Префикс = "";
			
			Если ТипЗнч(Работа.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
				Префикс = "о";
			ИначеЕсли ТипЗнч(Работа.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда
				Префикс = "т";
			КонецЕсли;
			
			Операция.РемонтнаяРабота = Префикс + Работа.РемонтнаяРабота.Код;

			Операции.РемонтныеРаботы.Добавить(Операция);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Операции;
	
КонецФункции

// Загрузка данных из МП

Функция ПередатьАкт(Акт, ПропуститьПроверки, ИДУстройства)
	
	Подразделение = ПолучитьПодразделениеУстройства(ИДУстройства);
	Бригада = ПолучитьБригадуУстройства(ИДУстройства);
	
	Отказ = Ложь;
	СтруктураОтвета = ПодготовитьПустуюСтруктуруОтвета();
	
	МетаданныеДокумента = Метаданные.Документы.торо_АктОВыполненииЭтапаРабот;
	
	Если Не ПравоДоступа("Чтение", МетаданныеДокумента) Тогда
		СтруктураОтвета.Успех = Ложь;
		ТекстСообщения = НСтр("es='No hay derechos a la lectura de los documentos ""el Acta sobre la ejecución de la etapa de los trabajos"".';ru='Нет прав на чтение документов ""Акт о выполнении этапа работ"".';en='There is no right to read the documents ""Act on the implementation of the phase of work.""'");
		ДобавитьОшибкуВМассив(СтруктураОтвета.ТекстОшибки, ТекстСообщения);
		Возврат СтруктураОтвета;
	КонецЕсли;
	
	СсылкаНаДокумент = Документы.торо_АктОВыполненииЭтапаРабот.ПолучитьСсылку(Новый УникальныйИдентификатор(Акт.Ссылка));
	НовыйДок = СсылкаНаДокумент.ПолучитьОбъект();
	Если НовыйДок <> Неопределено Тогда
		Если НЕ ПравоДоступа("Изменение", МетаданныеДокумента) Тогда
			СтруктураОтвета.Успех = Ложь;
			ТекстСообщения = НСтр("es='No hay derechos al cambio de los documentos ""el Acta sobre la ejecución de la etapa de los trabajos"".';ru='Нет прав на изменение документов ""Акт о выполнении этапа работ"".';en='There is no right to amend the documents ""Act on the implementation of the phase of work.'");
			ДобавитьОшибкуВМассив(СтруктураОтвета.ТекстОшибки, ТекстСообщения);
			Возврат СтруктураОтвета;
		КонецЕсли;
		
		// очистка тч
		НовыйДок.РемонтыОборудования.Очистить();
		НовыйДок.РемонтныеРаботы.Очистить();
		НовыйДок.МатериальныеЗатраты.Очистить();
		НовыйДок.ТрудовыеЗатраты.Очистить();
		НовыйДок.ИсполнителиПоРемонтам.Очистить();
	Иначе
		Если НЕ ПравоДоступа("Добавление", МетаданныеДокумента) Тогда
			СтруктураОтвета.Успех = Ложь;
			ТекстСообщения = НСтр("es='No hay derechos a la adición de los documentos ""el Acta sobre la ejecución de la etapa de los trabajos"".';ru='Нет прав на добавление документов ""Акт о выполнении этапа работ"".';en='There is no right to add documents ""Act on the implementation of the work phase.""'");
			ДобавитьОшибкуВМассив(СтруктураОтвета.ТекстОшибки, ТекстСообщения);
			Возврат СтруктураОтвета;
		КонецЕсли;
		
		НовыйДок = Документы.торо_АктОВыполненииЭтапаРабот.СоздатьДокумент();
		НовыйДок.УстановитьСсылкуНового(СсылкаНаДокумент);
	КонецЕсли;
	
	Если Отказ Тогда
		СтруктураОтвета.Успех = Ложь;
		Возврат СтруктураОтвета;
	КонецЕсли;

	// заполнение тч
	// Операции
	Для Каждого Операция Из Акт.Операции.РемонтныеРаботы Цикл
		
		НС = НовыйДок.РемонтныеРаботы.Добавить();
		
		НС.ID =				Операция.ID;
		НС.Родитель_ID =	Операция.Родитель_ID;
		НС.Количество =		Операция.Количество;
		НС.Картинка =		Операция.Картинка;
		
		НС.РемонтыОборудования_ID = Акт.ID;
		
		Префикс = Лев(Операция.РемонтнаяРабота, 1);
		Код = Прав(Операция.РемонтнаяРабота, СтрДлина(Операция.РемонтнаяРабота) - 1);
		
		Ссылка = Неопределено;
		
		Если Префикс = "о" Тогда
			Ссылка = Справочники.торо_ТехнологическиеОперации.НайтиПоКоду(Код);
		ИначеЕсли Префикс = "т" Тогда
			Ссылка = Справочники.торо_ИдентификаторыТехКарт.НайтиПоКоду(Код);
		КонецЕсли;
		
		НС.РемонтнаяРабота = Ссылка;
		Если ТипЗнч(НС.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда
			НС.Исполнитель = Подразделение;
			НС.ДоговорБригада = Бригада;
		КонецЕсли;
		
		НС.ПроцентВыполненияРабот = 100;
		НС.Выполнено = Истина;
		
	КонецЦикла;
	
	// Материалы
	Для Каждого Материал Из Акт.Материалы.Материалы Цикл
		
		НС = НовыйДок.МатериальныеЗатраты.Добавить();
		
		НС.ID =					        Материал.ID;
		НС.Количество =			        Материал.Количество;
		НС.Номенклатура =		        Справочники.Номенклатура.НайтиПоКоду(Материал.Номенклатура);
		НС.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.НайтиПоКоду(Материал.ХарактеристикаНоменклатуры);
		НС.КоличествоЕдиниц =	        Материал.КоличествоЕдиниц;
		
		НС.РемонтыОборудования_ID = Акт.ID;
		
	КонецЦикла;
	
	// Сотрудники
	Для Каждого Сотрудник Из Акт.ТрудовыеЗатраты.ТрудовыеЗатраты Цикл
		
		НС = НовыйДок.ТрудовыеЗатраты.Добавить();
		
		НС.ID =					Сотрудник.ID;
		НС.ДатаНачала =			Сотрудник.ДатаНачала;
		НС.ДатаОкончания =		Сотрудник.ДатаОкончания;
		НС.Квалификация =		Справочники.торо_КвалификацииРемонтногоПерсонала.НайтиПоКоду(Сотрудник.Квалификация);
		НС.Сотрудник =			Справочники.Сотрудники.НайтиПоКоду(Сотрудник.Сотрудник);
		НС.ВремяРаботы =		Сотрудник.ВремяРаботы;
		
		НС.РемонтыОборудования_ID = Акт.ID;
		
	КонецЦикла;
	
	// Исполнители
	Если ЗначениеЗаполнено(Подразделение) Тогда
		НС = НовыйДок.ИсполнителиПоРемонтам.Добавить();
		НС.РемонтыОборудования_ID = Акт.ID;
		НС.Исполнитель = Подразделение;
		НС.УточнениеИсполнителя = Бригада;
		НС.ДатаНачала = Акт.ДатаНачала;
		НС.ДатаОкончания = Акт.ДатаОкончания;
	КонецЕсли;
	
	УИДЗаявки = Акт.УИДДокументаВБазеТОиР;
	Заявка = Документы.торо_ЗаявкаНаРемонт.ПолучитьСсылку(Новый УникальныйИдентификатор(УИДЗаявки));
	
	ДО = НовыйДок.ДокументыОснования.Добавить();
	ДО.ДокументОснование = Заявка;
	
	НовыйДок.ИзМобильного = Истина;
	НовыйДок.Дата = Акт.Дата;
	НовыйДок.Подразделение = Справочники.СтруктураПредприятия.НайтиПоКоду(Акт.Подразделение);
	НовыйДок.Организация = Справочники.Организации.НайтиПоКоду(Акт.Организация);
	НовыйДок.Комментарий = Акт.Комментарий;
	
	НовыйДок.Комментарий = ?(ЗначениеЗаполнено(НовыйДок.Комментарий),НовыйДок.Комментарий+Символы.ПС,"")
		+ НСтр("es='Es creado de la aplicación móvil.';ru='Создан из мобильного приложения.';en='Created from a mobile application.'"); 
	
	НовыйДок.Ответственный = НайтиПользователя(Акт.Ответственный);
	
	Ремонт = НовыйДок.РемонтыОборудования.Добавить();
	Ремонт.ID = Акт.ID;
	Ремонт.ОбъектРемонта = НайтиОРпоКоду(Акт.ОбъектРемонта);
	Ремонт.ВидРемонтныхРабот = Справочники.торо_ВидыРемонтов.НайтиПоКоду(Акт.ВидРемонта);
	Ремонт.ДатаНачала = Акт.ДатаНачала;
	Ремонт.ДатаОкончания = Акт.ДатаОкончания;
	Ремонт.ЗавершитьРемонт = Акт.ЗавершитьРемонт;
	Ремонт.ДокументИсточник = Заявка;
	
	НовыйДок.ЗавершитьРемонтныеРаботы = Акт.ЗавершитьРемонт;
	
	ПопробоватьЗаписатьДокумент(НовыйДок, СтруктураОтвета, "ОбменМП.ЗаписьАкта");
	Возврат СтруктураОтвета;
	
КонецФункции

Процедура ПопробоватьЗаписатьДокумент(НовыйДок, СтруктураОтвета, ИмяСобытияЖурналаРегистрации)
	
	Попытка	
		НовыйДок.Записать(РежимЗаписиДокумента.Проведение);		
		СтруктураОтвета.Успех = Истина;
		СтруктураОтвета.НомерДокумента = НовыйДок.Номер;
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрации,УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки);
		СтруктураОтвета.Успех = Ложь;
		ТекстСообщения = НСтр("es='No consiguió anotar el documento, es más detallado que cm. En la revista del registro en la base ТОиР.';ru='Не удалось записать документ, подробнее см. в журнале регистрации в базе ТОиР.';en='Failed to write the document, for more details, see the registration log in the MRO database.'");
		ДобавитьОшибкуВМассив(СтруктураОтвета.ТекстОшибки, ТекстСообщения);
	КонецПопытки;
	
	МассивСообщений = ПолучитьСообщенияПользователю(Истина);
	Для каждого СообщениеПользователю из МассивСообщений Цикл
		ДобавитьОшибкуВМассив(СтруктураОтвета.ТекстОшибки, СообщениеПользователю.Текст);
	КонецЦикла;

КонецПроцедуры

Функция WriteObjectPhoto(Code, Photo, Comment, Type)
	
	Попытка
		ВладелецФайла = Неопределено;
		НаименованиеФайла = "";
		
		//Если Type = "ОР" Тогда // Изображение объекта
		//КонецЕсли;
		
		ДвоичныеДанные = Base64Значение(Photo);
		Картинка = Новый Картинка(ДвоичныеДанные);
		Расширение = Строка(Картинка.Формат());
		ВрХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
		
		ПараметрыФайла = Новый Структура();
		ПараметрыФайла.Вставить("Автор", Пользователи.ТекущийПользователь());
		ПараметрыФайла.Вставить("ВладелецФайлов", ВладелецФайла);
		ПараметрыФайла.Вставить("ИмяБезРасширения", НаименованиеФайла);
		ПараметрыФайла.Вставить("РасширениеБезТочки", Расширение);
		ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное", Неопределено);
		
		РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, ВрХранилище); 
		
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("ОбменМП.ЗаписьТехническойДокументации",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки);
		Возврат "Error";
	КонецПопытки;
	
	Возврат "Done";
	
КонецФункции

Функция ЗаполненоПодразделение(ИДУстройства)
	Подразделение = ПолучитьПодразделениеУстройства(ИДУстройства);
	Возврат Не Подразделение = Неопределено;
КонецФункции

Функция ПередатьМестоположения(СписокКоординат)
	Попытка
		НЗ = РегистрыСведений.торо_ПередвиженияМобильныхБригад.СоздатьНаборЗаписей();
		
		Для Каждого Координаты Из СписокКоординат.Координаты Цикл
			Пользователь = НайтиПользователя(Координаты.Пользователь);
			Если ЗначениеЗаполнено(Пользователь) Тогда
				НС = НЗ.Добавить();
				
				НС.Период = Координаты.Период;
				НС.Пользователь = Пользователь;
				НС.Широта = Координаты.Широта;
				НС.Долгота = Координаты.Долгота;
				НС.Высота = Координаты.Высота;
				НС.ВидУстановкиМестоположения = Перечисления.торо_ВидУстановкиМестоположения[Координаты.ВидУстановкиМестоположения];
				
				Если НС.ВидУстановкиМестоположения = Перечисления.торо_ВидУстановкиМестоположения.ПроведениеАкта Тогда
					НС.СозданныйДокумент = Документы.торо_АктОВыполненииЭтапаРабот.ПолучитьСсылку(Новый УникальныйИдентификатор(Координаты.Документ));
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		НЗ.Записать(Ложь);
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("es='La excepción';ru='Исключение';en='An exception'"), УровеньЖурналаРегистрации.Предупреждение, 
			Метаданные.WebСервисы.ExchangeMobileBrigades,,ОписаниеОшибки());
		Возврат "fail";
	КонецПопытки;
	
	Возврат "ok";
КонецФункции

Функция ПередатьФайлыИзАкта(АктСсылка, Файл)
		
	Попытка 
		
		НаименованиеФайла = "";	
		ВладелецФайла = Документы.торо_АктОВыполненииЭтапаРабот.ПолучитьСсылку(Новый УникальныйИдентификатор(АктСсылка));
		
		НаименованиеФайла = ?(ЗначениеЗаполнено(Файл.ИмяФайла), Файл.ИмяФайла, Строка(ВладелецФайла)); 
		НаименованиеФайла = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(НаименованиеФайла, ".");
		
		Описание = "";
		Если ЗначениеЗаполнено(Файл.Комментарий) Тогда
			Описание = Файл.Комментарий;	
		КонецЕсли;

		ДвоичныеДанные = Base64Значение(Файл.ДанныеФайла);
		Расширение = Файл.Расширение;
		
		ВрХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
		
		ПараметрыФайла = Новый Структура();
		ПараметрыФайла.Вставить("Автор", Пользователи.ТекущийПользователь());
		ПараметрыФайла.Вставить("ВладелецФайлов", ВладелецФайла);
		ПараметрыФайла.Вставить("ИмяБезРасширения", НаименованиеФайла);
		ПараметрыФайла.Вставить("РасширениеБезТочки", Расширение);
		ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное", Неопределено);
		
		РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, ВрХранилище, , Описание); 
		
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("ОбменМП.ЗаписьФотоИзАкта",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки);
		Возврат "Error";
	КонецПопытки;
	
	Возврат "Done";

КонецФункции

Функция ПередатьСобытияИзМП(События)
	
	ТипСписок = ФабрикаXDTO.Тип("android", "События");
	ТипФабрикиСобытия = ФабрикаXDTO.Тип("android", "СобытиеИзМП");	
	
	СобытияОтвет = ФабрикаXDTO.Создать(ТипСписок);
	
	ОбработчикиСобытий = Новый Структура;
	ОбработчикиСобытий.Вставить("ИзменениеСтатуса", торо_РаботаСоСтатусамиДокументовСервер);
	
	Для Каждого СобытиеИзМП ИЗ События.Элементы Цикл
		
		МодульОбработчика = ОбработчикиСобытий[СобытиеИзМП.ТипСобытия];
		
		РезультатОбработки = МодульОбработчика.ОбработкаСобытияИзМобильногоПриложения(
			СобытиеИзМП.ДатаВремяСобытия,
			?(СобытиеИзМП.Сериализовано,
				ДесериализоватьОбъект(СобытиеИзМП.ИнформацияСобытия),
				СобытиеИзМП.ИнформацияСобытия
			),
			СобытиеИзМП.ТипСобытия
		);
		
		СобытиеОтвет = ФабрикаXDTO.Создать(ТипФабрикиСобытия);
		
		ЗаполнитьЗначенияСвойств(СобытиеОтвет, СобытиеИзМП);
		СобытиеОтвет.ИнформацияСобытия = СериализоватьОбъект(РезультатОбработки);
		СобытиеОтвет.Сериализовано = Истина;
		СобытияОтвет.Элементы.Добавить(СобытиеОтвет);
		
	КонецЦикла;
	
	Возврат СобытияОтвет;
	
КонецФункции

/////////////////////////////////////////////////////////////////////////
// Служебные процедуры и функции

Функция НайтиПользователя(ИмяПользователяИБ)
	
	Пользователь = Неопределено;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(ИмяПользователяИБ);
	Если ПользовательИБ <> Неопределено Тогда
		Пользователь = Справочники.Пользователи.НайтиПоРеквизиту("ИдентификаторПользователяИБ", ПользовательИБ.УникальныйИдентификатор);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Пользователь;
	
КонецФункции

Функция НайтиОРпоКоду(Код)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_ОбъектыРемонта.Ссылка
	|ИЗ
	|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	|ГДЕ
	|	торо_ОбъектыРемонта.Код = &Код
	|	И торо_ОбъектыРемонта.ЭтоГруппа = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Код", Код);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.торо_ОбъектыРемонта.ПустаяСсылка();
	
КонецФункции

Процедура ЗаполнитьСписокДаннымиБазовогоСправочника(Все, ИДУстройства, СписокXDTO, ТипФабрики, ИмяСправочника, ПропускатьГруппы = Ложь, СИерархией = Ложь, РодителиУИДом = Ложь)
	
	Если ИмяСправочника = "торо_ИзмеряемыеПоказателиОбъектовРемонта" Тогда
		ТипМетаданных = Метаданные.ПланыВидовХарактеристик[ИмяСправочника];
		ЕстьРеквизитЭтоГруппа = ТипМетаданных.Иерархический;
		Если Все Тогда
			Выборка = ПланыВидовХарактеристик[ИмяСправочника].Выбрать();	
		Иначе
			Узел = ПолучитьУзелПланаОбмена(ИДУстройства);
			Выборка = ПланыОбмена.ВыбратьИзменения(Узел,1,ТипМетаданных);	
		КонецЕсли;
		
	Иначе
		ТипМетаданных = Метаданные.Справочники[ИмяСправочника];
		ЕстьРеквизитЭтоГруппа = (ТипМетаданных.Иерархический И ТипМетаданных.ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов);
		Если Все Тогда
			Выборка = ВыборкаСправочникаСУчетомПравДоступа(ИмяСправочника);	
		Иначе
			Узел = ПолучитьУзелПланаОбмена(ИДУстройства);
			Выборка = ПланыОбмена.ВыбратьИзменения(Узел,1,ТипМетаданных);	
		КонецЕсли;
	КонецЕсли;
	
	СтрокаИсключений = "";
	Если ИмяСправочника = "торо_ИзмеряемыеПоказателиОбъектовРемонта" 
		ИЛИ ИмяСправочника = "ПараметрыВыработкиОС" Тогда
		
		СтрокаИсключений = "ЕдиницаИзмерения";
		
	ИначеЕсли ИмяСправочника = "Номенклатура" Тогда 
		
		СтрокаИсключений = "ЕдиницаИзмерения,ВидНоменклатуры, ИспользованиеХарактеристик";
		
	ИначеЕсли ИмяСправочника = "торо_ПричиныПростояОборудования" Тогда
		
		СтрокаИсключений = "ВидПростоя";
		
	ИначеЕсли ИмяСправочника = "торо_ТиповыеДефектыОборудования" Тогда
		
		СтрокаИсключений = "ВидДефекта, КритичностьДефекта";
		
	ИначеЕсли ИмяСправочника = "торо_ИдентификаторыТехКарт" Тогда
		
		СтрокаИсключений = "Статус";
		
	ИначеЕсли ИмяСправочника = "ХарактеристикиНоменклатуры" Тогда
		
		СтрокаИсключений = "Владелец";
		
	ИначеЕсли ИмяСправочника = "ВидыНоменклатуры" Тогда 
		
		СтрокаИсключений = "ТипНоменклатуры, ИспользованиеХарактеристик";
		
	ИначеЕсли ИмяСправочника = "торо_РемонтныеБригады" Тогда 
		
		СтрокаИсключений = "Подразделение";
		
	КонецЕсли;
	
	Если СИерархией Тогда
		СтрокаИсключений = ?(СтрокаИсключений = "", "", СтрокаИсключений+", ") + "Родитель";
	КонецЕсли;
	
	СтрокаИсключенийДляГрупп = СтрокаИсключений;
	Если ИмяСправочника = "торо_ТиповыеДефектыОборудования" Тогда
		СтрокаИсключенийДляГрупп = ?(СтрокаИсключенийДляГрупп = "", "", СтрокаИсключенийДляГрупп+", ") + "ОписаниеДефекта";
	ИначеЕсли ИмяСправочника = "торо_ВидыДефектов" 
		ИЛИ ИмяСправочника = "торо_ТиповыеОР" Тогда
		СтрокаИсключенийДляГрупп = ?(СтрокаИсключенийДляГрупп = "", "", СтрокаИсключенийДляГрупп+", ") + "Комментарий";
	ИначеЕсли ИмяСправочника = "торо_ИдентификаторыТехКарт" Тогда
		СтрокаИсключенийДляГрупп = ?(СтрокаИсключенийДляГрупп = "", "", СтрокаИсключенийДляГрупп+", ") + "Статус";
	ИначеЕсли ИмяСправочника = "Номенклатура" Тогда
		СтрокаИсключенийДляГрупп = ?(СтрокаИсключенийДляГрупп = "", "", СтрокаИсключенийДляГрупп+", ") + "Артикул";
	ИначеЕсли ИмяСправочника = "ВидыНоменклатуры" Тогда 
		СтрокаИсключенийДляГрупп = ?(СтрокаИсключенийДляГрупп = "", "", СтрокаИсключенийДляГрупп+", ") + "ИспользоватьХарактеристики";
	КонецЕсли;

	ЗначенияПоУмолчанию = Новый Структура("ЭтоГруппа, ПометкаУдаления, Комментарий, ОписаниеДефекта", Истина, Ложь, "", "");
	ЗначенияПоУмолчанию.Вставить("ВидПростоя", "0");
	ЗначенияПоУмолчанию.Вставить("ЕдиницаИзмерения", "0");
	ЗначенияПоУмолчанию.Вставить("ВидДефекта", "0");
	ЗначенияПоУмолчанию.Вставить("КритичностьДефекта", "0");
	ЗначенияПоУмолчанию.Вставить("Направление", "0");
	ЗначенияПоУмолчанию.Вставить("Статус", "");
	ЗначенияПоУмолчанию.Вставить("Артикул", "");
	ЗначенияПоУмолчанию.Вставить("Владелец", "0");
	ЗначенияПоУмолчанию.Вставить("ВидНоменклатуры", "0");
	ЗначенияПоУмолчанию.Вставить("ИспользованиеХарактеристик", "");
	ЗначенияПоУмолчанию.Вставить("ТипНоменклатуры", "");
	ЗначенияПоУмолчанию.Вставить("Подразделение", "");
	ЗначенияПоУмолчанию.Вставить("Код", "");
	
	УстановитьПривилегированныйРежим(Истина);
	СписокПользователей = ПользователиИнформационнойБазы.ПолучитьПользователей();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока Выборка.Следующий() Цикл
		
		Если Все Тогда
			ТекущийОбъект = Выборка;
		Иначе
			Попытка
				ТекущийОбъект = Выборка.Получить();
			Исключение
				УдалитьРегистрациюИзмененийПривилегированно(Узел, Выборка);
				Продолжить;
			КонецПопытки;
			
			Если ТипЗнч(ТекущийОбъект) = Тип("УдалениеОбъекта") Тогда
				ПланыОбмена.УдалитьРегистрациюИзменений(Узел, ТекущийОбъект);
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если ТекущийОбъект = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПропускатьГруппы И ТекущийОбъект.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		
		ДобавляемыйОбъект = ФабрикаXDTO.Создать(ТипФабрики);
		ЗаполнитьЗначенияСвойств(ДобавляемыйОбъект, ЗначенияПоУмолчанию);
		
		ДобавляемыйОбъект.ГУИД = Строка(ТекущийОбъект.Ссылка.УникальныйИдентификатор());
		
		Если ЕстьРеквизитЭтоГруппа И ТекущийОбъект.ЭтоГруппа Тогда
			ЗаполнитьЗначенияСвойств(ДобавляемыйОбъект, ТекущийОбъект,,СтрокаИсключенийДляГрупп);
		Иначе
			ЗаполнитьЗначенияСвойств(ДобавляемыйОбъект, ТекущийОбъект,,СтрокаИсключений);
		КонецЕсли;
		
		Если ИмяСправочника = "торо_ИзмеряемыеПоказателиОбъектовРемонта"
			ИЛИ ИмяСправочника = "ПараметрыВыработкиОС"	Тогда
			
			Если НЕ ТекущийОбъект.ЭтоГруппа Тогда
				ДобавляемыйОбъект.ЕдиницаИзмерения = ?(ЗначениеЗаполнено(ТекущийОбъект.ЕдиницаИзмерения),ТекущийОбъект.ЕдиницаИзмерения.Код, 0);
			КонецЕсли;
			
		ИначеЕсли ИмяСправочника = "Номенклатура" Тогда 
			
			Если НЕ ТекущийОбъект.ЭтоГруппа Тогда
				ДобавляемыйОбъект.ЕдиницаИзмерения = ?(ЗначениеЗаполнено(ТекущийОбъект.ЕдиницаИзмерения),ТекущийОбъект.ЕдиницаИзмерения.Код, 0);
				ДобавляемыйОбъект.ВидНоменклатуры = ?(ЗначениеЗаполнено(ТекущийОбъект.ВидНоменклатуры),Строка(ТекущийОбъект.ВидНоменклатуры.Ссылка.УникальныйИдентификатор()), 0);
				ДобавляемыйОбъект.ИспользованиеХарактеристик = XMLСтрока(ТекущийОбъект.ИспользованиеХарактеристик);
			КонецЕсли;
			
		ИначеЕсли ИмяСправочника = "торо_ПричиныПростояОборудования" Тогда
			
			Если НЕ ТекущийОбъект.ЭтоГруппа Тогда
				ДобавляемыйОбъект.ВидПростоя = Строка(ТекущийОбъект.ВидПростоя);
			КонецЕсли;
			
		ИначеЕсли ИмяСправочника = "торо_ТиповыеДефектыОборудования" Тогда
			
			ДобавляемыйОбъект.Направление = ?(ЗначениеЗаполнено(ТекущийОбъект.Владелец),ТекущийОбъект.Владелец.Код, 0);
			Если НЕ ТекущийОбъект.ЭтоГруппа Тогда
				ДобавляемыйОбъект.ВидДефекта =?(ЗначениеЗаполнено(ТекущийОбъект.ВидДефекта),ТекущийОбъект.ВидДефекта.Код, 0);
				ДобавляемыйОбъект.КритичностьДефекта = ?(ЗначениеЗаполнено(ТекущийОбъект.КритичностьДефекта),ТекущийОбъект.КритичностьДефекта.Код, 0);
				Если ТекущийОбъект.ПричиныВозникновенияДефекта.Количество()>0 Тогда
					ДобавляемыйОбъект.ПричинаДефекта = Строка(ТекущийОбъект.ПричиныВозникновенияДефекта[0].Причина.Код);
				КонецЕсли;
				ДобавляемыйОбъект.ПоследствиеДефекта = ТекущийОбъект.ПоследствиеДефекта;
				ДобавляемыйОбъект.НаправлениеНаУстранение = ТекущийОбъект.НаправлениеНаУстранение;
			КонецЕсли;
		ИначеЕсли ИмяСправочника = "торо_ИдентификаторыТехКарт" Тогда
			
			ДобавляемыйОбъект.Статус = XMLСтрока(ТекущийОбъект.Статус);
			
		ИначеЕсли ИмяСправочника = "ХарактеристикиНоменклатуры" Тогда 
			
			Если ТипЗнч(ТекущийОбъект.Владелец) = Тип("СправочникСсылка.ВидыНоменклатуры") Тогда 
				ДобавляемыйОбъект.Владелец = ?(ЗначениеЗаполнено(ТекущийОбъект.Владелец),Строка(ТекущийОбъект.Владелец.Ссылка.УникальныйИдентификатор()), 0);
				ДобавляемыйОбъект.ДляНоменклатуры = Ложь;
			Иначе
				ДобавляемыйОбъект.Владелец = ?(ЗначениеЗаполнено(ТекущийОбъект.Владелец),ТекущийОбъект.Владелец.Код, 0);
				ДобавляемыйОбъект.ДляНоменклатуры = Истина;
			КонецЕсли;
			
		ИначеЕсли ИмяСправочника = "ВидыНоменклатуры" Тогда 
			Если НЕ ТекущийОбъект.ЭтоГруппа Тогда
				ДобавляемыйОбъект.ИспользованиеХарактеристик = XMLСтрока(ТекущийОбъект.ИспользованиеХарактеристик);
				ДобавляемыйОбъект.ТипНоменклатуры = XMLСтрока(ТекущийОбъект.ТипНоменклатуры);
			КонецЕсли;
			
		ИначеЕсли ИмяСправочника = "торо_РемонтныеБригады" Тогда 

			Если НЕ ТекущийОбъект.ЭтоГруппа Тогда
				ДобавляемыйОбъект.Подразделение = XMLСтрока(ТекущийОбъект.Подразделение.УникальныйИдентификатор());
			КонецЕсли;
		
		КонецЕсли;
		
		Если СИерархией Тогда
			
			Если РодителиУИДом Тогда
				
				Если ЗначениеЗаполнено(ТекущийОбъект.Родитель) Тогда
					ДобавляемыйОбъект.Родитель = Строка(ТекущийОбъект.Родитель.УникальныйИдентификатор());
				Иначе
					ДобавляемыйОбъект.Родитель = "";
				КонецЕсли;
				
			Иначе
				
				Если НЕ ЗначениеЗаполнено(ТекущийОбъект.Родитель) Тогда
					ДобавляемыйОбъект.Родитель = Неопределено;
				Иначе
					ОбъектРодитель = ФабрикаXDTO.Создать(ТипФабрики);
					ЗаполнитьЗначенияСвойств(ОбъектРодитель, ЗначенияПоУмолчанию);
					ОбъектРодитель.Родитель = Неопределено;
					ОбъектРодитель.ГУИД = Строка(ТекущийОбъект.Родитель.УникальныйИдентификатор());
					ОбъектРодитель.Наименование = ТекущийОбъект.Родитель.Наименование;
					ДобавляемыйОбъект.Родитель = ОбъектРодитель;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
		Если ИмяСправочника = "торо_ЗначенияИзмеряемыхПоказателейОбъектовРемонта" Тогда
			ДобавляемыйОбъект.КодВладельца = ТекущийОбъект.Владелец.Код;
		КонецЕсли;
		
		Если ИмяСправочника = "Сотрудники" Тогда				
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	Пользователи.Наименование КАК Пользователь
			|ИЗ
			|	Справочник.Пользователи КАК Пользователи
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
			|		ПО Пользователи.ФизическоеЛицо = Сотрудники.ФизическоеЛицо
			|ГДЕ
			|	Сотрудники.Ссылка = &Сотрудник";
			
			Запрос.УстановитьПараметр("Сотрудник", ТекущийОбъект.Ссылка);
			
			ВыборкаПользователей = Запрос.Выполнить().Выбрать();
			
			Пока ВыборкаПользователей.Следующий() Цикл
				Имя = Неопределено;
				
				Для Каждого Пользователь Из СписокПользователей Цикл
					Если Пользователь.ПолноеИмя = ВыборкаПользователей.Пользователь Тогда
						Имя = Пользователь.Имя;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если Не Имя = Неопределено Тогда
					ДобавляемыйОбъект.Пользователи.Добавить(Имя);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		СписокXDTO.Добавить(ДобавляемыйОбъект);
			
		Если НЕ Все Тогда
			ПланыОбмена.УдалитьРегистрациюИзменений(Узел, ТекущийОбъект);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьВыборкуДанныхИерархииИзРегистра(СтруктураИерархии, ИзменяетсяДокументами, СписокОР = Неопределено)
	
	Запрос = Новый Запрос;
	
	Если ИзменяетсяДокументами = Истина Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТабРег.ОбъектИерархии КАК ОбъектИерархии,
		|	ТабРег.РодительИерархии КАК РодительИерархии,
		|	ТабРег.Удален КАК Удален
		|ПОМЕСТИТЬ ВТ_СтруктураИерархии
		|ИЗ
		|	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(
		|			,
		|			СтруктураИерархии = &СтруктураИерархии
		|				И ОбъектИерархии В (&СписокОР)) КАК ТабРег
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОбъектИерархии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ОбъектыРемонта.Ссылка КАК ОбъектРемонта,
		|	ЕСТЬNULL(ВТ_СтруктураИерархии.РодительИерархии, НЕОПРЕДЕЛЕНО) КАК Родитель,
		|	ЕСТЬNULL(ВТ_СтруктураИерархии.Удален, ИСТИНА) КАК НеВИерархии
		|ПОМЕСТИТЬ ВТ_Список
		|ИЗ
		|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтруктураИерархии КАК ВТ_СтруктураИерархии
		|		ПО торо_ОбъектыРемонта.Ссылка = ВТ_СтруктураИерархии.ОбъектИерархии
		|ГДЕ
		|	торо_ОбъектыРемонта.Ссылка В(&СписокОР)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Список.ОбъектРемонта КАК ОбъектРемонта,
		|	ВТ_Список.ОбъектРемонта.Код КАК ОбъектРемонтаКод,
		|	ВТ_Список.ОбъектРемонта.Наименование КАК ОбъектРемонтаНаименование,
		|	ВТ_Список.ОбъектРемонта.ЭтоГруппа КАК ОбъектРемонтаЭтоГруппа,
		|	ВТ_Список.Родитель КАК Родитель,
		|	ВТ_Список.Родитель.Код КАК РодительКод,
		|	ВТ_Список.Родитель.Наименование КАК РодительНаименование,
		|	ВТ_Список.Родитель.ЭтоГруппа КАК РодительЭтоГруппа,
		|	ВТ_Список.НеВИерархии КАК НеВИерархии
		|ИЗ
		|	ВТ_Список КАК ВТ_Список";
		
		Если СписокОР = Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ОбъектИерархии В (&СписокОР)", "");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "торо_ОбъектыРемонта.Ссылка В(&СписокОР)", "ИСТИНА");
		КонецЕсли;
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТабРег.ОбъектИерархии КАК ОбъектИерархии,
		|	ТабРег.РодительИерархии КАК РодительИерархии
		|ПОМЕСТИТЬ ВТ_СтруктураИерархии
		|ИЗ
		|	РегистрСведений.торо_ИерархическиеСтруктурыОР КАК ТабРег
		|ГДЕ
		|	ТабРег.СтруктураИерархии = &СтруктураИерархии
		|	И ТабРег.ОбъектИерархии В(&СписокОР)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ТабРег.ОбъектИерархии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ОбъектыРемонта.Ссылка КАК ОбъектРемонта,
		|	ЕСТЬNULL(ВТ_СтруктураИерархии.РодительИерархии, НЕОПРЕДЕЛЕНО) КАК Родитель,
		|	ВЫБОР
		|		КОГДА ВТ_СтруктураИерархии.ОбъектИерархии ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК НеВИерархии
		|ПОМЕСТИТЬ ВТ_Список
		|ИЗ
		|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтруктураИерархии КАК ВТ_СтруктураИерархии
		|		ПО торо_ОбъектыРемонта.Ссылка = ВТ_СтруктураИерархии.ОбъектИерархии
		|ГДЕ
		|	торо_ОбъектыРемонта.Ссылка В(&СписокОР)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Список.ОбъектРемонта КАК ОбъектРемонта,
		|	ВТ_Список.ОбъектРемонта.Код КАК ОбъектРемонтаКод,
		|	ВТ_Список.ОбъектРемонта.Наименование КАК ОбъектРемонтаНаименование,
		|	ВТ_Список.ОбъектРемонта.ЭтоГруппа КАК ОбъектРемонтаЭтоГруппа,
		|	ВТ_Список.Родитель КАК Родитель,
		|	ВТ_Список.Родитель.Код КАК РодительКод,
		|	ВТ_Список.Родитель.Наименование КАК РодительНаименование,
		|	ВТ_Список.Родитель.ЭтоГруппа КАК РодительЭтоГруппа,
		|	ВТ_Список.НеВИерархии КАК НеВИерархии
		|ИЗ
		|	ВТ_Список КАК ВТ_Список";
		
		Если СписокОР = Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТабРег.ОбъектИерархии В(&СписокОР)", "");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "торо_ОбъектыРемонта.Ссылка В(&СписокОР)", "ИСТИНА");
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("СтруктураИерархии", СтруктураИерархии);
	Если СписокОР <> Неопределено Тогда
		Запрос.УстановитьПараметр("СписокОР", СписокОР);
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка;
		
КонецФункции

Функция ПодготовитьПустуюСтруктуруОтвета()
	
	ТипСтруктуры = ФабрикаXDTO.Тип("android", "СтруктураОтвета");
	СтруктураОтвета = ФабрикаXDTO.Создать(ТипСтруктуры);
	СтруктураОтвета.ДокументПроведен = Ложь;
	СтруктураОтвета.НомерДокумента = "";
	
	Возврат СтруктураОтвета;	
	
КонецФункции

Функция ДобавитьОшибкуВМассив(МассивОшибок, ТекстОшибки, КодОшибки = 0)
	
	ТипСтруктуры = ФабрикаXDTO.Тип("android", "СтруктураТекстаОшибки");
	СтруктураОшибки = ФабрикаXDTO.Создать(ТипСтруктуры);

	СтруктураОшибки.ТекстОшибки = ТекстОшибки;
	СтруктураОшибки.КодОшибки = КодОшибки;
	
	МассивОшибок.Добавить(СтруктураОшибки);
	
КонецФункции

Функция ПолучитьПодразделениеУстройства(ИДУстройства)
	
	Узел = ПолучитьУзелПланаОбмена(ИДУстройства);
	
	Если ЗначениеЗаполнено(Узел) И ЗначениеЗаполнено(Узел.Подразделение) Тогда
		Возврат Узел.Подразделение;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьБригадуУстройства(ИДУстройства)
	
	Узел = ПолучитьУзелПланаОбмена(ИДУстройства);
	
	Если ЗначениеЗаполнено(Узел) И ЗначениеЗаполнено(Узел.Бригада) Тогда
		Возврат Узел.Бригада;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция СериализоватьОбъект(Значение)
	
	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Значение);
	СтрокаXML = ЗаписьXML.Закрыть();
	
	Возврат СтрокаXML;
	
КонецФункции

Функция ДесериализоватьОбъект(СтрокаXML)
	
	ЧтениеXML = Новый ЧтениеXML();
	ЧтениеXML.УстановитьСтроку(СтрокаXML);
	
	Попытка
		Значение = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='ОшибкаДесериализации';ru='ОшибкаДесериализации';en='ОшибкаДесериализации'"), УровеньЖурналаРегистрации.Ошибка, 
		   Метаданные.WebСервисы.ExchangeMobileBrigades,,ОписаниеОшибки);
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки);
	КонецПопытки;
	
	Возврат Значение;
	
КонецФункции

Функция ВыборкаСправочникаСУчетомПравДоступа(ИмяСправочника)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	*
	|ИЗ
	|	Справочник."+ИмяСправочника+" КАК Спр";
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Процедура УдалитьРегистрациюИзмененийПривилегированно(Узел, Выборка)
	
	// Нет прав на объект, но регистрацию изменений все равно надо удалить.
	УстановитьПривилегированныйРежим(Истина);
	ТекущийОбъект = Выборка.Получить();
	ПланыОбмена.УдалитьРегистрациюИзменений(Узел, ТекущийОбъект);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция ПроцентВыполненияПодчиненных(ТаблицаРемонтныхРабот, СтрокаТаблицы)

	КоличествоПодчиненных = 0;
	ПроцентПодчиненных = 0;
	
	МассивПодчиненных = ТаблицаРемонтныхРабот.НайтиСтроки(Новый Структура("Родитель_ID", СтрокаТаблицы.ID));
	Для каждого СтрокаПодчиненная Из МассивПодчиненных Цикл
		Если ТипЗнч(СтрокаПодчиненная.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
			СтруктураПолученная = Новый Структура("Количество, Процент", СтрокаПодчиненная.Количество, СтрокаПодчиненная.ПроцентВыполненияРабот);	
		Иначе
			СтруктураПолученная = ПроцентВыполненияПодчиненных(ТаблицаРемонтныхРабот, СтрокаПодчиненная);
		КонецЕсли; 
		КоличествоПодчиненных = КоличествоПодчиненных + СтруктураПолученная.Количество; 
		ПроцентПодчиненных = ПроцентПодчиненных + СтруктураПолученная.Процент * СтруктураПолученная.Количество;
	КонецЦикла;
	
	СтрокаТаблицы.ПроцентВыполненияРабот = ?(КоличествоПодчиненных = 0, 100, ПроцентПодчиненных / КоличествоПодчиненных);
	СтруктураВозврата = Новый Структура("Количество, Процент", СтрокаТаблицы.Количество, СтрокаТаблицы.ПроцентВыполненияРабот);
	
	Возврат СтруктураВозврата;	

КонецФункции
			
#КонецОбласти
