#Область ОбработчикиСобытийФормы

&НаСервере
&После("ПриСозданииНаСервере")
Процедура Расш_гкс_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	дс_ПриСозданииНаСервере();
КонецПроцедуры

&НаСервере
&После("ПередЗаписьюНаСервере")
Процедура Расш_гкс_ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	дс_ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область Локализация

// гкс+ [Релиз 1] Куст 27.03.2020
&НаКлиенте
Процедура дс_НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	торо_ЛокализацияКлиент.НачалоВыбора(ЭтаФорма, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры
// гкс- [Релиз 1] Куст 27.03.2020

// гкс+ [Релиз 1] Куст 27.03.2020
&НаКлиенте
Процедура дс_ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	торо_ЛокализацияКлиент.ОбработкаВыбора(ЭтаФорма, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры
// гкс- [Релиз 1] Куст 27.03.2020

// гкс+ [Релиз 1] Куст 27.03.2020
&НаСервере
Процедура дс_ПриСозданииНаСервере()
	СтроковыеРеквизиты = "Наименование";
	торо_ЛокализацияСобытияФорм.ПриСоздании(ЭтаФорма, СтроковыеРеквизиты);

КонецПроцедуры 
// гкс- [Релиз 1] Куст 27.03.2020

// гкс+ [Релиз 1] Куст 27.03.2020
&НаСервере
Процедура дс_ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи)
	торо_ЛокализацияСобытияФорм.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
КонецПроцедуры 
// гкс- [Релиз 1] Куст 27.03.2020

// гкс+ [Релиз 1] Куст 27.03.2020
&НаСервере
Процедура дс_ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи)
	торо_ЛокализацияСобытияФорм.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
КонецПроцедуры 
// гкс- [Релиз 1] Куст 27.03.2020

// гкс+ [Релиз 1] Куст 27.03.2020
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	дс_ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
КонецПроцедуры
// гкс- [Релиз 1] Куст 27.03.2020

#КонецОбласти 

