#Область ПрограммныйИнтерфейс

// Функция - Функция выполняет поиск в коллекции ДанныеФормыДерево элементов ДанныеФормыЭлементДерева 
// в соответствии с заданныой структурой.
//
// Параметры:
//  Родитель							 - ДанныеФормыДерево, ДанныеФормыЭлементДерева - Родитель в котором осуществляем поиск элементов.
//		Для самого родителя если его тип ДанныеФормыЭлементДерева также происходит сравнение со структурой поиска.
//		Если такое поведение не нужно - можно родителя исключить используя параметр ИскатьНачинаяСУровняВкл
//
//  СтруктураПоиска						 - Структура - Структура поиска с которой сравниваются строки коллекции.
//		Ключами структуры являются колонки дерева, значениями - значения полей.
//
//  ИскатьНачинаяСУровняВкл				 - Число, Неопределено - Поиск в дереве осуществляется начиная с указанного уровня, включительно.
//		Уровнем на котором находится родитель считается значение 0, устанавливаемое по умолчанию и при значении Неопределено.
//
//  ИскатьПоУровеньВкл					 - Число, Неопределено - Поиск осуществляется включительно по указанный уровень.
//		Отсчет идет от корня, т.е. родителя, начиная с 0. При значении Неопределено уровень не ограничивается.
//
//  ОграничениеПоКоличествуНайденных	 - Число, Неопределено - В параметре указываем ограничение на количество 
//		найденных строк (например если нужна только одна). Если Неопределено выполняется поиск всех элементов.
// 
// Возвращаемое значение:
//  Массив - Массив найденных элементов ДанныеФормыЭлементДерева
//
Функция НайтиСтроки(
	Родитель,
	Знач СтруктураПоиска,
	Знач ИскатьНачинаяСУровняВкл=Неопределено,
	Знач ИскатьПоУровеньВкл=Неопределено,
	Знач ОграничениеПоКоличествуНайденных=Неопределено) Экспорт
	
	ИскатьНачинаяСУровняВкл = ?(ИскатьНачинаяСУровняВкл=Неопределено,0,ИскатьНачинаяСУровняВкл);
	ИскатьПоУровеньВкл = ?(ИскатьПоУровеньВкл=Неопределено,-1,ИскатьПоУровеньВкл);
	ОграничениеПоКоличествуНайденных = ?(ОграничениеПоКоличествуНайденных=Неопределено,-1,ОграничениеПоКоличествуНайденных);
	
	НайденныеРезультаты = Новый Массив;
	
	Если Не ОграничениеПоКоличествуНайденных = 0 Тогда
		
		Если ТипЗнч(Родитель) = Тип("ДанныеФормыЭлементДерева") И ИскатьНачинаяСУровняВкл = 0 Тогда
			Если СравнитьСтрокуСоСтруктуройПоиска(Родитель, СтруктураПоиска) Тогда
				НайденныеРезультаты.Добавить(Родитель);
			КонецЕсли;
		КонецЕсли;
		
		ТекУровень = 0;
		НайтиРекурсивно(
			Родитель,
			СтруктураПоиска,
			ИскатьНачинаяСУровняВкл,
			ИскатьПоУровеньВкл,
			ОграничениеПоКоличествуНайденных,
			ТекУровень+1,
			НайденныеРезультаты,
			Ложь
		);
		
	КонецЕсли;
	
	Возврат НайденныеРезультаты;
	
КонецФункции

// Функция - Функция выполняет поиск в коллекции ДанныеФормыДерево элементов ДанныеФормыЭлементДерева 
// в соответствии с заданными составными условиями. Условия можно объединять в группы И и ИЛИ
//
// Параметры:
//  Родитель							 - ДанныеФормыДерево, ДанныеФормыЭлементДерева - Родитель в котором осуществляем поиск элементов.
//		Для самого родителя если его тип ДанныеФормыЭлементДерева также происходит сравнение со структурой поиска.
//		Если такое поведение не нужно - можно родителя исключить используя параметр ИскатьНачинаяСУровняВкл
//
//  УсловиеПоиска						 - Массив - Условия поиска с которыми сравниваются строки коллекции.
//		Условие создается с помощью Новый_ГруппаИли_Условия() или Новый_ГруппаИ_Условия().
//
//  ИскатьНачинаяСУровняВкл				 - Число, Неопределено - Поиск в дереве осуществляется начиная с указанного уровня, включительно.
//		Уровнем на котором находится родитель считается значение 0, устанавливаемое по умолчанию и при значении Неопределено.
//
//  ИскатьПоУровеньВкл					 - Число, Неопределено - Поиск осуществляется включительно по указанный уровень.
//		Отсчет идет от корня, т.е. родителя, начиная с 0. При значении Неопределено уровень не ограничивается.
//
//  ОграничениеПоКоличествуНайденных	 - Число, Неопределено - В параметре указываем ограничение на количество 
//		найденных строк (например если нужна только одна). Если Неопределено выполняется поиск всех элементов.
// 
// Возвращаемое значение:
//  Массив - Массив найденных элементов ДанныеФормыЭлементДерева
//
Функция НайтиСтрокиПоСоставномуУсловию(Родитель,
	Знач УсловиеПоиска,
	Знач ИскатьНачинаяСУровняВкл=Неопределено,
	Знач ИскатьПоУровеньВкл=Неопределено,
	Знач ОграничениеПоКоличествуНайденных=Неопределено) Экспорт
	
	ИскатьНачинаяСУровняВкл = ?(ИскатьНачинаяСУровняВкл=Неопределено,0,ИскатьНачинаяСУровняВкл);
	ИскатьПоУровеньВкл = ?(ИскатьПоУровеньВкл=Неопределено,-1,ИскатьПоУровеньВкл);
	ОграничениеПоКоличествуНайденных = ?(ОграничениеПоКоличествуНайденных=Неопределено,-1,ОграничениеПоКоличествуНайденных);
	
	НайденныеРезультаты = Новый Массив;
	
	Если Не ОграничениеПоКоличествуНайденных = 0 Тогда
		
		Если ТипЗнч(Родитель) = Тип("ДанныеФормыЭлементДерева") И ИскатьНачинаяСУровняВкл = 0 Тогда
			Если СравнитьСтрокуСоСложнымУсловием(Родитель, УсловиеПоиска) Тогда
				НайденныеРезультаты.Добавить(Родитель);
			КонецЕсли;
		КонецЕсли;
		
		ТекУровень = 0;
		НайтиРекурсивно(
			Родитель,
			УсловиеПоиска,
			ИскатьНачинаяСУровняВкл,
			ИскатьПоУровеньВкл,
			ОграничениеПоКоличествуНайденных,
			ТекУровень+1,
			НайденныеРезультаты,
			Истина
		);
		
	КонецЕсли;
	
	Возврат НайденныеРезультаты;
	
КонецФункции

// Функция - Вспомогательная функция для НайтиСтрокиПоСоставномуУсловию() 
//	Возвращает новую группу условия. Добавляются элементы с помощью ДобавитьВГруппуУсловияЭлементИлиГруппу() 
// 
// Возвращаемое значение:
//  Массив - Группа условия
//
Функция Новый_ГруппаИли_Условия() Экспорт
	Группа = Новый Массив(1);
	Группа[0] = "ИЛИ";
	Возврат Группа;
КонецФункции

// Функция - Вспомогательная функция для НайтиСтрокиПоСоставномуУсловию() 
//	Возвращает новую группу условия. Добавляются элементы с помощью ДобавитьВГруппуУсловияЭлементИлиГруппу() 
// 
// Возвращаемое значение:
//  Массив - Группа условия
//
Функция Новый_ГруппаИ_Условия() Экспорт
	Группа = Новый Массив(1);
	Группа[0] = "И";
	Возврат Группа;
КонецФункции

// Функция - Вспомогательная функция для НайтиСтрокиПоСоставномуУсловию() 
//	Возвращает новую группу условия. Добавляются элементы с помощью ДобавитьВГруппуУсловияЭлементИлиГруппу() 
//
// Параметры:
//  ИмяКолонки		 	- Строка - Имя колонки.
//  Значение	 		- Строка - Значение.
//
// Возвращаемое значение:
//  Массив - Группа условия
//
Функция Новый_ЭлементУсловия(ИмяКолонки, Значение) Экспорт
	Элемент = Новый Массив(3);
	Элемент[0] = "ЭЛЕМЕНТ";
	Элемент[1] = ИмяКолонки;
	Элемент[2] = Значение;
	Возврат Элемент;
КонецФункции


// Процедура - Добавить в группу условия элемент или группу
//
// Параметры:
//  ГруппаУсловия				 - Массив - Группа условия созданная Новый_ГруппаИ_Условия() или Новый_ГруппаИли_Условия()
//  ЭлементИлиГруппаДобавляемая	 - Массив - Группа условия созданная Новый_ГруппаИ_Условия() или Новый_ГруппаИли_Условия()
//		или элемент условия созданный с помощью Новый_ЭлементУсловия(ИмяКолонки, Значение)
//
Процедура ДобавитьВГруппуУсловияЭлементИлиГруппу(ГруппаУсловия, ЭлементИлиГруппаДобавляемая) Экспорт
	ГруппаУсловия.Добавить(ЭлементИлиГруппаДобавляемая);
КонецПроцедуры

// Процедура выполняет упорядочивание строк в табличной части ремонтных работ в соотвествии с тем, 
// в каком порядке они расположены в дереве ремонтных работ на форме.
// 
// Параметры: 
//  ДеревоРемонтныхРабот - ДанныеФормыДерево - дерево формы, которое заполняется из табличной части РемонтныеРаботы.    
//  РемонтныеРаботы - ДанныеФормыКоллекция - табличная часть документа с ремонтными работами.
// 
Процедура УпорядочитьРемонтныеРаботы(ДеревоРемонтныхРабот, РемонтныеРаботы) Экспорт 
	
	СтрокиДерева = ДеревоРемонтныхРабот.ПолучитьЭлементы()[0].ПолучитьЭлементы();
	
	Если СтрокиДерева.Количество() > 0 Тогда 
		Если СтрокиДерева[0].Свойство("РемонтыОборудования_ID") Тогда 
			НайдСтроки = РемонтныеРаботы.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", СтрокиДерева[0].РемонтыОборудования_ID));
		ИначеЕсли СтрокиДерева[0].Свойство("Предписание_ID") Тогда 
			НайдСтроки = РемонтныеРаботы.НайтиСтроки(Новый Структура("Предписание_ID", СтрокиДерева[0].Предписание_ID));
		КонецЕсли;
		
		Для каждого Работа ИЗ НайдСтроки Цикл
			РемонтныеРаботы.Удалить(Работа);
		КонецЦикла;
		
		УпорядочитьРемонтныеРаботыРекурсивно(СтрокиДерева, РемонтныеРаботы);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура НайтиРекурсивно(
	ДанныеФормыДеревоИлиЭлементДерева,
	СтруктураПоиска,
	ИскатьНачинаяСУровняВкл,
	ИскатьПоУровеньВкл,
	МаксКолвоИскомых,
	Знач ТекУровень,
	ВыхНайденныеРезультаты,
	Сложный)
	
	Если МаксКолвоИскомых >= 0 И ВыхНайденныеРезультаты.Количество() >= МаксКолвоИскомых Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементыДерева = ДанныеФормыДеревоИлиЭлементДерева.ПолучитьЭлементы();
	
	Для Каждого ЭлементДерева Из ЭлементыДерева Цикл
		Если ТекУровень >= ИскатьНачинаяСУровняВкл И (ТекУровень <= ИскатьПоУровеньВкл Или ИскатьПоУровеньВкл = -1) Тогда
			Если Сложный = Ложь Тогда
				Если СравнитьСтрокуСоСтруктуройПоиска(ЭлементДерева, СтруктураПоиска) Тогда
					ВыхНайденныеРезультаты.Добавить(ЭлементДерева);
				КонецЕсли;
			Иначе
				Если СравнитьСтрокуСоСложнымУсловием(ЭлементДерева, СтруктураПоиска) Тогда
					ВыхНайденныеРезультаты.Добавить(ЭлементДерева);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ТекУровень <= ИскатьПоУровеньВкл Или ИскатьПоУровеньВкл = -1 Тогда
			НайтиРекурсивно(
				ЭлементДерева,
				СтруктураПоиска,
				ИскатьНачинаяСУровняВкл,
				ИскатьПоУровеньВкл,
				МаксКолвоИскомых,
				ТекУровень+1,
				ВыхНайденныеРезультаты,
				Сложный);
				
		КонецЕсли;
		
		Если ВыхНайденныеРезультаты.Количество() >= МаксКолвоИскомых И МаксКолвоИскомых >= 0 Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция СравнитьСтрокуСоСтруктуройПоиска(СтрокаДерева, СтруктураПоиска)
	
	флИскомое = Истина;
	Для Каждого КлючЗначение Из СтруктураПоиска Цикл
		Если Не СтрокаДерева[КлючЗначение.Ключ] = КлючЗначение.Значение Тогда
			флИскомое = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат флИскомое;
	
КонецФункции

Функция СравнитьСтрокуСоСложнымУсловием(СтрокаДерева, УсловиеПоиска)
	
	Если УсловиеПоиска[0] = "И" Тогда
		Возврат ВычислитьЗначениеГруппыИ(СтрокаДерева, УсловиеПоиска);
	ИначеЕсли УсловиеПоиска[0] = "ИЛИ" Тогда
		Возврат ВычислитьЗначениеГруппыИЛИ(СтрокаДерева, УсловиеПоиска);
	КонецЕсли;
	
КонецФункции

Функция ВычислитьЗначениеГруппыИ(СтрокаДерева, ГруппаУсловий)
	
	флПодходитПодУсловие = Истина;
	Для Сч = 1 По ГруппаУсловий.ВГраница() Цикл
		Если ГруппаУсловий[Сч][0] = "ЭЛЕМЕНТ" Тогда
			флПодходитПодУсловие = флПодходитПодУсловие И СтрокаДерева[ГруппаУсловий[Сч][1]] = ГруппаУсловий[Сч][2];
		ИначеЕсли ГруппаУсловий[Сч][0] = "И" Тогда
			флПодходитПодУсловие = флПодходитПодУсловие И ВычислитьЗначениеГруппыИ(СтрокаДерева, ГруппаУсловий[Сч]);
		ИначеЕсли ГруппаУсловий[Сч][0] = "ИЛИ" Тогда
			флПодходитПодУсловие = флПодходитПодУсловие И ВычислитьЗначениеГруппыИли(СтрокаДерева, ГруппаУсловий[Сч]);
		КонецЕсли;
		Если флПодходитПодУсловие = Ложь Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат флПодходитПодУсловие;
	
КонецФункции

Функция ВычислитьЗначениеГруппыИЛИ(СтрокаДерева, ГруппаУсловий)
	
	флПодходитПодУсловие = Ложь;
	Для Сч = 1 По ГруппаУсловий.ВГраница() Цикл
		Если ГруппаУсловий[Сч][0] = "ЭЛЕМЕНТ" Тогда
			флПодходитПодУсловие = СтрокаДерева[ГруппаУсловий[Сч][1]] = ГруппаУсловий[Сч][2];
		ИначеЕсли ГруппаУсловий[Сч][0] = "И" Тогда
			флПодходитПодУсловие = ВычислитьЗначениеГруппыИ(СтрокаДерева, ГруппаУсловий[Сч]);
		ИначеЕсли ГруппаУсловий[Сч][0] = "ИЛИ" Тогда
			флПодходитПодУсловие = ВычислитьЗначениеГруппыИли(СтрокаДерева, ГруппаУсловий[Сч]);
		КонецЕсли;
		Если флПодходитПодУсловие = Истина Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат флПодходитПодУсловие;
	
КонецФункции

Процедура УпорядочитьРемонтныеРаботыРекурсивно(СтрокиДерева, РемонтныеРаботы) 
	
	Если СтрокиДерева.Количество() > 0 Тогда
		Для Каждого Строка ИЗ СтрокиДерева Цикл 
			НСтр = РемонтныеРаботы.Добавить(); 	
			ЗаполнитьЗначенияСвойств(НСтр, Строка);
			СтрДерева = Строка.ПолучитьЭлементы();
			УпорядочитьРемонтныеРаботыРекурсивно(СтрДерева, РемонтныеРаботы);			
		КонецЦикла;  
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти