
&НаСервере
Процедура Расш_гкс_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Элементы.СтоимостьЧасаВалюта.ТолькоПросмотр = Истина;
	ДобавитьНовыеЭлементы();
КонецПроцедуры

&НаСервере
Процедура ДобавитьНовыеЭлементы()
	МассРеквизитов = Новый Массив();
	МассРеквизитов.Добавить(Новый РеквизитФормы("гкс_ВалютаДокумента", Новый ОписаниеТипов("СправочникСсылка.Валюты")));
	ИзменитьРеквизиты(МассРеквизитов);
	ЭтотОбъект["гкс_ВалютаДокумента"] = ПолучитьВалютуОрганизации(Объект.Организация);
	//
	НЭлем = Элементы.Добавить("гкс_ГруппаОрганизация", Тип("ГруппаФормы"));
	НЭлем.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НЭлем.ОтображатьЗаголовок = Ложь;
	//
	Элементы.Переместить(Элементы["гкс_ГруппаОрганизация"], ЭтаФорма, Элементы.Организация);
	Элементы.Переместить( Элементы.Организация, Элементы["гкс_ГруппаОрганизация"]);
	//
	НЭлем = Элементы.Добавить("гкс_ВалютаЦены", Тип("ПолеФормы"), Элементы["гкс_ГруппаОрганизация"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Объект.Организация.гкс_ВидЦены.ВалютаЦены";
КонецПроцедуры

&НаКлиенте
Процедура Расш_гкс_СтоимостьЧасаПередОкончаниемРедактированияПосле(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	ТекДанные = Элементы.СтоимостьЧаса.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		ТекДанные.Валюта = ЭтотОбъект["гкс_ВалютаДокумента"];
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВалютуОрганизации(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Организации.гкс_ВидЦены.ВалютаЦены КАК Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда 
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;

КонецФункции

&НаСервере
Процедура Расш_гкс_ПриЧтенииНаСервереПосле(ТекущийОбъект)
	ТемпСтрукт = Новый Структура("гкс_ВалютаДокумента", ПолучитьВалютуОрганизации(Объект.Организация));
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ТемпСтрукт);
КонецПроцедуры

&НаСервере
Процедура Расш_гкс_ОрганизацияПриИзмененииПослеНаСервере()
	ЭтотОбъект["гкс_ВалютаДокумента"] = ПолучитьВалютуОрганизации(Объект.Организация);
	Для Каждого СТ Из Объект.СтоимостьЧаса Цикл
		СТ.Валюта = ЭтотОбъект["гкс_ВалютаДокумента"];
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Расш_гкс_ОрганизацияПриИзмененииПосле(Элемент)
	Расш_гкс_ОрганизацияПриИзмененииПослеНаСервере();
КонецПроцедуры
