
&ИзменениеИКонтроль("ПолучитьСодержательнуюЧастьЗапроса")
Функция Расш_гкс_ПолучитьСодержательнуюЧастьЗапроса()

	ЗапросТекст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ВыявленныеДефекты.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_ВыявленныеДефекты.ОтказавшийЭлемент КАК ОтказавшийЭлемент,
	|	торо_ВыявленныеДефекты.ДефектПричина КАК ДефектПричина,
	#Вставка
	|	торо_ВыявленныеДефекты.гкс_КорневаяПричина КАК гкс_КорневаяПричина,
	// Гкс+[TOIR20-454] Зозуля А.В. от 09.10.2024. Добавлено:{
	|	торо_ВыявленныеДефекты.Регистратор.гкс_НомерТАГ КАК НомерТАГ,
	// } Гкс-[TOIR20-454] Зозуля А.В. от 09.10.2024.
	#КонецВставки
	|	торо_ВыявленныеДефекты.Регистратор.ДефектВыявленВПроцессе КАК ДефектВыявленВПроцессе,
	|	торо_ВыявленныеДефекты.ВидДефекта КАК ВидДефекта,
	|	ВЫБОР
	|		КОГДА торо_Ремонты.Регистратор ЕСТЬ NULL
	|			ТОГДА ""Нет оформленных заявок""
	|		ИНАЧЕ торо_Ремонты.Регистратор
	|	КОНЕЦ КАК ОформленнаяЗаявка,
	|	торо_ВыявленныеДефекты.Регистратор КАК Документ,
	|	торо_ВыявленныеДефекты.Период КАК Дата,
	|	торо_ВыявленныеДефекты.ОбъектРемонта КАК НеисправныйОбъектРемонта,
	|	торо_ВыявленныеДефекты.ID КАК ID,
	|	Описание.ДефектОписание КАК ОписаниеДефекта,
	|	Описание.КритичностьДефекта КАК КритичностьДефекта,
	|	торо_ОтмененныеРемонты.Отменен КАК Закрыт,
	|	торо_ОтмененныеРемонты.ПричинаЗакрытия КАК ПричинаЗакрытия,
	|	торо_СтатусыДокументовВыявленныхДефектовУстановленныеСрезПоследних.СтатусДокумента КАК СтатусДокумента,
	|	Описание.ПоследствияДефекта КАК ПоследствияДефекта,
	|	Описание.НаправлениеНаУстранение КАК НаправлениеНаУстранение
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	РегистрСведений.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефекты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_Ремонты КАК торо_Ремонты
	|		ПО торо_ВыявленныеДефекты.ID = торо_Ремонты.ID
	|			И (торо_Ремонты.Регистратор ССЫЛКА Документ.торо_ЗаявкаНаРемонт)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ВыявленныеДефекты.СписокДефектов КАК Описание
	|		ПО (Описание.ID = торо_ВыявленныеДефекты.ID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОтмененныеРемонты КАК торо_ОтмененныеРемонты
	|		ПО торо_ВыявленныеДефекты.ID = торо_ОтмененныеРемонты.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_СтатусыДокументовВыявленныхДефектовУстановленные.СрезПоследних(, ) КАК торо_СтатусыДокументовВыявленныхДефектовУстановленныеСрезПоследних
	|		ПО торо_ВыявленныеДефекты.Регистратор = торо_СтатусыДокументовВыявленныхДефектовУстановленныеСрезПоследних.ИзменяемыйДокумент
	|{ГДЕ
	|	(торо_ВыявленныеДефекты.Период МЕЖДУ &ДатаНач И &ДатаКон)}"

	+ "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";

	Возврат ЗапросТекст;

КонецФункции

&ИзменениеИКонтроль("ПриКомпоновкеРезультата")
Процедура Расш_гкс_ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	Идентификатор = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ИерархияТип")).ИдентификаторПользовательскойНастройки;
	СтрокаПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Идентификатор);

	Если СтрокаПараметр <> Неопределено И ЗначениеЗаполнено(СтрокаПараметр.Значение) Тогда
		ТекИерархия = СтрокаПараметр.Значение;
	Иначе
		ТекИерархия = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"НастройкиТОиР",
		"ОсновнаяСтруктураИерархии",
		Справочники.торо_СтруктурыОР.ПустаяСсылка());

		Если СтрокаПараметр <> Неопределено Тогда
			СтрокаПараметр.Значение = ТекИерархия;
		КонецЕсли;

	КонецЕсли;

	торо_ОтчетыСервер.УстановитьЗапросыНаборовДанныхИерархииОР(СхемаКомпоновкиДанных, ТекИерархия, "ДатаКон");
	#Вставка
	СдвигЧП = 0;
	Если КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СдвигЧП") Тогда 
		СдвигЧП = КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.СдвигЧП;
	КонецЕсли;
	#КонецВставки

	Если ТекИерархия.СтроитсяАвтоматически Тогда

		СхемаКомпоновкиДанных.НаборыДанных.Объекты.Запрос =
		ПолучитьСодержательнуюЧастьЗапроса()+
		"ВЫБРАТЬ
		|	ВТ_Данные.ОбъектРемонта КАК ОбъектРемонта,
		|	ВТ_Данные.ОтказавшийЭлемент КАК ОтказавшийЭлемент,
		|	ВТ_Данные.ДефектПричина КАК ДефектПричина,
		|	ВТ_Данные.ДефектВыявленВПроцессе КАК ДефектВыявленВПроцессе,
		|	ВТ_Данные.ВидДефекта КАК ВидДефекта,
		|	ВТ_Данные.ОформленнаяЗаявка КАК ОформленнаяЗаявка,
		|	ВТ_Данные.Документ КАК Документ,
		#Вставка
		|	ДобавитьКДате(ВТ_Данные.Дата, Час, " + СдвигЧП + ") КАК Дата,
		// Гкс+[TOIR20-454] Зозуля А.В. от 09.10.2024. Добавлено:{
		|	ВТ_Данные.НомерТАГ КАК НомерТАГ,
		// } Гкс-[TOIR20-454] Зозуля А.В. от 09.10.2024.
		#КонецВставки
		#Удаление
		|	ВТ_Данные.Дата КАК Дата,
		#КонецУдаления
		|	ВТ_Данные.НеисправныйОбъектРемонта КАК НеисправныйОбъектРемонта,
		|	ВТ_Данные.ID КАК ID,
		|	ВТ_Данные.ОписаниеДефекта КАК ОписаниеДефекта,
		|	ВТ_Данные.КритичностьДефекта КАК КритичностьДефекта,
		|	ВТ_Данные.Закрыт КАК Закрыт,
		#Вставка
		|	ВТ_Данные.гкс_КорневаяПричина КАК гкс_КорневаяПричина,
		#КонецВставки
		|	ВТ_Данные.ПричинаЗакрытия КАК ПричинаЗакрытия,
		|	ВТ_Данные.СтатусДокумента КАК СтатусДокумента,
		|	ВТ_Данные.ПоследствияДефекта КАК ПоследствияДефекта,
		|	ВТ_Данные.НаправлениеНаУстранение КАК НаправлениеНаУстранение,
		|	ВТ_Данные.ОбъектРемонта." + ТекИерархия.РеквизитОР + " КАК ОбъектИерархии
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные";

		торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.Иерархия);

	Иначе

		торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.ТолькоИерархия);

		СхемаКомпоновкиДанных.НаборыДанных.Объекты.Запрос = 
		ПолучитьСодержательнуюЧастьЗапроса()+
		"ВЫБРАТЬ
		|	ВТ_Данные.ОбъектРемонта КАК ОбъектРемонта,
		|	ВТ_Данные.ОтказавшийЭлемент КАК ОтказавшийЭлемент,
		|	ВТ_Данные.ДефектПричина КАК ДефектПричина,
		|	ВТ_Данные.ДефектВыявленВПроцессе КАК ДефектВыявленВПроцессе,
		|	ВТ_Данные.ВидДефекта КАК ВидДефекта,
		|	ВТ_Данные.ОформленнаяЗаявка КАК ОформленнаяЗаявка,
		|	ВТ_Данные.Документ КАК Документ,
		#Вставка
		|	ДобавитьКДате(ВТ_Данные.Дата, Час, " + СдвигЧП + ") КАК Дата,
		// Гкс+[TOIR20-454] Зозуля А.В. от 09.10.2024. Добавлено:{
		|	ВТ_Данные.НомерТАГ КАК НомерТАГ,
		// } Гкс-[TOIR20-454] Зозуля А.В. от 09.10.2024.
		#КонецВставки
		#Удаление
		|	ВТ_Данные.Дата КАК Дата,
		#КонецУдаления
		|	ВТ_Данные.НеисправныйОбъектРемонта КАК НеисправныйОбъектРемонта,
		|	ВТ_Данные.ID КАК ID,
		|	ВТ_Данные.ОписаниеДефекта КАК ОписаниеДефекта,
		|	ВТ_Данные.КритичностьДефекта КАК КритичностьДефекта,
		|	ВТ_Данные.Закрыт КАК Закрыт,
		#Вставка
		|	ВТ_Данные.гкс_КорневаяПричина КАК гкс_КорневаяПричина,
		#КонецВставки
		|	ВТ_Данные.ПричинаЗакрытия КАК ПричинаЗакрытия,
		|	ВТ_Данные.СтатусДокумента КАК СтатусДокумента,
		|	ВТ_Данные.ПоследствияДефекта КАК ПоследствияДефекта,
		|	ВТ_Данные.НаправлениеНаУстранение КАК НаправлениеНаУстранение,
		|	ВТ_Данные.ОбъектРемонта КАК ОбъектИерархии
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные";

	КонецЕсли;

КонецПроцедуры
