
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Класс", Объект.Класс) Тогда
		Элементы.Класс.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("ТабличнаяЧасть", Объект.ТабличнаяЧасть) Тогда
		Элементы.ТабличнаяЧасть.ТолькоПросмотр = Истина;
		Параметры.Свойство("ИсточникЗначений", Объект.ИсточникЗначений);
		Если ЗначениеЗаполнено(Объект.Класс) И ЗначениеЗаполнено(Объект.ТабличнаяЧасть) Тогда
			ПодготовитьКолонкиТабличнойЧасти();
			ВывестиСтрокиДляНастройкиНаследования();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КлассПриИзменении(Элемент)
	
	Объект.ТабличнаяЧасть = ПредопределенноеЗначение("ПланВидовХарактеристик.АтрибутыКласса.ПустаяСсылка");
	Объект.СтрокиДляНастройки.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если НЕ ЗначениеЗаполнено(Объект.Класс) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Не выбран класс.'"), , , "Объект.Класс");
		Возврат;
	КонецЕсли;
	
	ПараметрыФормыВыбора = Новый Структура("Класс, ТекущаяСтрока", Объект.Класс, Объект.ТабличнаяЧасть);
	ОткрытьФорму("Обработка.НастройкаНаследованияСтрокТабличныхЧастей.Форма.ФормаВыбораТабЧасти", 
		ПараметрыФормыВыбора, Элемент, УникальныйИдентификатор, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		ЗаполнитьЗначенияСвойств(Объект, ВыбранноеЗначение);
		ПодготовитьКолонкиТабличнойЧасти();
		ВывестиСтрокиДляНастройкиНаследования();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыСтрокиДляНастройки

&НаКлиенте
Процедура СтрокиДляНастройкиВыбраноПриИзменении(Элемент)
	
	ТекСтрока = Элементы.СтрокиДляНастройки.ТекущиеДанные;
	НайденоОтметки = Объект.СтрокиДляНастройки.НайтиСтроки(Новый Структура("Выбрано", Истина));
	Если НайденоОтметки.Количество() > 0 Тогда
		Для Каждого СтрокаНайдено ИЗ НайденоОтметки Цикл
			Если НЕ СтрокаНайдено.Строка = ТекСтрока.Строка Тогда
				СтрокаНайдено.Выбрано = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ТекСтрока.Выбрано Тогда
		СтрокиДляОтметки = Новый Массив;
		СтрокиДляОтметки.Добавить(ТекСтрока.Строка);
		
		СтрокиВложеные = Новый Массив;
		
		СтруктураПоискаПодчиненных = Новый Структура("ИсточникЗначений");
		
		Пока СтрокиДляОтметки.Количество() > 0 Цикл 
			
			Для Каждого СтрокаДляОтметки ИЗ СтрокиДляОтметки Цикл
				СтруктураПоискаПодчиненных.ИсточникЗначений = СтрокаДляОтметки;
				НайденоПодчиненные = Объект.СтрокиДляНастройки.НайтиСтроки(СтруктураПоискаПодчиненных);
				Для Каждого СтрокаВложенных ИЗ НайденоПодчиненные Цикл
					СтрокаВложенных.Выбрано = Истина;
					Если НЕ СтрокаВложенных.Строка = СтрокаДляОтметки Тогда
						СтрокиВложеные.Добавить(СтрокаВложенных.Строка);
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			
			ВремХранилище = СтрокиДляОтметки;
			СтрокиДляОтметки = СтрокиВложеные;
			СтрокиВложеные = ВремХранилище;
			СтрокиВложеные.Очистить();
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СделатьНаследником(Команда)
	
	Отказ = Ложь;
	
	ТекСтрока = Элементы.СтрокиДляНастройки.ТекущиеДанные;
	Если ТекСтрока = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ТекСтрока.Строка) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Выберите строку табличной части, чтобы сделать наследником.'"),,,, Отказ);
	ИначеЕсли ТекСтрока.Класс = Объект.Класс Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Выберите строку дочернего класса, чтобы сделать наследником.'"),,,, Отказ);
	ИначеЕсли ТекСтрока.СтатусНаследования = 3 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Выбранная строка уже является наследником. Сперва разорвите связь с родителем.'"),,,, Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	НайденоСтроки = Объект.СтрокиДляНастройки.НайтиСтроки(Новый Структура("Класс, Выбрано", Объект.Класс, Истина));
	Если НайденоСтроки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Не выбрана строка-родитель. Установите флаг у строки-родителя, чтобы сделать строку наследником.'"),,,, 
			Отказ);
	Иначе
		СтрокаРодитель = НайденоСтроки[0];
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыКоманды = Новый Структура("Строка, Родитель", ТекСтрока.Строка, СтрокаРодитель.Строка);
	ОписаниеОповещения = Новый ОписаниеОповещения("СделатьНаследникомЗавершение", ЭтаФорма, ПараметрыКоманды);
	ПоказатьВопрос(ОписаниеОповещения, 
		НСтр("ru='Сделать выбранную строку наследником?'"), РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура РазорватьСвязьСРодителем(Команда)
	
	Отказ = Ложь;
	
	ТекСтрока = Элементы.СтрокиДляНастройки.ТекущиеДанные;
	Если ТекСтрока = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ТекСтрока.Строка) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Выберите строку табличной части, чтобы разорвать связь с родителем.'"),,,, Отказ);
	ИначеЕсли ТекСтрока.Класс = Объект.Класс Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Выберите строку дочернего класса, чтобы разорвать связь с родителем.'"),,,, Отказ);
	ИначеЕсли ТекСтрока.СтатусНаследования = 1 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Выбранная строка не является наследником.'"),,,, Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("РазорватьСвязьЗавершение", ЭтаФорма, ТекСтрока.Строка);
	ПоказатьВопрос(ОписаниеОповещения, 
		НСтр("ru='Разорвать связь выбранной строки с родителем?'"), РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СделатьНаследникомЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		СделатьНаследникомНаСервере(ДополнительныеПараметры.Строка, ДополнительныеПараметры.Родитель);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РазорватьСвязьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		РазорватьСвязьНаСервере(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЭлементУправленияВидимостьюСтроки()
	
	ЭлементУправленияВидимостьюСтроки = Неопределено;
	Для Каждого ЭлементУсловногоОформления ИЗ ЭтаФорма.УсловноеОформление.Элементы Цикл
		Если ЭлементУсловногоОформления.Представление = "Не отображать данные строки" Тогда
			ЭлементУправленияВидимостьюСтроки = ЭлементУсловногоОформления;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЭлементУправленияВидимостьюСтроки;
	
КонецФункции

&НаСервере
Процедура УдалитьКолонкиАтрибутовТабличнойЧасти()
	
	ЭлементУправленияВидимостьюСтроки = ПолучитьЭлементУправленияВидимостьюСтроки();
	
	МассивУдаляемых = Новый Массив;
	КолВо = КолонкиАтрибутовТабличнойЧасти.Количество();
	Для Н = 1 По КолВо Цикл
		СтрокаКолонка = КолонкиАтрибутовТабличнойЧасти[КолВо - Н];
		Если НЕ ПустаяСтрока(СтрокаКолонка.ИмяКолонки) Тогда
			МассивУдаляемых.Добавить("Объект.СтрокиДляНастройки." + СтрокаКолонка.ИмяКолонки);
			Элементы.Удалить(Элементы[СтрокаКолонка.ИмяПоля]);
			Если НЕ ЭлементУправленияВидимостьюСтроки = Неопределено Тогда
				ПолеДляПроверки = Новый ПолеКомпоновкиДанных(СтрокаКолонка.ИмяПоля);
				КолВоЭлемОформления = ЭлементУправленияВидимостьюСтроки.Поля.Элементы.Количество();
				Для М = 1 По КолВоЭлемОформления Цикл
					ПолеОформления = ЭлементУправленияВидимостьюСтроки.Поля.Элементы[КолВоЭлемОформления - М];
					Если ПолеОформления.Поле = ПолеДляПроверки Тогда
						ЭлементУправленияВидимостьюСтроки.Поля.Элементы.Удалить(ПолеОформления);
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		КолонкиАтрибутовТабличнойЧасти.Удалить(СтрокаКолонка);
	КонецЦикла;
	
	ИзменитьРеквизиты(, МассивУдаляемых);
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьКолонкиАтрибутовТабличнойЧасти(ТаблицаАтрибутов)
	
	КолонкиТаблицы = ТаблицаАтрибутов.Колонки;
	ЕстьСтатусНаследования  = НЕ (КолонкиТаблицы.Найти("СтатусНаследования") = Неопределено);
	
	ТипСтрока = Тип("Строка");
	
	Н = 1;
	МассивДобавляемых = Новый Массив;
	Для Каждого СтрокаКолонки ИЗ ТаблицаАтрибутов Цикл
		ЭтоНенаследуемый = ЕстьСтатусНаследования И СтрокаКолонки.СтатусНаследования > 3;
		ЭтоСтрока = СтрокаКолонки.ТипЗначения.СодержитТип(ТипСтрока);
		Если ЭтоНенаследуемый ИЛИ НЕ ЭтоСтрока И СтрокаКолонки.МножественноеЗначение Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаКолонки.ИмяКолонки) Тогда
			ИмяРеквизита = "Атрибут" + Н;
			НовыйРеквизит = Новый РеквизитФормы(
				ИмяРеквизита, СтрокаКолонки.ТипЗначения, "Объект.СтрокиДляНастройки", Строка(СтрокаКолонки.АтрибутКласса));
			МассивДобавляемых.Добавить(НовыйРеквизит);
			СтрокаКолонки.ИмяКолонки = ИмяРеквизита;
		Иначе
			ИмяРеквизита = СтрокаКолонки.ИмяКолонки;
		КонецЕсли;
		
		СтрокаТЧ = КолонкиАтрибутовТабличнойЧасти.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаКолонки);
		СтрокаТЧ.ИмяПоля = "СтрокиДляНастройки" + ИмяРеквизита;
		
		Н = Н + 1;
	КонецЦикла;
	
	ИзменитьРеквизиты(МассивДобавляемых);
	
	ЭлементУправленияВидимостьюСтроки = ПолучитьЭлементУправленияВидимостьюСтроки();
	
	Для Каждого СтрокаКолонки ИЗ ТаблицаАтрибутов Цикл
		Если ПустаяСтрока(СтрокаКолонки.ИмяКолонки) Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяПоля = "СтрокиДляНастройки" + СтрокаКолонки.ИмяКолонки;
		
		Найдено = Элементы.Найти(ИмяПоля);
		Если Не Найдено = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйЭлемент = Элементы.Добавить(ИмяПоля, Тип("ПолеФормы"), Элементы.СтрокиДляНастройкиГруппаАтрибутыСтроки);
		НовыйЭлемент.Вид         = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.СтрокиДляНастройки." + СтрокаКолонки.ИмяКолонки;
		НовыйЭлемент.Заголовок   = Строка(СтрокаКолонки.АтрибутКласса);
		НовыйЭлемент.Видимость   = Истина;
		НовыйЭлемент.Ширина      = 14;
		
		НовыйЭлемент.ТолькоПросмотр = Истина;
		
		Если СтрокаКолонки.РежимЗаполнения = Перечисления.РежимыЗаполненияАтрибутов.ОбязательныйДляНоменклатуры Тогда
			НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;
		КонецЕсли;
		
		//НовыйЭлемент.УстановитьДействие("НачалоВыбора", "АтрибутПодчиненногоНачалоВыбора");
		
		Если НЕ ЭлементУправленияВидимостьюСтроки = Неопределено Тогда
			ОформляемоеПоле = ЭлементУправленияВидимостьюСтроки.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
			ОформляемоеПоле.Использование = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьКолонкиТабличнойЧасти()
	
	ТекСписокРодителей = Справочники.Классы.ПолучитьТаблицуРодителей(Объект.ИсточникЗначений);
	ТаблицаАтрибутов   = Справочники.Классы.ПолучитьТаблицуАтрибутов(ТекСписокРодителей);
	ТаблицаАтрибутов.Колонки.Добавить("ИмяКолонки", Новый ОписаниеТипов("Строка"));
	
	УдалитьКолонкиАтрибутовТабличнойЧасти();
	ПодготовитьКолонкиАтрибутовТабличнойЧасти(ТаблицаАтрибутов);
	
КонецПроцедуры

&НаСервере
Процедура ВывестиСтрокиДляНастройкиНаследования()
	
	// Список объектов, для которых возможна настройка наследования.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Объект.Класс);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Классы.Ссылка
		|ИЗ
		|	Справочник.Классы КАК Классы
		|ГДЕ
		|	Классы.Ссылка В ИЕРАРХИИ(&Ссылка)
		|	И НЕ Классы.ПометкаУдаления";
	МассивКлассов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	ПараметрСписокРодителей = Справочники.Классы.ПолучитьТаблицуРодителей(МассивКлассов);
	
	//гкс+ [TOIR-1/00000041] Однодворцев И. - оптимизация интерфейса.
	ДанныеТабличнойЧасти = Новый Массив;
	ДанныеТабличнойЧасти.Добавить(Объект.ТабличнаяЧасть);
	//гкс-
	
	Объект.СтрокиДляНастройки.Очистить();
	
	// Чтение строк табличных атрибутов.
	ТаблицаАтрибутов = Справочники.Классы.ПолучитьСтрокиТабличныхАтрибутов(
		ПараметрСписокРодителей, ДанныеТабличнойЧасти);
	
	Если ТаблицаАтрибутов.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	ТаблицаАтрибутов.Колонки.Добавить("ИДСтроки");
	
	СоответствиеИДСтрокВложенных = Новый Соответствие;
	СтрокиТаблицы = Новый Массив;
	
	НовыйИДСтроки = 1;
	
	ПредКласс = Неопределено;
	
	Для Каждого СтрокаТЗ ИЗ ТаблицаАтрибутов Цикл
		
		Если НЕ ПредКласс = СтрокаТЗ.КлассДляЧтения Тогда
			СтрокаТЧ = Объект.СтрокиДляНастройки.Добавить();
			СтрокаТЧ.Класс = СтрокаТЗ.КлассДляЧтения;
			
			ПредКласс = СтрокаТЗ.КлассДляЧтения;
		КонецЕсли;
		
		ЗначениеПоиска = ?(ЗначениеЗаполнено(СтрокаТЗ.ЗначениеАтрибутаКласса), 
			СтрокаТЗ.ЗначениеАтрибутаКласса, СтрокаТЗ.ИсточникЗначений);
		
		// Формируем соответствие для быстрого добавления элементов следующего уровня вложенности.
		МассивСтрок = СоответствиеИДСтрокВложенных[ЗначениеПоиска];
		Если МассивСтрок = Неопределено Тогда
			МассивСтрок = Новый Массив;
			СоответствиеИДСтрокВложенных.Вставить(ЗначениеПоиска, МассивСтрок);
			СтрокиТаблицы.Добавить(ЗначениеПоиска);
		КонецЕсли;
		
		СтрокаТЗ.ИДСтроки = НовыйИДСтроки;
		
		СтрокаТЧ = Объект.СтрокиДляНастройки.Добавить();
		СтрокаТЧ.Класс              = СтрокаТЗ.КлассДляЧтения;
		СтрокаТЧ.Строка             = ЗначениеПоиска;
		СтрокаТЧ.СтатусНаследования = СтрокаТЗ.СтатусНаследования;
		СтрокаТЧ.ИсточникЗначений   = СтрокаТЗ.ИсточникЗначений;
		
		МассивСтрок.Добавить(СтрокаТЧ);
		
		НовыйИДСтроки = НовыйИДСтроки + 1;
		
	КонецЦикла;
	
	// Чтение значений атрибутов строк.
	
	// Таблица родителей для чтения атрибутов строк.
	ТаблицаРодителей = Справочники.Классы.ПолучитьТаблицуРодителей(СтрокиТаблицы);
	
	СтруктураПоискаРодителя = Новый Структура("КлассДляЧтения, Класс");
	СтруктураПоискаКолонок = Новый Структура("АтрибутКласса");
	
	// Вывод значений атрибутов строк.
	ЗначенияАтрибутов = Справочники.Классы.ПолучитьТаблицуАтрибутов(ТаблицаРодителей);
	Для Каждого СтрокаЗначений ИЗ ЗначенияАтрибутов Цикл
		
		МассивСтрок = СоответствиеИДСтрокВложенных[СтрокаЗначений.КлассДляЧтения];
		Если МассивСтрок = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		// Подмена объекта назначения в иерархии наследования.
		Если СтрокаЗначений.АтрибутКласса = ПланыВидовХарактеристик.АтрибутыКласса.ОбъектОперации 
				И ЗначениеЗаполнено(СтрокаЗначений.ЗначениеАтрибутаКласса) Тогда
			//
			СтруктураПоискаРодителя.Класс          = СтрокаЗначений.ЗначениеАтрибутаКласса;
			СтруктураПоискаРодителя.КлассДляЧтения = СтрокаЗначений.КлассДляЧтения;
			Найдено = ПараметрСписокРодителей.НайтиСтроки(СтруктураПоискаРодителя);
			Если Найдено.Количество() > 0 Тогда
				СтрокаЗначений.ЗначениеАтрибутаКласса = СтрокаЗначений.КлассДляЧтения;
			КонецЕсли;
			
		КонецЕсли;
		
		СтруктураПоискаКолонок.АтрибутКласса = СтрокаЗначений.АтрибутКласса;
		НайденоСтрокаАтрибута = КолонкиАтрибутовТабличнойЧасти.НайтиСтроки(СтруктураПоискаКолонок);
		
		// Добавление значений атрибутов строк в данные обработки.
		Если НайденоСтрокаАтрибута.Количество() > 0 Тогда
			ДанныеКолонкиАтрибута = НайденоСтрокаАтрибута[0];
			Для Каждого СтрокаТаб ИЗ МассивСтрок Цикл
				СтрокаТаб[ДанныеКолонкиАтрибута.ИмяКолонки] = СтрокаЗначений.ЗначениеАтрибутаКласса;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СделатьНаследникомНаСервере(Строка, Родитель)
	
	СтрокаОбъект = Строка.ПолучитьОбъект();
	СтрокаОбъект.Родитель = Родитель;
	СтрокаОбъект.Записать();
	
	// Обновление таблицы.
	ВывестиСтрокиДляНастройкиНаследования();
	
	// Отметка родителя.
	НайденоСтроки = Объект.СтрокиДляНастройки.НайтиСтроки(Новый Структура("Строка", Родитель));
	Если НайденоСтроки.Количество() > 0 Тогда
		НайденоСтроки[0].Выбрано = Истина;
		
		СтрокиДляОтметки = Новый Массив;
		СтрокиДляОтметки.Добавить(НайденоСтроки[0].Строка);
		
		СтрокиВложеные = Новый Массив;
		
		СтруктураПоискаПодчиненных = Новый Структура("ИсточникЗначений");
		
		Пока СтрокиДляОтметки.Количество() > 0 Цикл 
			
			Для Каждого СтрокаДляОтметки ИЗ СтрокиДляОтметки Цикл
				СтруктураПоискаПодчиненных.ИсточникЗначений = СтрокаДляОтметки;
				НайденоПодчиненные = Объект.СтрокиДляНастройки.НайтиСтроки(СтруктураПоискаПодчиненных);
				Для Каждого СтрокаВложенных ИЗ НайденоПодчиненные Цикл
					СтрокиВложеные.Добавить(СтрокаВложенных.Строка);
					СтрокаВложенных.Выбрано = Истина;
				КонецЦикла;
			КонецЦикла;
			
			ВремХранилище = СтрокиДляОтметки;
			СтрокиДляОтметки = СтрокиВложеные;
			СтрокиВложеные = ВремХранилище;
			СтрокиВложеные.Очистить();
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Выделение строки-наследника.
	НайденоСтроки = Объект.СтрокиДляНастройки.НайтиСтроки(Новый Структура("Строка", Строка));
	Если НайденоСтроки.Количество() > 0 Тогда
		Элементы.СтрокиДляНастройки.ТекущаяСтрока = НайденоСтроки[0].ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РазорватьСвязьНаСервере(Строка)
	
	СтрокаОбъект = Строка.ПолучитьОбъект();
	СтрокаОбъект.Родитель = Объект.ИсточникЗначений;
	СтрокаОбъект.Записать();
	
	// Обновление таблицы.
	ВывестиСтрокиДляНастройкиНаследования();
	
	// Выделение строки.
	НайденоСтроки = Объект.СтрокиДляНастройки.НайтиСтроки(Новый Структура("Строка", Строка));
	Если НайденоСтроки.Количество() > 0 Тогда
		Элементы.СтрокиДляНастройки.ТекущаяСтрока = НайденоСтроки[0].ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
