////////////////////////////////////////////////////////////////////////////////
// гкс_ИнтеграцияXDTOАдаптерОбъекты
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Гкс+[CPM30-1561] Селимов от 13.08.2020. Добавлено:{
Функция ПолучитьСтруктуруДанныхASObject(Ссылка, ОбъектXDTO)
	
	ОбъектXDTO.objectId = гкс_ИнтеграцияXDTOАдаптер.ПолучитьObjectIDпоСсылке(Ссылка);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Name",         "Представление");
	СтруктураДанных.Вставить("DeletionMark", "ПометкаУдаления");
	СтруктураДанных.Вставить("DataVersion",  "ВерсияДанных");
	
	ExternalObject = гкс_ИнтеграцияXDTOАдаптер.ПолучитьВнешнийОбъект(Ссылка);
	Если ExternalObject <> Неопределено Тогда
		ОбъектXDTO.ExternalObject = ExternalObject;
	КонецЕсли;
	
	Возврат СтруктураДанных;
	
КонецФункции // } Гкс-[CPM30-1561]

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти
