#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры.ЗначенияЗаполнения) = Тип("Структура") Тогда 
		ЗаполнитьЗначенияСвойств (Объект, Параметры.ЗначенияЗаполнения);
		Если Параметры.ЗначенияЗаполнения.Свойство("ДефектПричина")Тогда 
			Объект.ПричиныВозникновенияДефекта.Очистить();  
			Если ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения.ДефектПричина) Тогда 
				Объект.ПричиныВозникновенияДефекта.Добавить().Причина = Параметры.ЗначенияЗаполнения.ДефектПричина;
			КонецЕсли;
		КонецЕсли;
		
		Если ТипЗнч (Параметры.Ключ) = Тип ("СправочникСсылка.торо_ТиповыеДефектыОборудования") И Параметры.ЗначенияЗаполнения.Количество()>0 Тогда 
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ВладелецФормы <> Неопределено Тогда
		СтруктураОповещения = ПолучитьСтруктуруОповещения();
		ЗакрыватьПриВыборе = Ложь;
		ОповеститьОВыборе(СтруктураОповещения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПолучитьСтруктуруОповещения()
	Результат = Новый Структура;
	Результат.Вставить("Дефект", Объект.Ссылка);
	Результат.Вставить("ВидДефекта", Объект.ВидДефекта);
	Результат.Вставить("КритичностьДефекта", Объект.КритичностьДефекта);
	Результат.Вставить("ПричинаДефекта", ?(Объект.ПричиныВозникновенияДефекта.Количество() = 0, Неопределено, Объект.ПричиныВозникновенияДефекта[0].Причина));
	Результат.Вставить("ДефектОписание", Объект.ОписаниеДефекта);
	Результат.Вставить("ПоследствияДефекта", Объект.ПоследствиеДефекта);
	Результат.Вставить("НаправлениеНаУстранение", Объект.НаправлениеНаУстранение);
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)	
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
КонецПроцедуры

#КонецОбласти



