
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура УстановитьОсновной(Команда)
	Если Элементы.Список.ТекущаяСтрока <> Неопределено Тогда 
		СтруктураПараметров = Новый Структура("Организация", Элементы.Список.ТекущаяСтрока);
		ОповещениеОЗакрытии = Новый ОписаниеОповещения ("УстановитьОсновнойЗавершение", ЭтотОбъект, СтруктураПараметров);
		ОткрытьФорму("ОбщаяФорма.торо_ФормаВыбораСотрудников",,ЭтаФорма,,,,ОповещениеОЗакрытии,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура УстановитьОсновнойЗавершение(Результат, ДополнительныеПараметры)
	Если Результат <> Неопределено Тогда 
		Для каждого Пользователь Из Результат Цикл 
			ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Пользователь.ИдентификаторПользователяИБ);
			ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
			    "НастройкиТОиР",
			    "ОсновнаяОрганизация",
			    ДополнительныеПараметры.Организация,,
			    ПользовательИБ.Имя);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры


#КонецОбласти


