#Область ОбработчикиСобытийФормы

&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура гкс_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	СписокСтатусов.ЗагрузитьЗначения(Параметры.СписокСледующихСтатусов.ВыгрузитьЗначения());
	ВыделенныйСтатус = Параметры.ВыделенныйСтатус;
	#Вставка
	МассРеквизитов = Новый Массив();
	МассРеквизитов.Добавить(Новый РеквизитФормы("гкс_ТабСвойствстатусов",
		Новый ОписаниеТипов("ТаблицаЗначений")));
	МассРеквизитов.Добавить(Новый РеквизитФормы("гкс_ТребуетсяКомментарий",
		Новый ОписаниеТипов("Булево"), "гкс_ТабСвойствстатусов"));
	МассРеквизитов.Добавить(Новый РеквизитФормы("Статус",
		Новый ОписаниеТипов("СправочникСсылка.торо_СтатусыСогласованияДокументовРемонтныхРабот"), "гкс_ТабСвойствстатусов"));
	ИзменитьРеквизиты(МассРеквизитов);
	Если Параметры.Свойство("СтатусыСКомментарием") Тогда 
		Для Каждого СтрокаМассива Из Параметры.СтатусыСКомментарием Цикл
			НоваяСтрока = ЭтотОбъект["гкс_ТабСвойствстатусов"].Добавить();
			НоваяСтрока.Статус = СтрокаМассива;
			НоваяСтрока.гкс_ТребуетсяКомментарий = Истина;
		КонецЦикла;
	КонецЕсли;
	#КонецВставки

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
&ИзменениеИКонтроль("ОК")
Процедура гкс_ОК(Команда)

	ВыбранныйСтатус = Неопределено;
	Если СписокСтатусов.Количество() = 1 Тогда
		ВыбранныйСтатус = СписокСтатусов[0].Значение;
	Иначе
		ТекущиеДанные = Элементы.СписокСтатусов.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			ВыбранныйСтатус = ТекущиеДанные.Значение;
		КонецЕсли;
	КонецЕсли;

	Если ВыбранныйСтатус = Неопределено Тогда
		ТекстСообщения = НСтр("es='el estatus!';ru='Не выбран статус!';en='No status selected!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	#Вставка
	Если Не ЗначениеЗаполнено(Комментарий) Тогда 
		Для Каждого СтрокаТаблицы Из ЭтотОбъект["гкс_ТабСвойствстатусов"] Цикл
			Если СтрокаТаблицы.Статус = ВыбранныйСтатус Тогда 
				Если СтрокаТаблицы.гкс_ТребуетсяКомментарий Тогда
					ТекстСообщения = НСтр("es='comment is empty!';ru='Комментарий не указан!';en='comment is empty!'");
					ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Комментарий");
					Возврат;
				КонецЕсли;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	#КонецВставки

	Закрыть(Новый Структура("ВыбранныйСтатус, Комментарий", ВыбранныйСтатус, Комментарий));

КонецПроцедуры

#КонецОбласти

