#Область СлужебныеПроцедурыИФункции

&ИзменениеИКонтроль("ОбновитьНаработку")
Функция Расш_гкс_ОбновитьНаработку(ОбъектРемонта, ТиповойОР)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ПараметрыНаработкиОбъектовРемонта.ОбъектРемонта,
	|	торо_ПараметрыНаработкиОбъектовРемонта.Показатель,
	|	торо_ПараметрыНаработкиОбъектовРемонта.Период,
	|	0 КАК Приоритет,
	|	торо_ПараметрыНаработкиОбъектовРемонта.ПлановаяНаработка,
	|	торо_ПараметрыНаработкиОбъектовРемонта.ПериодПлановойНаработки,
	|	торо_ПараметрыНаработкиОбъектовРемонта.ПродолжительностьПериодаПлановойНаработки,
	|	торо_ПараметрыНаработкиОбъектовРемонта.КоэффициентИспользованияОборудования,
	|	торо_ПараметрыНаработкиОбъектовРемонта.Основной
	|ПОМЕСТИТЬ ПоказателиОР
	|ИЗ
	|	РегистрСведений.торо_ПараметрыНаработкиОбъектовРемонта КАК торо_ПараметрыНаработкиОбъектовРемонта
	|ГДЕ
	|	торо_ПараметрыНаработкиОбъектовРемонта.ОбъектРемонта = &ОбъектРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРодителей.Приоритет,
	|	ТаблицаРодителей.Родитель
	|ПОМЕСТИТЬ ТаблицаРодителей
	|ИЗ
	|	&ТаблицаРодителей КАК ТаблицаРодителей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	торо_ПараметрыНаработкиОбъектовРемонта.ОбъектРемонта,
	|	торо_ПараметрыНаработкиОбъектовРемонта.Показатель,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК Период,
	|	ТаблицаРодителей.Приоритет
	|ПОМЕСТИТЬ ПоказателиГрупп
	|ИЗ
	|	РегистрСведений.торо_ПараметрыНаработкиОбъектовРемонта.СрезПоследних(
	|			,
	|			ОбъектРемонта В
	|					(ВЫБРАТЬ
	|						ТаблицаРодителей.Родитель
	|					ИЗ
	|						ТаблицаРодителей КАК ТаблицаРодителей)
	|				И НЕ Показатель В
	|						(ВЫБРАТЬ
	|							ПоказателиОР.Показатель
	|						ИЗ
	|							ПоказателиОР КАК ПоказателиОР)) КАК торо_ПараметрыНаработкиОбъектовРемонта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаРодителей КАК ТаблицаРодителей
	|		ПО торо_ПараметрыНаработкиОбъектовРемонта.ОбъектРемонта = ТаблицаРодителей.Родитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоказателиГрупп.ОбъектРемонта,
	|	ПоказателиГрупп.Показатель,
	|	ПоказателиГрупп.Период,
	|	ПоказателиГрупп.Приоритет
	|ПОМЕСТИТЬ ПоказателиГруппУникальные
	|ИЗ
	|	ПоказателиГрупп КАК ПоказателиГрупп
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПоказателиГрупп.Показатель КАК Показатель,
	|			МИНИМУМ(ПоказателиГрупп.Приоритет) КАК Приоритет
	|		ИЗ
	|			ПоказателиГрупп КАК ПоказателиГрупп
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ПоказателиГрупп.Показатель) КАК ВложенныйЗапрос
	|		ПО ПоказателиГрупп.Показатель = ВложенныйЗапрос.Показатель
	|			И ПоказателиГрупп.Приоритет = ВложенныйЗапрос.Приоритет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_СрокиГарантииОбъектовРемонта.УсловияГарантии.ПоказательНаработки КАК ПоказательНаработки,
	|	МАКСИМУМ(торо_СрокиГарантииОбъектовРемонта.УсловияГарантии.ЗначениеНаработки) КАК ЗначениеНаработки
	|ПОМЕСТИТЬ ГарантийныеРесурсы
	|ИЗ
	|	РегистрСведений.торо_СрокиГарантииОбъектовРемонта КАК торо_СрокиГарантииОбъектовРемонта
	|ГДЕ
	|	торо_СрокиГарантииОбъектовРемонта.ОбъектРемонта = &ОбъектРемонта
	|	И торо_СрокиГарантииОбъектовРемонта.УсловияГарантии.ПроверятьНаработку
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_СрокиГарантииОбъектовРемонта.УсловияГарантии.ПоказательНаработки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПоказательНаработки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоказателиОР.ОбъектРемонта,
	|	ПоказателиОР.Показатель,
	|	ПоказателиОР.Период,
	|	ПоказателиОР.Приоритет КАК Приоритет,
	|	ПоказателиОР.ПлановаяНаработка,
	|	ПоказателиОР.ПериодПлановойНаработки,
	|	ПоказателиОР.ПродолжительностьПериодаПлановойНаработки,
	|	ПоказателиОР.КоэффициентИспользованияОборудования,
	|	ЕСТЬNULL(ГарантийныеРесурсы.ЗначениеНаработки, 0) КАК РесурсГарантии,
	|	ПоказателиОР.Основной
	#Вставка
	|	,гкс_ТегиНаработки.Тег КАК гкс_Тег
	#КонецВставки
	|ИЗ
	|	ПоказателиОР КАК ПоказателиОР
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГарантийныеРесурсы КАК ГарантийныеРесурсы
	|		ПО ПоказателиОР.Показатель = ГарантийныеРесурсы.ПоказательНаработки
	#Вставка
	|		Левое Соединение РегистрСведений.гкс_ТегиНаработки КАК гкс_ТегиНаработки
	|		ПО гкс_ТегиНаработки.ОР = ПоказателиОР.ОбъектРемонта И гкс_ТегиНаработки.ПараметрНаработки = ПоказателиОР.Показатель
	#КонецВставки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоказателиГруппУникальные.ОбъектРемонта,
	|	ПоказателиГруппУникальные.Показатель,
	|	ПоказателиГруппУникальные.Период,
	|	ПоказателиГруппУникальные.Приоритет,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	0,
	|	ЕСТЬNULL(ГарантийныеРесурсы.ЗначениеНаработки, 0),
	|	ЛОЖЬ
	#Вставка
	|	,гкс_ТегиНаработки.Тег КАК гкс_Тег
	#КонецВставки
	|ИЗ
	|	ПоказателиГруппУникальные КАК ПоказателиГруппУникальные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГарантийныеРесурсы КАК ГарантийныеРесурсы
	|		ПО ПоказателиГруппУникальные.Показатель = ГарантийныеРесурсы.ПоказательНаработки
	#Вставка
	|		Левое Соединение РегистрСведений.гкс_ТегиНаработки КАК гкс_ТегиНаработки
	|		ПО гкс_ТегиНаработки.ОР = ПоказателиГруппУникальные.ОбъектРемонта И гкс_ТегиНаработки.ПараметрНаработки = ПоказателиГруппУникальные.Показатель
	#КонецВставки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";

	Запрос.УстановитьПараметр("ОбъектРемонта", ОбъектРемонта);

	СписокРодителей = ПолучитьСписокРодителейТиповогоОбъекта(ТиповойОР);
	Если ЗначениеЗаполнено(ТиповойОР) Тогда
		СписокРодителей.Вставить(0, ТиповойОР);
	КонецЕсли;

	ТаблицаРодителей = Новый ТаблицаЗначений;
	ТаблицаРодителей.Колонки.Добавить("Приоритет", Новый ОписаниеТипов("Число"));
	ТаблицаРодителей.Колонки.Добавить("Родитель", Новый ОписаниеТипов("СправочникСсылка.торо_ТиповыеОР"));
	СчетчикЦикла = СписокРодителей.Количество() - 1;

	Пока СчетчикЦикла >= 0 Цикл
		НоваяСтрокаТабл = ТаблицаРодителей.Добавить();
		НоваяСтрокаТабл.Родитель = СписокРодителей[СчетчикЦикла].Значение;
		НоваяСтрокаТабл.Приоритет = СчетчикЦикла + 1;
		СчетчикЦикла = СчетчикЦикла - 1;
	КонецЦикла;

	Запрос.УстановитьПараметр("ТаблицаРодителей", ТаблицаРодителей);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	СтруктураВозврата = Новый Массив;
	Пока Выборка.Следующий() Цикл

		#Удаление
		СтруктураВозврата.Добавить(Новый Структура("ОбъектРемонта, Показатель, Период, ПлановаяНаработка, ПериодПлановойНаработки, ПродолжительностьПериодаПлановойНаработки, КоэффициентИспользованияОборудования, РесурсГарантии, Основной",
		Выборка.ОбъектРемонта, Выборка.Показатель, Выборка.Период, Выборка.ПлановаяНаработка, Выборка.ПериодПлановойНаработки, Выборка.ПродолжительностьПериодаПлановойНаработки, Выборка.КоэффициентИспользованияОборудования, Выборка.РесурсГарантии, Выборка.Основной));
		#КонецУдаления
		#Вставка
		ТемпСтрукт = Новый Структура("ОбъектРемонта, Показатель, Период, ПлановаяНаработка, ПериодПлановойНаработки, "
			+"ПродолжительностьПериодаПлановойНаработки, КоэффициентИспользованияОборудования, РесурсГарантии, Основной",
			Выборка.ОбъектРемонта, Выборка.Показатель, Выборка.Период, Выборка.ПлановаяНаработка,
			Выборка.ПериодПлановойНаработки, Выборка.ПродолжительностьПериодаПлановойНаработки,
			Выборка.КоэффициентИспользованияОборудования, Выборка.РесурсГарантии, Выборка.Основной);
		ТемпСтрукт.Вставить("гкс_Тег",Выборка.гкс_Тег);
		СтруктураВозврата.Добавить(ТемпСтрукт);
		#КонецВставки

	КонецЦикла;

	Возврат СтруктураВозврата;

КонецФункции

&ИзменениеИКонтроль("РаспространитьНаработкуНаПодчиненныхДляТекСтроки")
Процедура Расш_гкс_РаспространитьНаработкуНаПодчиненныхДляТекСтроки(ТекСтрокаНаработкаОбъектов, ТабЗначенийНаработкиПодчиненных, ТаблицаПодчиненныхОР, Объект)

	ТаблицаИнтервалов = Новый ТаблицаЗначений;
	ТаблицаИнтервалов.Колонки.Добавить("ОбъектРемонта", Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта"));
	ТаблицаИнтервалов.Колонки.Добавить("ПлановыйГрафикРаботы", Новый ОписаниеТипов("СправочникСсылка.Календари"));
	ТаблицаИнтервалов.Колонки.Добавить("ДатаНачала", Новый ОписаниеТипов("Дата"));
	ТаблицаИнтервалов.Колонки.Добавить("ДатаОкончания", Новый ОписаниеТипов("Дата"));
	ТаблицаИнтервалов.Колонки.Добавить("Показатель", Новый ОписаниеТипов("СправочникСсылка.ПараметрыВыработкиОС"));

	НСТаблицаИнтервалов = ТаблицаИнтервалов.Вставить(0);
	НСТаблицаИнтервалов.ОбъектРемонта = ТекСтрокаНаработкаОбъектов.Объект;
	НСТаблицаИнтервалов.ПлановыйГрафикРаботы = ПолучитьЗначениеПлановогоГрафикаРаботОбъектаРемонта(ТекСтрокаНаработкаОбъектов.Объект);
	НСТаблицаИнтервалов.ДатаНачала = ТекСтрокаНаработкаОбъектов.ДатаРаботыС;
	НСТаблицаИнтервалов.ДатаОкончания = ТекСтрокаНаработкаОбъектов.ДатаРаботыПо;
	НСТаблицаИнтервалов.Показатель = ТекСтрокаНаработкаОбъектов.Показатель;

	ТабВозврата = торо_РаботаСНаработкой.РасчитатьВремяРаботыОР(ТаблицаИнтервалов.Скопировать(), ПредопределенноеЗначение("Перечисление.Периодичность.День"));

	ВремяРаботыГоловногоОбъекта = ТабВозврата.НайтиСтроки(Новый Структура("ОбъектРемонта,ДатаНачала",
	ТекСтрокаНаработкаОбъектов.Объект,ТекСтрокаНаработкаОбъектов.ДатаРаботыС))[0].Секунды;

	ТаблицаИнтервалов.Очистить();			

	Для Каждого ОР ИЗ ТаблицаПодчиненныхОР Цикл
		НСТаблицаИнтервалов = ТаблицаИнтервалов.Добавить();
		НСТаблицаИнтервалов.ОбъектРемонта = ТекСтрокаНаработкаОбъектов.Объект;
		НСТаблицаИнтервалов.ПлановыйГрафикРаботы = ТекСтрокаНаработкаОбъектов.Объект.ПлановыйГрафикРаботы;
		ДатаВвода = ОР.ОбъектИерархии.ДатаВводаВЭксплуатацию;
		НСТаблицаИнтервалов.ДатаНачала = ?(ДатаВвода > ОР.ДатаНачала,ДатаВвода,ОР.ДатаНачала);
		НСТаблицаИнтервалов.ДатаОкончания = ОР.ДатаОкончания;
		НСТаблицаИнтервалов.Показатель = ТекСтрокаНаработкаОбъектов.Показатель;
	КонецЦикла;

	ТабДляРассчетаВремениРаботы = ТаблицаИнтервалов.Скопировать();
	ТабДляРассчетаВремениРаботы.Свернуть("ОбъектРемонта,ПлановыйГрафикРаботы,ДатаНачала,ДатаОкончания,Показатель",);

	ТаблицаСВременемРаботы = торо_РаботаСНаработкой.РасчитатьВремяРаботыОР(ТабДляРассчетаВремениРаботы, ПредопределенноеЗначение("Перечисление.Периодичность.День"));

	ТабПодчиненныхССумНаработкой = ТаблицаПодчиненныхОР.Скопировать();
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Число"));   
	ОписаниеТиповЧисло = Новый ОписаниеТипов(МассивТипов);
	ТабПодчиненныхССумНаработкой.Колонки.Добавить("СуммНаработка",ОписаниеТиповЧисло);
	Для Каждого СтрокаСЗависимымОР ИЗ ТабПодчиненныхССумНаработкой Цикл

		ДатаВвода = СтрокаСЗависимымОР.ОбъектИерархии.ДатаВводаВЭксплуатацию;
		пДатаНачала = ?(ДатаВвода > СтрокаСЗависимымОР.ДатаНачала, ДатаВвода, СтрокаСЗависимымОР.ДатаНачала);

		Если ВремяРаботыГоловногоОбъекта = 0 Тогда
			Если ТаблицаСВременемРаботы.НайтиСтроки(Новый Структура("ДатаНачала,ДатаОкончания",пДатаНачала, СтрокаСЗависимымОР.ДатаОкончания))[0].Секунды = 0 Тогда
				КоэфПропорциональностиНаработки = СтрокаСЗависимымОР.Коэффициент;
			Иначе
				#Удаление
				ШаблонСообщения = НСтр("ru = 'Проверьте заполненность графика работы %1 на %2 год.'");
				#КонецУдаления
				#Вставка
				ШаблонСообщения = НСтр("es='Comprueben заполненность del gráfico del trabajo %1 para %2 año.';ru='Проверьте "
				+"заполненность графика работы %1 на %2 год.';en='Check the full schedule for%1 for%2 year.'");
				#КонецВставки
				ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекСтрокаНаработкаОбъектов.Объект.ПлановыйГрафикРаботы, Формат(ТекСтрокаНаработкаОбъектов.ДатаРаботыС, "ДФ=гггг"));
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				ТекСтрокаНаработкаОбъектов.РаспространятьНаПодчиненных = Ложь;
				Возврат;
			КонецЕсли;
		Иначе
			КоэфПропорциональностиНаработки = ТаблицаСВременемРаботы.НайтиСтроки(Новый Структура("ДатаНачала,ДатаОкончания",
			пДатаНачала, СтрокаСЗависимымОР.ДатаОкончания))[0].Секунды / ВремяРаботыГоловногоОбъекта;
		КонецЕсли;
		СтрокаСЗависимымОР.СуммНаработка = ТекСтрокаНаработкаОбъектов.Наработка * КоэфПропорциональностиНаработки * СтрокаСЗависимымОР.Коэффициент;
	КонецЦикла;
	ТабПодчиненныхССумНаработкой.Свернуть("ОбъектИерархии","СуммНаработка");
	СтруктураНаработкиПодчСМаксЗнач = ПолучитьАбсолютныеЗначенияНаработки(ТабЗначенийНаработкиПодчиненных);

	Для Каждого СтрокаСЗависимымОР ИЗ СтруктураНаработкиПодчСМаксЗнач Цикл 

		СтрокаПодчНаработка = Объект.НаработкаПодчиненныхОбъектов.Добавить();
		СтрокаПодчНаработка.ДатаРаботыС 	 = ТекСтрокаНаработкаОбъектов.ДатаРаботыС;
		СтрокаПодчНаработка.ДатаРаботыПо 	 = ТекСтрокаНаработкаОбъектов.ДатаРаботыПо;
		СтрокаПодчНаработка.Показатель 		 = ТекСтрокаНаработкаОбъектов.Показатель;
		НаработкаОР = ТабПодчиненныхССумНаработкой.НайтиСтроки(Новый Структура("ОбъектИерархии",СтрокаСЗависимымОР.ОбъектРемонта)); 
		Если НЕ НаработкаОР.Количество() = 0 Тогда
			СтрокаПодчНаработка.Наработка 		 = НаработкаОР[0].СуммНаработка;
		КонецЕсли;

		СтрокаПодчНаработка.Объект 				= СтрокаСЗависимымОР.ОбъектРемонта; 
		СтрокаПодчНаработка.РодительИерархии 	= ТекСтрокаНаработкаОбъектов.Объект;

		СтрокаПодчНаработка.СтароеЗначение 						= СтрокаСЗависимымОР.НаработаноЗначение;
		СтрокаПодчНаработка.НаработкаСНачалаЭксплуатацииНачало 	= СтрокаСЗависимымОР.НаработаноЗначение;
		СтрокаПодчНаработка.НаработкаСНачалаЭксплуатации 		= СтрокаПодчНаработка.НаработкаСНачалаЭксплуатацииНачало + СтрокаПодчНаработка.Наработка;

		Если ЗначениеЗаполнено(СтрокаСЗависимымОР.МаксимальноеЗначение)
			И СтрокаСЗависимымОР.НаработаноЗначение + СтрокаПодчНаработка.Наработка > СтрокаСЗависимымОР.МаксимальноеЗначение Тогда

			КоличествоСбросовСчетчика = Цел((СтрокаСЗависимымОР.НаработаноЗначение + СтрокаПодчНаработка.Наработка) / СтрокаСЗависимымОР.МаксимальноеЗначение);
			СтрокаПодчНаработка.НовоеЗначение = СтрокаСЗависимымОР.НаработаноЗначение + СтрокаПодчНаработка.Наработка - КоличествоСбросовСчетчика * СтрокаСЗависимымОР.МаксимальноеЗначение;

		Иначе
			СтрокаПодчНаработка.НовоеЗначение = СтрокаПодчНаработка.СтароеЗначение + СтрокаПодчНаработка.Наработка;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти