#Область ОписаниеПеременных

&НаКлиенте
Перем СтруктураДанныхДоРедактирования;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	_ХозСпособ = Перечисления.СпособыСтроительства.Хозспособ;
	_СтатусДействует = Перечисления.торо_СтатусыНормативныхРемонтовИТехКарт.Действует;
	_СтатусВРаботе = Перечисления.торо_СтатусыНормативныхРемонтовИТехКарт.ВРазработке;
	дс_СписокОР.Параметры.УстановитьЗначениеПараметра("ТиповойОР",Неопределено);
	дс_СписокОР.Параметры.УстановитьЗначениеПараметра("ОтборВключен",Ложь);
	//
	// СтандартныеПодсистемы.Свойства
	Контекст = Новый Структура();
	Контекст.Вставить("Объект",                     Объект);
	Контекст.Вставить("ИмяЭлементаДляРазмещения",   "ГруппаДополнительныеРеквизиты");
	Контекст.Вставить("ПроизвольныйОбъект",         Ложь);
	Контекст.Вставить("ИмяРеквизитаНаборСвойств",   "НаборСвойствОР");
	Контекст.Вставить("УсловноеОформлениеЗаполнятьОбязательно",   Ложь);
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, Контекст);
	// Конец СтандартныеПодсистемы.Свойства
	Попытка
		Элементы.Переместить(Элементы.ДополнительныеРеквизитыДобавитьИзНабора,Элементы["ГруппаДополнительныеРеквизиты"].ПодчиненныеЭлементы.Свойства_ЗначенияДополнительныхРеквизитов.КоманднаяПанель);
	Исключение
	КонецПопытки;
	//Локализация
	дс_ПриСозданииНаСервере();
	//Локализация
	дс_ТК_Операции.Параметры.УстановитьЗначениеПараметра("Ссылка",Неопределено);
	дс_ТК_МатЗатраты.Параметры.УстановитьЗначениеПараметра("Ссылка",Неопределено);
	дс_ТК_Трудозатраты.Параметры.УстановитьЗначениеПараметра("Ссылка",Неопределено);
	дс_ТК_Инструменты.Параметры.УстановитьЗначениеПараметра("Ссылка",Неопределено);
	// гкс+ [Релиз 1] Куст 20.01.2021
	Если РольДоступна("гкс_ЗапретРедактированиеКлассовТиповыхОР") Тогда 
		Элементы.СписокСоздатьКласс.Видимость = Ложь;
		Элементы.СписокСоздатьПодКласс.Видимость = Ложь;
	КонецЕсли;
	// гкс- [Релиз 1] Куст 20.01.2021
	
	// Гкс+[TOIR20-94] Борисов В.М. от 05.06.2020. Добавлено:{
	гкс_ДобавитьЭлементыФормы();
	// } Гкс-[TOIR20-94] Борисов В.М. от 05.06.2020.
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЗавершениеРаботы = Ложь И дс_МожноЗакрывать = Ложь Тогда 
		Если МодифицированностьИзмеряемыхПоказателей ИЛИ дс_Модифицированность ИЛИ МодифицированностьПараметровОповещенияОСостоянииОР
			ИЛИ МодифицированностьНормРемонтов
			ИЛИ МодифицированностьПредшествующихРемонтов
			ИЛИ МодифицированностьМаксЗначНаработки
			ИЛИ МодифицированностьПараметровНаработки
			ИЛИ МодифицированностьЗамещаемыхРемонтов Тогда 
			Отказ = Истина; СтандартнаяОбработка = Ложь;
			ОписаниеОповещенияПослеВопроса = Новый ОписаниеОповещения("СохранитьПередЗакрытиемПослеВопроса",ЭтотОбъект,Новый Структура("ЗакрытьПослеЗаписи",Истина));
			ПоказатьВопрос(ОписаниеОповещенияПослеВопроса,НСтр("ru='Введенные данные не сохранены. Сохранить?'"),РежимДиалогаВопрос.ДаНет);
			Возврат;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Если дс_НеРеагировать Тогда 
		Возврат;
	КонецЕсли;
	//
	Если МодифицированностьТЧТехКарт Тогда 
		ТекДанные = Элементы.Список.ТекущиеДанные;
		Если Не ТекДанные = Неопределено Тогда 
			Если дс_ДоСсылка = ТекДанные.Ссылка Тогда 
				Возврат;
			КонецЕсли;
		КонецЕсли;
		ОписаниеОповещенияПослеВопроса = Новый ОписаниеОповещения("СохранитьТКПослеВопроса",ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещенияПослеВопроса,НСтр("ru='Шаблоны тех карт не сохранены. Сохранить?';
		|en='Patterns standard maintenance plans is not saved. Save?'"),РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	//
	Если МодифицированностьИзмеряемыхПоказателей ИЛИ дс_Модифицированность ИЛИ МодифицированностьПараметровОповещенияОСостоянииОР
		ИЛИ МодифицированностьНормРемонтов
		ИЛИ МодифицированностьПредшествующихРемонтов
		ИЛИ МодифицированностьМаксЗначНаработки
		ИЛИ МодифицированностьПараметровНаработки
		ИЛИ МодифицированностьЗамещаемыхРемонтов Тогда 
		ТекДанные = Элементы.Список.ТекущиеДанные;
		Если Не ТекДанные = Неопределено Тогда 
			Если дс_ДоСсылка = ТекДанные.Ссылка Тогда 
				Возврат;
			КонецЕсли;
		КонецЕсли;
		ОписаниеОповещенияПослеВопроса = Новый ОписаниеОповещения("НеСохранитьПослеВопроса",ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещенияПослеВопроса,НСтр("ru='Введенные данные не сохранены. Продолжить?';
		|en='The entered data is not saved. Continue?'"),РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	//
	ПодключитьОбработчикОжидания("ЧерезСекунду",0.1,Истина);

КонецПроцедуры

&НаКлиенте
Процедура ЧерезСекунду() Экспорт
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		Если дс_ДоСсылка = ТекДанные.Ссылка Тогда 
			Возврат;
		КонецЕсли;
		//
		дс_Редактирование = Ложь;
		Элементы.Редактировать.Пометка = дс_Редактирование;
		//
		дс_Ссылка = ТекДанные.Ссылка;
		дс_ДоСсылка = ТекДанные.Ссылка;
		дс_Родитель = ТекДанные.Родитель;
		дс_Код = ТекДанные.Код;
		дс_НаборСвойствОР = ТекДанные.НаборСвойствОР;
		дс_Наименование = ТекДанные.Наименование;
		Изготовитель = ТекДанные.Изготовитель;
		гкс_Модель = ТекДанные.гкс_Модель;
		дс_Направление = ТекДанные.Направление;
		дс_ТипОбъекта = ТекДанные.ТипОбъекта;
		дс_Комментарий = ТекДанные.Комментарий;
		дс_ЭтоГруппа = ТекДанные.ЭтоГруппа;
		дс_ФайлКартинки = ТекДанные.ФайлКартинки;
		//
		ОбновитьПоСсылке();
	Иначе
		ОбновитьДоступностьРеквизитов();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МожноРеагировать() Экспорт
	дс_НеРеагировать = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПоСсылке()
		дс_СписокОР.Параметры.УстановитьЗначениеПараметра("ТиповойОР",дс_Ссылка);
		дс_СписокОР.Параметры.УстановитьЗначениеПараметра("ОтборВключен",Истина);		
		ПодчиненныеТК.Параметры.УстановитьЗначениеПараметра("Ссылка",дс_Ссылка);
		
		СтраницыПраваяПриСменеСтраницы(Элементы.СтраницыПравая, Элементы.СтраницыПравая.ТекущаяСтраница);
		
		ПолучитьТаблицыНормативов();
		
		Массив = Новый Массив;
		Массив.Добавить("дс_СписокИзмеряемыхПоказателей");
		Массив.Добавить("ПараметрыОповещенияПоСостояниямОР");
		Массив.Добавить("СписокПараметровНаработки");
		Массив.Добавить("ТабМаксимальныхЗначенийНаработки");
		Массив.Добавить("дс_НормативныеРемонты");
		Массив.Добавить("дс_ПредшествующиеРемонты");
		Массив.Добавить("дс_ЗамещаемыеРемонты");
		торо_СобытияФормКлиент.ЗаполнитьСтруктуруДанныхДоРедактирования(СтруктураДанныхДоРедактирования,Массив);
		
		ОбновитьДоступностьРеквизитов();
		ОбновитьВидимостьРеквизитов();
		
КонецПроцедуры

&НаСервере
Процедура ПолучитьТаблицыНормативов(ТемпСсылка = Неопределено)
	Если ТемпСсылка = Неопределено Тогда 
		ТемпСсылка = дс_Ссылка;
	КонецЕсли;
	Если ЗначениеЗаполнено(ТемпСсылка) = Ложь Тогда 
		Возврат;
	КонецЕсли;
	//	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ТиповыеОРНормативныеРемонты.ВидРемонта КАК ВидРемонта,
		|	торо_ТиповыеОРНормативныеРемонты.НормативныйРемонт КАК НормативныйРемонт,
		|	торо_ТиповыеОРНормативныеРемонты.СпособПланирования КАК СпособПланирования,
		|	торо_ТиповыеОРНормативныеРемонты.Статус КАК Статус,
		|	торо_ТиповыеОРНормативныеРемонты.ГрафикРемонтныхРабот КАК ГрафикРемонтныхРабот,
		|	торо_ТиповыеОРНормативныеРемонты.СпособВыполнения КАК СпособВыполнения,
		|	торо_ТиповыеОРНормативныеРемонты.НеИспользоватьВПланированииДатуВводаВЭксплуатацию КАК НеИспользоватьВПланированииДатуВводаВЭксплуатацию,
		|	торо_ТиповыеОРНормативныеРемонты.СпособУчетаДатыОтсчета КАК СпособУчетаДатыОтсчета,
		|	торо_ТиповыеОРНормативныеРемонты.НеУчаствуетВПланировании КАК НеУчаствуетВПланировании,
		|	торо_ТиповыеОРНормативныеРемонты.РазрешитьСокращатьМежремонтныйПериодПриПланировании КАК РазрешитьСокращатьМежремонтныйПериодПриПланировании,
		|	торо_ТиповыеОРНормативныеРемонты.НеУчитыватьПриПланированииГрафикРемонтныхРабот КАК НеУчитыватьПриПланированииГрафикРемонтныхРабот,
		|	торо_ТиповыеОРНормативныеРемонты.НеУчитыватьПродолжительность КАК НеУчитыватьПродолжительность,
		|	торо_ТиповыеОРНормативныеРемонты.ИспользоватьКоэффициентыРемонтныхОсобенностей КАК ИспользоватьКоэффициентыРемонтныхОсобенностей,
		|	торо_ТиповыеОРНормативныеРемонты.УчитыватьПростоиОборудования КАК УчитыватьПростоиОборудования
		|ИЗ
		|	Справочник.торо_ТиповыеОР.НормативныеРемонты КАК торо_ТиповыеОРНормативныеРемонты
		|ГДЕ
		|	торо_ТиповыеОРНормативныеРемонты.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ТиповыеОРПредшествующиеРемонты.ВидРемонта КАК ВидРемонта,
		|	торо_ТиповыеОРПредшествующиеРемонты.ПредшествующийВидРемонта КАК ПредшествующийВидРемонта
		|ИЗ
		|	Справочник.торо_ТиповыеОР.ПредшествующиеРемонты КАК торо_ТиповыеОРПредшествующиеРемонты
		|ГДЕ
		|	торо_ТиповыеОРПредшествующиеРемонты.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ТиповыеОРЗамещаемыеРемонты.ВидРемонта КАК ВидРемонта,
		|	торо_ТиповыеОРЗамещаемыеРемонты.ЗамещаемыйВидРемонта КАК ЗамещаемыйВидРемонта,
		|	торо_ТиповыеОРЗамещаемыеРемонты.СпособЗамещения КАК СпособЗамещения,
		|	торо_ТиповыеОРЗамещаемыеРемонты.НачальнаяГраница КАК НачальнаяГраница,
		|	торо_ТиповыеОРЗамещаемыеРемонты.КонечнаяГраница КАК КонечнаяГраница
		|ИЗ
		|	Справочник.торо_ТиповыеОР.ЗамещаемыеРемонты КАК торо_ТиповыеОРЗамещаемыеРемонты
		|ГДЕ
		|	торо_ТиповыеОРЗамещаемыеРемонты.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ТиповыеОРгкс_КонструктивныйСостав.Компонент КАК Компонент
		|ИЗ
		|	Справочник.торо_ТиповыеОР.гкс_КонструктивныйСостав КАК торо_ТиповыеОРгкс_КонструктивныйСостав
		|ГДЕ
		|	торо_ТиповыеОРгкс_КонструктивныйСостав.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_ТиповыеОР.Родитель КАК Родитель,
		|	2 КАК Уровень
		|ПОМЕСТИТЬ ВсеРодители
		|ИЗ
		|	Справочник.торо_ТиповыеОР КАК торо_ТиповыеОР
		|ГДЕ
		|	торо_ТиповыеОР.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_ТиповыеОР.Родитель.Родитель,
		|	3
		|ИЗ
		|	Справочник.торо_ТиповыеОР КАК торо_ТиповыеОР
		|ГДЕ
		|	торо_ТиповыеОР.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ТиповыеОРДополнительныеРеквизиты.Свойство КАК Свойство,
		|	торо_ТиповыеОРДополнительныеРеквизиты.Значение КАК Значение,
		|	торо_ТиповыеОРДополнительныеРеквизиты.ТекстоваяСтрока КАК ТекстоваяСтрока,
		|	3 КАК Уровень
		|ПОМЕСТИТЬ СвоиРеквизиты
		|ИЗ
		|	Справочник.торо_ТиповыеОР.ДополнительныеРеквизиты КАК торо_ТиповыеОРДополнительныеРеквизиты
		|ГДЕ
		|	торо_ТиповыеОРДополнительныеРеквизиты.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_ТиповыеОРДополнительныеРеквизиты.Свойство,
		|	торо_ТиповыеОРДополнительныеРеквизиты.Значение,
		|	торо_ТиповыеОРДополнительныеРеквизиты.ТекстоваяСтрока,
		|	ВсеРодители.Уровень
		|ИЗ
		|	ВсеРодители КАК ВсеРодители
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТиповыеОР.ДополнительныеРеквизиты КАК торо_ТиповыеОРДополнительныеРеквизиты
		|		ПО ВсеРодители.Родитель = торо_ТиповыеОРДополнительныеРеквизиты.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СвоиРеквизиты.Свойство КАК Свойство,
		|	МАКСИМУМ(СвоиРеквизиты.Уровень) КАК Уровень
		|ПОМЕСТИТЬ ПриоритетыРеквизитов
		|ИЗ
		|	СвоиРеквизиты КАК СвоиРеквизиты
		|
		|СГРУППИРОВАТЬ ПО
		|	СвоиРеквизиты.Свойство
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СвоиРеквизиты.Свойство КАК Свойство,
		|	СвоиРеквизиты.Значение КАК Значение,
		|	СвоиРеквизиты.ТекстоваяСтрока КАК ТекстоваяСтрока,
		|	СвоиРеквизиты.Уровень = 3 КАК Своя
		|ИЗ
		|	ПриоритетыРеквизитов КАК ПриоритетыРеквизитов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СвоиРеквизиты КАК СвоиРеквизиты
		|		ПО ПриоритетыРеквизитов.Свойство = СвоиРеквизиты.Свойство
		|			И ПриоритетыРеквизитов.Уровень = СвоиРеквизиты.Уровень";
	
	Запрос.УстановитьПараметр("Ссылка", ТемпСсылка);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	дс_НормативныеРемонты.Загрузить(РезультатЗапроса[0].Выгрузить());
	дс_ПредшествующиеРемонты.Загрузить(РезультатЗапроса[1].Выгрузить());
	дс_ЗамещаемыеРемонты.Загрузить(РезультатЗапроса[2].Выгрузить());
	гкс_КонструктивныйСостав.Загрузить(РезультатЗапроса[3].Выгрузить());
	ДополнительныеРеквизиты.Загрузить(РезультатЗапроса[7].Выгрузить());
	
	Если Не дс_ФайлКартинки.Пустая() Тогда
		АдресКартинки = НавигационнаяСсылкаКартинки(дс_ФайлКартинки, УникальныйИдентификатор);
	Иначе
		АдресКартинки = "";
	Конецесли;
	Если ЗначениеЗаполнено(дс_Ссылка) Тогда 
		ЗначениеВДанныеФормы(дс_Ссылка.ПолучитьОбъект(),Объект);
	Иначе
		ТекОб = Справочники.торо_ТиповыеОР.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(ТекОб,Объект);
		ЗначениеВДанныеФормы(ТекОб,Объект);
	КонецЕсли;
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, Объект, "НаборСвойствОР");
	// Конец СтандартныеПодсистемы.Свойства
	// Локализация
	//СтроковыеРеквизиты = "Наименование,Изготовитель,Комментарий,гкс_Модель";
	СтроковыеРеквизиты = "Наименование,Комментарий,гкс_Модель";
	торо_ЛокализацияСобытияФорм.ОбновитьПереводы(ЭтаФорма, СтроковыеРеквизиты);
	// Локализация
	ЗаполнитьТЧТехКарт(ТемпСсылка);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьРеквизитов()
	Если дс_ЭтоГруппа Тогда 
		Если ЗначениеЗаполнено(дс_Родитель) Тогда 
			дс_УровеньОбъекта = 2;
		Иначе
			дс_УровеньОбъекта = 1;
		КонецЕсли;
	Иначе
		дс_УровеньОбъекта = 3;
	КонецЕсли;
	//
	Если дс_УровеньОбъекта = 1 Тогда 
		Элементы.ГруппаСписокОР.Видимость = Ложь;
		Элементы.ГруппаНормативныеРемонты.Видимость = Ложь;
		Элементы.СтраницаИзображение.Видимость = Ложь;
		Элементы.ГруппаКонструкторскийСостав.Видимость = Ложь;
		Элементы.гкс_Модель.Видимость = Ложь;
		Элементы.ГруппаНаправление.Видимость = Ложь;
		Элементы.дс_Родитель.Видимость = Ложь;
		Элементы.СписокПараметровНаработкиГруппа1.Видимость = Ложь;
		Элементы.ТабМаксимальныхЗначенийНаработки.Видимость = Ложь;
		Элементы.ГруппаШаблоныТехКарт.Видимость = Ложь;
		//
		Элементы.дс_Наименование.Заголовок = "Наименование";
	ИначеЕсли дс_УровеньОбъекта = 2 Тогда 
		Элементы.СписокПараметровНаработкиГруппа1.Видимость = Ложь;
		Элементы.ГруппаСписокОР.Видимость = Ложь;
		Элементы.СтраницаИзображение.Видимость = Ложь;
		Элементы.СтраницыНормативы.Видимость = Ложь;
		Элементы.дс_НормативныеРемонтыНормативныйРемонт.Видимость = Ложь;
		Элементы.дс_НормативныеРемонтыСтатус.Видимость = Ложь;
		Элементы.ТабМаксимальныхЗначенийНаработки.Видимость = Ложь;
		Элементы.гкс_Модель.Видимость = Ложь;
		Элементы.ГруппаНаправление.Видимость = Ложь;
		Элементы.Изготовитель.Видимость = Ложь;
		Элементы.тк_ГруппаПодчиненные.Видимость = Ложь;
		//
		Элементы.ГруппаКонструкторскийСостав.Видимость = Истина;
		Элементы.дс_Родитель.Видимость = Истина;
		Элементы.ГруппаНормативныеРемонты.Видимость = Истина;
		Элементы.дс_Наименование.Заголовок = "Наименование";
		Элементы.дс_Родитель.Заголовок = "Класс";
		Элементы.ГруппаНаправление.Видимость = Истина;
		Элементы.дс_Направление.Видимость = Истина;
		Элементы.ГруппаШаблоныТехКарт.Видимость = Истина;
		Элементы.ГруппаШаблоныТехКарт.Заголовок = НСтр("ru='Шаблоны технологических карт';
		|en='Patterns standard maintenance plans';
		|es=''");
		Элементы.тк_ГруппаШаблоны.Видимость = Истина;
	Иначе
		Элементы.ГруппаКонструкторскийСостав.Видимость = Ложь;
		Элементы.тк_ГруппаШаблоны.Видимость = Ложь;
		//
		Элементы.дс_Родитель.Видимость = Истина;
		Элементы.гкс_Модель.Видимость = Истина;
		Элементы.ГруппаНаправление.Видимость = Истина;
		Элементы.дс_Направление.Видимость = Истина;
		Элементы.Изготовитель.Видимость = Истина;
		Элементы.СписокПараметровНаработкиГруппа1.Видимость = Истина;
		Элементы.ГруппаСписокОР.Видимость = Истина;
		Элементы.СтраницаИзображение.Видимость = Истина;
		Элементы.ГруппаНормативныеРемонты.Видимость = Истина;
		Элементы.СтраницыНормативы.Видимость = Истина;
		Элементы.дс_НормативныеРемонтыНормативныйРемонт.Видимость = Истина;
		Элементы.дс_НормативныеРемонтыСтатус.Видимость = Истина;
		Элементы.ТабМаксимальныхЗначенийНаработки.Видимость = Истина;
		Элементы.дс_Наименование.Заголовок = "Модель";
		Элементы.дс_Родитель.Заголовок = "Подкласс";
		Элементы.тк_ГруппаПодчиненные.Видимость = Истина;
		Элементы.ГруппаШаблоныТехКарт.Видимость = Истина;
		Элементы.ГруппаШаблоныТехКарт.Заголовок = НСтр("ru='Технологические карты ремонтов';
		|en='Standard maintenance plans';
		|es=''");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьРеквизитов()
	// Гкс+[TOIR20-94] Борисов В.М. от 05.06.2020. Добавлено:{
	Элементы.гкс_Критичность.Доступность = дс_Редактирование;
	Элементы.гкс_ОтветственныйИнженер.Доступность = дс_Редактирование;
	// } Гкс-[TOIR20-94] Борисов В.М. от 05.06.2020.
	Элементы.дс_Наименование.ТолькоПросмотр = Не дс_Редактирование;
	Элементы.дс_Комментарий.ТолькоПросмотр = Не дс_Редактирование;
	Элементы.дс_Направление.ТолькоПросмотр = Не дс_Редактирование;
	Элементы.Изготовитель.ТолькоПросмотр = Не дс_Редактирование;
	Элементы.ГруппаДополнительно.ТолькоПросмотр = Не дс_Редактирование;
	Элементы.ДобавитьОРВСостав.Доступность = дс_Редактирование;
	Элементы.дс_СписокОРСоставОРУдалить.Доступность = дс_Редактирование;
	Элементы.дс_СписокОРПодборОР.Доступность = дс_Редактирование;
	Элементы.дс_СписокИзмеряемыхПоказателейПодборКонтролируемыхПоказателей.Доступность = дс_Редактирование;
	Элементы.КомандыКартинки.Доступность = дс_Редактирование;
	Элементы.дс_СписокИзмеряемыхПоказателей.ИзменятьСоставСтрок = дс_Редактирование;
	Элементы.ПараметрыОповещенияПоСостояниямОР.ИзменятьСоставСтрок = дс_Редактирование;
	Элементы.дс_НормативныеРемонты.ИзменятьСоставСтрок = дс_Редактирование;
	Элементы.дс_ПредшествующиеРемонты.ИзменятьСоставСтрок = дс_Редактирование;
	Элементы.дс_ЗамещаемыеРемонты.ИзменятьСоставСтрок = дс_Редактирование;
	Элементы.СписокПараметровНаработки.ИзменятьСоставСтрок = дс_Редактирование;
	Элементы.ТабМаксимальныхЗначенийНаработки.ИзменятьСоставСтрок = дс_Редактирование;
	Элементы.гкс_КонструктивныйСостав.ИзменятьСоставСтрок = дс_Редактирование;
	Элементы.ДополнительныеРеквизиты.ИзменятьСоставСтрок = дс_Редактирование;
	
	Элементы.дс_СписокИзмеряемыхПоказателейПоказатель.ТолькоПросмотр = Не дс_Редактирование;
	Элементы.дс_СписокИзмеряемыхПоказателейЕдиницаИзмерения.ТолькоПросмотр = Не дс_Редактирование;
	Элементы.дс_СписокИзмеряемыхПоказателейЗначенияКонтролируемыхПоказателейИзОР.ТолькоПросмотр = Не дс_Редактирование;
	Элементы.дс_СписокИзмеряемыхПоказателейДопустимыйМинимум.ТолькоПросмотр = Не дс_Редактирование;
	Элементы.дс_СписокИзмеряемыхПоказателейДопустимыйМаксимум.ТолькоПросмотр = Не дс_Редактирование;
	Элементы.дс_СписокИзмеряемыхПоказателейКритическийМинимум.ТолькоПросмотр = Не дс_Редактирование;
	Элементы.дс_СписокИзмеряемыхПоказателейКритическийМаксимум.ТолькоПросмотр = Не дс_Редактирование;
	Элементы.ПараметрыОповещенияПоСостояниямОРВидСравнения.ТолькоПросмотр = Не дс_Редактирование;
	Элементы.ПараметрыОповещенияПоСостояниямОРВариантЗначения.ТолькоПросмотр = Не дс_Редактирование;
	Элементы.ПараметрыОповещенияПоСостояниямОРЗначение.ТолькоПросмотр = Не дс_Редактирование;
	Элементы.ПараметрыОповещенияПоСостояниямОРВариантЗначения1.ТолькоПросмотр = Не дс_Редактирование;
	Элементы.ПараметрыОповещенияПоСостояниямОРЗначение1.ТолькоПросмотр = Не дс_Редактирование;
	Элементы.ПараметрыОповещенияПоСостояниямОРСобытиеВозникновенияОповещения.ТолькоПросмотр = Не дс_Редактирование;
	Элементы.ПараметрыОповещенияПоСостояниямОРПараметрыВводаДефекта.ТолькоПросмотр = Не дс_Редактирование;
	Элементы.дс_НормативныеРемонтыСтатус.ТолькоПросмотр = Не дс_Редактирование;
	Элементы.дс_НормативныеРемонтыВидРемонта.ТолькоПросмотр = Не дс_Редактирование;
	Элементы.дс_НормативныеРемонтыНормативныйРемонт.ТолькоПросмотр = Не дс_Редактирование;
	Элементы.дс_НормативныеРемонтыСпособПланирования.ТолькоПросмотр = Не дс_Редактирование;
	Элементы.дс_ПредшествующиеРемонтыПредшествующийВидРемонта.ТолькоПросмотр = Не дс_Редактирование;
	Элементы.дс_ЗамещаемыеРемонтыЗамещаемыйВидРемонта.ТолькоПросмотр = Не дс_Редактирование;
	Элементы.дс_ЗамещаемыеРемонтыСпособЗамещения.ТолькоПросмотр = Не дс_Редактирование;
	Элементы.дс_ЗамещаемыеРемонтыНачальнаяГраница.ТолькоПросмотр = Не дс_Редактирование;
	Элементы.дс_ЗамещаемыеРемонтыКонечнаяГраница.ТолькоПросмотр = Не дс_Редактирование;
	Элементы.СписокПараметровНаработкиПоказатель.ТолькоПросмотр = Не дс_Редактирование;
	Элементы.СписокПараметровНаработкиЕдиницаИзмерения.ТолькоПросмотр = Не дс_Редактирование;
	Элементы.СписокПараметровНаработкиПлановаяНаработка.ТолькоПросмотр = Не дс_Редактирование;
	Элементы.СписокПараметровНаработкиКоэффициентИспользованияОборудования.ТолькоПросмотр = Не дс_Редактирование;
	Элементы.ТабМаксимальныхЗначенийНаработкиМаксимальноеЗначение.ТолькоПросмотр = Не дс_Редактирование;
	Элементы.ТабМаксимальныхЗначенийНаработкиНазначенныйРесурс.ТолькоПросмотр = Не дс_Редактирование;
	Элементы.гкс_КонструктивныйСоставКомпонент.ТолькоПросмотр = Не дс_Редактирование;
	Элементы.СписокПараметровНаработкиПериодПлановойНаработки.ТолькоПросмотр = Не дс_Редактирование;
	Элементы.СписокПараметровНаработкиПродолжительностьПериодаПлановойНаработки.ТолькоПросмотр = Не дс_Редактирование;
	Элементы.ДополнительныеРеквизитыЗначение.ТолькоПросмотр = Не дс_Редактирование;
	
	Элементы.дс_НормативныеРемонтыСтатус.Доступность = дс_Редактирование;
	Элементы.дс_НормативныеРемонтыВидРемонта.Доступность = дс_Редактирование;
	Элементы.дс_НормативныеРемонтыНормативныйРемонт.Доступность = дс_Редактирование;
	Элементы.дс_НормативныеРемонтыСпособПланирования.Доступность = дс_Редактирование;
	Элементы.ГруппаДополнительныеРеквизиты.ТолькоПросмотр = Не дс_Редактирование;
	Элементы.СохранитьИзменения.Доступность = дс_Редактирование;
	Элементы.ДополнительныеРеквизитыДобавитьИзНабора.Доступность = дс_Редактирование;
	ОбновитьДоступностьТЧТехКарт();
	
КонецПроцедуры

&НаКлиенте
Процедура НеСохранитьПослеВопроса(Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда 
		МодифицированностьИзмеряемыхПоказателей = Ложь;
		дс_Модифицированность = Ложь;
		МодифицированностьПараметровОповещенияОСостоянииОР = Ложь;
		МодифицированностьПредшествующихРемонтов = Ложь;
		МодифицированностьЗамещаемыхРемонтов = Ложь;
		МодифицированностьНормРемонтов = Ложь;
		МодифицированностьМаксЗначНаработки = Ложь;
		МодифицированностьПараметровНаработки = Ложь;
		дс_ДоСсылка = Неопределено;
		СписокПриАктивизацииСтроки(Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьИзмеряемыеПоказатели(Ссылка, Родитель, СписокИзмеряемыхПоказателей)
	
	СтруктураКонтрПоказателей = ПолучитьИзмеряемыеПоказатели(Ссылка, Родитель);
	СписокИзмеряемыхПоказателей.Очистить();
	Для Каждого Элем Из СтруктураКонтрПоказателей Цикл
		НоваяСтрока = СписокИзмеряемыхПоказателей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Элем);
		НоваяСтрока.Доступность = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяСтрока.Показатель, "ТипЗначения").СодержитТип(Тип("Число"));
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИзмеряемыеПоказатели(ТиповойОР, Родитель)
	
	СтруктураВозврата = Новый Массив;

	Если ЗначениеЗаполнено(ТиповойОР) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|РАЗРЕШЕННЫЕ
		|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ОбъектРемонта,
		|	торо_ИзмеряемыеПоказателиОбъектовРемонта.Показатель КАК Показатель,
		|	ЕСТЬNULL(торо_ИзмеряемыеПоказателиОбъектовРемонта1.ДопустимыйМинимум, 
		|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ДопустимыйМинимум) КАК ДопустимыйМинимум,
		|	ЕСТЬNULL(торо_ИзмеряемыеПоказателиОбъектовРемонта1.ДопустимыйМаксимум, 
		|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ДопустимыйМаксимум) КАК ДопустимыйМаксимум,
		|	ЕСТЬNULL(торо_ИзмеряемыеПоказателиОбъектовРемонта1.КритическийМаксимум, 
		|	торо_ИзмеряемыеПоказателиОбъектовРемонта.КритическийМаксимум) КАК КритическийМаксимум,
		|	ЕСТЬNULL(торо_ИзмеряемыеПоказателиОбъектовРемонта1.КритическийМинимум, 
		|	торо_ИзмеряемыеПоказателиОбъектовРемонта.КритическийМинимум) КАК КритическийМинимум,
		|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ЗначенияКонтролируемыхПоказателейИзОР,
		|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ТочкаЗамера,
		|	1 КАК Уровень
		|ПОМЕСТИТЬ ВТ_ВсеПоказатели
		|ИЗ
		|	РегистрСведений.торо_ИзмеряемыеПоказателиОбъектовРемонта КАК торо_ИзмеряемыеПоказателиОбъектовРемонта
		|			ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.торо_ИзмеряемыеПоказателиОбъектовРемонта 
		|	КАК торо_ИзмеряемыеПоказателиОбъектовРемонта1
		|			ПО торо_ИзмеряемыеПоказателиОбъектовРемонта.Показатель = торо_ИзмеряемыеПоказателиОбъектовРемонта1.Ссылка
		|				И (НЕ торо_ИзмеряемыеПоказателиОбъектовРемонта.ЗначенияКонтролируемыхПоказателейИзОР)
		|ГДЕ &ТиповойОР = торо_ИзмеряемыеПоказателиОбъектовРемонта.ОбъектРемонта
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Показатель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВсеПоказатели.Показатель КАК Показатель,
		|	МИНИМУМ(ВТ_ВсеПоказатели.Уровень) КАК Уровень
		|ПОМЕСТИТЬ ВТ_Приоритеты
		|ИЗ
		|	ВТ_ВсеПоказатели КАК ВТ_ВсеПоказатели
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ВсеПоказатели.Показатель
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Показатель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВсеПоказатели.ОбъектРемонта,
		|	ВТ_ВсеПоказатели.Показатель,
		|	ВТ_ВсеПоказатели.ДопустимыйМинимум,
		|	ВТ_ВсеПоказатели.ДопустимыйМаксимум,
		|	ВТ_ВсеПоказатели.КритическийМаксимум,
		|	ВТ_ВсеПоказатели.КритическийМинимум,
		|	ВТ_ВсеПоказатели.ЗначенияКонтролируемыхПоказателейИзОР,
		|	ВТ_ВсеПоказатели.ТочкаЗамера,
		|	ВТ_ВсеПоказатели.Уровень КАК Уровень
		|ИЗ
		|	ВТ_Приоритеты КАК ВТ_Приоритеты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВсеПоказатели КАК ВТ_ВсеПоказатели
		|		ПО ВТ_Приоритеты.Показатель = ВТ_ВсеПоказатели.Показатель
		|			И ВТ_Приоритеты.Уровень = ВТ_ВсеПоказатели.Уровень
		|
		|УПОРЯДОЧИТЬ ПО
		|	Уровень УБЫВ";
		
		Запрос.УстановитьПараметр("ТиповойОР", ТиповойОР);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СтруктураСтроки = Новый Структура("ОбъектРемонта, Показатель, ДопустимыйМинимум, ДопустимыйМаксимум,
											  |КритическийМинимум, КритическийМаксимум, 
											  |ЗначенияКонтролируемыхПоказателейИзОР, ТочкаЗамера");
			ЗаполнитьЗначенияСвойств(СтруктураСтроки,Выборка);			
				
			Если НЕ ТипЗнч(СтруктураСтроки.ДопустимыйМаксимум) = Тип("Число") Тогда
				СтруктураСтроки.ДопустимыйМаксимум = 0;
			КонецЕсли;
			Если НЕ ТипЗнч(СтруктураСтроки.КритическийМинимум) = Тип("Число") Тогда
				СтруктураСтроки.КритическийМинимум = 0;
			КонецЕсли;
			Если НЕ ТипЗнч(СтруктураСтроки.КритическийМаксимум) = Тип("Число") Тогда
				СтруктураСтроки.КритическийМаксимум = 0;
			КонецЕсли;
			Если НЕ ТипЗнч(СтруктураСтроки.ДопустимыйМаксимум) = Тип("Число") Тогда
				СтруктураСтроки.ДопустимыйМаксимум = 0;
			КонецЕсли;
				
			СтруктураВозврата.Добавить(СтруктураСтроки);

		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИфункции

#Область Локализация

&НаКлиенте
Процедура дс_НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	торо_ЛокализацияКлиент.НачалоВыбора(ЭтаФорма, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура дс_ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	торо_ЛокализацияКлиент.ОбработкаВыбора(ЭтаФорма, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
	дс_Модифицированность = истина;
	ОбновитьМодель();
КонецПроцедуры

&НаСервере
Процедура дс_ПриСозданииНаСервере()
	//СтроковыеРеквизиты = "Наименование,Изготовитель,Комментарий,гкс_Модель";
	СтроковыеРеквизиты = "Наименование,Комментарий,гкс_Модель";
	торо_ЛокализацияСобытияФорм.ПриСоздании(ЭтаФорма, СтроковыеРеквизиты);
КонецПроцедуры 

&НаСервере
Процедура дс_ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи)
	торо_ЛокализацияСобытияФорм.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
КонецПроцедуры 

// Гкс+[TOIR20-94] Борисов В.М. от 05.06.2020. Добавлено:{
&НаСервере
Процедура гкс_ДобавитьЭлементыФормы()
	
	// добавим новую страницу Ответственный и заполним ее
	// Гкс+[TOIR20-204] Селимов от 08.12.2020. Изменено:{
	// ТолькоПросмотр = Истина;
	// }На:{
	КритичностьТолькоПросмотр = Истина;	// } Гкс-[TOIR20-204]
	Если ПравоДоступа("Редактирование", Метаданные.Справочники.гкс_Критичность) Тогда
		КритичностьТолькоПросмотр = Ложь;
	КонецЕсли;
	
	НоваяГруппа = Элементы.Добавить("гкс_Ответственный", Тип("ГруппаФормы"), Элементы.СтраницыПравая);
	НоваяГруппа.Заголовок = Нстр("ru='Ответственный'", ОбщегоНазначения.КодОсновногоЯзыка());
	НоваяГруппа.Вид = ВидГруппыФормы.Страница;
	
	НовыйЭлемент = Элементы.Добавить("гкс_ОтветственныйИнженер", Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = Нстр("ru='Ответственный инженер'", ОбщегоНазначения.КодОсновногоЯзыка());
	НовыйЭлемент.ПутьКДанным = "Объект.гкс_ОтветственныйИнженер";
	НовыйЭлемент.ТолькоПросмотр = КритичностьТолькоПросмотр;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "гкс_Подключаемый_ОтветственныйИнженерПриИзменении");
	
	НовыйЭлемент = Элементы.Добавить("гкс_Критичность", Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = Нстр("ru='Кричичность'", ОбщегоНазначения.КодОсновногоЯзыка());
	НовыйЭлемент.ПутьКДанным = "Объект.гкс_Критичность";
	НовыйЭлемент.ТолькоПросмотр = КритичностьТолькоПросмотр;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "гкс_Подключаемый_КритичностьПриИзменении");
	
КонецПроцедуры // } Гкс-[TOIR20-94] Борисов В.М. от 05.06.2020.

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокИзмеряемыхПоказателей
&НаКлиенте
Процедура СписокИзмеряемыхПоказателейОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("ПланВидовХарактеристикСсылка.торо_ИзмеряемыеПоказателиОбъектовРемонта") Тогда
		
		Если Не дс_СписокИзмеряемыхПоказателей.НайтиСтроки(Новый Структура("Показатель", ВыбранноеЗначение)).Количество() > 0 Тогда
			НоваяСтрока = дс_СписокИзмеряемыхПоказателей.Добавить();
			ЗаполнитьСтрокуДанными(НоваяСтрока,ВыбранноеЗначение);
			МодифицированностьИзмеряемыхПоказателей = Истина;
			дс_Модифицированность = Истина;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокИзмеряемыхПоказателейПослеУдаления(Элемент)
	МодифицированностьИзмеряемыхПоказателей = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокИзмеряемыхПоказателейПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элементы.дс_СписокИзмеряемыхПоказателей.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ОтборПараметровОповещений = Новый ФиксированнаяСтруктура("Показатель",Элементы.дс_СписокИзмеряемыхПоказателей.ТекущиеДанные.Показатель);
		Элементы.ПараметрыОповещенияПоСостояниямОР.ОтборСтрок = ОтборПараметровОповещений;
	Иначе
		ОтборПараметровОповещений = Новый ФиксированнаяСтруктура("Показатель",ПредопределенноеЗначение("ПланВидовХарактеристик.торо_ИзмеряемыеПоказателиОбъектовРемонта.ПустаяСсылка"));
		Элементы.ПараметрыОповещенияПоСостояниямОР.ОтборСтрок = ОтборПараметровОповещений;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокИзмеряемыхПоказателейЗначенияКонтролируемыхПоказателейИзОРПриИзменении(Элемент)
	ТекДанные = Элементы.дс_СписокИзмеряемыхПоказателей.ТекущиеДанные;
	Структура = ПолучитьЗначениеРеквизитов (ТекДанные.Показатель);
	Структура.Вставить("ОбъектРемонта", дс_Ссылка);
	Структура.Вставить("Показатель"   , ТекДанные.Показатель);
    ЗаполнитьСтрокуДанными(ТекДанные,ТекДанные.Показатель);
	МодифицированностьИзмеряемыхПоказателей = Истина;	
КонецПроцедуры

&НаКлиенте
Процедура СписокИзмеряемыхПоказателейПередУдалением(Элемент, Отказ)
	
	ТекДанные = Элементы.дс_СписокИзмеряемыхПоказателей.ТекущиеДанные;
	Если ТекДанные <> Неопределено 
		И ЗначениеЗаполнено(ТекДанные.ОбъектРемонта) И ТекДанные.ОбъектРемонта <> дс_Ссылка Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	МассивСтрок = ПараметрыОповещенияПоСостояниямОР.НайтиСтроки(Новый Структура("ТиповойОР,Показатель",дс_Ссылка,Элемент.ТекущиеДанные.Показатель));
	Для Каждого СтрокаКУдалению Из МассивСтрок Цикл
		ПараметрыОповещенияПоСостояниямОР.Удалить(СтрокаКУдалению);
		МодифицированностьПараметровОповещенияОСостоянииОР = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДопустимыйМинимумПриИзменении(Элемент)
	МодифицированностьИзмеряемыхПоказателей = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокИзмеряемыхПоказателейПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	// Запись данных до редактирования
	Если НЕ НоваяСтрока Тогда
		торо_СобытияФормКлиент.ПриНачалеРедактирования(Элемент,СтруктураДанныхДоРедактирования,Элемент.ТекущиеДанные);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокИзмеряемыхПоказателейПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекДанные = Элемент.ТекущиеДанные;
	ТекСтрока = Элемент.ТекущаяСтрока;
	ТекстОшибки = "";
	Если НЕ ОтменаРедактирования Тогда
		// проверка
		Если ТекДанные.Показатель = ПредопределенноеЗначение("ПланВидовХарактеристик.торо_ИзмеряемыеПоказателиОбъектовРемонта.ПустаяСсылка") Тогда
			ТекстОшибки = НСтр("es='Indiquen el índice controlado.';ru='Укажите контролируемый показатель.';en='Specify the target metric.'");
		Иначе
			СтрокиПоказателей = дс_СписокИзмеряемыхПоказателей.НайтиСтроки(Новый Структура("Показатель",ТекДанные.Показатель));
			Если СтрокиПоказателей.Количество() > 1 Тогда
				ТекстОшибки = НСтр("es='El índice controlado es añadido ya en otra línea.';ru='Контролируемый показатель уже добавлен в другой строке.';en='The metric is already added on another line.'");
			КонецЕсли;
		КонецЕсли;
		
		Если ТекстОшибки <> "" Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки,, "СписокИзмеряемыхПоказателей",, Отказ);
		КонецЕсли;
		Если ТекДанные.ЗначенияКонтролируемыхПоказателейИзОР Тогда
			ТекстСообщения = "";
			Если ТипЗнч(ТекДанные.КритическийМинимум) = Тип("Число") 
				И ТипЗнч(ТекДанные.ДопустимыйМинимум) = Тип("Число") 
				И ТипЗнч(ТекДанные.ДопустимыйМаксимум) = Тип("Число") 
				И ТипЗнч(ТекДанные.КритическийМаксимум) = Тип("Число") Тогда
				Если ТекДанные.КритическийМинимум > ТекДанные.ДопустимыйМинимум Тогда
					ТекстСообщения = ТекстСообщения + НСтр("es='¡El mínimo crítico supera el mínimo admisible! ';ru='Критический минимум превышает допустимый минимум! ';en='Critical minimum exceeds the allowable minimum! '");
				КонецЕсли;
				Если ТекДанные.ДопустимыйМинимум > ТекДанные.ДопустимыйМаксимум Тогда
					ТекстСообщения = ТекстСообщения + НСтр("es='¡El mínimo admisible supera el máximo admisible! ';ru='Допустимый минимум превышает допустимый максимум! ';en='Allowable minimum exceeds allowable maximum! '");
				КонецЕсли;
				Если ТекДанные.ДопустимыйМаксимум > ТекДанные.КритическийМаксимум Тогда
					ТекстСообщения = ТекстСообщения + НСтр("es='¡El máximo admisible supera el máximo crítico! ';ru='Допустимый максимум превышает критический максимум! ';en='Allowable maximum exceeds critical maximum! '");
				КонецЕсли;
			КонецЕсли;
			Если ТекстСообщения <> "" Тогда
				ТекстСообщения = ТекстСообщения + НСтр("es='¡Prueben redactar las fronteras de los significados admisibles!';ru='Попробуйте отредактировать границы допустимых значений!';en='Try editing the boundaries of the allowed values!'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "СписокИзмеряемыхПоказателей",, Отказ);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли НЕ НоваяСтрока Тогда
		// возврат старых значений
		ЗаполнитьЗначенияСвойств(ТекДанные,СтруктураДанныхДоРедактирования[Элемент.Имя]);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура дс_СписокИзмеряемыхПоказателейПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если НЕ ОтменаРедактирования Тогда
		МодифицированностьИзмеряемыхПоказателей = Истина;
		ТекДанные = Элемент.ТекущиеДанные;

		Если НоваяСтрока Тогда
			МассивСтрок = дс_СписокИзмеряемыхПоказателей.НайтиСтроки(Новый Структура("Показатель", ТекДанные.Показатель));
			Если МассивСтрок.Количество() > 1 Тогда
				ТекстСообщения = НСтр("es='¡El índice dado es añadido ya!';ru='Данный показатель уже добавлен!';en='This indicator has already been added!'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Иначе
				Структура = ПолучитьЗначениеРеквизитов (ТекДанные.Показатель);
				Структура.Вставить("ОбъектРемонта", дс_Ссылка);
				Структура.Вставить("Показатель"   , ТекДанные.Показатель);
	            ЗаполнитьСтрокуДанными(ТекДанные,ТекДанные.Показатель);
				ТекДанные.Доступность = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекДанные.Показатель, "ТипЗначения").СодержитТип(Тип("Число"));
				МодифицированностьИзмеряемыхПоказателей = Истина;
				СписокИзмеряемыхПоказателейПриАктивизацииСтроки(Элементы.дс_СписокИзмеряемыхПоказателей);
			КонецЕсли;
		КонецЕсли;
		
		ТекДанные.ОбъектРемонта = дс_Ссылка;
		ТекДанные.Изменен = Истина;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПараметрыОповещенияПоСостояниямОР
&НаКлиенте
Процедура ПараметрыОповещенияПоСостояниямОРПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если НЕ ОтменаРедактирования Тогда
		МодифицированностьПараметровОповещенияОСостоянииОР = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыОповещенияПоСостояниямОРПослеУдаления(Элемент)
		МодифицированностьПараметровОповещенияОСостоянииОР = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыОповещенияПоСостояниямОРПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекДанные = Элементы.дс_СписокИзмеряемыхПоказателей.ТекущиеДанные;
		Если ТекДанные <> Неопределено Тогда
			Элемент.ТекущиеДанные.ТиповойОР = дс_Ссылка;
			Элемент.ТекущиеДанные.Показатель = ТекДанные.Показатель;
			Элемент.ТекущиеДанные.ID = Новый УникальныйИдентификатор;
		КонецЕсли;
	КонецЕсли;
	
	// Запись данных до редактирования
	Если НЕ НоваяСтрока Тогда
		торо_СобытияФормКлиент.ПриНачалеРедактирования(Элемент,СтруктураДанныхДоРедактирования,Элемент.ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыОповещенияПоСостояниямОРПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекДанные = Элемент.ТекущиеДанные;
	ТекСтрока = Элемент.ТекущаяСтрока;
	ТекстОшибки = "";
	Если НЕ ОтменаРедактирования Тогда
		// проверка
		Если ТекДанные.ВидСравнения = ПредопределенноеЗначение("Перечисление.торо_ВидыСравнения.ПустаяСсылка") Тогда
			ТекстОшибки = НСтр("es='Indiquen el tipo de la comparación.';ru='Укажите вид сравнения.';en='Specify the type of comparison.'");
		Иначе
			Если (ТекДанные.ВидСравнения = ПредопределенноеЗначение("Перечисление.торо_ВидыСравнения.ВИнтервале")
				ИЛИ ТекДанные.ВидСравнения = ПредопределенноеЗначение("Перечисление.торо_ВидыСравнения.НеВИнтервале"))
				И (НЕ ЗначениеЗаполнено(ТекДанные.ВариантЗначения) ИЛИ НЕ ЗначениеЗаполнено(ТекДанные.ВариантЗначения1)) Тогда
				ТекстОшибки = НСтр("es='Indiquen los tipos del significado.';ru='Укажите виды значения.';en='Specify the types of value.'");
			ИначеЕсли НЕ ЗначениеЗаполнено(ТекДанные.ВариантЗначения) Тогда
				ТекстОшибки = НСтр("es='Indiquen el tipo del significado.';ru='Укажите вид значения.';en='Specify the type of value.'");				
			КонецЕсли;
		КонецЕсли;
		
		Если ТекстОшибки <> "" Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки,, "ПараметрыОповещенияПоСостояниямОР",, Отказ);
		КонецЕсли;

	ИначеЕсли НЕ НоваяСтрока Тогда
		// возврат старых значений
		ЗаполнитьЗначенияСвойств(ТекДанные,СтруктураДанныхДоРедактирования[Элемент.Имя]);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыОповещенияПоСостояниямОРПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ТекДанные = Элементы.дс_СписокИзмеряемыхПоказателей.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		ТекстСообщения = НСтр("es='Escojan el índice controlado en la lista de los índices.';
		|ru='Выберите контролируемый показатель в списке показателей.';
		|en='Select a metric in the metric list.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область НормативныеРемонты

&НаСервереБезКонтекста
Функция ПолучитьПредшествующиеИлиНормативные(ИмяВторойКолонки, дс_НормативныеРемонты, дс_ПредшествующиеРемонты = Неопределено, дс_ЗамещаемыеРемонты = Неопределено)
	
	Если ИмяВторойКолонки = "ПредшествующийВидРемонта" Тогда
		ТЗПредшествующихИлиЗамещаемых = дс_ПредшествующиеРемонты.Выгрузить();
		
		ТЗНормативных = дс_НормативныеРемонты.Выгрузить();
		
		ТекстЗапроса = "ВЫБРАТЬ
		|	ТЗПредшествующихИлиЗамещаемых.ВидРемонта,
		|	ТЗПредшествующихИлиЗамещаемых.%ВидРемонта
		|ПОМЕСТИТЬ ТЗПредшествующихИлиЗамещаемых 
		|ИЗ
		|	&ТЗПредшествующихИлиЗамещаемых КАК ТЗПредшествующихИлиЗамещаемых
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗНормативных.ВидРемонта,
		|	ТЗНормативных.Статус
		|ПОМЕСТИТЬ ТЗНормативных
		|ИЗ
		|	&ТЗНормативных КАК ТЗНормативных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗНормативных.ВидРемонта
		|ПОМЕСТИТЬ ДействующиеВР
		|ИЗ
		|	ТЗНормативных КАК ТЗНормативных
		|ГДЕ
		|	ТЗНормативных.Статус = ЗНАЧЕНИЕ(Перечисление.торо_СтатусыНормативныхРемонтовИТехКарт.Действует)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗПредшествующихИлиЗамещаемых.ВидРемонта,
		|	ТЗПредшествующихИлиЗамещаемых.%ВидРемонта
		|ИЗ
		|	ДействующиеВР КАК ДействующиеВР
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТЗПредшествующихИлиЗамещаемых КАК ТЗПредшествующихИлиЗамещаемых
		|		ПО ДействующиеВР.ВидРемонта = ТЗПредшествующихИлиЗамещаемых.ВидРемонта
		|			И (ТЗПредшествующихИлиЗамещаемых.%ВидРемонта В
		|				(ВЫБРАТЬ
		|					ДействующиеВР.ВидРемонта
		|				ИЗ
		|					ДействующиеВР КАК ДействующиеВР))";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ВидРемонта", ИмяВторойКолонки);
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("ТЗПредшествующихИлиЗамещаемых", ТЗПредшествующихИлиЗамещаемых);
		Запрос.УстановитьПараметр("ТЗНормативных", ТЗНормативных);
		Возврат Запрос.Выполнить().Выгрузить();		
	ИначеЕсли ИмяВторойКолонки = "ЗамещаемыйВидРемонта" Тогда
		ТЗПредшествующихИлиЗамещаемых = дс_ЗамещаемыеРемонты.Выгрузить();
		
		ТЗНормативных = дс_НормативныеРемонты.Выгрузить();
		
		ТекстЗапроса = "ВЫБРАТЬ
		|	ТЗПредшествующихИлиЗамещаемых.ВидРемонта,
		|	ТЗПредшествующихИлиЗамещаемых.%ВидРемонта,
		|	ТЗПредшествующихИлиЗамещаемых.СпособЗамещения,
		|	ТЗПредшествующихИлиЗамещаемых.НачальнаяГраница,
		|	ТЗПредшествующихИлиЗамещаемых.КонечнаяГраница
		|ПОМЕСТИТЬ ТЗПредшествующихИлиЗамещаемых 
		|ИЗ
		|	&ТЗПредшествующихИлиЗамещаемых КАК ТЗПредшествующихИлиЗамещаемых
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗНормативных.ВидРемонта,
		|	ТЗНормативных.Статус
		|ПОМЕСТИТЬ ТЗНормативных
		|ИЗ
		|	&ТЗНормативных КАК ТЗНормативных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗНормативных.ВидРемонта
		|ПОМЕСТИТЬ ДействующиеВР
		|ИЗ
		|	ТЗНормативных КАК ТЗНормативных
		|ГДЕ
		|	ТЗНормативных.Статус = ЗНАЧЕНИЕ(Перечисление.торо_СтатусыНормативныхРемонтовИТехКарт.Действует)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗПредшествующихИлиЗамещаемых.ВидРемонта,
		|	ТЗПредшествующихИлиЗамещаемых.%ВидРемонта,
		|	ТЗПредшествующихИлиЗамещаемых.СпособЗамещения,
		|	ТЗПредшествующихИлиЗамещаемых.НачальнаяГраница,
		|	ТЗПредшествующихИлиЗамещаемых.КонечнаяГраница
		|ИЗ
		|	ДействующиеВР КАК ДействующиеВР
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТЗПредшествующихИлиЗамещаемых КАК ТЗПредшествующихИлиЗамещаемых
		|		ПО ДействующиеВР.ВидРемонта = ТЗПредшествующихИлиЗамещаемых.ВидРемонта
		|			И (ТЗПредшествующихИлиЗамещаемых.%ВидРемонта В
		|				(ВЫБРАТЬ
		|					ДействующиеВР.ВидРемонта
		|				ИЗ
		|					ДействующиеВР КАК ДействующиеВР))";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ВидРемонта", ИмяВторойКолонки);
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("ТЗПредшествующихИлиЗамещаемых", ТЗПредшествующихИлиЗамещаемых);
		Запрос.УстановитьПараметр("ТЗНормативных", ТЗНормативных);
		Возврат Запрос.Выполнить().Выгрузить();		
	КонецЕсли;
	
	Если ТЗПредшествующихИлиЗамещаемых = Неопределено Тогда	
		Возврат ТЗПредшествующихИлиЗамещаемых;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОРиВРИзТиповогоОР2(ТиповойОР, ИмяТЧ, ИмяРегистра, тч)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_ОбъектыРемонта.Ссылка КАК ОР
	               |ПОМЕСТИТЬ ВТ_ОРы
	               |ИЗ
	               |	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	               |ГДЕ
	               |	торо_ОбъектыРемонта.ТиповойОР = &ТиповойОР
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ОР
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТОР.ВидРемонта КАК ВидРемонта
	               |ПОМЕСТИТЬ ВТ_ТОР
	               |ИЗ
	               |	&ТОР КАК ТОР
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ВидРемонта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ОРы.ОР КАК ОР,
	               |	ВТ_ТОР.ВидРемонта КАК ВидРемонта
	               |ПОМЕСТИТЬ ВТ_ОРыИВидыРабот
	               |ИЗ
	               |	ВТ_ОРы КАК ВТ_ОРы,
	               |	ВТ_ТОР КАК ВТ_ТОР
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ОР,
	               |	ВидРемонта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_ОРыИВидыРабот.ОР КАК ОбъектРемонта,
	               |	ВТ_ОРыИВидыРабот.ВидРемонта,
				   	|	(ВЫБОР КОГДА ДанныеРегистра.Приоритет ЕСТЬ NULL ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК Приоритет
	               |ИЗ
	               |	ВТ_ОРыИВидыРабот КАК ВТ_ОРыИВидыРабот
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений."+ ИмяРегистра +" КАК ДанныеРегистра
	               |		ПО ВТ_ОРыИВидыРабот.ОР = ДанныеРегистра.ОбъектРемонта
	               |			И ВТ_ОРыИВидыРабот.ВидРемонта = ДанныеРегистра.ВидРемонта
	               |			И (ДанныеРегистра.ТиповойОР = ЗНАЧЕНИЕ(Справочник.торо_ТиповыеОР.ПустаяСсылка))";
	
	Запрос.УстановитьПараметр("ТОР", тч.выгрузить(,"ВидРемонта"));

	Запрос.УстановитьПараметр("ТиповойОР", ТиповойОР);
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	Выборка = РезультатЗапроса.Выбрать();
	
	СтруктураВозврата = Новый Массив;
	Пока Выборка.Следующий() Цикл
		СтруктураВозврата.Добавить(Новый Структура("ОбъектРемонта, ВидРемонта, Приоритет", Выборка.ОбъектРемонта, Выборка.ВидРемонта, Выборка.Приоритет));
	КонецЦикла;
	Возврат СтруктураВозврата;	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЗначениеГрафикаРемРаботНаСервере()
	
	Возврат Константы.торо_ГрафикРемонтныхРабот.Получить();
	
КонецФункции

&НаКлиенте
Процедура ЗаписатьИсходныеСтатусыНормативныхРемонтовИИзменитьЗаголовок()
	
	ЕстьНеУтвержденныеНормативныеРемонты = Ложь;
	ЕстьУтвержденныеНормативныеРемонты = Ложь;
	
	СтатусыНормативныхРемонтовДоИзменений.Очистить();
	Для Каждого Строка Из дс_НормативныеРемонты Цикл
		НоваяСтрока = СтатусыНормативныхРемонтовДоИзменений.Добавить();
		НоваяСтрока.Статус = Строка.Статус;
		НоваяСтрока.ИсходныйНомерСтроки = Строка.ИсходныйНомерСтроки;
		
		Если Строка.Статус = ПредопределенноеЗначение("Перечисление.торо_СтатусыНормативныхРемонтовИТехКарт.Действует") Тогда
			ЕстьУтвержденныеНормативныеРемонты = Истина;
		Иначе
			ЕстьНеУтвержденныеНормативныеРемонты = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если дс_Ссылка = ПредопределенноеЗначение("Справочник.торо_ТиповыеОР.ПустаяСсылка") Тогда
		Если дс_ЭтоГруппа Тогда
			ЭтаФорма.Заголовок = НСтр("es='Los objetos tipo de la reparación (la Creación del grupo)';ru='Типовые объекты ремонта (Создание группы)';en='Typical repair objects (Creation of a group)'");
		Иначе	
			ЭтаФорма.Заголовок = НСтр("es='Los objetos tipo de la reparación (la Creación)';ru='Типовые объекты ремонта (Создание)';en='Typical objects of repair (Creation)'");
		КонецЕсли; 
	Иначе
		ЭтаФорма.Заголовок = НСтр("es='(Los objetos tipo de la reparación) ';ru='(Типовые объекты ремонта) ';en='(Typical repair objects) '") + дс_Наименование;
	КонецЕсли;
	
	Если ЕстьУтвержденныеНормативныеРемонты И ЕстьНеУтвержденныеНормативныеРемонты Тогда
		ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + НСтр("es=' [Las normas son afirmadas parcialmente]';ru=' [Нормативы утверждены частично]';en=' [Нормативы утверждены частично]'");
	ИначеЕсли ЕстьУтвержденныеНормативныеРемонты И Не ЕстьНеУтвержденныеНормативныеРемонты Тогда
		ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + НСтр("es=' [Las normas son afirmadas]';ru=' [Нормативы утверждены]';en=' [Нормативы утверждены]'");
	ИначеЕсли Не ЕстьУтвержденныеНормативныеРемонты И ЕстьНеУтвержденныеНормативныеРемонты Тогда
		ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + НСтр("es=' [Las normas no son afirmadas]';ru=' [Нормативы не утверждены]';en=' [Нормативы не утверждены]'");
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьРедактированияНормативныхРемонтов()
	
	ДоступностьЭлем = (Элементы.дс_НормативныеРемонты.ТекущиеДанные.Статус <> ПредопределенноеЗначение("Перечисление.торо_СтатусыНормативныхРемонтовИТехКарт.Действует"));
		
	Элементы.дс_ЗамещаемыеРемонты.Доступность = ДоступностьЭлем;
	Элементы.дс_ПредшествующиеРемонты.Доступность = ДоступностьЭлем;
	Элементы.ИспользоватьКоэффициентыРемонтныхОсобенностей.Доступность = ДоступностьЭлем;
	Элементы.НеИспользоватьВПланировании.Доступность = ДоступностьЭлем;
	Элементы.НеУчитыватьПриПланированииГрафикРаботОборудования.Доступность = ДоступностьЭлем;
	Элементы.НеУчитыватьПриПланированииГрафикРемонтныхРабот.Доступность = ДоступностьЭлем;
	Элементы.НеУчитыватьПродолжительность.Доступность = ДоступностьЭлем;
	Элементы.НормативныеРемонтыРазрешитьСокращатьМежремонтныйПериодПриПланировании.Доступность = ДоступностьЭлем;
	Элементы.УчитыватьПростоиОборудования.Доступность = ДоступностьЭлем;
	Элементы.ГрафикРемонтныхРабот.Доступность = ДоступностьЭлем;
	Элементы.СпособВыполнения.Доступность = ДоступностьЭлем;
	Элементы.СпособУчетаДатыОтсчета.Доступность = ДоступностьЭлем;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСтатусДляНовойСтрокиНормРемонтов(ТекИдентификаторСтроки)
	
	ТекСтрока = дс_НормативныеРемонты.НайтиПоИдентификатору(ТекИдентификаторСтроки);
	Если Не ТекСтрока = Неопределено Тогда		
		ТекСтрока.Статус = Перечисления.торо_СтатусыНормативныхРемонтовИТехКарт.ВРазработке;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьЗаполнениеСтрокиНормативногоРемонта(ТекущиеДанные)
	
	ТекстОшибки = "";
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.НормативныйРемонт) Тогда
		ТекстОшибки = НСтр("es='Indicar reparaciones regulatorias.';
		|ru='Укажите нормативный ремонт.';
		|en='Specify the Regulatory repair.'");
	ИначеЕсли НЕ ЗначениеЗаполнено(ТекущиеДанные.ВидРемонта) Тогда
		ТекстОшибки = НСтр("es='Indiquen el tipo de la reparación.';
		|ru='Укажите вид ремонта.';
		|en='Specify the type of repair.'");
	ИначеЕсли НЕ ЗначениеЗаполнено(ТекущиеДанные.СпособПланирования) Тогда
		ТекстОшибки = НСтр("es='Indiquen el Método de planificación.';
		|ru='Укажите способ планирования.';
		|en='Specify the planning method.'");
	Иначе
		Строки = дс_НормативныеРемонты.НайтиСтроки(Новый Структура("ВидРемонта", ТекущиеДанные.ВидРемонта));
		Если Строки.Количество() > 1 Тогда
			ТекстОшибки = НСтр("es='El tipo dado de la reparación es indicado ya en otra línea.';
			|ru='Данный вид ремонта уже указан в другой строке.';
			|en='This type of repair is already indicated on another line.'");
		Конецесли;
	КонецЕсли;
	
	Возврат ТекстОшибки;
	
КонецФункции

&НаСервере
Процедура ПроверитьЗаполнениеЗамещаемыхРемонтов(Отказ)

	Для каждого СтрЗамещРемонта Из дс_ЗамещаемыеРемонты Цикл
		Если ЗначениеЗаполнено(СтрЗамещРемонта.ЗамещаемыйВидРемонта) Тогда
			МежремонтныйИнтервал = ВычислениеМежремонтногоИнтервала(СтрЗамещРемонта);
			Если НЕ МежремонтныйИнтервал = Неопределено Тогда
				Если МежремонтныйИнтервал <= СтрЗамещРемонта.НачальнаяГраница Тогда
					ШаблонСообщения = НСтр("es='Es rellenado el campo ""los Días del comienzo"" para la reparación %1 en la línea %2';ru='Некорректно заполнено поле ""Дней от начала"" для ремонта %1 в строке %2';en='The ""Days from start"" field is incorrectly filled for repair %1 on line %2'");
					ТекстСообщения = СтрШаблон(ШаблонСообщения, СтрЗамещРемонта.ВидРемонта, СтрЗамещРемонта.ЗамещаемыйВидРемонта);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				КонецЕсли;
				Если МежремонтныйИнтервал <= СтрЗамещРемонта.КонечнаяГраница Тогда
					ШаблонСообщения = НСтр("es='Es rellenado el campo ""los Días de la terminación"" para la reparación %1 en la línea %2';ru='Некорректно заполнено поле ""Дней от окончания"" для ремонта %1 в строке %2';en='The ""Days from the end"" field is incorrectly filled for repair %1 in line %2'");
					ТекстСообщения = СтрШаблон(ШаблонСообщения, СтрЗамещРемонта.ВидРемонта, СтрЗамещРемонта.ЗамещаемыйВидРемонта);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;		
	
КонецПроцедуры

&НаСервере
Функция ВычислениеМежремонтногоИнтервала(ТекДанные)
	
	Перем МежремонтныйИнтервал;
	
	Запрос = Новый Запрос;
	Таб = дс_НормативныеРемонты.Выгрузить(,"ВидРемонта, СпособПланирования");
	Запрос.УстановитьПараметр("Таб", Таб);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таб.СпособПланирования
	|ПОМЕСТИТЬ ОпредСпособПланирования
	|ИЗ
	|	&Таб КАК Таб
	|ГДЕ
	|	Таб.ВидРемонта = &ВидРемонта
	|	И Таб.СпособПланирования <>ЗНАЧЕНИЕ(Справочник.торо_СпособыПланированияРемонтныхРабот.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_СпособыПланированияРемонтныхРабот.ИспользоватьПараметрыНаработки,
	|	торо_СпособыПланированияРемонтныхРабот.ИспользоватьПериодичность,
	|	торо_СпособыПланированияРемонтныхРабот.КоличествоПериодов,
	|	торо_СпособыПланированияРемонтныхРабот.ПериодичностьРемонтныхРабот КАК Периодичность,
	|	ОпредСпособПланирования.СпособПланирования КАК СпособПланирования
	|ИЗ
	|	ОпредСпособПланирования КАК ОпредСпособПланирования
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_СпособыПланированияРемонтныхРабот КАК торо_СпособыПланированияРемонтныхРабот
	|		ПО ОпредСпособПланирования.СпособПланирования = торо_СпособыПланированияРемонтныхРабот.Ссылка";
	
	
	Запрос.УстановитьПараметр("ВидРемонта", ТекДанные.ЗамещаемыйВидРемонта);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДляПериодичности = Результат.Выбрать();
	
	Если ВыборкаДляПериодичности.Следующий() Тогда
		
		Если ВыборкаДляПериодичности.ИспользоватьПериодичность Тогда
			
			Если ВыборкаДляПериодичности.Периодичность = Перечисления.Периодичность.Год Тогда
				Период = 365;
			ИначеЕсли ВыборкаДляПериодичности.Периодичность = Перечисления.Периодичность.Полугодие Тогда
				Период = 182;
			ИначеЕсли ВыборкаДляПериодичности.Периодичность = Перечисления.Периодичность.Квартал Тогда
				Период = 90;
			ИначеЕсли ВыборкаДляПериодичности.Периодичность = Перечисления.Периодичность.Месяц Тогда
				Период = 28;
			ИначеЕсли ВыборкаДляПериодичности.Периодичность = Перечисления.Периодичность.Декада Тогда
				Период = 10;
			ИначеЕсли ВыборкаДляПериодичности.Периодичность = Перечисления.Периодичность.Неделя Тогда
				Период = 7;
			Иначе Период = 1;
			КонецЕсли;
			
			МежремонтныйИнтервал = ВыборкаДляПериодичности.КоличествоПериодов * Период;
			
		КонецЕсли;
		 	
	Иначе
		ТекстСообщения = НСтр("es='Comprueben el relleno ""el Modo de la planificación""';
		|ru='Проверьте заполнение ""Способ планирования""';en='Check the ""Planning method"" filling'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	Возврат МежремонтныйИнтервал;
КонецФункции 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНормативныеРемонты
&НаКлиенте
Процедура НормативныеРемонтыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Элементы.дс_НормативныеРемонтыСтатус.СписокВыбора.Очистить();
	Элементы.дс_НормативныеРемонтыСтатус.СписокВыбора.Добавить(
		ПредопределенноеЗначение("Перечисление.торо_СтатусыНормативныхРемонтовИТехКарт.ВРазработке"));
	Элементы.дс_НормативныеРемонтыСтатус.СписокВыбора.Добавить(
		ПредопределенноеЗначение("Перечисление.торо_СтатусыНормативныхРемонтовИТехКарт.Действует"));
	Элементы.дс_НормативныеРемонтыСтатус.СписокВыбора.Добавить(
		ПредопределенноеЗначение("Перечисление.торо_СтатусыНормативныхРемонтовИТехКарт.Редактируется"));
	
	Если НоваяСтрока Тогда
		
		ТекСтрока = Элемент.ТекущиеДанные;
		ТекСтрока.ГрафикРемонтныхРабот = ПолучитьЗначениеГрафикаРемРаботНаСервере();
		ТекСтрока.СпособВыполнения = ПредопределенноеЗначение("Перечисление.СпособыСтроительства.Хозспособ");
		ТекСтрока.СпособУчетаДатыОтсчета = ПредопределенноеЗначение("Перечисление."
			+ "торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот.ИспользоватьДатуВводаВЭксплуатацию");
		Попытка
			ТекСтрока.Статус = ПредопределенноеЗначение("Перечисление.торо_СтатусыНормативныхРемонтовИТехКарт.ВРазработке");
		Исключение
			ТекИдентификаторСтроки = Элемент.ТекущаяСтрока;
			УстановитьСтатусДляНовойСтрокиНормРемонтов(ТекИдентификаторСтроки);
		КонецПопытки;
		
	КонецЕсли;
	
	Если Копирование Тогда
		ТекСтрока = Элемент.ТекущиеДанные;
		текСтрока.ВидРемонта = ПредопределенноеЗначение("Справочник.торо_ВидыРемонтов.ПустаяСсылка");
	КонецЕсли;
	 
	Если НЕ НоваяСтрока Тогда
		торо_СобытияФормКлиент.ПриНачалеРедактирования(Элемент, СтруктураДанныхДоРедактирования, Элемент.ТекущиеДанные);
	КонецЕсли;
	
	ТекущийСтатусНормативногоРемонта = Элемент.ТекущиеДанные.Статус;
	
КонецПроцедуры

&НаКлиенте
Процедура НормативныеРемонтыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НЕ ОтменаРедактирования Тогда
		МодифицированностьНормРемонтов = Истина;
		ТекДанные = Элемент.ТекущиеДанные;
		
		Если НоваяСтрока Тогда
			НоваяСтрока = дс_ПредшествующиеРемонты.Добавить();
			НоваяСтрока.ВидРемонта = ТекДанные.ВидРемонта;
			НоваяСтрока.ПредшествующийВидРемонта = ТекДанные.ВидРемонта;
			
			МодифицированностьПредшествующихРемонтов = Истина;
		КонецЕсли;
		
		НормативныеРемонтыПриАктивизацииСтроки(Элементы.дс_НормативныеРемонты);

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НормативныеРемонтыПослеУдаления(Элемент)
	МодифицированностьНормРемонтов = Истина;
	МодифицированностьПредшествующихРемонтов = Истина;
	МодифицированностьЗамещаемыхРемонтов = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НормативныеРемонтыПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.дс_НормативныеРемонты.ТекущиеДанные;
	Если не ТекДанные = Неопределено Тогда
		ПараметрыОтбора = Новый ФиксированнаяСтруктура("ВидРемонта", ТекДанные.ВидРемонта);
		Элементы.дс_ПредшествующиеРемонты.ОтборСтрок = ПараметрыОтбора;
		Элементы.дс_ЗамещаемыеРемонты.ОтборСтрок = ПараметрыОтбора;
		УстановитьДоступностьРедактированияНормативныхРемонтов();
		
		дс_ТК_Операции.Параметры.УстановитьЗначениеПараметра("Ссылка",ТекДанные.НормативныйРемонт);
		дс_ТК_МатЗатраты.Параметры.УстановитьЗначениеПараметра("Ссылка",ТекДанные.НормативныйРемонт);
		дс_ТК_Трудозатраты.Параметры.УстановитьЗначениеПараметра("Ссылка",ТекДанные.НормативныйРемонт);
		дс_ТК_Инструменты.Параметры.УстановитьЗначениеПараметра("Ссылка",ТекДанные.НормативныйРемонт);
	Иначе
		дс_ТК_Операции.Параметры.УстановитьЗначениеПараметра("Ссылка",Неопределено);
		дс_ТК_МатЗатраты.Параметры.УстановитьЗначениеПараметра("Ссылка",Неопределено);
		дс_ТК_Трудозатраты.Параметры.УстановитьЗначениеПараметра("Ссылка",Неопределено);
		дс_ТК_Инструменты.Параметры.УстановитьЗначениеПараметра("Ссылка",Неопределено);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура НормативныеРемонтыПередУдалением(Элемент, Отказ)
	Если не Отказ Тогда
		УдалРемонт = Элементы.дс_НормативныеРемонты.ТекущиеДанные.ВидРемонта;
		
		СтрокиДляУдаления = дс_ПредшествующиеРемонты.НайтиСтроки(Новый Структура("ВидРемонта", УдалРемонт));
		Для Каждого СтрокаДляУдаления Из СтрокиДляУдаления Цикл
			дс_ПредшествующиеРемонты.Удалить(СтрокаДляУдаления);
		КонецЦикла;
		
		СтрокиДляУдаления = дс_ПредшествующиеРемонты.НайтиСтроки(Новый Структура("ПредшествующийВидРемонта", УдалРемонт));
		Для Каждого СтрокаДляУдаления Из СтрокиДляУдаления Цикл
			дс_ПредшествующиеРемонты.Удалить(СтрокаДляУдаления);
		КонецЦикла;
		
		СтрокиДляУдаления = дс_ЗамещаемыеРемонты.НайтиСтроки(Новый Структура("ВидРемонта", УдалРемонт));
		Для Каждого СтрокаДляУдаления Из СтрокиДляУдаления Цикл
			дс_ЗамещаемыеРемонты.Удалить(СтрокаДляУдаления);
		КонецЦикла;
		
		СтрокиДляУдаления = дс_ЗамещаемыеРемонты.НайтиСтроки(Новый Структура("ЗамещаемыйВидРемонта", УдалРемонт));
		Для Каждого СтрокаДляУдаления Из СтрокиДляУдаления Цикл
			дс_ЗамещаемыеРемонты.Удалить(СтрокаДляУдаления);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НормативныеРемонтыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	ТекДанные = Элемент.ТекущиеДанные;
	ТекСтрока = Элемент.ТекущаяСтрока;
		
	Если НЕ ОтменаРедактирования Тогда
		ТекстОшибки = ПроверитьЗаполнениеСтрокиНормативногоРемонта(ТекДанные);
				
		Если Не Отказ И Не НоваяСтрока И СтруктураДанныхДоРедактирования[Элемент.Имя] <> Неопределено
			И СтруктураДанныхДоРедактирования[Элемент.Имя].ВидРемонта <> ТекДанные.ВидРемонта Тогда
			
			НайденныеСтроки = дс_ПредшествующиеРемонты.НайтиСтроки(Новый Структура("ВидРемонта",
			СтруктураДанныхДоРедактирования[Элемент.Имя].ВидРемонта));
			Для каждого СтрокаСоСтарымВР Из НайденныеСтроки Цикл			
				СтрокаСоСтарымВР.ВидРемонта = ТекДанные.ВидРемонта;			
			КонецЦикла;
			НайденныеСтроки = дс_ПредшествующиеРемонты.НайтиСтроки(Новый Структура("ПредшествующийВидРемонта",
			СтруктураДанныхДоРедактирования[Элемент.Имя].ВидРемонта));
			Для каждого СтрокаСоСтарымВР Из НайденныеСтроки Цикл			
				СтрокаСоСтарымВР.ПредшествующийВидРемонта = ТекДанные.ВидРемонта;			
			КонецЦикла;
			
			НайденныеСтроки = дс_ЗамещаемыеРемонты.НайтиСтроки(Новый Структура("ВидРемонта",
			СтруктураДанныхДоРедактирования[Элемент.Имя].ВидРемонта));
			Для каждого СтрокаСоСтарымВР Из НайденныеСтроки Цикл			
				СтрокаСоСтарымВР.ВидРемонта = ТекДанные.ВидРемонта;			
			КонецЦикла;
			НайденныеСтроки = дс_ЗамещаемыеРемонты.НайтиСтроки(Новый Структура("ЗамещаемыйВидРемонта",
			СтруктураДанныхДоРедактирования[Элемент.Имя].ВидРемонта));
			Для каждого СтрокаСоСтарымВР Из НайденныеСтроки Цикл			
				СтрокаСоСтарымВР.ЗамещаемыйВидРемонта = ТекДанные.ВидРемонта;			
			КонецЦикла;
			
			НормативныеРемонтыПриАктивизацииСтроки(Элемент);
		КонецЕсли;
		
	ИначеЕсли НЕ НоваяСтрока Тогда
		ЗаполнитьЗначенияСвойств(ТекДанные,СтруктураДанныхДоРедактирования[Элемент.Имя]);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НормативныеРемонтыНормативныйРемонтНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		ОткрытьФорму("Справочник.торо_ИдентификаторыТехКарт.ФормаВыбора",
		Новый Структура("ОтборПоТОР", Объект.Ссылка ), Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НормативныеРемонтыСтатусПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.дс_НормативныеРемонты.ТекущиеДанные;
	
	Если ТекущиеДанные.Статус = 
			ПредопределенноеЗначение("Перечисление.торо_СтатусыНормативныхРемонтовИТехКарт.Действует") Тогда
		ТекстОшибки = ПроверитьЗаполнениеСтрокиНормативногоРемонта(ТекущиеДанные);
		
		Если ТекстОшибки <> "" Тогда
			НомерСтроки = дс_НормативныеРемонты.Индекс(ТекущиеДанные);
			
			ТекстСообщения = НСтр("es='No es posible establecer el estatus ""Funciona"": '
			|;ru='Нельзя установить статус ""Действует"": ';en='Can not set the status to ""Effective"": '") + ТекстОшибки;
			Если ЗначениеЗаполнено(ТекущиеДанные.НормативныйРемонт) = Ложь Тогда 
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,
					"дс_НормативныеРемонты[" + НомерСтроки + "].НормативныйРемонт");
			ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.СпособПланирования) = Ложь Тогда 
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,
					"дс_НормативныеРемонты[" + НомерСтроки + "].СпособПланирования");
			Иначе
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,
					"дс_НормативныеРемонты[" + НомерСтроки + "].ВидРемонта");
			КонецЕсли;
			
			ТекущиеДанные.Статус = ТекущийСтатусНормативногоРемонта;
		КонецЕсли;
	КонецЕсли;
	
	ТекущийСтатусНормативногоРемонта = ТекущиеДанные.Статус;
	МодифицированностьПредшествующихРемонтов = Истина;
	МодифицированностьНормРемонтов = Истина;
	УстановитьДоступностьРедактированияНормативныхРемонтов();
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикРемонтныхРаботПриИзменении(Элемент)
	МодифицированностьНормРемонтов = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СпособВыполненияПриИзменении(Элемент)
	МодифицированностьНормРемонтов = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СпособУчетаДатыОтсчетаПриИзменении(Элемент)
	МодифицированностьНормРемонтов = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НеИспользоватьВПланированииПриИзменении(Элемент)
	МодифицированностьНормРемонтов = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НеУчитыватьПриПланированииГрафикРаботОборудованияПриИзменении(Элемент)
	МодифицированностьНормРемонтов = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НеУчитыватьПродолжительностьПриИзменении(Элемент)
	МодифицированностьНормРемонтов = Истина;
КонецПроцедуры

&НаКлиенте
Процедура УчитыватьПростоиОборудованияПриИзменении(Элемент)
	МодифицированностьНормРемонтов = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьКоэффициентыРемонтныхОсобенностейПриИзменении(Элемент)
	МодифицированностьНормРемонтов = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НормативныеРемонтыРазрешитьСокращатьМежремонтныйПериодПриПланированииПриИзменении(Элемент)
	МодифицированностьНормРемонтов = Истина;
КонецПроцедуры 

&НаКлиенте
Процедура НеУчитыватьПриПланированииГрафикРемонтныхРаботПриИзменении(Элемент)
 МодифицированностьНормРемонтов = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПредшествующиеРемонты
&НаКлиенте
Процедура ПредшествующиеРемонтыПредшествующийВидРемонтаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	СписокОтбора = Новый СписокЗначений();
	
	Для каждого Строка Из дс_НормативныеРемонты Цикл
		
		СписокОтбора.Добавить(Строка.ВидРемонта);
		
	КонецЦикла;
	ПараметрыФормыСтруктура = Новый Структура("КлючНазначенияИспользования, СписокОтбора", "ПредшествующиеРемонты", СписокОтбора);	
	ФормаВыборка = ПолучитьФорму("Справочник.торо_ВидыРемонтов.ФормаВыбора", ПараметрыФормыСтруктура, Элемент);
	ФормаВыборка.Открыть();
	 
КонецПроцедуры

&НаКлиенте
Процедура ПредшествующиеРемонтыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если Элементы.дс_НормативныеРемонты.ТекущиеДанные = Неопределено Тогда
		ТекстСообщения = НСтр("es='la reparación normativa!';
		|ru='Не указан нормативный ремонт!';en='No regulatory repair specified!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПредшествующиеРемонтыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элементы.дс_ПредшествующиеРемонты.ТекущиеДанные.ВидРемонта = Элементы.дс_НормативныеРемонты.ТекущиеДанные.ВидРемонта;
	КонецЕсли;

	Если НЕ НоваяСтрока Тогда
		торо_СобытияФормКлиент.ПриНачалеРедактирования(Элемент, СтруктураДанныхДоРедактирования, Элемент.ТекущиеДанные);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПредшествующиеРемонтыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекДанные = Элемент.ТекущиеДанные;
	ТекСтрока = Элемент.ТекущаяСтрока;
	ТекстОшибки = "";
	Если НЕ ОтменаРедактирования Тогда

		Если НЕ ЗначениеЗаполнено(ТекДанные.ПредшествующийВидРемонта) Тогда
			ТекстОшибки = НСтр("es='Indiquen el tipo que precede de la reparación.';
			|ru='Укажите предшествующий вид ремонта.';en='Specify the previous type of repair.'");
		Иначе

		КонецЕсли;
		
		Если ТекстОшибки <> "" Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки,, "дс_ПредшествующиеРемонты",, Отказ);
		КонецЕсли;

	ИначеЕсли НЕ НоваяСтрока Тогда
		ЗаполнитьЗначенияСвойств(ТекДанные, СтруктураДанныхДоРедактирования[Элемент.Имя]);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредшествующиеРемонтыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если не ОтменаРедактирования Тогда
		МодифицированностьПредшествующихРемонтов = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПредшествующиеРемонтыПослеУдаления(Элемент)
	МодифицированностьПредшествующихРемонтов = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПредшествующиеРемонтыПредшествующийВидРемонтаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	текДанные = Элементы.дс_ПредшествующиеРемонты.ТекущиеДанные;
	
	Если текДанные.ПредшествующийВидРемонта = ВыбранноеЗначение Тогда
		Возврат;
	КонецЕсли;
	
	стрПоиска = Новый Структура("ВидРемонта, ПредшествующийВидРемонта", текДанные.ВидРемонта, ВыбранноеЗначение);
	НайС = дс_ПредшествующиеРемонты.НайтиСтроки(стрПоиска);
	
	Если НайС.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		
		ТекстСообщения = НСтр("es='El tipo de la reparación es añadido ya en otra línea de la tabla.';
		|ru='Вид ремонта уже добавлен в другой строке таблицы.';
		|en='A repair type has already been added to another row in the table.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "дс_ПредшествующиеРемонты");
	КонецЕсли;
	
	СписокОтбора = Новый СписокЗначений(); 	
	
	Для каждого Строка Из дс_НормативныеРемонты Цикл		
		СписокОтбора.Добавить(Строка.ВидРемонта);		
	КонецЦикла; 
	
	НайденВНормативах = СписокОтбора.НайтиПоЗначению(ВыбранноеЗначение);
	Если НайденВНормативах = Неопределено тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьПредупреждение(Неопределено, СтрЗаменить(
		Нстр("es='¡El tipo de la reparación %ВидРемонта% no es encontrado en la lista de las reparaciones normativas!';
		|ru='Вид ремонта %ВидРемонта% не найден в списке нормативных ремонтов!';
		|en='Type of repair %ВидРемонта% not found in the list of normative repairs!'"),
		"%ВидРемонта%", ВыбранноеЗначение),,НСтр("es='La elección del tipo de la reparación...';
		|ru='Выбор вида ремонта...';en='Selecting the type of repair ...'"));		
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ПредшествующиеРемонтыПредшествующийВидРемонтаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СписокРемонтовДляВыбора = Новый СписокЗначений;
	
	Для Каждого строка из дс_ПредшествующиеРемонты Цикл
		СписокРемонтовДляВыбора.Добавить(строка.ВидРемонта);	
	КонецЦикла;
	
	ПараметрыПолученияДанных.Отбор.Вставить("Ссылка", СписокРемонтовДляВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредшествующиеРемонтыПредшествующийВидРемонтаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	СписокОтбора = Новый СписокЗначений;
	Для каждого Строка Из дс_НормативныеРемонты Цикл
		СписокОтбора.Добавить(Строка.ВидРемонта);
	КонецЦикла;
	ПараметрыПолученияДанных.Отбор.Вставить("Ссылка", СписокОтбора);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗамещаемыеРемонты
&НаКлиенте
Процедура ЗамещаемыеРемонтыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если Элементы.дс_НормативныеРемонты.ТекущиеДанные = Неопределено Тогда
		ТекстСообщения = НСтр("es='la reparación normativa!';
		|ru='Не указан нормативный ремонт!';en='No regulatory repair specified!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗамещаемыеРемонтыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элементы.дс_ЗамещаемыеРемонты.ТекущиеДанные.ВидРемонта = Элементы.дс_НормативныеРемонты.ТекущиеДанные.ВидРемонта;
	КонецЕсли;
	 
	Если НЕ НоваяСтрока Тогда
		торо_СобытияФормКлиент.ПриНачалеРедактирования(Элемент, СтруктураДанныхДоРедактирования, Элемент.ТекущиеДанные);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗамещаемыеРемонтыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если не ОтменаРедактирования Тогда
		МодифицированностьЗамещаемыхРемонтов = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗамещаемыеРемонтыПослеУдаления(Элемент)
	МодифицированностьЗамещаемыхРемонтов = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗамещаемыеРемонтыЗамещаемыйВидРемонтаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокОтбора = Новый СписокЗначений();
	
	Для каждого Строка Из дс_НормативныеРемонты Цикл
		
		Если НЕ Элементы.дс_НормативныеРемонты.ТекущиеДанные.ВидРемонта = Строка.ВидРемонта Тогда
			СписокОтбора.Добавить(Строка.ВидРемонта);
		КонецЕсли;
		
	КонецЦикла;
	ПараметрыФормыСтруктура = Новый Структура("КлючНазначенияИспользования, СписокОтбора", "ПредшествующиеРемонты", СписокОтбора);	
	ФормаВыборка = ПолучитьФорму("Справочник.торо_ВидыРемонтов.ФормаВыбора", ПараметрыФормыСтруктура, Элемент);
	ФормаВыборка.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗамещаемыеРемонтыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекДанные = Элемент.ТекущиеДанные;
	ТекСтрока = Элемент.ТекущаяСтрока;
	ТекстОшибки = "";
	Если НЕ ОтменаРедактирования Тогда
		Если НЕ ЗначениеЗаполнено(ТекДанные.ЗамещаемыйВидРемонта) Тогда
			ТекстОшибки = НСтр("es='Indiquen el tipo de la reparación sustituida.';
			|ru='Укажите вид замещаемого ремонта.';en='Specify the type of repair being replaced.'");
		ИначеЕсли ТекДанные.ЗамещаемыйВидРемонта = ТекДанные.ВидРемонта Тогда
			ТекстОшибки = НСтр("es='¡No es posible en calidad de sustituido escoger la reparación que sustituye!';
			|ru='Нельзя в качестве замещаемого выбрать замещающий ремонт!';
			|en='Can not choose a replacement repair as a replacement!'");
		ИначеЕсли НЕ ЗначениеЗаполнено(ТекДанные.СпособЗамещения) Тогда
			ТекстОшибки = НСтр("es='Indiquen el modo de la sustitución.';
			|ru='Укажите способ замещения.';en='Specify a substitution method.'");
		Иначе
			Строки = дс_ЗамещаемыеРемонты.НайтиСтроки(Новый Структура("ВидРемонта,ЗамещаемыйВидРемонта",
			ТекДанные.ВидРемонта, ТекДанные.ЗамещаемыйВидРемонта));
			Если Строки.Количество() > 1 Тогда
				ТекстОшибки = НСтр("es='El tipo de la reparación es añadido ya en otra línea de la tabla.';
				|ru='Вид ремонта уже добавлен в другой строке таблицы.';
				|en='A repair type has already been added to another row in the table.'");
			КонецЕсли;
		КонецЕсли;
		
		Если ТекстОшибки <> "" Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки,, "дс_ЗамещаемыеРемонты",, Отказ);
		КонецЕсли;

	ИначеЕсли НЕ НоваяСтрока Тогда
		ЗаполнитьЗначенияСвойств(ТекДанные,СтруктураДанныхДоРедактирования[Элемент.Имя]);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗамещаемыеРемонтыЗамещаемыйВидРемонтаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СписокОтбора = Новый СписокЗначений;
	ТекущиеДанныеНормативов = Элементы.дс_НормативныеРемонты.ТекущиеДанные;
	Если ТекущиеДанныеНормативов <> Неопределено Тогда
		ТекущийВидРемонта = ТекущиеДанныеНормативов.ВидРемонта;
	КонецЕсли; 
	Для каждого Строка Из дс_НормативныеРемонты Цикл
		Если ТекущийВидРемонта <> Строка.ВидРемонта Тогда
			СписокОтбора.Добавить(Строка.ВидРемонта);
		КонецЕсли;
	КонецЦикла;
	ПараметрыПолученияДанных.Отбор.Вставить("Ссылка", СписокОтбора);
КонецПроцедуры

&НаКлиенте
Процедура ЗамещаемыеРемонтыЗамещаемыйВидРемонтаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	СписокОтбора = Новый СписокЗначений;
	ТекущиеДанныеНормативов = Элементы.дс_НормативныеРемонты.ТекущиеДанные;
	Если ТекущиеДанныеНормативов <> Неопределено Тогда
		ТекущийВидРемонта = ТекущиеДанныеНормативов.ВидРемонта;
	КонецЕсли; 
	Для каждого Строка Из дс_НормативныеРемонты Цикл
		Если ТекущийВидРемонта <> Строка.ВидРемонта Тогда
			СписокОтбора.Добавить(Строка.ВидРемонта);
		КонецЕсли;
	КонецЦикла;
	ПараметрыПолученияДанных.Отбор.Вставить("Ссылка", СписокОтбора);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокПараметровНаработки
&НаКлиенте
Процедура СписокПараметровНаработкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока и НЕ Копирование Тогда 
		
		Элемент.ТекущиеДанные.Период = ТекущаяДата();
		
		Если НЕ дс_ЭтоГруппа Тогда
			
			Элемент.ТекущиеДанные.КоэффициентИспользованияОборудования = 1;
			Элемент.ТекущиеДанные.ПродолжительностьПериодаПлановойНаработки = 1;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Копирование ИЛИ НоваяСтрока Тогда
		Элемент.ТекущиеДанные.ОбъектРемонта = дс_Ссылка;
	КонецЕсли;
	
	Если НЕ НоваяСтрока Тогда
		торо_СобытияФормКлиент.ПриНачалеРедактирования(Элемент, СтруктураДанныхДоРедактирования, Элемент.ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПараметровНаработкиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если НЕ ОтменаРедактирования Тогда
		
		Элемент.ТекущиеДанные.ОбъектРемонта = дс_Ссылка;
		
		Если НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.Период) Тогда
			Элемент.ТекущиеДанные.Период = ТекущаяДата();
		КонецЕсли;
		
		МодифицированностьПараметровНаработки = Истина;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПараметровНаработкиПослеУдаления(Элемент)
	МодифицированностьПараметровНаработки = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокПараметровНаработкиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекДанные = Элемент.ТекущиеДанные;
	ТекСтрока = Элемент.ТекущаяСтрока;
	ТекстОшибки = "";
	Если НЕ ОтменаРедактирования Тогда
		
		Если ЗначениеЗаполнено(ТекДанные.Показатель) Тогда
			Строки = СписокПараметровНаработки.НайтиСтроки(Новый Структура("Показатель", ТекДанные.Показатель));
			Если Строки.Количество() > 1 Тогда
				ТекстОшибки = НСтр("es='Tal índice de la elaboración planificada es dado ya en otra línea de la tabla.';
				|ru='Такой показатель плановой наработки уже задан в другой строке таблицы.';
				|en='This indicator of the planned operating time has already been set in another row of the table.'");
			КонецЕсли;
		КонецЕсли;
		
		Если ТекстОшибки <> "" Тогда
			#Если НЕ ВебКлиент Тогда
				Отказ = Истина;
			#КонецЕсли
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
		ТекДанные.Изменен = Истина;
		
	ИначеЕсли НЕ НоваяСтрока Тогда
		ЗаполнитьЗначенияСвойств(ТекДанные, СтруктураДанныхДоРедактирования[Элемент.Имя]);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПараметровНаработкиПередУдалением(Элемент, Отказ)
	
	ВыбранныеСтроки = Элемент.ВыделенныеСтроки;
	Для каждого ИдентСтроки из ВыбранныеСтроки цикл
		
		текСтрока = СписокПараметровНаработки.НайтиПоИдентификатору(ИдентСтроки);
		Если текСтрока.ОбъектРемонта <> дс_Ссылка Тогда
			ТекстСообщения = НСтр("es='¡No es posible quitar los parámetros heredados de la elaboración!';
			|ru='Нельзя удалять унаследованные параметры наработки!';en='Can not delete inherited run-time parameters!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		Иначе 
			УдалитьЗависимыеСтрокиИзТабМаксимальныхЗначенийНаработки(текСтрока.Показатель);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПараметровНаработкиПоказательОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	старыйПоказатель = Элементы.СписокПараметровНаработки.ТекущиеДанные.Показатель;
	УстановитьОтборВТабМаксимальныхЗначенийНаработки(ВыбранноеЗначение);
	Если старыйПоказатель = ВыбранноеЗначение Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьЗависимыеСтрокиИзТабМаксимальныхЗначенийНаработки(старыйПоказатель);
		 
КонецПроцедуры

&НаКлиенте
Процедура СписокПараметровНаработкиПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элементы.СписокПараметровНаработки.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда

		Если ЗначениеЗаполнено(ТекДанные.Показатель) Тогда
			Элементы.ТабМаксимальныхЗначенийНаработки.ОтборСтрок = 
				Новый ФиксированнаяСтруктура("Показатель",ТекДанные.Показатель);
		Иначе
			Элементы.ТабМаксимальныхЗначенийНаработки.ОтборСтрок = Новый ФиксированнаяСтруктура("Показатель", "---------");
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТабМаксимальныхЗначенийНаработки
&НаКлиенте
Процедура ТабМаксимальныхЗначенийНаработкиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если Не ОтменаРедактирования Тогда
		МодифицированностьМаксЗначНаработки = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТабМаксимальныхЗначенийНаработкиПоказательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	МассивПараметровНаработки = Новый Массив;
	Для Каждого Строка Из СписокПараметровНаработки Цикл
		МассивПараметровНаработки.Добавить(Строка.Показатель);
	КонецЦикла;
	ПараметрыФормы = Новый Структура("СписокПараметровНаработки", МассивПараметровНаработки);
	Форма = ПолучитьФорму("Справочник.ПараметрыВыработкиОС.ФормаВыбора", ПараметрыФормы, Элемент);
	ОткрытьФорму(Форма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабМаксимальныхЗначенийНаработкиПоказательАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СписокЗначенийПараметровНаработки = Новый СписокЗначений;
	Для Каждого Строка Из СписокПараметровНаработки Цикл
		СписокЗначенийПараметровНаработки.Добавить(Строка.Показатель);
	КонецЦикла;
	
	ДанныеВыбора = СписокЗначенийПараметровНаработки;
КонецПроцедуры

&НаКлиенте
Процедура ТабМаксимальныхЗначенийНаработкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НЕ НоваяСтрока Тогда
		торо_СобытияФормКлиент.ПриНачалеРедактирования(Элемент, СтруктураДанныхДоРедактирования, Элемент.ТекущиеДанные);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТабМаксимальныхЗначенийНаработкиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекДанные = Элементы.СписокПараметровНаработки.ТекущиеДанные;
	ТекСтрокаМаксимальногоЗначения = Элементы.ТабМаксимальныхЗначенийНаработки.ТекущиеДанные;

	Если Не ТекДанные = Неопределено 
		И Не ТекСтрокаМаксимальногоЗначения = Неопределено Тогда
		ТекСтрокаМаксимальногоЗначения.Показатель = ТекДанные.Показатель;
	КонецЕсли;
	
	ТекДанные = Элемент.ТекущиеДанные;
	ТекСтрока = Элемент.ТекущаяСтрока;
	ТекстОшибки = "";
	Если НЕ ОтменаРедактирования Тогда
		Если НЕ ЗначениеЗаполнено(ТекДанные.Показатель) Тогда
			ТекстОшибки = НСтр("es='Indiquen el índice de la elaboración.';
			|ru='Укажите показатель наработки.';en='Specify the operating time indicator.'");
		КонецЕсли;
		
		Если ТекстОшибки <> "" Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки,, "ТабМаксимальныхЗначенийНаработки",, Отказ);
		КонецЕсли;

	ИначеЕсли НЕ НоваяСтрока Тогда
		ЗаполнитьЗначенияСвойств(ТекДанные,СтруктураДанныхДоРедактирования[Элемент.Имя]);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабМаксимальныхЗначенийНаработкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ТекДанные = Элементы.СписокПараметровНаработки.ТекущиеДанные;
	
	Если Не ТекДанные = Неопределено Тогда
		МассивСтрок = ТабМаксимальныхЗначенийНаработки.НайтиСтроки(Новый Структура("Показатель", ТекДанные.Показатель));
		Если МассивСтрок.Количество() > 0 Тогда
			ШаблонСообщения = НСтр("es='Para el índice de la elaboración <%1> es introducido ya su significado máximo o "
			+ "el recurso fijado.';ru='Для показателя наработки <%1> уже введено его максимальное значение или "
			+ "назначенный ресурс.';en='For operating time indicator <%1>, its maximum value or assigned "
			+ "resource has already been entered.'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекДанные.Показатель);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
	Иначе
		ТекстСообщения = НСтр("es='de la elaboración!';ru='Не выбран показатель наработки!';"
		+ "en='No operating time indicator selected!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТабМаксимальныхЗначенийНаработкиПриИзменении(Элемент)
	ТекДанные = Элементы.СписокПараметровНаработки.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		ТекДанные.Изменен = Истина;
	КонецЕсли;
	МодифицированностьМаксЗначНаработки = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ПараметрыНаработки

&НаСервере
Функция ПроверитьЗаполненностьПараметровНаработки(ТабПараметрыНаработкиОбъектовРемонта)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	торо_ТиповыеОРНормативныеРемонты.ВидРемонта,
	|	торо_ТиповыеОРНормативныеРемонты.Ссылка КАК ТиповойОР
	|ПОМЕСТИТЬ РассчитываемыеПоНаработке
	|ИЗ
	|	Справочник.торо_ТиповыеОР.НормативныеРемонты КАК торо_ТиповыеОРНормативныеРемонты
	|ГДЕ
	|	торо_ТиповыеОРНормативныеРемонты.ВидРемонта = &ВР
	|	И торо_ТиповыеОРНормативныеРемонты.Ссылка = &Ссылка
	|	И торо_ТиповыеОРНормативныеРемонты.СпособПланирования.ИспользоватьПараметрыНаработки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Ссылка КАК ОбъектРемонта,
	|	ТабПараметрыНаработки.Показатель,
	|	ТабПараметрыНаработки.Период,
	|	ТабПараметрыНаработки.ПлановаяНаработка,
	|	ТабПараметрыНаработки.ПериодПлановойНаработки,
	|	ТабПараметрыНаработки.ПродолжительностьПериодаПлановойНаработки,
	|	ТабПараметрыНаработки.КоэффициентИспользованияОборудования
	|ПОМЕСТИТЬ
	|	ТабПараметрыНаработки
	|ИЗ
	|	&ТабПараметрыНаработки КАК ТабПараметрыНаработки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РассчитываемыеПоНаработке.ВидРемонта,
	|	торо_ПараметрыНаработкиОбъектовРемонта.Показатель
	|ПОМЕСТИТЬ ПараметрыПлановойНаработки
	|ИЗ
	|	РассчитываемыеПоНаработке КАК РассчитываемыеПоНаработке
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабПараметрыНаработки КАК торо_ПараметрыНаработкиОбъектовРемонта
	|		ПО (торо_ПараметрыНаработкиОбъектовРемонта.ОбъектРемонта = РассчитываемыеПоНаработке.ТиповойОР)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПараметрыПлановойНаработки.ВидРемонта
	|ИЗ
	|	ПараметрыПлановойНаработки КАК ПараметрыПлановойНаработки
	|ГДЕ
	|	ПараметрыПлановойНаработки.Показатель ЕСТЬ NULL ";
	Запрос.УстановитьПараметр("Ссылка", дс_Ссылка);
	Запрос.УстановитьПараметр("ВР", ВРНачалоЦикла);
	Запрос.УстановитьПараметр("ТабПараметрыНаработки", ТабПараметрыНаработкиОбъектовРемонта);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		ТекстСообщения = НСтр("es='Comprueben заполненность de los índices de la elaboración planificada.';
		|ru='Проверьте заполненность показателей плановой наработки.';
		|en='Check the completeness of the indicators of the planned operating time.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции
	
&НаСервереБезКонтекста
Функция ПолучитьТаблицуПараметровНаработки(Ссылка, Родитель)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ПараметрыНаработкиОбъектовРемонта.ОбъектРемонта,
	|	торо_ПараметрыНаработкиОбъектовРемонта.Показатель,
	|	торо_ПараметрыНаработкиОбъектовРемонта.Период,
	|	0 КАК Приоритет,
	|	торо_ПараметрыНаработкиОбъектовРемонта.ПлановаяНаработка,
	|	торо_ПараметрыНаработкиОбъектовРемонта.ПериодПлановойНаработки,
	|	торо_ПараметрыНаработкиОбъектовРемонта.ПродолжительностьПериодаПлановойНаработки,
	|	торо_ПараметрыНаработкиОбъектовРемонта.КоэффициентИспользованияОборудования
	|ПОМЕСТИТЬ ПоказателиОР
	|ИЗ
	|	РегистрСведений.торо_ПараметрыНаработкиОбъектовРемонта КАК торо_ПараметрыНаработкиОбъектовРемонта
	|ГДЕ
	|	торо_ПараметрыНаработкиОбъектовРемонта.ОбъектРемонта = &Ссылка
	|	И &СсылкаЗаполнена
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоказателиОР.ОбъектРемонта,
	|	ПоказателиОР.Показатель,
	|	ПоказателиОР.Период,
	|	ПоказателиОР.Приоритет КАК Приоритет,
	|	ПоказателиОР.ПлановаяНаработка,
	|	ПоказателиОР.ПериодПлановойНаработки,
	|	ПоказателиОР.ПродолжительностьПериодаПлановойНаработки,
	|	ПоказателиОР.КоэффициентИспользованияОборудования
	|ПОМЕСТИТЬ ВсеПоказатели
	|ИЗ
	|	ПоказателиОР КАК ПоказателиОР
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеПоказатели.ОбъектРемонта КАК ОбъектРемонта,
	|	ВсеПоказатели.Показатель,
	|	ВсеПоказатели.Период,
	|	ВсеПоказатели.Приоритет,
	|	ВсеПоказатели.ПлановаяНаработка,
	|	ВсеПоказатели.ПериодПлановойНаработки,
	|	ВсеПоказатели.ПродолжительностьПериодаПлановойНаработки,
	|	ВсеПоказатели.КоэффициентИспользованияОборудования
	|ИЗ
	|	ВсеПоказатели КАК ВсеПоказатели
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВсеПоказатели.Показатель КАК Показатель,
	|			МИНИМУМ(ВсеПоказатели.Приоритет) КАК Приоритет
	|		ИЗ
	|			ВсеПоказатели КАК ВсеПоказатели
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВсеПоказатели.Показатель) КАК ВнутреннийЗапрос
	|		ПО ВсеПоказатели.Показатель = ВнутреннийЗапрос.Показатель
	|			И ВсеПоказатели.Приоритет = ВнутреннийЗапрос.Приоритет";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("СсылкаЗаполнена", ЗначениеЗаполнено(Ссылка));
	 Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	СтруктураВозврата = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураПараметр = Новый Структура("ОбъектРемонта, Показатель, Период, Приоритет, 
											|ПлановаяНаработка, ПериодПлановойНаработки, 
											|ПродолжительностьПериодаПлановойНаработки,
											|КоэффициентИспользованияОборудования");
		ЗаполнитьЗначенияСвойств(СтруктураПараметр,Выборка);		
		СтруктураВозврата.Добавить(СтруктураПараметр);
		
	КонецЦикла;
	
	Возврат СтруктураВозврата;
		
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСписокРодителейТиповогоОбъекта(знач Ссылка)
	
	СписокРодителей = Новый СписокЗначений;
	
	Пока ЗначениеЗаполнено(Ссылка.Родитель) цикл
	   Ссылка=Ссылка.Родитель;
	   СписокРодителей.Добавить(Ссылка);
	КонецЦикла;
	Возврат СписокРодителей;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОбновитьМаксимальныеЗначенияПоказателейНаработки(ОбъектРемонта)
	
	Если ЗначениеЗаполнено(ОбъектРемонта) Тогда	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_МаксимальныеЗначенияНаработкиОР.ОбъектРемонта,
		|	торо_МаксимальныеЗначенияНаработкиОР.Показатель,
		|	торо_МаксимальныеЗначенияНаработкиОР.МаксимальноеЗначение,
		|	торо_МаксимальныеЗначенияНаработкиОР.НазначенныйРесурс
		|ИЗ
		|	РегистрСведений.торо_МаксимальныеЗначенияНаработкиОР КАК торо_МаксимальныеЗначенияНаработкиОР
		|ГДЕ
		|	торо_МаксимальныеЗначенияНаработкиОР.ОбъектРемонта = &ОбъектРемонта";
		
		Запрос.УстановитьПараметр("ОбъектРемонта", ОбъектРемонта);
		Результат = Запрос.Выполнить();
		
		Выборка = Результат.Выбрать();
		
		СтруктураВозврата = Новый Массив;
		
		Пока Выборка.Следующий() Цикл
			
			СтруктураПараметр = Новый Структура("ОбъектРемонта, Показатель, МаксимальноеЗначение, НазначенныйРесурс");
			ЗаполнитьЗначенияСвойств(СтруктураПараметр, Выборка); 
			СтруктураВозврата.Добавить(СтруктураПараметр);
			
		КонецЦикла;
		
		Возврат СтруктураВозврата;
	Иначе
		Возврат Новый Массив;
	КонецЕсли;
	
КонецФункции

&НаКлиенте 
Процедура УдалитьЗависимыеСтрокиИзТабМаксимальныхЗначенийНаработки(Показатель)
	
	стрПоиска = Новый Структура("Показатель", Показатель);
	
	НайС = СписокПараметровНаработки.НайтиСтроки(стрПоиска);
	Если НайС.количество() <= 1 тогда
		УдаляемыеСтроки = ТабМаксимальныхЗначенийНаработки.НайтиСтроки(стрПоиска);
		Для каждого текСтрока из УдаляемыеСтроки цикл
			ТабМаксимальныхЗначенийНаработки.Удалить(текСтрока);
		КонецЦикла;  		
	
		Если УдаляемыеСтроки.Количество() > 0 Тогда
			МодифицированностьМаксЗначНаработки = Истина;
		КонецЕсли; 	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
процедура УстановитьОтборВТабМаксимальныхЗначенийНаработки(Показатель = неопределено)
	
	ТекДанные = Элементы.СписокПараметровНаработки.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда

		Если ЗначениеЗаполнено(Показатель) Тогда
			Элементы.ТабМаксимальныхЗначенийНаработки.ОтборСтрок = Новый ФиксированнаяСтруктура("Показатель",
				?(ЗначениеЗаполнено(Показатель), Показатель, ТекДанные.Показатель));
		Иначе
			Элементы.ТабМаксимальныхЗначенийНаработки.ОтборСтрок = Новый ФиксированнаяСтруктура("Показатель", "---------");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнениеПараметровНаработки(Отказ)
	
	ИндексСтроки = 0;
	ШаблонСообщения = НСтр("es='En la tabla de los parámetros de la elaboración en la línea %1 no es rellenado "
		+ "el campo ""%2"".';ru='В таблице параметров наработки в строке %1 не заполнено поле ""%2"".';"
		+ "en='In the operating time table in the row% 1, the field ""% 2"" is not filled.'");
	
	СтруктураПроверяемыхПолей = Новый Структура;
	СтруктураПроверяемыхПолей.Вставить("ПродолжительностьПериодаПлановойНаработки", "Продолжительность периода плановой наработки");
	СтруктураПроверяемыхПолей.Вставить("ПериодПлановойНаработки", "Период плановой наработки");
	СтруктураПроверяемыхПолей.Вставить("ПлановаяНаработка", "Плановая наработка");
	
	Для каждого Строчка Из СписокПараметровНаработки Цикл
		Если Строчка.ОбъектРемонта <> дс_Ссылка Тогда
			ИндексСтроки = ИндексСтроки + 1;
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Строчка["Показатель"]) Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Строка(ИндексСтроки + 1), "Показатель наработки");
			ПутьКДанным = "СписокПараметровНаработки[" + ИндексСтроки + "].Показатель";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, ПутьКДанным,, Отказ);
		КонецЕсли;
		
		Если НЕ дс_ЭтоГруппа Тогда
			
			Для каждого КлючИЗначение из СтруктураПроверяемыхПолей Цикл
				Если НЕ ЗначениеЗаполнено(Строчка[КлючИЗначение.Ключ]) Тогда
					ТекстСообщения = СтрШаблон(ШаблонСообщения, Строка(ИндексСтроки+1), КлючИЗначение.Значение);
					ПутьКДанным = "СписокПараметровНаработки[" + ИндексСтроки + "]." + КлючИЗначение.Ключ;
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, ПутьКДанным,, Отказ);
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		ИндексСтроки = ИндексСтроки + 1;

	КонецЦикла;

	Если НЕ дс_ЭтоГруппа Тогда
		
		МаксимальноеЗначение = Истина;
		Для каждого Строчка Из ТабМаксимальныхЗначенийНаработки Цикл
			Если Строчка.МаксимальноеЗначение = 0 И Строчка.НазначенныйРесурс = 0 Тогда
				МаксимальноеЗначение = Ложь;
				Отказ = Истина;
			КонецЕсли;                                                               
		КонецЦикла;
		
		Если НЕ МаксимальноеЗначение Тогда
			ТекстСообщения = НСтр("es='"" o ""el recurso Fijado""';ru='Не заполнено поле ""Максимальное значение наработки"" "
			+ "или ""Назначенный ресурс""';en='The field ""Maximum operating time"" or ""Assigned resource"" is not filled'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСИзображением
&НаКлиенте
Процедура ДобавитьИзображение(Команда)
	
	Если Не ЗначениеЗаполнено(дс_Ссылка) Тогда
		ТекстВопроса = НСтр("es='Para la elección de la imagen es necesario anotar el objeto. ¿Anotar?';
		|ru='Для выбора изображения необходимо записать объект. Записать?';
		|en='To select an image, an object must be recorded. To record?'");
		Ответ = Неопределено;
		ПоказатьВопрос(Новый ОписаниеОповещения("ДобавитьИзображениеЗавершение", ЭтотОбъект), 
		ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	ДобавитьИзображениеФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКартинкуИзПрисоединенныхФайлов(Команда)
	РаботаСФайламиКлиент.ОткрытьФормуВыбораФайлов(дс_Ссылка, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьИзображение(Команда)
	
	ОчиститьСообщения();
	Если ЗначениеЗаполнено(дс_ФайлКартинки) Тогда
		РаботаСФайламиКлиент.ОткрытьФормуФайла(дс_ФайлКартинки);
	Иначе
		ТекстСообщения = НСтр("es='Falta la imagen para la redacción';
		|ru='Отсутствует изображение для редактирования';en='Missing image for editing.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "АдресКартинки");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьИзображение(Команда)
	
	дс_ФайлКартинки = ПредопределенноеЗначение("Справочник.НоменклатураПрисоединенныеФайлы.ПустаяСсылка");
	АдресКартинки = "";
	дс_Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьИзображение(Команда)
	
	ОтображатьИзображение = Не ОтображатьИзображение;
	Элементы.ФормаПоказатьСкрытьИзображение.Пометка = ОтображатьИзображение;
	Элементы.СтраницаИзображение.Видимость = ОтображатьИзображение;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если дс_Редактирование Тогда 
		ЗаблокироватьДанныеФормыДляРедактирования();
		ДобавитьИзображениеНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлКартинкиПриИзменении(Элемент)
	
	Если Не дс_ФайлКартинки.Пустая() Тогда
		АдресКартинки = НавигационнаяСсылкаКартинки(дс_ФайлКартинки, УникальныйИдентификатор);
	Иначе
		АдресКартинки = "";
	Конецесли;
	дс_Модифицированность = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НавигационнаяСсылкаКартинки(ФайлКартинки, ИдентификаторФормы)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		АдресКартинки = РаботаСФайлами.ДанныеФайла(ФайлКартинки, ИдентификаторФормы).СсылкаНаДвоичныеДанныеФайла;
	Исключение
		ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		АдресКартинки = "";
	КонецПопытки;
	
	Возврат АдресКартинки;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьИзображениеЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		 Если ЭтаФорма.ПроверитьЗаполнение() Тогда
			 Если ЭтаФорма.Записать() Тогда
				 ДобавитьИзображениеФрагмент();
			 КонецЕсли;
		 КонецЕсли;
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзображениеФрагмент()
    
    ВыборИзображения = Истина;
    ИдентификаторФайла = Новый УникальныйИдентификатор;
    
    РаботаСФайламиКлиент.ДобавитьФайлы(дс_Ссылка, ИдентификаторФайла, торо_ОбщегоНазначенияКлиентСервер.ФильтрФайловИзображений());
    ВыборИзображения = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзображениеНаКлиенте()
	
	Если Не ЗначениеЗаполнено(дс_Ссылка) Тогда
		ТекстВопроса = НСтр("es='Para la elección de la imagen es necesario anotar el objeto. ¿Anotar?';
		|ru='Для выбора изображения необходимо записать объект. Записать?';
		|en='To select an image, an object must be recorded. To record?'");
		Ответ = Неопределено;
		ПоказатьВопрос(Новый ОписаниеОповещения("ДобавитьИзображениеНаКлиентеЗавершение", ЭтотОбъект), 
		ТекстВопроса, РежимДиалогаВопрос.ДаНет);
        Возврат;
	КонецЕсли;
	
	ДобавитьИзображениеНаКлиентеФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзображениеНаКлиентеЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		 Если ЭтаФорма.ПроверитьЗаполнение() Тогда
			 Если ЭтаФорма.Записать() Тогда
				 ДобавитьИзображениеНаКлиентеФрагмент();
			 КонецЕсли;
		 КонецЕсли;
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзображениеНаКлиентеФрагмент()
    
    Перем ИдентификаторФайла;
    
    ВыборИзображения   = Истина;
    ИдентификаторФайла = Новый УникальныйИдентификатор;
    
    РаботаСФайламиКлиент.ДобавитьФайлы(дс_Ссылка, ИдентификаторФайла, 
		торо_ОбщегоНазначенияКлиентСервер.ФильтрФайловИзображений());
    ВыборИзображения   = Ложь;

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДополнительныеРеквизиты

&НаКлиенте
Процедура Подключаемый_Свойства_ЗначенияДополнительныхРеквизитовПриИзменении(Элемент)
	
	торо_УправлениеСвойствамиКлиент.Свойства_ЗначенияДополнительныхРеквизитовПриИзменении(ЭтаФорма, Элемент);
	дс_Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_Свойства_ЗначенияДополнительныхРеквизитовПриАктивизацииСтроки(Элемент)
	Если дс_Редактирование Тогда 
		торо_УправлениеСвойствамиКлиент.Свойства_ЗначенияДополнительныхРеквизитовПриАктивизацииСтроки(ЭтаФорма, Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_Свойства_ЗначенияДополнительныхРеквизитовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если дс_Редактирование И ЗначениеЗаполнено(дс_Ссылка) Тогда 
		торо_УправлениеСвойствамиКлиент.Свойства_ЗначенияДополнительныхРеквизитовПередНачаломДобавления(ЭтаФорма,
			Объект.НаборСвойствОР, Элемент, Отказ, Копирование, Родитель, Группа);
	Иначе
		СтруктураОпОп = Новый Структура("ПродолжитьРедактирование", Истина);
		ОписаниеОповещенияПослеСохранения = Новый ОписаниеОповещения("СохранитьИзмененияПослеВопроса", ЭтотОбъект, СтруктураОпОп);
		ПоказатьВопрос(ОписаниеОповещенияПослеСохранения, НСтр("ru='Необходимо записать элемент. Записать сейчас?'"),
			РежимДиалогаВопрос.ДаНет);
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_Свойства_ЗначенияДополнительныхРеквизитовПередУдалением(Элемент, Отказ)
	Если ЗначениеЗаполнено(дс_Ссылка) Тогда 
		торо_УправлениеСвойствамиКлиент.Свойства_ЗначенияДополнительныхРеквизитовПередУдалением(ЭтаФорма,
			Объект.НаборСвойствОР, Элемент, Отказ);
		дс_Модифицированность=Истина;
	Иначе
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Необходимо записать элемент'");
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_Свойства_ЗначенияДополнительныхРеквизитовПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	торо_УправлениеСвойствамиКлиент.Свойства_ЗначенияДополнительныхРеквизитовПриОкончанииРедактирования(ЭтаФорма,
		Элемент, НоваяСтрока, ОтменаРедактирования);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_Свойства_ЗначенияДополнительныхРеквизитовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если дс_Редактирование Тогда 
		торо_УправлениеСвойствамиКлиент.Свойства_ЗначенияДополнительныхРеквизитовВыбор(ЭтаФорма,
			Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
	Иначе
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзНабора(Команда)
	
	ПараметрыФормы = Новый Структура;
	
	ВыбранныеЗначения = Новый Массив;
	ПараметрыФормы.Вставить("ВыборВладельцаДополнительныхЗначений", Истина);
	
	ПараметрыФормы.Вставить("ВыбранныеЗначения", ВыбранныеЗначения);
	ПараметрыФормы.Вставить("ЭтоДополнительноеСведение", Ложь);
	ПараметрыФормы.Вставить("ТекущийНаборСвойств", Объект.НаборСвойствОР);
	
	ОткрытьФорму("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.Форма.ФормаЭлемента",
		ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область ДополнительныеРеквизиты

// СтандартныеПодсистемы.Свойства
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма,,, "НаборСвойствОР");
	торо_УправлениеСвойствами.ПроставитьПризнакОбщегоСвойстваВТаблицеДопРеквизитов(ЭтаФорма, Объект.НаборСвойствОР);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
      УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
 
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
      УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
	  дс_Модифицированность = Истина;
  КонецПроцедуры
  
 &НаСервере
Процедура ДобавитьВНаборНаСервере(Параметр)
	
	Блокировка = Новый БлокировкаДанных;	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		
		ТекущийНаборОбъект = Объект.НаборСвойствОР.ПолучитьОбъект();
		
		ТабличнаяЧасть = ТекущийНаборОбъект["ДополнительныеРеквизиты"];		
		НайденнаяСтрока = ТабличнаяЧасть.Найти(Параметр, "Свойство");
		
		Если НайденнаяСтрока = Неопределено Тогда
			НоваяСтрока = ТабличнаяЧасть.Добавить();
			НоваяСтрока.Свойство = Параметр;
			ТекущийНаборОбъект.Записать();
			
		ИначеЕсли НайденнаяСтрока.ПометкаУдаления Тогда
			НайденнаяСтрока.ПометкаУдаления = Ложь;
			ТекущийНаборОбъект.Записать();
		КонецЕсли;			
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, Объект, "НаборСвойствОР");
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

#Область Сохранение
&НаКлиенте
Процедура СохранитьИзменения(Команда)
	СохранитьИзмененияПослеВопроса(КодВозвратаДиалога.Да, Неопределено);
КонецПроцедуры

&НаСервере
Процедура ТранзакцияСохранитьНаСервере(Отказ)
	НачатьТранзакцию();
	СохранитьНаСервере(Отказ);
	Если Отказ Тогда 
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере(Отказ,ДопПараметры = Неопределено)
	//Локализация
	ПараметрыЗаписи = новый Структура();
	дс_ПередЗаписьюНаСервере(ЭтаФорма, Отказ, Объект, ПараметрыЗаписи);
	//Локализация
	
	Если дс_УровеньОбъекта = 2 Тогда 
		МассивУдаления = Новый Массив();
		Для Каждого СтрокаТаблицы Из гкс_КонструктивныйСостав Цикл
			Если ЗначениеЗаполнено(СтрокаТаблицы.Компонент) = Ложь Тогда 
				МассивУдаления.Добавить(СтрокаТаблицы);
			КонецЕсли;
		КонецЦикла;
		Для Каждого СтрокаМассива Из МассивУдаления Цикл
			гкс_КонструктивныйСостав.Удалить(гкс_КонструктивныйСостав.Индекс(СтрокаМассива));
		КонецЦикла;
	КонецЕсли;
	
	Если Не ДопПараметры = Неопределено Тогда 
		Если ДопПараметры.Свойство("ОбновитьНормативы") И ДопПараметры.ОбновитьНормативы И дс_УровеньОбъекта = 2 Тогда 
			ПодчиненныеОчиститьНормативы(дс_Ссылка, дс_НормативныеРемонты);
		КонецЕсли;
	КонецЕсли;
	
	Если дс_Модифицированность 
		ИЛИ МодифицированностьНормРемонтов 
		ИЛИ МодифицированностьПредшествующихРемонтов 
		ИЛИ МодифицированностьЗамещаемыхРемонтов Тогда 
		Если ЗначениеЗаполнено(дс_Ссылка) Тогда 
			ТекОб = дс_Ссылка.ПолучитьОбъект();
		Иначе
			Если дс_ЭтоГруппа Тогда 
				ТекОб = Справочники.торо_ТиповыеОР.СоздатьГруппу();
			Иначе
				ТекОб = Справочники.торо_ТиповыеОР.СоздатьЭлемент();
			КонецЕсли;
		КонецЕсли;
		ТекОб.Наименование = Объект.Наименование;
		Если дс_УровеньОбъекта = 3 Тогда 
			ТекОб.гкс_Модель = Объект.гкс_Модель;
			ТекОб.Направление = дс_Направление;
			ТекОб.Изготовитель = Объект.Изготовитель;
			ТекОб.ФайлКартинки = дс_ФайлКартинки;
		Иначе
			Если дс_УровеньОбъекта = 2 И Не ТекОб.Направление = дс_Направление Тогда 
				ТекОб.Направление = дс_Направление;
				дс_МодифНаправления = Истина;
			КонецЕсли;
			Для Каждого СТ ИЗ дс_НормативныеРемонты Цикл 
				СТ.Статус = Перечисления.торо_СтатусыНормативныхРемонтовИТехКарт.ВРазработке;
			КонецЦикла;
		КонецЕсли;
		ТекОб.Родитель = дс_Родитель;
		ТекОб.Комментарий = Объект.Комментарий;
		Если МодифицированностьНормРемонтов Тогда 
			ТекОб.НормативныеРемонты.Загрузить(дс_НормативныеРемонты.Выгрузить());
			ТекОб.ПредшествующиеРемонты.Загрузить(дс_ПредшествующиеРемонты.Выгрузить());
			ТекОб.ЗамещаемыеРемонты.Загрузить(дс_ЗамещаемыеРемонты.Выгрузить());
		Иначе
			Если МодифицированностьПредшествующихРемонтов Тогда 
				ТекОб.ПредшествующиеРемонты.Загрузить(дс_ПредшествующиеРемонты.Выгрузить());
			КонецЕсли;
			Если МодифицированностьЗамещаемыхРемонтов Тогда 
				ТекОб.ЗамещаемыеРемонты.Загрузить(дс_ЗамещаемыеРемонты.Выгрузить());
			КонецЕсли;
		КонецЕсли;
		Если дс_УровеньОбъекта = 2 Тогда 
			ТекОб.гкс_КонструктивныйСостав.Загрузить(гкс_КонструктивныйСостав.Выгрузить());
		КонецЕсли;
		ТемпСтрукт = Новый Структура("Свойства_ЗначенияДополнительныхРеквизитов", Неопределено);
		ЗаполнитьЗначенияСвойств(ТемпСтрукт, ЭтотОбъект);
		Если Не ТемпСтрукт.Свойства_ЗначенияДополнительныхРеквизитов = Неопределено Тогда 
			Для Каждого СтрокаТаблицы ИЗ ТемпСтрукт.Свойства_ЗначенияДополнительныхРеквизитов Цикл
				НоваяСтрока = ТекОб.ДополнительныеРеквизиты.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			КонецЦикла;
		КонецЕсли;
		// Гкс+[TOIR20-94] Борисов В.М. от 08.06.2020. Добавлено:{
		ТекОб.гкс_Критичность = Объект.гкс_Критичность;
		ТекОб.гкс_ОтветственныйИнженер = Объект.гкс_ОтветственныйИнженер;
		// } Гкс-[TOIR20-94] Борисов В.М. от 08.06.2020.
		ТекОб.Записать();
		дс_Модифицированность = Ложь;
		дс_Ссылка = ТекОб.Ссылка;
		дс_НаборСвойствОР = ТекОб.НаборСвойствОР;
		торо_УправлениеСвойствами.ЗаписатьДопРеквизитыСведенияНабора(ЭтаФорма, Отказ, "ДопРеквизит", дс_НаборСвойствОР);
		
		Если дс_МодифНаправления = Истина Тогда 
			дс_МодифНаправления = Ложь;
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	торо_ТиповыеОР.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.торо_ТиповыеОР КАК торо_ТиповыеОР
				|ГДЕ
				|	торо_ТиповыеОР.Родитель = &Родитель
				|	И НЕ торо_ТиповыеОР.Направление = &Направление";
			Запрос.УстановитьПараметр("Направление", ТекОб.Направление);
			Запрос.УстановитьПараметр("Родитель", ТекОб.Ссылка);
			РезультатЗапроса = Запрос.Выполнить();
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				ПодчиненныйТОР = Выборка.Ссылка.ПолучитьОбъект();
				ПодчиненныйТОР.Направление = ТекОб.Направление;
				ПодчиненныйТОР.Записать();
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Если МодифицированностьНормРемонтов Тогда
		
		СтруктураВозврата = ПолучитьОРиВРИзТиповогоОР2(дс_Ссылка, "НормативныеРемонты",
		"торо_НормативныеРемонтыОборудования", дс_НормативныеРемонты);
		НаборЗаписей = РегистрыСведений.торо_НормативныеРемонтыОборудования.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ТиповойОР.Установить(дс_Ссылка);
		НаборЗаписей.Прочитать();
		
		НаборЗаписей.Очистить();
		НомерСтрокиТЧ = 0;
		Для каждого Стр Из дс_НормативныеРемонты Цикл
			НомерСтрокиТЧ = НомерСтрокиТЧ + 1;
			
			Если ЗначениеЗаполнено(Стр.ВидРемонта) И ЗначениеЗаполнено(Стр.НормативныйРемонт)
				И ЗначениеЗаполнено(Стр.СпособПланирования) 
				И ЗначениеЗаполнено(Стр.ГрафикРемонтныхРабот) И ЗначениеЗаполнено(Стр.СпособВыполнения)
				И Стр.Статус = Перечисления.торо_СтатусыНормативныхРемонтовИТехКарт.Действует Тогда
				Для каждого Элем Из СтруктураВозврата Цикл
					Если Элем.ВидРемонта = Стр.ВидРемонта Тогда
						
						СтрокаНабора = НаборЗаписей.Добавить();	
						
						ЗаполнитьЗначенияСвойств(СтрокаНабора, Элем);
						ЗаполнитьЗначенияСвойств(СтрокаНабора, Стр);
						
						СтрокаНабора.ТиповойОР = дс_Ссылка; 
					КонецЕсли; 
				КонецЦикла;
			ИначеЕсли Стр.Статус = Перечисления.торо_СтатусыНормативныхРемонтовИТехКарт.Действует Тогда  
				Если НЕ ЗначениеЗаполнено(Стр.ВидРемонта) Тогда
					ТекстСообщения = НСтр("es='No consiguió anotar las reparaciones normativas: no es rellenado el campo ""el"
					+ " Tipo de la reparación"" en la línea № ';ru='Не удалось записать нормативные ремонты: не заполнено поле"
					+ " ""Вид ремонта"" в строке № ';en='Failed to record standard repairs: the field"
					+ " “Type of repair” in line № is not filled '") + НомерСтрокиТЧ;
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(Стр.НормативныйРемонт) Тогда
					ТекстСообщения = НСтр("es='No consiguió anotar las reparaciones normativas: no es rellenado el campo"
					+ " ""la tarjeta Tecnológica"" en la línea № ';ru='Не удалось записать нормативные ремонты: не заполнено"
					+ " поле ""Технологическая карта"" в строке № ';en='Failed to record normative repairs: the “Route map” "
					+ "field in row № is not filled '") + НомерСтрокиТЧ;
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(Стр.СпособПланирования) Тогда
					ТекстСообщения = НСтр("es='No consiguió anotar las reparaciones normativas: no es rellenado el campo"
					+ " ""el Modo de la planificación"" en la línea № ';ru='Не удалось записать нормативные ремонты: не "
					+ "заполнено поле ""Способ планирования"" в строке № ';en='Failed to record standard repairs: the"
					+ " ""Planning method"" field in row № is not filled '") + НомерСтрокиТЧ;
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(Стр.ГрафикРемонтныхРабот) Тогда
					ТекстСообщения = НСтр("es='No consiguió anotar las reparaciones normativas: no es rellenado el campo"
					+ " ""el Gráfico de los trabajos de reparación"" en la línea № ';ru='Не удалось записать нормативные ремонты:"
					+ " не заполнено поле ""График ремонтных работ"" в строке № ';en='Failed to record normative repairs: the"
					+ " ""Repair schedule"" field is not filled in line № '") + НомерСтрокиТЧ;
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(Стр.СпособВыполнения) Тогда
					ТекстСообщения = НСтр("es='No consiguió anotar las reparaciones normativas: no es rellenado el campo ""el"
					+ " Modo de la ejecución"" en la línea № ';ru='Не удалось записать нормативные ремонты: не заполнено поле"
					+ " ""Способ выполнения"" в строке № ';en='Failed to record standard repairs: the ""Execution method"" "
					+ "field in row № is not filled '") + НомерСтрокиТЧ;
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				КонецЕсли;
				Если Не ЗначениеЗаполнено(Стр.СпособУчетаДатыОтсчета) Тогда
					ТекстСообщения = НСтр("es='No consiguió anotar las reparaciones normativas: no es rellenado el campo ""el"
					+ " Modo del recuento de la fecha de la lectura"" en la línea № ';ru='Не удалось записать нормативные "
					+ "ремонты: не заполнено поле ""Способ учета даты отсчета"" в строке № ';en='Failed to record normative"
					+ " repairs: the ""Method for counting the reference date"" field in row № is not filled '") + НомерСтрокиТЧ;
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				КонецЕсли;
			КонецЕсли;
			Если Отказ Тогда 
				Прервать;
			КонецЕсли;
		КонецЦикла; 
		Если Отказ = Ложь Тогда 
			НаборЗаписей.Записать();
			
			МодифицированностьНормРемонтов = Ложь;
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если МодифицированностьИзмеряемыхПоказателей Тогда 
		НаборЗаписей = РегистрыСведений.торо_ИзмеряемыеПоказателиОбъектовРемонта.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ОбъектРемонта.Установить(дс_Ссылка);		
		НаборЗаписей.Прочитать();
		
		Для каждого СтрокаПоказателя из дс_СписокИзмеряемыхПоказателей Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаПоказателя.ОбъектРемонта) Тогда
				СтрокаПоказателя.ОбъектРемонта = дс_Ссылка;
			КонецЕсли;
		КонецЦикла;
		
		МассивСтрок = дс_СписокИзмеряемыхПоказателей.НайтиСтроки(Новый Структура("ОбъектРемонта", дс_Ссылка));
		НаборЗаписей.Загрузить(дс_СписокИзмеряемыхПоказателей.Выгрузить(МассивСтрок));
		
		НаборЗаписей.Записать();
		
		// Удалим из регистра строки, которые были удалены для конкретных ОР.
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ИзмеряемыеПоказателиОбъектовРемонта.ОбъектРемонта,
		|	ИзмеряемыеПоказателиОбъектовРемонта.Показатель КАК Показатель
		|ИЗ
		|	(ВЫБРАТЬ
		|		торо_ОбъектыРемонта.Ссылка КАК Ссылка
		|	ИЗ
		|		Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|	ГДЕ
		|		торо_ОбъектыРемонта.ТиповойОР = &ТиповойОР) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИзмеряемыеПоказателиОбъектовРемонта 
		|	КАК ИзмеряемыеПоказателиОбъектовРемонта
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИзмеряемыеПоказателиОбъектовРемонта КАК ИзмеряемыеПоказателиТиповыхОР
		|			ПО ИзмеряемыеПоказателиОбъектовРемонта.Показатель = ИзмеряемыеПоказателиТиповыхОР.Показатель
		|				И (ИзмеряемыеПоказателиТиповыхОР.ОбъектРемонта = &ТиповойОР)
		|		ПО (ВложенныйЗапрос.Ссылка = (ВЫРАЗИТЬ(ИзмеряемыеПоказателиОбъектовРемонта.ОбъектРемонта 
		|	КАК Справочник.торо_ОбъектыРемонта)))
		|ГДЕ
		|	ИзмеряемыеПоказателиОбъектовРемонта.Удален
		|	И ИзмеряемыеПоказателиТиповыхОР.Показатель ЕСТЬ NULL 
		|ИТОГИ ПО
		|	Показатель";
		Запрос.УстановитьПараметр("ТиповойОР", дс_Ссылка);
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			ВыборкаПоказатели = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоказатели.Следующий() Цикл
				НаборЗаписей = РегистрыСведений.торо_ИзмеряемыеПоказателиОбъектовРемонта.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Показатель.Установить(ВыборкаПоказатели.Показатель);
				НаборЗаписей.Прочитать();
				ВыборкаДетЗаписи = ВыборкаПоказатели.Выбрать();
				МассивУдаляемых = Новый Массив;
				Для Каждого Запись Из НаборЗаписей Цикл
					Если ВыборкаДетЗаписи.НайтиСледующий(Новый Структура("ОбъектРемонта,Показатель", Запись.ОбъектРемонта, Запись.Показатель)) Тогда
						МассивУдаляемых.Добавить(Запись);
					КонецЕсли;
					ВыборкаДетЗаписи.Сбросить();
				КонецЦикла;
				Для Каждого ЭлМассива Из МассивУдаляемых Цикл
					НаборЗаписей.Удалить(ЭлМассива);
				КонецЦикла;
				НаборЗаписей.Записать();
			КонецЦикла;
		КонецЕсли;
		МодифицированностьИзмеряемыхПоказателей = Ложь;
	КонецЕсли;
	
	Если МодифицированностьПараметровОповещенияОСостоянииОР Тогда
		
		Для каждого Строка из ПараметрыОповещенияПоСостояниямОР Цикл
			Если НЕ ЗначениеЗаполнено(Строка.ОбъектРемонта) Тогда
				Строка.ОбъектРемонта = дс_Ссылка;
			КонецЕсли;
		КонецЦикла;
		
		Попытка
			НаборПараметровОповещения = РегистрыСведений.торо_ПараметрыОповещенияОСостоянииОборудования.СоздатьНаборЗаписей();
			НаборПараметровОповещения.Отбор.ТиповойОР.Установить(дс_Ссылка);
			НайденныеСтроки = ПараметрыОповещенияПоСостояниямОР.НайтиСтроки(Новый Структура("ТиповойОР",
				Справочники.торо_ТиповыеОР.ПустаяСсылка()));
			Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				НайденнаяСтрока.ТиповойОР = дс_Ссылка;
			КонецЦикла;
			МассивСтрок = ПараметрыОповещенияПоСостояниямОР.НайтиСтроки(Новый Структура("ТиповойОР", дс_Ссылка));
			НаборПараметровОповещения.Загрузить(ПараметрыОповещенияПоСостояниямОР.Выгрузить(МассивСтрок));			
			НаборПараметровОповещения.Записать();
			МодифицированностьПараметровОповещенияОСостоянииОР = Ложь;
		Исключение
			ТекстСообщения = НСтр("es='No consiguió anotar los parámetros del aviso sobre el estado de la maquinaria: '
			|;ru='Не удалось записать параметры оповещения о состоянии оборудования: ';
			|en='Failed to record equipment status alert parameters: '") + ОписаниеОшибки();
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			Отказ = Истина;
			Возврат;
		КонецПопытки;
		
	КонецЕсли;
	
	Если МодифицированностьПредшествующихРемонтов ИЛИ МодифицированностьНормРемонтов Тогда
		
		НаборЗаписей = РегистрыСведений.торо_ПредшествующиеНормативныеРемонтыОборудования.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ТиповойОР.Установить(дс_Ссылка);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		
		СтруктураВозврата = ПолучитьОРиВРИзТиповогоОР2(дс_Ссылка, "ПредшествующиеРемонты",
		"торо_ПредшествующиеНормативныеРемонтыОборудования", дс_ПредшествующиеРемонты); 
		ТЗПредшествующих = ПолучитьПредшествующиеИлиНормативные("ПредшествующийВидРемонта",
		дс_НормативныеРемонты, дс_ПредшествующиеРемонты, Неопределено);
		
		Для каждого Стр Из ТЗПредшествующих Цикл
			Для каждого Элем Из СтруктураВозврата Цикл
				Если Элем.ВидРемонта = Стр.ВидРемонта Тогда
					
					СтрокаНабора = НаборЗаписей.Добавить();	
					ЗаполнитьЗначенияСвойств(СтрокаНабора, Элем);
					ЗаполнитьЗначенияСвойств(СтрокаНабора, Стр);
					СтрокаНабора.Приоритет = Элем.Приоритет;
					СтрокаНабора.ТиповойОР = дс_Ссылка;
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла; 
		
		НаборЗаписей.Записать();
		
		Если Не Отказ Тогда     			
			МодифицированностьПредшествующихРемонтов = Ложь;			
		иначе
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если МодифицированностьЗамещаемыхРемонтов ИЛИ МодифицированностьНормРемонтов Тогда
		СтруктураВозврата = ПолучитьОРиВРИзТиповогоОР2(дс_Ссылка, "ЗамещаемыеРемонты","торо_ПараметрыЗамещенияПланированияРемонтныхРабот", дс_ЗамещаемыеРемонты); 
		НаборЗаписей = РегистрыСведений.торо_ПараметрыЗамещенияПланированияРемонтныхРабот.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ТиповойОР.Установить(дс_Ссылка);
		НаборЗаписей.Прочитать();
		
		НаборЗаписей.Очистить();
		
		ТЗЗамещаемых = ПолучитьПредшествующиеИлиНормативные("ЗамещаемыйВидРемонта", 
			дс_НормативныеРемонты, Неопределено, дс_ЗамещаемыеРемонты);
		
		Для каждого Стр Из ТЗЗамещаемых Цикл
			Для каждого Элем Из СтруктураВозврата Цикл
				Если Элем.ВидРемонта = Стр.ВидРемонта Тогда
					СтрокаНабора = НаборЗаписей.Добавить();	
					ЗаполнитьЗначенияСвойств(СтрокаНабора, Элем);
					ЗаполнитьЗначенияСвойств(СтрокаНабора, Стр);
					СтрокаНабора.Приоритет = Элем.Приоритет;
					СтрокаНабора.ТиповойОР = дс_Ссылка;
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла; 
		
		НаборЗаписей.Записать();
		Если Не Отказ Тогда
			МодифицированностьЗамещаемыхРемонтов = Ложь;		
		Иначе
			Возврат;
		КонецЕсли;

	КонецЕсли;
	
	Если МодифицированностьПараметровНаработки Тогда
		
		Для каждого Строка из СписокПараметровНаработки Цикл
			Если НЕ ЗначениеЗаполнено(Строка.ОбъектРемонта) Тогда
				Строка.ОбъектРемонта = дс_Ссылка;
			КонецЕсли;
		КонецЦикла;
		
		Попытка
			ТаблицаЗначенийПараметровНаработки = СписокПараметровНаработки.Выгрузить();
			МассивСтрокПараметров = ТаблицаЗначенийПараметровНаработки.НайтиСтроки(Новый Структура("ОбъектРемонта", дс_Ссылка));
			ТаблицаБуфер = ТаблицаЗначенийПараметровНаработки.Скопировать(МассивСтрокПараметров);
			
			НаборПараметровНаработки = РегистрыСведений.торо_ПараметрыНаработкиОбъектовРемонта.СоздатьНаборЗаписей();
			НаборПараметровНаработки.Отбор.ОбъектРемонта.Установить(дс_Ссылка);
			НаборПараметровНаработки.Загрузить(ТаблицаБуфер);
			НаборПараметровНаработки.Записать();
			
		Исключение
			
			ТекстСообщения = НСтр("es='No consiguió anotar los parámetros de la elaboración: ';
			|ru='Не удалось записать параметры наработки: ';en='Failed to write running hours: '") + ОписаниеОшибки();
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			Возврат;
			
		КонецПопытки;
		Если Не Отказ Тогда 
			МодифицированностьПараметровНаработки = Ложь;
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если МодифицированностьМаксЗначНаработки Тогда
		
		ТабМаксЗнач = ТабМаксимальныхЗначенийНаработки.Выгрузить();
		ТабМаксЗнач.ЗаполнитьЗначения(дс_Ссылка, "ОбъектРемонта");
		
		НаборКонтролируемыхПоказателей = РегистрыСведений.торо_МаксимальныеЗначенияНаработкиОР.СоздатьНаборЗаписей();
		НаборКонтролируемыхПоказателей.Отбор.ОбъектРемонта.Установить(дс_Ссылка);
		НаборКонтролируемыхПоказателей.Загрузить(ТабМаксЗнач);
		НаборКонтролируемыхПоказателей.Записать();		
		
		МодифицированностьМаксЗначНаработки = Ложь;
	КонецЕсли;
	//
	Если Не ДопПараметры = Неопределено Тогда 
		Если ДопПараметры.Свойство("ОбновитьНормативы") И ДопПараметры.ОбновитьНормативы И дс_УровеньОбъекта = 2 Тогда 
			ПодчиненныеОбновитьНормативы(дс_Ссылка);
		КонецЕсли;
		Если ДопПараметры.Свойство("ОбновитьПоказатели") И ДопПараметры.ОбновитьПоказатели И Не дс_УровеньОбъекта = 3 Тогда 
			ПодчиненныеОбновитьПоказатели(дс_Ссылка,дс_СписокИзмеряемыхПоказателей,
				дс_СписокИзмеряемыхПоказателейДоИзменения, Отказ);
		КонецЕсли;
		Если ДопПараметры.Свойство("ОбновитьНаработку") И ДопПараметры.ОбновитьНаработку И Не дс_УровеньОбъекта = 3 Тогда 
			ПодчиненныеОбновитьНаработку(дс_Ссылка, СписокПараметровНаработки, СписокПараметровНаработкиДоИзменения, Отказ);
		КонецЕсли;
	КонецЕсли;
	//Локализация
	торо_ЛокализацияСобытияФорм.ПослеЗаписиНаСервере(ЭтаФорма,, ПараметрыЗаписи, дс_Ссылка);
	//Локализация
КонецПроцедуры
// 
&НаСервереБезКонтекста
Процедура ПодчиненныеОчиститьНормативы(Ссылка, ТЧ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧ.ВидРемонта КАК ВидРемонта,
		|	ТЧ.СпособПланирования КАК СпособПланирования
		|ПОМЕСТИТЬ ТчНовые
		|ИЗ
		|	&ТЧ КАК ТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ТиповыеОРНормативныеРемонты.ВидРемонта КАК ВидРемонта
		|ПОМЕСТИТЬ Нормативы
		|ИЗ
		|	Справочник.торо_ТиповыеОР.НормативныеРемонты КАК торо_ТиповыеОРНормативныеРемонты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТчНовые КАК ТчНовые
		|		ПО торо_ТиповыеОРНормативныеРемонты.ВидРемонта = ТчНовые.ВидРемонта
		|ГДЕ
		|	торо_ТиповыеОРНормативныеРемонты.Ссылка = &Ссылка
		|	И (ТчНовые.ВидРемонта ЕСТЬ NULL
		|			ИЛИ НЕ торо_ТиповыеОРНормативныеРемонты.СпособПланирования = ТчНовые.СпособПланирования)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_ТиповыеОРНормативныеРемонты.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ИзменяемыеТОР
		|ИЗ
		|	Справочник.торо_ТиповыеОР.НормативныеРемонты КАК торо_ТиповыеОРНормативныеРемонты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Нормативы КАК Нормативы
		|		ПО торо_ТиповыеОРНормативныеРемонты.ВидРемонта = Нормативы.ВидРемонта
		|ГДЕ
		|	торо_ТиповыеОРНормативныеРемонты.Ссылка.Родитель = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ТиповыеОРНормативныеРемонты.Ссылка КАК Ссылка,
		|	торо_ТиповыеОРНормативныеРемонты.ВидРемонта КАК ВидРемонта,
		|	торо_ТиповыеОРНормативныеРемонты.НормативныйРемонт КАК НормативныйРемонт,
		|	торо_ТиповыеОРНормативныеРемонты.СпособПланирования КАК СпособПланирования,
		|	торо_ТиповыеОРНормативныеРемонты.Статус КАК Статус,
		|	торо_ТиповыеОРНормативныеРемонты.ГрафикРемонтныхРабот КАК ГрафикРемонтныхРабот,
		|	торо_ТиповыеОРНормативныеРемонты.СпособВыполнения КАК СпособВыполнения,
		|	торо_ТиповыеОРНормативныеРемонты.НеИспользоватьВПланированииДатуВводаВЭксплуатацию 
		|	КАК НеИспользоватьВПланированииДатуВводаВЭксплуатацию,
		|	торо_ТиповыеОРНормативныеРемонты.СпособУчетаДатыОтсчета КАК СпособУчетаДатыОтсчета,
		|	торо_ТиповыеОРНормативныеРемонты.НеУчаствуетВПланировании КАК НеУчаствуетВПланировании,
		|	торо_ТиповыеОРНормативныеРемонты.РазрешитьСокращатьМежремонтныйПериодПриПланировании 
		|	КАК РазрешитьСокращатьМежремонтныйПериодПриПланировании,
		|	торо_ТиповыеОРНормативныеРемонты.НеУчитыватьПриПланированииГрафикРаботыОборудования 
		|	КАК НеУчитыватьПриПланированииГрафикРаботыОборудования,
		|	торо_ТиповыеОРНормативныеРемонты.НеУчитыватьПриПланированииГрафикРемонтныхРабот 
		|	КАК НеУчитыватьПриПланированииГрафикРемонтныхРабот,
		|	торо_ТиповыеОРНормативныеРемонты.НеУчитыватьПродолжительность КАК НеУчитыватьПродолжительность,
		|	торо_ТиповыеОРНормативныеРемонты.УчитыватьПростоиОборудования КАК УчитыватьПростоиОборудования,
		|	торо_ТиповыеОРНормативныеРемонты.ИспользоватьКоэффициентыРемонтныхОсобенностей 
		|	КАК ИспользоватьКоэффициентыРемонтныхОсобенностей,
		|	НЕ Нормативы.ВидРемонта ЕСТЬ NULL КАК Лишний
		|ИЗ
		|	ИзменяемыеТОР КАК ИзменяемыеТОР
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТиповыеОР.НормативныеРемонты КАК торо_ТиповыеОРНормативныеРемонты
		|			ЛЕВОЕ СОЕДИНЕНИЕ Нормативы КАК Нормативы
		|			ПО торо_ТиповыеОРНормативныеРемонты.ВидРемонта = Нормативы.ВидРемонта
		|		ПО (торо_ТиповыеОРНормативныеРемонты.Ссылка = ИзменяемыеТОР.Ссылка)
		|ИТОГИ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ТиповыеОРПредшествующиеРемонты.ВидРемонта КАК ВидРемонта,
		|	торо_ТиповыеОРПредшествующиеРемонты.ПредшествующийВидРемонта КАК ПредшествующийВидРемонта,
		|	торо_ТиповыеОРПредшествующиеРемонты.Ссылка КАК Ссылка,
		|	НЕ Нормативы.ВидРемонта ЕСТЬ NULL КАК Лишний
		|ИЗ
		|	Справочник.торо_ТиповыеОР.ПредшествующиеРемонты КАК торо_ТиповыеОРПредшествующиеРемонты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИзменяемыеТОР КАК ИзменяемыеТОР
		|		ПО торо_ТиповыеОРПредшествующиеРемонты.Ссылка = ИзменяемыеТОР.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Нормативы КАК Нормативы
		|		ПО торо_ТиповыеОРПредшествующиеРемонты.ВидРемонта = Нормативы.ВидРемонта
		|ИТОГИ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ТиповыеОРЗамещаемыеРемонты.ВидРемонта КАК ВидРемонта,
		|	торо_ТиповыеОРЗамещаемыеРемонты.ЗамещаемыйВидРемонта КАК ЗамещаемыйВидРемонта,
		|	торо_ТиповыеОРЗамещаемыеРемонты.СпособЗамещения КАК СпособЗамещения,
		|	торо_ТиповыеОРЗамещаемыеРемонты.НачальнаяГраница КАК НачальнаяГраница,
		|	торо_ТиповыеОРЗамещаемыеРемонты.КонечнаяГраница КАК КонечнаяГраница,
		|	торо_ТиповыеОРЗамещаемыеРемонты.Ссылка КАК Ссылка,
		|	НЕ Нормативы.ВидРемонта ЕСТЬ NULL КАК Лишний
		|ИЗ
		|	Справочник.торо_ТиповыеОР.ЗамещаемыеРемонты КАК торо_ТиповыеОРЗамещаемыеРемонты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИзменяемыеТОР КАК ИзменяемыеТОР
		|		ПО торо_ТиповыеОРЗамещаемыеРемонты.Ссылка = ИзменяемыеТОР.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Нормативы КАК Нормативы
		|		ПО торо_ТиповыеОРЗамещаемыеРемонты.ВидРемонта = Нормативы.ВидРемонта
		|ИТОГИ ПО
		|	Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ТЧ", ТЧ.Выгрузить(, "ВидРемонта,СпособПланирования"));
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаСсылка = РезультатЗапроса[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ПредНормативы = РезультатЗапроса[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ПостНормативы = РезультатЗапроса[5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСсылка.Следующий() Цикл
		ТекОб = ВыборкаСсылка.Ссылка.ПолучитьОбъект();
		ТекОб.НормативныеРемонты.Очистить();
		Выборка = ВыборкаСсылка.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Не Выборка.Лишний Тогда 
				НоваяСтрока = ТекОб.НормативныеРемонты.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			КонецЕсли;
		КонецЦикла;
		
		ТекОб.ПредшествующиеРемонты.Очистить();
		Если ПредНормативы.НайтиСледующий(Новый Структура("Ссылка", ВыборкаСсылка.Ссылка)) Тогда 
			Выборка = ПредНормативы.Выбрать();
			Пока Выборка.Следующий() Цикл
				Если Не Выборка.Лишний Тогда 
					НоваяСтрока = ТекОб.ПредшествующиеРемонты.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		ПредНормативы.Сбросить();
		
		ТекОб.ЗамещаемыеРемонты.Очистить();
		Если ПостНормативы.НайтиСледующий(Новый Структура("Ссылка", ВыборкаСсылка.Ссылка)) Тогда 
			Выборка = ПостНормативы.Выбрать();
			Пока Выборка.Следующий() Цикл
				Если Не Выборка.Лишний Тогда 
					НоваяСтрока = ТекОб.ЗамещаемыеРемонты.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		ПостНормативы.Сбросить();
		//
		ТекОб.Записать();
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПодчиненныеОбновитьНормативы(Ссылка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ТиповыеОРНормативныеРемонты.ВидРемонта КАК ВидРемонта,
		|	торо_ТиповыеОРНормативныеРемонты.СпособПланирования КАК СпособПланирования,
		|	торо_ТиповыеОРНормативныеРемонты.ГрафикРемонтныхРабот КАК ГрафикРемонтныхРабот,
		|	торо_ТиповыеОРНормативныеРемонты.СпособВыполнения КАК СпособВыполнения,
		|	торо_ТиповыеОРНормативныеРемонты.СпособУчетаДатыОтсчета КАК СпособУчетаДатыОтсчета
		|ПОМЕСТИТЬ Нормативы
		|ИЗ
		|	Справочник.торо_ТиповыеОР.НормативныеРемонты КАК торо_ТиповыеОРНормативныеРемонты
		|ГДЕ
		|	торо_ТиповыеОРНормативныеРемонты.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_ТиповыеОР.Ссылка КАК Ссылка,
		|	Нормативы.ВидРемонта КАК ВидРемонта,
		|	Нормативы.СпособПланирования КАК СпособПланирования,
		|	Нормативы.ГрафикРемонтныхРабот КАК ГрафикРемонтныхРабот,
		|	Нормативы.СпособВыполнения КАК СпособВыполнения,
		|	Нормативы.СпособУчетаДатыОтсчета КАК СпособУчетаДатыОтсчета
		|ПОМЕСТИТЬ НужныеТОР
		|ИЗ
		|	Справочник.торо_ТиповыеОР КАК торо_ТиповыеОР,
		|	Нормативы КАК Нормативы
		|ГДЕ
		|	торо_ТиповыеОР.Родитель = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НужныеТОР.Ссылка КАК Ссылка,
		|	НужныеТОР.ВидРемонта КАК ВидРемонта,
		|	НужныеТОР.СпособПланирования КАК СпособПланирования,
		|	ЕСТЬNULL(торо_ТиповыеОРНормативныеРемонты.НомерСтроки, -1) КАК НомерСтроки,
		|	ЕСТЬNULL(торо_ТиповыеОРНормативныеРемонты.Статус, &Статус) КАК Статус,
		|	торо_ТиповыеОРНормативныеРемонты.СпособПланирования ЕСТЬ NULL
		|		ИЛИ НЕ торо_ТиповыеОРНормативныеРемонты.СпособПланирования = НужныеТОР.СпособПланирования КАК Изменение,
		|	НужныеТОР.ГрафикРемонтныхРабот КАК ГрафикРемонтныхРабот,
		|	НужныеТОР.СпособВыполнения КАК СпособВыполнения,
		|	НужныеТОР.СпособУчетаДатыОтсчета КАК СпособУчетаДатыОтсчета
		|ИЗ
		|	НужныеТОР КАК НужныеТОР
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ТиповыеОР.НормативныеРемонты КАК торо_ТиповыеОРНормативныеРемонты
		|		ПО НужныеТОР.Ссылка = торо_ТиповыеОРНормативныеРемонты.Ссылка
		|			И НужныеТОР.ВидРемонта = торо_ТиповыеОРНормативныеРемонты.ВидРемонта
		|ИТОГИ
		|	МАКСИМУМ(Изменение)
		|ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НужныеТОР.Ссылка КАК Ссылка,
		|	НужныеТОР.ВидРемонта КАК ВидРемонта,
		|	ЕСТЬNULL(торо_ТиповыеОРПредшествующиеРемонты.ПредшествующийВидРемонта, НужныеТОР.ВидРемонта)
		|	КАК ПредшествующийВидРемонта,
		|	ЕСТЬNULL(торо_ТиповыеОРПредшествующиеРемонты.НомерСтроки, -1) КАК НомерСтроки
		|ИЗ
		|	НужныеТОР КАК НужныеТОР
		|		Левое СОЕДИНЕНИЕ Справочник.торо_ТиповыеОР.ПредшествующиеРемонты КАК торо_ТиповыеОРПредшествующиеРемонты
		|		ПО НужныеТОР.Ссылка = торо_ТиповыеОРПредшествующиеРемонты.Ссылка
		|			И НужныеТОР.ВидРемонта = торо_ТиповыеОРПредшествующиеРемонты.ВидРемонта
		|ИТОГИ ПО
		|	Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Статус", Перечисления.торо_СтатусыНормативныхРемонтовИТехКарт.ВРазработке);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ИндексОсновногоПакета = 2;
	ИндексДополнительногоПакета = 3;
	Выборка1 = РезультатЗапроса[ИндексОсновногоПакета].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Выборка2 = РезультатЗапроса[ИндексДополнительногоПакета].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка1.Следующий() Цикл
		Если Выборка1.Изменение = Ложь Тогда 
			Продолжить;
		КонецЕсли;
		
		НачатьТранзакцию();
		Попытка
			ТекОб = Выборка1.Ссылка.ПолучитьОбъект();
			Выборка = Выборка1.Выбрать();
			Пока Выборка.Следующий() Цикл
				Если Выборка.НомерСтроки = -1 Тогда 
					НоваяСтрока = ТекОб.НормативныеРемонты.Добавить();
				Иначе
					НоваяСтрока = ТекОб.НормативныеРемонты[Выборка.НомерСтроки - 1];
				КонецЕсли;
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			КонецЦикла;
			
			Если Выборка2.НайтиСледующий(Новый Структура("Ссылка", Выборка1.Ссылка)) Тогда 
				Выборка = Выборка2.Выбрать();
				Пока Выборка.Следующий() Цикл
					Если Выборка.НомерСтроки = -1 Тогда 
						НоваяСтрока = ТекОб.ПредшествующиеРемонты.Добавить();
					Иначе
						НоваяСтрока = ТекОб.ПредшествующиеРемонты[Выборка.НомерСтроки - 1];
					КонецЕсли;
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				КонецЦикла;
			КонецЕсли;
			Выборка2.Сбросить();
			//
			Отказ = Ложь;
			ЗаписатьНормативы(Выборка1.Ссылка, ТекОб.НормативныеРемонты, Отказ);
			Если Не Отказ Тогда 
				ЗаписатьПредшествующие(Ссылка, ТекОб.НормативныеРемонты, ТекОб.ПредшествующиеРемонты, Отказ);
			КонецЕсли;
			Если Не Отказ Тогда 
				ЗаписатьЗамещаемые(Ссылка, ТекОб.НормативныеРемонты, ТекОб.ЗамещаемыеРемонты, Отказ);
			КонецЕсли;
			Если Отказ Тогда 
				ОтменитьТранзакцию();
				Продолжить;
			КонецЕсли;
			//
			ТекОб.Записать();
			ЗафиксироватьТранзакцию();
		Исключение
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = ОписаниеОшибки();
			Сообщение.Сообщить();
			ОтменитьТранзакцию();
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьНормативы(Ссылка, ТЧ, Отказ)
	СтруктураВозврата = ПолучитьОРиВРИзТиповогоОР2(Ссылка, "НормативныеРемонты",
		"торо_НормативныеРемонтыОборудования", ТЧ);
		НаборЗаписей = РегистрыСведений.торо_НормативныеРемонтыОборудования.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ТиповойОР.Установить(Ссылка);
		НомерСтрокиТЧ = 0;
		Для каждого Стр Из ТЧ Цикл
			НомерСтрокиТЧ = НомерСтрокиТЧ + 1;
			
			Если ЗначениеЗаполнено(Стр.ВидРемонта) И ЗначениеЗаполнено(Стр.НормативныйРемонт)
					И ЗначениеЗаполнено(Стр.СпособПланирования) 
				И ЗначениеЗаполнено(Стр.ГрафикРемонтныхРабот) И ЗначениеЗаполнено(Стр.СпособВыполнения)
				И Стр.Статус = Перечисления.торо_СтатусыНормативныхРемонтовИТехКарт.Действует Тогда
				Для каждого Элем Из СтруктураВозврата Цикл
					Если Элем.ВидРемонта = Стр.ВидРемонта Тогда
						
						СтрокаНабора = НаборЗаписей.Добавить();	
						
						ЗаполнитьЗначенияСвойств(СтрокаНабора, Элем);
						ЗаполнитьЗначенияСвойств(СтрокаНабора, Стр);
						
						СтрокаНабора.ТиповойОР = Ссылка; 
					КонецЕсли; 
				КонецЦикла;
			ИначеЕсли Стр.Статус = Перечисления.торо_СтатусыНормативныхРемонтовИТехКарт.Действует Тогда  
				Если НЕ ЗначениеЗаполнено(Стр.ВидРемонта) Тогда
					ТекстСообщения = НСтр("es='No consiguió anotar las reparaciones normativas: no es rellenado el campo ""el Tipo"
					+ " de la reparación"" en la línea № ';ru='Не удалось записать нормативные ремонты: не заполнено поле"
					+ " ""Вид ремонта"" в строке № ';en='Failed to record standard repairs: the field “Type "
					+ "of repair” in line № is not filled '") + НомерСтрокиТЧ;
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(Стр.НормативныйРемонт) Тогда
					ТекстСообщения = НСтр("es='No consiguió anotar las reparaciones normativas: no es rellenado el campo ""la tarjeta"
					+ " Tecnológica"" en la línea № ';ru='Не удалось записать нормативные ремонты: не заполнено поле"
					+ " ""Технологическая карта"" в строке № ';en='Failed to record normative repairs: "
					+ "the “Route map” field in row № is not filled '") + НомерСтрокиТЧ;
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(Стр.СпособПланирования) Тогда
					ТекстСообщения = НСтр("es='No consiguió anotar las reparaciones normativas: no es rellenado el campo ""el Modo"
					+ " de la planificación"" en la línea № ';ru='Не удалось записать нормативные ремонты: не заполнено поле"
					+ " ""Способ планирования"" в строке № ';en='Failed to record standard repairs: the ""Planning method"" field"
					+ " in row № is not filled '") + НомерСтрокиТЧ;
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(Стр.ГрафикРемонтныхРабот) Тогда
					ТекстСообщения = НСтр("es='No consiguió anotar las reparaciones normativas: no es rellenado el campo ""el"
					+ " Gráfico de los trabajos de reparación"" en la línea № ';ru='Не удалось записать нормативные ремонты: "
					+ "не заполнено поле ""График ремонтных работ"" в строке № ';en='Failed to record normative repairs: the"
					+ " ""Repair schedule"" field is not filled in line № '") + НомерСтрокиТЧ;
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(Стр.СпособВыполнения) Тогда
					ТекстСообщения = НСтр("es='No consiguió anotar las reparaciones normativas: no es rellenado el campo"
					+ " ""el Modo de la ejecución"" en la línea № ';ru='Не удалось записать нормативные ремонты: не заполнено"
					+ " поле ""Способ выполнения"" в строке № ';en='Failed to record standard repairs: the ""Execution method"" "
					+ "field in row № is not filled '") + НомерСтрокиТЧ;
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				КонецЕсли;
				Если Не ЗначениеЗаполнено(Стр.СпособУчетаДатыОтсчета) Тогда
					ТекстСообщения = НСтр("es='No consiguió anotar las reparaciones normativas: no es rellenado el campo ""el "
					+ "Modo del recuento de la fecha de la lectura"" en la línea № ';ru='Не удалось записать нормативные "
					+ "ремонты: не заполнено поле ""Способ учета даты отсчета"" в строке № ';en='Failed to record normative "
					+ "repairs: the ""Method for counting the reference date"" field in row № is not filled '") + НомерСтрокиТЧ;
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				КонецЕсли;
			КонецЕсли;
			Если Отказ Тогда 
				Прервать;
			КонецЕсли;
		КонецЦикла; 
		Если Отказ = Ложь Тогда 
			НаборЗаписей.Записать();
			
			МодифицированностьНормРемонтов = Ложь;
		Иначе
			Возврат;
		КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьПредшествующие(Ссылка, ТЧ, ТЧ2, Отказ)
	НаборЗаписей = РегистрыСведений.торо_ПредшествующиеНормативныеРемонтыОборудования.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ТиповойОР.Установить(Ссылка);
	СтруктураВозврата = ПолучитьОРиВРИзТиповогоОР2(Ссылка, "ПредшествующиеРемонты",
	"торо_ПредшествующиеНормативныеРемонтыОборудования", ТЧ); 
	ТЗПредшествующих = ПолучитьПредшествующиеИлиНормативные("ПредшествующийВидРемонта", ТЧ, ТЧ2);
	
	Для каждого Стр Из ТЗПредшествующих Цикл
		Для каждого Элем Из СтруктураВозврата Цикл
			Если Элем.ВидРемонта = Стр.ВидРемонта Тогда
				
				СтрокаНабора = НаборЗаписей.Добавить();	
				ЗаполнитьЗначенияСвойств(СтрокаНабора, Элем);
				ЗаполнитьЗначенияСвойств(СтрокаНабора, Стр);
				СтрокаНабора.Приоритет = Элем.Приоритет;
				СтрокаНабора.ТиповойОР = Ссылка;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла; 
	
	НаборЗаписей.Записать();

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьЗамещаемые(Ссылка, ТЧ, ТЧ2, Отказ)
	СтруктураВозврата = ПолучитьОРиВРИзТиповогоОР2(Ссылка, "ЗамещаемыеРемонты",
		"торо_ПараметрыЗамещенияПланированияРемонтныхРабот", ТЧ2); 
	НаборЗаписей = РегистрыСведений.торо_ПараметрыЗамещенияПланированияРемонтныхРабот.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ТиповойОР.Установить(Ссылка);
	ТЗЗамещаемых = ПолучитьПредшествующиеИлиНормативные("ЗамещаемыйВидРемонта",ТЧ,Неопределено,ТЧ2);
	
	Для каждого Стр Из ТЗЗамещаемых Цикл
		Для каждого Элем Из СтруктураВозврата Цикл
			Если Элем.ВидРемонта = Стр.ВидРемонта Тогда
				СтрокаНабора = НаборЗаписей.Добавить();	
				ЗаполнитьЗначенияСвойств(СтрокаНабора, Элем);
				ЗаполнитьЗначенияСвойств(СтрокаНабора, Стр);
				СтрокаНабора.Приоритет = Элем.Приоритет;
				СтрокаНабора.ТиповойОР = Ссылка;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла; 
	
	НаборЗаписей.Записать();

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПодчиненныеОбновитьПоказатели(Ссылка, ТЧ1, ТЧ2, Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧ.ОбъектРемонта КАК ОбъектРемонта,
		|	ТЧ.Показатель КАК Показатель,
		|	ТЧ.ДопустимыйМинимум КАК ДопустимыйМинимум,
		|	ТЧ.ДопустимыйМаксимум КАК ДопустимыйМаксимум,
		|	ТЧ.КритическийМинимум КАК КритическийМинимум,
		|	ТЧ.КритическийМаксимум КАК КритическийМаксимум,
		|	ТЧ.ЗначенияКонтролируемыхПоказателейИзОР КАК ЗначенияКонтролируемыхПоказателейИзОР,
		|	ТЧ.Изменен КАК Изменен
		|ПОМЕСТИТЬ Новые
		|ИЗ
		|	&ТЧ1 КАК ТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЧ.ОбъектРемонта КАК ОбъектРемонта,
		|	ТЧ.Показатель КАК Показатель,
		|	ТЧ.ДопустимыйМинимум КАК ДопустимыйМинимум,
		|	ТЧ.ДопустимыйМаксимум КАК ДопустимыйМаксимум,
		|	ТЧ.КритическийМинимум КАК КритическийМинимум,
		|	ТЧ.КритическийМаксимум КАК КритическийМаксимум,
		|	ТЧ.ЗначенияКонтролируемыхПоказателейИзОР КАК ЗначенияКонтролируемыхПоказателейИзОР
		|ПОМЕСТИТЬ Старые
		|ИЗ
		|	&ТЧ2 КАК ТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Новые.ОбъектРемонта КАК ОбъектРемонта,
		|	Новые.Показатель КАК Показатель,
		|	Новые.ДопустимыйМинимум КАК ДопустимыйМинимум,
		|	Новые.ДопустимыйМаксимум КАК ДопустимыйМаксимум,
		|	Новые.КритическийМинимум КАК КритическийМинимум,
		|	Новые.КритическийМаксимум КАК КритическийМаксимум,
		|	Новые.ЗначенияКонтролируемыхПоказателейИзОР КАК ЗначенияКонтролируемыхПоказателейИзОР
		|ПОМЕСТИТЬ Измененные
		|ИЗ
		|	Новые КАК Новые
		|		ЛЕВОЕ СОЕДИНЕНИЕ Старые КАК Старые
		|		ПО (Новые.Изменен = ЛОЖЬ)
		|			И Новые.Показатель = Старые.Показатель
		|			И Новые.ДопустимыйМинимум = Старые.ДопустимыйМинимум
		|			И Новые.ДопустимыйМаксимум = Старые.ДопустимыйМаксимум
		|			И Новые.КритическийМинимум = Старые.КритическийМинимум
		|			И Новые.КритическийМаксимум = Старые.КритическийМаксимум
		|			И Новые.ЗначенияКонтролируемыхПоказателейИзОР = Старые.ЗначенияКонтролируемыхПоказателейИзОР
		|ГДЕ
		|	Старые.Показатель ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Измененные.ОбъектРемонта КАК ОбъектРемонта,
		|	Измененные.Показатель КАК Показатель,
		|	Измененные.ДопустимыйМинимум КАК ДопустимыйМинимум,
		|	Измененные.ДопустимыйМаксимум КАК ДопустимыйМаксимум,
		|	Измененные.КритическийМинимум КАК КритическийМинимум,
		|	Измененные.КритическийМаксимум КАК КритическийМаксимум,
		|	Измененные.ЗначенияКонтролируемыхПоказателейИзОР КАК ЗначенияКонтролируемыхПоказателейИзОР
		|ИЗ
		|	Измененные КАК Измененные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Старые.Показатель КАК Показатель
		|ИЗ
		|	Старые КАК Старые
		|		ЛЕВОЕ СОЕДИНЕНИЕ Новые КАК Новые
		|		ПО Старые.Показатель = Новые.Показатель
		|ГДЕ
		|	Новые.Показатель ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ТиповыеОР.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.торо_ТиповыеОР КАК торо_ТиповыеОР
		|ГДЕ
		|	(торо_ТиповыеОР.Родитель = &Ссылка
		|			ИЛИ торо_ТиповыеОР.Родитель.Родитель = &Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_ПараметрыОповещенияОСостоянииОборудования.ОбъектРемонта КАК ОбъектРемонта,
		|	торо_ПараметрыОповещенияОСостоянииОборудования.Показатель КАК Показатель,
		|	торо_ПараметрыОповещенияОСостоянииОборудования.ТиповойОР КАК ТиповойОР,
		|	торо_ПараметрыОповещенияОСостоянииОборудования.ID КАК ID,
		|	торо_ПараметрыОповещенияОСостоянииОборудования.ПараметрыВводаДефекта КАК ПараметрыВводаДефекта,
		|	торо_ПараметрыОповещенияОСостоянииОборудования.СобытиеВозникновенияОповещения КАК СобытиеВозникновенияОповещения,
		|	торо_ПараметрыОповещенияОСостоянииОборудования.ВидСравнения КАК ВидСравнения,
		|	торо_ПараметрыОповещенияОСостоянииОборудования.Значение КАК Значение,
		|	торо_ПараметрыОповещенияОСостоянииОборудования.ВариантЗначения КАК ВариантЗначения,
		|	торо_ПараметрыОповещенияОСостоянииОборудования.Значение1 КАК Значение1,
		|	торо_ПараметрыОповещенияОСостоянииОборудования.ВариантЗначения1 КАК ВариантЗначения1
		|ИЗ
		|	Измененные КАК Измененные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ПараметрыОповещенияОСостоянииОборудования 
		|	КАК торо_ПараметрыОповещенияОСостоянииОборудования
		|		ПО Измененные.Показатель = торо_ПараметрыОповещенияОСостоянииОборудования.Показатель
		|ГДЕ
		|	торо_ПараметрыОповещенияОСостоянииОборудования.ТиповойОР = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ТЧ1", ТЧ1.Выгрузить());
	Запрос.УстановитьПараметр("ТЧ2", ТЧ2.Выгрузить());
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ИндексПакета0 = 5;
	ИндексПакета1 = 3;
	ИндексПакета2 = 4;
	ИндексПакета3 = 6;
	Выборка0 = РезультатЗапроса[ИндексПакета0].Выбрать();
	Выборка1 = РезультатЗапроса[ИндексПакета1].Выбрать();
	Выборка2 = РезультатЗапроса[ИндексПакета2].Выбрать();
	Выборка3 = РезультатЗапроса[ИндексПакета3].Выбрать();
	
	Пока Выборка0.Следующий() Цикл
		Пока Выборка1.Следующий() Цикл
			НаборЗаписей = РегистрыСведений.торо_ИзмеряемыеПоказателиОбъектовРемонта.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ОбъектРемонта.Установить(Выборка0.Ссылка);
			НаборЗаписей.Отбор.Показатель.Установить(Выборка1.Показатель);
			НоваяСтрока = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка1);
			НоваяСтрока.ОбъектРемонта = Выборка0.Ссылка;
			НаборЗаписей.Записать();
		КонецЦикла;
		Выборка1.Сбросить();
		//
		Пока Выборка2.Следующий() Цикл
			НаборЗаписей = РегистрыСведений.торо_ИзмеряемыеПоказателиОбъектовРемонта.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ОбъектРемонта.Установить(Выборка0.Ссылка);
			НаборЗаписей.Отбор.Показатель.Установить(Выборка2.Показатель);
			НаборЗаписей.Записать();
			//
			НаборЗаписей = РегистрыСведений.торо_ПараметрыОповещенияОСостоянииОборудования.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ТиповойОР.Установить(Выборка0.Ссылка);
			НаборЗаписей.Отбор.Показатель.Установить(Выборка2.Показатель);
			НаборЗаписей.Записать();
		КонецЦикла;
		Выборка2.Сбросить();
		//
		Пока Выборка3.Следующий() Цикл
			НаборЗаписей = РегистрыСведений.торо_ПараметрыОповещенияОСостоянииОборудования.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ТиповойОР.Установить(Выборка0.Ссылка);
			НаборЗаписей.Отбор.Показатель.Установить(Выборка3.Показатель);
			НаборЗаписей.Отбор.ID.Установить(Выборка3.ID);
			НоваяСтрока = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка3);
			НоваяСтрока.ТиповойОР = Выборка0.Ссылка;
			НаборЗаписей.Записать();
		КонецЦикла;
		Выборка3.Сбросить();
		// Удалим из регистра строки, которые были удалены для конкретных ОР.
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ИзмеряемыеПоказателиОбъектовРемонта.ОбъектРемонта,
		|	ИзмеряемыеПоказателиОбъектовРемонта.Показатель КАК Показатель
		|ИЗ
		|	(ВЫБРАТЬ
		|		торо_ОбъектыРемонта.Ссылка КАК Ссылка
		|	ИЗ
		|		Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|	ГДЕ
		|		торо_ОбъектыРемонта.ТиповойОР = &ТиповойОР) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИзмеряемыеПоказателиОбъектовРемонта 
		|	КАК ИзмеряемыеПоказателиОбъектовРемонта
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИзмеряемыеПоказателиОбъектовРемонта 
		|	КАК ИзмеряемыеПоказателиТиповыхОР
		|			ПО ИзмеряемыеПоказателиОбъектовРемонта.Показатель = ИзмеряемыеПоказателиТиповыхОР.Показатель
		|				И (ИзмеряемыеПоказателиТиповыхОР.ОбъектРемонта = &ТиповойОР)
		|		ПО (ВложенныйЗапрос.Ссылка = (ВЫРАЗИТЬ(ИзмеряемыеПоказателиОбъектовРемонта.ОбъектРемонта 
		|	КАК Справочник.торо_ОбъектыРемонта)))
		|ГДЕ
		|	ИзмеряемыеПоказателиОбъектовРемонта.Удален
		|	И ИзмеряемыеПоказателиТиповыхОР.Показатель ЕСТЬ NULL 
		|ИТОГИ ПО
		|	Показатель";
		Запрос.УстановитьПараметр("ТиповойОР", Выборка0.Ссылка);
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			ВыборкаПоказатели = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоказатели.Следующий() Цикл
				НаборЗаписей = РегистрыСведений.торо_ИзмеряемыеПоказателиОбъектовРемонта.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Показатель.Установить(ВыборкаПоказатели.Показатель);
				НаборЗаписей.Прочитать();
				ВыборкаДетЗаписи = ВыборкаПоказатели.Выбрать();
				МассивУдаляемых = Новый Массив;
				Для Каждого Запись Из НаборЗаписей Цикл
					Если ВыборкаДетЗаписи.НайтиСледующий(Новый Структура("ОбъектРемонта,Показатель",
							Запись.ОбъектРемонта, Запись.Показатель)) Тогда
						МассивУдаляемых.Добавить(Запись);
					КонецЕсли;
					ВыборкаДетЗаписи.Сбросить();
				КонецЦикла;
				Для Каждого ЭлМассива Из МассивУдаляемых Цикл
					НаборЗаписей.Удалить(ЭлМассива);
				КонецЦикла;
				НаборЗаписей.Записать();
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПодчиненныеОбновитьНаработку(Ссылка, ТЧ1, ТЧ2, Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧ.Период КАК Период,
		|	ТЧ.ОбъектРемонта КАК ОбъектРемонта,
		|	ТЧ.Показатель КАК Показатель,
		|	ТЧ.ПлановаяНаработка КАК ПлановаяНаработка,
		|	ТЧ.ПериодПлановойНаработки КАК ПериодПлановойНаработки,
		|	ТЧ.ПродолжительностьПериодаПлановойНаработки КАК ПродолжительностьПериодаПлановойНаработки,
		|	ТЧ.КоэффициентИспользованияОборудования КАК КоэффициентИспользованияОборудования,
		|	ТЧ.Основной КАК Основной,
		|	ТЧ.Изменен КАК Изменен
		|ПОМЕСТИТЬ Новый
		|ИЗ
		|	&ТЧ1 КАК ТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЧ.Период КАК Период,
		|	ТЧ.ОбъектРемонта КАК ОбъектРемонта,
		|	ТЧ.Показатель КАК Показатель,
		|	ТЧ.ПлановаяНаработка КАК ПлановаяНаработка,
		|	ТЧ.ПериодПлановойНаработки КАК ПериодПлановойНаработки,
		|	ТЧ.ПродолжительностьПериодаПлановойНаработки КАК ПродолжительностьПериодаПлановойНаработки,
		|	ТЧ.КоэффициентИспользованияОборудования КАК КоэффициентИспользованияОборудования,
		|	ТЧ.Основной КАК Основной
		|ПОМЕСТИТЬ Старый
		|ИЗ
		|	&ТЧ2 КАК ТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Новый.Период КАК Период,
		|	Новый.ОбъектРемонта КАК ОбъектРемонта,
		|	Новый.Показатель КАК Показатель,
		|	Новый.ПлановаяНаработка КАК ПлановаяНаработка,
		|	Новый.ПериодПлановойНаработки КАК ПериодПлановойНаработки,
		|	Новый.ПродолжительностьПериодаПлановойНаработки КАК ПродолжительностьПериодаПлановойНаработки,
		|	Новый.КоэффициентИспользованияОборудования КАК КоэффициентИспользованияОборудования,
		|	Новый.Основной КАК Основной,
		|	Новый.Изменен КАК Изменен
		|ПОМЕСТИТЬ Обновить
		|ИЗ
		|	Новый КАК Новый
		|		ЛЕВОЕ СОЕДИНЕНИЕ Старый КАК Старый
		|		ПО (Новый.Изменен = ЛОЖЬ)
		|			И Новый.Период = Старый.Период
		|			И Новый.ОбъектРемонта = Старый.ОбъектРемонта
		|			И Новый.Показатель = Старый.Показатель
		|			И Новый.ПлановаяНаработка = Старый.ПлановаяНаработка
		|			И Новый.ПериодПлановойНаработки = Старый.ПериодПлановойНаработки
		|			И Новый.ПродолжительностьПериодаПлановойНаработки = Старый.ПродолжительностьПериодаПлановойНаработки
		|			И Новый.КоэффициентИспользованияОборудования = Старый.КоэффициентИспользованияОборудования
		|			И Новый.Основной = Старый.Основной
		|ГДЕ
		|	Старый.Показатель ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Обновить.Период КАК Период,
		|	Обновить.ОбъектРемонта КАК ОбъектРемонта,
		|	Обновить.Показатель КАК Показатель,
		|	Обновить.ПлановаяНаработка КАК ПлановаяНаработка,
		|	Обновить.ПериодПлановойНаработки КАК ПериодПлановойНаработки,
		|	Обновить.ПродолжительностьПериодаПлановойНаработки КАК ПродолжительностьПериодаПлановойНаработки,
		|	Обновить.КоэффициентИспользованияОборудования КАК КоэффициентИспользованияОборудования,
		|	Обновить.Основной КАК Основной,
		|	Обновить.Изменен КАК Изменен
		|ИЗ
		|	Обновить КАК Обновить
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Старый.ОбъектРемонта КАК ОбъектРемонта,
		|	Старый.Показатель КАК Показатель,
		|	Старый.Период КАК Период
		|ИЗ
		|	Старый КАК Старый
		|		ЛЕВОЕ СОЕДИНЕНИЕ Новый КАК Новый
		|		ПО Старый.Период = Новый.Период
		|			И Старый.ОбъектРемонта = Новый.ОбъектРемонта
		|			И Старый.Показатель = Новый.Показатель
		|ГДЕ
		|	Новый.Показатель ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ТиповыеОР.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.торо_ТиповыеОР КАК торо_ТиповыеОР
		|ГДЕ
		|	(торо_ТиповыеОР.Родитель = &Ссылка
		|			ИЛИ торо_ТиповыеОР.Родитель.Родитель = &Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_МаксимальныеЗначенияНаработкиОР.ОбъектРемонта КАК ОбъектРемонта,
		|	торо_МаксимальныеЗначенияНаработкиОР.Показатель КАК Показатель,
		|	торо_МаксимальныеЗначенияНаработкиОР.МаксимальноеЗначение КАК МаксимальноеЗначение,
		|	торо_МаксимальныеЗначенияНаработкиОР.НазначенныйРесурс КАК НазначенныйРесурс,
		|	торо_МаксимальныеЗначенияНаработкиОР.Удален КАК Удален
		|ИЗ
		|	Обновить КАК Обновить
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_МаксимальныеЗначенияНаработкиОР КАК торо_МаксимальныеЗначенияНаработкиОР
		|		ПО Обновить.Показатель = торо_МаксимальныеЗначенияНаработкиОР.Показатель
		|ГДЕ
		|	торо_МаксимальныеЗначенияНаработкиОР.ОбъектРемонта = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ТЧ1", ТЧ1.Выгрузить());
	Запрос.УстановитьПараметр("ТЧ2", ТЧ2.Выгрузить());
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ИндексПакета0 = 5;
	ИндексПакета1 = 3;
	ИндексПакета2 = 4;
	ИндексПакета3 = 6;
	Выборка0 = РезультатЗапроса[ИндексПакета0].Выбрать();
	Выборка1 = РезультатЗапроса[ИндексПакета1].Выбрать();
	Выборка2 = РезультатЗапроса[ИндексПакета2].Выбрать();
	Выборка3 = РезультатЗапроса[ИндексПакета3].Выбрать();
	
	Пока Выборка0.Следующий() Цикл
		Пока Выборка1.Следующий() Цикл 
			НаборЗаписей = РегистрыСведений.торо_ПараметрыНаработкиОбъектовРемонта.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ОбъектРемонта.Установить(Выборка0.Ссылка);
			НаборЗаписей.Отбор.Показатель.Установить(Выборка1.Показатель);
			НаборЗаписей.Отбор.Период.Установить(Выборка1.Период);
			НоваяСтрока = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка1);
			НоваяСтрока.ОбъектРемонта = Выборка0.Ссылка;
			НаборЗаписей.Записать(); 
		КонецЦикла;
		Выборка1.Сбросить();
		//
		Пока Выборка2.Следующий() Цикл 
			НаборЗаписей = РегистрыСведений.торо_ПараметрыНаработкиОбъектовРемонта.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ОбъектРемонта.Установить(Выборка0.Ссылка);
			НаборЗаписей.Отбор.Показатель.Установить(Выборка2.Показатель);
			НаборЗаписей.Отбор.Период.Установить(Выборка2.Период);
			НаборЗаписей.Записать(); 
			//
			НаборЗаписей = РегистрыСведений.торо_МаксимальныеЗначенияНаработкиОР.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ОбъектРемонта.Установить(Выборка0.Ссылка);
			НаборЗаписей.Отбор.Показатель.Установить(Выборка3.Показатель);
			НаборЗаписей.Записать();
		КонецЦикла;
		Выборка2.Сбросить();
		//
		Пока Выборка3.Следующий() Цикл 
			НаборЗаписей = РегистрыСведений.торо_МаксимальныеЗначенияНаработкиОР.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ОбъектРемонта.Установить(Выборка0.Ссылка);
			НаборЗаписей.Отбор.Показатель.Установить(Выборка3.Показатель);
			НоваяСтрока = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка3);
			НоваяСтрока.ОбъектРемонта = Выборка0.Ссылка;
			НаборЗаписей.Записать(); 
		КонецЦикла;
		Выборка3.Сбросить();
		//
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОНаследовании1(Результат, ДопПараметры)Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда 
		ДопПараметры.Вставить("ОбновитьНормативы", Истина);
	ИначеЕсли Результат = КодВозвратаДиалога.Отмена Тогда 
		Возврат;
	КонецЕсли;
	Если МодифицированностьИзмеряемыхПоказателей И Не дс_УровеньОбъекта = 3 Тогда 
		ОписаниеОповещенияПослеВопроса = Новый ОписаниеОповещения("ПослеВопросаОНаследовании2", ЭтотОбъект, ДопПараметры);
		ПоказатьВопрос(ОписаниеОповещенияПослеВопроса, 
			НСтр("ru='Обновить контролируемые показатели подчиненных элементов?'"), РежимДиалогаВопрос.ДаНетОтмена);
		Возврат;
	ИначеЕсли МодифицированностьПараметровНаработки И Не дс_УровеньОбъекта = 3 Тогда 
		ОписаниеОповещенияПослеВопроса = Новый ОписаниеОповещения("ПослеВопросаОНаследовании3", ЭтотОбъект, ДопПараметры);
		ПоказатьВопрос(ОписаниеОповещенияПослеВопроса,
			НСтр("ru='Обновить наработку подчиненных элементов?'"), РежимДиалогаВопрос.ДаНетОтмена);
		Возврат;
	Иначе
		ПослеВопросаОНаследовании2(КодВозвратаДиалога.Нет, ДопПараметры)
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОНаследовании2(Результат, ДопПараметры)Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда 
		ДопПараметры.Вставить("ОбновитьПоказатели",Истина);
	ИначеЕсли Результат = КодВозвратаДиалога.Отмена Тогда 
		Возврат;
	КонецЕсли;
	Если МодифицированностьПараметровНаработки И Не дс_УровеньОбъекта = 3 Тогда 
		ОписаниеОповещенияПослеВопроса = Новый ОписаниеОповещения("ПослеВопросаОНаследовании3", ЭтотОбъект, ДопПараметры);
		ПоказатьВопрос(ОписаниеОповещенияПослеВопроса,
			НСтр("ru='Обновить наработку подчиненных элементов?'"), РежимДиалогаВопрос.ДаНетОтмена);
		Возврат;
	Иначе
		ПослеВопросаОНаследовании3(КодВозвратаДиалога.Нет, ДопПараметры)
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОНаследовании3(Результат, ДопПараметры)Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда 
		ДопПараметры.Вставить("ОбновитьНаработку", Истина);
		СохранитьПослеВопросов(КодВозвратаДиалога.Да, ДопПараметры);
	ИначеЕсли Результат = КодВозвратаДиалога.Отмена Тогда 
		Возврат;
	Иначе
		СохранитьПослеВопросов(КодВозвратаДиалога.Да, ДопПараметры);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьПослеВопросов(Результат, ДопПараметры)Экспорт
	Отказ = Ложь;
	дс_ЭтоНовый = Не ЗначениеЗаполнено(дс_Ссылка);
	СохранитьНаСервере(Отказ, ДопПараметры);
	Если Не Отказ Тогда 
		МодифицированностьИзмеряемыхПоказателей = Ложь;
		дс_Модифицированность = Ложь;
		МодифицированностьПараметровОповещенияОСостоянииОР = Ложь;
		МодифицированностьПредшествующихРемонтов = Ложь;
		МодифицированностьЗамещаемыхРемонтов = Ложь;
		МодифицированностьНормРемонтов = Ложь;
		МодифицированностьМаксЗначНаработки = Ложь;
		МодифицированностьПараметровНаработки = Ложь;
	КонецЕсли;
	Если дс_ЭтоНовый Тогда 
		ОбновитьПоСсылке();
	Иначе
		ОбновитьВидимостьРеквизитов();
	КонецЕсли;
	Элементы.Список.Обновить();
	
	Элементы.Список.ТекущаяСтрока = дс_Ссылка;
	Если ДопПараметры = Неопределено ИЛИ ДопПараметры.Свойство("ПродолжитьРедактирование") = Ложь 
		Или ДопПараметры.ПродолжитьРедактирование = Ложь Тогда 
		дс_Редактирование = Ложь;
	Иначе
		дс_ДоСсылка = дс_Ссылка;
		дс_НеРеагировать = Истина;
		ПодключитьОбработчикОжидания("МожноРеагировать", 0.5, Истина);
	КонецЕсли;
	Элементы.Редактировать.Пометка = дс_Редактирование;
	Если НЕ ДопПараметры = Неопределено И ДопПараметры.Свойство("ЗакрытьПослеЗаписи") Тогда 
		дс_МожноЗакрывать = Истина;
		Закрыть();
	Иначе
		ОбновитьДоступностьРеквизитов();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИзмененияПослеВопроса(Результат, ДопПараметры)Экспорт
	Если ДопПараметры = Неопределено Тогда 
		ДопПараметры = Новый Структура();
	КонецЕсли;
	Если КодВозвратаДиалога.Да = Результат Тогда 
		ПроверитьНаличиеПодчиненных(дс_Ссылка);
		Если дс_ЕстьПодчиненные Тогда 
			Если МодифицированностьНормРемонтов И дс_УровеньОбъекта = 2 Тогда 
				ОписаниеОповещенияПослеВопроса = Новый ОписаниеОповещения("ПослеВопросаОНаследовании1", ЭтотОбъект, ДопПараметры);
				ПоказатьВопрос(ОписаниеОповещенияПослеВопроса, 
					НСтр("ru='Обновить нормативы подчиненных элементов?'"), РежимДиалогаВопрос.ДаНетОтмена);
				Возврат;
			ИначеЕсли МодифицированностьИзмеряемыхПоказателей И Не дс_УровеньОбъекта = 3 Тогда 
				ОписаниеОповещенияПослеВопроса = Новый ОписаниеОповещения("ПослеВопросаОНаследовании2", ЭтотОбъект, ДопПараметры);
				ПоказатьВопрос(ОписаниеОповещенияПослеВопроса, 
					НСтр("ru='Обновить контролируемые показатели подчиненных элементов?'"), РежимДиалогаВопрос.ДаНетОтмена);
				Возврат;
			ИначеЕсли МодифицированностьПараметровНаработки И Не дс_УровеньОбъекта = 3 Тогда 
				ОписаниеОповещенияПослеВопроса = Новый ОписаниеОповещения("ПослеВопросаОНаследовании3",ЭтотОбъект, ДопПараметры);
				ПоказатьВопрос(ОписаниеОповещенияПослеВопроса, 
					НСтр("ru='Обновить наработку подчиненных элементов?'"), РежимДиалогаВопрос.ДаНетОтмена);
				Возврат;
			Иначе
				ПослеВопросаОНаследовании1(КодВозвратаДиалога.Нет, ДопПараметры)
			КонецЕсли;
		Иначе
			СохранитьПослеВопросов(КодВозвратаДиалога.Да, ДопПараметры);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область РаботаСНовымиЭлементыФормы
&НаСервереБезКонтекста
Функция ПолучитьЗначениеРеквизитов(ИзмеряемыйПоказатель)
	
	СтруктураЗначенийПолей = Новый Структура();
	Для каждого Реквизит Из ИзмеряемыйПоказатель.Метаданные().Реквизиты Цикл
		СтруктураЗначенийПолей.Вставить(Реквизит.Имя, ИзмеряемыйПоказатель[Реквизит.Имя]);
	КонецЦикла;
 	Возврат СтруктураЗначенийПолей;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьСтрокуДанными(Строка, ИзмеряемыйПоказатель)
	
	СтруктураЗначенийПолей = ПолучитьЗначениеРеквизитов(ИзмеряемыйПоказатель);
	СтруктураЗначенийПолей.Вставить("ОбъектРемонта", дс_Ссылка);
	СтруктураЗначенийПолей.Вставить("Показатель"   , ИзмеряемыйПоказатель);
	Если ЗначениеЗаполнено(ИзмеряемыйПоказатель) Тогда
		СтруктураЗначенийПолей.Вставить("Доступность", 
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИзмеряемыйПоказатель, "ТипЗначения").СодержитТип(Тип("Число")));
	Иначе
		СтруктураЗначенийПолей.Вставить("Доступность", Ложь);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Строка, СтруктураЗначенийПолей);

КонецПроцедуры

&НаКлиенте
Процедура ПодборКонтролируемыхПоказателей(Команда)
	СтандартнаяОбработка = Ложь;
	СписокОтбора = Новый СписокЗначений();
	
	Для каждого Строка Из дс_СписокИзмеряемыхПоказателей Цикл
		СписокОтбора.Добавить(Строка.Показатель);
	КонецЦикла;
	ПараметрыФормыСтруктура = Новый Структура("КлючНазначенияИспользования, СписокОтбора, ЗакрыватьПриВыборе",
		"ОбъектыРемонта", СписокОтбора, Ложь);
	ФормаВыбораПоказателя = ПолучитьФорму("ПланВидовХарактеристик.торо_ИзмеряемыеПоказателиОбъектовРемонта.ФормаВыбора",
		ПараметрыФормыСтруктура, Элементы.дс_СписокИзмеряемыхПоказателей, дс_Ссылка);
	
	ФормаВыбораПоказателя.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура дс_СписокОРОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	МассивВыбранныхЗначений = Новый Массив;
	ИзменитьНаправлениеИИзготовителя = Неопределено;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		Если ВыбранноеЗначение.Свойство("ОбъектРемонта") Тогда
			МассивВыбранныхЗначений = ВыбранноеЗначение.ОбъектРемонта;
		КонецЕсли;
		Если ВыбранноеЗначение.Свойство("ИзменитьНаправлениеИИзготовителя")	Тогда
			ИзменитьНаправлениеИИзготовителя = ВыбранноеЗначение.ИзменитьНаправлениеИИзготовителя;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		МассивВыбранныхЗначений = ВыбранноеЗначение;
	Иначе
		МассивВыбранныхЗначений.Добавить(ВыбранноеЗначение);
	КонецЕсли;
	
	Если МассивВыбранныхЗначений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивСтруктурЗначений = ПолучитьОбъектыРемонтаСТиповыми(МассивВыбранныхЗначений);
	МассивСтруктурЗначенийОчищенный = Новый Массив;
	ЕстьУжеСТиповым = Ложь;
		
	Для каждого Структура из МассивСтруктурЗначений Цикл
		Если ЗначениеЗаполнено(Структура.ТиповойОР) И Структура.ТиповойОР = дс_Ссылка Тогда
			ШаблонСообщения = НСтр("es='¡El objeto escogido de la reparación ""%1"" forma parte ya!';
			|ru='Выбранный объект ремонта ""%1"" уже входит в состав!';
			|en='The selected repair item ""%1"" is already included!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Структура.ОбъектРемонта);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Иначе
			МассивСтруктурЗначенийОчищенный.Добавить(Структура);
			
			Если ЗначениеЗаполнено(Структура.ТиповойОР) Тогда
				ЕстьУжеСТиповым = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если МассивСтруктурЗначенийОчищенный.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Если (дс_ТипОбъекта = торо_ОбщегоНазначенияКлиентПовтИсп.ПолучитьПеречисление("торо_ТипыОбъектовRCM",
			"ФункциональноеМесто")) Тогда 
		ИзменитьНаправлениеИИзготовителя = Ложь;
	КонецЕсли;

	ДопПараметры = Новый Структура("МассивСтруктурОР, ИзменитьНаправлениеИИзготовителя", 
		МассивСтруктурЗначенийОчищенный, ИзменитьНаправлениеИИзготовителя);
	
	Если ЕстьУжеСТиповым Тогда
		Если МассивСтруктурЗначений.Количество() = 1 Тогда
			ШаблонВопроса = НСтр("es='El objeto escogido de la reparación forma parte del objeto tipo de la "
			+ "reparación ""%1"". ¿Llevar el objeto de la reparación?';ru='Выбранный объект ремонта входит в "
			+ "состав типового объекта ремонта ""%1"". Перенести объект ремонта?';en='The selected repair item "
			+ "is part of the typical repair item ""%1"". Relocate a repair item?'");
			ТекстВопроса = СтрШаблон(ШаблонВопроса, МассивСтруктурЗначений[0].ТиповойОР);
		Иначе
			ТекстВопроса = НСтр("es='Algunos de los objetos escogidos de la reparación forman parte de otro objeto"
			+ " tipo de la reparación. ¿Llevar tales objetos de la reparación?';ru='Некоторые из выбранных объектов"
			+ " ремонта входят в состав другого типового объекта ремонта. Перенести такие объекты ремонта?';"
			+ "en='Some of the selected repair objects are part of another typical repair object. Move such "
			+ "repair facilities?'");
		КонецЕсли;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("СоставОРОбработкаВыбораПослеВопросаОбИзмененииТипового", ЭтотОбъект, ДопПараметры);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
	Иначе
		СоставОРОбработкаВыбораПослеВопросаОбИзмененииТипового(КодВозвратаДиалога.Да, ДопПараметры);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоставОРОбработкаВыбораПослеВопросаОбИзмененииТипового(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Отмена ИЛИ Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.Вставить("ИзменятьТиповойОР", (Ответ = КодВозвратаДиалога.Да));	
	
	ИзменитьНаправлениеИИзготовителя = ДополнительныеПараметры.ИзменитьНаправлениеИИзготовителя;
	Если ИзменитьНаправлениеИИзготовителя = Неопределено Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("СоставОРОбработкаВыбораПослеВопросаОбИзмененииНаправления",
			ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(ОписаниеОповещения, НСтр("en='Change the fields ""Manufacturer"" and ""Direction"" according to"
		+ " the standard EI?';es='¿Cambiar los campos ""el Fabricador"" y ""la Dirección"" por tipo ОР?';ru='Изменить "
		+ "поля ""Изготовитель"" и ""Направление"" по типовому ОР?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		СоставОРОбработкаВыбораЗавершение(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОбъектыРемонтаСТиповыми(МассивОР)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ОбъектыРемонта.Ссылка КАК ОбъектРемонта,
	|	торо_ОбъектыРемонта.ТиповойОР КАК ТиповойОР
	|ИЗ
	|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	|ГДЕ
	|	торо_ОбъектыРемонта.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОР);
	Результат = Запрос.Выполнить();
	
	Возврат торо_ОбщегоНазначения.РезультатЗапросаВМассивСтруктур(Результат);
	
КонецФункции

&НаКлиенте
Процедура СоставОРОбработкаВыбораЗавершение(СтруктураПараметров)
	
	МассивСтруктурОР = СтруктураПараметров.МассивСтруктурОР;
	ИзменятьТиповойОР = СтруктураПараметров.ИзменятьТиповойОР;
	ИзменитьНаправлениеИИзготовителя = СтруктураПараметров.ИзменитьНаправлениеИИзготовителя;
	
	МассивОР = Новый Массив;
	
	Если ИзменятьТиповойОР Тогда
		Для каждого СтркуктураОР из МассивСтруктурОР Цикл
			МассивОР.Добавить(СтркуктураОР.ОбъектРемонта);
		КонецЦикла;
		ИзменитьТиповойУОбъектовРемонта(МассивОР, ИзменитьНаправлениеИИзготовителя);
	Иначе
		Для каждого СтруктураОР из МассивСтруктурОР Цикл
			Если НЕ ЗначениеЗаполнено(СтруктураОР.ТиповойОР) Тогда
				МассивОР.Добавить(СтруктураОР.ОбъектРемонта);
			КонецЕсли;
		КонецЦикла;
		ИзменитьТиповойУОбъектовРемонта(МассивОР, ИзменитьНаправлениеИИзготовителя);
	КонецЕсли;

	Элементы.дс_СписокОР.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьТиповойУОбъектовРемонта(МассивОР, ИзменитьНаправлениеИИзготовителя)
	
	Для каждого ОбъектРемонта из МассивОР Цикл
		торо_РаботаСНормативамиСервер.ЗаписатьНормативыОРПриИзмененииТиповогоОР(дс_Ссылка, ОбъектРемонта);
		ОбъектОР = ОбъектРемонта.ПолучитьОбъект();
		ОбъектОР.ТиповойОР = дс_Ссылка;
		Если ИзменитьНаправлениеИИзготовителя Тогда
			ОбъектОР.Направление = дс_Направление;
			ОбъектОР.Изготовитель = Изготовитель;
		КонецЕсли;
		ОбъектОР.Записать();
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьОРВСостав(Команда)
	Если НЕ ЗначениеЗаполнено(дс_Ссылка) Или дс_Модифицированность Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("es='Para la adición de los objetos de la reparación en la composición de ello tipo es necesario"
		+ " anotar.';ru='Для добавления объектов ремонта в состав типового его необходимо записать.';en='To add repair"
		+ " objects to the standard structure, it must be recorded.'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ДобавитьОРВСостав_Завершение();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьОРВСостав_Завершение()

	ПараметрыФормы = Новый Структура("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("ОтборТипОбъекта", дс_ТипОбъекта);
	ПараметрыФормы.Вставить("ИспользоватьОтборТипОбъекта", Истина);
	ОткрытьФорму("Справочник.торо_ОбъектыРемонта.ФормаВыбора", 
		ПараметрыФормы, Элементы.дс_СписокОР, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставОРУдалить(Команда)
	Если ЗначениеЗаполнено(дс_Ссылка) Тогда 
		МассивОР = Элементы.дс_СписокОР.ВыделенныеСтроки;
		ОчиститьТиповойУОбъектовРемонта(МассивОР);	
		Элементы.дс_СписокОР.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОчиститьТиповойУОбъектовРемонта(МассивОР)
	
	Для каждого ОбъектРемонта из МассивОР Цикл
		ОчиститьТиповойУОбъектаРемонта(ОбъектРемонта);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьТиповойУОбъектаРемонта(ОбъектРемонта, ИзменитьНаправлениеИИзготовителя = Ложь)
	
	НачатьТранзакцию();
	
	торо_РаботаСНормативамиСервер.ЗаписатьНормативыОРПриИзмененииТиповогоОР(Справочники.торо_ТиповыеОР.ПустаяСсылка(),
		ОбъектРемонта);
	ОбъектОР = ОбъектРемонта.ПолучитьОбъект();
	Если ИзменитьНаправлениеИИзготовителя Тогда
		ОбъектОР.Направление = Справочники.торо_НаправленияОбъектовРемонтныхРабот.ПустаяСсылка();
		ОбъектОР.Изготовитель = Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
	ОбъектОР.ТиповойОР = Справочники.торо_ТиповыеОР.ПустаяСсылка();
	ОбъектОР.Записать();
	
	НаборЗаписейДляОчистки = РегистрыСведений.торо_Запчасти.СоздатьНаборЗаписей();
	НаборЗаписейДляОчистки.Отбор.ОбъектРемонта.Установить(ОбъектРемонта);
	НаборЗаписейДляОчистки.Отбор.ТиповойОР.Установить(дс_Ссылка);
	НаборЗаписейДляОчистки.Записать();
	
	НаборЗаписейДляОчистки = РегистрыСведений.торо_ЗапчастиУдаленные.СоздатьНаборЗаписей();
	НаборЗаписейДляОчистки.Отбор.ОбъектРемонта.Установить(ОбъектРемонта);
	НаборЗаписейДляОчистки.Записать();
	
	НаборЗаписейДляОчистки = РегистрыСведений.торо_НормыЗапчастейНаОбъектыРемонта.СоздатьНаборЗаписей();
	НаборЗаписейДляОчистки.Отбор.ОбъектРемонта.Установить(ОбъектРемонта);
	НаборЗаписейДляОчистки.Отбор.ТиповойОР.Установить(дс_Ссылка);
	НаборЗаписейДляОчистки.Записать();
	
	НаборЗаписейДляОчистки = РегистрыСведений.торо_НормыЗапчастейНаОбъектыРемонтаУдаленные.СоздатьНаборЗаписей();
	НаборЗаписейДляОчистки.Отбор.ОбъектРемонта.Установить(ОбъектРемонта);
	НаборЗаписейДляОчистки.Записать();
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

&НаКлиенте
Процедура СоставОРОбработкаВыбораПослеВопросаОбИзмененииНаправления(Ответ, ДополнительныеПараметры) Экспорт
	
	ДополнительныеПараметры.Вставить("ИзменитьНаправлениеИИзготовителя", (Ответ = КодВозвратаДиалога.Да));
	СоставОРОбработкаВыбораЗавершение(ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборОР(Команда)
	
	Если НЕ ЗначениеЗаполнено(дс_Ссылка) Или дс_Модифицированность Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("es='Para la adición de los objetos de la reparación en la composición de ello tipo es necesario"
		+ " anotar.';ru='Для добавления объектов ремонта в состав типового его необходимо записать.';en='To add repair "
		+ "objects to the standard structure, it must be recorded.'");
		Сообщение.Сообщить();
		 
		Возврат;
	КонецЕсли;

	Подбор_Завершение();
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор_Завершение()

	ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе, ИспользоватьВариантУчетаИерархииЭлементов, 
									  |МножественныйВыбор, КлючНазначенияИспользования");
	ПараметрыФормы.ЗакрыватьПриВыборе = Ложь;
	ПараметрыФормы.ИспользоватьВариантУчетаИерархииЭлементов = Истина;
	ПараметрыФормы.МножественныйВыбор = Истина;
	ПараметрыФормы.КлючНазначенияИспользования = "торо_ТиповыеОР";
	ОткрытьФорму("Обработка.торо_ПодборОбъектовРемонтныхРабот.Форма.ФормаПодбораОбъектовДляПланаГрафикаППР",
		ПараметрыФормы, Элементы.дс_СписокОР, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура дс_НаименованиеПриИзменении(Элемент)
	дс_Модифицированность = истина;
	ОбновитьМодель();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьМодель()	
	ИмяРодителя = Строка(дс_Родитель);
	гкс_Модель = ИмяРодителя + " / " + Объект.Наименование 
	+ ?(ЗначениеЗаполнено(Объект.Изготовитель)," / " + Объект.Изготовитель, "") 
	+ ?(ЗначениеЗаполнено(Объект.Комментарий), " / " + Объект.Комментарий, "");
	Объект.гкс_Модель = гкс_Модель;
КонецПроцедуры

&НаСервере
Процедура ОбновитьМодельНаСервере()
	ИмяРодителя = Строка(дс_Родитель);
	гкс_Модель = ИмяРодителя + " / " + Объект.Наименование 
	+ ?(ЗначениеЗаполнено(Объект.Изготовитель), " / " + Объект.Изготовитель, "")
	+ ?(ЗначениеЗаполнено(Объект.Комментарий), " / " + Объект.Комментарий, "");
	Объект.гкс_Модель = гкс_Модель;
КонецПроцедуры

&НаКлиенте
Процедура дс_ИзготовительПриИзменении(Элемент)
	дс_Модифицированность = истина;
	ОбновитьМодель();
КонецПроцедуры

&НаКлиенте
Процедура дс_НаправлениеПриИзменении(Элемент)
	дс_Модифицированность = истина;
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПраваяПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница = Элементы.ГруппаПоказатели ИЛИ (Не ТекущаяСтраница = Элементы.ГруппаНаработка И ЗначениеЗаполнено(дс_Родитель) = Ложь ) Тогда

		Если НЕ МодифицированностьИзмеряемыхПоказателей Тогда
			ОбновитьИзмеряемыеПоказатели(дс_Ссылка, дс_Родитель, дс_СписокИзмеряемыхПоказателей);
			ДоИзмененияПоказатели();
		КонецЕсли;
		
		Если НЕ МодифицированностьПараметровОповещенияОСостоянииОР Тогда
			МассивСтруктурПараметровОповещения = ПолучитьПараметрыОповещенияПоКонтролируемымПоказателям(дс_Ссылка, дс_Родитель);
			ПараметрыОповещенияПоСостояниямОР.Очистить();
			Для Каждого ЭлементМассива Из МассивСтруктурПараметровОповещения Цикл
				
				ЗаполнитьЗначенияСвойств(ПараметрыОповещенияПоСостояниямОР.Добавить(), ЭлементМассива);
				
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли ТекущаяСтраница = Элементы.ГруппаНаработка Тогда
		
		Если Не МодифицированностьПараметровНаработки Тогда
			
			СтруктураВозврата = ПолучитьТаблицуПараметровНаработки(дс_Ссылка, дс_Родитель);
			
			СписокПараметровНаработки.Очистить();
			СписокПараметровНаработкиДоИзменения.Очистить();
			
			Для каждого Элем Из СтруктураВозврата Цикл
				НоваяСтрока = СписокПараметровНаработки.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Элем);
				//
				НоваяСтрока = СписокПараметровНаработкиДоИзменения.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Элем);
			КонецЦикла;
			
		КонецЕсли;
		
		Если Не МодифицированностьМаксЗначНаработки Тогда
			
			СтруктураВозврата = ОбновитьМаксимальныеЗначенияПоказателейНаработки(дс_Ссылка);
			
			ТабМаксимальныхЗначенийНаработки.Очистить();
			Для каждого Элем Из СтруктураВозврата Цикл
				НоваяСтрока = ТабМаксимальныхЗначенийНаработки.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Элем);
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
&НаСервере
Процедура ДоИзмененияПоказатели()
	дс_СписокИзмеряемыхПоказателейДоИзменения.Загрузить(дс_СписокИзмеряемыхПоказателей.Выгрузить());
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПараметрыОповещенияПоКонтролируемымПоказателям(ТиповойОР, Родитель)

	МассивВозврата = Новый Массив;
	Если ЗначениеЗаполнено(ТиповойОР) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.Показатель КАК Показатель,
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.ТиповойОР КАК ТиповойОР,
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.ВариантЗначения КАК ВариантЗначения,
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.Значение КАК Значение,
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.СобытиеВозникновенияОповещения КАК СобытиеВозникновенияОповещения,
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.ВидСравнения КАК ВидСравнения,
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.ID КАК ID,
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.Значение1 КАК Значение1,
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.ВариантЗначения1 КАК ВариантЗначения1,
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.ПараметрыВводаДефекта КАК ПараметрыВводаДефекта
		               |ИЗ
					   |	РегистрСведений.торо_ПараметрыОповещенияОСостоянииОборудования КАК торо_ПараметрыОповещенияОСостоянииОборудования
					   |		Где &ТиповойОР = торо_ПараметрыОповещенияОСостоянииОборудования.ТиповойОР
					   |";
		Запрос.УстановитьПараметр("ТиповойОР", ТиповойОР);
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				СтруктураПараметр = Новый Структура("Показатель,ТиповойОР,ВариантЗначения,Значение,
													|СобытиеВозникновенияОповещения,ВидСравнения,ID,
													|Значение1,ВариантЗначения1,ПараметрыВводаДефекта");
				ЗаполнитьЗначенияСвойств(СтруктураПараметр, Выборка);				
				МассивВозврата.Добавить(СтруктураПараметр);
				
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Возврат МассивВозврата;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьРодителя(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ТиповыеОР.Родитель КАК Родитель
		|ИЗ
		|	Справочник.торо_ТиповыеОР КАК торо_ТиповыеОР
		|ГДЕ
		|	торо_ТиповыеОР.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() = Ложь Тогда 
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Родитель;
	КонецЕсли;
	 
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.торо_ТиповыеОРПрисоединенныеФайлы") Тогда
		
		Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
			дс_ФайлКартинки = ВыбранноеЗначение;
			АдресКартинки = НавигационнаяСсылкаКартинки(дс_ФайлКартинки, УникальныйИдентификатор);
		КонецЕсли;
		дс_Модифицированность = Истина;
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		Если ВыбранноеЗначение.Свойство("ОбщееСвойство") Тогда
			СтандартнаяОбработка = Ложь;
			ДобавитьВНаборНаСервере(ВыбранноеЗначение.ОбщееСвойство);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура гкс_КонструктивныйСоставПриИзменении(Элемент)
	дс_Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Редактировать(Команда)
	Если дс_Редактирование = Ложь Тогда 
		Если ЗначениеЗаполнено(дс_Ссылка) Тогда 
			Если дс_ЭтоГруппа И РольДоступнаНаСервере("гкс_ЗапретРедактированиеКлассовТиповыхОР") Тогда 
				Отказ = Истина;
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = НСтр("ru='Недостаточно прав';en='Not enough rights';es='No hay suficientes derechos'");
				Сообщение.Сообщить();
				Возврат;
			КонецЕсли;
			дс_Редактирование = Истина;
			Элементы.Редактировать.Пометка = дс_Редактирование;
			ОбновитьДоступностьРеквизитов();
		КонецЕсли;
	Иначе
		Если дс_ЭтоГруппа И РольДоступнаНаСервере("гкс_ЗапретРедактированиеКлассовТиповыхОР") Тогда 
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru='Недостаточно прав';en='Not enough rights';es='No hay suficientes derechos'");
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;
		Если МодифицированностьИзмеряемыхПоказателей ИЛИ дс_Модифицированность ИЛИ МодифицированностьПараметровОповещенияОСостоянииОР
			ИЛИ МодифицированностьНормРемонтов
			ИЛИ МодифицированностьПредшествующихРемонтов
			ИЛИ МодифицированностьМаксЗначНаработки
			ИЛИ МодифицированностьПараметровНаработки
			ИЛИ МодифицированностьЗамещаемыхРемонтов Тогда 
			ОписаниеОповещенияПослеВопроса = Новый ОписаниеОповещения("НеРедактироватьПослеВопроса", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещенияПослеВопроса,
				НСтр("ru='Введенные данные не сохранены. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
			Возврат;
		КонецЕсли;
		дс_НеРеагировать = Истина;
		ПодключитьОбработчикОжидания("МожноРеагировать", 0.5, Истина);
		дс_Редактирование = Ложь;
		Элементы.Редактировать.Пометка = дс_Редактирование;
		ОбновитьДоступностьРеквизитов();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НеРедактироватьПослеВопроса(Результат, ДопПараметры)Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда 
		МодифицированностьИзмеряемыхПоказателей = Ложь;
		дс_Модифицированность = Ложь;
		МодифицированностьПараметровОповещенияОСостоянииОР = Ложь;
		МодифицированностьПредшествующихРемонтов = Ложь;
		МодифицированностьЗамещаемыхРемонтов = Ложь;
		МодифицированностьНормРемонтов = Ложь;
		МодифицированностьМаксЗначНаработки = Ложь;
		МодифицированностьПараметровНаработки = Ложь;
		дс_ДоСсылка = Неопределено;
		СписокПриАктивизацииСтроки(Истина);
		дс_Редактирование = Ложь;
		Элементы.Редактировать.Пометка = дс_Редактирование;
		ОбновитьДоступностьРеквизитов();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция РольДоступнаНаСервере(Имя)
	Возврат РольДоступна(Имя);
КонецФункции

&НаКлиенте
Процедура СоздатьМодель(Команда)
	
	Если дс_Редактирование = Истина Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Для создания, покиньте режим редактирования.';en='To create, leave edit mode.'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;

	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные = Неопределено ИЛИ ЗначениеЗаполнено(ТекДанные.Родитель) = Ложь Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Модель можно создать только на 3-м уровне иерархии.'");
		Сообщение.Сообщить();
		Возврат;
	Иначе
		
		Если ТекДанные.ЭтоГруппа = Истина Тогда 
			дс_Родитель = ТекДанные.Ссылка;
		Иначе
			дс_Родитель = ТекДанные.Родитель;
		КонецЕсли;
		дс_ЕстьПодчиненные = Ложь;
		дс_Ссылка = Неопределено;
		дс_ДоСсылка = Неопределено;
		дс_Редактирование = Истина;
		Элементы.Редактировать.Пометка = дс_Редактирование;
		дс_РодительРодителя = ПолучитьРодителя(дс_Родитель);
		//
		дс_НеРеагировать = Истина;
		ПодключитьОбработчикОжидания("МожноРеагировать", 0.5, Истина);
		//
		дс_Код = Неопределено;
		дс_Наименование = "";
		Изготовитель = Неопределено;
		гкс_Модель = "";
		дс_НаборСвойствОР = Неопределено;
		дс_Направление = Неопределено;
		дс_ТипОбъекта = торо_ОбщегоНазначенияКлиентПовтИсп.ПолучитьПеречисление("торо_ТипыОбъектовRCM", "Объект");
		дс_Комментарий = "";
		дс_ЭтоГруппа = Ложь;
		дс_ФайлКартинки = Неопределено;
		//
		дс_СписокОР.Параметры.УстановитьЗначениеПараметра("ТиповойОР", Неопределено);
		дс_СписокОР.Параметры.УстановитьЗначениеПараметра("ОтборВключен", Ложь);
		ПодчиненныеТК.Параметры.УстановитьЗначениеПараметра("Ссылка", Неопределено);
		//
		дс_ЗамещаемыеРемонты.Очистить();
		дс_ПредшествующиеРемонты.Очистить();
		дс_НормативныеРемонты.Очистить();
		гкс_КонструктивныйСостав.Очистить();
		дс_СписокИзмеряемыхПоказателей.Очистить();
		ПараметрыОповещенияПоСостояниямОР.Очистить();
		СписокПараметровНаработки.Очистить();
		СтатусыНормативныхРемонтовДоИзменений.Очистить();
		ТабМаксимальныхЗначенийНаработки.Очистить();
		АдресКартинки = "";
		//
		ОчиститьЛокализацию();
		ОчиститьОбъект(3);
		//
		дс_СписокИзмеряемыхПоказателей.Очистить();
		ОбновитьИзмеряемыеПоказатели(дс_Родитель,дс_РодительРодителя, дс_СписокИзмеряемыхПоказателей);
		Для каждого Строка из дс_СписокИзмеряемыхПоказателей Цикл
			Если Строка.ОбъектРемонта = дс_Родитель Тогда
				Строка.ОбъектРемонта = Неопределено;
			КонецЕсли;
		КонецЦикла;
		
		МассивСтруктурПараметровОповещения = ПолучитьПараметрыОповещенияПоКонтролируемымПоказателям(дс_Родитель,
			дс_РодительРодителя);
		ПараметрыОповещенияПоСостояниямОР.Очистить();
		Для Каждого ЭлементМассива Из МассивСтруктурПараметровОповещения Цикл
			НоваяСтрока = ПараметрыОповещенияПоСостояниямОР.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементМассива);
			Если НоваяСтрока.ТиповойОР = дс_Родитель Тогда
				НоваяСтрока.ТиповойОР = Неопределено;
			КонецЕсли;
		КонецЦикла;

		СтруктураВозврата = ПолучитьТаблицуПараметровНаработки(дс_Родитель, дс_РодительРодителя);
		СписокПараметровНаработки.Очистить();
		Для каждого Элем Из СтруктураВозврата Цикл
			НоваяСтрока = СписокПараметровНаработки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Элем);
			Если НоваяСтрока.ОбъектРемонта = дс_Родитель Тогда
				НоваяСтрока.ОбъектРемонта = Неопределено;
			КонецЕсли;
		КонецЦикла;
		
		СтруктураВозврата = ОбновитьМаксимальныеЗначенияПоказателейНаработки(дс_Родитель);
		ТабМаксимальныхЗначенийНаработки.Очистить();
		Для каждого Элем Из СтруктураВозврата Цикл
			НоваяСтрока = ТабМаксимальныхЗначенийНаработки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Элем);
			Если НоваяСтрока.ОбъектРемонта = дс_Родитель Тогда
				НоваяСтрока.ОбъектРемонта = Неопределено;
			КонецЕсли;
		КонецЦикла;
		
		ПолучитьТаблицыНормативов(дс_Родитель);
		
		Массив = Новый Массив;
		Массив.Добавить("дс_СписокИзмеряемыхПоказателей");
		Массив.Добавить("ПараметрыОповещенияПоСостояниямОР");
		Массив.Добавить("СписокПараметровНаработки");
		Массив.Добавить("ТабМаксимальныхЗначенийНаработки");
		Массив.Добавить("дс_НормативныеРемонты");
		Массив.Добавить("дс_ПредшествующиеРемонты");
		Массив.Добавить("дс_ЗамещаемыеРемонты");
		торо_СобытияФормКлиент.ЗаполнитьСтруктуруДанныхДоРедактирования(СтруктураДанныхДоРедактирования,Массив);
		
		ОбновитьДоступностьРеквизитов();
		ОбновитьВидимостьРеквизитов();
		
		дс_Ссылка = Неопределено;
		
		МодифицированностьИзмеряемыхПоказателей = Истина;
		дс_Модифицированность = Истина;
		МодифицированностьПараметровОповещенияОСостоянииОР = Истина;
		МодифицированностьПредшествующихРемонтов = Истина;
		МодифицированностьЗамещаемыхРемонтов = Истина;
		МодифицированностьНормРемонтов = Истина;
		МодифицированностьМаксЗначНаработки = Истина;
		МодифицированностьПараметровНаработки = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьТОР(Команда)
	
	Если дс_Редактирование = Истина Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Для копирования, покиньте режим редактирования.'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		// гкс+ [Релиз 1] Куст 20.01.2021
		Если ТекДанные.ЭтоГруппа И РольДоступнаНаСервере("гкс_ЗапретРедактированиеКлассовТиповыхОР") Тогда 
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru='Недостаточно прав';en='Not enough rights';es='No hay suficientes derechos'");
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;
		// гкс- [Релиз 1] Куст 20.01.2021
		дс_НеРеагировать = Истина;
		ПодключитьОбработчикОжидания("МожноРеагировать", 0.5, Истина);
		
		дс_Редактирование = Истина;
		Элементы.Редактировать.Пометка = дс_Редактирование;
		
		дс_Ссылка = ТекДанные.Ссылка;
		дс_Родитель = ТекДанные.Родитель;
		дс_Код = ТекДанные.Код;
		дс_Наименование = ТекДанные.Наименование;
		Изготовитель = ТекДанные.Изготовитель;
		гкс_Модель = ТекДанные.гкс_Модель;
		дс_НаборСвойствОР = ТекДанные.НаборСвойствОР;
		дс_Направление = ТекДанные.Направление;
		дс_ТипОбъекта = ТекДанные.ТипОбъекта;
		дс_Комментарий = ТекДанные.Комментарий;
		дс_ЭтоГруппа = ТекДанные.ЭтоГруппа;
		дс_ФайлКартинки = ТекДанные.ФайлКартинки;
		
		дс_СписокОР.Параметры.УстановитьЗначениеПараметра("ТиповойОР",Неопределено);
		дс_СписокОР.Параметры.УстановитьЗначениеПараметра("ОтборВключен",Ложь);
		дс_СписокИзмеряемыхПоказателей.Очистить();
		ОбновитьИзмеряемыеПоказатели(дс_Ссылка,дс_Родитель, дс_СписокИзмеряемыхПоказателей);
		Для каждого Строка из дс_СписокИзмеряемыхПоказателей Цикл
			Если Строка.ОбъектРемонта = дс_Ссылка Тогда
				Строка.ОбъектРемонта = Неопределено;
			КонецЕсли;
		КонецЦикла;
		
		МассивСтруктурПараметровОповещения = ПолучитьПараметрыОповещенияПоКонтролируемымПоказателям(дс_Ссылка, дс_Родитель);
		ПараметрыОповещенияПоСостояниямОР.Очистить();
		Для Каждого ЭлементМассива Из МассивСтруктурПараметровОповещения Цикл
			НоваяСтрока = ПараметрыОповещенияПоСостояниямОР.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементМассива);
			Если НоваяСтрока.ТиповойОР = дс_Ссылка Тогда
				НоваяСтрока.ТиповойОР = Неопределено;
			КонецЕсли;
		КонецЦикла;

		СтруктураВозврата = ПолучитьТаблицуПараметровНаработки(дс_Ссылка, дс_Родитель);
		СписокПараметровНаработки.Очистить();
		Для каждого Элем Из СтруктураВозврата Цикл
			НоваяСтрока = СписокПараметровНаработки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Элем);
			Если НоваяСтрока.ОбъектРемонта = дс_Ссылка Тогда
				НоваяСтрока.ОбъектРемонта = Неопределено;
			КонецЕсли;
		КонецЦикла;
	
			СтруктураВозврата = ОбновитьМаксимальныеЗначенияПоказателейНаработки(дс_Ссылка);
			ТабМаксимальныхЗначенийНаработки.Очистить();
			Для каждого Элем Из СтруктураВозврата Цикл
				НоваяСтрока = ТабМаксимальныхЗначенийНаработки.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Элем);
				Если НоваяСтрока.ОбъектРемонта = дс_Ссылка Тогда
					НоваяСтрока.ОбъектРемонта = Неопределено;
				КонецЕсли;
			КонецЦикла;
		
		ТемпСсылка = дс_Ссылка;
		дс_Ссылка = Неопределено;
		ПолучитьТаблицыНормативов(ТемпСсылка);
		дс_Ссылка = ТемпСсылка;

		Массив = Новый Массив;
		Массив.Добавить("дс_СписокИзмеряемыхПоказателей");
		Массив.Добавить("ПараметрыОповещенияПоСостояниямОР");
		Массив.Добавить("СписокПараметровНаработки");
		Массив.Добавить("ТабМаксимальныхЗначенийНаработки");
		Массив.Добавить("дс_НормативныеРемонты");
		Массив.Добавить("дс_ПредшествующиеРемонты");
		Массив.Добавить("дс_ЗамещаемыеРемонты");
		торо_СобытияФормКлиент.ЗаполнитьСтруктуруДанныхДоРедактирования(СтруктураДанныхДоРедактирования, Массив);
		
		ОбновитьДоступностьРеквизитов();
		ОбновитьВидимостьРеквизитов();
		
		дс_Ссылка = Неопределено;
		
		МодифицированностьИзмеряемыхПоказателей = Истина;
		дс_Модифицированность = Истина;
		МодифицированностьПараметровОповещенияОСостоянииОР = Истина;
		МодифицированностьПредшествующихРемонтов = Истина;
		МодифицированностьЗамещаемыхРемонтов = Истина;
		МодифицированностьНормРемонтов = Истина;
		МодифицированностьМаксЗначНаработки = Истина;
		МодифицированностьПараметровНаработки = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКласс(Команда)
	
	Если дс_Редактирование = Истина Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Для создания, покиньте режим редактирования.';en='To create, leave edit mode.'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	дс_НеРеагировать = Истина;
	ПодключитьОбработчикОжидания("МожноРеагировать", 0.5, Истина);
	
	дс_ЕстьПодчиненные = Ложь;
	дс_Родитель = Неопределено;
	дс_Ссылка = Неопределено;
	дс_ДоСсылка = Неопределено;
	дс_Редактирование = Истина;
	Элементы.Редактировать.Пометка = дс_Редактирование;
	дс_Код = Неопределено;
	дс_Наименование = "";
	Изготовитель = Неопределено;
	гкс_Модель = "";
	дс_НаборСвойствОР = Неопределено;
	дс_Направление = Неопределено;
	дс_ТипОбъекта = торо_ОбщегоНазначенияКлиентПовтИсп.ПолучитьПеречисление("торо_ТипыОбъектовRCM", "Объект");
	дс_Комментарий = "";
	дс_ЭтоГруппа = Истина;
	дс_ФайлКартинки = Неопределено;
	дс_СписокОР.Параметры.УстановитьЗначениеПараметра("ТиповойОР", Неопределено);
	дс_СписокОР.Параметры.УстановитьЗначениеПараметра("ОтборВключен", Ложь);
	ПодчиненныеТК.Параметры.УстановитьЗначениеПараметра("Ссылка", Неопределено);
	дс_ЗамещаемыеРемонты.Очистить();
	дс_ПредшествующиеРемонты.Очистить();
	дс_НормативныеРемонты.Очистить();
	гкс_КонструктивныйСостав.Очистить();
	дс_СписокИзмеряемыхПоказателей.Очистить();
	ПараметрыОповещенияПоСостояниямОР.Очистить();
	СписокПараметровНаработки.Очистить();
	СтатусыНормативныхРемонтовДоИзменений.Очистить();
	ТабМаксимальныхЗначенийНаработки.Очистить();
	ДополнительныеРеквизиты.Очистить();
	АдресКартинки = "";
	
	ОчиститьЛокализацию();
	ОчиститьОбъект(1);
	
	Массив = Новый Массив;
	Массив.Добавить("дс_СписокИзмеряемыхПоказателей");
	Массив.Добавить("ПараметрыОповещенияПоСостояниямОР");
	Массив.Добавить("СписокПараметровНаработки");
	Массив.Добавить("ТабМаксимальныхЗначенийНаработки");
	Массив.Добавить("дс_НормативныеРемонты");
	Массив.Добавить("дс_ПредшествующиеРемонты");
	Массив.Добавить("дс_ЗамещаемыеРемонты");
	торо_СобытияФормКлиент.ЗаполнитьСтруктуруДанныхДоРедактирования(СтруктураДанныхДоРедактирования, Массив);
	
	ОбновитьДоступностьРеквизитов();
	ОбновитьВидимостьРеквизитов();
	
	МодифицированностьИзмеряемыхПоказателей = Истина;
	дс_Модифицированность = Истина;
	МодифицированностьПараметровОповещенияОСостоянииОР = Истина;
	МодифицированностьПредшествующихРемонтов = Истина;
	МодифицированностьЗамещаемыхРемонтов = Истина;
	МодифицированностьНормРемонтов = Истина;
	МодифицированностьМаксЗначНаработки = Истина;
	МодифицированностьПараметровНаработки = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьЛокализацию()
	// Локализация
	//СтроковыеРеквизиты = "Наименование,Изготовитель,Комментарий,гкс_Модель";
	СтроковыеРеквизиты = "Наименование,Комментарий,гкс_Модель";
		
	торо_ЛокализацияСобытияФорм.ОчиститьПереводы(ЭтаФорма, СтроковыеРеквизиты);
	// Локализация
КонецПроцедуры

&НаСервере
Процедура ОчиститьОбъект(ТекУровень)
	Если ТекУровень = 3 Тогда 
		ТекОб = Справочники.торо_ТиповыеОР.СоздатьЭлемент();
	Иначе
		ТекОб = Справочники.торо_ТиповыеОР.СоздатьГруппу();
	КонецЕсли;
	ЗначениеВДанныеФормы(ТекОб,Объект);
	Объект.ДополнительныеРеквизиты.Очистить();
	УправлениеСвойствами.ЗаполнитьДополнительныеРеквизитыВФорме(ЭтаФорма, Неопределено, , Неопределено, "НаборСвойствОР");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПодКласс(Команда)
	
	Если дс_Редактирование = Истина Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Для создания, покиньте режим редактирования.';en='To create, leave edit mode.'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные = Неопределено Или ТекДанные.ЭтоГруппа = Ложь Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Подкласс можно создать только на 2-м уровне иерархии.'");
		Сообщение.Сообщить();
		Возврат;
	Иначе
		Если ЗначениеЗаполнено(ТекДанные.Родитель) Тогда 
		    дс_Родитель = ТекДанные.Родитель;
		Иначе
			дс_Родитель = ТекДанные.Ссылка;
		КонецЕсли;
		дс_ЕстьПодчиненные = Ложь;
		дс_Ссылка = Неопределено;
		дс_ДоСсылка = Неопределено;
		дс_Редактирование = Истина;
		Элементы.Редактировать.Пометка = дс_Редактирование;
		дс_РодительРодителя = ПолучитьРодителя(дс_Родитель);
		
		дс_НеРеагировать = Истина;
		ПодключитьОбработчикОжидания("МожноРеагировать", 0.5, Истина);
		
		дс_Код = Неопределено;
		дс_Наименование = "";
		Изготовитель = Неопределено;
		гкс_Модель = "";
		дс_НаборСвойствОР = Неопределено;
		дс_Направление = Неопределено;
		дс_ТипОбъекта = торо_ОбщегоНазначенияКлиентПовтИсп.ПолучитьПеречисление("торо_ТипыОбъектовRCM", "Объект");
		дс_Комментарий = "";
		дс_ЭтоГруппа = Истина;
		дс_ФайлКартинки = Неопределено;
		ШаблоныТК.Очистить();
		ШаблоныТО.Очистить();
		
		дс_СписокОР.Параметры.УстановитьЗначениеПараметра("ТиповойОР", Неопределено);
		дс_СписокОР.Параметры.УстановитьЗначениеПараметра("ОтборВключен", Ложь);
		ПодчиненныеТК.Параметры.УстановитьЗначениеПараметра("Ссылка", Неопределено);
		
		дс_ЗамещаемыеРемонты.Очистить();
		дс_ПредшествующиеРемонты.Очистить();
		дс_НормативныеРемонты.Очистить();
		гкс_КонструктивныйСостав.Очистить();
		дс_СписокИзмеряемыхПоказателей.Очистить();
		ПараметрыОповещенияПоСостояниямОР.Очистить();
		СписокПараметровНаработки.Очистить();
		СтатусыНормативныхРемонтовДоИзменений.Очистить();
		ТабМаксимальныхЗначенийНаработки.Очистить();
		АдресКартинки = "";
		
		ОчиститьЛокализацию();
		ОчиститьОбъект(2);
		
		дс_СписокИзмеряемыхПоказателей.Очистить();
		ОбновитьИзмеряемыеПоказатели(дс_Родитель,дс_РодительРодителя, дс_СписокИзмеряемыхПоказателей);
		Для каждого Строка из дс_СписокИзмеряемыхПоказателей Цикл
			Если Строка.ОбъектРемонта = дс_Родитель Тогда
				Строка.ОбъектРемонта = дс_Ссылка;
			КонецЕсли;
		КонецЦикла;
		
		МассивСтруктурПараметровОповещения = ПолучитьПараметрыОповещенияПоКонтролируемымПоказателям(дс_Родитель, дс_РодительРодителя);
		ПараметрыОповещенияПоСостояниямОР.Очистить();
		Для Каждого ЭлементМассива Из МассивСтруктурПараметровОповещения Цикл
			НоваяСтрока = ПараметрыОповещенияПоСостояниямОР.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементМассива);
			Если НоваяСтрока.ТиповойОР = дс_Родитель Тогда
				НоваяСтрока.ТиповойОР = дс_Ссылка;
			КонецЕсли;
		КонецЦикла;

		СтруктураВозврата = ПолучитьТаблицуПараметровНаработки(дс_Родитель, дс_РодительРодителя);
		СписокПараметровНаработки.Очистить();
		Для каждого Элем Из СтруктураВозврата Цикл
			НоваяСтрока = СписокПараметровНаработки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Элем);
			Если НоваяСтрока.ОбъектРемонта = дс_Родитель Тогда
				НоваяСтрока.ОбъектРемонта = дс_Ссылка;
			КонецЕсли;
		КонецЦикла;
		
		СтруктураВозврата = ОбновитьМаксимальныеЗначенияПоказателейНаработки(дс_Родитель);
		ТабМаксимальныхЗначенийНаработки.Очистить();
		Для каждого Элем Из СтруктураВозврата Цикл
			НоваяСтрока = ТабМаксимальныхЗначенийНаработки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Элем);
			Если НоваяСтрока.ОбъектРемонта = дс_Родитель Тогда
				НоваяСтрока.ОбъектРемонта = дс_Ссылка;
			КонецЕсли;
		КонецЦикла;
		//
		Массив = Новый Массив;
		Массив.Добавить("дс_СписокИзмеряемыхПоказателей");
		Массив.Добавить("ПараметрыОповещенияПоСостояниямОР");
		Массив.Добавить("СписокПараметровНаработки");
		Массив.Добавить("ТабМаксимальныхЗначенийНаработки");
		Массив.Добавить("дс_НормативныеРемонты");
		Массив.Добавить("дс_ПредшествующиеРемонты");
		Массив.Добавить("дс_ЗамещаемыеРемонты");
		торо_СобытияФормКлиент.ЗаполнитьСтруктуруДанныхДоРедактирования(СтруктураДанныхДоРедактирования, Массив);
		
		ОбновитьДоступностьРеквизитов();
		ОбновитьВидимостьРеквизитов();
		
		дс_Ссылка = Неопределено;
		
		МодифицированностьИзмеряемыхПоказателей = Истина;
		дс_Модифицированность = Истина;
		МодифицированностьПараметровОповещенияОСостоянииОР = Истина;
		МодифицированностьПредшествующихРемонтов = Истина;
		МодифицированностьЗамещаемыхРемонтов = Истина;
		МодифицированностьНормРемонтов = Истина;
		МодифицированностьМаксЗначНаработки = Истина;
		МодифицированностьПараметровНаработки = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПараметровНаработкиПриИзменении(Элемент)
	ТекДанные = Элементы.СписокПараметровНаработки.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		ТекДанные.Изменен = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура дс_СписокИзмеряемыхПоказателейПриИзменении(Элемент)
	ТекДанные = Элементы.дс_СписокИзмеряемыхПоказателей.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		ТекДанные.Изменен = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыОповещенияПоСостояниямОРПриИзменении(Элемент)
	ТекДанные = Элементы.СписокПараметровНаработки.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		ТекДанные.Изменен = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// СтандартныеПодсистемы.Свойства
	Если ИмяСобытия = "ИзмененИТК" Тогда 
		
		Элементы.дс_ТК_Операции.Обновить();
		Элементы.дс_ТК_МатЗатраты.Обновить();
		Элементы.дс_ТК_Трудозатраты.Обновить();
		Элементы.дс_ТК_Инструменты.Обновить();
		
		Элементы.дс_ТК_Операции1.Обновить();
		Элементы.дс_ТК_МатЗатраты1.Обновить();
		Элементы.дс_ТК_Трудозатраты1.Обновить();
		Элементы.дс_ТК_Инструменты1.Обновить();
		
		Возврат;
	КонецЕсли;
	дс_НеРеагировать = Истина;
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтаФорма, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтаФорма);
		торо_УправлениеСвойствамиКлиентСервер.НастроитьКнопкиКоманднойПанелиТаблицыДопРеквизитов(ЭтаФорма, Истина);
		дс_Модифицированность = Истина;
	КонецЕсли;
	ПодключитьОбработчикОжидания("МожноРеагировать", 0.5, Истина);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаКлиенте
Процедура СохранитьПередЗакрытиемПослеВопроса(Результат, ДопПараметры)Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда 
		СохранитьИзмененияПослеВопроса(КодВозвратаДиалога.Да, ДопПараметры);
	Иначе
		дс_МожноЗакрывать = Истина;
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаличиеПодчиненных(ТекСсылка)
	дс_ЕстьПодчиненные = Ложь;
	Если ЗначениеЗаполнено(ТекСсылка) = Ложь Тогда 
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ТиповыеОР.Наименование КАК Наименование
		|ИЗ
		|	Справочник.торо_ТиповыеОР КАК торо_ТиповыеОР
		|ГДЕ
		|	торо_ТиповыеОР.Родитель = &Родитель";
	
	Запрос.УстановитьПараметр("Родитель", ТекСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	дс_ЕстьПодчиненные = НЕ РезультатЗапроса.Пустой();
КонецПроцедуры

// Гкс+[TOIR20-94] Борисов В.М. от 05.06.2020. Добавлено:{
&НаКлиенте
Процедура гкс_Подключаемый_ОтветственныйИнженерПриИзменении()
	
	дс_Модифицированность = Истина;
	
КонецПроцедуры // } Гкс-[TOIR20-94] Борисов В.М. от 05.06.2020.

// Гкс+[TOIR20-94] Борисов В.М. от 05.06.2020. Добавлено:{
&НаКлиенте
Процедура гкс_Подключаемый_КритичностьПриИзменении()
	
	дс_Модифицированность = Истина;
	
КонецПроцедуры // } Гкс-[TOIR20-94] Борисов В.М. от 05.06.2020.
#КонецОбласти

#Область Удаление
&НаСервереБезКонтекста
Функция ЕстьПодчиненныеТК(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ИдентификаторыТехКарт.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.торо_ИдентификаторыТехКарт КАК ТК_Родители
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ИдентификаторыТехКарт КАК торо_ИдентификаторыТехКарт
		|		ПО (ТК_Родители.гкс_Владелец = &Ссылка
		|				ИЛИ ТК_Родители.Родитель.гкс_Владелец = &Ссылка
		|				ИЛИ ТК_Родители.Родитель.Родитель.гкс_Владелец = &Ссылка)
		|			И (торо_ИдентификаторыТехКарт.Родитель = ТК_Родители.Ссылка)
		|			И (торо_ИдентификаторыТехКарт.ЭтоГруппа = ЛОЖЬ)";	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);	
	РезультатЗапроса = Запрос.Выполнить();	
	Возврат Не РезультатЗапроса.Пустой();
КонецФункции
&НаСервереБезКонтекста
Процедура ПометитьТиповойОР(Ссылка, Флаг)
	Объект = Ссылка.ПолучитьОбъект();
	Объект.УстановитьПометкуУдаления(Флаг);
КонецПроцедуры

&НаКлиенте
Процедура ПометитьНаУдалениеПослеВопроса(Результат, ДопПараметры)Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда 
		ПометитьТиповойОР(ДопПараметры.ТОР, Истина);
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьТОР(Команда)
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		Отказ = Ложь;
		Если ТекДанные.ПометкаУдаления = Ложь И ЕстьПодчиненныеТК(ТекДанные.Ссылка) Тогда 
			Отказ = истина;
			СтруктураОпОп = Новый Структура("ТОР", ТекДанные.Ссылка);
			ОписаниеОповещенияПослеВопроса = Новый ОписаниеОповещения("ПометитьНаУдалениеПослеВопроса", ЭтотОбъект, СтруктураОпОп);
			ПоказатьВопрос(ОписаниеОповещенияПослеВопроса,
			НСтр("ru='Для удаляемого объекта есть вложенные технологические карты. Пометить их на удаление?'"), РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
		Если Не Отказ Тогда 
			ПометитьТиповойОР(ТекДанные.Ссылка,Не ТекДанные.ПометкаУдаления);
			Элементы.Список.Обновить();
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура гкс_КонструктивныйСоставКомпонентПриИзменении(Элемент)
	дс_Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ТЧТехКарт

&НаСервере
Процедура ЗаполнитьТЧТехКарт(СсылкаТОР)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТехКарты.Ссылка КАК Ссылка,
		|	ТехКарты.гкс_Обслуживание КАК гкс_Обслуживание,
		|	ТехКарты.Статус КАК Статус,
		|	ТехКарты.ПометкаУдаления КАК ПометкаУдаления
		|ПОМЕСТИТЬ НужныеИТК
		|ИЗ
		|	Справочник.торо_ИдентификаторыТехКарт КАК ИТКГруппа
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ИдентификаторыТехКарт КАК ТехКарты
		|		ПО ИТКГруппа.Ссылка = ТехКарты.Родитель
		|			И (ТехКарты.ЭтоГруппа = ЛОЖЬ)
		|ГДЕ
		|	ИТКГруппа.гкс_Владелец = &СсылкаТОР
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НужныеИТК.Ссылка КАК ТК,
		|	НужныеИТК.гкс_Обслуживание КАК Обслуживание,
		|	НужныеИТК.Статус КАК Статус,
		|	торо_ВерсииТехКартСрезПоследних.ТехКарта КАК ТехКарта,
		|	торо_ВерсииТехКартСрезПоследних.ТехКарта.ДатаПринятия КАК ДатаПринятия,
		// Гкс+[TOIR20-194] Селимов от 17.11.2020. Добавлено:{
		|	торо_ВерсииТехКартСрезПоследних.ТехКарта.гкс_ПериодДействия КАК гкс_ПериодДействия,
		|	торо_ВерсииТехКартСрезПоследних.ТехКарта.гкс_КоличествоПериодовДействия КАК гкс_КоличествоПериодовДействия,
		// } Гкс-[TOIR20-194] 
		|	НужныеИТК.ПометкаУдаления КАК ПометкаУдаления
		|ПОМЕСТИТЬ СТехКартами
		|ИЗ
		|	НужныеИТК КАК НужныеИТК
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВерсииТехКарт.СрезПоследних(
		|				,
		|				ИдентификаторТехКарты В
		|					(ВЫБРАТЬ
		|						ТЧ.Ссылка
		|					ИЗ
		|						НужныеИТК КАК ТЧ)) КАК торо_ВерсииТехКартСрезПоследних
		|		ПО НужныеИТК.Ссылка = торо_ВерсииТехКартСрезПоследних.ИдентификаторТехКарты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СТехКартами.ТК КАК ТК,
		|	СТехКартами.Обслуживание КАК Обслуживание,
		|	СТехКартами.Статус КАК Статус,
		|	СТехКартами.ТехКарта КАК ТехКарта,
		|	СТехКартами.ДатаПринятия КАК ДатаПринятия,
		// Гкс+[TOIR20-194] Селимов от 17.11.2020. Добавлено:{
		|	СТехКартами.гкс_ПериодДействия КАК гкс_ПериодДействия,
		|	СТехКартами.гкс_КоличествоПериодовДействия КАК гкс_КоличествоПериодовДействия,
		// } Гкс-[TOIR20-194] 
		|	СТехКартами.ПометкаУдаления КАК ПометкаУдаления
		|ИЗ
		|	СТехКартами КАК СТехКартами
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТК
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СТехКартами.ТехКарта КАК ТехКарта,
		|	торо_ТехКартыСписокОпераций.Операция КАК Операция,
		|	торо_ТехКартыСписокОпераций.Количество КАК Количество,
		|	торо_ТехКартыСписокОпераций.СпособВыполнения КАК СпособВыполнения,
		|	торо_ТехКартыСписокОпераций.гкс_Примечание КАК гкс_Примечание,
		|	торо_ТехКартыСписокОпераций.ID КАК УИД
		// Гкс+[TOIR20-98] Борисов В.М. от 21.05.2020. Добавлено:{
		|	,торо_ТехКартыСписокОпераций.НомерСтроки КАК НомерСтроки
		// } Гкс-[TOIR20-98] Борисов В.М. от 21.05.2020.
		|ИЗ
		|	СТехКартами КАК СТехКартами
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТехКарты.СписокОпераций КАК торо_ТехКартыСписокОпераций
		|		ПО СТехКартами.ТехКарта = торо_ТехКартыСписокОпераций.Ссылка
		// Гкс+[TOIR20-98] Борисов В.М. от 21.05.2020. Добавлено:{
		|УПОРЯДОЧИТЬ ПО
		|	торо_ТехКартыСписокОпераций.НомерСтроки
		// } Гкс-[TOIR20-98] Борисов В.М. от 21.05.2020.
		|ИТОГИ ПО
		|	ТехКарта";
	
	Запрос.УстановитьПараметр("СсылкаТОР", СсылкаТОР);	
	РезультатЗапроса = Запрос.ВыполнитьПакет();	
	ШаблоныТК.Очистить();
	ШаблоныТО.Очистить();
	Если РезультатЗапроса[2].Пустой() = Ложь Тогда 
		Выборка = РезультатЗапроса[2].Выбрать();	
		ВыборкаТО = РезультатЗапроса[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
		Пока Выборка.Следующий() Цикл
			СтрокаТК = ШаблоныТК.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТК,Выборка);
			Если ВыборкаТО.НайтиСледующий(Новый Структура("ТехКарта", Выборка.ТехКарта)) Тогда 
				ВыборкаТОПодробно = ВыборкаТО.Выбрать();
				Пока ВыборкаТОПодробно.Следующий() Цикл
					СтрокаТО = ШаблоныТО.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТО, ВыборкаТОПодробно);
					СтрокаТО.ТК = Выборка.ТК;
				КонецЦикла;
			КонецЕсли;
			ВыборкаТО.Сбросить();
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныТКПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.ШаблоныТК.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		Если ЗначениеЗаполнено(ТекДанные.ТК) Тогда 
			Элементы.ШаблоныТО.ОтборСтрок = Новый ФиксированнаяСтруктура("ТК",ТекДанные.ТК);
		Иначе
			Элементы.ШаблоныТО.ОтборСтрок = Новый ФиксированнаяСтруктура("ИД",ТекДанные.ИД);
		КонецЕсли;
		ДоступностьПолей = ТекДанные.Статус = _СтатусВРаботе;
	Иначе
		Элементы.ШаблоныТО.ОтборСтрок = Новый ФиксированнаяСтруктура("ТК,ИД",Неопределено,Неопределено);
		ДоступностьПолей = Ложь;
	КонецЕсли;
	Если Элементы.ШаблоныТК.ИзменятьПорядокСтрок = Истина Тогда 
		Элементы.ШаблоныТО.ИзменятьСоставСтрок = ДоступностьПолей;
		Элементы.ШаблоныТО.ИзменятьПорядокСтрок = ДоступностьПолей;
		//
		Элементы.ШаблоныТООперация.ТолькоПросмотр = Не ДоступностьПолей;
		Элементы.ШаблоныТОКоличество.ТолькоПросмотр = Не ДоступностьПолей;
		Элементы.ШаблоныТОСпособВыполнения.ТолькоПросмотр = Не ДоступностьПолей;
		Элементы.ШаблоныТОтк_СдвинутьТОВниз.Доступность = ДоступностьПолей;
		Элементы.ШаблоныТОтк_СдвинутьТОВверх.Доступность = ДоступностьПолей;
		Элементы.ШаблоныТОтк_ДобавитьТО.Доступность = ДоступностьПолей;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьДоступностьТЧТехКарт()
	
	ПравоРедактирования = (РольДоступна("ПолныеПрава")
	// гкс+ [Релиз19] Деснол
	ИЛИ РольДоступна("гкс_РедактированиеЗаявкиНаРемонт")
	// гкс- [Релиз19]
	ИЛИ РольДоступна("гкс_ИзменениеШаблоновТехКарт")) И ЗначениеЗаполнено(дс_Ссылка);
	Элементы.ШаблоныТК.ИзменятьСоставСтрок = ПравоРедактирования;
	Элементы.ШаблоныТК.ИзменятьПорядокСтрок = ПравоРедактирования;
	Элементы.ШаблоныТО.ИзменятьСоставСтрок = ПравоРедактирования;
	Элементы.ШаблоныТО.ИзменятьПорядокСтрок = ПравоРедактирования;
	//
	Элементы.ШаблоныТКОбслуживание.ТолькоПросмотр = Не ПравоРедактирования;
	Элементы.ШаблоныТКДатаПринятия.ТолькоПросмотр = Не ПравоРедактирования;
	Элементы.ШаблоныТКСтатус.ТолькоПросмотр = Не ПравоРедактирования;
	Элементы.ШаблоныТООперация.ТолькоПросмотр = Не ПравоРедактирования;
	Элементы.ШаблоныТОКоличество.ТолькоПросмотр = Не ПравоРедактирования;
	Элементы.ШаблоныТОСпособВыполнения.ТолькоПросмотр = Не ПравоРедактирования;
	Элементы.ШаблоныТКСохранитьИзмененияТЧТехКарт.Доступность = ПравоРедактирования;
	Элементы.ШаблоныТОтк_СдвинутьТОВниз.Доступность = ПравоРедактирования;
	Элементы.ШаблоныТОтк_СдвинутьТОВверх.Доступность = ПравоРедактирования;
	Элементы.ШаблоныТОтк_ДобавитьТО.Доступность = ПравоРедактирования;
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныТОПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если Не ОтменаРедактирования Тогда 
		ТекДанныеТК = Элементы.ШаблоныТК.ТекущиеДанные;
		ТекДанные = Элементы.ШаблоныТО.ТекущиеДанные;
		Если Не ТекДанные = Неопределено Тогда 
			Если Не ТекДанныеТК = Неопределено Тогда 
				ТекДанные.ТК = ТекДанныеТК.ТК;
				ТекДанные.ИД = ТекДанныеТК.ИД;
				МодифицированностьТЧТехКарт = Истина;
				ТекДанныеТК.Изменен = Истина;
			КонецЕсли;
			Если ЗначениеЗаполнено(ТекДанные.Количество) = Ложь Тогда 
				ТекДанные.Количество = 1;
				МодифицированностьТЧТехКарт = Истина;
				ТекДанныеТК.Изменен = Истина;
			КонецЕсли;
			Если ЗначениеЗаполнено(ТекДанные.СпособВыполнения) = Ложь Тогда 
				ТекДанные.СпособВыполнения = _ХозСпособ;
				МодифицированностьТЧТехКарт = Истина;
				ТекДанныеТК.Изменен = Истина;
			КонецЕсли;
			Если ЗначениеЗаполнено(ТекДанные.УИД) = Ложь Тогда 
				ТекДанные.УИД = Строка(Новый УникальныйИдентификатор());
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныТООперацияПриИзменении(Элемент)
	МодифицированностьТЧТехКарт = Истина;
	ТекДанные = Элементы.ШаблоныТК.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		ТекДанные.Изменен = Истина;
		Если ЗначениеЗаполнено(ТекДанные.ТК) Тогда 
			Элементы.ШаблоныТО.ОтборСтрок = Новый ФиксированнаяСтруктура("ТК",ТекДанные.ТК);
		Иначе
			Элементы.ШаблоныТО.ОтборСтрок = Новый ФиксированнаяСтруктура("ИД",ТекДанные.ИД);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныТОКоличествоПриИзменении(Элемент)
	МодифицированностьТЧТехКарт = Истина;
	ТекДанные = Элементы.ШаблоныТК.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		ТекДанные.Изменен = Истина;
		Если ЗначениеЗаполнено(ТекДанные.ТК) Тогда 
			Элементы.ШаблоныТО.ОтборСтрок = Новый ФиксированнаяСтруктура("ТК",ТекДанные.ТК);
		Иначе
			Элементы.ШаблоныТО.ОтборСтрок = Новый ФиксированнаяСтруктура("ИД",ТекДанные.ИД);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныТОСпособВыполненияПриИзменении(Элемент)
	МодифицированностьТЧТехКарт = Истина;
	ТекДанные = Элементы.ШаблоныТК.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		ТекДанные.Изменен = Истина;
		ТекДанные = Элементы.ШаблоныТК.ТекущиеДанные;
		Если ЗначениеЗаполнено(ТекДанные.ТК) Тогда 
			Элементы.ШаблоныТО.ОтборСтрок = Новый ФиксированнаяСтруктура("ТК",ТекДанные.ТК);
		Иначе
			Элементы.ШаблоныТО.ОтборСтрок = Новый ФиксированнаяСтруктура("ИД",ТекДанные.ИД);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныТКОбслуживаниеПриИзменении(Элемент)
	МодифицированностьТЧТехКарт = Истина;
	ТекДанные = Элементы.ШаблоныТК.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		ТекДанные.Изменен = Истина;
		Если ЗначениеЗаполнено(ТекДанные.ТК) = Ложь
			И ЗначениеЗаполнено(ТекДанные.ИД) = Ложь Тогда 
			ТекДанные.ИД = Строка(Новый УникальныйИдентификатор());
			ТекДанные.Изменен = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныТКДатаПринятияПриИзменении(Элемент)
	МодифицированностьТЧТехКарт = Истина;
	ТекДанные = Элементы.ШаблоныТК.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		ТекДанные.Изменен = Истина;
		Если ЗначениеЗаполнено(ТекДанные.ТК) = Ложь
			И ЗначениеЗаполнено(ТекДанные.ИД) = Ложь Тогда 
			ТекДанные.ИД = Строка(Новый УникальныйИдентификатор());
			ТекДанные.Изменен = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныТКСтатусПриИзменении(Элемент)
	МодифицированностьТЧТехКарт = Истина;
	ТекДанные = Элементы.ШаблоныТК.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		ТекДанные.Изменен = Истина;
		Если ЗначениеЗаполнено(ТекДанные.ТК) = Ложь
			И ЗначениеЗаполнено(ТекДанные.ИД) = Ложь Тогда 
			ТекДанные.ИД = Строка(Новый УникальныйИдентификатор());
			ТекДанные.Изменен = Истина;
		КонецЕсли;
		Если ТекДанные.Статус = _СтатусДействует 
			И ЗначениеЗаполнено(ТекДанные.ДатаПринятия) = Ложь Тогда 
			ТекДанные.Статус = _СтатусВРаботе;
			Возврат;
		КонецЕсли;
		ДоступностьПолей = ТекДанные.Статус = _СтатусВРаботе;
		Если Элементы.ШаблоныТК.ИзменятьПорядокСтрок = Истина Тогда 
			Элементы.ШаблоныТО.ИзменятьСоставСтрок = ДоступностьПолей;
			Элементы.ШаблоныТО.ИзменятьПорядокСтрок = ДоступностьПолей;
			//
			Элементы.ШаблоныТООперация.ТолькоПросмотр = Не ДоступностьПолей;
			Элементы.ШаблоныТОКоличество.ТолькоПросмотр = Не ДоступностьПолей;
			Элементы.ШаблоныТОСпособВыполнения.ТолькоПросмотр = Не ДоступностьПолей;
			Элементы.ШаблоныТОтк_СдвинутьТОВниз.Доступность = ДоступностьПолей;
			Элементы.ШаблоныТОтк_СдвинутьТОВверх.Доступность = ДоступностьПолей;
			Элементы.ШаблоныТОтк_ДобавитьТО.Доступность = ДоступностьПолей;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныТКПередУдалением(Элемент, Отказ)
	ТекДанные = Элементы.ШаблоныТК.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		МодифицированностьТЧТехКарт = Истина;
		Если ЗначениеЗаполнено(ТекДанные.ТК) Тогда 
			Отказ = Истина;
			ТекДанные.ПометкаУдаления = НЕ ТекДанные.ПометкаУдаления;
			ТекДанные.Изменен = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныТКПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если Не ОтменаРедактирования Тогда 
		ТекДанныеТК = Элементы.ШаблоныТК.ТекущиеДанные;
		Если Не ТекДанныеТК = Неопределено Тогда 
			Если ЗначениеЗаполнено(ТекДанныеТК.ТК) = Ложь
				И ЗначениеЗаполнено(ТекДанныеТК.ИД) = Ложь Тогда 
				ТекДанныеТК.ИД = Строка(Новый УникальныйИдентификатор());
				ТекДанныеТК.Изменен = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СохранитьИзмененияТЧТехКартНаСервере()
	Для Каждого СтрокаТаблицы Из ШаблоныТК Цикл
		Если ЗначениеЗаполнено(СтрокаТаблицы.Статус) = Ложь Тогда 
			СтрокаТаблицы.Статус = Перечисления.торо_СтатусыНормативныхРемонтовИТехКарт.ВРазработке;
		КонецЕсли;
	КонецЦикла;
	МассивУдаления = Новый Массив();
	Для Каждого СтрокаТаблицы Из ШаблоныТО Цикл
		Если ЗначениеЗаполнено(СтрокаТаблицы.Операция) = Ложь Тогда 
			МассивУдаления.Добавить(СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
	Для Каждого СтрокаМассива Из МассивУдаления Цикл
		ШаблоныТО.Удалить(ШаблоныТО.Индекс(СтрокаМассива));
	КонецЦикла;
	//
	Запрос = Новый Запрос;
	Запрос.Текст =  
		"ВЫБРАТЬ
		|	торо_ИдентификаторыТехКарт.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.торо_ИдентификаторыТехКарт КАК торо_ИдентификаторыТехКарт
		|ГДЕ
		|	торо_ИдентификаторыТехКарт.гкс_Владелец = &Ссылка";
	 	Запрос.УстановитьПараметр("Ссылка", дс_Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ГруппаРодительИТК = Выборка.Ссылка;
	КонецЕсли;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧ.ТК КАК ТК,
		|	ТЧ.Статус КАК Статус,
		|	ТЧ.Обслуживание КАК Обслуживание,
		|	ТЧ.ДатаПринятия КАК ДатаПринятия,
		// Гкс+[TOIR20-194] Селимов от 17.11.2020. Добавлено:{
		|	ТЧ.гкс_ПериодДействия КАК гкс_ПериодДействия,
		|	ТЧ.гкс_КоличествоПериодовДействия КАК гкс_КоличествоПериодовДействия,
		// } Гкс-[TOIR20-194] 
		|	ТЧ.ПометкаУдаления КАК ПометкаУдаления,
		|	ТЧ.ИД КАК ИД
		|ПОМЕСТИТЬ ИсходныеТК
		|ИЗ
		|	&ТЧ КАК ТЧ
		|ГДЕ
		|	НЕ(ТЧ.ПометкаУдаления = ИСТИНА
		|				И ТЧ.ТК = ЗНАЧЕНИЕ(Справочник.торо_ИдентификаторыТехКарт.ПустаяСсылка))
		|	И ТЧ.Изменен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЧ.ТК КАК ТК,
		|	ВЫРАЗИТЬ(ТЧ.Операция КАК Справочник.торо_ТехнологическиеОперации) КАК Операция,
		|	ТЧ.Количество КАК Количество,
		|	ТЧ.СпособВыполнения КАК СпособВыполнения,
		|	ТЧ.гкс_Примечание КАК гкс_Примечание,
		|	ТЧ.ИД КАК ИД
		|ПОМЕСТИТЬ ИсходныеТО
		|ИЗ
		|	&ТЧ1 КАК ТЧ
		|ГДЕ
		|	НЕ ТЧ.Операция = ЗНАЧЕНИЕ(Справочник.торо_ТехнологическиеОперации.ПустаяСсылка)
		|	И НЕ (ТЧ.ИД = """" И ТЧ.ТК = ЗНАЧЕНИЕ(Справочник.торо_ИдентификаторыТехКарт.ПустаяСсылка))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсходныеТК.Статус КАК Статус,
		|	ИсходныеТК.Обслуживание КАК Обслуживание,
		|	ИсходныеТК.ДатаПринятия КАК ДатаПринятия,
		// Гкс+[TOIR20-194] Селимов от 17.11.2020. Добавлено:{
		|	ИсходныеТК.гкс_ПериодДействия КАК гкс_ПериодДействия,
		|	ИсходныеТК.гкс_КоличествоПериодовДействия КАК гкс_КоличествоПериодовДействия,
		// } Гкс-[TOIR20-194] 
		|	ИсходныеТК.ПометкаУдаления КАК ПометкаУдаления,
		|	ИсходныеТК.ИД КАК ИД
		|ПОМЕСТИТЬ НовыеИТК
		|ИЗ
		|	ИсходныеТК КАК ИсходныеТК
		|ГДЕ
		|	ИсходныеТК.ТК = ЗНАЧЕНИЕ(Справочник.торо_ИдентификаторыТехКарт.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НовыеИТК.Статус КАК Статус,
		|	НовыеИТК.Обслуживание КАК Обслуживание,
		|	НовыеИТК.ДатаПринятия КАК ДатаПринятия,
		// Гкс+[TOIR20-194] Селимов от 17.11.2020. Добавлено:{
		|	НовыеИТК.гкс_ПериодДействия КАК гкс_ПериодДействия,
		|	НовыеИТК.гкс_КоличествоПериодовДействия КАК гкс_КоличествоПериодовДействия,
		// } Гкс-[TOIR20-194] 
		|	НовыеИТК.ПометкаУдаления КАК ПометкаУдаления,
		|	НовыеИТК.ИД КАК ИД
		|ИЗ
		|	НовыеИТК КАК НовыеИТК
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсходныеТО.Операция КАК Операция,
		|	ИсходныеТО.Количество КАК Количество,
		|	ИсходныеТО.СпособВыполнения КАК СпособВыполнения,
		|	ИсходныеТО.ИД КАК ИД,
		|	ИсходныеТО.Операция.НормаВремени КАК НормаВремени,
		|	ИсходныеТО.гкс_Примечание КАК гкс_Примечание
		|ИЗ
		|	НовыеИТК КАК НовыеИТК
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсходныеТО КАК ИсходныеТО
		|		ПО НовыеИТК.ИД = ИсходныеТО.ИД
		|ИТОГИ ПО
		|	ИД
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсходныеТК.Статус КАК Статус,
		|	ИсходныеТК.Обслуживание КАК Обслуживание,
		|	ИсходныеТК.ДатаПринятия КАК ДатаПринятия,
		// Гкс+[TOIR20-194] Селимов от 17.11.2020. Добавлено:{
		|	ИсходныеТК.гкс_ПериодДействия КАК гкс_ПериодДействия,
		|	ИсходныеТК.гкс_КоличествоПериодовДействия КАК гкс_КоличествоПериодовДействия,
		// } Гкс-[TOIR20-194] 
		|	ИсходныеТК.ПометкаУдаления КАК ПометкаУдаления,
		|	ИсходныеТК.ТК КАК ТК
		|ПОМЕСТИТЬ СтарыйИТК
		|ИЗ
		|	ИсходныеТК КАК ИсходныеТК
		|ГДЕ
		|	НЕ ИсходныеТК.ТК = ЗНАЧЕНИЕ(Справочник.торо_ИдентификаторыТехКарт.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтарыйИТК.Статус КАК Статус,
		|	СтарыйИТК.Обслуживание КАК Обслуживание,
		|	СтарыйИТК.ДатаПринятия КАК ДатаПринятия,
		// Гкс+[TOIR20-194] Селимов от 17.11.2020. Добавлено:{
		|	СтарыйИТК.гкс_ПериодДействия КАК гкс_ПериодДействия,
		|	СтарыйИТК.гкс_КоличествоПериодовДействия КАК гкс_КоличествоПериодовДействия,
		// } Гкс-[TOIR20-194] 
		|	СтарыйИТК.ПометкаУдаления КАК ПометкаУдаления,
		|	СтарыйИТК.ТК КАК ТК,
		|	торо_ВерсииТехКартСрезПоследних.ТехКарта КАК ТехКарта
		|ИЗ
		|	СтарыйИТК КАК СтарыйИТК
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВерсииТехКарт.СрезПоследних КАК торо_ВерсииТехКартСрезПоследних
		|		ПО СтарыйИТК.ТК = торо_ВерсииТехКартСрезПоследних.ИдентификаторТехКарты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсходныеТО.Операция КАК Операция,
		|	ИсходныеТО.Количество КАК Количество,
		|	ИсходныеТО.СпособВыполнения КАК СпособВыполнения,
		|	ИсходныеТО.ТК КАК ТК,
		|	ИсходныеТО.гкс_Примечание КАК гкс_Примечание,
		|	ИсходныеТО.Операция.НормаВремени КАК НормаВремени
		|ИЗ
		|	СтарыйИТК КАК СтарыйИТК
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсходныеТО КАК ИсходныеТО
		|		ПО СтарыйИТК.ТК = ИсходныеТО.ТК
		|ИТОГИ ПО
		|	ТК";
	Запрос.УстановитьПараметр("ТЧ", ШаблоныТК.Выгрузить());
	Запрос.УстановитьПараметр("ТЧ1", ШаблоныТО.Выгрузить());
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ИндексПакетаНовых = 3;
	ИндексПакетаСтарых = 6;
	Если РезультатЗапроса[ИндексПакетаНовых].Пустой() = Ложь Тогда 		
		ВыборкаТК = РезультатЗапроса[ИндексПакетаНовых].Выбрать();
		ВыборкаТО = РезультатЗапроса[ИндексПакетаНовых + 1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаТК.Следующий() Цикл
			Попытка
				НачатьТранзакцию();
				ОбъектИТК = справочники.торо_ИдентификаторыТехКарт.СоздатьЭлемент();
				ОбъектИТК.Родитель = ГруппаРодительИТК;
				ОбъектИТК.Наименование = ВыборкаТК.Обслуживание + " " + ОбъектИТК.Родитель;
				ОбъектИТК.гкс_Обслуживание = ВыборкаТК.Обслуживание;
				ОбъектИТК.гкс_Ответственный = ПараметрыСеанса.ТекущийПользователь;
				ОбъектИТК.Статус = ВыборкаТК.Статус;
				//
				ОбъектТК = Справочники.торо_ТехКарты.СоздатьЭлемент();
				ОбъектТК.Наименование = ОбъектИТК.Наименование;
				ОбъектТК.ДатаПринятия = ВыборкаТК.ДатаПринятия;
				// Гкс+[TOIR20-194] Селимов от 17.11.2020. Добавлено:{
				ОбъектТК.гкс_ПериодДействия = ВыборкаТК.гкс_ПериодДействия;
				ОбъектТК.гкс_КоличествоПериодовДействия = ВыборкаТК.гкс_КоличествоПериодовДействия;
					торо_ОбщегоНазначенияКлиентСервер.РассчитатьДатуОкончанияПериода(ВыборкаТК.ДатаПринятия, 
																					 ВыборкаТК.гкс_ПериодДействия, 
																					 ВыборкаТК.гкс_КоличествоПериодовДействия);
				// } Гкс-[TOIR20-194] 
				//
				СуммаВремениТК = 0;
				Если ВыборкаТО.НайтиСледующий(Новый Структура("ИД", ВыборкаТК.ИД)) Тогда 
					ВыборкаТОПодробно = ВыборкаТО.Выбрать();
					Пока ВыборкаТОПодробно.Следующий() Цикл
						НоваяСтрока = ОбъектТК.СписокОпераций.Добавить();
						НоваяСтрока.ID = Строка(Новый УникальныйИдентификатор());
						НоваяСтрока.Количество = ВыборкаТОПодробно.Количество;
						НоваяСтрока.Операция = ВыборкаТОПодробно.Операция;
						НоваяСтрока.СпособВыполнения = ВыборкаТОПодробно.СпособВыполнения;
						НоваяСтрока.НормаВремениВСекундах = ВыборкаТОПодробно.НормаВремени;
						НоваяСтрока.гкс_Примечание = ВыборкаТОПодробно.гкс_Примечание;
						СуммаВремениТК = СуммаВремениТК + ВыборкаТОПодробно.НормаВремени;
					КонецЦикла;
				КонецЕсли;
				ВыборкаТО.Сбросить();
				ОбъектТК.НормаВремени = СуммаВремениТК;
				ОбъектТК.СпособРасчетаПродолжительности = 
					Перечисления.торо_СпособыРасчетаПродолжительности.ПоНормамВремениТехОпераций;
				ОбъектТК.НормаВремениТекст = СформироватьПродолжительность(СуммаВремениТК);
				
				ОбъектИТК.Записать();
				ОбъектТК.Записать();
				//
				Для Каждого СтрокаТаблицы Из ШаблоныТК Цикл
					Если СтрокаТаблицы.ИД = ВыборкаТК.ИД Тогда 
						СтрокаТаблицы.ТК = ОбъектИТК.Ссылка;
						Для Каждого СтрокаТО Из ШаблоныТО Цикл
							Если СтрокаТО.ИД = СтрокаТаблицы.ИД Тогда 
								СтрокаТО.ТК = ОбъектИТК.Ссылка;
							КонецЕсли;
						КонецЦикла;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				НаборЗаписей = РегистрыСведений.торо_ВерсииТехКарт.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ИдентификаторТехКарты.Установить(ОбъектИТК.Ссылка);
				НаборЗаписей.Отбор.Период.Установить(ВыборкаТК.ДатаПринятия);
				НоваяСтрока = НаборЗаписей.Добавить();
				НоваяСтрока.ИдентификаторТехКарты = ОбъектИТК.Ссылка;
				НоваяСтрока.ТехКарта = ОбъектТК.Ссылка;
				НоваяСтрока.Период = ВыборкаТК.ДатаПринятия;
				НаборЗаписей.Записать();
				ЗафиксироватьТранзакцию();
			Исключение
				ОтменитьТранзакцию();
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = ОписаниеОшибки();
				Сообщение.Сообщить();
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	
	Если РезультатЗапроса[ИндексПакетаСтарых].Пустой() = Ложь Тогда 
		ВыборкаТК = РезультатЗапроса[ИндексПакетаСтарых].Выбрать();
		ВыборкаТО = РезультатЗапроса[ИндексПакетаСтарых + 1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаТК.Следующий() Цикл
			Попытка
				НачатьТранзакцию();
				ОбъектИТК = ВыборкаТК.ТК.ПолучитьОбъект();
				ОбъектИТК.Родитель = ГруппаРодительИТК;
				ОбъектИТК.Наименование = ВыборкаТК.Обслуживание + " " + ОбъектИТК.Родитель;
				ОбъектИТК.гкс_Обслуживание = ВыборкаТК.Обслуживание;
				ОбъектИТК.Статус = ВыборкаТК.Статус;
				
				ОбъектТК = ВыборкаТК.ТехКарта.ПолучитьОбъект();
				ОбъектТК.Наименование = ОбъектИТК.Наименование;
				ОбъектТК.ДатаПринятия = ВыборкаТК.ДатаПринятия;
				// Гкс+[TOIR20-194] Селимов от 17.11.2020. Добавлено:{
				ОбъектТК.гкс_ПериодДействия = ВыборкаТК.гкс_ПериодДействия;
				ОбъектТК.гкс_КоличествоПериодовДействия = ВыборкаТК.гкс_КоличествоПериодовДействия;
				ОбъектТК.гкс_ДатаОкончанияАктуальности = 
					торо_ОбщегоНазначенияКлиентСервер.РассчитатьДатуОкончанияПериода(ВыборкаТК.ДатаПринятия, 
																					 ВыборкаТК.гкс_ПериодДействия,
																					 ВыборкаТК.гкс_КоличествоПериодовДействия);
				// } Гкс-[TOIR20-194] 
				
				СуммаВремениТК = 0;
				Если ВыборкаТО.НайтиСледующий(Новый Структура("ТК", ВыборкаТК.ТК)) Тогда 
					ПройденныеСтроки = Новый Массив();
					ВыборкаТОПодробно = ВыборкаТО.Выбрать();
					Пока ВыборкаТОПодробно.Следующий() Цикл
						СтрокаНеНайдена = Истина;
						Для Каждого СтрокаТаблицы Из ОбъектТК.СписокОпераций Цикл
							Если СтрокаТаблицы.Операция = ВыборкаТОПодробно.Операция Тогда 
								Если ПройденныеСтроки.Найти(СтрокаТаблицы.ID) = Неопределено Тогда 
									СтрокаТаблицы.Количество = ВыборкаТОПодробно.Количество;
									СтрокаТаблицы.Операция = ВыборкаТОПодробно.Операция;
									СтрокаТаблицы.СпособВыполнения = ВыборкаТОПодробно.СпособВыполнения;
									СтрокаТаблицы.гкс_Примечание = ВыборкаТОПодробно.гкс_Примечание;
									СуммаВремениТК = СуммаВремениТК + СтрокаТаблицы.НормаВремениВСекундах;
									ПройденныеСтроки.Добавить(СтрокаТаблицы.ID);
									СтрокаНеНайдена = Ложь;
									Прервать;
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;
						Если СтрокаНеНайдена Тогда 
							НоваяСтрока = ОбъектТК.СписокОпераций.Добавить();
							НоваяСтрока.ID = Строка(Новый УникальныйИдентификатор());
							НоваяСтрока.Количество = ВыборкаТОПодробно.Количество;
							НоваяСтрока.Операция = ВыборкаТОПодробно.Операция;
							НоваяСтрока.СпособВыполнения = ВыборкаТОПодробно.СпособВыполнения;
							НоваяСтрока.НормаВремениВСекундах = ВыборкаТОПодробно.НормаВремени;
							НоваяСтрока.гкс_Примечание = ВыборкаТОПодробно.гкс_Примечание;
							СуммаВремениТК = СуммаВремениТК + ВыборкаТОПодробно.НормаВремени;
							ПройденныеСтроки.Добавить(НоваяСтрока.ID);
						КонецЕсли;
					КонецЦикла;
					СтрокиКУдалению = Новый Массив();
					Для Каждого СтрокаТаблицы Из ОбъектТК.СписокОпераций Цикл
						Если ПройденныеСтроки.Найти(СтрокаТаблицы.ID) = Неопределено Тогда 
							СтрокиКУдалению.Добавить(СтрокаТаблицы);
						КонецЕсли;
					КонецЦикла;
					Для Каждого СтрокаМассива Из СтрокиКУдалению Цикл
						ОбъектТК.СписокОпераций.Удалить(СтрокаМассива);
					КонецЦикла;
					
					НомерСтрокиНовый = 0;
					Для Каждого СтрокаМассива ИЗ ПройденныеСтроки Цикл
						НомерСтрокиСтарый = 0;
						Для Каждого ТехОперацияСтарая ИЗ ОбъектТК.СписокОпераций Цикл
							Если ТехОперацияСтарая.ID = СтрокаМассива Тогда 
								Прервать;
							КонецЕсли;
							НомерСтрокиСтарый = НомерСтрокиСтарый + 1;
						КонецЦикла;
						Если НЕ НомерСтрокиНовый = НомерСтрокиСтарый Тогда 
							ОбъектТК.СписокОпераций.Сдвинуть(НомерСтрокиСтарый, НомерСтрокиНовый - НомерСтрокиСтарый);
						КонецЕсли;
						НомерСтрокиНовый = НомерСтрокиНовый + 1;
					КонецЦикла;
				КонецЕсли;
				ВыборкаТО.Сбросить();
				Если ОбъектТК.СпособРасчетаПродолжительности = 
					Перечисления.торо_СпособыРасчетаПродолжительности.ПоНормамВремениТехОпераций Тогда 
					ОбъектТК.НормаВремениТекст = СформироватьПродолжительность(СуммаВремениТК);
					ОбъектТК.НормаВремени = СуммаВремениТК;
				КонецЕсли;
				
				ОбъектИТК.Записать();
				ОбъектТК.Записать();
				Если Не ОбъектИТК.ПометкаУдаления = ВыборкаТК.ПометкаУдаления Тогда 
					ОбъектИТК.УстановитьПометкуУдаления(ВыборкаТК.ПометкаУдаления);
				КонецЕсли;
				ЗафиксироватьТранзакцию();
			Исключение
				ОтменитьТранзакцию();
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = ОписаниеОшибки();
				Сообщение.Сообщить();
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	ОбновитьПодчиненныеТК();
	
	МодифицированностьТЧТехКарт = Ложь;
	Для Каждого СтрокаТаблицы Из ШаблоныТК Цикл
		СтрокаТаблицы.Изменен = Ложь;
	КонецЦикла;
	
	ЗаполнитьТЧТехКарт(дс_Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИзмененияТЧТехКарт(Команда)
	НомерПП = 0;
	Для Каждого СТрокаТаблицы Из ШаблоныТК Цикл
		Если СТрокаТаблицы.Изменен Тогда 
			Если ЗначениеЗаполнено(СТрокаТаблицы.ДатаПринятия) = Ложь Тогда    
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = НСтр("ru='Укажите дату принятия';
				|en='Indicate the date of adoption';es='';");
				Сообщение.Поле = "ШаблоныТК[" + НомерПП + "].ДатаПринятия";
				Сообщение.Сообщить();
				Возврат;
			КонецЕсли;
			Если ЗначениеЗаполнено(СТрокаТаблицы.Обслуживание) = Ложь Тогда 
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = НСтр("ru='Укажите обслуживание';
				|en='Indicate service';es='';");
				Сообщение.Поле = "ШаблоныТК[" + НомерПП + "].Обслуживание";
				Сообщение.Сообщить();
				Возврат;
			КонецЕсли;
			// Гкс+[TOIR20-194] Селимов от 17.11.2020. Добавлено:{
			Если ЗначениеЗаполнено(СТрокаТаблицы.ДатаПринятия) = Ложь Тогда    
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = НСтр("ru='Укажите период действия';
				|en='Specify the validity period';es='Especifique el período de validez';");
				Сообщение.Поле = "ШаблоныТК[" + НомерПП + "].гкс_ПериодДействия";
				Сообщение.Сообщить();
				Возврат;
			КонецЕсли; // } Гкс-[TOIR20-194] 
		КонецЕсли;
		НомерПП = НомерПП + 1;
	КонецЦикла;
	СохранитьИзмененияТЧТехКартНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьПодчиненныеТК()
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ТЧ.ТК КАК Справочник.торо_ИдентификаторыТехКарт) КАК ТК,
		|	ТЧ.Изменен КАК Изменен,
		|	ТЧ.Статус КАК Статус
		|ПОМЕСТИТЬ Исходные
		|ИЗ
		|	&ТЧ КАК ТЧ
		|ГДЕ
		|	ТЧ.Изменен = ИСТИНА 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Исходные.ТК КАК ТК,
		|	Исходные.Статус КАК Статус,
		|	торо_ВерсииТехКартСрезПоследних.ТехКарта КАК ТехКарта
		|ПОМЕСТИТЬ ИсходныеТК
		|ИЗ
		|	Исходные КАК Исходные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВерсииТехКарт.СрезПоследних КАК торо_ВерсииТехКартСрезПоследних
		|		ПО Исходные.ТК = торо_ВерсииТехКартСрезПоследних.ИдентификаторТехКарты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	гкс_ИерархияТехКарт.Подчиненный КАК Подчиненный,
		|	торо_ВерсииТехКартСрезПоследних.ТехКарта КАК ТехКарта,
		|	Исходные.ТехКарта КАК Ссылка,
		|	Исходные.ТК.гкс_Обслуживание КАК гкс_Обслуживание,
		|	Исходные.ТК.гкс_Ответственный КАК гкс_Ответственный,
		|	Исходные.ТК.ПометкаУдаления КАК ПометкаУдаления
		|ИЗ
		|	ИсходныеТК КАК Исходные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_ИерархияТехКарт КАК гкс_ИерархияТехКарт
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВерсииТехКарт.СрезПоследних КАК торо_ВерсииТехКартСрезПоследних
		|			ПО гкс_ИерархияТехКарт.Подчиненный = торо_ВерсииТехКартСрезПоследних.ИдентификаторТехКарты
		|		ПО Исходные.ТК = гкс_ИерархияТехКарт.Родитель
		|			И (Исходные.Статус = ЗНАЧЕНИЕ(Перечисление.торо_СтатусыНормативныхРемонтовИТехКарт.Действует))
		|ИТОГИ ПО
		|	Ссылка";
	
	Запрос.УстановитьПараметр("ТЧ", ШаблоныТК.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() = Ложь Тогда
		ВыборкаТехКарт = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Событие = Константы.гкс_ПараметрыОповещенияОИзмененииТехКарты.Получить();
		МассивИменТаблиц = Новый Массив();
		МассивИменТаблиц.Добавить("СписокОпераций");
		МассивИменТаблиц.Добавить("МатериальныеЗатраты");
		МассивИменТаблиц.Добавить("ТрудовыеЗатраты");
		МассивИменТаблиц.Добавить("ИнструментыИТехника");
		МассивИменТаблиц.Добавить("ИзмеряемыеПоказатели");
		МассивИменТаблиц.Добавить("ОказываемыеУслуги");
		МассивИменТаблиц.Добавить("МерыБезопасности");
		Пока ВыборкаТехКарт.Следующий() Цикл
			// Гкс+[TOIR20-170] Селимов от 16.11.2020. Добавлено:{
			ОповещаемыеПользователи = Новый Соответствие; // } Гкс-[TOIR20-170] 
			ТехКартаРодитель = ВыборкаТехКарт.Ссылка.ПолучитьОбъект();
			Выборка = ВыборкаТехКарт.Выбрать();
			Пока Выборка.Следующий() Цикл
				НеНайденныеТО = Новый Массив();
				ПодчиненнаяТехКарта = Выборка.ТехКарта.ПолучитьОбъект();
				ПодчиненнаяТехКарта.гкс_ШаблонОригинал = Выборка.ТехКарта;
				Для Каждого ТехОперацияСтарая ИЗ ПодчиненнаяТехКарта.СписокОпераций Цикл
					НеНайденныеТО.Добавить(ТехОперацияСтарая.ID);
				КонецЦикла;
				Для Каждого ТехОперация ИЗ ТехКартаРодитель.СписокОпераций Цикл
					ЭтоНовая = Истина;
					Для Каждого ТехОперацияСтарая ИЗ ПодчиненнаяТехКарта.СписокОпераций Цикл
						Если ТехОперацияСтарая.ID = ТехОперация.ID Тогда 
							НеНайденныеТО.Удалить(НеНайденныеТО.Найти(ТехОперацияСтарая.ID));
							ЗаполнитьЗначенияСвойств(ТехОперацияСтарая, ТехОперация,, "Продолжительность,НормаВремениВСекундах");
							ЭтоНовая = Ложь;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					Если ЭтоНовая Тогда 
						НоваяСтрока = ПодчиненнаяТехКарта.СписокОпераций.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, ТехОперация);
					КонецЕсли;
				КонецЦикла;
				
				Для Каждого СтрокаМассива Из НеНайденныеТО Цикл
					Для Каждого ИмяТаблицы Из МассивИменТаблиц Цикл
						НайденныеСтроки = ПодчиненнаяТехКарта[ИмяТаблицы].НайтиСтроки(Новый Структура("ID", СтрокаМассива));
						Для Каждого СтрокаТЧ Из НайденныеСтроки Цикл
							ПодчиненнаяТехКарта[ИмяТаблицы].Удалить(СтрокаТЧ);
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
				
				НомерСтрокиНовый = 0;
				Для Каждого ТехОперация ИЗ ТехКартаРодитель.СписокОпераций Цикл
					НомерСтрокиСтарый = 0;
					Для Каждого ТехОперацияСтарая ИЗ ПодчиненнаяТехКарта.СписокОпераций Цикл
						Если ТехОперацияСтарая.ID = ТехОперация.ID Тогда 
							Прервать;
						КонецЕсли;
						НомерСтрокиСтарый = НомерСтрокиСтарый + 1;
					КонецЦикла;
					Если НЕ НомерСтрокиНовый = НомерСтрокиСтарый Тогда 
						ПодчиненнаяТехКарта.СписокОпераций.Сдвинуть(НомерСтрокиСтарый, НомерСтрокиНовый - НомерСтрокиСтарый);
					КонецЕсли;
					НомерСтрокиНовый = НомерСтрокиНовый + 1;
				КонецЦикла;
				
				ЗаполнитьЗначенияСвойств(ПодчиненнаяТехКарта, ТехКартаРодитель,, 
					"Код,ПометкаУдаления,Ссылка,Владелец,НормаВремени,НормаВремениТекст,СпособРасчетаПродолжительности");
				ПодчиненнаяТехКарта.Записать();
				Если НЕ ПодчиненнаяТехКарта.ПометкаУдаления = Выборка.ПометкаУдаления Тогда 
					ПодчиненнаяТехКарта.УстановитьПометкуУдаления(Выборка.ПометкаУдаления);
				КонецЕсли;
				
				ОбъектИТК = Выборка.Подчиненный.ПолучитьОбъект();
				ОбъектИТК.Наименование = Строка(Выборка.гкс_Обслуживание) + " " + ОбъектИТК.Родитель;
				ОбъектИТК.гкс_Обслуживание = Выборка.гкс_Обслуживание;
				// Гкс+[TOIR20-170] Селимов от 16.11.2020. Изменено:{
				// НужноСменитьСтатус = Не ОбъектИТК.Статус = Перечисления.торо_СтатусыНормативныхРемонтовИТехКарт.ВРазработке;
				// }На:{
				НужноСменитьСтатус = ОбъектИТК.Статус = Перечисления.торо_СтатусыНормативныхРемонтовИТехКарт.ВРазработке;
				// } Гкс-[TOIR20-170]
				ОбъектИТК.Статус = Перечисления.торо_СтатусыНормативныхРемонтовИТехКарт.ВРазработке;
				ОбъектИТК.Записать();
				Если НЕ ОбъектИТК.ПометкаУдаления = Выборка.ПометкаУдаления Тогда 
					ОбъектИТК.УстановитьПометкуУдаления(Выборка.ПометкаУдаления);
				КонецЕсли;
				// Гкс+[TOIR20-170] Селимов от 16.11.2020. Добавлено:{
				Если НужноСменитьСтатус И ЗначениеЗаполнено(ОбъектИТК.гкс_Ответственный)
					И ЗначениеЗаполнено(Событие) Тогда 
					Если ОповещаемыеПользователи.Получить(ОбъектИТК.гкс_Ответственный) = Неопределено Тогда
						ОповещаемыеПользователи.Вставить(ОбъектИТК.гкс_Ответственный, "- " + СокрЛП(ОбъектИТК.Наименование));
					Иначе
						ИзмененныеТехКарты = ОповещаемыеПользователи[ОбъектИТК.гкс_Ответственный];
						ОповещаемыеПользователи[ОбъектИТК.гкс_Ответственный] = ОповещаемыеПользователи[ОбъектИТК.гкс_Ответственный] 
																			 + Символы.ПС + "- " + СокрЛП(ОбъектИТК.Наименование);
					КонецЕсли; 
				КонецЕсли; // } Гкс-[TOIR20-170] 
			КонецЦикла;
			// Гкс+[TOIR20-170] Селимов от 16.11.2020. Удалено:{
			Если НужноСменитьСтатус И ЗначениеЗаполнено(ОбъектИТК.гкс_Ответственный)
				И ЗначениеЗаполнено(Событие) Тогда 
				СтруктураДанных = Новый Структура;
				СтруктураДанных.Вставить("Ссылка", ОбъектИТК.Ссылка); 				
				СтруктураДанных.Вставить("Ответственный", ОбъектИТК.гкс_Ответственный); 				
				СтруктураДанных.Вставить("ВидДокумента", ""); 				
				СтруктураДанных.Вставить("Наименование", ОбъектИТК.Наименование); 				
				СтруктураДанных.Вставить("ОповещаемыеПользователи", ОповещаемыеПользователи); 	
				СтруктураДанных.Вставить("АвторИзменений", Пользователи.ТекущийПользователь());
				торо_РаботаСУведомлениями.ЗаписатьУведомленияТК(СтруктураДанных, Событие);
			КонецЕсли; // } Гкс-[TOIR20-170] 
		КонецЦикла;
	КонецЕсли;

	Запрос.Текст = 
		"
		|ВЫБРАТЬ
		|	гкс_ИерархияТехКарт.Подчиненный КАК Подчиненный,
		|	гкс_ИерархияТехКарт.Подчиненный.Родитель КАК Родитель,
		|	Исходные.ТК КАК ТК
		|ПОМЕСТИТЬ Существующие
		|ИЗ
		|	Исходные КАК Исходные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_ИерархияТехКарт КАК гкс_ИерархияТехКарт
		|		ПО Исходные.ТК = гкс_ИерархияТехКарт.Родитель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ИдентификаторыТехКарт.Ссылка КАК Ссылка,
		|	Исходные.ТехКарта КАК ТехКарта,
		|	Исходные.ТК КАК ТК
		|ПОМЕСТИТЬ ВсеПОдчиненныеРодители
		|ИЗ
		|	ИсходныеТК КАК Исходные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ИдентификаторыТехКарт КАК торо_ИдентификаторыТехКарт
		|		ПО Исходные.ТК.Родитель = торо_ИдентификаторыТехКарт.Родитель
		|ГДЕ
		|	торо_ИдентификаторыТехКарт.ЭтоГруппа = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсеПОдчиненныеРодители.Ссылка КАК Ссылка,
		|	ВсеПОдчиненныеРодители.ТК.гкс_Обслуживание КАК гкс_Обслуживание,
		|	ВсеПОдчиненныеРодители.ТК.гкс_Ответственный КАК гкс_Ответственный,
		|	ВсеПОдчиненныеРодители.ТехКарта КАК ТехКарта,
		|	ВсеПОдчиненныеРодители.ТК КАК ТК
		|ИЗ
		|	ВсеПОдчиненныеРодители КАК ВсеПОдчиненныеРодители
		|		ЛЕВОЕ СОЕДИНЕНИЕ Существующие КАК Существующие
		|		ПО ВсеПОдчиненныеРодители.Ссылка = Существующие.Родитель
		|			И ВсеПОдчиненныеРодители.ТК = Существующие.ТК
		|ГДЕ
		|	Существующие.Подчиненный ЕСТЬ NULL
		|	И ВсеПОдчиненныеРодители.ТК.ПометкаУдаления = Ложь
		|	И ВсеПОдчиненныеРодители.ТК.Статус = Значение(Перечисление.торо_СтатусыНормативныхРемонтовИТехКарт.Действует)";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() = Ложь Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			НовыйОбъект = Выборка.ТехКарта.Скопировать();
			НовыйОбъект.гкс_ШаблонОригинал = Выборка.ТехКарта;
			НовыйОбъект.Записать();
			
			НовыйИТК = Справочники.торо_ИдентификаторыТехКарт.СоздатьЭлемент();
			НовыйИТК.Наименование = Строка(Выборка.гкс_Обслуживание) + " " + Выборка.Ссылка;
			НовыйИТК.гкс_Обслуживание = Выборка.гкс_Обслуживание;
			НовыйИТК.Родитель = Выборка.Ссылка;
			НовыйИТК.Статус = Перечисления.торо_СтатусыНормативныхРемонтовИТехКарт.ВРазработке;
			НовыйИТК.гкс_Ответственный = Выборка.гкс_Ответственный;
			НовыйИТК.Записать();
			
			НаборЗаписей = РегистрыСведений.торо_ВерсииТехКарт.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ИдентификаторТехКарты.Установить(НовыйИТК.Ссылка);
			НаборЗаписей.Отбор.Период.Установить(НовыйОбъект.ДатаПринятия);
			НоваяСтрока = НаборЗаписей.Добавить();
			НоваяСтрока.ИдентификаторТехКарты = НовыйИТК.Ссылка;
			НоваяСтрока.ТехКарта = НовыйОбъект.Ссылка;
			НоваяСтрока.Период = НовыйОбъект.ДатаПринятия;
			НаборЗаписей.Записать();
			
			НаборЗаписей = РегистрыСведений.гкс_ИерархияТехКарт.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Подчиненный.Установить(НовыйИТК.Ссылка);
			НоваяСтрока = НаборЗаписей.Добавить();
			НоваяСтрока.Подчиненный = НовыйИТК.Ссылка;
			НоваяСтрока.Родитель = Выборка.ТК;
			НаборЗаписей.Записать();
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьПродолжительность(ПродолжительностьВСекундах)
	
	Если ПродолжительностьВСекундах = 0 Тогда
		
		Возврат "Ввести продолжительность";
		
	Иначе
		
		Часы    = Цел(ПродолжительностьВСекундах / 3600);
		Минуты  = Цел((ПродолжительностьВСекундах - 3600 * Часы) / 60);
		Секунды = ПродолжительностьВСекундах - 3600 * Часы - Минуты * 60;
		
		ПродолжительностьСтрокой = СтрШаблон(НСтр("es='%1 h. %2 min. %3 sec.';
		|ru='%1 ч. %2 мин. %3 с.';en='%1 hr.%2 min. %3 s'"), Часы, Минуты, Секунды);
		Возврат ПродолжительностьСтрокой;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СохранитьТКПослеВопроса(Результат, ДопПараметры)Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда 
		СохранитьИзмененияТЧТехКарт(Истина);
	Иначе
		МодифицированностьТЧТехКарт = Ложь;
	КонецЕсли;
	Если МодифицированностьТЧТехКарт = Ложь Тогда 
		СписокПриАктивизацииСтроки(Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодчиненныеТКПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.ПодчиненныеТК.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		дс_ТК_Операции.Параметры.УстановитьЗначениеПараметра("Ссылка",ТекДанные.Ссылка);
		дс_ТК_МатЗатраты.Параметры.УстановитьЗначениеПараметра("Ссылка",ТекДанные.Ссылка);
		дс_ТК_Трудозатраты.Параметры.УстановитьЗначениеПараметра("Ссылка",ТекДанные.Ссылка);
		дс_ТК_Инструменты.Параметры.УстановитьЗначениеПараметра("Ссылка",ТекДанные.Ссылка);
	Иначе
		дс_ТК_Операции.Параметры.УстановитьЗначениеПараметра("Ссылка",Неопределено);
		дс_ТК_МатЗатраты.Параметры.УстановитьЗначениеПараметра("Ссылка",Неопределено);
		дс_ТК_Трудозатраты.Параметры.УстановитьЗначениеПараметра("Ссылка",Неопределено);
		дс_ТК_Инструменты.Параметры.УстановитьЗначениеПараметра("Ссылка",Неопределено);
	КонецЕсли;
	
	Элементы.дс_ТК_Операции1.Обновить();
	Элементы.дс_ТК_МатЗатраты1.Обновить();
	Элементы.дс_ТК_Трудозатраты1.Обновить();
	Элементы.дс_ТК_Инструменты1.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура тк_СдвинутьТОВниз(Команда)
	ТекДанные = Элементы.ШаблоныТО.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		НомерПП = 1; ИндексПередвигаемого = 0;
		Для Каждого СтрокаСдвига Из ШаблоныТО Цикл
			Если СтрокаСдвига.УИД = ТекДанные.УИД Тогда 
				Если НомерПП >= ШаблоныТО.Количество() Тогда 
					Прервать;
				КонецЕсли;
				ИндексПередвигаемого = НомерПП;
			ИначеЕсли не ИндексПередвигаемого = 0 Тогда 
				Если СтрокаСдвига.ИД = ТекДанные.ИД
					И СтрокаСдвига.ТК = ТекДанные.ТК Тогда 
					ШаблоныТО.Сдвинуть(ШаблоныТО.Индекс(ШаблоныТО[ИндексПередвигаемого-1]), НомерПП - ИндексПередвигаемого);
					ТекДанныеТК = Элементы.ШаблоныТК.ТекущиеДанные;
					Если Не ТекДанныеТК = Неопределено Тогда 
						ТекДанныеТК.Изменен = Истина;
						МодифицированностьТЧТехКарт = Истина;
					КонецЕсли;
					Прервать;
				КонецЕсли;
			КонецЕсли;
			НомерПП = НомерПП + 1;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура тк_СдвинутьТОВверх(Команда)
	ТекДанные = Элементы.ШаблоныТО.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		ПоследнийПодходящий = 0;
		НомерПП = 1;
		Для Каждого СтрокаСдвига Из ШаблоныТО Цикл
			Если СтрокаСдвига.УИД = ТекДанные.УИД Тогда 
				Если НомерПП > 1 И Не ПоследнийПодходящий = 0 Тогда 
					ШаблоныТО.Сдвинуть(ШаблоныТО.Индекс(СтрокаСдвига), ПоследнийПодходящий - НомерПП);
					ТекДанныеТК = Элементы.ШаблоныТК.ТекущиеДанные;
					Если Не ТекДанныеТК = Неопределено Тогда 
						ТекДанныеТК.Изменен = Истина;
						МодифицированностьТЧТехКарт = Истина;
					КонецЕсли;
				КонецЕсли;
				Прервать;
			Иначе
				Если СтрокаСдвига.ИД = ТекДанные.ИД
					И СтрокаСдвига.ТК = ТекДанные.ТК Тогда 
					ПоследнийПодходящий = НомерПП;
				КонецЕсли;
			КонецЕсли;
			НомерПП = НомерПП + 1;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодчиненныеТКВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекДанные = Элементы.ПодчиненныеТК.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		ПоказатьЗначение(, ТекДанные.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура тк_ДобавитьТО(Команда)
	ТекДанныеТК = Элементы.ШаблоныТК.ТекущиеДанные;
	Если НЕ ТекДанныеТК = Неопределено Тогда 
		ФормаВыбора = ПолучитьФорму("Справочник.торо_ТехнологическиеОперации.ФормаВыбора",
			Новый Структура("МножественныйВыбор", Истина), Элементы.ШаблоныТО);
		ФормаВыбора.ЗакрыватьПриВыборе = Ложь;
		ФормаВыбора.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныТООбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ТекДанныеТК = Элементы.ШаблоныТК.ТекущиеДанные;
	Если НЕ ТекДанныеТК = Неопределено Тогда 
		ТекДанныеТК.Изменен = Истина;
		МодифицированностьТЧТехКарт = Истина;
		
		Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда 
			Для Каждого ВыбраннаяСтрока Из ВыбранноеЗначение Цикл
				НоваяСтрока = ШаблоныТО.Добавить();
				НоваяСтрока.Операция = ВыбраннаяСтрока;
				НоваяСтрока.Количество = 1;
				НоваяСтрока.СпособВыполнения = _ХозСпособ;
				НоваяСтрока.ИД = ТекДанныеТК.ИД;
				НоваяСтрока.ТК = ТекДанныеТК.ТК;
				НоваяСтрока.УИД = Строка(Новый УникальныйИдентификатор());
			КонецЦикла;
		Иначе 
			НоваяСтрока = ШаблоныТО.Добавить();
			НоваяСтрока.Операция = ВыбранноеЗначение;
			НоваяСтрока.Количество = 1;
			НоваяСтрока.СпособВыполнения = _ХозСпособ;
			НоваяСтрока.ИД = ТекДанныеТК.ИД;
			НоваяСтрока.ТК = ТекДанныеТК.ТК;
			НоваяСтрока.УИД = Строка(Новый УникальныйИдентификатор());
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныТОПередУдалением(Элемент, Отказ)
	ТекДанные = Элементы.ШаблоныТК.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		МодифицированностьТЧТехКарт = Истина;
		ТекДанные.Изменен = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныТОгкс_ПримечаниеПриИзменении(Элемент)
	МодифицированностьТЧТехКарт = Истина;
	ТекДанные = Элементы.ШаблоныТК.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		ТекДанные.Изменен = Истина;
		Если ЗначениеЗаполнено(ТекДанные.ТК) Тогда 
			Элементы.ШаблоныТО.ОтборСтрок = Новый ФиксированнаяСтруктура("ТК",ТекДанные.ТК);
		Иначе
			Элементы.ШаблоныТО.ОтборСтрок = Новый ФиксированнаяСтруктура("ИД",ТекДанные.ИД);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// Гкс+[TOIR20-194] Селимов от 18.11.2020. Добавлено:{
&НаКлиенте
Процедура ШаблоныТКгкс_КоличествоПериодовДействияПриИзменении(Элемент)
	МодифицированностьТЧТехКарт = Истина;	
КонецПроцедуры // } Гкс-[TOIR20-194] 

#КонецОбласти

#КонецОбласти