////////////////////////////////////////////////////////////////////////////////
// гкс_ИсторииДанных: процедуры и функции свзяанные с платформенным механизмом истории данныъ.
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура гкс_ОбновлениеИсторииДанных() Экспорт
	
	Отказ = Ложь;
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.гкс_ОбновлениеИсторииДанных);
	
	ИмяСобытия = ИмяСобытияЖурналаРегистрации();
	
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация, , ,
		НСтр("ru = 'Начато обновление историй данных'"));
		
	ИсторияДанных.ОбновитьИсторию();
		
	Если Отказ Тогда
		ЗаписьЖурналаРегистрации(
			ИмяСобытия,
			УровеньЖурналаРегистрации.Ошибка,
			, 
			,
			НСтр("ru = 'Во время обновления историй данных'"));
		ВызватьИсключение НСтр("ru = 'Регламентное задание не выполнено.'");
	Иначе
		ЗаписьЖурналаРегистрации(
			ИмяСобытия,
			УровеньЖурналаРегистрации.Информация,
			,
			,
			НСтр("ru = 'Завершено регламентное обновление историй данных.'"));
	КонецЕсли;	
		
КонецПроцедуры
   
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
//
// Функция ИмяСобытияЖурналаРегистрации
//
// Описание: Сообщение журнала регистрации	
//
// Возвращаемое значение: 
//	Строка - Сообщение журнала регистрации.
//
Функция ИмяСобытияЖурналаРегистрации() Экспорт
	Возврат НСтр("ru = 'Обновление историй данных'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
КонецФункции

#КонецОбласти
