// гкс+ [11.22] Деснол 17.11.2022
#Область ОбработчикиСобытийФормы

// гкс+ [12.22] Деснол 12.12.2022
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	гкс_ЧасовыеПоясаВызовСервера.ДобавитьНовыеЭлементы(ЭтаФорма, Элементы.ГруппаВвод,);
КонецПроцедуры // гкс- [12.22] Деснол 12.12.2022

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "гкс_ПодборРемонта" Тогда 
		Если ТипЗнч(Параметр) = Тип("Структура") Тогда 
			Если ТаблицаРемонтов.НайтиСтроки(Новый Структура("ИД", Параметр.ИД)).Количество() = 0 Тогда 
				НоваяСтрока = ТаблицаРемонтов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Параметр);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура ПеренестиРемонты(Команда)
	Если ТаблицаРемонтов.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	ПеренестиРемонтыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	СтруктураФормы = Новый Структура("ЗакрыватьПриВыборе", Ложь);
	ОткрытьФорму("Документ.торо_ЗакрытиеЗаявокИРемонтов.Форма.гкс_ПодборРемонтов",, 
		ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
       
&НаСервере
Процедура ПеренестиРемонтыНаСервере()
	ДобавитьСекунд = 0;
	Если Не ЭтотОбъект["гкс_СдвигЧП"] = 0 Тогда 
		ДобавитьСекунд = (ЭтотОбъект["гкс_СдвигЧП"] * -3600);
	КонецЕсли;
	СтрокиУдаленияИзТаблицы = Новый Массив();
	МассивПеренесенных = Новый Массив();
	Для Каждого СтрокаТЧ Из ТаблицаРемонтов Цикл
		Если СтрокаТЧ.ДатаНачала = СтрокаТЧ.НоваяДатаНачала ИЛИ Не ЗначениеЗаполнено(СтрокаТЧ.НоваяДатаНачала)
			ИЛИ Не ЗначениеЗаполнено(СтрокаТЧ.НоваяДатаОкончания) Тогда 
			// если не изменилась то и переносить не нужно
			Продолжить;
		КонецЕсли;
		СтрокиУдаленияИзТаблицы.Добавить(СтрокаТЧ);
		
		НЗ = РегистрыСведений.торо_АктуальныеПлановыеДатыРемонтов.СоздатьМенеджерЗаписи();
		НЗ.IDРемонта = СтрокаТЧ.ИД;
		НЗ.ДокументОснование = СтрокаТЧ.ДокументОснование;
		// гкс+ [02.23] Деснол 06.02.2023
		Если ЗначениеЗаполнено(СтрокаТЧ.Заявка) Тогда 
			НЗ.ДокументОснование = СтрокаТЧ.Заявка;
		Иначе
			НЗ.ДокументОснование = СтрокаТЧ.ДокументОснование;
		КонецЕсли;
		// гкс- [02.23] Деснол 06.02.2023
		НЗ.ДокументНачалаЦепочки = СтрокаТЧ.ДокументОснование;
		НЗ.ОбъектРемонта = СтрокаТЧ.ОР;
		НЗ.ДатаНачала = СтрокаТЧ.НоваяДатаНачала + ДобавитьСекунд;
		НЗ.ДатаОкончания = СтрокаТЧ.НоваяДатаОкончания + ДобавитьСекунд;
		НЗ.КрайняяДатаЗавершения = НЗ.ДатаОкончания;
		НЗ.гкс_ЭтоПереносРемонта = Истина;
		НЗ.Записать();
		МассивПеренесенных.Добавить(СтрокаТЧ.ИД);
	КонецЦикла;
	//
	Если МассивПеренесенных.Количество() Тогда
		СобытиеСсылка = Константы.гкс_СобытиеПереносРемонтаЗаявки.Получить();
		Если ЗначениеЗаполнено(СобытиеСсылка) Тогда 
		// найти заявки по ремонтам и сформировать уведомления
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	РегистрСведенийторо_ЗаявкиПоРемонтам.IDРемонта КАК ИД,
		               |	МАКСИМУМ(РегистрСведенийторо_ЗаявкиПоРемонтам.Регистратор) КАК Ссылка
		               |ИЗ
		               |	РегистрСведений.торо_ЗаявкиПоРемонтам КАК РегистрСведенийторо_ЗаявкиПоРемонтам
		               |ГДЕ
		               |	РегистрСведенийторо_ЗаявкиПоРемонтам.IDРемонта В(&ИД)
		               |	И РегистрСведенийторо_ЗаявкиПоРемонтам.Регистратор ССЫЛКА Документ.торо_ЗаявкаНаРемонт
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РегистрСведенийторо_ЗаявкиПоРемонтам.IDРемонта";
		Запрос.УстановитьПараметр("ИД", МассивПеренесенных);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда 
			
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				МассивСвойств = Новый Массив();
				НайдСтр = ТаблицаРемонтов.НайтиСтроки(Новый Структура("ИД", Выборка.ИД));
				Если НайдСтр.Количество() > 0 Тогда 
					МассивСвойств.Добавить(Новый Структура("Ключ,Значение", "НоваяДатаНачала", НайдСтр[0].НоваяДатаНачала + ДобавитьСекунд));
					МассивСвойств.Добавить(Новый Структура("Ключ,Значение", "НоваяДатаОкончания", НайдСтр[0].НоваяДатаОкончания + ДобавитьСекунд));
				КонецЕсли;
				торо_РаботаСУведомлениями.гкс_ЗаписатьУведомленияСрокаСогласования(Выборка.Ссылка, СобытиеСсылка, Новый Массив(), , МассивСвойств);
			КонецЦикла;
		КонецЕсли;
		//
		КонецЕсли;
	КонецЕсли;
	//
	Для Каждого СМ Из СтрокиУдаленияИзТаблицы Цикл
		ТаблицаРемонтов.Удалить(СМ);
	КонецЦикла;
	//ТаблицаРемонтов.Очистить();
КонецПроцедуры

&НаСервере
Процедура ОтменитьРемонтыНаСервереЧерезДокумент()
	НовыйДокумент = Документы.торо_ЗакрытиеЗаявокИРемонтов.СоздатьДокумент();
	НовыйДокумент.Организация = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР", "ОсновнаяОрганизация", Истина);
	НовыйДокумент.Ответственный = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР", "ОсновнойОтветственный", Справочники.Пользователи.ПустаяСсылка());	
	НовыйДокумент.Дата = ТекущаяДата();
	НовыйДокумент.ДатаАктуальности = НовыйДокумент.Дата;
	Для Каждого СтрокаТЧ Из ТаблицаРемонтов Цикл
		Если СтрокаТЧ.ДатаНачала = СтрокаТЧ.НоваяДатаНачала ИЛИ Не ЗначениеЗаполнено(СтрокаТЧ.ДатаНачала) Тогда 
			// если не изменилась то и переносить не нужно
			Продолжить;
		КонецЕсли;
		НоваяСтрока = НовыйДокумент.ЗакрываемыеРемонты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
		НоваяСтрока.ОбъектРемонта = СтрокаТЧ.ОР;
		НоваяСтрока.ВидРемонта = СтрокаТЧ.ВР;
		НоваяСтрока.ID = СтрокаТЧ.ИД;
		НоваяСтрока.Перенесен = Истина;
		//
		НоваяСтрока = НовыйДокумент.ЗакрываемыеЗаявки.Добавить();
		НоваяСтрока.ИДРемонта = СтрокаТЧ.ИД;
		НоваяСтрока.Заявка = СтрокаТЧ.Заявка;
		НоваяСтрока.ПричинаЗакрытия = Справочники.торо_ПричиныЗакрытияЗаявок.ПереносРемонта;
	КонецЦикла;
	НовыйДокумент.ДополнительныеСвойства.Вставить("ИзОбработки", Истина);
	НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	ТаблицаРемонтов.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтроке(Команда)
	Если р_НоваяДатаОкончания < р_НоваяДатаНачала Тогда 
		р_НоваяДатаОкончания = р_НоваяДатаНачала;
	КонецЕсли;
	ТекДанные = Элементы.ТаблицаРемонтов.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		ТекДанные.НоваяДатаНачала = р_НоваяДатаНачала;
		ТекДанные.НоваяДатаОкончания = р_НоваяДатаОкончания;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсем(Команда)
	Если р_НоваяДатаОкончания < р_НоваяДатаНачала Тогда 
		р_НоваяДатаОкончания = р_НоваяДатаНачала;
	КонецЕсли;
	Для Каждого СтрокаТаблицы Из ТаблицаРемонтов Цикл
		СтрокаТаблицы.НоваяДатаНачала = р_НоваяДатаНачала;
		СтрокаТаблицы.НоваяДатаОкончания = р_НоваяДатаОкончания;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРемонтовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ТаблицаРемонтовЗаявка" Тогда 
		ТекДанные = Элементы.ТаблицаРемонтов.ТекущиеДанные;
		Если Не ТекДанные = Неопределено Тогда 
			ПоказатьЗначение(, ТекДанные.Заявка);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


#КонецОбласти
// гкс- [11.22] Деснол 17.11.2022