#Область СлужебныеПроцедурыИФункции

// Заполняет список команд печати.
//
// Параметры:
// КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_ВыбытиеОбъектаРемонта";
	КомандаПечати.Идентификатор = "ВыбытиеОбъектаРемонта";
	КомандаПечати.Представление = НСтр("es='La salida del objeto de la reparación';ru='Выбытие объекта ремонта';en='Retirement object'");
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	
КонецПроцедуры

// Сформировать печатные формы объектов.
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую.
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать.
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати.
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы.
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ВыбытиеОбъектаРемонта") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"ВыбытиеОбъектаРемонта", 
		"Выбытие объекта ремонта", 
		ПечатьДокументаВыбытиеОбъектаРемонта(МассивОбъектов, ПараметрыПечати),
		,
		"Документ.торо_ВыбытиеОбъектаРемонта.ПФ_MXL_ВыбытиеОбъектаРемонта");
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьДокументаВыбытиеОбъектаРемонта(МассивОбъектов, ПараметрыПечати)
	
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_ВыбытиеОбъектаРемонта.ПФ_MXL_ВыбытиеОбъектаРемонта");
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	торо_ВыбытиеОбъектаРемонта.Ссылка КАК Документ,
	                |	торо_ВыбытиеОбъектаРемонта.Номер КАК Номер,
	                |	торо_ВыбытиеОбъектаРемонта.Дата КАК Дата,
	                |	торо_ВыбытиеОбъектаРемонта.ОбъектРемонта КАК ОбъектРемонта,
	                |	торо_ВыбытиеОбъектаРемонта.ОбъектРемонта.ИнвентарныйНомер КАК ИнвентарныйНомер,
	                |	торо_ВыбытиеОбъектаРемонта.Организация КАК Организация,
	                |	торо_ВыбытиеОбъектаРемонта.Подразделение КАК Подразделение,
					|	торо_ВыбытиеОбъектаРемонта.ОбъектРемонта.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
	                |	торо_ВыбытиеОбъектаРемонта.ДатаСписания КАК ДатаСписания,
	                |	торо_ВыбытиеОбъектаРемонта.Склад КАК Склад,
	                |	торо_ВыбытиеОбъектаРемонта.ВходилВСостав КАК ВходилВСостав,
	                |	торо_ВыбытиеОбъектаРемонта.Проведен КАК Проведен                
	                |ИЗ
	                |	Документ.торо_ВыбытиеОбъектаРемонта КАК торо_ВыбытиеОбъектаРемонта
	                |ГДЕ
	                |	торо_ВыбытиеОбъектаРемонта.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	ВыборкаДокументов = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДокументов.Следующий() Цикл
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Организация = ВыборкаДокументов.Организация;
		ОбластьМакета.Параметры.Подразделение = ВыборкаДокументов.Подразделение;
		ОбластьМакета.Параметры.Номер = ВыборкаДокументов.Номер;
		ОбластьМакета.Параметры.Дата = ВыборкаДокументов.Дата;
		ТабДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ОбщиеСведения");
		ОбластьМакета.Параметры.ОбъектРемонта = ВыборкаДокументов.ОбъектРемонта;
		ОбластьМакета.Параметры.ИнвентарныйНомер = ВыборкаДокументов.ИнвентарныйНомер;
		ОбластьМакета.Параметры.ДатаВвода = ВыборкаДокументов.ДатаВводаВЭксплуатацию;
		ОбластьМакета.Параметры.ДатаСписания = ВыборкаДокументов.ДатаСписания;
		ОбластьМакета.Параметры.Иерархия = ПреобразоватьСтрокуИерархии(ВыборкаДокументов.ВходилВСостав);
		ТабДокумент.Вывести(ОбластьМакета);
		
		ВывестиКомиссию(ВыборкаДокументов.Документ, Макет, ТабДокумент);
		
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла;

	ТабДокумент.ТолькоПросмотр = Истина;
	Возврат ТабДокумент;
	
КонецФункции

Функция ПреобразоватьСтрокуИерархии(ИсходныеСтроки)
	
	МассивСтрок = СтрРазделить(ИсходныеСтроки, Символы.ПС);
	Индекс = 0;
	СтрокаИерархии= "";
	Для каждого Стр Из МассивСтрок Цикл
		СтрокаИерархии = СтрокаИерархии + Сред(Стр, Индекс*4 + 1) + " - ";
		Индекс = Индекс + 1;
	КонецЦикла;
	СтрокаИерархии = Лев(СтрокаИерархии, СтрДлина(СтрокаИерархии) - 3);
	
	Возврат СтрокаИерархии;
	
КонецФункции

Процедура ВывестиКомиссию(СсылкаНаДокумент, Макет, ТабДокумент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	                |	торо_ВыбытиеОбъектаРемонтаСотрудники.Сотрудник КАК Сотрудник
	                |ИЗ
	                |	Документ.торо_ВыбытиеОбъектаРемонта.Сотрудники КАК торо_ВыбытиеОбъектаРемонтаСотрудники
	                |ГДЕ
	                |	торо_ВыбытиеОбъектаРемонтаСотрудники.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
	
	Результат = Запрос.Выполнить();
	ВыборкаКомиссия = Результат.Выбрать();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ОбластьМакета = Макет.ПолучитьОбласть("КомиссияШапка");
    ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Комиссия");
	Пока ВыборкаКомиссия.Следующий() Цикл
		 ОбластьМакета.Параметры.Сотрудник = ВыборкаКомиссия.Сотрудник;
		 ТабДокумент.Вывести(ОбластьМакета);		
	КонецЦикла;
		
КонецПроцедуры

Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

#КонецОбласти