#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("РаботаВАвтономномРежиме") Тогда
		ВызватьИсключение НСтр("es='El cambio del clasificador OKOF en el régimen ""del puesto de trabajo Autónomo"" es prohíbido';ru='Изменение классификатора ОКОФ в режиме ""Автономного рабочего места"" запрещено';en='Changing the OKOF classifier in the ""Offline Workplace"" mode is prohibited'");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
#КонецЕсли