
&НаСервере
Процедура Расш_гкс_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	НовыеРеквизиты = Новый Массив();
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("ТЧ1",Новый ОписаниеТипов("ТаблицаЗначений"),,"Соответствия значений свойствам"));
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("ТЧ1_Состояние",Новый ОписаниеТипов("СправочникСсылка.торо_ВидыЭксплуатации"),"ТЧ1","Состояние"));
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("ТЧ1_Значение",Новый ОписаниеТипов("Строка",,,,новый КвалификаторыСтроки("20")),"ТЧ1","Значение"));
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("ТЧ1_ПричинаПростоя",Новый ОписаниеТипов("СправочникСсылка.торо_ПричиныПростояОборудования"),"ТЧ1","Причина простоя"));
	ИзменитьРеквизиты(НовыеРеквизиты);
	//
	нТабл = Элементы.Добавить("ТЧ1",Тип("ТаблицаФормы"),);
	нТабл.ПутьКДанным = "ТЧ1";
	//нТабл.КоманднаяПанель.Видимость = Ложь;
	//
	НЭлем = Элементы.Добавить("ТЧ1_Состояние",Тип("ПолеФормы"),Элементы["ТЧ1"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "ТЧ1.ТЧ1_Состояние";
	//
	НЭлем = Элементы.Добавить("ТЧ1_Значение",Тип("ПолеФормы"),Элементы["ТЧ1"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "ТЧ1.ТЧ1_Значение";
	//
	НЭлем = Элементы.Добавить("ТЧ1_ПричинаПростоя",Тип("ПолеФормы"),Элементы["ТЧ1"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "ТЧ1.ТЧ1_ПричинаПростоя";
	//
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	гкс_СоответствиеЗначенийСостояниям.Значение КАК Значение,
		|	гкс_СоответствиеЗначенийСостояниям.Состояние КАК Состояние,
		|	гкс_СоответствиеЗначенийСостояниям.ПричинаПростоя КАК ПричинаПростоя
		|ИЗ
		|	РегистрСведений.гкс_СоответствиеЗначенийСостояниям КАК гкс_СоответствиеЗначенийСостояниям
		|ГДЕ
		|	гкс_СоответствиеЗначенийСостояниям.Подключение = &Подключение
		|	И гкс_СоответствиеЗначенийСостояниям.Тег = &Тег";
	
	Запрос.УстановитьПараметр("Подключение", Запись.Подключение);
	Запрос.УстановитьПараметр("Тег", Запись.Тег);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ЭтотОбъект["ТЧ1"].Добавить();
		НоваяСтрока.ТЧ1_Состояние = Выборка.Состояние;
		НоваяСтрока.ТЧ1_Значение = Выборка.Значение;
		НоваяСтрока.ТЧ1_ПричинаПростоя = Выборка.ПричинаПростоя;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура Расш_гкс_ПриЗаписиНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Для Каждого СтрокаТаблицы Из ЭтотОбъект["ТЧ1"] Цикл
		НаборЗаписей = РегистрыСведений.гкс_СоответствиеЗначенийСостояниям.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Подключение.Установить(Запись.Подключение);
		НаборЗаписей.Отбор.Тег.Установить(Запись.Тег);
		НаборЗаписей.Отбор.Значение.Установить(СтрокаТаблицы.ТЧ1_Значение);
		НоваяСтрока = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Запись);
		НоваяСтрока.Значение = СтрокаТаблицы.ТЧ1_Значение;
		НоваяСтрока.Состояние = СтрокаТаблицы.ТЧ1_Состояние;
		НоваяСтрока.ПричинаПростоя = СтрокаТаблицы.ТЧ1_ПричинаПростоя;
		НаборЗаписей.Записать();
	КонецЦикла;
КонецПроцедуры
