&НаКлиенте
Перем ОчищаемыеСтрокиТрудовыхРесурсов; // Хранит массив строк, которые необходимо очистить при 
									   // переключении с одной строки на другую в таблице ремонтов

#Область ОбработчикиСобытийФормы

&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура гкс_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ФОИспользоватьСкользящееПланирование = ПолучитьФункциональнуюОпцию("торо_ИспользоватьСкользящееПланирование");
	ФОНазначениеНаРемонтыСУчетомРисков   = ПолучитьФункциональнуюОпцию("торо_НазначениеНаРемонтСУчетомРисков");

	Если ФОИспользоватьСкользящееПланирование Тогда
		Для каждого Элемент Из Элементы.ГруппаГлубинаПланирования.ПодчиненныеЭлементы Цикл
			Элемент.ТолькоПросмотр = Истина;
		КонецЦикла; 
		Элементы.ГруппаОтборыПоИсполнителям.Заголовок = Элементы.ГруппаОтборыПоИсполнителям.Заголовок + ", план работ";
	Иначе
		Элементы.ВидПлана.Видимость                             = Ложь;
		Элементы.ФормаСохранитьПланПодразделения.Видимость      = Ложь;
		Элементы.ГруппаПланРабот.Видимость                      = Ложь;
		Элементы.ДеревоРемонтыГруппаРедактируемыеДаты.Видимость = Ложь;
	КонецЕсли;

	Элементы.ОтобразитьНезапланированныеРемонты.Видимость = Ложь;
	Элементы.НезапланированныеРемонтыГруппа.Видимость	  = Ложь;

	Организация = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ОсновнаяОрганизация",
	Истина);

	ПоказыватьВнешниеОснования		= Истина;
	ПоказыватьДефекты               = Истина;
	ПоказыватьРемонтыППР            = Истина;
	ПоказыватьРемонтыРегламентные   = Истина;

	ДатаОтсчета = ТекущаяДата();

	ГруппироватьПоИсполнителю = 0;
	ВерхнийУровень = "4";
	НижнийУровень  = "2";

	ДиаграммаГантаПодразделения.ОтображатьЗаголовок = Ложь;
	ДиаграммаГантаПодразделения.ОтображатьЛегенду   = Ложь;
	#Вставка
	// Гкс+[TOIR20-173] Селимов от 24.11.2020. Добавлено:{
	ДобавитьЭлементыФормы();  // } Гкс-[TOIR20-173] 
	#КонецВставки 
	
КонецПроцедуры

// Гкс+[TOIR20-173] Селимов 	
&НаСервере
Процедура гкс_ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если Настройки.Получить("ТрудовыеРесурсы_ПериодС") <> Неопределено Тогда
		ЭтаФорма["ТрудовыеРесурсы_ПериодС"] = Настройки["ТрудовыеРесурсы_ПериодС"];
		Если ЭтаФорма["ТрудовыеРесурсы_ПериодС"] = Дата(1, 1, 1) Тогда
			 ЭтаФорма["ТрудовыеРесурсы_ПериодС"] = НачалоГода(ТекущаяДатаСеанса());	
		КонецЕсли; 
	КонецЕсли; 	
	Если Настройки.Получить("ТрудовыеРесурсы_ПериодПо") <> Неопределено Тогда
		ЭтаФорма["ТрудовыеРесурсы_ПериодПо"] = Настройки["ТрудовыеРесурсы_ПериодПо"]; 
		Если ЭтаФорма["ТрудовыеРесурсы_ПериодПо"] = Дата(1, 1, 1) Тогда
			 ЭтаФорма["ТрудовыеРесурсы_ПериодПо"] = КонецГода(ТекущаяДатаСеанса());	
		КонецЕсли; 
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПриОткрытии")
Процедура гкс_ПриОткрытии(Отказ)
	ВариантГруппировкиПриИзменении(Элементы.ВариантГруппировки);
	СформироватьЗаголовокСвернутойГруппы(Элементы.ПоказыватьВнешниеОснования);
	УстановитьЗаголовкиКолонок();
	РемонтыТаблицаИДиаграммаПриСменеСтраницы(Элементы.РемонтыТаблицаИДиаграмма,Элементы.РемонтыТаблицаИДиаграмма.ТекущаяСтраница);

	Если ФОИспользоватьСкользящееПланирование Тогда
		ВидПланаПриИзменении(Элементы.ВидПлана);
	КонецЕсли;
    #Вставка
	// Гкс+[TOIR20-173] Селимов
	ЗаполнитьТрудовыеРесурсы(); 
	// Гкс+[TOIR20-186] Селимов 
	УстановитьДоступностьКомандТаблицыРемонтов(Ложь); 
	#КонецВставки
	
КонецПроцедуры

&НаСервере
Процедура гкс_ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	// Гкс+[TOIR20-173] Селимов 	
	Настройки.Вставить("ТрудовыеРесурсы_ПериодС", ЭтаФорма["ТрудовыеРесурсы_ПериодС"]);
	Настройки.Вставить("ТрудовыеРесурсы_ПериодПо", ЭтаФорма["ТрудовыеРесурсы_ПериодПо"]); 

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ОбработкаВыбора")
Процедура гкс_ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.торо_ПланРаботПодразделения") Тогда
		ПланРабот = ВыбранноеЗначение;
		ОбновитьЗаголовокКнопкиПланРабот();
		СтруктураДанныхПлана = ПолучитьСтруктуруДанныхИзСохраненногоПлана(ПланРабот);
		ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураДанныхПлана);

		ВидыРемонтов.Очистить();
		ВидыРемонтов.ЗагрузитьЗначения(СтруктураДанныхПлана.ВидыРемонтовМассив);
		ВидПланаПриИзменении(Элементы.ВидПлана);
		Элементы.ОтобразитьНезапланированныеРемонты.Видимость = Истина;
		Элементы.НезапланированныеРемонтыГруппа.Видимость	  = Истина;
	#Вставка
	// Гкс+[TOIR20-191] Селимов
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.торо_ОстановочныеРемонты") Тогда
		ЭтаФорма["гкс_ОстановочныйРемонт"] = ВыбранноеЗначение;
		ОбновитьЗаголовокКнопкиОстановочныйРемонт(); 
	#КонецВставки	
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура гкс_ОрганизацияПриИзмененииВместо(Элемент)
	// Гкс+[TOIR20-173] Селимов 	
	ЗаполнитьТрудовыеРесурсы(); 
КонецПроцедуры

&НаКлиенте
Процедура гкс_ДатаОтсчетаПриИзмененииВместо(Элемент)
	// Гкс+[TOIR20-173] Селимов	
	ЗаполнитьТрудовыеРесурсы(); 
КонецПроцедуры

&НаКлиенте
Процедура ТрудовыеРесурсыпериодПриИзменении(Элемент)
	// Гкс+[TOIR20-173] Селимов	
	ЗаполнитьТрудовыеРесурсы(); 
КонецПроцедуры 

&НаКлиенте
Процедура ОтборКвалификацияПриИзменении(Элемент)
	// Гкс+[TOIR20-173] Селимов
	ЗаполнитьТрудовыеРесурсы(); 		
КонецПроцедуры     
     
// Гкс+[TOIR20-186] Селимов 
&НаКлиенте
Процедура гкс_РемонтыТаблицаИДиаграммаПриСменеСтраницыВместо(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.ГруппаДетальныеЗаписиПоРемонтам Тогда
		ТекущиеДанные = Элементы.ДеревоРемонты.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено
			И ЗначениеЗаполнено(ТекущиеДанные.Заявка) Тогда
			УстановитьДоступностьКомандТаблицыРемонтов(Истина);
		КонецЕсли; 
	КонецЕсли; 	
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ТаблицаРемонтов

// Гкс+[TOIR20-173] Селимов 	
&НаКлиенте
Процедура гкс_ДеревоРемонтыПриАктивизацииСтрокиВместо(Элемент)
	Если ОчищаемыеСтрокиТрудовыхРесурсов.Количество() > 0  Тогда
		Для каждого ОчищаемаяСтрока Из ОчищаемыеСтрокиТрудовыхРесурсов Цикл
			Если ОчищаемаяСтрока.Доступно > 0 Тогда
				ОчищаемаяСтрока.Требуется = 0;
			Иначе
				ЭтаФорма["ТаблицаТрудозатрат"].Удалить(ОчищаемаяСтрока);
			КонецЕсли; 					           			
		КонецЦикла; 		
		ОчищаемыеСтрокиТрудовыхРесурсов.Очистить();
	КонецЕсли; 
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ИДРемонтов = Новый Массив;
		Если ТекущиеДанные.ID_Ремонта = "" Тогда
			ЭлементыДерева = ТекущиеДанные.ПолучитьЭлементы();
			Для каждого ЭлементДерева Из ЭлементыДерева Цикл
				ИДРемонтов.Добавить(ЭлементДерева.ID_Ремонта);
			КонецЦикла;
		Иначе
			ИДРемонтов.Добавить(ТекущиеДанные.ID_Ремонта);	
		КонецЕсли; 
		ТребуемыеТрудозатраты = гкс_ДеревоРемонтыПриАктивизацииСтрокиНаСервере(ИДРемонтов);	
		Для каждого ТекущаяСтрока Из ТребуемыеТрудозатраты Цикл
			ПараметрыПоиска = Новый Структура("Квалификация", ТекущаяСтрока.Квалификация);
			ПоискСтрок = ЭтаФорма["ТаблицаТрудозатрат"].НайтиСтроки(ПараметрыПоиска);
			Если ПоискСтрок.Количество() > 0 Тогда
				ПоискСтрок[0].Требуется = ТекущаяСтрока.Требуется;
				ОчищаемыеСтрокиТрудовыхРесурсов.Добавить(ПоискСтрок[0]);
			Иначе
				НоваяСтрока = ЭтаФорма["ТаблицаТрудозатрат"].Добавить();
				НоваяСтрока.Квалификация = ТекущаяСтрока.Квалификация;
				НоваяСтрока.Требуется = ТекущаяСтрока.Требуется;
				ОчищаемыеСтрокиТрудовыхРесурсов.Добавить(НоваяСтрока);
			КонецЕсли; 
		КонецЦикла; 
		
		// Гкс+[TOIR20-186] Селимов 
		ДоступностьКоманд = ЗначениеЗаполнено(ТекущиеДанные.Заявка);
		УстановитьДоступностьКомандТаблицыРемонтов(ДоступностьКоманд); 
	КонецЕсли; 
	
КонецПроцедуры  

// Гкс+[TOIR20-186] Селимов 
&НаКлиенте
Процедура УстановитьДоступностьКомандТаблицыРемонтов(ДоступностьКоманд)
	Элементы["КомандаЗакрытьЗаявку"].Доступность = ДоступностьКоманд;
	Элементы["КомандаСвязанныеДокументы"].Доступность = ДоступностьКоманд;
	Элементы["КомандаСоздатьОстановочныйРемонт"].Доступность = ДоступностьКоманд;		
КонецПроцедуры         

&НаКлиенте
&ИзменениеИКонтроль("ДеревоРемонтыДатаОкончанияРедактируемаяПриИзменении")
Процедура гкс_ДеревоРемонтыДатаОкончанияРедактируемаяПриИзменении(Элемент)

	ТекущиеДанные = Элементы.ДеревоРемонты.ТекущиеДанные;
	#Вставка
	// Гкс+[TOIR20-185] Селимов 
	УстановитьИнтервалыВДиаграмме(ТекущиеДанные);    	
	#КонецВставки 
	Если Не ТекущиеДанные = Неопределено Тогда
		ПроверитьДатыРемонтовВСтроке(ТекущиеДанные);
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ДеревоРемонтыДатаНачалаРедактируемаяПриИзменении")
Процедура гкс_ДеревоРемонтыДатаНачалаРедактируемаяПриИзменении(Элемент)

	ТекущиеДанные = Элементы.ДеревоРемонты.ТекущиеДанные;
	#Вставка
	// Гкс+[TOIR20-185] Селимов
	УстановитьИнтервалыВДиаграмме(ТекущиеДанные);    	
	#КонецВставки 
	Если Не ТекущиеДанные = Неопределено Тогда
		ПроверитьДатыРемонтовВСтроке(ТекущиеДанные);
	КонецЕсли; 
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Гкс+[TOIR20-173] Селимов 
&НаКлиенте
Процедура ПоказатьТаблицуТрудовыхРесурсов(Команда)

	ВидимостьТаблицыТР = Элементы["гкс_ДостпупностьТрудовыхРесурсов"].Видимость;
	
	Элементы["гкс_ДостпупностьТрудовыхРесурсов"].Видимость = Не ВидимостьТаблицыТР;
	Элементы["КомандаПоказатьТаблицуТрудовыхРесурсов"].Пометка = Не ВидимостьТаблицыТР;
	
КонецПроцедуры  

// Гкс+[TOIR20-186] Селимов 
&НаКлиенте
Процедура ОткрытьАРМЗакрытиеЗаявок(Команда)
	
	ТекущиеДанные = Элементы.ДеревоРемонты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;		
	КонецЕсли; 
	
	ОтборРемонтов = Новый Структура("ID", ТекущиеДанные.ID_Ремонта);	
	
	ПараметрыКоманды = Новый Структура;
	ПараметрыКоманды.Вставить("ДоступностьКнопкиЗаполнить", Ложь);
	ПараметрыКоманды.Вставить("ОтборРемонтов", ОтборРемонтов);
	ОткрытьФорму("Обработка.торо_ЗакрытиеЗаявокИРемонтов.Форма.Форма", ПараметрыКоманды, ЭтаФорма, Новый УникальныйИдентификатор);
		
КонецПроцедуры  

// Гкс+[TOIR20-186] Селимов 
&НаКлиенте
Процедура СтруктураПодчиненности(Команда)
	
	ТекущиеДанные = Элементы.ДеревоРемонты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;		
	КонецЕсли; 
	
	ОбъектОтбора = Новый Структура("ОбъектОтбора", ТекущиеДанные.ДокументОснование);
	
	ОткрытьФорму("ОбщаяФорма.СтруктураПодчиненности", ОбъектОтбора, ЭтаФорма, Новый УникальныйИдентификатор);
	
КонецПроцедуры 

// Гкс+[TOIR20-186] Селимов 
&НаКлиенте
Процедура СоздатьОстановочныйРемонт(Команда)
	
	ТекущиеДанные = Элементы.ДеревоРемонты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;		
	КонецЕсли; 
	
	ФормаОстановочногоРемонта = ПолучитьФорму("Документ.торо_ОстановочныеРемонты.ФормаОбъекта");
	ДанныеФормы = ФормаОстановочногоРемонта.Объект; 
	ЗаполнитьОстановочныйРемонтНаСервере(ДанныеФормы, ТекущиеДанные.Заявка); // Заполняем документ на сервере
	КопироватьДанныеФормы(ДанныеФормы, ФормаОстановочногоРемонта.Объект); // Копируем наш объект в объект формы и далее открываем ее
	ФормаОстановочногоРемонта.Открыть();	
	
КонецПроцедуры   

// Гкс+[TOIR20-191] Селимов 
&НаКлиенте
Процедура ВыбратьОстановочныйРемонт(Команда)
	
	Если ЗначениеЗаполнено(ЭтаФорма["гкс_ОстановочныйРемонт"]) Тогда
		ОткрытьЗначение(ЭтаФорма["гкс_ОстановочныйРемонт"]);
	Иначе
		ОткрытьФорму("Документ.торо_ОстановочныеРемонты.ФормаВыбора",
					Новый Структура("Отбор", Новый Структура("Проведен", Истина)), ЭтаФорма);
	КонецЕсли; 

КонецПроцедуры      

// Гкс+[TOIR20-191] Селимов
&НаКлиенте
Процедура ОчиститьОстановочныйРемонт(Команда)
	
	ЭтаФорма["гкс_ОстановочныйРемонт"] = Неопределено;
	ОбновитьЗаголовокКнопкиОстановочныйРемонт();
	
КонецПроцедуры  
                                            
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Гкс+[TOIR20-173] Селимов		
&НаСервере
Процедура ДобавитьЭлементыФормы()
	
	// РЕКВИЗИТЫ
	ТипЧисло = Новый ОписаниеТипов("Число");
	ТипДата = Новый ОписаниеТипов("Дата");
	
	Реквизиты = Новый Массив;

	Реквизиты.Добавить(Новый РеквизитФормы("ТаблицаТрудозатрат", Новый ОписаниеТипов("ТаблицаЗначений")));
	Реквизиты.Добавить(Новый РеквизитФормы("Квалификация", 
							Новый ОписаниеТипов("СправочникСсылка.торо_КвалификацииРемонтногоПерсонала"), "ТаблицаТрудозатрат"));
	Реквизиты.Добавить(Новый РеквизитФормы("Доступно", ТипЧисло, "ТаблицаТрудозатрат"));
	Реквизиты.Добавить(Новый РеквизитФормы("Требуется", ТипЧисло, "ТаблицаТрудозатрат"));
	
	// Гкс+[TOIR20-184] 
	Реквизиты.Добавить(Новый РеквизитФормы("Стоимость", ТипЧисло, "ДеревоРемонты"));// Гкс-[TOIR20-184] 

	Реквизиты.Добавить(Новый РеквизитФормы("ТрудовыеРесурсы_ПериодС", ТипДата, , , Истина)); 
	Реквизиты.Добавить(Новый РеквизитФормы("ТрудовыеРесурсы_ПериодПо", ТипДата, , , Истина)); 
	Реквизиты.Добавить(Новый РеквизитФормы("ОтборКвалификация", 
							Новый ОписаниеТипов("СправочникСсылка.торо_КвалификацииРемонтногоПерсонала"))); 	
							
	// Гкс+[TOIR20-191] Селимов 
	Реквизиты.Добавить(Новый РеквизитФормы("гкс_ОстановочныйРемонт", 
							Новый ОписаниеТипов("ДокументСсылка.торо_ОстановочныеРемонты"), , , Истина)); // Гкс-[TOIR20-191] 							
	ИзменитьРеквизиты(Реквизиты);
	
	// ЭЛЕМЕНТЫ	
	// ДостпупностьТрудовыхРесурсов
	НовыйЭлемент = Элементы.Добавить("гкс_ДостпупностьТрудовыхРесурсов",
						Тип("ГруппаФормы"), Элементы["ГруппаДетальныеЗаписиПоРемонтам"]);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь;  	
	Элементы["гкс_ДостпупностьТрудовыхРесурсов"].Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	// ДостпупностьТрудовыхРесурсовПериод
	НовыйЭлемент = Элементы.Добавить("гкс_ДостпупностьТрудовыхРесурсовПериод", 
						Тип("ГруппаФормы"), Элементы["гкс_ДостпупностьТрудовыхРесурсов"]);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь;  	
	Элементы["гкс_ДостпупностьТрудовыхРесурсовПериод"].Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	#Область ТаблицаТрудовыеРесурсы
	ТаблицаТрудовыеРесурсы = Элементы.Добавить("ТаблицаТрудозатрат", 
											   Тип("ТаблицаФормы"), 
											   Элементы["гкс_ДостпупностьТрудовыхРесурсов"]);
	ТаблицаТрудовыеРесурсы.ПутьКДанным = "ТаблицаТрудозатрат";

	ТаблицаТрудовыеРесурсы.ИзменятьСоставСтрок = Ложь;
	ТаблицаТрудовыеРесурсы.ИзменятьПорядокСтрок = Ложь;
	ТаблицаТрудовыеРесурсы.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;

	НовыйЭлемент = Элементы.Добавить("КолонкаКвалификация", Тип("ПолеФормы"), ТаблицаТрудовыеРесурсы);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "ТаблицаТрудозатрат.Квалификация";
	НовыйЭлемент.Заголовок = "Квалификация";

	НовыйЭлемент = Элементы.Добавить("КолонкаДоступно", Тип("ПолеФормы"), ТаблицаТрудовыеРесурсы);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "ТаблицаТрудозатрат.Доступно";
	НовыйЭлемент.Заголовок = "Доступно";

	НовыйЭлемент = Элементы.Добавить("КолонкаТребуется", Тип("ПолеФормы"), ТаблицаТрудовыеРесурсы);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "ТаблицаТрудозатрат.Требуется";
	НовыйЭлемент.Заголовок = "Требуется";
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
    
	ОтборУО = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборУО.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаТрудозатрат.Требуется");
	ОтборУО.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	ОтборУО.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаТрудозатрат.Доступно");
	    
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТаблицаТрудозатрат");
	    
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоРозовый);
	Элементы["гкс_ДостпупностьТрудовыхРесурсов"].Видимость = Ложь;
	#КонецОбласти 

	НовыйЭлемент = Элементы.Добавить("ТрудовыеРесурсы_ПериодС", Тип("ПолеФормы"), 
									Элементы["гкс_ДостпупностьТрудовыхРесурсовПериод"]);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ТрудовыеРесурсы_ПериодС";
	НовыйЭлемент.Заголовок = "Период";
	НовыйЭлемент.УстановитьДействие("ПриИзменении","ТрудовыеРесурсыпериодПриИзменении");
	
	НовыйЭлемент = Элементы.Добавить("ТрудовыеРесурсы_ПериодПо", Тип("ПолеФормы"), 
									Элементы["гкс_ДостпупностьТрудовыхРесурсовПериод"]);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ТрудовыеРесурсы_ПериодПо";
	НовыйЭлемент.Заголовок = "-";
	НовыйЭлемент.УстановитьДействие("ПриИзменении","ТрудовыеРесурсыпериодПриИзменении"); 
	
	// Гкс+[TOIR20-183] Селимов 
	// отбор квалификация
	НовыйЭлемент = Элементы.Добавить("ОтборКвалификация", Тип("ПолеФормы"), 
									Элементы["ГруппаИсполнители"]);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ОтборКвалификация";
	НовыйЭлемент.Заголовок = "Квалификация персонала";
	НовыйЭлемент.КнопкаОчистки = Истина;
	НовыйЭлемент.КнопкаОткрытия = Ложь;	 
	НовыйЭлемент.УстановитьДействие("ПриИзменении","ОтборКвалификацияПриИзменении"); 
	
	#Область ТаблицаРемонтов
	// Гкс+[TOIR20-184] Селимов 
	НовыйЭлемент = Элементы.Добавить("КолонкаСтоимость", Тип("ПолеФормы"), Элементы.ДеревоРемонтыГруппа1);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ДеревоРемонты.Стоимость";
	НовыйЭлемент.Заголовок = "Стоимость"; // Гкс-[TOIR20-184] 
	
	НовыйЭлемент = Элементы.Добавить("КолонкаЗаявка", Тип("ПолеФормы"), Элементы.ДеревоРемонтыГруппа1);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "ДеревоРемонты.Заявка";
	НовыйЭлемент.Заголовок = "Заявка";
	#КонецОбласти           

	// КОМАНДЫ
	НоваяКоманда = ЭтаФорма.Команды.Добавить("КомандаПоказатьТаблицуТрудовыхРесурсов");
	НоваяКоманда.Действие = "ПоказатьТаблицуТрудовыхРесурсов";
	НоваяКоманда.Заголовок = "Таблица трудовых ресурсов";
	НовыйЭлемент = Элементы.Добавить("КомандаПоказатьТаблицуТрудовыхРесурсов", Тип("КнопкаФормы"), 
										Элементы.ДеревоРемонты.КоманднаяПанель);
	НовыйЭлемент.ИмяКоманды = "КомандаПоказатьТаблицуТрудовыхРесурсов";
	
	// Гкс+[TOIR20-186] Селимов 
	НоваяКоманда = ЭтаФорма.Команды.Добавить("КомандаЗакрытьЗаявку");
	НоваяКоманда.Действие = "ОткрытьАРМЗакрытиеЗаявок";
	НоваяКоманда.Заголовок = "Закрыть заявку";
	НовыйЭлемент = Элементы.Добавить("КомандаЗакрытьЗаявку", Тип("КнопкаФормы"), 
										Элементы.ДеревоРемонты.КоманднаяПанель);
	НовыйЭлемент.ИмяКоманды = "КомандаЗакрытьЗаявку";
	
	НоваяКоманда = ЭтаФорма.Команды.Добавить("КомандаСвязанныеДокументы");
	НоваяКоманда.Действие = "СтруктураПодчиненности";
	НоваяКоманда.Заголовок = "Связанные документы";
	НоваяКнопкаОбщейКоманды = Элементы.Добавить("КомандаСвязанныеДокументы", Тип("КнопкаФормы"), 
										Элементы.ДеревоРемонты.КоманднаяПанель);
	НоваяКнопкаОбщейКоманды.ИмяКоманды = "КомандаСвязанныеДокументы";
	
	НоваяКоманда = ЭтаФорма.Команды.Добавить("КомандаСоздатьОстановочныйРемонт");
	НоваяКоманда.Действие = "СоздатьОстановочныйРемонт";
	НоваяКоманда.Заголовок = "Создать остановочный ремонт";
	НоваяКнопкаОбщейКоманды = Элементы.Добавить("КомандаСоздатьОстановочныйРемонт", Тип("КнопкаФормы"), 
										Элементы.ДеревоРемонты.КоманднаяПанель);
	НоваяКнопкаОбщейКоманды.ИмяКоманды = "КомандаСоздатьОстановочныйРемонт"; 	
	
	// Гкс+[TOIR20-191] Селимов 
	НовыйЭлемент = Элементы.Добавить("гкс_ГруппаОстановочниыйРемонт",
						Тип("ГруппаФормы"), Элементы["ГруппаПраво"]);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь;  	
	Элементы["гкс_ГруппаОстановочниыйРемонт"].Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	НоваяКоманда = ЭтаФорма.Команды.Добавить("КомандаВыбратьОстановочныйРемонт");
	НоваяКоманда.Действие = "ВыбратьОстановочныйРемонт";
	НоваяКоманда.Заголовок = "   Выбрать остановочный ремонт";
	НовыйЭлемент = Элементы.Добавить("КомандаВыбратьОстановочныйРемонт", Тип("КнопкаФормы"), 
										Элементы["гкс_ГруппаОстановочниыйРемонт"]);
	НовыйЭлемент.ИмяКоманды = "КомандаВыбратьОстановочныйРемонт";
	НовыйЭлемент.Вид = ВидКнопкиФормы.Гиперссылка;
	
	НоваяКоманда = ЭтаФорма.Команды.Добавить("КомандаОчиститьОстановочныйРемонт");
	НоваяКоманда.Действие = "ОчиститьОстановочныйРемонт";
	НовыйЭлемент = Элементы.Добавить("КомандаОчиститьОстановочныйРемонт", Тип("КнопкаФормы"), 
										Элементы["гкс_ГруппаОстановочниыйРемонт"]);
	НовыйЭлемент.ИмяКоманды = "КомандаОчиститьОстановочныйРемонт";
	НовыйЭлемент.Картинка = БиблиотекаКартинок.ПолеВводаОчистить;
	НовыйЭлемент.Отображение = ОтображениеКнопки.Картинка;
	НовыйЭлемент.Вид = ВидКнопкиФормы.Гиперссылка;  
		
КонецПроцедуры 

// Гкс+[TOIR20-173] Селимов		
&НаКлиенте
Процедура ЗаполнитьТрудовыеРесурсы()
	ОчищаемыеСтрокиТрудовыхРесурсов.Очистить();
	ЗаполнитьТрудовыеРесурсыНаСервере()
КонецПроцедуры	

// Гкс+[TOIR20-173] Селимов		
&НаСервере
Процедура ЗаполнитьТрудовыеРесурсыНаСервере()
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	гкс_ТрудовыеРесурсыОстатки.Квалификация КАК Квалификация,
		|	ВЫБОР
		|		КОГДА гкс_ТрудовыеРесурсыОстатки.ДоступноОстаток - гкс_ТрудовыеРесурсыОстатки.ЗапланированоОстаток < 0
		|			ТОГДА 0
		|		ИНАЧЕ гкс_ТрудовыеРесурсыОстатки.ДоступноОстаток - гкс_ТрудовыеРесурсыОстатки.ЗапланированоОстаток
		|	КОНЕЦ КАК Доступно,
		|	0 КАК Требуется
		|ИЗ
		|	РегистрНакопления.гкс_ТрудовыеРесурсы.Остатки(
		|			,
		|			ПериодПланирования МЕЖДУ &ПериодС И &ПериодПо
		|				И &Организация = Организация
		|				И &Квалификация = Квалификация) КАК гкс_ТрудовыеРесурсыОстатки";
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Организация = Организация", "Истина");
	Иначе
		Запрос.УстановитьПараметр("Организация", Организация);		
	КонецЕсли; 
	Если Не ЗначениеЗаполнено(ЭтаФорма["ОтборКвалификация"]) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Квалификация = Квалификация", "Истина");
	Иначе
		Запрос.УстановитьПараметр("Квалификация", ЭтаФорма["ОтборКвалификация"]);		
	КонецЕсли; 
	Запрос.УстановитьПараметр("ПериодС", Этаформа["ТрудовыеРесурсы_ПериодС"]);
	Запрос.УстановитьПараметр("ПериодПо", Этаформа["ТрудовыеРесурсы_ПериодПо"]);
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	
	ЗначениеВРеквизитФормы(РезультатЗапроса.Выгрузить(), "ТаблицаТрудозатрат");	
	
КонецПроцедуры 

&НаКлиенте
&ИзменениеИКонтроль("ПостроитьОбновить")
Процедура гкс_ПостроитьОбновить(Команда)

	МожноВыполнитьПостроение = Истина;

	СписокПроверяемыхПолей = Новый СписокЗначений;
	СписокПроверяемыхПолей.Добавить(ДатаОтсчета, "Дата отсчета");
	СписокПроверяемыхПолей.Добавить(КоличествоПериодов, "Количество периодов");
	СписокПроверяемыхПолей.Добавить(Периодичность, "Периодичность");
	СписокПроверяемыхПолей.Добавить(Детализация, "Детализация");
	СписокПроверяемыхПолей.Добавить(ВерхнийУровень, "Верхний уровень");
	СписокПроверяемыхПолей.Добавить(НижнийУровень, "Нижний уровень");

	Для каждого ЭлементСписка Из СписокПроверяемыхПолей Цикл
		Если Не ЗначениеЗаполнено(ЭлементСписка.Значение) Тогда
			ШаблонСообщения = НСтр("es='%1';ru='Не заполнено поле %1';en='The field%1 is not filled'");
			#Удаление
			ТекстСообщения = СтрШаблон(ТекстСообщения, ЭлементСписка.Представление);
			#КонецУдаления
			#Вставка
			// Гкс+[TOIR20-173] Селимов                              			
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ЭлементСписка.Представление);  
			#КонецВставки
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);

			МожноВыполнитьПостроение = Ложь;
		КонецЕсли;
	КонецЦикла; 

	Если Не МожноВыполнитьПостроение Тогда
		Возврат;
	КонецЕсли; 

	ДеревоРемонты.ПолучитьЭлементы().Очистить();

	СтруктураДанныхПервогоУровня = Новый Структура();
	СтруктураДанныхВторогоУровня = Новый Структура();
	СтруктураДанныхУровеньДанные = Новый Структура();

	ПроставитьСвойстваОтображенияВСтруктурах(СтруктураДанныхПервогоУровня, СтруктураДанныхВторогоУровня, СтруктураДанныхУровеньДанные);

	ЗаполнитьСписокРемонтовНаСервере(СтруктураДанныхПервогоУровня, СтруктураДанныхВторогоУровня, СтруктураДанныхУровеньДанные);

	РазвернутьДерево();

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ЗаполнитьСписокРемонтовНаСервере")
Процедура гкс_ЗаполнитьСписокРемонтовНаСервере(СтруктураДанныхПервогоУровня, СтруктураДанныхВторогоУровня, СтруктураДанныхУровеньДанные, ВыводСНезапланированными)

	ДатаОкончания = ОбщегоНазначенияУТКлиентСервер.РассчитатьДатуОкончанияПериода(ДатаОтсчета, Периодичность, КоличествоПериодов);

	Запрос = Новый Запрос;

	Если Не ЗначениеЗаполнено(ПланРабот) ИЛИ ВыводСНезапланированными Тогда
		# Область ТекстЗапроса
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_АктуальныеПлановыеДатыРемонтов.IDРемонта КАК IDРемонта,
		|	торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала КАК ДатаНачала,
		|	торо_АктуальныеПлановыеДатыРемонтов.ДатаОкончания КАК ДатаОкончания,
		|	торо_АктуальныеПлановыеДатыРемонтов.КрайняяДатаЗавершения КАК КрайняяДатаЗавершения,
		|	торо_АктуальныеПлановыеДатыРемонтов.ДокументОснование КАК ДокументОснование,
		|	торо_АктуальныеПлановыеДатыРемонтов.ДокументНачалаЦепочки КАК ДокументНачалаЦепочки,
		|	торо_АктуальныеПлановыеДатыРемонтов.ОбъектРемонта КАК ОбъектРемонта,
		|	""ППР"" КАК ИсточникДанных
		|ПОМЕСТИТЬ ВТ_АктуальныеДаты
		|ИЗ
		|	РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК торо_АктуальныеПлановыеДатыРемонтов
		|ГДЕ
		|	&ПоказыватьРемонтыППР
		|	И торо_АктуальныеПлановыеДатыРемонтов.ДокументНачалаЦепочки ССЫЛКА Документ.торо_ПланГрафикРемонта
		|	И торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала >= &НачалоПериода
		|	И торо_АктуальныеПлановыеДатыРемонтов.ДатаОкончания <= &ОкончаниеПериода
		|	И (НЕ &ИспользоватьОтборПоОР
		|			ИЛИ торо_АктуальныеПлановыеДатыРемонтов.ОбъектРемонта В (&ОбъектРемонта))
		#Вставка
		// Гкс+[TOIR20-191] Селимов 
		|	И ВЫБОР
		|			КОГДА &ОтборПоОстановочномуРемонту
		|				ТОГДА торо_АктуальныеПлановыеДатыРемонтов.IDРемонта В (&ИДРемонтовОстановочных)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		#КонецВставки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_АктуальныеПлановыеДатыРемонтов.IDРемонта,
		|	торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала,
		|	торо_АктуальныеПлановыеДатыРемонтов.ДатаОкончания,
		|	торо_АктуальныеПлановыеДатыРемонтов.КрайняяДатаЗавершения,
		|	торо_АктуальныеПлановыеДатыРемонтов.ДокументОснование,
		|	торо_АктуальныеПлановыеДатыРемонтов.ДокументНачалаЦепочки,
		|	торо_АктуальныеПлановыеДатыРемонтов.ОбъектРемонта,
		|	""РМ""
		|ИЗ
		|	РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК торо_АктуальныеПлановыеДатыРемонтов
		|ГДЕ
		|	&ПоказыватьРемонтыРегламентные
		|	И торо_АктуальныеПлановыеДатыРемонтов.ДокументНачалаЦепочки ССЫЛКА Документ.торо_ГрафикРегламентныхМероприятийТОиР
		|	И торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала >= &НачалоПериода
		|	И торо_АктуальныеПлановыеДатыРемонтов.ДатаОкончания <= &ОкончаниеПериода
		|	И (НЕ &ИспользоватьОтборПоОР
		|			ИЛИ торо_АктуальныеПлановыеДатыРемонтов.ОбъектРемонта В (&ОбъектРемонта))
		#Вставка
		// Гкс+[TOIR20-191] Селимов 
		|	И ВЫБОР
		|			КОГДА &ОтборПоОстановочномуРемонту
		|				ТОГДА торо_АктуальныеПлановыеДатыРемонтов.IDРемонта В (&ИДРемонтовОстановочных)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		#КонецВставки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_АктуальныеПлановыеДатыРемонтов.IDРемонта,
		|	торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала,
		|	торо_АктуальныеПлановыеДатыРемонтов.ДатаОкончания,
		|	торо_АктуальныеПлановыеДатыРемонтов.КрайняяДатаЗавершения,
		|	торо_АктуальныеПлановыеДатыРемонтов.ДокументОснование,
		|	торо_АктуальныеПлановыеДатыРемонтов.ДокументНачалаЦепочки,
		|	торо_АктуальныеПлановыеДатыРемонтов.ОбъектРемонта,
		|	""СПД""
		|ИЗ
		|	РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК торо_АктуальныеПлановыеДатыРемонтов
		|ГДЕ
		|	&ПоказыватьДефекты
		|	И торо_АктуальныеПлановыеДатыРемонтов.ДокументНачалаЦепочки ССЫЛКА Документ.торо_ВыявленныеДефекты
		|	И торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала >= &НачалоПериода
		|	И торо_АктуальныеПлановыеДатыРемонтов.ДатаОкончания <= &ОкончаниеПериода
		|	И (НЕ &ИспользоватьОтборПоОР
		|			ИЛИ торо_АктуальныеПлановыеДатыРемонтов.ОбъектРемонта В (&ОбъектРемонта))
		|	И НЕ торо_АктуальныеПлановыеДатыРемонтов.ДокументОснование ССЫЛКА Документ.торо_ВыявленныеДефекты
		#Вставка
		// Гкс+[TOIR20-191] Селимов 
		|	И ВЫБОР
		|			КОГДА &ОтборПоОстановочномуРемонту
		|				ТОГДА торо_АктуальныеПлановыеДатыРемонтов.IDРемонта В (&ИДРемонтовОстановочных)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		#КонецВставки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_АктуальныеПлановыеДатыРемонтов.IDРемонта,
		|	торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала,
		|	торо_АктуальныеПлановыеДатыРемонтов.ДатаОкончания,
		|	торо_АктуальныеПлановыеДатыРемонтов.КрайняяДатаЗавершения,
		|	торо_АктуальныеПлановыеДатыРемонтов.ДокументОснование,
		|	торо_АктуальныеПлановыеДатыРемонтов.ДокументНачалаЦепочки,
		|	торо_АктуальныеПлановыеДатыРемонтов.ОбъектРемонта,
		|	""СПВО""
		|ИЗ
		|	РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК торо_АктуальныеПлановыеДатыРемонтов
		|ГДЕ
		|	&ПоказыватьВнешниеОснования
		|	И торо_АктуальныеПлановыеДатыРемонтов.ДокументНачалаЦепочки ССЫЛКА Документ.торо_ВнешнееОснованиеДляРабот
		|	И торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала >= &НачалоПериода
		|	И торо_АктуальныеПлановыеДатыРемонтов.ДатаОкончания <= &ОкончаниеПериода
		|	И (НЕ &ИспользоватьОтборПоОР
		|			ИЛИ торо_АктуальныеПлановыеДатыРемонтов.ОбъектРемонта В (&ОбъектРемонта))
		|	И НЕ торо_АктуальныеПлановыеДатыРемонтов.ДокументОснование ССЫЛКА Документ.торо_ВыявленныеДефекты
		|	И НЕ торо_АктуальныеПлановыеДатыРемонтов.ДокументОснование ССЫЛКА Документ.торо_ВнешнееОснованиеДляРабот
		#Вставка
		// Гкс+[TOIR20-191] Селимов 
		|	И ВЫБОР
		|			КОГДА &ОтборПоОстановочномуРемонту
		|				ТОГДА торо_АктуальныеПлановыеДатыРемонтов.IDРемонта В (&ИДРемонтовОстановочных)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		#КонецВставки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОбъектРемонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_АктуальныеДаты.IDРемонта КАК IDРемонта,
		|	ВТ_АктуальныеДаты.ДатаНачала КАК ДатаНачала,
		|	ВТ_АктуальныеДаты.ДатаОкончания КАК ДатаОкончания,
		|	ВТ_АктуальныеДаты.КрайняяДатаЗавершения КАК КрайняяДатаЗавершения,
		|	ВТ_АктуальныеДаты.ДокументОснование КАК ДокументОснование,
		|	ВТ_АктуальныеДаты.ДокументНачалаЦепочки КАК ДокументНачалаЦепочки,
		|	ВТ_АктуальныеДаты.ОбъектРемонта КАК ОбъектРемонта,
		|	ВТ_АктуальныеДаты.ИсточникДанных КАК ИсточникДанных,
		|	ВЫБОР
		|		КОГДА торо_ОбъектыРемонта.ВнешнийОбъект
		|			ТОГДА торо_ОбъектыРемонта.Контрагент
		|		ИНАЧЕ торо_ОбъектыРемонта.Подразделение
		|	КОНЕЦ КАК ВладелецОР,
		|	торо_ОбъектыРемонта.Приоритет КАК КритичностьОборудования,
		|	ЛОЖЬ КАК Регламентный
		|ПОМЕСТИТЬ ВТ_АктульныеДатыСОтборомОР
		|ИЗ
		|	ВТ_АктуальныеДаты КАК ВТ_АктуальныеДаты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|		ПО ВТ_АктуальныеДаты.ОбъектРемонта = торо_ОбъектыРемонта.Ссылка
		|ГДЕ
		|	(НЕ &ИспользоватьОтборПоВладельцу
		|			ИЛИ (торо_ОбъектыРемонта.ВнешнийОбъект
		|					И торо_ОбъектыРемонта.Контрагент В (&Владелец)
		|				ИЛИ торо_ОбъектыРемонта.Подразделение В (&Владелец)))
		|	И (торо_ОбъектыРемонта.Организация = &Организация
		|			ИЛИ &ИспользоватьОтборПоВсемОрганизациям)
		|	И НЕ ВТ_АктуальныеДаты.ДокументНачалаЦепочки.Организация ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_АктуальныеДаты.IDРемонта,
		|	ВТ_АктуальныеДаты.ДатаНачала,
		|	ВТ_АктуальныеДаты.ДатаОкончания,
		|	ВТ_АктуальныеДаты.КрайняяДатаЗавершения,
		|	ВТ_АктуальныеДаты.ДокументОснование,
		|	ВТ_АктуальныеДаты.ДокументНачалаЦепочки,
		|	ВТ_АктуальныеДаты.ОбъектРемонта,
		|	ВТ_АктуальныеДаты.ИсточникДанных,
		|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.торо_ПриоритетыОбъектовРемонта.ПустаяСсылка),
		|	ИСТИНА
		|ИЗ
		|	ВТ_АктуальныеДаты КАК ВТ_АктуальныеДаты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_СписокОбъектовРегламентногоМероприятия КАК торо_СписокОбъектовРегламентногоМероприятия
		|		ПО ВТ_АктуальныеДаты.ОбъектРемонта = торо_СписокОбъектовРегламентногоМероприятия.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ГрафикРегламентныхМероприятийТОиР КАК торо_ГрафикРегламентныхМероприятийТОиР
		|		ПО ВТ_АктуальныеДаты.ДокументНачалаЦепочки = торо_ГрафикРегламентныхМероприятийТОиР.Ссылка
		|ГДЕ
		|	(НЕ &ИспользоватьОтборПоВладельцу
		|			ИЛИ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) В (&Владелец))
		|	И (торо_ГрафикРегламентныхМероприятийТОиР.Организация = &Организация
		|			ИЛИ &ИспользоватьОтборПоВсемОрганизациям)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	IDРемонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ОтмененныеРемонтыСрезПоследних.ID КАК ID
		|ПОМЕСТИТЬ ВТ_ОтмененныеРемонты
		|ИЗ
		|	РегистрСведений.торо_ОтмененныеРемонты.СрезПоследних(
		|			,
		|			ID В
		|				(ВЫБРАТЬ
		|					ВТ_АктульныеДатыСОтборомОР.IDРемонта КАК IDРемонта
		|				ИЗ
		|					ВТ_АктульныеДатыСОтборомОР КАК ВТ_АктульныеДатыСОтборомОР)) КАК торо_ОтмененныеРемонтыСрезПоследних
		|ГДЕ
		|	торо_ОтмененныеРемонтыСрезПоследних.Отменен
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_АктульныеДатыСОтборомОР.IDРемонта КАК IDРемонта,
		|	ВТ_АктульныеДатыСОтборомОР.ДатаНачала КАК ДатаНачала,
		|	ВТ_АктульныеДатыСОтборомОР.ДатаОкончания КАК ДатаОкончания,
		|	ВТ_АктульныеДатыСОтборомОР.КрайняяДатаЗавершения КАК КрайняяДатаЗавершения,
		|	ВТ_АктульныеДатыСОтборомОР.ДокументОснование КАК ДокументОснование,
		|	ВТ_АктульныеДатыСОтборомОР.ДокументНачалаЦепочки КАК ДокументНачалаЦепочки,
		|	ВТ_АктульныеДатыСОтборомОР.ОбъектРемонта КАК ОбъектРемонта,
		|	ВТ_АктульныеДатыСОтборомОР.ИсточникДанных КАК ИсточникДанных,
		|	ВТ_АктульныеДатыСОтборомОР.ВладелецОР КАК ВладелецОР,
		|	ВТ_АктульныеДатыСОтборомОР.КритичностьОборудования КАК КритичностьОборудования,
		|	ВТ_АктульныеДатыСОтборомОР.Регламентный КАК Регламентный
		|ПОМЕСТИТЬ ВТ_НеотмененныеРемонты
		|ИЗ
		|	ВТ_АктульныеДатыСОтборомОР КАК ВТ_АктульныеДатыСОтборомОР
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтмененныеРемонты КАК ВТ_ОтмененныеРемонты
		|		ПО ВТ_АктульныеДатыСОтборомОР.IDРемонта = ВТ_ОтмененныеРемонты.ID
		|ГДЕ
		|	ВТ_ОтмененныеРемонты.ID ЕСТЬ NULL
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	IDРемонта
		|;
		|
		#Вставка
		// Гкс+[TOIR20-183] Селимов
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ПлановыеТрудовыеЗатратыРемонтныхРаботОбороты.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		|	торо_ПлановыеТрудовыеЗатратыРемонтныхРаботОбороты.Квалификация КАК Квалификация,
		|	торо_ПлановыеТрудовыеЗатратыРемонтныхРаботОбороты.ID КАК ID,
		|	торо_ПлановыеТрудовыеЗатратыРемонтныхРаботОбороты.РемонтнаяРабота КАК РемонтнаяРабота,
		|	торо_ПлановыеТрудовыеЗатратыРемонтныхРаботОбороты.КоличествоОборот КАК КоличествоОборот,
		|	торо_ПлановыеТрудовыеЗатратыРемонтныхРаботОбороты.СуммаОборот КАК СуммаОборот,
		|	торо_ПлановыеТрудовыеЗатратыРемонтныхРаботОбороты.ВремяРаботыОборот КАК ВремяРаботыОборот
		|ПОМЕСТИТЬ ВТ_ПлановыеТрудозатраты
		|ИЗ
		|	РегистрНакопления.торо_ПлановыеТрудовыеЗатратыРемонтныхРабот.Обороты(
		|			,
		|			,
		|			,
		|			РемонтыОборудования_ID В
		|					(ВЫБРАТЬ
		|						ВТ_НеотмененныеРемонты.IDРемонта КАК IDРемонта
		|					ИЗ
		|						ВТ_НеотмененныеРемонты КАК ВТ_НеотмененныеРемонты
		|					СГРУППИРОВАТЬ ПО
		|						ВТ_НеотмененныеРемонты.IDРемонта)
		|				И ВЫБОР
		|					КОГДА &ОтборПоКвалификации
		|						ТОГДА Квалификация = &Квалификация
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК торо_ПлановыеТрудовыеЗатратыРемонтныхРаботОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ПлановыеМатериальныеЗатратыРемонтныхРаботОбороты.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		|	торо_ПлановыеМатериальныеЗатратыРемонтныхРаботОбороты.Номенклатура КАК Номенклатура,
		|	торо_ПлановыеМатериальныеЗатратыРемонтныхРаботОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	торо_ПлановыеМатериальныеЗатратыРемонтныхРаботОбороты.ID КАК ID,
		|	торо_ПлановыеМатериальныеЗатратыРемонтныхРаботОбороты.РемонтнаяРабота КАК РемонтнаяРабота,
		|	торо_ПлановыеМатериальныеЗатратыРемонтныхРаботОбороты.КоличествоОборот КАК КоличествоОборот
		|ПОМЕСТИТЬ ВТ_ПлановыеМатЗатраты
		|ИЗ
		|	РегистрНакопления.торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.Обороты(
		|			,
		|			,
		|			,
		|			РемонтыОборудования_ID В
		|				(ВЫБРАТЬ
		|					ВТ_НеотмененныеРемонты.IDРемонта КАК IDРемонта
		|				ИЗ
		|					ВТ_НеотмененныеРемонты КАК ВТ_НеотмененныеРемонты
		|				СГРУППИРОВАТЬ ПО
		|					ВТ_НеотмененныеРемонты.IDРемонта)) КАК торо_ПлановыеМатериальныеЗатратыРемонтныхРаботОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПлановыеМатЗатраты.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		|	СУММА(ВТ_ПлановыеМатЗатраты.КоличествоОборот * ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0)) КАК Сумма
		|ПОМЕСТИТЬ ВТ_СуммаМатЗатрат
		|ИЗ
		|	ВТ_ПлановыеМатЗатраты КАК ВТ_ПлановыеМатЗатраты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|				&НачалоПериода,
		|				(Номенклатура, Характеристика) В
		|					(ВЫБРАТЬ
		|						ВТ_ПлановыеМатЗатраты.Номенклатура КАК Номенклатура,
		|						ВТ_ПлановыеМатЗатраты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
		|					ИЗ
		|						ВТ_ПлановыеМатЗатраты КАК ВТ_ПлановыеМатЗатраты
		|					СГРУППИРОВАТЬ ПО
		|						ВТ_ПлановыеМатЗатраты.Номенклатура,
		|						ВТ_ПлановыеМатЗатраты.ХарактеристикаНоменклатуры)) КАК ЦеныНоменклатурыСрезПоследних
		|		ПО ВТ_ПлановыеМатЗатраты.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
		|			И ВТ_ПлановыеМатЗатраты.ХарактеристикаНоменклатуры = ЦеныНоменклатурыСрезПоследних.Характеристика
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ПлановыеМатЗатраты.РемонтыОборудования_ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПлановыеТрудозатраты.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		|	СУММА(ВТ_ПлановыеТрудозатраты.КоличествоОборот * ЕСТЬNULL(торо_СтоимостьЧасаКвалификацииСрезПоследних.Стоимость, 1)) КАК СтоимостьТрудозатрат
		|ПОМЕСТИТЬ ВТ_СуммаТрудозатрат
		|ИЗ
		|	ВТ_ПлановыеТрудозатраты КАК ВТ_ПлановыеТрудозатраты,
		|	РегистрСведений.торо_СтоимостьЧасаКвалификации.СрезПоследних(
		|			,
		|			Квалификация В
		|				(ВЫБРАТЬ
		|					ВТ_ПлановыеТрудозатраты.Квалификация КАК Квалификация
		|				ИЗ
		|					ВТ_ПлановыеТрудозатраты КАК ВТ_ПлановыеТрудозатраты
		|				СГРУППИРОВАТЬ ПО
		|					ВТ_ПлановыеТрудозатраты.Квалификация)) КАК торо_СтоимостьЧасаКвалификацииСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ПлановыеТрудозатраты.РемонтыОборудования_ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПлановыеТрудозатраты.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		|	ВТ_ПлановыеТрудозатраты.Квалификация КАК Квалификация
		|ПОМЕСТИТЬ ВТ_Квалификации
		|ИЗ
		|	ВТ_ПлановыеТрудозатраты КАК ВТ_ПлановыеТрудозатраты
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ПлановыеТрудозатраты.Квалификация,
		|	ВТ_ПлановыеТрудозатраты.РемонтыОборудования_ID
		|;
		|
		#КонецВставки 
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ID КАК ID,
		|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
		|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
		|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Исполнитель КАК Исполнитель,
		|	ЗНАЧЕНИЕ(Справочник.торо_РемонтныеБригады.ПустаяСсылка) КАК УточнениеИсполнителя
		|ПОМЕСТИТЬ ВТ_ППР
		|ИЗ
		|	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(
		|			,
		|			&ПоказыватьРемонтыППР
		|				И ID В
		|					(ВЫБРАТЬ
		|						ВТ_ИДРемонтов.IDРемонта
		|					ИЗ
		|						ВТ_НеотмененныеРемонты КАК ВТ_ИДРемонтов)
		|				И (НЕ &ИспользоватьОтборПоВР
		#Удаление
		|					ИЛИ ВидРемонтныхРабот В (&ВидыРемонтов))) КАК торо_ПлановыеРемонтныеРаботыСрезПоследних
		#КонецУдаления
		#Вставка
		// Гкс+[TOIR20-191] Селимов 
		|					ИЛИ ВидРемонтныхРабот В (&ВидыРемонтов))
		|				И ВЫБОР
		|					КОГДА &ОтборПоОстановочномуРемонту
		|						ТОГДА ID В (&ИДРемонтовОстановочных)
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК торо_ПлановыеРемонтныеРаботыСрезПоследних  
		#КонецВставки 
		|ГДЕ
		|	НЕ торо_ПлановыеРемонтныеРаботыСрезПоследних.Замещен
		|	И НЕ торо_ПлановыеРемонтныеРаботыСрезПоследних.Отменен
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_РемонтыСрезПоследних.ID КАК ID,
		|	торо_РемонтыСрезПоследних.ВидРемонта КАК ВидРемонта
		|ПОМЕСТИТЬ ВТ_ВидыРемонтаВОиВД
		|ИЗ
		|	РегистрСведений.торо_Ремонты.СрезПоследних(
		|			,
		|			ID В
		|					(ВЫБРАТЬ
		|						ВТ_НеотмененныеРемонты.IDРемонта КАК IDРемонта
		|					ИЗ
		|						ВТ_НеотмененныеРемонты КАК ВТ_НеотмененныеРемонты
		|					ГДЕ
		|						ВТ_НеотмененныеРемонты.ИсточникДанных В (""СПД"", ""СПВО""))
		#Вставка
		// Гкс+[TOIR20-191] Селимов 
		|				И ВЫБОР
		|					КОГДА &ОтборПоОстановочномуРемонту
		|						ТОГДА ID В (&ИДРемонтовОстановочных)
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ
		#КонецВставки
		|				И Регистратор ССЫЛКА Документ.торо_ЗаявкаНаРемонт) КАК торо_РемонтыСрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ВыявленныеДефектыСрезПоследних.ID КАК ID,
		|	торо_ВыявленныеДефектыСрезПоследних.КритичностьДефекта КАК КритичностьДефекта
		|ПОМЕСТИТЬ ВТ_ДефектыКритичность
		|ИЗ
		|	РегистрСведений.торо_ВыявленныеДефекты.СрезПоследних(
		|			,
		|			ID В
		|				(ВЫБРАТЬ
		|					ВТ_НеотмененныеРемонты.IDРемонта КАК IDРемонта
		|				ИЗ
		|					ВТ_НеотмененныеРемонты КАК ВТ_НеотмененныеРемонты)) КАК торо_ВыявленныеДефектыСрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ЗаявкиПоРемонтамСрезПоследних.Регистратор КАК Заявка,
		|	торо_ЗаявкиПоРемонтамСрезПоследних.IDРемонта КАК IDРемонта,
		|	ВЫБОР
		|		КОГДА торо_ЗаявкиПоРемонтамСрезПоследних.Исполнитель = НЕОПРЕДЕЛЕНО
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|		ИНАЧЕ торо_ЗаявкиПоРемонтамСрезПоследних.Исполнитель
		|	КОНЕЦ КАК Исполнитель,
		|	ВЫБОР
		|		КОГДА торо_ЗаявкиПоРемонтамСрезПоследних.УточнениеИсполнителя = НЕОПРЕДЕЛЕНО
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.торо_РемонтныеБригады.ПустаяСсылка)
		|		ИНАЧЕ торо_ЗаявкиПоРемонтамСрезПоследних.УточнениеИсполнителя
		|	КОНЕЦ КАК УточнениеИсполнителя
		|ПОМЕСТИТЬ ВТ_ЗаявкиВсе
		|ИЗ
		|	РегистрСведений.торо_ЗаявкиПоРемонтам.СрезПоследних(
		|			,
		|			IDРемонта В
		|				(ВЫБРАТЬ
		|					ВТ_НеотмененныеРемонты.IDРемонта КАК IDРемонта
		|				ИЗ
		#Удаление
		|					ВТ_НеотмененныеРемонты КАК ВТ_НеотмененныеРемонты)) КАК торо_ЗаявкиПоРемонтамСрезПоследних
		#КонецУдаления
		#Вставка
		// Гкс+[TOIR20-191] Селимов 
		|					ВТ_НеотмененныеРемонты КАК ВТ_НеотмененныеРемонты)
		|			И ВЫБОР КОГДА &ОтборПоОстановочномуРемонту ТОГДА
		|				IDРемонта В (&ИДРемонтовОстановочных) 
		|			ИНАЧЕ ИСТИНА
		|			КОНЕЦ) КАК торо_ЗаявкиПоРемонтамСрезПоследних
		#КонецВставки
		|ГДЕ
		|	НЕ торо_ЗаявкиПоРемонтамСрезПоследних.Отменен
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Заявка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ЗаявкиВсе.IDРемонта КАК IDРемонта,
		|	ВТ_ЗаявкиВсе.Исполнитель КАК Исполнитель,
		|	ВТ_ЗаявкиВсе.УточнениеИсполнителя КАК УточнениеИсполнителя,
		|	ВТ_ЗаявкиВсе.Заявка КАК Заявка
		|ПОМЕСТИТЬ ВТ_НеотмененныеЗаявкиИсполнители
		|ИЗ
		|	ВТ_ЗаявкиВсе КАК ВТ_ЗаявкиВсе
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОтмененныеЗаявки КАК торо_ОтмененныеЗаявки
		|		ПО ВТ_ЗаявкиВсе.Заявка = торо_ОтмененныеЗаявки.Заявка
		|			И ВТ_ЗаявкиВсе.IDРемонта = торо_ОтмененныеЗаявки.ИДРемонта
		|ГДЕ
		|	торо_ОтмененныеЗаявки.Заявка ЕСТЬ NULL
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	IDРемонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	торо_НарядыПоРемонтам.IDРемонта КАК IDРемонта
		|ПОМЕСТИТЬ ВТ_Наряды
		|ИЗ
		|	РегистрСведений.торо_НарядыПоРемонтам КАК торо_НарядыПоРемонтам
		|ГДЕ
		|	торо_НарядыПоРемонтам.IDРемонта В
		|			(ВЫБРАТЬ
		|				ВТ_НеотмененныеРемонты.IDРемонта КАК IDРемонта
		|			ИЗ
		|				ВТ_НеотмененныеРемонты КАК ВТ_НеотмененныеРемонты)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	IDРемонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	торо_АктыПоРемонтам.IDРемонта КАК IDРемонта
		|ПОМЕСТИТЬ ВТ_Акты
		|ИЗ
		|	РегистрСведений.торо_АктыПоРемонтам КАК торо_АктыПоРемонтам
		|ГДЕ
		|	торо_АктыПоРемонтам.IDРемонта В
		|			(ВЫБРАТЬ
		|				ВТ_НеотмененныеРемонты.IDРемонта КАК IDРемонта
		|			ИЗ
		|				ВТ_НеотмененныеРемонты КАК ВТ_НеотмененныеРемонты)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	IDРемонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	торо_ОстановочныеРемонтыСрезПоследних.IDЗависимого КАК ID_Ремонта
		|ПОМЕСТИТЬ ВТ_Остановочные
		|ИЗ
		|	РегистрСведений.торо_ОстановочныеРемонты.СрезПоследних(
		|			,
		|			IDЗависимого В
		|				(ВЫБРАТЬ
		|					ВТ_НеотмененныеРемонты.IDРемонта КАК IDРемонта
		|				ИЗ
		|					ВТ_НеотмененныеРемонты КАК ВТ_НеотмененныеРемонты)) КАК торо_ОстановочныеРемонтыСрезПоследних
		|ГДЕ
		|	НЕ торо_ОстановочныеРемонтыСрезПоследних.Отвязан
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID_Ремонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВТ_ППР.ID КАК ID_Ремонта,
		|	ВТ_ППР.ОбъектРемонтныхРабот КАК ОбъектРемонта,
		|	ВТ_ППР.ВидРемонтныхРабот КАК ВидРемонта,
		|	ВЫБОР
		|		КОГДА &ГруппироватьПоИсполнителю
		|			ТОГДА ЕСТЬNULL(ВТ_Заявки.Исполнитель, ВТ_ППР.Исполнитель)
		|		ИНАЧЕ NULL
		|	КОНЕЦ КАК Исполнитель,
		|	ВЫБОР
		|		КОГДА &ГруппироватьПоИсполнителю
		|			ТОГДА ЕСТЬNULL(ВТ_Заявки.УточнениеИсполнителя, ВТ_ППР.УточнениеИсполнителя)
		|		ИНАЧЕ NULL
		|	КОНЕЦ КАК УточнениеИсполнителя,
		|	ВТ_Заявки.Заявка КАК Заявка,
		|	ВЫБОР
		|		КОГДА ВТ_Заявки.Заявка ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьЗаявка
		|ПОМЕСТИТЬ ВТ_РемонтыСОтборомПоИсполнителю
		|ИЗ
		|	ВТ_ППР КАК ВТ_ППР
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НеотмененныеЗаявкиИсполнители КАК ВТ_Заявки
		|		ПО ВТ_ППР.ID = ВТ_Заявки.IDРемонта
		|ГДЕ
		|	(НЕ &ИспользоватьОтборПоИсполнителю
		|			ИЛИ ВТ_Заявки.Исполнитель В (&Исполнители)
		|			ИЛИ ВТ_ППР.Исполнитель В (&Исполнители))
		|	И (НЕ &ИспользоватьОтборПоУточнениюИсполнителя
		|			ИЛИ ВТ_Заявки.УточнениеИсполнителя В (&УточнениеИсполнителя))
		#Вставка
		// Гкс+[TOIR20-183] Селимов
		|	И ВЫБОР
		|			КОГДА &ОтборПоКвалификации
		|				ТОГДА ВТ_ППР.ID В
		|						(ВЫБРАТЬ
		|							ВТ_Квалификации.РемонтыОборудования_ID КАК РемонтыОборудования_ID
		|						ИЗ
		|							ВТ_Квалификации КАК ВТ_Квалификации
		|						СГРУППИРОВАТЬ ПО
		|							ВТ_Квалификации.РемонтыОборудования_ID)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		#КонецВставки 
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_ПлановыеМероприятияСрезПоследних.ID,
		|	торо_ПлановыеМероприятияСрезПоследних.СписокОбъектов,
		|	торо_ПлановыеМероприятияСрезПоследних.ВидМероприятия,
		|	ВЫБОР
		|		КОГДА &ГруппироватьПоИсполнителю
		|			ТОГДА торо_ПлановыеМероприятияСрезПоследних.Исполнитель
		|		ИНАЧЕ NULL
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ГруппироватьПоИсполнителю
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.торо_РемонтныеБригады.ПустаяСсылка)
		|		ИНАЧЕ NULL
		|	КОНЕЦ,
		|	NULL,
		|	ЛОЖЬ
		|ИЗ
		|	РегистрСведений.торо_ПлановыеМероприятия.СрезПоследних(
		|			,
		|			&ПоказыватьРемонтыРегламентные
		|				И ID В
		|					(ВЫБРАТЬ
		|						ВТ_ИДРемонтов.IDРемонта
		|					ИЗ
		|						ВТ_НеотмененныеРемонты КАК ВТ_ИДРемонтов)
		|				И (НЕ &ИспользоватьОтборПоВР
		|					ИЛИ ВидМероприятия В (&ВидыРемонтов))
		|				И ВЫБОР
		|					КОГДА &ИспользоватьОтборПоУточнениюИсполнителя
		|						ТОГДА ЗНАЧЕНИЕ(Справочник.торо_РемонтныеБригады.ПустаяСсылка) В (&УточнениеИсполнителя)
		|					ИНАЧЕ ИСТИНА
		#Вставка
		// Гкс+[TOIR20-183] Селимов 
		|				КОНЕЦ
		|				И ВЫБОР
		|					КОГДА &ОтборПоКвалификации
		|						ТОГДА ID В
		|								(ВЫБРАТЬ
		|									ВТ_Квалификации.РемонтыОборудования_ID КАК РемонтыОборудования_ID
		|								ИЗ
		|									ВТ_Квалификации КАК ВТ_Квалификации
		|								СГРУППИРОВАТЬ ПО
		|									ВТ_Квалификации.РемонтыОборудования_ID)
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ
		// Гкс+[TOIR20-191] Селимов 
		|				И ВЫБОР
		|					КОГДА &ОтборПоОстановочномуРемонту
		|						ТОГДА ID В (&ИДРемонтовОстановочных)
		|					ИНАЧЕ ИСТИНА
		#КонецВставки 
		|				КОНЕЦ) КАК торо_ПлановыеМероприятияСрезПоследних
		|ГДЕ
		|	НЕ торо_ПлановыеМероприятияСрезПоследних.Отменен
		|	И (НЕ &ИспользоватьОтборПоИсполнителю
		|			ИЛИ торо_ПлановыеМероприятияСрезПоследних.Исполнитель В (&Исполнители))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_НеотмененныеРемонты.IDРемонта,
		|	ВТ_НеотмененныеРемонты.ОбъектРемонта,
		|	ВТ_ВидыРемонтаВОиВД.ВидРемонта,
		|	ВЫБОР
		|		КОГДА &ГруппироватьПоИсполнителю
		|			ТОГДА ВТ_Заявки.Исполнитель
		|		ИНАЧЕ NULL
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ГруппироватьПоИсполнителю
		|			ТОГДА ВТ_Заявки.УточнениеИсполнителя
		|		ИНАЧЕ NULL
		|	КОНЕЦ,
		|	ВТ_Заявки.Заявка,
		|	ИСТИНА
		|ИЗ
		|	ВТ_НеотмененныеРемонты КАК ВТ_НеотмененныеРемонты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВидыРемонтаВОиВД КАК ВТ_ВидыРемонтаВОиВД
		|		ПО ВТ_НеотмененныеРемонты.IDРемонта = ВТ_ВидыРемонтаВОиВД.ID
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НеотмененныеЗаявкиИсполнители КАК ВТ_Заявки
		|		ПО ВТ_НеотмененныеРемонты.IDРемонта = ВТ_Заявки.IDРемонта
		|ГДЕ
		|	(НЕ &ИспользоватьОтборПоИсполнителю
		|			ИЛИ ВТ_Заявки.Исполнитель В (&Исполнители))
		|	И (НЕ &ИспользоватьОтборПоУточнениюИсполнителя
		|			ИЛИ ВТ_Заявки.УточнениеИсполнителя В (&УточнениеИсполнителя))
		|	И (НЕ &ИспользоватьОтборПоВР
		|			ИЛИ ВТ_ВидыРемонтаВОиВД.ВидРемонта В (&ВидыРемонтов))
		#Вставка
		// Гкс+[TOIR20-183] Селимов 
		|	И ВЫБОР
		|			КОГДА &ОтборПоКвалификации
		|				ТОГДА ВТ_НеотмененныеРемонты.IDРемонта В
		|						(ВЫБРАТЬ
		|							ВТ_Квалификации.РемонтыОборудования_ID КАК РемонтыОборудования_ID
		|						ИЗ
		|							ВТ_Квалификации КАК ВТ_Квалификации
		|						СГРУППИРОВАТЬ ПО
		|							ВТ_Квалификации.РемонтыОборудования_ID)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		#КонецВставки 
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID_Ремонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_СкользящийПлан.ID_Ремонта КАК ID_Ремонта,
		|	торо_СкользящийПлан.Регистратор КАК ПланРабот,
		|	ВЫБОР
		|		КОГДА торо_СкользящийПлан.ВидПлана = &ВидПлана
		|			ТОГДА торо_СкользящийПлан.ДатаНачалаРемонта >= торо_СкользящийПлан.ДатаНачалаБазовогоПериода
		|					И торо_СкользящийПлан.ДатаНачалаРемонта <= торо_СкользящийПлан.ДатаОкончанияБазовогоПериода
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ВБазовомПериоде
		|ПОМЕСТИТЬ ТаблицаИмеющихсяПлановРазвернутая
		|ИЗ
		|	РегистрСведений.торо_СкользящийПланРабот.СрезПоследних(
		|			,
		|			ID_Ремонта В
		|				(ВЫБРАТЬ
		|					ВТ_НеотмененныеРемонты.IDРемонта КАК IDРемонта
		|				ИЗ
		|					ВТ_НеотмененныеРемонты КАК ВТ_НеотмененныеРемонты)) КАК торо_СкользящийПлан
		|ГДЕ
		|	торо_СкользящийПлан.ВидПлана В(&ВидыПлана)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_СкользящийПлан.ID_Ремонта,
		|	торо_СкользящийПлан.Регистратор,
		|	ВЫБОР
		|		КОГДА торо_СкользящийПлан.ВидПлана = &ВидПлана
		|			ТОГДА торо_СкользящийПлан.ДатаНачалаРемонта >= торо_СкользящийПлан.ДатаНачалаБазовогоПериода
		|					И торо_СкользящийПлан.ДатаНачалаРемонта <= торо_СкользящийПлан.ДатаОкончанияБазовогоПериода
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|ИЗ
		|	РегистрСведений.торо_СкользящийПланРегламентныхМероприятий.СрезПоследних(
		|			,
		|			ID_Ремонта В
		|				(ВЫБРАТЬ
		|					ВТ_НеотмененныеРемонты.IDРемонта КАК IDРемонта
		|				ИЗ
		|					ВТ_НеотмененныеРемонты КАК ВТ_НеотмененныеРемонты)) КАК торо_СкользящийПлан
		|ГДЕ
		|	торо_СкользящийПлан.ВидПлана В(&ВидыПлана)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID_Ремонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаИмеющихсяПлановРазвернутая.ID_Ремонта КАК ID_Ремонта,
		|	ТаблицаИмеющихсяПлановРазвернутая.ПланРабот КАК ПланРабот
		|ПОМЕСТИТЬ ТаблицаИмеющихсяПланов
		|ИЗ
		|	ТаблицаИмеющихсяПлановРазвернутая КАК ТаблицаИмеющихсяПлановРазвернутая
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID_Ремонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаИмеющихсяПлановРазвернутая.ID_Ремонта КАК ID_Ремонта
		|ПОМЕСТИТЬ РемонтыБазовогоПлана
		|ИЗ
		|	ТаблицаИмеющихсяПлановРазвернутая КАК ТаблицаИмеющихсяПлановРазвернутая
		|ГДЕ
		|	ТаблицаИмеющихсяПлановРазвернутая.ВБазовомПериоде
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID_Ремонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ПланРаботПодразделенияСписокРемонтовПлана.ID КАК IDРемонта
		|ПОМЕСТИТЬ ВТ_РемонтыПлана
		|ИЗ
		|	Документ.торо_ПланРаботПодразделения.СписокРемонтовПлана КАК торо_ПланРаботПодразделенияСписокРемонтовПлана
		|ГДЕ
		|	торо_ПланРаботПодразделенияСписокРемонтовПлана.Ссылка = &ПланРабот
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	IDРемонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РемонтыСОтборомПоИсполнителю.ID_Ремонта КАК ID_Ремонта,
		|	ВТ_РемонтыСОтборомПоИсполнителю.ОбъектРемонта КАК ОбъектРемонта,
		|	ВТ_РемонтыСОтборомПоИсполнителю.ВидРемонта КАК ВидРемонта,
		|	ВТ_РемонтыСОтборомПоИсполнителю.Исполнитель КАК Исполнитель,
		|	ВТ_РемонтыСОтборомПоИсполнителю.УточнениеИсполнителя КАК УточнениеИсполнителя,
		|	ВТ_РемонтыСОтборомПоИсполнителю.Заявка КАК Заявка,
		|	ВТ_НеотмененныеРемонты.ДатаНачала КАК ДатаНачала,
		|	ВТ_НеотмененныеРемонты.ДатаОкончания КАК ДатаОкончания,
		|	ВТ_НеотмененныеРемонты.КрайняяДатаЗавершения КАК КрайняяДатаЗавершения,
		|	ВТ_НеотмененныеРемонты.ДатаНачала КАК ДатаНачалаИсходная,
		|	ВТ_НеотмененныеРемонты.ДатаОкончания КАК ДатаОкончанияИсходная,
		|	ВТ_НеотмененныеРемонты.КрайняяДатаЗавершения КАК КрайняяДатаЗавершенияИсходная,
		|	ВТ_НеотмененныеРемонты.ДокументОснование КАК ДокументПлановыхДат,
		|	ВТ_НеотмененныеРемонты.ДокументНачалаЦепочки КАК ДокументОснование,
		|	ВТ_НеотмененныеРемонты.ИсточникДанных КАК ИсточникДанных,
		|	ВТ_НеотмененныеРемонты.ВладелецОР КАК ВладелецОР,
		|	ВТ_НеотмененныеРемонты.КритичностьОборудования КАК КритичностьОборудования,
		|	ВТ_ДефектыКритичность.КритичностьДефекта КАК КритичностьДефекта,
		|	ВТ_НеотмененныеРемонты.Регламентный КАК Регламентный,
		|	ВТ_РемонтыСОтборомПоИсполнителю.ЕстьЗаявка КАК ЕстьЗаявка,
		|	ВЫБОР
		|		КОГДА ВТ_Наряды.IDРемонта ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьНаряд,
		|	ВЫБОР
		|		КОГДА ВТ_Акты.IDРемонта ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьАкт,
		|	ВЫБОР
		|		КОГДА ВТ_Остановочные.ID_Ремонта ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьОстановочный,
		|	ТаблицаИмеющихсяПланов.ПланРабот КАК ПланПодразделения,
		#Вставка
		// Гкс+[TOIR20-184] Селимов 
		|	ЕСТЬNULL(ВТ_СуммаМатЗатрат.Сумма, 0) + ЕСТЬNULL(ВТ_СуммаТрудозатрат.СтоимостьТрудозатрат, 0) КАК Стоимость,
		#КонецВставки 
		|	ВЫБОР
		|		КОГДА &ВыделятьНезапланированные И ВТ_РемонтыПлана.IDРемонта ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК НезапланированныйРемонт
		|ИЗ
		|	ВТ_РемонтыСОтборомПоИсполнителю КАК ВТ_РемонтыСОтборомПоИсполнителю
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НеотмененныеРемонты КАК ВТ_НеотмененныеРемонты
		|		ПО ВТ_РемонтыСОтборомПоИсполнителю.ID_Ремонта = ВТ_НеотмененныеРемонты.IDРемонта
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДефектыКритичность КАК ВТ_ДефектыКритичность
		|		ПО ВТ_РемонтыСОтборомПоИсполнителю.ID_Ремонта = ВТ_ДефектыКритичность.ID
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Наряды КАК ВТ_Наряды
		|		ПО ВТ_РемонтыСОтборомПоИсполнителю.ID_Ремонта = ВТ_Наряды.IDРемонта
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Акты КАК ВТ_Акты
		|		ПО ВТ_РемонтыСОтборомПоИсполнителю.ID_Ремонта = ВТ_Акты.IDРемонта
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остановочные КАК ВТ_Остановочные
		|		ПО ВТ_РемонтыСОтборомПоИсполнителю.ID_Ремонта = ВТ_Остановочные.ID_Ремонта
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаИмеющихсяПланов КАК ТаблицаИмеющихсяПланов
		|		ПО ВТ_РемонтыСОтборомПоИсполнителю.ID_Ремонта = ТаблицаИмеющихсяПланов.ID_Ремонта
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РемонтыПлана КАК ВТ_РемонтыПлана
		|		ПО ВТ_РемонтыСОтборомПоИсполнителю.ID_Ремонта = ВТ_РемонтыПлана.IDРемонта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РемонтыБазовогоПлана КАК РемонтыБазовогоПлана
		|		ПО ВТ_РемонтыСОтборомПоИсполнителю.ID_Ремонта = РемонтыБазовогоПлана.ID_Ремонта
		#Вставка
		// Гкс+[TOIR20-184] Селимов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммаМатЗатрат КАК ВТ_СуммаМатЗатрат
		|		ПО ВТ_РемонтыСОтборомПоИсполнителю.ID_Ремонта = ВТ_СуммаМатЗатрат.РемонтыОборудования_ID
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммаТрудозатрат КАК ВТ_СуммаТрудозатрат
		|		ПО ВТ_РемонтыСОтборомПоИсполнителю.ID_Ремонта = ВТ_СуммаТрудозатрат.РемонтыОборудования_ID
		#КонецВставки 
		|ГДЕ
		|	&УсловиеПоНезапланированным
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВЫБОР
		|		КОГДА &ПоВидам
		|			ТОГДА ВТ_РемонтыСОтборомПоИсполнителю.ВидРемонта.Наименование
		|		ИНАЧЕ ВТ_РемонтыСОтборомПоИсполнителю.ОбъектРемонта.Наименование
		|	КОНЕЦ,
		|	ВТ_НеотмененныеРемонты.ДатаНачала";
		# КонецОбласти

		Если ВыводСНезапланированными Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоНезапланированным",
			"	(РемонтыБазовогоПлана.ID_Ремонта ЕСТЬ NULL
			|	ИЛИ НЕ ВТ_РемонтыПлана.IDРемонта ЕСТЬ NULL)");
		Иначе
			Запрос.УстановитьПараметр("УсловиеПоНезапланированным", Истина);
		КонецЕсли;

		Запрос.УстановитьПараметр("ВыделятьНезапланированные", ВыводСНезапланированными);

	Иначе
		#Область ТекстЗапроса

		Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ПланРаботПодразделенияСписокРемонтовПлана.ID КАК ID_Ремонта,
		|	торо_ПланРаботПодразделенияСписокРемонтовПлана.ОбъектРемонта КАК ОбъектРемонта,
		|	ВЫРАЗИТЬ(торо_ПланРаботПодразделенияСписокРемонтовПлана.ОбъектРемонта КАК Справочник.торо_ОбъектыРемонта) КАК ОРДляПолученияВладельца,
		|	торо_ПланРаботПодразделенияСписокРемонтовПлана.ВидРемонта КАК ВидРемонта,
		|	торо_ПланРаботПодразделенияСписокРемонтовПлана.ДокументОснование КАК ДокументОснование,
		|	торо_ПланРаботПодразделенияСписокРемонтовПлана.ДатаНачала КАК ДатаНачала,
		|	торо_ПланРаботПодразделенияСписокРемонтовПлана.ДатаОкончания КАК ДатаОкончания,
		|	торо_ПланРаботПодразделенияСписокРемонтовПлана.КрайняяДатаЗавершения КАК КрайняяДатаЗавершения,
		|	торо_ПланРаботПодразделенияСписокРемонтовПлана.ДатаНачалаРемонтаИсходная КАК ДатаНачалаРемонтаИсходная,
		|	торо_ПланРаботПодразделенияСписокРемонтовПлана.ДатаОкончанияРемонтаИсходная КАК ДатаОкончанияРемонтаИсходная,
		|	торо_ПланРаботПодразделенияСписокРемонтовПлана.КрайняяДатаЗавершенияИсходная КАК КрайняяДатаЗавершенияИсходная,
		|	торо_ПланРаботПодразделенияСписокРемонтовПлана.Регламентный КАК Регламентный,
		|	торо_ПланРаботПодразделенияСписокРемонтовПлана.ИсточникДанных КАК ИсточникДанных
		|ПОМЕСТИТЬ вт_СохраненныеДанныеПлана
		|ИЗ
		|	Документ.торо_ПланРаботПодразделения.СписокРемонтовПлана КАК торо_ПланРаботПодразделенияСписокРемонтовПлана
		|ГДЕ
		|	торо_ПланРаботПодразделенияСписокРемонтовПлана.Ссылка = &ПланРабот
		#Вставка
		// Гкс+[TOIR20-191] Селимов 
		|	И ВЫБОР
		|			КОГДА &ОтборПоОстановочномуРемонту
		|				ТОГДА торо_ПланРаботПодразделенияСписокРемонтовПлана.ID В (&ИДРемонтовОстановочных)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		#КонецВставки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID_Ремонта,
		|	Регламентный
		|;
		|
		#Вставка
		// Гкс+[TOIR20-183] Селимов 
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ПлановыеТрудовыеЗатратыРемонтныхРаботОбороты.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		|	торо_ПлановыеТрудовыеЗатратыРемонтныхРаботОбороты.Квалификация КАК Квалификация,
		|	торо_ПлановыеТрудовыеЗатратыРемонтныхРаботОбороты.ID КАК ID,
		|	торо_ПлановыеТрудовыеЗатратыРемонтныхРаботОбороты.РемонтнаяРабота КАК РемонтнаяРабота,
		|	торо_ПлановыеТрудовыеЗатратыРемонтныхРаботОбороты.КоличествоОборот КАК КоличествоОборот,
		|	торо_ПлановыеТрудовыеЗатратыРемонтныхРаботОбороты.СуммаОборот КАК СуммаОборот,
		|	торо_ПлановыеТрудовыеЗатратыРемонтныхРаботОбороты.ВремяРаботыОборот КАК ВремяРаботыОборот
		|ПОМЕСТИТЬ ВТ_ПлановыеТрудозатраты
		|ИЗ
		|	РегистрНакопления.торо_ПлановыеТрудовыеЗатратыРемонтныхРабот.Обороты(
		|			,
		|			,
		|			,
		|			РемонтыОборудования_ID В
		|					(ВЫБРАТЬ
		|						вт_СохраненныеДанныеПлана.ID_Ремонта КАК ID_Ремонта
		|					ИЗ
		|						вт_СохраненныеДанныеПлана КАК вт_СохраненныеДанныеПлана
		|					СГРУППИРОВАТЬ ПО
		|						вт_СохраненныеДанныеПлана.ID_Ремонта)
		|				И ВЫБОР
		|					КОГДА &ОтборПоКвалификации
		|						ТОГДА Квалификация = &Квалификация
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК торо_ПлановыеТрудовыеЗатратыРемонтныхРаботОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ПлановыеМатериальныеЗатратыРемонтныхРаботОбороты.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		|	торо_ПлановыеМатериальныеЗатратыРемонтныхРаботОбороты.Номенклатура КАК Номенклатура,
		|	торо_ПлановыеМатериальныеЗатратыРемонтныхРаботОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	торо_ПлановыеМатериальныеЗатратыРемонтныхРаботОбороты.ID КАК ID,
		|	торо_ПлановыеМатериальныеЗатратыРемонтныхРаботОбороты.РемонтнаяРабота КАК РемонтнаяРабота,
		|	торо_ПлановыеМатериальныеЗатратыРемонтныхРаботОбороты.КоличествоОборот КАК КоличествоОборот
		|ПОМЕСТИТЬ ВТ_ПлановыеМатЗатраты
		|ИЗ
		|	РегистрНакопления.торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.Обороты(
		|			,
		|			,
		|			,
		|			РемонтыОборудования_ID В
		|				(ВЫБРАТЬ
		|					вт_СохраненныеДанныеПлана.ID_Ремонта КАК ID_Ремонта
		|				ИЗ
		|					вт_СохраненныеДанныеПлана КАК вт_СохраненныеДанныеПлана
		|				СГРУППИРОВАТЬ ПО
		|					вт_СохраненныеДанныеПлана.ID_Ремонта)) КАК торо_ПлановыеМатериальныеЗатратыРемонтныхРаботОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПлановыеМатЗатраты.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		|	СУММА(ВТ_ПлановыеМатЗатраты.КоличествоОборот * ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0)) КАК Сумма
		|ПОМЕСТИТЬ ВТ_СуммаМатЗатрат
		|ИЗ
		|	ВТ_ПлановыеМатЗатраты КАК ВТ_ПлановыеМатЗатраты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|				&НачалоПериода,
		|				(Номенклатура, Характеристика) В
		|					(ВЫБРАТЬ
		|						ВТ_ПлановыеМатЗатраты.Номенклатура КАК Номенклатура,
		|						ВТ_ПлановыеМатЗатраты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
		|					ИЗ
		|						ВТ_ПлановыеМатЗатраты КАК ВТ_ПлановыеМатЗатраты
		|					СГРУППИРОВАТЬ ПО
		|						ВТ_ПлановыеМатЗатраты.Номенклатура,
		|						ВТ_ПлановыеМатЗатраты.ХарактеристикаНоменклатуры)) КАК ЦеныНоменклатурыСрезПоследних
		|		ПО ВТ_ПлановыеМатЗатраты.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
		|			И ВТ_ПлановыеМатЗатраты.ХарактеристикаНоменклатуры = ЦеныНоменклатурыСрезПоследних.Характеристика
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ПлановыеМатЗатраты.РемонтыОборудования_ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПлановыеТрудозатраты.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		|	СУММА(ВТ_ПлановыеТрудозатраты.КоличествоОборот * ЕСТЬNULL(торо_СтоимостьЧасаКвалификацииСрезПоследних.Стоимость, 1)) КАК СтоимостьТрудозатрат
		|ПОМЕСТИТЬ ВТ_СуммаТрудозатрат
		|ИЗ
		|	ВТ_ПлановыеТрудозатраты КАК ВТ_ПлановыеТрудозатраты,
		|	РегистрСведений.торо_СтоимостьЧасаКвалификации.СрезПоследних(
		|			,
		|			Квалификация В
		|				(ВЫБРАТЬ
		|					ВТ_ПлановыеТрудозатраты.Квалификация КАК Квалификация
		|				ИЗ
		|					ВТ_ПлановыеТрудозатраты КАК ВТ_ПлановыеТрудозатраты
		|				СГРУППИРОВАТЬ ПО
		|					ВТ_ПлановыеТрудозатраты.Квалификация)) КАК торо_СтоимостьЧасаКвалификацииСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ПлановыеТрудозатраты.РемонтыОборудования_ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПлановыеТрудозатраты.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		|	ВТ_ПлановыеТрудозатраты.Квалификация КАК Квалификация
		|ПОМЕСТИТЬ ВТ_Квалификации
		|ИЗ
		|	ВТ_ПлановыеТрудозатраты КАК ВТ_ПлановыеТрудозатраты
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ПлановыеТрудозатраты.Квалификация,
		|	ВТ_ПлановыеТрудозатраты.РемонтыОборудования_ID
		|;
		|
		#КонецВставки
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_ЗаявкиПоРемонтамСрезПоследних.IDРемонта КАК IDРемонта,
		|	торо_ЗаявкиПоРемонтамСрезПоследних.Исполнитель КАК Исполнитель,
		|	торо_ЗаявкиПоРемонтамСрезПоследних.УточнениеИсполнителя КАК УточнениеИсполнителя,
		|	торо_ЗаявкиПоРемонтамСрезПоследних.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ Заявки
		|ИЗ
		|	РегистрСведений.торо_ЗаявкиПоРемонтам.СрезПоследних(
		|			,
		|			Регистратор ССЫЛКА Документ.торо_ЗаявкаНаРемонт
		|				И IDРемонта В
		|					(ВЫБРАТЬ
		|						вт_СохраненныеДанныеПлана.ID_Ремонта КАК ID_Ремонта
		|					ИЗ
		|						вт_СохраненныеДанныеПлана КАК вт_СохраненныеДанныеПлана)) КАК торо_ЗаявкиПоРемонтамСрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	IDРемонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ID КАК ID,
		|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Исполнитель КАК Исполнитель,
		|	ЛОЖЬ КАК Регламентный
		|ПОМЕСТИТЬ ПлановыеРемонты
		|ИЗ
		|	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(
		|			,
		|			ID В
		|				(ВЫБРАТЬ
		|					вт_СохраненныеДанныеПлана.ID_Ремонта КАК ID_Ремонта
		|				ИЗ
		|					вт_СохраненныеДанныеПлана КАК вт_СохраненныеДанныеПлана
		|				ГДЕ
		|					НЕ вт_СохраненныеДанныеПлана.Регламентный)) КАК торо_ПлановыеРемонтныеРаботыСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_ПлановыеМероприятияСрезПоследних.ID,
		|	торо_ПлановыеМероприятияСрезПоследних.Исполнитель,
		|	ИСТИНА
		|ИЗ
		|	РегистрСведений.торо_ПлановыеМероприятия.СрезПоследних(
		|			,
		|			ID В
		|				(ВЫБРАТЬ
		|					вт_СохраненныеДанныеПлана.ID_Ремонта КАК ID_Ремонта
		|				ИЗ
		|					вт_СохраненныеДанныеПлана КАК вт_СохраненныеДанныеПлана
		|				ГДЕ
		|					вт_СохраненныеДанныеПлана.Регламентный)) КАК торо_ПлановыеМероприятияСрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID,
		|	Регламентный
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_ОстановочныеРемонтыСрезПоследних.IDЗависимого КАК IDЗависимого
		|ПОМЕСТИТЬ Остановочный
		|ИЗ
		|	РегистрСведений.торо_ОстановочныеРемонты.СрезПоследних(
		|			,
		|			IDЗависимого В
		|				(ВЫБРАТЬ
		|					вт_СохраненныеДанныеПлана.ID_Ремонта КАК ID_Ремонта
		|				ИЗ
		|					вт_СохраненныеДанныеПлана КАК вт_СохраненныеДанныеПлана)) КАК торо_ОстановочныеРемонтыСрезПоследних
		|ГДЕ
		|	НЕ торо_ОстановочныеРемонтыСрезПоследних.Отвязан
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	IDЗависимого
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ " + ?(ГруппироватьПоИсполнителю = 0, "РАЗЛИЧНЫЕ", "") + "
		|	вт_СохраненныеДанныеПлана.ID_Ремонта КАК ID_Ремонта,
		|	вт_СохраненныеДанныеПлана.ОбъектРемонта КАК ОбъектРемонта,
		|	вт_СохраненныеДанныеПлана.ВидРемонта КАК ВидРемонта,
		|	вт_СохраненныеДанныеПлана.ДокументОснование КАК ДокументОснование,
		|	вт_СохраненныеДанныеПлана.ДатаНачала КАК ДатаНачала,
		|	вт_СохраненныеДанныеПлана.ДатаОкончания КАК ДатаОкончания,
		|	вт_СохраненныеДанныеПлана.КрайняяДатаЗавершения КАК КрайняяДатаЗавершения,
		|	вт_СохраненныеДанныеПлана.ДатаНачалаРемонтаИсходная КАК ДатаНачалаРемонтаИсходная,
		|	вт_СохраненныеДанныеПлана.ДатаОкончанияРемонтаИсходная КАК ДатаОкончанияРемонтаИсходная,
		|	вт_СохраненныеДанныеПлана.КрайняяДатаЗавершенияИсходная КАК КрайняяДатаЗавершенияИсходная,
		|	вт_СохраненныеДанныеПлана.Регламентный КАК Регламентный,
		|	вт_СохраненныеДанныеПлана.ИсточникДанных КАК ИсточникДанных,
		|	ВЫБОР
		|		КОГДА НЕ вт_СохраненныеДанныеПлана.ОРДляПолученияВладельца = ЗНАЧЕНИЕ(Справочник.торо_ОбъектыРемонта.ПустаяСсылка)
		|			ТОГДА ВЫБОР
		|					КОГДА вт_СохраненныеДанныеПлана.ОРДляПолученияВладельца.ВнешнийОбъект
		|						ТОГДА вт_СохраненныеДанныеПлана.ОРДляПолученияВладельца.Контрагент
		|					ИНАЧЕ вт_СохраненныеДанныеПлана.ОРДляПолученияВладельца.Подразделение
		|				КОНЕЦ
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.торо_ОбъектыРемонта.ПустаяСсылка)
		|	КОНЕЦ КАК ВладелецОР,
		|	ВЫБОР
		|		КОГДА Заявки.IDРемонта ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьЗаявка,
		|	ВЫБОР
		|		КОГДА Остановочный.IDЗависимого ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьОстановочный,
		|	ВЫБОР
		|		КОГДА &ГруппироватьПоИсполнителю
		|			ТОГДА ЕСТЬNULL(Заявки.Исполнитель, ЕСТЬNULL(ПлановыеРемонты.Исполнитель, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)))
		|		ИНАЧЕ NULL
		|	КОНЕЦ КАК Исполнитель,
		|	ВЫБОР
		|		КОГДА &ГруппироватьПоИсполнителю
		|			ТОГДА ЕСТЬNULL(Заявки.УточнениеИсполнителя, ЗНАЧЕНИЕ(Справочник.торо_РемонтныеБригады.ПустаяСсылка))
		|		ИНАЧЕ NULL
		|	КОНЕЦ КАК УточнениеИсполнителя,
		|	вт_СохраненныеДанныеПлана.ОРДляПолученияВладельца.Приоритет КАК КритичностьОборудования,
		|	торо_ВыявленныеДефектыСрезПоследних.КритичностьДефекта КАК КритичностьДефекта,
		|	ЕСТЬNULL(Заявки.Регистратор, ЗНАЧЕНИЕ(Документ.торо_ЗаявкаНаРемонт.ПустаяСсылка)) КАК Заявка
		|ПОМЕСТИТЬ вт_Итоговая
		|ИЗ
		|	вт_СохраненныеДанныеПлана КАК вт_СохраненныеДанныеПлана
		|		ЛЕВОЕ СОЕДИНЕНИЕ Заявки КАК Заявки
		|		ПО вт_СохраненныеДанныеПлана.ID_Ремонта = Заявки.IDРемонта
		|		ЛЕВОЕ СОЕДИНЕНИЕ Остановочный КАК Остановочный
		|		ПО вт_СохраненныеДанныеПлана.ID_Ремонта = Остановочный.IDЗависимого
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВыявленныеДефекты.СрезПоследних(
		|				,
		|				ID В
		|					(ВЫБРАТЬ
		|						вт_СохраненныеДанныеПлана.ID_Ремонта КАК ID_Ремонта
		|					ИЗ
		|						вт_СохраненныеДанныеПлана КАК вт_СохраненныеДанныеПлана)) КАК торо_ВыявленныеДефектыСрезПоследних
		|		ПО вт_СохраненныеДанныеПлана.ID_Ремонта = торо_ВыявленныеДефектыСрезПоследних.ID
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПлановыеРемонты КАК ПлановыеРемонты
		|		ПО вт_СохраненныеДанныеПлана.ID_Ремонта = ПлановыеРемонты.ID
		|			И вт_СохраненныеДанныеПлана.Регламентный = ПлановыеРемонты.Регламентный
		|ГДЕ
		|	ВЫБОР
		|		КОГДА вт_СохраненныеДанныеПлана.ИсточникДанных = ""ППР""
		|			ТОГДА &ПоказыватьРемонтыППР
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|	И ВЫБОР
		|		КОГДА вт_СохраненныеДанныеПлана.Регламентный
		|			ТОГДА &ПоказыватьРемонтыРегламентные
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|	И ВЫБОР
		|		КОГДА вт_СохраненныеДанныеПлана.ИсточникДанных = ""СПД""
		|			ТОГДА &ПоказыватьДефекты
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|	И ВЫБОР
		|		КОГДА вт_СохраненныеДанныеПлана.ИсточникДанных = ""СПВО""
		|			ТОГДА &ПоказыватьВнешниеОснования
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|	И (НЕ &ИспользоватьОтборПоВР
		|		ИЛИ вт_СохраненныеДанныеПлана.ВидРемонта В (&ВидыРемонтов))
		|	И (НЕ &ИспользоватьОтборПоОР
		|		ИЛИ вт_СохраненныеДанныеПлана.ОбъектРемонта В (&ОбъектРемонта))
		|	И (НЕ &ИспользоватьОтборПоВладельцу
		|		ИЛИ ВЫБОР
		|				КОГДА вт_СохраненныеДанныеПлана.ОРДляПолученияВладельца.ВнешнийОбъект
		|					ТОГДА вт_СохраненныеДанныеПлана.ОРДляПолученияВладельца.Контрагент В (&Владелец)
		|				ИНАЧЕ вт_СохраненныеДанныеПлана.ОРДляПолученияВладельца.Подразделение В (&Владелец)
		|			КОНЕЦ)
		|	И (НЕ &ИспользоватьОтборПоИсполнителю
		|		ИЛИ Заявки.Исполнитель В (&Исполнители) ИЛИ ПлановыеРемонты.Исполнитель В (&Исполнители))
		|	И (НЕ &ИспользоватьОтборПоУточнениюИсполнителя
		|		ИЛИ Заявки.УточнениеИсполнителя В (&УточнениеИсполнителя))
		#Вставка
		// Гкс+[TOIR20-183] Селимов
		|	И ВЫБОР
		|			КОГДА &ОтборПоКвалификации
		|				ТОГДА вт_СохраненныеДанныеПлана.ID_Ремонта В
		|						(ВЫБРАТЬ
		|							ВТ_Квалификации.РемонтыОборудования_ID КАК РемонтыОборудования_ID
		|						ИЗ
		|							ВТ_Квалификации КАК ВТ_Квалификации
		|						СГРУППИРОВАТЬ ПО
		|							ВТ_Квалификации.РемонтыОборудования_ID)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		#КонецВставки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_Ремонты.Регистратор КАК Регистратор,
		|	торо_Ремонты.ID КАК ID,
		|	торо_Ремонты.ДатаНачалаПлан КАК ДатаНачалаПлан,
		|	торо_Ремонты.ДатаОкончанияПлан КАК ДатаОкончанияПлан
		|ПОМЕСТИТЬ ВТ_РемонтыРегистраторы
		|ИЗ
		|	РегистрСведений.торо_Ремонты КАК торо_Ремонты
		|ГДЕ
		|	торо_Ремонты.ID В
		|			(ВЫБРАТЬ
		|				вт_Итоговая.ID_Ремонта КАК ID_Ремонта
		|			ИЗ
		|				вт_Итоговая КАК вт_Итоговая)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_РемонтыРегистраторы.ID КАК ID
		|ПОМЕСТИТЬ ВТ_НарядыПоРемонтам
		|ИЗ
		|	ВТ_РемонтыРегистраторы КАК ВТ_РемонтыРегистраторы
		|ГДЕ
		|	(ТИПЗНАЧЕНИЯ(ВТ_РемонтыРегистраторы.Регистратор) = ТИП(Документ.торо_НарядНаВыполнениеРемонтныхРабот)
		|			ИЛИ ТИПЗНАЧЕНИЯ(ВТ_РемонтыРегистраторы.Регистратор) = ТИП(Документ.торо_НарядНаРегламентноеМероприятие))
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_РемонтыРегистраторы.ID КАК ID
		|ПОМЕСТИТЬ ВТ_АктыПоРемонтам
		|ИЗ
		|	ВТ_РемонтыРегистраторы КАК ВТ_РемонтыРегистраторы
		|ГДЕ
		|	(ТИПЗНАЧЕНИЯ(ВТ_РемонтыРегистраторы.Регистратор) = ТИП(Документ.торо_АктОВыполненииРегламентногоМероприятия)
		|			ИЛИ ТИПЗНАЧЕНИЯ(ВТ_РемонтыРегистраторы.Регистратор) = ТИП(Документ.торо_АктОВыполненииЭтапаРабот))
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_СкользящийПланРаботСрезПоследних.ID_Ремонта КАК ID_Ремонта,
		|	ЛОЖЬ КАК Регламентный,
		|	торо_СкользящийПланРаботСрезПоследних.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ТаблицаИмеющихсяПланов
		|ИЗ
		|	РегистрСведений.торо_СкользящийПланРабот.СрезПоследних(
		|			,
		|			Регистратор = &ПланРабот
		|				И ID_Ремонта В
		|					(ВЫБРАТЬ
		|						ВТ_Итоговая.ID_Ремонта КАК ID_Ремонта
		|					ИЗ
		|						вт_Итоговая КАК ВТ_Итоговая
		|					ГДЕ
		|						НЕ ВТ_Итоговая.Регламентный)) КАК торо_СкользящийПланРаботСрезПоследних
		|ГДЕ
		|	торо_СкользящийПланРаботСрезПоследних.ВидПлана В(&ВидыПлана)
		|
		|СГРУППИРОВАТЬ ПО
		|	торо_СкользящийПланРаботСрезПоследних.ID_Ремонта,
		|	торо_СкользящийПланРаботСрезПоследних.Регистратор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_СкользящийПланРегламентныхМероприятийСрезПоследних.ID_Ремонта,
		|	ИСТИНА,
		|	торо_СкользящийПланРегламентныхМероприятийСрезПоследних.Регистратор
		|ИЗ
		|	РегистрСведений.торо_СкользящийПланРегламентныхМероприятий.СрезПоследних(
		|			,
		|			Регистратор = &ПланРабот
		|				И ID_Ремонта В
		|					(ВЫБРАТЬ
		|						ВТ_Итоговая.ID_Ремонта КАК ID_Ремонта
		|					ИЗ
		|						вт_Итоговая КАК ВТ_Итоговая
		|					ГДЕ
		|						ВТ_Итоговая.Регламентный)) КАК торо_СкользящийПланРегламентныхМероприятийСрезПоследних
		|ГДЕ
		|	торо_СкользящийПланРегламентныхМероприятийСрезПоследних.ВидПлана В(&ВидыПлана)
		|
		|СГРУППИРОВАТЬ ПО
		|	торо_СкользящийПланРегламентныхМероприятийСрезПоследних.ID_Ремонта,
		|	торо_СкользящийПланРегламентныхМероприятийСрезПоследних.ДатаНачалаРемонта,
		|	торо_СкользящийПланРегламентныхМероприятийСрезПоследних.ДатаОкончанияРемонта,
		|	торо_СкользящийПланРегламентныхМероприятийСрезПоследних.Регистратор
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID_Ремонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ОтмененныеРемонтыСрезПоследних.ID КАК ID
		|ПОМЕСТИТЬ ВТ_Отмененые
		|ИЗ
		|	РегистрСведений.торо_ОтмененныеРемонты.СрезПоследних(
		|			,
		|			ID В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					вт_Итоговая.ID_Ремонта КАК ID
		|				ИЗ
		|					вт_Итоговая КАК вт_Итоговая)) КАК торо_ОтмененныеРемонтыСрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_Итоговая.ID_Ремонта КАК ID_Ремонта,
		|	вт_Итоговая.ОбъектРемонта КАК ОбъектРемонта,
		|	вт_Итоговая.ВидРемонта КАК ВидРемонта,
		|	вт_Итоговая.ДокументОснование КАК ДокументОснование,
		|	вт_Итоговая.ДатаНачала КАК ДатаНачала,
		|	вт_Итоговая.ДатаОкончания КАК ДатаОкончания,
		|	вт_Итоговая.КрайняяДатаЗавершения КАК КрайняяДатаЗавершения,
		|	вт_Итоговая.ДатаНачалаРемонтаИсходная КАК ДатаНачалаИсходная,
		|	вт_Итоговая.ДатаОкончанияРемонтаИсходная КАК ДатаОкончанияИсходная,
		|	вт_Итоговая.КрайняяДатаЗавершенияИсходная КАК КрайняяДатаЗавершенияИсходная,
		|	вт_Итоговая.Регламентный КАК Регламентный,
		|	вт_Итоговая.ИсточникДанных КАК ИсточникДанных,
		|	вт_Итоговая.ВладелецОР КАК ВладелецОР,
		|	вт_Итоговая.ЕстьЗаявка КАК ЕстьЗаявка,
		|	ВЫБОР
		|		КОГДА ВТ_НарядыПоРемонтам.ID ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьНаряд,
		|	ВЫБОР
		|		КОГДА ВТ_АктыПоРемонтам.ID ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьАкт,
		|	вт_Итоговая.ЕстьОстановочный КАК ЕстьОстановочный,
		|	ВЫБОР
		|		КОГДА &ГруппироватьПоИсполнителю
		|			ТОГДА 
		|				ВЫБОР
		|					КОГДА вт_Итоговая.Исполнитель = НЕОПРЕДЕЛЕНО
		|						ТОГДА ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|					ИНАЧЕ вт_Итоговая.Исполнитель
		|				КОНЕЦ
		|		ИНАЧЕ NULL
		|	КОНЕЦ КАК Исполнитель,
		|	ВЫБОР
		|		КОГДА &ГруппироватьПоИсполнителю
		|			ТОГДА
		|				ВЫБОР
		|					КОГДА вт_Итоговая.УточнениеИсполнителя = НЕОПРЕДЕЛЕНО
		|						ТОГДА ЗНАЧЕНИЕ(Справочник.торо_РемонтныеБригады.ПустаяСсылка)
		|					ИНАЧЕ вт_Итоговая.УточнениеИсполнителя
		|				КОНЕЦ
		|		ИНАЧЕ NULL
		|	КОНЕЦ КАК УточнениеИсполнителя,
		|	вт_Итоговая.КритичностьОборудования КАК КритичностьОборудования,
		|	вт_Итоговая.КритичностьДефекта КАК КритичностьДефекта,
		|	вт_Итоговая.Заявка КАК Заявка,
		|	ЕСТЬNULL(ТаблицаИмеющихсяПланов.Регистратор, ЗНАЧЕНИЕ(Документ.торо_ПланРаботПодразделения.ПустаяСсылка)) КАК ПланПодразделения,
		|	ВЫБОР
		|		КОГДА ВТ_Отмененые.ID ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Отменен,
		#Вставка
		// Гкс+[TOIR20-184] Селимов
		|	ЕСТЬNULL(ВТ_СуммаМатЗатрат.Сумма, 0) + ЕСТЬNULL(ВТ_СуммаТрудозатрат.СтоимостьТрудозатрат, 0) КАК Стоимость,
		#КонецВставки 
		|	ЛОЖЬ КАК НезапланированныйРемонт
		|ИЗ
		|	вт_Итоговая КАК вт_Итоговая
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НарядыПоРемонтам КАК ВТ_НарядыПоРемонтам
		|		ПО вт_Итоговая.ID_Ремонта = ВТ_НарядыПоРемонтам.ID
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АктыПоРемонтам КАК ВТ_АктыПоРемонтам
		|		ПО вт_Итоговая.ID_Ремонта = ВТ_АктыПоРемонтам.ID
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаИмеющихсяПланов КАК ТаблицаИмеющихсяПланов
		|		ПО вт_Итоговая.ID_Ремонта = ТаблицаИмеющихсяПланов.ID_Ремонта
		|			И вт_Итоговая.Регламентный = ТаблицаИмеющихсяПланов.Регламентный
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Отмененые КАК ВТ_Отмененые
		|		ПО вт_Итоговая.ID_Ремонта = ВТ_Отмененые.ID
		#Вставка
		// Гкс+[TOIR20-184] Селимов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммаМатЗатрат КАК ВТ_СуммаМатЗатрат
		|		ПО вт_Итоговая.ID_Ремонта = ВТ_СуммаМатЗатрат.РемонтыОборудования_ID
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммаТрудозатрат КАК ВТ_СуммаТрудозатрат
		|		ПО вт_Итоговая.ID_Ремонта = ВТ_СуммаТрудозатрат.РемонтыОборудования_ID
		#КонецВставки 
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВЫБОР
		|		КОГДА &ПоВидам
		|			ТОГДА вт_Итоговая.ВидРемонта.Наименование
		|		ИНАЧЕ вт_Итоговая.ОбъектРемонта.Наименование
		|	КОНЕЦ,
		|	вт_Итоговая.ДатаНачала"; 
		#КонецОбласти 
	КонецЕсли; 

	ПервыйУровеньИтоги = "";
	ПервыйУровеньГруппировка = "";
	ВторойУровеньГруппировка = "";

	// Итоги первого уровня
	Если ВерхнийУровень = "1" Тогда 
		ПервыйУровеньГруппировка = "Исполнитель";
	ИначеЕсли ВерхнийУровень = "2" Тогда
		ПервыйУровеньИтоги = "МАКСИМУМ(Исполнитель)";
		ПервыйУровеньГруппировка = "УточнениеИсполнителя";
	ИначеЕсли ВерхнийУровень = "3" Тогда 
		ПервыйУровеньГруппировка = "УточнениеИсполнителя";
	Иначе
		ПервыйУровеньГруппировка = "ВладелецОР";
	КонецЕсли; 

	Если НижнийУровень = "1" Тогда
		ВторойУровеньГруппировка = "ОбъектРемонта";
	Иначе
		ВторойУровеньГруппировка = "ВидРемонта";		
	КонецЕсли; 

	ТекстИтогов = "ИТОГИ";

	Если НЕ ПервыйУровеньИтоги = "" Тогда
		ТекстИтогов = ТекстИтогов + Символы.ПС + ПервыйУровеньИтоги;
	КонецЕсли;

	ТекстИтогов = ТекстИтогов + Символы.ПС + "ПО" + Символы.ПС + ПервыйУровеньГруппировка;
	ТекстИтогов = ТекстИтогов + Символы.ПС + "," + Символы.ПС + ВторойУровеньГруппировка;

	Запрос.Текст = Запрос.Текст + Символы.ПС + ТекстИтогов;

	УстановитьПараметрыЗапросаДляЗаполнения(Запрос);

	РезультатЗапроса = Запрос.Выполнить();

	ПостроитьДиаграммуГантаДляППР(ДиаграммаГантаПодразделения, СтруктураДанныхПервогоУровня, СтруктураДанныхВторогоУровня, РезультатЗапроса);

	ДиаграммаГантаПодразделения.УстановитьПолныйИнтервал(ДатаОтсчета, ДатаОкончания);
	ДиаграммаГантаПодразделения.ОтображатьЛегенду = Ложь; 

	ВывестиРезультатЗапросаВДеревоФормы(РезультатЗапроса, СтруктураДанныхПервогоУровня, СтруктураДанныхВторогоУровня, СтруктураДанныхУровеньДанные);

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("УстановитьПараметрыЗапросаДляЗаполнения")
Процедура гкс_УстановитьПараметрыЗапросаДляЗаполнения(Запрос)

	Исполнители = ПодразделениеИсполнитель.ВыгрузитьЗначения();

	Для каждого ЭлементСписка Из Контрагент Цикл
		Исполнители.Добавить(ЭлементСписка.Значение);
	КонецЦикла; 

	МассивУточнениеИсполнителя = Бригада.ВыгрузитьЗначения();

	Для каждого ЭлементСписка Из ДоговорКонтрагента Цикл
		МассивУточнениеИсполнителя.Добавить(ЭлементСписка.Значение);
	КонецЦикла; 

	ВидыПлана = Новый Массив;

	Если ВидПлана = Справочники.торо_ВидыСкользящихПланов.Долгосрочный Тогда

		ВидыПлана.Добавить(Справочники.торо_ВидыСкользящихПланов.Оперативный);
		ВидыПлана.Добавить(Справочники.торо_ВидыСкользящихПланов.Среднесрочный);
		ВидыПлана.Добавить(Справочники.торо_ВидыСкользящихПланов.Годовой);
		ВидыПлана.Добавить(Справочники.торо_ВидыСкользящихПланов.Долгосрочный);

	ИначеЕсли ВидПлана = Справочники.торо_ВидыСкользящихПланов.Годовой Тогда

		ВидыПлана.Добавить(Справочники.торо_ВидыСкользящихПланов.Оперативный);
		ВидыПлана.Добавить(Справочники.торо_ВидыСкользящихПланов.Среднесрочный);
		ВидыПлана.Добавить(Справочники.торо_ВидыСкользящихПланов.Годовой);

	ИначеЕсли ВидПлана = Справочники.торо_ВидыСкользящихПланов.Среднесрочный Тогда

		ВидыПлана.Добавить(Справочники.торо_ВидыСкользящихПланов.Оперативный);
		ВидыПлана.Добавить(Справочники.торо_ВидыСкользящихПланов.Среднесрочный);

	ИначеЕсли ВидПлана = Справочники.торо_ВидыСкользящихПланов.Оперативный Тогда

		ВидыПлана.Добавить(Справочники.торо_ВидыСкользящихПланов.Оперативный);

	ИначеЕсли ВидПлана = Справочники.торо_ВидыСкользящихПланов.Стратегический Тогда 

		ВидыПлана.Добавить(Справочники.торо_ВидыСкользящихПланов.Оперативный);
		ВидыПлана.Добавить(Справочники.торо_ВидыСкользящихПланов.Среднесрочный);
		ВидыПлана.Добавить(Справочники.торо_ВидыСкользящихПланов.Годовой);
		ВидыПлана.Добавить(Справочники.торо_ВидыСкользящихПланов.Стратегический);
		ВидыПлана.Добавить(Справочники.торо_ВидыСкользящихПланов.Долгосрочный);

	КонецЕсли; 

	Запрос.УстановитьПараметр("ВидыРемонтов", ВидыРемонтов.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("Владелец", ВладелецОР.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("Исполнители", Исполнители);
	Запрос.УстановитьПараметр("ИспользоватьОтборПоВладельцу", ВладелецОР.Количество()   > 0);
	Запрос.УстановитьПараметр("ИспользоватьОтборПоВР", ВидыРемонтов.Количество() > 0);
	Запрос.УстановитьПараметр("ИспользоватьОтборПоИсполнителю", Исполнители.Количество()  > 0);
	Запрос.УстановитьПараметр("ИспользоватьОтборПоОР", ОбъектРемонта.Количество()> 0);
	Запрос.УстановитьПараметр("НачалоПериода", ДатаОтсчета);
	Запрос.УстановитьПараметр("ОбъектРемонта", ОбъектРемонта.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("ОкончаниеПериода", ДатаОкончания);
	Запрос.УстановитьПараметр("ПоказыватьВнешниеОснования", ПоказыватьВнешниеОснования);
	Запрос.УстановитьПараметр("ПоказыватьДефекты", ПоказыватьДефекты);
	Запрос.УстановитьПараметр("ПоказыватьРемонтыППР", ПоказыватьРемонтыППР);
	Запрос.УстановитьПараметр("ПоказыватьРемонтыРегламентные", ПоказыватьРемонтыРегламентные);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПланРабот", ПланРабот);
	Запрос.УстановитьПараметр("ПоВидам", НижнийУровень = "2");
    #Вставка
	// Гкс+[TOIR20-183] Селимов
	Запрос.УстановитьПараметр("ОтборПоКвалификации", ЗначениеЗаполнено(ЭтаФорма["ОтборКвалификация"]));
	Запрос.УстановитьПараметр("Квалификация", ЭтаФорма["ОтборКвалификация"]); 
	#КонецВставки 
	
	Запрос.УстановитьПараметр("ИспользоватьОтборПоВсемОрганизациям",Не ЗначениеЗаполнено(Организация));
	Запрос.УстановитьПараметр("ИспользоватьОтборПоУточнениюИсполнителя", МассивУточнениеИсполнителя.Количество() > 0);
	Запрос.УстановитьПараметр("УточнениеИсполнителя", МассивУточнениеИсполнителя);
	Запрос.УстановитьПараметр("ГруппироватьПоИсполнителю", ГруппироватьПоИсполнителю = 1);

	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("ДатаОтсчета", ДатаОтсчета);

	Запрос.УстановитьПараметр("ВидыПлана", ВидыПлана);
	Запрос.УстановитьПараметр("ВидПлана", ВидПлана);
	#Вставка
	// Гкс+[TOIR20-191] Селимов 
	ОтборПоОстановочномуРемонту = ЗначениеЗаполнено(ЭтаФорма["гкс_ОстановочныйРемонт"]);
	Если ОтборПоОстановочномуРемонту Тогда
		ИДРемонтовОстановочных = ПолучитьИДРемонтовОстановочных(ЭтаФорма["гкс_ОстановочныйРемонт"]);	
	КонецЕсли; 
	Запрос.УстановитьПараметр("ОтборПоОстановочномуРемонту", ОтборПоОстановочномуРемонту);
	Запрос.УстановитьПараметр("ИДРемонтовОстановочных", ИДРемонтовОстановочных);  
	#КонецВставки  	
	
КонецПроцедуры

// Гкс+[TOIR20-173] Селимов	
&НаСервере
Функция гкс_ДеревоРемонтыПриАктивизацииСтрокиНаСервере(ИДРемонтов)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПлановыеТрудозатраты.Квалификация КАК Квалификация,
		|	СУММА(ВЫБОР
		|			КОГДА ПлановыеТрудозатраты.КоличествоОборот = 0
		|				ТОГДА 1
		|			ИНАЧЕ ПлановыеТрудозатраты.КоличествоОборот
		|		КОНЕЦ * ВЫБОР
		|			КОГДА ПлановыеТрудозатраты.ВремяРаботыОборот = 0
		|				ТОГДА 1
		|			ИНАЧЕ ПлановыеТрудозатраты.ВремяРаботыОборот
		|		КОНЕЦ) КАК Требуется
		|ИЗ
		|	РегистрНакопления.торо_ПлановыеТрудовыеЗатратыРемонтныхРабот.Обороты КАК ПлановыеТрудозатраты
		|ГДЕ
		|	ПлановыеТрудозатраты.РемонтыОборудования_ID В (&РемонтыОборудования_ID)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПлановыеТрудозатраты.Квалификация";
	
	Запрос.УстановитьПараметр("РемонтыОборудования_ID", ИДРемонтов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ТребуемыеТрудовыеЗатраты = Новый Массив;
	Пока Выборка.Следующий() Цикл
		ТребуемыеТрудовыеЗатраты.Добавить(Новый Структура("Квалификация, Требуется", 
															Выборка.Квалификация, Выборка.Требуется));
	КонецЦикла; 
	
	Возврат ТребуемыеТрудовыеЗатраты;
	
КонецФункции 

&НаСервере
&ИзменениеИКонтроль("ВставитьИнтервал")
Процедура гкс_ВставитьИнтервал(Диаграмма, Выборка, ТочкаОРР, ТочкаВРР, ДетЗаписи, СерияРемонт, ТекДата)

	ЦветВыполненогоППР 						= WebЦвета.Синий;
	ЦветЗапланированногоППР 				= WebЦвета.Васильковый;	

	ЦветВыполненогоМероприятия 				= WebЦвета.ТемноЗеленый;
	ЦветЗапланированногоМероприятия			= WebЦвета.ЖелтоЗеленый;	

	ЦветВыполненогоСметыПоДефектам 			= WebЦвета.Красный;
	ЦветЗапланированногоСметыПоДефектам 	= WebЦвета.Кирпичный;

	ЦветВыполненогоСметыПоПредписаниям		= WebЦвета.Желтый;
	ЦветЗапланированногоСметыПоПредписаниям	= WebЦвета.Оранжевый; 	

	ЦветВыполненого				= WebЦвета.Синий;	
	ЦветИзмененного 			= WebЦвета.Томатный;
	ЦветОтмененного 			= WebЦвета.Красный;
	ЦветЗапланированного 		= WebЦвета.Васильковый;
	ЦветЗамещенногоИсходного 	= WebЦвета.СеребристоСерый;
	ЦветИсходного 				= WebЦвета.ГолубойСоСтальнымОттенком;
	ЦветЗамещенного 			= WebЦвета.СветлоСерый;


	ЦветИнтервала = ЦветЗапланированного;
	ТекДата = ТекущаяДата();

	Если Выборка.НезапланированныйРемонт Тогда
		ЦветИнтервала = WebЦвета.ТемноСерый;
	ИначеЕсли Выборка.ИсточникДанных = "ППР" Тогда
		ЦветИнтервала = ?(КонецДня(Выборка.ДатаОкончания) < ТекДата, ЦветВыполненогоППР,  ЦветЗапланированногоППР);	
	ИначеЕсли Выборка.ИсточникДанных = "РМ" Тогда
		ЦветИнтервала = ?(КонецДня(Выборка.ДатаОкончания) < ТекДата, ЦветВыполненогоМероприятия,  ЦветЗапланированногоМероприятия);	
	ИначеЕсли Выборка.ИсточникДанных = "СПД" Тогда
		ЦветИнтервала = ?(Выборка.ДатаОкончания < ТекДата, ЦветВыполненогоСметыПоДефектам,  ЦветЗапланированногоСметыПоДефектам);
	ИначеЕсли Выборка.ИсточникДанных = "СПВО" Тогда
		ЦветИнтервала = ?(Выборка.ДатаОкончания < ТекДата, ЦветВыполненогоСметыПоПредписаниям,  ЦветЗапланированногоСметыПоПредписаниям);
	КонецЕсли;

	Значение = Диаграмма.ПолучитьЗначение(ТочкаОРР, СерияРемонт);
	#Удаление
	Значение.Редактирование = Ложь;
	#КонецУдаления 
	#Вставка
	// Гкс+[TOIR20-185] Селимов 
	Значение.Редактирование = Истина; 	 
	#КонецВставки 

	Интервал = Значение.Добавить();
	Интервал.Начало = Выборка.ДатаНачала;
	Интервал.Конец = ?(Выборка.ДатаОкончания > Выборка.ДатаНачала, Выборка.ДатаОкончания, Выборка.ДатаНачала + 3600);

	Если Выборка.ИсточникДанных <> "СПВО" И Выборка.ИсточникДанных <> "СПД" Тогда
		Интервал.Конец = КонецДня(Интервал.Конец);
	КонецЕсли;

	Интервал.Цвет   = ЦветИнтервала;	
	Интервал.Текст  = Строка(Интервал.Начало) + " - " + Строка(Интервал.Конец); 
	#Вставка
	Интервал.Расшифровка = Выборка.ID_Ремонта;
	#КонецВставки 

	Значение = Диаграмма.ПолучитьЗначение(ТочкаВРР, СерияРемонт);
	#Удаление
	Значение.Редактирование = Ложь;
	#КонецУдаления 
	#Вставка
	// Гкс+[TOIR20-185] Селимов
	Значение.Редактирование = Истина; 	
	#КонецВставки 

	Интервал = Значение.Добавить();
	Интервал.Начало = Выборка.ДатаНачала;
	Интервал.Конец  = ?(Выборка.ДатаОкончания > Выборка.ДатаНачала, Выборка.ДатаОкончания, Выборка.ДатаНачала + 3600);

	Если Выборка.ИсточникДанных <> "СПВО" И Выборка.ИсточникДанных <> "СПД" Тогда
		Интервал.Конец = КонецДня(Интервал.Конец);
	КонецЕсли;

	Интервал.Цвет   = ЦветИнтервала;		
	Интервал.Текст  = Строка(Интервал.Начало) + " - " + Строка(Интервал.Конец); 
	#Вставка
	// Гкс+[TOIR20-185] Селимов
	Интервал.Расшифровка = Выборка.ID_Ремонта; 
	#КонецВставки 

	Значение = Диаграмма.ПолучитьЗначение(ДетЗаписи, СерияРемонт);
	#Удаление
	Значение.Редактирование = Ложь;
	#КонецУдаления 
	#Вставка
	// Гкс+[TOIR20-185] Селимов
	Значение.Редактирование = Истина;  
	#КонецВставки 

	Интервал = Значение.Добавить();
	Интервал.Начало = Выборка.ДатаНачала;
	Интервал.Конец  = ?(Выборка.ДатаОкончания > Выборка.ДатаНачала, Выборка.ДатаОкончания, Выборка.ДатаНачала + 3600);

	Если Выборка.ИсточникДанных <> "СПВО" И Выборка.ИсточникДанных <> "СПД" Тогда
		Интервал.Конец = КонецДня(Интервал.Конец);
	КонецЕсли;

	Интервал.Цвет   = ЦветИнтервала;		
	Интервал.Текст  = Строка(Интервал.Начало) + " - " + Строка(Интервал.Конец); 					
	Интервал.Расшифровка = Выборка.ID_Ремонта;

КонецПроцедуры

// Гкс+[TOIR20-185] Селимов
&НаКлиенте
Процедура гкс_ДиаграммаГантаПодразделенияПриОкончанииРедактированияИнтервалаВместо(Элемент, Интервал, ОтменаРедактирования)
	
	Если Интервал.Значение.Точка.Родитель = Неопределено 
		Или Интервал.Значение.Точка.Родитель.Родитель = Неопределено Тогда
		ОтменаРедактирования = Истина;
		Возврат;
	КонецЕсли; 
	
	ДанныеИнтервала = Новый Структура;
	ДанныеИнтервала.Вставить("Расшифровка", Интервал.Расшифровка);
	ДанныеИнтервала.Вставить("ДатаНачала", Интервал.Начало);
	ДанныеИнтервала.Вставить("ДатаОкончания", Интервал.Конец);
	
	гкс_ПриИзмененииИнтервалаНаСервере(ДанныеИнтервала, ОтменаРедактирования);	
	
	Если Не ОтменаРедактирования Тогда
		УстановитьПериодУИнтервалаРодителя(Интервал);		
	КонецЕсли; 
	
КонецПроцедуры 

// Гкс+[TOIR20-185] Селимов
&НаСервере
Процедура гкс_ПриИзмененииИнтервалаНаСервере(Интервал, ОтменаРедактирования)
	
	ТаблицаРемонтов = ДанныеФормыВЗначение(ДеревоРемонты, Тип("ДеревоЗначений"));
	// Строка которая соответствует текущему интервалу в диаграмме ганта
	СтрокаТаблицыРемонтов = ТаблицаРемонтов.Строки.Найти(Интервал.Расшифровка, "ID_Ремонта", Истина);
	Если СтрокаТаблицыРемонтов <> Неопределено Тогда
		
		#Область ОтборВУсловномОформленииПоТаблицеРемонтов
		Если (Не СтрокаТаблицыРемонтов.ОтображатьДанные)
			ИЛИ СтрокаТаблицыРемонтов.ЕстьОстановочный
			ИЛИ СтрокаТаблицыРемонтов.ЕстьАкт 
			ИЛИ СтрокаТаблицыРемонтов.ЕстьНаряд
			ИЛИ (ЗначениеЗаполнено(СтрокаТаблицыРемонтов.ПланПодразделения)
				И СтрокаТаблицыРемонтов.ПланПодразделения <> ПланРабот) Тогда
				// Только просмотр
			ОтменаРедактирования = Истина;
			Возврат;
		КонецЕсли; 
		#КонецОбласти 
		
		ИнтервалВСтрокеТаблицыРемонтов = СтрокаТаблицыРемонтов.ДатаОкончания - СтрокаТаблицыРемонтов.ДатаНачала;  
		ИнтервалВДиаграммеГанта = Интервал.ДатаОкончания - Интервал.ДатаНачала;
		Если ИнтервалВСтрокеТаблицыРемонтов <> ИнтервалВДиаграммеГанта Тогда
			ОтменаРедактирования = Истина;
			ТекстСообщения = нСтр("ru='Изменять длительность ремонта запрещено'", "ru"); 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли; 	
				
		СтрокаТаблицыРемонтов.ДатаНачала = Интервал.ДатаНачала;
		СтрокаТаблицыРемонтов.ДатаОкончания = Интервал.ДатаОкончания;
		
		ЗначениеВДанныеФормы(ТаблицаРемонтов, ДеревоРемонты);
	КонецЕсли; 	   
	
КонецПроцедуры 

&НаСервере
&ИзменениеИКонтроль("ПостроитьДиаграммуГантаДляППР")
Процедура гкс_ПостроитьДиаграммуГантаДляППР(Диаграмма, СтруктураДанныхПервогоУровня, СтруктураДанныхВторогоУровня, РезультатЗапроса)

	//////////////////////////////////////////////////////
	ТекДата = ТекущаяДата();

	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Булево"));

	//ОписаниеТ = новый ОписаниеТипов(МассивТипов);

	Диаграмма.Очистить();
	Диаграмма.АвтоОпределениеПолногоИнтервала = Ложь;

	СерияРемонт = Диаграмма.Серии.Добавить();
	СерияРемонт.Текст = "График ремонта";

	ВыборкаПервыйУровень = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаПервыйУровень.Следующий() Цикл

		ЗаголовокТочки = "";

		Если СтруктураДанныхПервогоУровня.ОтображатьВладелец Тогда
			Если ЗначениеЗаполнено(ВыборкаПервыйУровень.ВладелецОР) Тогда
				ЗаголовокТочки = ВыборкаПервыйУровень.ВладелецОР;
			Иначе
				ЗаголовокТочки = "<Владелец ОР не указан>";
			КонецЕсли;

		ИначеЕсли СтруктураДанныхПервогоУровня.ОтображатьИсполнитель Тогда

			Если ЗначениеЗаполнено(ВыборкаПервыйУровень.Исполнитель) Тогда
				ЗаголовокТочки = Строка(ВыборкаПервыйУровень.Исполнитель);
			Иначе
				Если ТипЗнч(ВыборкаПервыйУровень.Исполнитель) = Тип("СправочникСсылка.СтруктураПредприятия") Тогда
					ЗаголовокТочки = "<Подразделение-исполнитель не указано>";
				Иначе
					ЗаголовокТочки = "<Контрагент-исполнитель не указан>";
				КонецЕсли; 
			КонецЕсли; 

			Если СтруктураДанныхПервогоУровня.ОтображатьУточнениеИсполнителя Тогда

				Если ЗначениеЗаполнено(ВыборкаПервыйУровень.УточнениеИсполнителя) Тогда
					ЗаголовокТочки = ЗаголовокТочки + "/" + Строка(ВыборкаПервыйУровень.УточнениеИсполнителя);
				Иначе
					Если ТипЗнч(ВыборкаПервыйУровень.УточнениеИсполнителя) = Тип("СправочникСсылка.торо_РемонтныеБригады") Тогда
						ЗаголовокТочки = ЗаголовокТочки + "/" +"<Ремонтная бригада не указана>";
					Иначе
						ЗаголовокТочки = ЗаголовокТочки + "/" +"<Договор контрагента не указан>";
					КонецЕсли; 
				КонецЕсли; 

			КонецЕсли;

		ИначеЕсли СтруктураДанныхПервогоУровня.ОтображатьУточнениеИсполнителя Тогда 
			Если ТипЗнч(ВыборкаПервыйУровень.УточнениеИсполнителя) = Тип("СправочникСсылка.торо_РемонтныеБригады") Тогда
				ЗаголовокТочки = "<Ремонтная бригада не указана>";
			Иначе
				ЗаголовокТочки = "<Договор контрагента не указан>";
			КонецЕсли;
		КонецЕсли; 

		ТочкаПервыйУровень = Диаграмма.Точки.Добавить();
		ТочкаПервыйУровень.Текст = ЗаголовокТочки;
		#Вставка
		// Гкс+[TOIR20-185] Селимов
		ТочкаПервыйУровень.Значение = ТочкаПервыйУровень.Текст; 
		#КонецВставки 

		ВыборкаВторойУровень = ВыборкаПервыйУровень.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

		Пока ВыборкаВторойУровень.Следующий() Цикл

			ТочкаВторойУровень = ТочкаПервыйУровень.Точки.Добавить();

			Если СтруктураДанныхВторогоУровня.ОтображатьВидРемонта Тогда
				ТочкаВторойУровень.Текст = ВыборкаВторойУровень.ВидРемонта;
			Иначе
				ТочкаВторойУровень.Текст = ВыборкаВторойУровень.ОбъектРемонта;		
			КонецЕсли; 

			ВыборкаДанные = ВыборкаВторойУровень.Выбрать();

			СоответствиеТочек = Новый Соответствие;

			Пока ВыборкаДанные.Следующий() Цикл

				Если СтруктураДанныхВторогоУровня.ОтображатьВидРемонта Тогда //если на втором уровне виды ремонта, значит на 3 объекты

					Если СоответствиеТочек.Получить(ВыборкаДанные.ОбъектРемонта) = Неопределено Тогда
						ДетальныеЗаписи = ТочкаВторойУровень.Точки.Добавить();
						СоответствиеТочек.Вставить(ВыборкаДанные.ОбъектРемонта, ТочкаВторойУровень.Точки.Индекс(ДетальныеЗаписи));
					Иначе
						ДетальныеЗаписи = ТочкаВторойУровень.Точки.Получить(СоответствиеТочек.Получить(ВыборкаДанные.ОбъектРемонта));
					КонецЕсли; 

					Текст = ВыборкаДанные.ОбъектРемонта;

				Иначе
					Если СоответствиеТочек.Получить(ВыборкаДанные.ВидРемонта) = Неопределено Тогда
						ДетальныеЗаписи = ТочкаВторойУровень.Точки.Добавить();
						СоответствиеТочек.Вставить(ВыборкаДанные.ВидРемонта, ТочкаВторойУровень.Точки.Индекс(ДетальныеЗаписи));
					Иначе
						ДетальныеЗаписи = ТочкаВторойУровень.Точки.Получить(СоответствиеТочек.Получить(ВыборкаДанные.ВидРемонта));
					КонецЕсли; 

					Текст = ВыборкаДанные.ВидРемонта;		

				КонецЕсли;

				ДетальныеЗаписи.Текст = Текст;

				ВставитьИнтервал(Диаграмма, ВыборкаДанные,ТочкаПервыйУровень, ТочкаВторойУровень, ДетальныеЗаписи, СерияРемонт, ТекДата);

			КонецЦикла; 

		КонецЦикла; 
	КонецЦикла; 
КонецПроцедуры

// Гкс+[TOIR20-185] Селимов
&НаКлиенте
Процедура УстановитьИнтервалыВДиаграмме(ТекущиеДанные, ПроверитьПериод = Ложь)
	
	ТочкиДиаграммы = НайтиНужнуюТочкуДиаграммыГанта(Строка(ТекущиеДанные.ОбъектРемонта));
	
	Для каждого Точка Из ТочкиДиаграммы Цикл
		ЗначениеДиаграммы = ДиаграммаГантаПодразделения.ПолучитьЗначение(Точка, ДиаграммаГантаПодразделения.Серии[0]);
		
		Для каждого Интервал Из ЗначениеДиаграммы Цикл
			
			Если Интервал.Расшифровка = ТекущиеДанные.ID_Ремонта Тогда
				
				Если Не ПроверитьПериод Тогда
					ПроверитьУстановтьПериодВСтрокеТаблицы(ТекущиеДанные, Интервал);
					ПроверитьПериод = Истина;
				КонецЕсли; 
				
				Интервал.Начало = ТекущиеДанные.ДатаНачала;
				Интервал.Конец = ТекущиеДанные.ДатаОкончания;
				Интервал.Текст = Строка(Интервал.Начало) + " - " + Строка(Интервал.Конец);
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры  

// Процедура ПроверитьУстановтьПериодВСтрокеТаблицы
//
// Описание: При изменении дат планирования, количество дней ремонта не должно изменятся
//
//
// Гкс+[TOIR20-185] Селимов 
&НаКлиенте
Процедура ПроверитьУстановтьПериодВСтрокеТаблицы(ТекущиеДанные, Интервал)
	ИнтервалВСтрокеТаблицыРемонтов = ТекущиеДанные.ДатаОкончания - ТекущиеДанные.ДатаНачала;  
	ИнтервалВДиаграммеГанта = Интервал.Конец - Интервал.Начало;
	Если ИнтервалВСтрокеТаблицыРемонтов <> ИнтервалВДиаграммеГанта Тогда
		Если ТекущиеДанные.ДатаНачала = Интервал.Начало Тогда 
			// Изменили дату окончания нужно изменить дату начала
			ТекущиеДанные.ДатаНачала = ТекущиеДанные.ДатаОкончания - ИнтервалВДиаграммеГанта;
		ИначеЕсли ТекущиеДанные.ДатаОкончания = Интервал.Конец Тогда 
			// Изменили дату начала нужно изменить дату окончания
			ТекущиеДанные.ДатаОкончания = ТекущиеДанные.ДатаНачала + ИнтервалВДиаграммеГанта;
		КонецЕсли; 	
	КонецЕсли; 	
КонецПроцедуры           

// Гкс+[TOIR20-185] Селимов 
&НаКлиенте
Функция НайтиНужнуюТочкуДиаграммыГанта(ОР)
	
	ТочкаОР = Неопределено;
	МассивТочек = Новый Массив;
	
	ТочкаОР = НайтиТочку(ОР, ДиаграммаГантаПодразделения.Точки, массивТочек);
	
	Если ТочкаОР = Неопределено тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Возврат массивТочек;
	
КонецФункции  

// Гкс+[TOIR20-185] Селимов
&НаКлиенте
Функция НайтиТочку(Искомое, Точки, МассивТочек)
	
	Для каждого ТекущаяТочка из Точки Цикл
		Если ТекущаяТочка.Текст = Искомое Тогда
			МассивТочек.Добавить(ТекущаяТочка);
			Возврат ТекущаяТочка;
		Иначе
			Результат = НайтиТочку(Искомое, ТекущаяТочка.Точки, МассивТочек);
			Если Результат <> Неопределено Тогда
				МассивТочек.Добавить(ТекущаяТочка);
				Возврат Результат
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции  

// Гкс+[TOIR20-185] Селимов
&НаКлиенте
Процедура УстановитьПериодУИнтервалаРодителя(ТекущийИнтервал)
	
	ТочкиДиаграммы = НайтиНужнуюТочкуДиаграммыГанта(ТекущийИнтервал.Значение.Точка.Текст);
	Для каждого Точка Из ТочкиДиаграммы Цикл
		ЗначениеДиаграммы = ДиаграммаГантаПодразделения.ПолучитьЗначение(Точка, ДиаграммаГантаПодразделения.Серии[0]);
		Для каждого Интервал Из ЗначениеДиаграммы Цикл
			
			Если Интервал.Расшифровка = ТекущийИнтервал.Расшифровка Тогда
				Интервал.Начало = ТекущийИнтервал.Начало;
				Интервал.Конец = ТекущийИнтервал.Конец;
				Интервал.Текст = ТекущийИнтервал.Текст;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;   
	
КонецПроцедуры  

// Гкс+[TOIR20-186] Селимов
&НаСервереБезКонтекста
Процедура ЗаполнитьОстановочныйРемонтНаСервере(ДанныеФормы, Заявка)
	ОстановочныйРемонт = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект.торо_ОстановочныеРемонты")); 
	ОстановочныйРемонт.Заполнить(Заявка);
	ЗначениеВДанныеФормы(ОстановочныйРемонт,ДанныеФормы); 
КонецПроцедуры 

// Гкс+[TOIR20-189] Селимов
&НаКлиенте 
Процедура ОбновитьЗаголовокКнопкиОстановочныйРемонт()
	
	ОстановочныйРемонт = ЭтаФорма["гкс_ОстановочныйРемонт"];
	Элементы["КомандаВыбратьОстановочныйРемонт"].Заголовок = ?(ЗначениеЗаполнено(ОстановочныйРемонт), 
											"   " + Строка(ОстановочныйРемонт), 
											НСтр("es='Escoger el Las reparaciones de parada';"
												"ru='" + "   " + "Выбрать остановочный ремонт';en='Choose a Stop repairs'"));
	
КонецПроцедуры  

// Гкс+[TOIR20-189] Селимов
&НаСервере
Функция ПолучитьИДРемонтовОстановочных(ОстановочныйРемонт)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ОстановочныеРемонтыСвязанныеРемонты.ID КАК ID
		|ИЗ
		|	Документ.торо_ОстановочныеРемонты.СвязанныеРемонты КАК торо_ОстановочныеРемонтыСвязанныеРемонты
		|ГДЕ
		|	торо_ОстановочныеРемонтыСвязанныеРемонты.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	торо_ОстановочныеРемонтыСвязанныеРемонты.ID";
	
	Запрос.УстановитьПараметр("Ссылка", ОстановочныйРемонт);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ИДРемонтов = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ИДРемонтов.Добавить(ВыборкаДетальныеЗаписи.ID);	
	КонецЦикла;
	
	Возврат ИДРемонтов;
	
КонецФункции 

#КонецОбласти

ОчищаемыеСтрокиТрудовыхРесурсов = Новый Массив;
