
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаголовокРедактируемогоЭлемента = НСтр("ru='(Выберите элемент для редактирования или создайте новый)'");
	
	// Подготовим колонки тех.карт.
	ТаблицыТехКарт = ПолучитьТаблицыАтрибутовТехкарт();
	// Состав тех.карты.
	ПодготовитьКолонкиАтрибутовПодчиненныхОбъектов(
		ТаблицыТехКарт[0].ИдОбъекта, ТаблицыТехКарт[0].ИмяТаблицы, ТаблицыТехКарт[0].ТаблицаАтрибутов);
	// Тех.карты.
	ПодготовитьКолонкиАтрибутовПодчиненныхОбъектов(
		ТаблицыТехКарт[1].ИдОбъекта, ТаблицыТехКарт[1].ИмяТаблицы, ТаблицыТехКарт[1].ТаблицаАтрибутов);
	
	// Заполним список табличных атрибутов операций.
	СписокТабличныхАтрибутовОпераций = Элементы.ПереключательТабличныхАтрибутовОпераций.СписокВыбора;
	ЗаполнитьВложенныеТабличныеЧасти(ТаблицыТехКарт[0].ТаблицаАтрибутов, 1, СписокТабличныхАтрибутовОпераций);
	Если СписокТабличныхАтрибутовОпераций.Количество() = 0 Тогда
		Элементы.ГруппаПереключательТаблицОпераций.Видимость  = Ложь;
		Элементы.ЗначениеТабличногоАтрибутаОперации.Видимость      = Ложь;
	КонецЕсли;
	
	// Заполним список табличных атрибутов тех.карт.
	СписокТабличныхАтрибутовТехКарт = Элементы.ПереключательТабличныхАтрибутовТехКарт.СписокВыбора;
	ЗаполнитьВложенныеТабличныеЧасти(ТаблицыТехКарт[1].ТаблицаАтрибутов, 2, СписокТабличныхАтрибутовТехКарт);
	Если СписокТабличныхАтрибутовОпераций.Количество() = 0 Тогда
		Элементы.ПереключательТабличныхАтрибутовТехКарт.Видимость = Ложь;
	Иначе
		Найдено = СписочныеАтрибуты.НайтиСтроки(Новый Структура("ТипОбъекта, АтрибутКласса",
			2, ПланыВидовХарактеристик.АтрибутыКласса.ТехОперации));
		Если Найдено.Количество() > 0 Тогда
			ПереключательТабличныхАтрибутовТехКарт = Найдено[0].ИДАтрибута;
			ТекТаблицаТехКарты = ПланыВидовХарактеристик.АтрибутыКласса.ТехОперации;
		Иначе
			Найдено = СписочныеАтрибуты.НайтиСтроки(Новый Структура("ТипОбъекта", 2));
			ПереключательТабличныхАтрибутовТехКарт = Найдено[0].ИДАтрибута;
			ТекТаблицаТехКарты                     = Найдено[0].АтрибутКласса;
		КонецЕсли;
	КонецЕсли;
	
	ПравоИзменениеКлассов = ПравоДоступа("Изменение", Метаданные.Справочники.Классы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("ПроверкаБлокировкиКласса", 5);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность Тогда
		Если ЗавершениеРаботы = Истина Тогда
			Отказ = Истина;
			ТекстПредупреждения = НСтр("ru='Данные были изменены. Все изменения будут потеряны.'");
		Иначе
			Отказ = Истина;
			ТекстВопроса = НСтр("ru='Данные были изменены. Сохранить изменения?'");
			ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтаФорма), 
				ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		КонецЕсли;
		
	Иначе
		Если Редактирование И ЗначениеЗаполнено(Объект.Класс.Ссылка) Тогда
			СнятьБлокировкуКласса();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КодПриИзменении(Элемент)
	
	Объект.ПрисвоенНомерПоШаблону = Ложь;
	Объект.НомерПоСчетчику         = 0;
	Объект.ШагСчетчика             = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключательАтрибутовПриИзменении(Элемент)
	
	ПереключитьСтраницуФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураКлассаПриИзменении(Элемент)
	
	Элементы.ГруппаПараметрыНоменклатуры.Доступность = Объект.НоменклатураКласса;
	УстановитьАвтоотметкуНезаполненных(СписокРеквизитовКодированияИменованияНоменклатуры(), Объект.НоменклатураКласса);
	
	Элементы.ОбъектыНоменклатуры.Доступность = Объект.НоменклатураКласса;
	Если Объект.ОбъектыНоменклатуры И НЕ Объект.НоменклатураКласса Тогда
		Объект.ОбъектыНоменклатуры = Ложь;
		Элементы.ГруппаПараметрыОбъектаНоменклатуры.Доступность = Ложь;
		УстановитьАвтоотметкуНезаполненных(СписокРеквизитовКодированияИменованияОбъектов(), Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыНоменклатурыПриИзменении(Элемент)
	
	Элементы.ГруппаПараметрыОбъектаНоменклатуры.Доступность = Объект.ОбъектыНоменклатуры;
	УстановитьАвтоотметкуНезаполненных(СписокРеквизитовКодированияИменованияОбъектов(), Объект.ОбъектыНоменклатуры);
	
КонецПроцедуры

&НаКлиенте
Процедура КлассТабличнаяЧастьПриИзменении(Элемент)
	
	Элементы.НоменклатураКласса.Доступность = НЕ Объект.КлассТабличнаяЧасть;
	Элементы.ЗначениеАтрибута.Доступность   = НЕ Объект.КлассТабличнаяЧасть;
	Если Объект.КлассТабличнаяЧасть Тогда
		Объект.ЗначениеАтрибута   = Ложь;
		Объект.НоменклатураКласса = Истина;
		Элементы.ГруппаПараметрыНоменклатуры.Доступность = Истина;
		УстановитьАвтоотметкуНезаполненных(СписокРеквизитовКодированияИменованияНоменклатуры(), Истина);
		
		Элементы.ОбъектыНоменклатуры.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РодительПриИзменении(Элемент)
	РодительПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РежимКонтроляДублейПоНаименованиюПриИзменении(Элемент)
	
	Элементы.ГруппаСтраницыКонтрольДублейПоНаименованию.ТекущаяСтраница = 
		?(Объект.РежимКонтроляДублейПоНаименованию = ПредопределенноеЗначение("Перечисление.РежимыКонтроляДублей.ВПределахКласса"),
			Элементы.ГруппаСтраницаКонтрольДублейВПределахКласса,
			Элементы.ГруппаСтраницаКонтрольДублейКакУРодителя);
	
	Если НЕ ЗначениеЗаполнено(Объект.РежимКонтроляДублейПоНаименованию) Тогда
		КонтрольДублейКакУРодителя = ПолучитьПредставлениеРежимаКонтроляДублей(СписокРодителей);
	Иначе
		КонтрольДублейКакУРодителя = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонНаименованияНоменклатурыПриИзменении(Элемент)
	
	СтруктураАтрибутов = ПолучитьАтрибутыШаблонов(Неопределено, Неопределено, 
		Объект.ШаблонКодаНоменклатуры, Объект.ШаблонНаименованияНоменклатуры, 
		Объект.ШаблонКодаОбъекта, Объект.ШаблонНаименованияОбъекта);
		
	НеучитываемыеРежимы = Новый Массив();
	НеучитываемыеРежимы.Добавить(
		ПредопределенноеЗначение("Перечисление.РежимыЗаполненияАтрибутов.ОбязательныйДляНоменклатуры"));
	НеучитываемыеРежимы.Добавить(
		ПредопределенноеЗначение("Перечисление.РежимыЗаполненияАтрибутов.ОбязательныйДляКласса"));
	НеучитываемыеРежимы.Добавить(
		ПредопределенноеЗначение("Перечисление.РежимыЗаполненияАтрибутов.ФиксированноеЗначение"));
	
	Для Каждого СтрокаАтрибут ИЗ Объект.Атрибуты Цикл
		Если НЕ СтруктураАтрибутов.АтрибутыШаблонаНоменклатуры = Неопределено 
				И НЕ СтруктураАтрибутов.АтрибутыШаблонаНоменклатуры.Найти(СтрокаАтрибут.АтрибутКласса) = Неопределено Тогда
			Если НеучитываемыеРежимы.Найти(СтрокаАтрибут.РежимЗаполненияРодителя) = Неопределено
					И НеучитываемыеРежимы.Найти(СтрокаАтрибут.РежимЗаполнения) = Неопределено Тогда
				СтрокаАтрибут.РежимЗаполнения = 
					ПредопределенноеЗначение("Перечисление.РежимыЗаполненияАтрибутов.ОбязательныйДляНоменклатуры");
			КонецЕсли;
			
			Если СтрокаАтрибут.ЭтотАтрибутВШаблоне = 0 ИЛИ СтрокаАтрибут.ЭтотАтрибутВШаблоне = 3 Тогда
				СтрокаАтрибут.ЭтотАтрибутВШаблоне = 2;
			КонецЕсли;
			
		ИначеЕсли СтрокаАтрибут.ЭтотАтрибутВШаблоне = 2 Тогда
			
			Если НЕ СтруктураАтрибутов.АтрибутыШаблонаОбъекта = Неопределено
					И НЕ СтруктураАтрибутов.АтрибутыШаблонаОбъекта.Найти(СтрокаАтрибут.АтрибутКласса) = Неопределено Тогда
				
				СтрокаАтрибут.ЭтотАтрибутВШаблоне = 3;
				Если НеучитываемыеРежимы.Найти(СтрокаАтрибут.РежимЗаполненияРодителя) = Неопределено
						И НеучитываемыеРежимы.Найти(СтрокаАтрибут.РежимЗаполнения) = Неопределено Тогда
					СтрокаАтрибут.РежимЗаполнения = 
						ПредопределенноеЗначение("Перечисление.РежимыЗаполненияАтрибутов.ОбязательныйДляОбъекта");
				КонецЕсли;
				
			Иначе
				СтрокаАтрибут.ЭтотАтрибутВШаблоне = 0;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонКодаНоменклатурыПриИзменении(Элемент)
	
	СтруктураАтрибутов = ПолучитьАтрибутыШаблонов(Неопределено, Неопределено, 
		Объект.ШаблонКодаНоменклатуры, Объект.ШаблонНаименованияНоменклатуры, 
		Объект.ШаблонКодаОбъекта, Объект.ШаблонНаименованияОбъекта);
	
	НеучитываемыеРежимы = Новый Массив();
	НеучитываемыеРежимы.Добавить(
		ПредопределенноеЗначение("Перечисление.РежимыЗаполненияАтрибутов.ОбязательныйДляНоменклатуры"));
	НеучитываемыеРежимы.Добавить(
		ПредопределенноеЗначение("Перечисление.РежимыЗаполненияАтрибутов.ОбязательныйДляКласса"));
	НеучитываемыеРежимы.Добавить(
		ПредопределенноеЗначение("Перечисление.РежимыЗаполненияАтрибутов.ФиксированноеЗначение"));
	
	Для Каждого СтрокаАтрибут ИЗ Объект.Атрибуты Цикл
		Если НЕ СтруктураАтрибутов.АтрибутыШаблонаНоменклатуры = Неопределено 
				И НЕ СтруктураАтрибутов.АтрибутыШаблонаНоменклатуры.Найти(СтрокаАтрибут.АтрибутКласса) = Неопределено Тогда
			
			Если НеучитываемыеРежимы.Найти(СтрокаАтрибут.РежимЗаполненияРодителя) = Неопределено
					И НеучитываемыеРежимы.Найти(СтрокаАтрибут.РежимЗаполнения) = Неопределено Тогда
				СтрокаАтрибут.РежимЗаполнения = 
					ПредопределенноеЗначение("Перечисление.РежимыЗаполненияАтрибутов.ОбязательныйДляНоменклатуры");
			КонецЕсли;
			
			Если СтрокаАтрибут.ЭтотАтрибутВШаблоне = 0 ИЛИ СтрокаАтрибут.ЭтотАтрибутВШаблоне = 3 Тогда
				СтрокаАтрибут.ЭтотАтрибутВШаблоне = 2;
			КонецЕсли;
			
		ИначеЕсли СтрокаАтрибут.ЭтотАтрибутВШаблоне = 2 Тогда
			
			Если НЕ СтруктураАтрибутов.АтрибутыШаблонаОбъекта = Неопределено
					И НЕ СтруктураАтрибутов.АтрибутыШаблонаОбъекта.Найти(СтрокаАтрибут.АтрибутКласса) = Неопределено Тогда
				
				СтрокаАтрибут.ЭтотАтрибутВШаблоне = 3;
				Если НеучитываемыеРежимы.Найти(СтрокаАтрибут.РежимЗаполненияРодителя) = Неопределено
						И НеучитываемыеРежимы.Найти(СтрокаАтрибут.РежимЗаполнения) = Неопределено Тогда
					СтрокаАтрибут.РежимЗаполнения = 
						ПредопределенноеЗначение("Перечисление.РежимыЗаполненияАтрибутов.ОбязательныйДляОбъекта");
				КонецЕсли;
				
			Иначе
				СтрокаАтрибут.ЭтотАтрибутВШаблоне = 0;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонНаименованияКлассаПриИзменении(Элемент)
	
	СтруктураАтрибутов = ПолучитьАтрибутыШаблонов(Объект.ШаблонКодаКласса, Объект.ШаблонНаименованияКласса, 
		Объект.ШаблонКодаНоменклатуры, Объект.ШаблонНаименованияНоменклатуры, 
		Объект.ШаблонКодаОбъекта, Объект.ШаблонНаименованияОбъекта);
	
	НеучитываемыеРежимы = Новый Массив();
	НеучитываемыеРежимы.Добавить(
		ПредопределенноеЗначение("Перечисление.РежимыЗаполненияАтрибутов.ОбязательныйДляКласса"));
	НеучитываемыеРежимы.Добавить(
		ПредопределенноеЗначение("Перечисление.РежимыЗаполненияАтрибутов.ФиксированноеЗначение"));
		
	ОбязательныйДляНоменклатуры = 
		ПредопределенноеЗначение("Перечисление.РежимыЗаполненияАтрибутов.ОбязательныйДляНоменклатуры");
		
	Для Каждого СтрокаАтрибут ИЗ Объект.Атрибуты Цикл
		Если НЕ СтруктураАтрибутов.АтрибутыШаблонаКласса = Неопределено 
				И НЕ СтруктураАтрибутов.АтрибутыШаблонаКласса.Найти(СтрокаАтрибут.АтрибутКласса) = Неопределено Тогда
			
			Если НеучитываемыеРежимы.Найти(СтрокаАтрибут.РежимЗаполненияРодителя) = Неопределено
					И НеучитываемыеРежимы.Найти(СтрокаАтрибут.РежимЗаполнения) = Неопределено Тогда
				СтрокаАтрибут.РежимЗаполнения = 
					ПредопределенноеЗначение("Перечисление.РежимыЗаполненияАтрибутов.ОбязательныйДляКласса");
				Если СтрокаАтрибут.ЭтотАтрибутВШаблоне = 0 
						ИЛИ СтрокаАтрибут.ЭтотАтрибутВШаблоне = 2 ИЛИ СтрокаАтрибут.ЭтотАтрибутВШаблоне = 3 Тогда
					СтрокаАтрибут.ЭтотАтрибутВШаблоне = 1;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли СтрокаАтрибут.ЭтотАтрибутВШаблоне = 1 Тогда
			
			Если НЕ СтруктураАтрибутов.АтрибутыШаблонаНоменклатуры = Неопределено
					И НЕ СтруктураАтрибутов.АтрибутыШаблонаНоменклатуры.Найти(СтрокаАтрибут.АтрибутКласса) = Неопределено Тогда
				
				СтрокаАтрибут.ЭтотАтрибутВШаблоне = 2;
				Если НеучитываемыеРежимы.Найти(СтрокаАтрибут.РежимЗаполненияРодителя) = Неопределено
						И НеучитываемыеРежимы.Найти(СтрокаАтрибут.РежимЗаполнения) = Неопределено Тогда
					СтрокаАтрибут.РежимЗаполнения = ОбязательныйДляНоменклатуры;
				КонецЕсли;
				
			ИначеЕсли НЕ СтруктураАтрибутов.АтрибутыШаблонаОбъекта = Неопределено
					И НЕ СтруктураАтрибутов.АтрибутыШаблонаОбъекта.Найти(СтрокаАтрибут.АтрибутКласса) = Неопределено Тогда
				
				СтрокаАтрибут.ЭтотАтрибутВШаблоне = 3;
				Если НеучитываемыеРежимы.Найти(СтрокаАтрибут.РежимЗаполненияРодителя) = Неопределено
						И НеучитываемыеРежимы.Найти(СтрокаАтрибут.РежимЗаполнения) = Неопределено
						И НЕ СтрокаАтрибут.РежимЗаполненияРодителя = ОбязательныйДляНоменклатуры 
						И НЕ СтрокаАтрибут.РежимЗаполнения = ОбязательныйДляНоменклатуры Тогда
					СтрокаАтрибут.РежимЗаполнения = 
						ПредопределенноеЗначение("Перечисление.РежимыЗаполненияАтрибутов.ОбязательныйДляОбъекта");
				КонецЕсли;
				
			Иначе
				СтрокаАтрибут.ЭтотАтрибутВШаблоне = 0;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонКодаКлассаПриИзменении(Элемент)
	
	СтруктураАтрибутов = ПолучитьАтрибутыШаблонов(Объект.ШаблонКодаКласса, Объект.ШаблонНаименованияКласса, 
		Объект.ШаблонКодаНоменклатуры, Объект.ШаблонНаименованияНоменклатуры, 
		Объект.ШаблонКодаОбъекта, Объект.ШаблонНаименованияОбъекта);
	
	НеучитываемыеРежимы = Новый Массив();
	НеучитываемыеРежимы.Добавить(
		ПредопределенноеЗначение("Перечисление.РежимыЗаполненияАтрибутов.ОбязательныйДляКласса"));
	НеучитываемыеРежимы.Добавить(
		ПредопределенноеЗначение("Перечисление.РежимыЗаполненияАтрибутов.ФиксированноеЗначение"));
		
	ОбязательныйДляНоменклатуры = 
		ПредопределенноеЗначение("Перечисление.РежимыЗаполненияАтрибутов.ОбязательныйДляНоменклатуры");
	
	Для Каждого СтрокаАтрибут ИЗ Объект.Атрибуты Цикл
		Если НЕ СтруктураАтрибутов.АтрибутыШаблонаКласса = Неопределено 
				И НЕ СтруктураАтрибутов.АтрибутыШаблонаКласса.Найти(СтрокаАтрибут.АтрибутКласса) = Неопределено Тогда
			
			Если НеучитываемыеРежимы.Найти(СтрокаАтрибут.РежимЗаполненияРодителя) = Неопределено
					И НеучитываемыеРежимы.Найти(СтрокаАтрибут.РежимЗаполнения) = Неопределено Тогда
				СтрокаАтрибут.РежимЗаполнения = 
					ПредопределенноеЗначение("Перечисление.РежимыЗаполненияАтрибутов.ОбязательныйДляКласса");
				Если СтрокаАтрибут.ЭтотАтрибутВШаблоне = 0 
						ИЛИ СтрокаАтрибут.ЭтотАтрибутВШаблоне = 2 ИЛИ СтрокаАтрибут.ЭтотАтрибутВШаблоне = 3 Тогда
					СтрокаАтрибут.ЭтотАтрибутВШаблоне = 1;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли СтрокаАтрибут.ЭтотАтрибутВШаблоне = 1 Тогда
			
			Если НЕ СтруктураАтрибутов.АтрибутыШаблонаНоменклатуры = Неопределено
					И НЕ СтруктураАтрибутов.АтрибутыШаблонаНоменклатуры.Найти(СтрокаАтрибут.АтрибутКласса) = Неопределено Тогда
				
				СтрокаАтрибут.ЭтотАтрибутВШаблоне = 2;
				Если НеучитываемыеРежимы.Найти(СтрокаАтрибут.РежимЗаполненияРодителя) = Неопределено
						И НеучитываемыеРежимы.Найти(СтрокаАтрибут.РежимЗаполнения) = Неопределено Тогда
					СтрокаАтрибут.РежимЗаполнения = 
						ПредопределенноеЗначение("Перечисление.РежимыЗаполненияАтрибутов.ОбязательныйДляНоменклатуры");
				КонецЕсли;
				
			ИначеЕсли НЕ СтруктураАтрибутов.АтрибутыШаблонаОбъекта = Неопределено
					И НЕ СтруктураАтрибутов.АтрибутыШаблонаОбъекта.Найти(СтрокаАтрибут.АтрибутКласса) = Неопределено Тогда
				
				СтрокаАтрибут.ЭтотАтрибутВШаблоне = 3;
				Если НеучитываемыеРежимы.Найти(СтрокаАтрибут.РежимЗаполненияРодителя) = Неопределено
						И НеучитываемыеРежимы.Найти(СтрокаАтрибут.РежимЗаполнения) = Неопределено
						И НЕ СтрокаАтрибут.РежимЗаполненияРодителя = ОбязательныйДляНоменклатуры 
						И НЕ СтрокаАтрибут.РежимЗаполнения = ОбязательныйДляНоменклатуры Тогда
					СтрокаАтрибут.РежимЗаполнения = 
						ПредопределенноеЗначение("Перечисление.РежимыЗаполненияАтрибутов.ОбязательныйДляОбъекта");
				КонецЕсли;
				
			Иначе
				СтрокаАтрибут.ЭтотАтрибутВШаблоне = 0;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонНаименованияОбъектаПриИзменении(Элемент)
	
	СтруктураАтрибутов = ПолучитьАтрибутыШаблонов(Неопределено, Неопределено, Неопределено, Неопределено, 
		Объект.ШаблонКодаОбъекта, Объект.ШаблонНаименованияОбъекта);
	
	НеучитываемыеРежимы = Новый Массив();
	НеучитываемыеРежимы.Добавить(
		ПредопределенноеЗначение("Перечисление.РежимыЗаполненияАтрибутов.ОбязательныйДляОбъекта"));
	НеучитываемыеРежимы.Добавить(
		ПредопределенноеЗначение("Перечисление.РежимыЗаполненияАтрибутов.ОбязательныйДляНоменклатуры"));
	НеучитываемыеРежимы.Добавить(
		ПредопределенноеЗначение("Перечисление.РежимыЗаполненияАтрибутов.ОбязательныйДляКласса"));
	НеучитываемыеРежимы.Добавить(
		ПредопределенноеЗначение("Перечисление.РежимыЗаполненияАтрибутов.ФиксированноеЗначение"));
	
	Для Каждого СтрокаАтрибут ИЗ Объект.Атрибуты Цикл
		Если НЕ СтруктураАтрибутов.АтрибутыШаблонаОбъекта = Неопределено 
				И НЕ СтруктураАтрибутов.АтрибутыШаблонаОбъекта.Найти(СтрокаАтрибут.АтрибутКласса) = Неопределено Тогда
			
			Если НеучитываемыеРежимы.Найти(СтрокаАтрибут.РежимЗаполненияРодителя) = Неопределено
					И НеучитываемыеРежимы.Найти(СтрокаАтрибут.РежимЗаполнения) = Неопределено Тогда
				СтрокаАтрибут.РежимЗаполнения = 
					ПредопределенноеЗначение("Перечисление.РежимыЗаполненияАтрибутов.ОбязательныйДляОбъекта");
				Если СтрокаАтрибут.ЭтотАтрибутВШаблоне = 0 Тогда
					СтрокаАтрибут.ЭтотАтрибутВШаблоне = 3;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли СтрокаАтрибут.ЭтотАтрибутВШаблоне = 3 Тогда
			СтрокаАтрибут.ЭтотАтрибутВШаблоне = 0;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонКодаОбъектаПриИзменении(Элемент)
	
	СтруктураАтрибутов = ПолучитьАтрибутыШаблонов(Неопределено, Неопределено, Неопределено, Неопределено, 
		Объект.ШаблонКодаОбъекта, Объект.ШаблонНаименованияОбъекта);
		
	НеучитываемыеРежимы = Новый Массив();
	НеучитываемыеРежимы.Добавить(
		ПредопределенноеЗначение("Перечисление.РежимыЗаполненияАтрибутов.ОбязательныйДляОбъекта"));
	НеучитываемыеРежимы.Добавить(
		ПредопределенноеЗначение("Перечисление.РежимыЗаполненияАтрибутов.ОбязательныйДляНоменклатуры"));
	НеучитываемыеРежимы.Добавить(
		ПредопределенноеЗначение("Перечисление.РежимыЗаполненияАтрибутов.ОбязательныйДляКласса"));
	НеучитываемыеРежимы.Добавить(
		ПредопределенноеЗначение("Перечисление.РежимыЗаполненияАтрибутов.ФиксированноеЗначение"));
	
	Для Каждого СтрокаАтрибут ИЗ Объект.Атрибуты Цикл
		Если НЕ СтруктураАтрибутов.АтрибутыШаблонаОбъекта = Неопределено 
				И НЕ СтруктураАтрибутов.АтрибутыШаблонаОбъекта.Найти(СтрокаАтрибут.АтрибутКласса) = Неопределено Тогда
			
			Если НеучитываемыеРежимы.Найти(СтрокаАтрибут.РежимЗаполненияРодителя) = Неопределено
					И НеучитываемыеРежимы.Найти(СтрокаАтрибут.РежимЗаполнения) = Неопределено Тогда
				СтрокаАтрибут.РежимЗаполнения = 
					ПредопределенноеЗначение("Перечисление.РежимыЗаполненияАтрибутов.ОбязательныйДляОбъекта");
				Если СтрокаАтрибут.ЭтотАтрибутВШаблоне = 0 Тогда
					СтрокаАтрибут.ЭтотАтрибутВШаблоне = 3;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли СтрокаАтрибут.ЭтотАтрибутВШаблоне = 3 Тогда
			СтрокаАтрибут.ЭтотАтрибутВШаблоне = 0;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыКлассы

&НаКлиенте
Процедура КлассыСписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Модифицированность Тогда
		ТекстВопроса = НСтр("ru='Данные были изменены. Сохранить изменения?'");
		ДопПараметры = Новый Структура("ВыбраннаяСтрока, РежимДобавления", ВыбраннаяСтрока, 0);
		ПоказатьВопрос(Новый ОписаниеОповещения("ПодготовитьФормуРедактированияКлассаЗавершение", ЭтаФорма, ДопПараметры),
			ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		Возврат;
	КонецЕсли;
	
	Если Редактирование И ЗначениеЗаполнено(Объект.Класс.Ссылка) Тогда
		СнятьБлокировкуКласса();
	КонецЕсли;
	
	Пользователь = Неопределено;
	ОбъектЗаблокирован = ОбъектРедактируется(ВыбраннаяСтрока, Ложь, Пользователь);
	Если ОбъектЗаблокирован Тогда
		ШаблонПредупреждения = НСтр("ru = 'Класс ''%1'' заблокирован для редактирования пользователем ''%2''.'");
		ТекстПредупреждения = УправлениеНСИФункцииКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
			ШаблонПредупреждения, Строка(ВыбраннаяСтрока), Строка(Пользователь));
		ПоказатьПредупреждение(, ТекстПредупреждения);
		
		ВыбратьОбъектРедактирования(Неопределено);
		
		ОтменитьРедактированиеНаСервере();
		Возврат;
		
	КонецЕсли;
	
	ПодготовитьФормуРедактированияКласса(ВыбраннаяСтрока);
	Если ПереключательАтрибутов > 1 Тогда 
		ПереключательАтрибутов = 0;
		ПереключитьСтраницуФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КлассыСписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	ТекСтрока = Элементы.КлассыСписок.ТекущаяСтрока;
	Если Модифицированность Тогда
		ТекстВопроса = НСтр("ru='Данные были изменены. Сохранить изменения?'");
		ДопПараметры = Новый Структура("ВыбраннаяСтрока, РежимДобавления", ТекСтрока, ?(Копирование, 2, 1));
		ПоказатьВопрос(Новый ОписаниеОповещения("ПодготовитьФормуРедактированияКлассаЗавершение", ЭтаФорма, ДопПараметры), 
			ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		Возврат;
	КонецЕсли;
	
	Если ТекСтрока = Неопределено Тогда
		ТекСтрока = Родитель;
	КонецЕсли;
	
	ПодготовитьФормуРедактированияКласса(ТекСтрока, ?(Копирование, 2, 1));
	Если ПереключательАтрибутов > 1 Тогда 
		ПереключательАтрибутов = 0;
		ПереключитьСтраницуФормы();
	КонецЕсли;
	
	Если НЕ Элементы.КлассыСписок.ТекущийРодитель = Объект.Родитель Тогда
		Элементы.КлассыСписок.ТекущийРодитель = Объект.Родитель;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КлассыСписокПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекСтрока = Элементы.КлассыСписок.ТекущаяСтрока;
	Если Модифицированность Тогда
		ТекстВопроса = НСтр("ru='Данные были изменены. Сохранить изменения?'");
		ДопПараметры = Новый Структура("ВыбраннаяСтрока, РежимДобавления", ТекСтрока, 0);
		ПоказатьВопрос(Новый ОписаниеОповещения("ПодготовитьФормуРедактированияКлассаЗавершение", ЭтаФорма, ДопПараметры), 
			ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		Возврат;
	КонецЕсли;
	
	Если Редактирование И ЗначениеЗаполнено(Объект.Класс.Ссылка) Тогда
		СнятьБлокировкуКласса();
	КонецЕсли;
	
	Пользователь = Неопределено;
	ОбъектЗаблокирован = ОбъектРедактируется(ТекСтрока, Ложь, Пользователь);
	Если ОбъектЗаблокирован Тогда
		ШаблонПредупреждения = НСтр("ru = 'Класс ''%1'' заблокирован для редактирования пользователем ''%2''.'");
		ТекстПредупреждения = УправлениеНСИФункцииКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
			ШаблонПредупреждения, Строка(ТекСтрока), Строка(Пользователь));
		ПоказатьПредупреждение(, ТекстПредупреждения);
		
		ВыбратьОбъектРедактирования(Неопределено);
		
		ОтменитьРедактированиеНаСервере();
		Возврат;
		
	КонецЕсли;
	
	ПодготовитьФормуРедактированияКласса(ТекСтрока);
	Если ПереключательАтрибутов > 1 Тогда 
		ПереключательАтрибутов = 0;
		ПереключитьСтраницуФормы();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыАтрибуты

&НаКлиенте
Процедура АтрибутыПриАктивизацииСтроки(Элемент)
	
	НастроитьОтображениеДанныхАтрибута(Объект, Элементы, ТекРежимЗаполненияАтрибутаШаблона, Редактирование);

	ОбновитьОтображениеДанных(Элементы.АтрибутыРежимЗаполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура АтрибутыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура АтрибутыПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	УдалитьАтрибут(4); // Новые, добавленные из наборов - удалять наборами, остальные - построчно.
	
КонецПроцедуры

&НаКлиенте
Процедура АтрибутыЗначениеАтрибутаКлассаПриИзменении(Элемент)
	
	ТекДанные = Элементы.Атрибуты.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекДанные.ЗначениеАтрибутаКласса) Тогда
		ТекДанные.УровеньЗначения = 0;
	Иначе
		ТекДанные.УровеньЗначения = 1;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АтрибутыЗначениеАтрибутаКлассаСоставноеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.Атрибуты.ТекущиеДанные;
	Если ТекДанные.ТипЗначения.СодержитТип(Тип("СправочникСсылка.ОбъектыНоменклатуры")) Тогда
		КоличествоТипов = 3;
	Иначе
		КоличествоТипов = 2;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура("КоличествоТипов, Ключ", 
		КоличествоТипов, ТекДанные.ЗначениеАтрибутаКлассаСоставное);
	ОткрытьФорму("Обработка.РедактированиеКлассов.Форма.ФормаВыборкаСоставногоЗначения", 
		ПараметрыОткрытия, Элемент, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура АтрибутыЗначениеАтрибутаКлассаСоставноеПриИзменении(Элемент)
	
	ТекДанные = Элементы.Атрибуты.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ТекДанные.ТипЗначения.СодержитТип(ТипЗнч(ТекДанные.ЗначениеАтрибутаКлассаСоставное)) Тогда
		ТекДанные.ИсточникЗначений = ТекДанные.ЗначениеАтрибутаКлассаСоставное;
		ТекДанные.ЗначениеАтрибутаКласса = ТекДанные.ТипЗначения.ПривестиЗначение();
	Иначе
		ТекДанные.ЗначениеАтрибутаКласса = ТекДанные.ЗначениеАтрибутаКлассаСоставное;
		Если НЕ ЗначениеЗаполнено(ТекДанные.ЗначениеАтрибутаКлассаСоставное) Тогда
			ТекДанные.ИсточникЗначений = ПредопределенноеЗначение("Справочник.Классы.ПустаяСсылка");
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекДанные.ЗначениеАтрибутаКласса) Тогда
		ТекДанные.УровеньЗначения = 0;
	Иначе
		ТекДанные.УровеньЗначения = 1;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АтрибутыЗначениеАтрибутаКлассаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Атрибуты.ТекущиеДанные;
	Если ТекДанные.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Классы"))
			И НЕ ТекДанные.СписокДоступныхЗначений И ЗначениеЗаполнено(ТекДанные.ИсточникЗначений)Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму("Справочник.Классы.ФормаВыбора", Новый Структура("РодительВерхнегоУровня", ТекДанные.ИсточникЗначений), Элемент, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АтрибутыМногострочноеРедактированиеПриИзменении(Элемент)
	
	ТекДанные = Элементы.Атрибуты.ТекущиеДанные;
	
	ТипЧисло  = Ложь;
	ТипДата   = Ложь;
	ТипСтрока = Ложь;
	ТипБулево = Ложь;
	ПроверитьИспользованиеПримитивныхТипов(ТекДанные.ТипЗначения, ТипЧисло, ТипДата, ТипБулево, ТипСтрока);
	
	ТекДанные.МножественноеЗначениеКартинка = ?(ТекДанные.МножественноеЗначение И НЕ ТипСтрока, 0, 1);
	
	Элементы.АтрибутыФормат.Доступность = НЕ ТекДанные.МножественноеЗначение И (ТипЧисло ИЛИ ТипДата ИЛИ ТипСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура АтрибутыМножественноеЗначениеПриИзменении(Элемент)
	
	ТекДанные = Элементы.Атрибуты.ТекущиеДанные;
	ЭтоСтрока = ТекДанные.ТипЗначения.СодержитТип(Тип("Строка"));
	ТекДанные.МножественноеЗначениеКартинка = ?(ТекДанные.МножественноеЗначение И НЕ ЭтоСтрока, 0, 1);
	Если ТекДанные.МножественноеЗначение И НЕ ЭтоСтрока Тогда
		ТекДанные.ЗначениеАтрибутаКласса = ТекДанные.ТипЗначения.ПривестиЗначение();
		ТекДанные.УровеньЗначения = 0;
	КонецЕсли;
	
	Если НЕ ЭтоСтрока И (ТекДанные.МножественноеЗначение ИЛИ ТекДанные.СписокДоступныхЗначений) Тогда
		ДобавитьСписочныйАтрибут(ТекДанные.АтрибутКласса, ТекДанные.КлассТабличнаяЧасть, ТекДанные.ИсточникЗначений);
	Иначе
		Найдено = СписочныеАтрибуты.НайтиСтроки(Новый Структура("ТипОбъекта, АтрибутКласса", 0, ТекДанные.АтрибутКласса));
		Если Найдено.Количество() > 0 Тогда
			ЭлементСписка = Элементы.ПереключательАтрибутов.СписокВыбора.НайтиПоЗначению(Найдено[0].ИДАтрибута);
			Если НЕ ЭлементСписка = Неопределено Тогда
				Элементы.ПереключательАтрибутов.СписокВыбора.Удалить(ЭлементСписка);
			КонецЕсли;
			СписочныеАтрибуты.Удалить(Найдено[0]);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АтрибутыСписокДоступныхЗначенийПриИзменении(Элемент)
	
	ТекДанные = Элементы.Атрибуты.ТекущиеДанные;
	ТекДанные.СписокДоступныхЗначений = (ТекДанные.СписокДоступныхЗначенийПереключатель = 1);
	Элементы.АтрибутыИсточникЗначений.Доступность = НЕ ТекДанные.СписокДоступныхЗначений;
	
	Если ТекДанные.МножественноеЗначение ИЛИ ТекДанные.СписокДоступныхЗначений Тогда
		ДобавитьСписочныйАтрибут(ТекДанные.АтрибутКласса, ТекДанные.КлассТабличнаяЧасть, ТекДанные.ИсточникЗначений);
	Иначе
		Найдено = СписочныеАтрибуты.НайтиСтроки(Новый Структура("ТипОбъекта, АтрибутКласса", 0, ТекДанные.АтрибутКласса));
		Если Найдено.Количество() > 0 Тогда
			ЭлементСписка = Элементы.ПереключательАтрибутов.СписокВыбора.НайтиПоЗначению(Найдено[0].ИДАтрибута);
			Если НЕ ЭлементСписка = Неопределено Тогда
				Элементы.ПереключательАтрибутов.СписокВыбора.Удалить(ЭлементСписка);
			КонецЕсли;
			СписочныеАтрибуты.Удалить(Найдено[0]);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АтрибутыИсточникЗначенийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ Элемент.ВыбиратьТип Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.Атрибуты.ТекущиеДанные;
	ПараметрыОткрытия = Новый Структура("КоличествоТипов, Ключ", 
		2, ТекДанные.ИсточникЗначений);
	ОткрытьФорму("Обработка.РедактированиеКлассов.Форма.ФормаВыборкаСоставногоЗначения", 
		ПараметрыОткрытия, Элемент, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура АтрибутыИсточникЗначенийПриИзменении(Элемент)
	
	ТекДанные = Элементы.Атрибуты.ТекущиеДанные;
	Если ТекДанные.СоставнойТипЗначения Тогда
		Если НЕ ТекДанные.ТипЗначения.СодержитТип(ТипЗнч(ТекДанные.ЗначениеАтрибутаКлассаСоставное)) Тогда
			ТекДанные.ЗначениеАтрибутаКлассаСоставное = ТекДанные.ИсточникЗначений;
		КонецЕсли;
	КонецЕсли;
	Если ТекДанные.МножественноеЗначение Тогда
		НайденоАтрибуты = СписочныеАтрибуты.НайтиСтроки(Новый Структура("ТипОбъекта, АтрибутКласса", 0, ТекДанные.АтрибутКласса));
		НайденоАтрибуты[0].ИсточникЗначений = ТекДанные.ИсточникЗначений;
		НайденоАтрибуты[0].КлассТабличнаяЧасть = УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначениеРеквизитаОбъекта(
			ТекДанные.ИсточникЗначений, "КлассТабличнаяЧасть");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АтрибутыРежимИспользованияПриИзменении(Элемент)
	
	ТекДанные = Элементы.Атрибуты.ТекущиеДанные;
	Элементы.АтрибутыРежимЗаполнения.СписокВыбора.ЗагрузитьЗначения(
		ПолучитьСписокРежимовЗаполнения(ТекДанные.РежимИспользования, ТекДанные.РежимЗаполненияРодителя));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыВсеАтрибуты

&НаКлиенте
Процедура ВсеАтрибутыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураАтрибутов = ПолучитьАтрибутыШаблонов(Объект.ШаблонКодаКласса, Объект.ШаблонНаименованияКласса, 
		Объект.ШаблонКодаНоменклатуры, Объект.ШаблонНаименованияНоменклатуры, 
		Объект.ШаблонКодаОбъекта, Объект.ШаблонНаименованияОбъекта);
	
	Если Элементы.ВсеАтрибуты.ВыделенныеСтроки.Количество() > 1 Тогда
		Для Каждого АтрибутКласса ИЗ Элементы.ВсеАтрибуты.ВыделенныеСтроки Цикл
			ДобавитьАтрибут(АтрибутКласса, СтруктураАтрибутов.АтрибутыШаблонаКласса, 
				СтруктураАтрибутов.АтрибутыШаблонаНоменклатуры, СтруктураАтрибутов.АтрибутыШаблонаОбъекта);
		КонецЦикла;
	Иначе
		ДобавитьАтрибут(ВыбраннаяСтрока, СтруктураАтрибутов.АтрибутыШаблонаКласса, 
			СтруктураАтрибутов.АтрибутыШаблонаНоменклатуры, СтруктураАтрибутов.АтрибутыШаблонаОбъекта);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыЗначенияСписочногоАтрибута

&НаКлиенте
Процедура ТекИсточникЗначенийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ Элемент.ВыбиратьТип Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура("КоличествоТипов, Ключ", 
		2, ТекИсточникЗначений);
	ОткрытьФорму("Обработка.РедактированиеКлассов.Форма.ФормаВыборкаСоставногоЗначения", 
		ПараметрыОткрытия, Элемент, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ТекИсточникЗначенийПриИзменении(Элемент)
	
	НайденоАтрибуты = Объект.Атрибуты.НайтиСтроки(Новый Структура("АтрибутКласса", ТекСписочныйАтрибут));
	НайденоАтрибуты[0].ИсточникЗначений = ТекИсточникЗначений;
	Если НайденоАтрибуты[0].СоставнойТипЗначения Тогда
		Если НЕ НайденоАтрибуты[0].ТипЗначения.СодержитТип(ТипЗнч(НайденоАтрибуты[0].ЗначениеАтрибутаКлассаСоставное)) Тогда
			НайденоАтрибуты[0].ЗначениеАтрибутаКлассаСоставное = НайденоАтрибуты[0].ИсточникЗначений;
		КонецЕсли;
	КонецЕсли;
	
	НайденоАтрибуты = СписочныеАтрибуты.НайтиСтроки(Новый Структура("ТипОбъекта, АтрибутКласса", 0, ТекСписочныйАтрибут));
	НайденоАтрибуты[0].ИсточникЗначений = ТекИсточникЗначений;
	НайденоАтрибуты[0].КлассТабличнаяЧасть = ?(ЗначениеЗаполнено(ТекИсточникЗначений), 
		УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначениеРеквизитаОбъекта(
			ТекИсточникЗначений, "КлассТабличнаяЧасть"), Ложь);
	
	// Вывод значений для выбора.
	ВывестиЗначенияСписочногоАтрибутаНаСервере(ТекСписочныйАтрибут);
	
	НастроитьВидимостьЭлементовЗначенийСписочногоАтрибута();
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияСписочногоАтрибутаПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.ЗначенияСписочногоАтрибута.ТекущиеДанные;
	НастроитьКомандыУправленияЗначениямиСписочногоАтрибута(Объект, Элементы, ТекДанные, Редактирование);
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияСписочногоАтрибутаИспользуемоеЗначениеПриИзменении(Элемент)
	
	ТекДанные = Элементы.ЗначенияСписочногоАтрибута.ТекущиеДанные;
	ПриИзмененииЗначенияСписочногоАтрибута(ТекДанные);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияСписочногоАтрибутаДоступноеЗначениеПриИзменении(Элемент)
	
	ТекДанные = Элементы.ЗначенияСписочногоАтрибута.ТекущиеДанные;
	ПриИзмененииЗначенияСписочногоАтрибута(ТекДанные, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияСписочногоАтрибутаНоменклатураИспользуемоеЗначениеПриИзменении(Элемент)
	
	ТекДанные = Элементы.ЗначенияСписочногоАтрибутаНоменклатура.ТекущиеДанные;
	ПриИзмененииЗначенияСписочногоАтрибута(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияСписочногоАтрибутаНоменклатураДоступноеЗначениеПриИзменении(Элемент)
	
	ТекДанные = Элементы.ЗначенияСписочногоАтрибутаНоменклатура.ТекущиеДанные;
	ПриИзмененииЗначенияСписочногоАтрибута(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияСписочногоАтрибутаОбъектыНоменклатурыДоступноеЗначениеПриИзменении(Элемент)
	
	ТекДанные = Элементы.ЗначенияСписочногоАтрибутаОбъектыНоменклатуры.ТекущиеДанные;
	ПриИзмененииЗначенияСписочногоАтрибута(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияСписочногоАтрибутаОбъектыНоменклатурыИспользуемоеЗначениеПриИзменении(Элемент)
	
	ТекДанные = Элементы.ЗначенияСписочногоАтрибутаОбъектыНоменклатуры.ТекущиеДанные;
	ПриИзмененииЗначенияСписочногоАтрибута(ТекДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыЗначенияТабличногоАтрибута

&НаКлиенте
Процедура ЗначениеТабличногоАтрибутаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекДанные = Элементы.ЗначениеТабличногоАтрибута.ТекущиеДанные;
	Если НоваяСтрока Тогда 
		ТекДанные.СтатусНаследования = 1;
		ТекДанные.ИДСтроки = НайтиНовыйИД(Объект.СтрокиТабличныхАтрибутов, "ИДСтроки");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеТабличногоАтрибутаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НоваяСтрока И ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.ЗначениеТабличногоАтрибута.ТекущиеДанные;
	
	СтруктураПоиска = Новый Структура(
		"ИДСтрокиРодителя, АтрибутКласса, ИДСтроки", 0, ТекСписочныйАтрибут, ТекДанные.ИДСтроки);
	НайденоСтроки = Объект.СтрокиТабличныхАтрибутов.НайтиСтроки(СтруктураПоиска);	
	
	Если НайденоСтроки.Количество() > 0 Тогда
		СтрокаТабличногоАтрибута = НайденоСтроки[0];
	ИначеЕсли НЕ ОтменаРедактирования Тогда
		СтрокаТабличногоАтрибута = Объект.СтрокиТабличныхАтрибутов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТабличногоАтрибута, СтруктураПоиска);
	КонецЕсли;
	
	// Заполняем источник значений.
	Если НЕ СтрокаТабличногоАтрибута = Неопределено 
			И НЕ ЗначениеЗаполнено(СтрокаТабличногоАтрибута.ИсточникЗначений) Тогда
		НайденоДанныеАтрибута = Объект.Атрибуты.НайтиСтроки(Новый Структура("АтрибутКласса", ТекСписочныйАтрибут));
		СтрокаТабличногоАтрибута.ИсточникЗначений = НайденоДанныеАтрибута[0].ИсточникЗначений;
	КонецЕсли;
	
	Если НЕ ОтменаРедактирования Тогда
		СтрокаТабличногоАтрибута.СтатусНаследования = ТекДанные.СтатусНаследования;
		СтрокаТабличногоАтрибута.Порядок            = ЗначениеТабличногоАтрибута.Индекс(ТекДанные);
	КонецЕсли;
	
	ПоместитьЗначенияАтрибутовСтрокВДанныеОбработки(ТекДанные, ОтменаРедактирования, 0, ТекСписочныйАтрибут, 2); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеТабличногоАтрибутаПриИзменении(Элемент)
	
	ЗаполнитьПорядокСтрокТабличныхАтрибутов(ЗначениеТабличногоАтрибута, 0, ТекСписочныйАтрибут)
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеТабличногоАтрибутаПередУдалением(Элемент, Отказ)
	
	Выбраны = Элементы.ЗначениеТабличногоАтрибута.ВыделенныеСтроки;
	УдалитьВыбранныеСтрокиТабличногоАтрибута(ЗначениеТабличногоАтрибута, Выбраны, 0, ТекСписочныйАтрибут);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыТехКарты

&НаКлиенте
Процедура ТехКартыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекДанные = Элементы.ТехКарты.ТекущиеДанные;
	Если НоваяСтрока Тогда 
		ТекДанные.СтатусНаследования = 1;
		ТекДанные.ИДСтроки = НайтиНовыйИД(Объект.СтрокиТабличныхАтрибутов, "ИДСтроки");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТехКартыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НоваяСтрока И ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.ТехКарты.ТекущиеДанные;
	
	АтрибутТехКарты = ПредопределенноеЗначение("ПланВидовХарактеристик.АтрибутыКласса.ТехКарты");
	СтруктураПоиска = Новый Структура(
		"ИДСтрокиРодителя, АтрибутКласса, ИДСтроки", 0, АтрибутТехКарты, ТекДанные.ИДСтроки);
	НайденоСтроки = Объект.СтрокиТабличныхАтрибутов.НайтиСтроки(СтруктураПоиска);
	
	Если НайденоСтроки.Количество() > 0 Тогда
		СтрокаТабличногоАтрибута = НайденоСтроки[0];
	ИначеЕсли НЕ ОтменаРедактирования Тогда
		СтрокаТабличногоАтрибута = Объект.СтрокиТабличныхАтрибутов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТабличногоАтрибута, СтруктураПоиска);
		СтрокаТабличногоАтрибута.ИсточникЗначений = 
			ПредопределенноеЗначение("Справочник.Классы.ТехнологическиеКарты");
	КонецЕсли;
	
	Если НЕ ОтменаРедактирования Тогда
		ЗаполнитьЗначенияСвойств(СтрокаТабличногоАтрибута, ТекДанные, "ИДСтроки, Наименование, СтатусНаследования");
		СтрокаТабличногоАтрибута.АтрибутКласса = АтрибутТехКарты;
		СтрокаТабличногоАтрибута.Порядок       = ЗначениеТабличногоАтрибута.Индекс(ТекДанные);
	ИначеЕсли НЕ СтрокаТабличногоАтрибута = Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ТекДанные, СтрокаТабличногоАтрибута, "Наименование");
	КонецЕсли;
	
	ПоместитьЗначенияАтрибутовСтрокВДанныеОбработки(ТекДанные, ОтменаРедактирования, 0, АтрибутТехКарты, 1);
	
	// Заполняем наименование типа тех.карты.
	Если НЕ ОтменаРедактирования Тогда
		АтрибутТипТехкарты = ПредопределенноеЗначение("ПланВидовХарактеристик.АтрибутыКласса.ТипТехКарты");
		СоответствиеКолонок = ПолучитьСоответствиеКолонокПодчиненныхОбъектов(1, КолонкиАтрибутовПодчиненныхОбъектов);
		СтрокаКолонка = СоответствиеКолонок[АтрибутТипТехкарты];
		ТипТехКарты = ТекДанные[СтрокаКолонка.ИмяКолонки];
		Если ЗначениеЗаполнено(ТипТехКарты) Тогда
			ТекДанные.НаименованиеТипа = Строка(ТипТехКарты);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТехКартыПриИзменении(Элемент)
	
	ЗаполнитьПорядокСтрокТабличныхАтрибутов(ТехКарты, 0, 
		ПредопределенноеЗначение("ПланВидовХарактеристик.АтрибутыКласса.ТехКарты"));
	
КонецПроцедуры

&НаКлиенте
Процедура ТехКартыПередУдалением(Элемент, Отказ)
	
	Выбраны = Элементы.ТехКарты.ВыделенныеСтроки;
	УдалитьВыбранныеСтрокиТабличногоАтрибута(ТехКарты, Выбраны, 0, 
		ПредопределенноеЗначение("ПланВидовХарактеристик.АтрибутыКласса.ТехКарты"));
	
КонецПроцедуры

&НаКлиенте
Процедура ТехКартыПослеУдаления(Элемент)
	
	Если Элементы.ТехКарты.ТекущаяСтрока = Неопределено Тогда
		ТекТехКарта = -1;
		ТекОперация = -1;
		Элементы.СоставТехКарты.ТолькоПросмотр = Истина;
		Элементы.ПереключательТабличныхАтрибутовТехКарт.ТолькоПросмотр = Истина;
		Элементы.ГруппаКомандыДобавленияОпераций.Доступность = Ложь;
		ЗначениеТабличногоАтрибута.Очистить();
		
		Если ТекТаблицаТехКарты = ПредопределенноеЗначение("ПланВидовХарактеристик.АтрибутыКласса.ТехОперации") Тогда
			ВывестиСоставТехКартыНаСервере(ТекТехКарта);
		Иначе
			ВывестиТаблицуВложенногоАтрибута("ЗначениеТабличногоАтрибута", ТекТехКарта, ТекТаблицаТехКарты, 2);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТехКартыПриАктивизацииСтроки(Элемент)
	
	Если НЕ ТекСписочныйАтрибут = ПредопределенноеЗначение("ПланВидовХарактеристик.АтрибутыКласса.ТехКарты") Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.ТехКарты.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		ТекТехКарта = -1;
		ТекОперация = -1;
		Элементы.СоставТехКарты.ТолькоПросмотр = Истина;
		Элементы.ПереключательТабличныхАтрибутовТехКарт.ТолькоПросмотр = Истина;
		Элементы.ГруппаКомандыДобавленияОпераций.Доступность = Ложь;
		ЗначениеТабличногоАтрибута.Очистить();
	Иначе
		Если ТекДанные.ИДСтроки = 0 Тогда
			ТекДанные.ИДСтроки = НайтиНовыйИД(Объект.СтрокиТабличныхАтрибутов, "ИДСтроки");
		КонецЕсли;
		Если ТекТехКарта = ТекДанные.ИДСтроки Тогда
			Возврат;
		КонецЕсли;
		ТекТехКарта = ТекДанные.ИДСтроки;
		ТекОперация = -1;
		
		Элементы.СоставТехКарты.ТолькоПросмотр = НЕ Редактирование;
		Элементы.ПереключательТабличныхАтрибутовТехКарт.ТолькоПросмотр = Ложь;
		Элементы.ГруппаКомандыДобавленияОпераций.Доступность = Редактирование;
	КонецЕсли;
	
	Если ТекТаблицаТехКарты = ПредопределенноеЗначение("ПланВидовХарактеристик.АтрибутыКласса.ТехОперации") Тогда
		ВывестиСоставТехКартыНаСервере(ТекТехКарта);
	Иначе
		ВывестиТаблицуВложенногоАтрибута("ЗначениеТабличногоАтрибута", ТекТехКарта, ТекТаблицаТехКарты, 2);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТехКартыТипТехКартыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОтбора = Новый Структура("Класс, ЭтоГруппа", ПредопределенноеЗначение("Справочник.Классы.ТипыТехКарт"), Ложь);
	
	ПараметрыВыбора = Новый Структура();
	ПараметрыВыбора.Вставить("Отбор", ПараметрыОтбора);
	
	ФормаВыбора = ПолучитьФорму("Справочник.НоменклатураКласса.ФормаВыбора", ПараметрыВыбора, Элемент, УникальныйИдентификатор);
	ФормаВыбора.Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	
	ФормаВыбора.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СоставТехКартыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если НЕ Элемент.ТекущаяСтрока = Неопределено Тогда
		Отказ = Истина;
		ЭлементыДерева = СоставТехКарты.ПолучитьЭлементы();
		
		НоваяСтрока = ЭлементыДерева.Добавить();
		НоваяСтрока.СтатусНаследования = 1;
		НоваяСтрока.ИДСтроки = НайтиНовыйИД(Объект.СтрокиТабличныхАтрибутов, "ИДСтроки");
		НоваяСтрока.ОбъектОперации = Объект.Класс.Ссылка;
		
		Элемент.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		Элемент.ИзменитьСтроку();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставТехКартыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекДанные = Элементы.СоставТехКарты.ТекущиеДанные;
	Если НоваяСтрока Тогда 
		ТекДанные.СтатусНаследования = 1;
		ТекДанные.ИДСтроки = НайтиНовыйИД(Объект.СтрокиТабличныхАтрибутов, "ИДСтроки");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставТехКартыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НоваяСтрока И ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанныеТехКарты = Элементы.ТехКарты.ТекущиеДанные;
	Если ТекДанныеТехКарты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.СоставТехКарты.ТекущиеДанные;
	
	АтрибутТехОперации = ПредопределенноеЗначение("ПланВидовХарактеристик.АтрибутыКласса.ТехОперации");
	СтруктураПоиска = Новый Структура(
		"ИДСтрокиРодителя, АтрибутКласса, ИДСтроки", ТекДанныеТехКарты.ИДСтроки, АтрибутТехОперации, ТекДанные.ИДСтроки);
	НайденоСтроки = Объект.СтрокиТабличныхАтрибутов.НайтиСтроки(СтруктураПоиска);
	
	Если НайденоСтроки.Количество() > 0 Тогда
		СтрокаТабличногоАтрибута = НайденоСтроки[0];
	ИначеЕсли НЕ ОтменаРедактирования Тогда
		СтрокаТабличногоАтрибута = Объект.СтрокиТабличныхАтрибутов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТабличногоАтрибута, СтруктураПоиска);
		СтрокаТабличногоАтрибута.ИсточникЗначений = ?(ТекДанные.ТипСтроки = 0,
			ПредопределенноеЗначение("Справочник.Классы.СтрокиТехОпераций"),
			ПредопределенноеЗначение("Справочник.Классы.ВложенныеТехКарты"));
	КонецЕсли;
	
	Если НЕ ОтменаРедактирования Тогда
		ЭлементыТехКарты = СоставТехКарты.ПолучитьЭлементы();
		ЗаполнитьЗначенияСвойств(СтрокаТабличногоАтрибута, ТекДанные, "ИДСтроки, Наименование, СтатусНаследования");
		СтрокаТабличногоАтрибута.АтрибутКласса = АтрибутТехОперации;
		СтрокаТабличногоАтрибута.Порядок       = ЭлементыТехКарты.Индекс(ТекДанные);
	КонецЕсли;
	
	ПоместитьЗначенияАтрибутовСтрокВДанныеОбработки(ТекДанные, ОтменаРедактирования, ТекДанныеТехКарты.ИДСтроки, АтрибутТехОперации, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставТехКартыПриИзменении(Элемент)
	
	// Настройка порядка строк.
	ТекДанныеТехКарты = Элементы.ТехКарты.ТекущиеДанные;
	Если ТекДанныеТехКарты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементыДерева = СоставТехКарты.ПолучитьЭлементы();
	ЗаполнитьПорядокСтрокТабличныхАтрибутов(ЭлементыДерева, ТекДанныеТехКарты.ИДСтроки, 
		ПредопределенноеЗначение("ПланВидовХарактеристик.АтрибутыКласса.ТехОперации"));
	
КонецПроцедуры

&НаКлиенте
Процедура СоставТехКартыПередУдалением(Элемент, Отказ)
	
	Выбраны = Элементы.СоставТехКарты.ВыделенныеСтроки;
	
	УдалитьТехОперацию(Выбраны);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставТехКартыПриАктивизацииСтроки(Элемент)
	
	Если Элементы.ПереключательТабличныхАтрибутовОпераций.СписокВыбора.Количество() = 0 
			ИЛИ НЕ ЗначениеЗаполнено(ТекТаблицаОперации) 
			ИЛИ НЕ ТекСписочныйАтрибут = ПредопределенноеЗначение("ПланВидовХарактеристик.АтрибутыКласса.ТехКарты") Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.СоставТехКарты.ТекущиеДанные;
	Если НЕ ТекДанные = Неопределено И ТекОперация = ТекДанные.ИДСтроки Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ТекДанные = Неопределено Тогда
		ТекОперация = ТекДанные.ИДСтроки;
	КонецЕсли;
	
	Если ТекДанные = Неопределено ИЛИ ТекДанные.ТипСтроки > 0 Тогда
		Элементы.ЗначениеТабличногоАтрибутаОперации.ТолькоПросмотр = Истина;
		Элементы.ПереключательТабличныхАтрибутовОпераций.ТолькоПросмотр = Истина;
		ЗначениеТабличногоАтрибута.Очистить();
		ТекОперация = -1;
	Иначе
		Элементы.ЗначениеТабличногоАтрибутаОперации.ТолькоПросмотр      = НЕ Редактирование;
		Элементы.ПереключательТабличныхАтрибутовОпераций.ТолькоПросмотр = Ложь;
		ВывестиТаблицуВложенногоАтрибута("ЗначениеТабличногоАтрибута", ТекДанные.ИДСтроки, ТекТаблицаОперации, 2);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставТехКартыОбъектОперацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	АдресДерева = ПоместитьТаблицуУзловойСтруктурыВоВременноеХранилище();
	ПараметрыВыбора = Новый Структура("АдресДерева, КартинкаСтрок, ТекущаяСтрока, Заголовок",
		АдресДерева, БиблиотекаКартинок.КартинкиДереваТехОпераций, Элементы.СоставТехКарты.ТекущиеДанные.ОбъектОперации,
		НСтр("ru='Выбор объекта операции'"));
	ОткрытьФорму("Обработка.РедактированиеКлассов.Форма.ФормаВыбораПоДереву", 
		ПараметрыВыбора, Элемент, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставТехКартыВидОперацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОтбора = Новый Структура("Класс, ЭтоГруппа", ПредопределенноеЗначение("Справочник.Классы.ВидыТехОпераций"), Ложь);
	
	ПараметрыВыбора = Новый Структура();
	ПараметрыВыбора.Вставить("Отбор", ПараметрыОтбора);
	
	ФормаВыбора = ПолучитьФорму("Справочник.НоменклатураКласса.ФормаВыбора", ПараметрыВыбора, Элемент, УникальныйИдентификатор);
	ФормаВыбора.Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	
	ФормаВыбора.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ВсеВидыОперацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ТехКарты.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ДобавитьТехОперацию(ВыбраннаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеОперацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ДоступныеОперации.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекДанные.ТипСтроки > 1 Тогда
		ОбъектОперации = ТекДанные.ПолучитьРодителя().Объект;
		ДобавитьТехОперацию(ТекДанные.Объект, ОбъектОперации, ?(ТекДанные.ТипСтроки = 2, 0, 2));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключательТабличныхАтрибутовОперацийПриИзменении(Элемент)
	
	Найдено = СписочныеАтрибуты.НайтиСтроки(
		Новый Структура("ТипОбъекта, ИДАтрибута", 1, ПереключательТабличныхАтрибутовОпераций));
	ТекТаблицаОперации = Найдено[0].АтрибутКласса;
	ПодготовитьТаблицуВложенногоАтрибута(Найдено[0].ИсточникЗначений, "ЗначениеТабличногоАтрибутаОперации");
	
	ТекДанные = Элементы.СоставТехКарты.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Элементы.ЗначениеТабличногоАтрибутаОперации.ТолькоПросмотр = Истина;
		ЗначениеТабличногоАтрибута.Очистить();
	Иначе
		Элементы.ЗначениеТабличногоАтрибутаОперации.ТолькоПросмотр = НЕ Редактирование;
		ВывестиТаблицуВложенногоАтрибута("ЗначениеТабличногоАтрибута", ТекДанные.ИДСтроки, ТекТаблицаОперации, 2);
	КонецЕсли;
	
	Видимость = Элементы.ЗначениеТабличногоАтрибутаОперации.Видимость;
	Если НЕ Видимость Тогда
		Элементы.ЗначениеТабличногоАтрибутаОперации.Видимость = Истина;
		Элементы.СвернутьРазвернутьТабличныеАтрибутыОпераций.Картинка = БиблиотекаКартинок.гкс_ПанельРазвернута;
		
		Элементы.ТехКарты.Видимость = Ложь;
		Элементы.ТехКартыГруппаСтандартныеКоманды.Видимость = Ложь;
		Элементы.ТехКартыСвернутьРазвернутьТехКарты.Картинка = БиблиотекаКартинок.гкс_ПанельСвернута;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеТабличногоАтрибутаОперацииПриИзменении(Элемент)
	
	ТекДанные = Элементы.СоставТехКарты.ТекущиеДанные;
	Если НЕ ТекДанные = Неопределено Тогда
		ЗаполнитьПорядокСтрокТабличныхАтрибутов(ЗначениеТабличногоАтрибута, ТекДанные.ИДСтроки, ТекТаблицаОперации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеТабличногоАтрибутаОперацииПередУдалением(Элемент, Отказ)
	
	ТекДанные = Элементы.СоставТехКарты.ТекущиеДанные;
	Если НЕ ТекДанные = Неопределено Тогда
		Выбраны = Элементы.ЗначениеТабличногоАтрибутаОперации.ВыделенныеСтроки;
		УдалитьВыбранныеСтрокиТабличногоАтрибута(ЗначениеТабличногоАтрибута, Выбраны, ТекДанные.ИДСтроки, ТекТаблицаОперации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеТабличногоАтрибутаОперацииПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекДанные = Элементы.ЗначениеТабличногоАтрибутаОперации.ТекущиеДанные;
	Если НоваяСтрока Тогда 
		ТекДанные.СтатусНаследования = 1;
		ТекДанные.ИДСтроки = НайтиНовыйИД(Объект.СтрокиТабличныхАтрибутов, "ИДСтроки");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеТабличногоАтрибутаОперацииПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НоваяСтрока И ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанныеОперации = Элементы.СоставТехКарты.ТекущиеДанные;
	Если ТекДанныеОперации = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.ЗначениеТабличногоАтрибутаОперации.ТекущиеДанные;
	
	СтруктураПоиска = Новый Структура(
		"ИДСтрокиРодителя, АтрибутКласса, ИДСтроки", ТекДанныеОперации.ИДСтроки, ТекТаблицаОперации, ТекДанные.ИДСтроки);
	НайденоСтроки = Объект.СтрокиТабличныхАтрибутов.НайтиСтроки(СтруктураПоиска);
	
	Если НайденоСтроки.Количество() > 0 Тогда
		СтрокаТабличногоАтрибута = НайденоСтроки[0];
	ИначеЕсли НЕ ОтменаРедактирования Тогда
		СтрокаТабличногоАтрибута = Объект.СтрокиТабличныхАтрибутов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТабличногоАтрибута, СтруктураПоиска);
	КонецЕсли;
	
	// Заполняем источник значений.
	Если НЕ СтрокаТабличногоАтрибута = Неопределено 
			И НЕ ЗначениеЗаполнено(СтрокаТабличногоАтрибута.ИсточникЗначений) Тогда
		НайденоДанныеАтрибута = СписочныеАтрибуты.НайтиСтроки(Новый Структура("ТипОбъекта, АтрибутКласса", 1, ТекТаблицаОперации));
		СтрокаТабличногоАтрибута.ИсточникЗначений = НайденоДанныеАтрибута[0].ИсточникЗначений;
	КонецЕсли;
	
	Если НЕ ОтменаРедактирования Тогда
		ЗаполнитьЗначенияСвойств(СтрокаТабличногоАтрибута, ТекДанные, "ИДСтроки, СтатусНаследования");
		СтрокаТабличногоАтрибута.Порядок = ЗначениеТабличногоАтрибута.Индекс(ТекДанные);
	КонецЕсли;
	
	ПоместитьЗначенияАтрибутовСтрокВДанныеОбработки(ТекДанные, ОтменаРедактирования, ТекДанныеОперации.ИДСтроки, ТекТаблицаОперации, 2);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключательТабличныхАтрибутовТехКартПриИзменении(Элемент)
	
	Найдено = СписочныеАтрибуты.НайтиСтроки(
		Новый Структура("ТипОбъекта, ИДАтрибута", 1, ПереключательТабличныхАтрибутовОпераций));
	ТекТаблицаТехКарты = Найдено[0].АтрибутКласса;
	
	ПодготовитьВложеннуюТаблицуТехкарт();
	
	Если ТекТаблицаТехКарты = ПредопределенноеЗначение("ПланВидовХарактеристик.АтрибутыКласса.ТехОперации") Тогда
		ВывестиСоставТехКартыНаСервере(ТекТехКарта);
		
		Элементы.ГруппаСтраницыТабЧастейТехКарты.ТекущаяСтраница = Элементы.ГруппаТехОперации;
	Иначе
		Если ТекТехКарта >= 0 Тогда
			ВывестиТаблицуВложенногоАтрибута("ЗначениеТабличногоАтрибута", ТекТехКарта, ТекТаблицаТехКарты, 2);
		КонецЕсли;
		
		Элементы.ГруппаСтраницыТабЧастейТехКарты.ТекущаяСтраница = Элементы.ГруппаВложенныеТабличныеЧастиТехКарты;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеТабличногоАтрибутаТехКартыПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТехКарты.ТекущиеДанные;
	Если НЕ ТекДанные = Неопределено Тогда
		ЗаполнитьПорядокСтрокТабличныхАтрибутов(ЗначениеТабличногоАтрибута, ТекДанные.ИДСтроки, ТекТаблицаТехКарты);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеТабличногоАтрибутаТехКартыПередУдалением(Элемент, Отказ)
	
	ТекДанные = Элементы.ТехКарты.ТекущиеДанные;
	Если НЕ ТекДанные = Неопределено Тогда
		Выбраны = Элементы.ЗначениеТабличногоАтрибутаТехКарты.ВыделенныеСтроки;
		УдалитьВыбранныеСтрокиТабличногоАтрибута(ЗначениеТабличногоАтрибута, Выбраны, ТекДанные.ИДСтроки, ТекТаблицаТехКарты);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеТабличногоАтрибутаТехКартыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекДанные = Элементы.ЗначениеТабличногоАтрибутаТехКарты.ТекущиеДанные;
	Если НоваяСтрока Тогда 
		ТекДанные.СтатусНаследования = 1;
		ТекДанные.ИДСтроки = НайтиНовыйИД(Объект.СтрокиТабличныхАтрибутов, "ИДСтроки");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеТабличногоАтрибутаТехКартыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НоваяСтрока И ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанныеТехКарты = Элементы.ТехКарты.ТекущиеДанные;
	Если ТекДанныеТехКарты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.ЗначениеТабличногоАтрибутаТехКарты.ТекущиеДанные;
	
	СтруктураПоиска = Новый Структура(
		"ИДСтрокиРодителя, АтрибутКласса, ИДСтроки", ТекДанныеТехКарты.ИДСтроки, ТекТаблицаТехКарты, ТекДанные.ИДСтроки);
	НайденоСтроки = Объект.СтрокиТабличныхАтрибутов.НайтиСтроки(СтруктураПоиска);
	
	Если НайденоСтроки.Количество() > 0 Тогда
		СтрокаТабличногоАтрибута = НайденоСтроки[0];
	ИначеЕсли НЕ ОтменаРедактирования Тогда
		СтрокаТабличногоАтрибута = Объект.СтрокиТабличныхАтрибутов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТабличногоАтрибута, СтруктураПоиска);
	КонецЕсли;
	
	// Заполняем источник значений.
	Если НЕ СтрокаТабличногоАтрибута = Неопределено 
			И НЕ ЗначениеЗаполнено(СтрокаТабличногоАтрибута.ИсточникЗначений) Тогда
		НайденоДанныеАтрибута = СписочныеАтрибуты.НайтиСтроки(Новый Структура("ТипОбъекта, АтрибутКласса", 2, ТекТаблицаТехКарты));
		СтрокаТабличногоАтрибута.ИсточникЗначений = НайденоДанныеАтрибута[0].ИсточникЗначений;
	КонецЕсли;
	
	Если НЕ ОтменаРедактирования Тогда
		ЗаполнитьЗначенияСвойств(СтрокаТабличногоАтрибута, ТекДанные, "ИДСтроки, СтатусНаследования");
		СтрокаТабличногоАтрибута.Порядок = ЗначениеТабличногоАтрибута.Индекс(ТекДанные);
	КонецЕсли;
	
	ПоместитьЗначенияАтрибутовСтрокВДанныеОбработки(ТекДанные, ОтменаРедактирования, ТекДанныеТехКарты.ИДСтроки, ТекТаблицаТехКарты, 2);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаНеНаследоватьАтрибут(Команда)
	
	ТекДанные = Элементы.Атрибуты.ТекущиеДанные;
	Если ТекДанные = Неопределено ИЛИ ТекДанные.СтатусНаследования = 4 Тогда 
		Возврат;
	КонецЕсли;
	
	УдалитьАтрибут(3); // Построчно, удалять только унаследованные.
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНаследоватьАтрибут(Команда)
	
	ТекДанные = Элементы.Атрибуты.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Изменено = Ложь;
	ЭтоСтрока = ТекДанные.ТипЗначения.СодержитТип(Тип("Строка"));
	
	КолВоАтрибутов = Элементы.Атрибуты.ВыделенныеСтроки.Количество();
	Если КолВоАтрибутов = 1 И ТекДанные.СтатусНаследования = 4 Тогда
		ТекДанные.СтатусНаследования = 3;
		ПараметрыЗаполнения = ПолучитьЗначениеАтрибута(ТекДанные.АтрибутКласса);
		ЗаполнитьЗначенияСвойств(ТекДанные, ПараметрыЗаполнения);
		Если НЕ ЭтоСтрока И (ТекДанные.МножественноеЗначение ИЛИ ТекДанные.СписокДоступныхЗначений) Тогда
			ДобавитьСписочныйАтрибут(ТекДанные.АтрибутКласса, ТекДанные.КлассТабличнаяЧасть, ТекДанные.ИсточникЗначений);
		КонецЕсли;
		Изменено = Истина;
	ИначеЕсли КолВоАтрибутов > 1 Тогда
		Для Каждого ИДСтроки ИЗ Элементы.Атрибуты.ВыделенныеСтроки Цикл
			СтрокаТЧ = Объект.Атрибуты.НайтиПоИдентификатору(ИДСтроки);
			Если СтрокаТЧ.СтатусНаследования = 4 Тогда
				СтрокаТЧ.СтатусНаследования = 3;
				ПараметрыЗаполнения = ПолучитьЗначениеАтрибута(СтрокаТЧ.АтрибутКласса);
				ЗаполнитьЗначенияСвойств(СтрокаТЧ, ПараметрыЗаполнения);
				Если НЕ ЭтоСтрока И (СтрокаТЧ.МножественноеЗначение ИЛИ СтрокаТЧ.СписокДоступныхЗначений) Тогда
					ДобавитьСписочныйАтрибут(СтрокаТЧ.АтрибутКласса, СтрокаТЧ.КлассТабличнаяЧасть, СтрокаТЧ.ИсточникЗначений);
				КонецЕсли;
				Изменено = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	НастроитьОтображениеДанныхАтрибута(Объект, Элементы, ТекРежимЗаполненияАтрибутаШаблона, Редактирование);
	Модифицированность = Модифицированность ИЛИ Изменено;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВложенныйАтрибут(Команда)
	
	ТекДанные = Элементы.Атрибуты.ТекущиеДанные;
	Если ТекДанные = Неопределено 
			ИЛИ ТекДанные.МножественноеЗначение
			ИЛИ НЕ ТекДанные.НуженИсточникЗначений
			ИЛИ НЕ ТипЗнч(ТекДанные.АтрибутКласса) = Тип("ПланВидовХарактеристикСсылка.АтрибутыКласса")
			ИЛИ НЕ ЗначениеЗаполнено(ТекДанные.ИсточникЗначений) Тогда
		Возврат;
	КонецЕсли;
	
	СписокВыбора = ПолучитьСписокВложенныхАтрибутов(ТекДанные.ИсточникЗначений);
	Если НЕ СписокВыбора = Неопределено Тогда
		ТекущийЭлемент = Элементы.АтрибутыАтрибутКласса;
		ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьВложенныйАтрибутЗавершение", ЭтаФорма, ТекДанные.АтрибутКласса);
		ПоказатьВыборИзСписка(ОписаниеОповещения, СписокВыбора, Элементы.Атрибуты);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУдалитьАтрибут(Команда)
	УдалитьАтрибут(1); // Построчно, без учета новых, добавленных из наборов.
КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавитьАтрибут(Команда)
	
	ТекСтрока = Элементы.ВсеАтрибуты.ТекущаяСтрока;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураАтрибутов = ПолучитьАтрибутыШаблонов(Объект.ШаблонКодаКласса, Объект.ШаблонНаименованияКласса, 
		Объект.ШаблонКодаНоменклатуры, Объект.ШаблонНаименованияНоменклатуры, 
		Объект.ШаблонКодаОбъекта, Объект.ШаблонНаименованияОбъекта);
	
	Если Элементы.ВсеАтрибуты.ВыделенныеСтроки.Количество() > 1 Тогда
		Для Каждого АтрибутКласса ИЗ Элементы.ВсеАтрибуты.ВыделенныеСтроки Цикл
			ДобавитьАтрибут(АтрибутКласса, СтруктураАтрибутов.АтрибутыШаблонаКласса, 
				СтруктураАтрибутов.АтрибутыШаблонаНоменклатуры, СтруктураАтрибутов.АтрибутыШаблонаОбъекта);
		КонецЦикла;
	Иначе
		ДобавитьАтрибут(ТекСтрока, СтруктураАтрибутов.АтрибутыШаблонаКласса, 
			СтруктураАтрибутов.АтрибутыШаблонаНоменклатуры, СтруктураАтрибутов.АтрибутыШаблонаОбъекта);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНаследоватьЗначение(Команда)
	
	ТекДанные = Элементы.ЗначенияСписочногоАтрибута.ТекущиеДанные;
	Если ТекДанные = Неопределено ИЛИ НЕ ТекДанные.СтатусНаследования = 4 Тогда 
		Возврат;
	КонецЕсли;
	
	ТекРодитель = ТекДанные.ПолучитьРодителя();
	// Если родитель ненаследуемый, то подчиненный не может быть наследуемым.
	Если НЕ ТекРодитель = Неопределено И ТекРодитель.СтатусНаследования > 3 Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные.СтатусНаследования = 3;
	ТекДанные.ДоступноеЗначение = ТекДанные.ДоступноеЗначениеНаследуемое;
	
	УстановитьСтатусНаследованияДляПодчиненных(ТекДанные);
	
	Найдено = Объект.ЗначенияСписочныхАтрибутов.НайтиСтроки(
		Новый Структура("АтрибутКласса, ЗначениеАтрибутаКласса", ТекСписочныйАтрибут, ТекДанные.ЗначениеАтрибутаКласса));
	Если Найдено.Количество() > 0 Тогда
		Найдено[0].СтатусНаследования   = ТекДанные.СтатусНаследования;
		Найдено[0].ДоступноеЗначение    = Истина;
		Найдено[0].ИспользуемоеЗначение = ТекДанные.ИспользуемоеЗначение;
	КонецЕсли;
	
	НастроитьКомандыУправленияЗначениямиСписочногоАтрибута(Объект, Элементы, ТекДанные, Редактирование);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНеНаследоватьЗначение(Команда)
	
	ТекДанные = Элементы.ЗначенияСписочногоАтрибута.ТекущиеДанные;
	Если ТекДанные = Неопределено ИЛИ НЕ ТекДанные.СтатусНаследования = 3 Тогда 
		Возврат;
	КонецЕсли;
	
	ТекДанные.СтатусНаследования = 4;
	
	ТекРодитель = ТекДанные.ПолучитьРодителя();
	Если НЕ ТекДанные.МожноИзменятьДоступноеЗначение Тогда
		ТекДанные.ДоступноеЗначение = Ложь;
		ТекДанные.ИспользуемоеЗначение = Ложь;
		
		УстановитьСтатусНаследованияДляПодчиненных(ТекДанные);
	КонецЕсли;
	
	Найдено = Объект.ЗначенияСписочныхАтрибутов.НайтиСтроки(
		Новый Структура("АтрибутКласса, ЗначениеАтрибутаКласса", ТекСписочныйАтрибут, ТекДанные.ЗначениеАтрибутаКласса));
	Если Найдено.Количество() > 0 Тогда
		СтрокаАтрибута = Найдено[0];
		СтрокаАтрибута.СтатусНаследования   = ТекДанные.СтатусНаследования;
		СтрокаАтрибута.ДоступноеЗначение    = ТекДанные.ДоступноеЗначение И ТекДанные.МожноИзменятьДоступноеЗначение;
		СтрокаАтрибута.ИспользуемоеЗначение = ТекДанные.ИспользуемоеЗначение;
		
	ИначеЕсли ТекРодитель.СтатусНаследования = 3 И НЕ ТекРодитель.МожноИзменятьДоступноеЗначение Тогда
		СтрокаАтрибута = Объект.ЗначенияСписочныхАтрибутов.Добавить();
		
		СтрокаАтрибута.АтрибутКласса          = ТекСписочныйАтрибут;
		СтрокаАтрибута.ЗначениеАтрибутаКласса = ТекДанные.ЗначениеАтрибутаКласса;
		СтрокаАтрибута.СтатусНаследования     = ТекДанные.СтатусНаследования;
		
		СтрокаАтрибута.ДоступноеЗначение    = Ложь;
		СтрокаАтрибута.ИспользуемоеЗначение = Ложь;
	КонецЕсли;	
	
	НастроитьКомандыУправленияЗначениямиСписочногоАтрибута(Объект, Элементы, ТекДанные, Редактирование);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУдалитьТехКарту(Команда)
	
	ТекСтрока = Элементы.ТехКарты.ТекущаяСтрока;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.ТехКарты.ТекущиеДанные;
	Если ТекДанные.Новая Тогда
		ШаблонВопроса = НСтр("ru='Удалить новую тех.карту %1? Состав тех.карты будет утерян.'");
	Иначе
		ШаблонВопроса = НСтр("ru='Удалить тех.карту %1? Несохраненные изменения будут утеряны.'");
	КонецЕсли;
	ТекстВопроса = УправлениеНСИФункцииКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
		ШаблонВопроса, Строка(ТекДанные.ТипТехКарты));
	ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьТехКартуЗавершение", ЭтаФорма, ТекСтрока);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавитьТехОперацию(Команда)
	
	Если Элементы.ГруппаСтарницыРежимовПодбораОпераций.ТекущаяСтраница = Элементы.ГруппаВсеВидыОперацийПоСправочнику Тогда
		ВидОперации = Элементы.ВсеВидыОпераций.ТекущаяСтрока;
		ТекДанные = Элементы.ТехКарты.ТекущиеДанные;
		Если ВидОперации = Неопределено ИЛИ ТекДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ОбъектОперации = Объект.Класс.Ссылка;
		ТипСтроки = 0;
	Иначе
		ТекДанные = Элементы.ДоступныеОперации.ТекущиеДанные;
		Если ТекДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если ТекДанные.ТипСтроки > 1 Тогда
			ВидОперации = ТекДанные.Объект;
			ОбъектОперации = ТекДанные.ПолучитьРодителя().Объект;
			ТипСтроки = ?(ТекДанные.ТипСтроки = 2, 0, 2);
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ДобавитьТехОперацию(ВидОперации, ОбъектОперации, ТипСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУдалитьТехОперацию(Команда)
	
	Выбраны = Элементы.СоставТехКарты.ВыделенныеСтроки;
	
	УдалитьТехОперацию(Выбраны, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзменения(Команда)
	ЗаписатьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьКласс(Команда)
	
	Отказ = Ложь;
	ПроверитьЗаблокироватьРедактированиеКлассаНаСервере(, Отказ);
	
	Если НЕ Отказ Тогда
		Элементы.ГруппаПраваяКолонка.ТолькоПросмотр = Ложь;
		УстановитьРежимТолькоПросмотра(Ложь, ПравоИзменениеКлассов);
		Если ТекСписочныйАтрибут = ПредопределенноеЗначение("ПланВидовХарактеристик.АтрибутыКласса.ТехКарты")
				И ТекТаблицаТехКарты = ПредопределенноеЗначение("ПланВидовХарактеристик.АтрибутыКласса.ТехОперации") 
				И Элементы.ГруппаСтарницыРежимовПодбораОпераций.ТекущаяСтраница = Элементы.ГруппаДоступныеОперации Тогда
			РазвернутьСвернутьДеревоФормы(Элементы.ДоступныеОперации, ДоступныеОперации);
		ИначеЕсли ПереключательАтрибутов > 1 Тогда
			Найдено = СписочныеАтрибуты.НайтиСтроки(Новый Структура("ТипОбъекта, ИДАтрибута", 0, ПереключательАтрибутов));
			Если НЕ ТекСписочныйАтрибут = ПредопределенноеЗначение("ПланВидовХарактеристик.АтрибутыКласса.ТехКарты") 
					И (Найдено.Количество() = 0 ИЛИ НЕ Найдено[0].КлассТабличнаяЧасть) Тогда
				//
				ВывестиЗначенияСписочногоАтрибутаНаСервере(ТекСписочныйАтрибут);
				НастроитьВидимостьЭлементовЗначенийСписочногоАтрибута();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьРедактирование(Команда)
	ОтменитьРедактированиеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПодборОперацийПоСправочнику(Команда)
	
	Элементы.ПодборОперацийПоСправочнику.Пометка = Истина;
	Элементы.ПодборОперацийПоДоступнымОперациям.Пометка = Ложь;
	Элементы.ГруппаСтарницыРежимовПодбораОпераций.ТекущаяСтраница = Элементы.ГруппаВсеВидыОперацийПоСправочнику;
	Элементы.ГруппаКомандыДоступныхОпераций.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборОперацийПоДоступнымОперациям(Команда)
	
	Элементы.ПодборОперацийПоСправочнику.Пометка = Ложь;
	Элементы.ПодборОперацийПоДоступнымОперациям.Пометка = Истина;
	Элементы.ГруппаСтарницыРежимовПодбораОпераций.ТекущаяСтраница = Элементы.ГруппаДоступныеОперации;
	Элементы.ГруппаКомандыДоступныхОпераций.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьКодПоШаблону(Команда)
	
	Отказ = Ложь;
	Если НЕ ЗначениеЗаполнено(Объект.ШаблонКодаРодителя) Тогда
		ТекстСообщения = НСтр("ru='Не возможно сформировать код по шаблону. Не заполнен шаблон кода у класса-родителя.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , , Отказ);
	КонецЕсли;
	Если НЕ Отказ И (НЕ ЗначениеЗаполнено(Объект.Класс.Ссылка) ИЛИ Модифицированность) Тогда
		ТекстСообщения = НСтр("ru='Перед формированием кода по шаблону необходимо записать класс.
			|Записать изменения в классе?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("СформироватьКодПоШаблонуЗавершение", ЭтаФорма), ТекстСообщения, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	Если НЕ Отказ Тогда
		СформироватьКодПоШаблонуНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РазрвернутьВсеОперации(Команда)
	РазвернутьСвернутьДеревоФормы(Элементы.ДоступныеОперации, ДоступныеОперации);
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсеОперации(Команда)
	РазвернутьСвернутьДеревоФормы(Элементы.ДоступныеОперации, ДоступныеОперации, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаНаследованияСтрок(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Класс.Ссылка) ИЛИ НЕ ЗначениеЗаполнено(ТекСписочныйАтрибут) Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		ТекстВопроса = НСтр("ru='Перед настройкой наследования строк необходимо записать изменения класса.
			|Записать изменения?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("НастройкаНаследованияСтрокЗавершение", ЭтаФорма, Истина);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		НастройкаНаследованияСтрокЗавершение(КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьРазвернутьТехКарты(Команда)
	
	Видимость = НЕ Элементы.ТехКарты.Видимость;
	
	Элементы.ТехКарты.Видимость = Видимость;
	Элементы.ТехКартыГруппаСтандартныеКоманды.Видимость = Видимость;
	Элементы.ТехКартыСвернутьРазвернутьТехКарты.Картинка = ?(Видимость,
		БиблиотекаКартинок.гкс_ПанельРазвернута, БиблиотекаКартинок.гкс_ПанельСвернута);
	
	Если Видимость Тогда
		Элементы.ЗначениеТабличногоАтрибутаОперации.Видимость = Ложь;
		Элементы.СвернутьРазвернутьТабличныеАтрибутыОпераций.Картинка = БиблиотекаКартинок.гкс_ПанельСвернута;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьРазвернутьТабличныеАтрибутыОпераций(Команда)
	
	Видимость = НЕ Элементы.ЗначениеТабличногоАтрибутаОперации.Видимость;
	
	Элементы.ЗначениеТабличногоАтрибутаОперации.Видимость = Видимость;
	Элементы.СвернутьРазвернутьТабличныеАтрибутыОпераций.Картинка = ?(Видимость,
		БиблиотекаКартинок.гкс_ПанельРазвернута, БиблиотекаКартинок.гкс_ПанельСвернута);
	
	Если Видимость Тогда
		Элементы.ТехКарты.Видимость = Ложь;
		Элементы.ТехКартыГруппаСтандартныеКоманды.Видимость = Ложь;
		Элементы.ТехКартыСвернутьРазвернутьТехКарты.Картинка = БиблиотекаКартинок.гкс_ПанельСвернута;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьРазвернутьДеревоКлассов(Команда)
	Элементы.ГруппаЛеваяКолонка.Видимость = НЕ Элементы.ГруппаЛеваяКолонка.Видимость;
	Элементы.СвернутьРазвернутьДеревоКлассов.Пометка = Элементы.ГруппаЛеваяКолонка.Видимость;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции управления интерфейсом пользователя

#Область ПроцедурыИФункцииУправленияИнтерфейсомПользователя

&НаКлиенте 
Процедура АтрибутПодчиненногоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НайденоСтроки = КолонкиАтрибутовПодчиненныхОбъектов.НайтиСтроки(Новый Структура("ИмяПоля", Элемент.Имя));
	Если НайденоСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТипОбъектНоменклатуры = Тип("СправочникСсылка.ОбъектыНоменклатуры");
	ТипНоменклатураКласса = Тип("СправочникСсылка.НоменклатураКласса");
	ТипКлассы             = Тип("СправочникСсылка.Классы");
	
	СтрокаАтрибута = НайденоСтроки[0];
	
	ЭтоОбъектНоменклатуры = СтрокаАтрибута.ТипЗначения.СодержитТип(ТипОбъектНоменклатуры);
	ЭтоНоменклатураКласса = СтрокаАтрибута.ТипЗначения.СодержитТип(ТипНоменклатураКласса);
	ЭтоКласс              = СтрокаАтрибута.ТипЗначения.СодержитТип(ТипКлассы);
	
	Если ЭтоКласс ИЛИ ЭтоНоменклатураКласса ИЛИ ЭтоОбъектНоменклатуры Тогда
		
		ТипИсточника  = ?(ЗначениеЗаполнено(СтрокаАтрибута.ИсточникЗначений), ТипЗнч(СтрокаАтрибута.ИсточникЗначений), Неопределено);
		ИсточникКласс = (ТипИсточника = ТипКлассы);
		ИсточникНоменклатура = (ТипИсточника = ТипНоменклатураКласса);
		СоставнойТип = (ЭтоНоменклатураКласса И ИсточникКласс
				ИЛИ ЭтоОбъектНоменклатуры И ИсточникКласс);
		
		Если НЕ СтрокаАтрибута.СписокДоступныхЗначений Тогда
			Если НЕ СоставнойТип Тогда
				Если ЭтоНоменклатураКласса И ИсточникКласс Тогда
					СтандартнаяОбработка = Ложь;
					
					ПараметрыОтбора = Новый Структура("Класс, ЭтоГруппа", СтрокаАтрибута.ИсточникЗначений, Ложь);
					
					ПараметрыВыбора = Новый Структура();
					ПараметрыВыбора.Вставить("Отбор", ПараметрыОтбора);
					
					ФормаВыбора = ПолучитьФорму("Справочник.НоменклатураКласса.ФормаВыбора", ПараметрыВыбора, Элемент, УникальныйИдентификатор);
					ФормаВыбора.Элементы.Список.Отображение = ОтображениеТаблицы.Список;
					
					ФормаВыбора.Открыть();
				КонецЕсли;
			Иначе
				Если ЭтоНоменклатураКласса И ИсточникКласс Тогда
					СтандартнаяОбработка = Ложь;
					
					ФормаВыбора = ПолучитьФорму("Справочник.НоменклатураКласса.ФормаВыбора", , Элемент, УникальныйИдентификатор);
					
					УправлениеНСИФункцииКлиентСерверПереопределяемый.УстановитьЭлементОтбораДинамическогоСписка(ФормаВыбора.Список, 
						"Класс", СтрокаАтрибута.ИсточникЗначений, ВидСравненияКомпоновкиДанных.ВИерархии,, Истина);
					ФормаВыбора.Элементы.Список.РодительВерхнегоУровня = 
						ПолучитьРодителяПоКлассу(СтрокаАтрибута.ИсточникЗначений);
					
					ФормаВыбора.Открыть();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаписатьНаСервере();
		Закрыть();
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда 
		Модифицированность = Ложь;
		Если ЗначениеЗаполнено(Объект.Класс.Ссылка) Тогда
			СнятьБлокировкуКласса();
		КонецЕсли;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АтрибутыПередУдалениемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	Для Каждого СтрокаТЧ ИЗ ДополнительныеПараметры.СтрокиКУдалению Цикл
		// Защита от ошибки.
		Если Объект.Атрибуты.НайтиПоИдентификатору(СтрокаТЧ.ПолучитьИдентификатор()) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТЧ.МножественноеЗначение ИЛИ СтрокаТЧ.СписокДоступныхЗначений Тогда
			Найдено = СписочныеАтрибуты.НайтиСтроки(Новый Структура("ТипОбъекта, АтрибутКласса", 0, СтрокаТЧ.АтрибутКласса));
			Если Найдено.Количество() > 0 Тогда
				ЭлементСписка = Элементы.ПереключательАтрибутов.СписокВыбора.НайтиПоЗначению(Найдено[0].ИДАтрибута);
				Если НЕ ЭлементСписка = Неопределено Тогда
					Элементы.ПереключательАтрибутов.СписокВыбора.Удалить(ЭлементСписка);
				КонецЕсли;
				СписочныеАтрибуты.Удалить(Найдено[0]);
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаТЧ.СтатусНаследования = 3 Тогда
			СтрокаТЧ.СтатусНаследования = 4;
			СтрокаТЧ.ЗначениеАтрибутаКласса = СтрокаТЧ.ТипЗначения.ПривестиЗначение();
			СтрокаТЧ.УровеньЗначения = 0;
		Иначе
			Объект.Атрибуты.Удалить(СтрокаТЧ);
		КонецЕсли;
	КонецЦикла;
	
	НастроитьОтображениеДанныхАтрибута(Объект, Элементы, ТекРежимЗаполненияАтрибутаШаблона, Редактирование);
	
	Если ЗначениеЗаполнено(ДополнительныеПараметры.АктивироватьАтрибут) Тогда
		Элементы.ВсеАтрибуты.ТекущаяСтрока = ДополнительныеПараметры.АктивироватьАтрибут;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьТехКартуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ТекСтрока = ТехКарты.НайтиПоИдентификатору(ДополнительныеПараметры);
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТехКарты.Удалить(ТекСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьКодПоШаблонуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьНаСервере();
	СформироватьКодПоШаблонуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаНаследованияСтрокЗавершение(РезультатВопроса, ДополнительныеПараметры=Неопределено) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Если ДополнительныеПараметры = Истина Тогда
			ЗаписатьНаСервере();
		КонецЕсли;
		
		НайденоАтрибуты = Объект.Атрибуты.НайтиСтроки(Новый Структура("АтрибутКласса", ТекСписочныйАтрибут));
		ПараметрыОткрытия = Новый Структура("Класс, ТабличнаяЧасть, ИсточникЗначений",
			Объект.Класс.Ссылка, ТекСписочныйАтрибут, НайденоАтрибуты[0].ИсточникЗначений);
		ОткрытьФорму("Обработка.НастройкаНаследованияСтрокТабличныхЧастей.Форма", 
			ПараметрыОткрытия, ЭтаФорма, УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВложенныйАтрибутЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Найдено = Объект.Атрибуты.НайтиСтроки(Новый Структура("АтрибутКласса", ДополнительныеПараметры));
	Если Найдено.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	ИндексВставки = Объект.Атрибуты.Индекс(Найдено[0]) + 1;
	
	ВложенныйАтрибут = ПолучитьВложенныйАтрибут(ДополнительныеПараметры, ВыбранныйЭлемент.Значение);
	
	// Защита от дублирования.
	Найдено = Объект.Атрибуты.НайтиСтроки(Новый Структура("АтрибутКласса", ВложенныйАтрибут));
	Если Найдено.Количество() > 0 Тогда
		Элементы.Атрибуты.ТекущаяСтрока = Найдено[0].ПолучитьИдентификатор();
		Возврат;
	КонецЕсли;
	
	СтрокаАтрибут = Объект.Атрибуты.Вставить(ИндексВставки);
	СтрокаАтрибут.АтрибутКласса                 = ВложенныйАтрибут;
	СтрокаАтрибут.СтатусНаследования            = 2;
	СтрокаАтрибут.МножественноеЗначениеКартинка = 1;
	СтрокаАтрибут.ЭтоВложенныйАтрибут           = Истина;
	СтрокаАтрибут.ТипЗначения                   = ПолучитьТипАтрибута(ВыбранныйЭлемент.Значение, ДополнительныеПараметры);
	СтрокаАтрибут.ТипЗначенияПредставление      = "(" + Строка(СтрокаАтрибут.ТипЗначения) + ")";
	
	Элементы.Атрибуты.ТекущаяСтрока = СтрокаАтрибут.ПолучитьИдентификатор();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТипАтрибута(АтрибутКласса, ИсточникЗначений)
	
	Если ТипЗнч(АтрибутКласса) = Тип("ПланВидовХарактеристикСсылка.АтрибутыКласса") Тогда
		Результат = УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначениеРеквизитаОбъекта(АтрибутКласса, "ТипЗначения");
	ИначеЕсли ТипЗнч(АтрибутКласса)  = Тип("ПеречислениеСсылка.РеквизитыКлассаНоменклатуры") И ЗначениеЗаполнено(АтрибутКласса) Тогда
		
		ТипИсточника = УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначениеРеквизитаОбъекта(ИсточникЗначений, "ТипЗначения");
		МетаданныеСпр = Метаданные.НайтиПоТипу(ТипИсточника.Типы()[0]);
		Если НЕ МетаданныеСпр = Неопределено Тогда
			РеквизитСпр = Перечисления.РеквизитыКлассаНоменклатуры.ПолучитьМетаданныеРеквизита(МетаданныеСпр, АтрибутКласса);
			Если НЕ РеквизитСпр = Неопределено Тогда
				Результат = РеквизитСпр.Тип;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте 
Процедура ПроверкаБлокировкиКласса() Экспорт
	
	Если ЗначениеЗаполнено(Объект.Класс.Ссылка) Тогда
		Пользователь = Неопределено;
		ОбъектЗаблокирован = ОбъектРедактируется(Объект.Класс.Ссылка, Ложь, Пользователь);
		
		Если ОбъектЗаблокирован Тогда
			ШаблонПредупреждения = НСтр("ru = 'Класс ''%1'' заблокирован для редактирования пользователем ''%2''.'");
			ТекстПредупреждения = УправлениеНСИФункцииКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
				ШаблонПредупреждения, Строка(Объект.Класс.Ссылка), Строка(Пользователь));
			ПоказатьПредупреждение(, ТекстПредупреждения);
			
			ВыбратьОбъектРедактирования(Неопределено);
			
			ОтменитьРедактированиеНаСервере();
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьСтраницуФормы()
	
	Если ПереключательАтрибутов = 0 Тогда
		Элементы.ГруппаСтарницыАтрибутов.ТекущаяСтраница = Элементы.ГруппаСтраницаОбщие;
	ИначеЕсли ПереключательАтрибутов = 1 Тогда
		Элементы.ГруппаСтарницыАтрибутов.ТекущаяСтраница = Элементы.ГруппаСтраницаПростыеАтрибуты;
		НастроитьОтображениеДанныхАтрибута(Объект, Элементы, ТекРежимЗаполненияАтрибутаШаблона, Редактирование);
	Иначе
		Найдено = СписочныеАтрибуты.НайтиСтроки(Новый Структура("ТипОбъекта, ИДАтрибута", 0, ПереключательАтрибутов));
		Если Найдено.Количество() > 0 Тогда
			ТекСписочныйАтрибут = Найдено[0].АтрибутКласса;
			НайденоАтрибуты = Объект.Атрибуты.НайтиСтроки(Новый Структура("АтрибутКласса", ТекСписочныйАтрибут));
			Если ТекСписочныйАтрибут = ПредопределенноеЗначение("ПланВидовХарактеристик.АтрибутыКласса.ТехКарты") 
					И НайденоАтрибуты[0].МножественноеЗначение Тогда
				// Вывод тех.карты.
				ВывестиТехкартыНаСервере();
				
				РазвернутьСвернутьДеревоФормы(Элементы.ДоступныеОперации, ДоступныеОперации);
				
				Элементы.ГруппаСтарницыАтрибутов.ТекущаяСтраница = Элементы.ГруппаСтраницаТехнологическаяКарта;
			ИначеЕсли Найдено[0].КлассТабличнаяЧасть И НайденоАтрибуты[0].МножественноеЗначение Тогда
				// Вывод табличной части.
				ВывестиЗначенияТабличногоАтрибутаНаСервере(ТекСписочныйАтрибут);
				
				Элементы.ГруппаСтарницыАтрибутов.ТекущаяСтраница = Элементы.ГруппаСтраницаТабличныйАтрибут;
			Иначе
				// Вывод значений для выбора.
				ВывестиЗначенияСписочногоАтрибутаНаСервере(ТекСписочныйАтрибут);
				
				Элементы.ГруппаСтарницыАтрибутов.ТекущаяСтраница = Элементы.ГруппаСтраницаСписочныйАтрибут;
				
				// Настройка элементов формы.
				НастроитьВидимостьЭлементовЗначенийСписочногоАтрибута();
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСпискиАтрибутовДляОбработки(Объект, Элементы)
	
	ИДСтроки = Элементы.Атрибуты.ТекущаяСтрока;
	ТекДанные = Неопределено;
	Если НЕ ИДСтроки = Неопределено Тогда
		ТекДанные = Объект.Атрибуты.НайтиПоИдентификатору(ИДСтроки);
	КонецЕсли;
	
	СтатусыНаследования = Новый Соответствие;
	НаборыАтрибутов = Новый Соответствие;
	ЕдиничныеАтрибуты = Новый Массив;
	
	КолВоАтрибутов = Элементы.Атрибуты.ВыделенныеСтроки.Количество();
	Если КолВоАтрибутов > 1 Тогда
		Для Каждого ИДСтроки ИЗ Элементы.Атрибуты.ВыделенныеСтроки Цикл
			СтрокаТЧ = Объект.Атрибуты.НайтиПоИдентификатору(ИДСтроки);
			
			// Выделенные строки в разрезе статусов наследования.
			МассивСтрок = СтатусыНаследования[СтрокаТЧ.СтатусНаследования];
			Если МассивСтрок = Неопределено Тогда
				МассивСтрок = Новый Массив;
				СтатусыНаследования.Вставить(СтрокаТЧ.СтатусНаследования, МассивСтрок);
			КонецЕсли;
			МассивСтрок.Добавить(СтрокаТЧ);
			
			Если СтрокаТЧ.СтатусНаследования <= 3 Тогда 
				
				// Единичные строки.
				Если НЕ ЗначениеЗаполнено(СтрокаТЧ.НаборАтрибутов) ИЛИ СтрокаТЧ.СтатусНаследования = 3 Тогда
					ЕдиничныеАтрибуты.Добавить(СтрокаТЧ);
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли НЕ ТекДанные = Неопределено Тогда
		// Выделенные строки в разрезе статусов наследования.
		МассивСтрок = Новый Массив;
		МассивСтрок.Добавить(ТекДанные);
		СтатусыНаследования.Вставить(?(ТекДанные = Неопределено, 0, ТекДанные.СтатусНаследования), МассивСтрок);
		Если ТекДанные.СтатусНаследования <= 4 Тогда
			// Единичные строки.
			Если НЕ ЗначениеЗаполнено(ТекДанные.НаборАтрибутов) ИЛИ ТекДанные.СтатусНаследования = 3 Тогда
				ЕдиничныеАтрибуты.Добавить(ТекДанные);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Новый Структура("СтатусыНаследования, НаборыАтрибутов, ЕдиничныеАтрибуты", СтатусыНаследования, НаборыАтрибутов, ЕдиничныеАтрибуты);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПроверитьИспользованиеПримитивныхТипов(ОписаниеТипов, ТипЧисло, ТипДата, ТипБулево, ТипСтрока)
	
	ТипЧисло  = Ложь;
	ТипДата   = Ложь;
	ТипСтрока = Ложь;
	ТипБулево = Ложь;
	Если ОписаниеТипов.СодержитТип(Тип("Число")) Тогда
		ТипЧисло = Истина;
	ИначеЕсли ОписаниеТипов.СодержитТип(Тип("Дата")) Тогда
		ТипДата = Истина;
	ИначеЕсли ОписаниеТипов.СодержитТип(Тип("Строка")) Тогда
		ТипСтрока = Истина;
	ИначеЕсли ОписаниеТипов.СодержитТип(Тип("Булево")) Тогда
		ТипБулево = Истина;
	КонецЕсли;
	
	Возврат ТипЧисло ИЛИ ТипСтрока ИЛИ ТипДата ИЛИ ТипБулево;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьПараметрыВыбора(Имя, Значение)
	
	ПараметрВыбора = Новый ПараметрВыбора(Имя, Значение);
	Результат = Новый Массив;
	Результат.Добавить(ПараметрВыбора);
	Возврат Новый ФиксированныйМассив(Результат);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РежимЗаполненияСтроже(Режим1, Режим2)
	
	Если Режим1 = Режим2 Тогда
		Результат = Режим1;
	ИначеЕсли НЕ ЗначениеЗаполнено(Режим1) И ЗначениеЗаполнено(Режим2) Тогда
		Результат = Режим2;
	ИначеЕсли НЕ ЗначениеЗаполнено(Режим2) И ЗначениеЗаполнено(Режим1) Тогда
		Результат = Режим1;
	Иначе

		РежимыЗаполнения = "Перечисление.РежимыЗаполненияАтрибутов.";
		
		УровниРежимов = Новый Массив;
		УровниРежимов.Добавить(ПредопределенноеЗначение(РежимыЗаполнения + "Необязательный"));
		УровниРежимов.Добавить(ПредопределенноеЗначение(РежимыЗаполнения + "ОбязательныйДляОбъекта"));
		УровниРежимов.Добавить(ПредопределенноеЗначение(РежимыЗаполнения + "ОбязательныйДляНоменклатуры"));
		УровниРежимов.Добавить(ПредопределенноеЗначение(РежимыЗаполнения + "ОбязательныйДляКласса"));
		УровниРежимов.Добавить(ПредопределенноеЗначение(РежимыЗаполнения + "ФиксированноеЗначение"));
		
		Н1 = УровниРежимов.Найти(Режим1);
		Н2 = УровниРежимов.Найти(Режим2);
		
		Результат = ?(Н1 > Н2, Режим1, Режим2);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСписокРежимовЗаполнения(РежимИспользования, РежимЗаполненияРодителя)
	
	ТолькоДляОбъета = (РежимИспользования = ПредопределенноеЗначение("Перечисление.РежимыИспользованияАтрибутов.ТолькоДляОбъектовНоменклатуры"));
	РежимыЗаполнения = "Перечисление.РежимыЗаполненияАтрибутов.";
	Результат = Новый Массив;
	Если НЕ ЗначениеЗаполнено(РежимЗаполненияРодителя)
			ИЛИ РежимЗаполненияРодителя = ПредопределенноеЗначение(РежимыЗаполнения + "ОбязательныйДляОбъекта")
			ИЛИ РежимЗаполненияРодителя = ПредопределенноеЗначение(РежимыЗаполнения + "Необязательный") Тогда
		Результат.Добавить(ПредопределенноеЗначение(РежимыЗаполнения + "ОбязательныйДляОбъекта"));
	КонецЕсли;
	Если НЕ ТолькоДляОбъета Тогда
		Если НЕ ЗначениеЗаполнено(РежимЗаполненияРодителя)
				ИЛИ РежимЗаполненияРодителя = ПредопределенноеЗначение(РежимыЗаполнения + "ОбязательныйДляОбъекта")
				ИЛИ РежимЗаполненияРодителя = ПредопределенноеЗначение(РежимыЗаполнения + "ОбязательныйДляНоменклатуры")
				ИЛИ РежимЗаполненияРодителя = ПредопределенноеЗначение(РежимыЗаполнения + "Необязательный") Тогда
			Результат.Добавить(ПредопределенноеЗначение(РежимыЗаполнения + "ОбязательныйДляНоменклатуры"));
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(РежимЗаполненияРодителя)
				ИЛИ РежимЗаполненияРодителя = ПредопределенноеЗначение(РежимыЗаполнения + "ОбязательныйДляОбъекта")
				ИЛИ РежимЗаполненияРодителя = ПредопределенноеЗначение(РежимыЗаполнения + "ОбязательныйДляНоменклатуры")
				ИЛИ РежимЗаполненияРодителя = ПредопределенноеЗначение(РежимыЗаполнения + "ОбязательныйДляКласса")
				ИЛИ РежимЗаполненияРодителя = ПредопределенноеЗначение(РежимыЗаполнения + "Необязательный") Тогда
			Результат.Добавить(ПредопределенноеЗначение(РежимыЗаполнения + "ОбязательныйДляКласса"));
		КонецЕсли;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(РежимЗаполненияРодителя)
			ИЛИ РежимЗаполненияРодителя = ПредопределенноеЗначение(РежимыЗаполнения + "Необязательный") Тогда
		Результат.Добавить(ПредопределенноеЗначение(РежимыЗаполнения + "Необязательный"));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьОтображениеДанныхАтрибута(Объект, Элементы, ТекРежимЗаполненияАтрибутаШаблона, Редактирование)
	
	СтруктураВыбора = ПолучитьСпискиАтрибутовДляОбработки(Объект, Элементы);
	
	СтатусыНаследования = СтруктураВыбора.СтатусыНаследования;
	НаборыАтрибутов     = СтруктураВыбора.НаборыАтрибутов;
	ЕдиничныеАтрибуты   = СтруктураВыбора.ЕдиничныеАтрибуты;
	
	ДоступностьКомандыНеНаследовать = Ложь;
	ДоступностьКомандыНаследовать   = Ложь;
	ПометкаКомандыНеНаследовать     = Ложь;
	ПометкаКомандыНаследовать       = Ложь;
	
	// Если выбраны унаследованные атрибуты, команды управления наследованием доступны.
	Если Редактирование Тогда
		Для Каждого КлючИЗначение ИЗ СтатусыНаследования Цикл
			СтатусНаследования = КлючИЗначение.Ключ;
			Если СтатусНаследования = 3 Тогда 
				ДоступностьКомандыНеНаследовать = Истина;
				ДоступностьКомандыНаследовать   = Истина;
				ПометкаКомандыНаследовать       = Истина;
				
			ИначеЕсли СтатусНаследования = 4 Тогда
				ДоступностьКомандыНеНаследовать = Истина;
				ДоступностьКомандыНаследовать   = Истина;
				ПометкаКомандыНеНаследовать     = Истина;
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Элементы.АтрибутыКомандаНеНаследовать.Доступность = ДоступностьКомандыНеНаследовать;
	Элементы.АтрибутыКомандаНеНаследовать.Пометка     = ПометкаКомандыНеНаследовать;
	Элементы.АтрибутыКомандаНаследовать.Доступность   = ДоступностьКомандыНаследовать;
	Элементы.АтрибутыКомандаНаследовать.Пометка       = ПометкаКомандыНаследовать;
	
	Элементы.КомандаУдалитьАтрибут.Доступность = 
		ЕдиничныеАтрибуты.Количество() > 0;
	
	// Настройка параметров атрибутов.
	ИДСтроки = Элементы.Атрибуты.ТекущаяСтрока;
	ТекДанные = Неопределено;
	Если НЕ ИДСтроки = Неопределено Тогда
		ТекДанные = Объект.Атрибуты.НайтиПоИдентификатору(ИДСтроки);
	КонецЕсли;
	
	Если ТекДанные = Неопределено ИЛИ ТекДанные.ЭтоВложенныйАтрибут Тогда
		Элементы.ГруппаПараметрыАтрибута.ТолькоПросмотр = Истина;
		Элементы.ДобавитьВложенныйАтрибут.Доступность   = Ложь;
		Элементы.АтрибутыРежимИспользования.Видимость   = Ложь;
		Элементы.АтрибутыРежимЗаполнения.Видимость      = Ложь;
		Элементы.ГруппаПараметрыАтрибутаСтраницы.Видимость = Ложь;
	Иначе
		Элементы.ГруппаПараметрыАтрибута.ТолькоПросмотр    = (ТекДанные.СтатусНаследования > 3);
		Элементы.АтрибутыРежимИспользования.ТолькоПросмотр = (ТекДанные.СтатусНаследования > 2);
		
		Элементы.ДобавитьВложенныйАтрибут.Доступность = Редактирование И НЕ ТекДанные.ЭтоВложенныйАтрибут 
			И НЕ ТекДанные.МножественноеЗначение И ТекДанные.НуженИсточникЗначений
			И ТипЗнч(ТекДанные.АтрибутКласса) = Тип("ПланВидовХарактеристикСсылка.АтрибутыКласса")
			И ЗначениеЗаполнено(ТекДанные.ИсточникЗначений);
		
		Элементы.АтрибутыРежимИспользования.Видимость      = Истина;
		Элементы.ГруппаПараметрыАтрибутаСтраницы.Видимость = Истина;
		
		ТипЧисло  = Ложь;
		ТипДата   = Ложь;
		ТипСтрока = Ложь;
		ТипБулево = Ложь;
		ПроверитьИспользованиеПримитивныхТипов(ТекДанные.ТипЗначения, ТипЧисло, ТипДата, ТипБулево, ТипСтрока);
		
		Элементы.ГруппаПараметрыАтрибутаСтраницы.ТекущаяСтраница = ?(ТипЧисло ИЛИ ТипДата ИЛИ ТипСтрока ИЛИ ТипБулево,
			Элементы.ГруппаПараметрыАтрибутаПримитивныйТип, Элементы.ГруппаПараметрыАтрибутаСсылочныйТип);
			
		Элементы.АтрибутыРежимЗаполнения.Видимость = Истина;
		
		Если НЕ ЗначениеЗаполнено(ТекДанные.ЭтотАтрибутВШаблоне) Тогда
			РежимОграничения = ТекДанные.РежимЗаполненияРодителя;
		Иначе
			Если ТекДанные.ЭтотАтрибутВШаблоне = 1 Тогда
				РежимПоШаблону = ПредопределенноеЗначение("Перечисление.РежимыЗаполненияАтрибутов.ОбязательныйДляКласса");
			ИначеЕсли ТекДанные.ЭтотАтрибутВШаблоне = 2 Тогда
				РежимПоШаблону = ПредопределенноеЗначение("Перечисление.РежимыЗаполненияАтрибутов.ОбязательныйДляНоменклатуры");
			ИначеЕсли ТекДанные.ЭтотАтрибутВШаблоне = 3 Тогда
				РежимПоШаблону = ПредопределенноеЗначение("Перечисление.РежимыЗаполненияАтрибутов.ОбязательныйДляОбъекта");
			КонецЕсли;
			РежимОграничения = РежимЗаполненияСтроже(ТекДанные.РежимЗаполненияРодителя, РежимПоШаблону);
		КонецЕсли;
		
		Элементы.АтрибутыРежимЗаполнения.СписокВыбора.ЗагрузитьЗначения(
			ПолучитьСписокРежимовЗаполнения(ТекДанные.РежимИспользования, РежимОграничения));
		// Ссылочный тип.
		//Элементы.АтрибутыМножественноеЗначение.Доступность = НЕ ТекДанные.КлассТабличнаяЧасть;
		Элементы.АтрибутыИсточникЗначений.Доступность = 
			ТекДанные.НуженИсточникЗначений И НЕ ТекДанные.СписокДоступныхЗначений
				И (НЕ ТекДанные.КлассТабличнаяЧасть ИЛИ ТекДанные.СтатусНаследования < 3);
		Элементы.АтрибутыСписокДоступныхЗначений.Доступность = 
			ТекДанные.НуженИсточникЗначений И НЕ ТекДанные.КлассТабличнаяЧасть;
		
		ТипОбъектНоменклатуры  = Тип("СправочникСсылка.ОбъектыНоменклатуры");
		ЕстьОбъектНоменклатуры = ТекДанные.ТипЗначения.СодержитТип(ТипОбъектНоменклатуры);
		Элементы.АтрибутыИсточникЗначений.ВыбиратьТип = ЕстьОбъектНоменклатуры;
		
		Элементы.ГруппаДобавлениеСтрокТабЧасти.Видимость = ТекДанные.НуженИсточникЗначений 
			И ТекДанные.КлассТабличнаяЧасть И ТекДанные.МножественноеЗначение;
		Элементы.ГруппаДобавлениеСтрокТабЧасти.ТолькоПросмотр = НЕ (ТекДанные.СтатусНаследования < 3);
		
		// Примитивный тип.
		Элементы.ГруппаДиапазонЗначений.Доступность = ТипЧисло ИЛИ ТипДата;
		Элементы.АтрибутыФормат.Доступность = НЕ ТекДанные.МножественноеЗначение И (ТипЧисло ИЛИ ТипДата ИЛИ ТипСтрока);
		Элементы.АтрибутыМногострочноеРедактирование.Доступность = ТипСтрока;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьАтрибут(РежимУдаления)
	
	ТекДанные = Элементы.Атрибуты.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВыбора = ПолучитьСпискиАтрибутовДляОбработки(Объект, Элементы);
	
	СтатусыНаследования = СтруктураВыбора.СтатусыНаследования;
	НаборыАтрибутов     = СтруктураВыбора.НаборыАтрибутов;
	ЕдиничныеАтрибуты   = СтруктураВыбора.ЕдиничныеАтрибуты;
	
	СтатусыУдалятьПострочно     = Неопределено;
	СтатусыНеУчитыватьПострочно = Неопределено;
	СтатусыУдалятьНаборы        = Неопределено;
	
	СтрокиСтатуса = СтатусыНаследования[1];
	ЕстьУдаляемыеЕдиничные = ЗначениеЗаполнено(СтрокиСтатуса) И (СтрокиСтатуса.Количество() > 0);
	СтрокиСтатуса = СтатусыНаследования[2];
	ЕстьУдаляемыеЕдиничные = ЕстьУдаляемыеЕдиничные ИЛИ ЗначениеЗаполнено(СтрокиСтатуса) И (СтрокиСтатуса.Количество() > 0);
	СтрокиСтатуса = СтатусыНаследования[3];
	ЕстьНенаследуемые = ЗначениеЗаполнено(СтрокиСтатуса) И (СтрокиСтатуса.Количество() > 0);
	
	Если РежимУдаления = 4 Тогда
		СтатусыУдалятьПострочно = "Все"; // Построчно все
		СтатусыУдалятьНаборы = 2;        // Наборы - со статусом 2.
	ИначеЕсли РежимУдаления = 3 Тогда
		СтатусыУдалятьПострочно = 3;  // Построчно со статусом 3.
		ЕстьУдаляемыеЕдиничные = Ложь;
	ИначеЕсли РежимУДаления = 2 Тогда
		СтатусыУдалятьНаборы = "Все"; // Наборы - все.
		ЕстьУдаляемыеЕдиничные = Ложь;
	ИначеЕсли РежимУдаления = 1 Тогда
		СтатусыУдалятьПострочно = "Все"; // Построчно все
	КонецЕсли;
	
	АктивироватьАтрибут = Неопределено;
	СтрокиКУдалению = Новый Массив; 
	Если СтатусыУдалятьПострочно = 3 Тогда
		СтрокиКУдалению = СтатусыНаследования[3];
		АктивироватьАтрибут = СтрокиКУдалению[СтрокиКУдалению.ВГраница()].АтрибутКласса;
	ИначеЕсли СтатусыУдалятьПострочно = "Все" Тогда
		Для Каждого КлючИЗначение ИЗ СтатусыНаследования Цикл
			Если КлючИЗначение.Ключ > 3 ИЛИ КлючИЗначение.Ключ = СтатусыНеУчитыватьПострочно Тогда
				Продолжить;
			КонецЕсли;
			Для Каждого Строка ИЗ КлючИЗначение.Значение Цикл
				СтрокиКУдалению.Добавить(Строка);
				АктивироватьАтрибут = Строка.АтрибутКласса;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	АктивироватьНабор = Неопределено;
	КолВоКУдалению = СтрокиКУдалению.Количество();
	Если КолВоКУдалению > 0 Тогда
		Если ЕстьУдаляемыеЕдиничные Тогда
			Если КолВоКУдалению > 1 Тогда
				ТекстВопроса = УправлениеНСИФункцииКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
					НСтр("ru='Удалить %1 атрибутов?'"), КолВоКУдалению);
			Иначе
				ТекстВопроса = УправлениеНСИФункцииКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
					НСтр("ru='Удалить атрибут %1?'"), Строка(СтрокиКУдалению[0].АтрибутКласса));
			КонецЕсли;
		ИначеЕсли ЕстьНенаследуемые Тогда
			Если КолВоКУдалению > 1 Тогда
				ТекстВопроса = УправлениеНСИФункцииКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
					НСтр("ru='Запретить наследование %1 атрибутов?'"), КолВоКУдалению);
			Иначе
				ТекстВопроса = УправлениеНСИФункцииКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
					НСтр("ru='Запретить наследование атрибута %1?'"), Строка(СтрокиКУдалению[0].АтрибутКласса));
			КонецЕсли;
		КонецЕсли;
		
		ДопПараметры = Новый Структура("СтрокиКУдалению, АктивироватьАтрибут, АктивироватьНабор",
			СтрокиКУдалению, АктивироватьАтрибут, АктивироватьНабор);
		ПоказатьВопрос(Новый ОписаниеОповещения("АтрибутыПередУдалениемЗавершение", ЭтаФорма, ДопПараметры), 
			ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьАтрибут(АтрибутКласса, АтрибутыШаблонаКласса, АтрибутыШаблонаНоменклатуры, АтрибутыШаблонаОбъекта)
	
	Найдено = Объект.Атрибуты.НайтиСтроки(Новый Структура("АтрибутКласса", АтрибутКласса));
	Изменено = Ложь;
	
	Если Найдено.Количество() = 0 Тогда
		РеквизитыАтрибута = УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначенияРеквизитовОбъекта(
			АтрибутКласса, "ЭтоГруппа, ТипЗначения, МножественноеЗначение, ИсточникЗначений");
		Если РеквизитыАтрибута.ЭтоГруппа Тогда 
			Возврат;
		КонецЕсли;
		
		ЭтоСтрока = РеквизитыАтрибута.ТипЗначения.СодержитТип(Тип("Строка"));
		
		СтрокаТЧ = Объект.Атрибуты.Добавить();
		СтрокаТЧ.АтрибутКласса          = АтрибутКласса;
		СтрокаТЧ.МножественноеЗначение  = РеквизитыАтрибута.МножественноеЗначение;
		СтрокаТЧ.МножественноеЗначениеКартинка = ?(РеквизитыАтрибута.МножественноеЗначение И НЕ ЭтоСтрока, 0, 1);
		СтрокаТЧ.СтатусНаследования     = 1;
		СтрокаТЧ.ТипЗначения            = РеквизитыАтрибута.ТипЗначения;
		СтрокаТЧ.ЗначениеАтрибутаКласса = СтрокаТЧ.ТипЗначения.ПривестиЗначение();
		
		СтрокаТЧ.РежимИспользования = ПредопределенноеЗначение("Перечисление.РежимыИспользованияАтрибутов.БезОграничений");
		СтрокаТЧ.РежимЗаполнения    = ПредопределенноеЗначение("Перечисление.РежимыЗаполненияАтрибутов.Необязательный");
		Если НЕ АтрибутыШаблонаКласса = Неопределено И НЕ АтрибутыШаблонаКласса.Найти(АтрибутКласса) = Неопределено Тогда
			СтрокаТЧ.ЭтотАтрибутВШаблоне = 1;
			СтрокаТЧ.РежимЗаполнения = ПредопределенноеЗначение("Перечисление.РежимыЗаполненияАтрибутов.ОбязательныйДляКласса");
		ИначеЕсли НЕ АтрибутыШаблонаНоменклатуры = Неопределено И НЕ АтрибутыШаблонаНоменклатуры.Найти(АтрибутКласса) = Неопределено Тогда
			СтрокаТЧ.ЭтотАтрибутВШаблоне = 2;
			СтрокаТЧ.РежимЗаполнения = ПредопределенноеЗначение("Перечисление.РежимыЗаполненияАтрибутов.ОбязательныйДляНоменклатуры");
		ИначеЕсли НЕ АтрибутыШаблонаОбъекта = Неопределено И НЕ АтрибутыШаблонаОбъекта.Найти(АтрибутКласса) = Неопределено Тогда
			СтрокаТЧ.ЭтотАтрибутВШаблоне = 3;
			СтрокаТЧ.РежимЗаполнения = ПредопределенноеЗначение("Перечисление.РежимыЗаполненияАтрибутов.ОбязательныйДляОбъекта");
		КонецЕсли;
		
		ОписаниеТиповСсылка = Новый ОписаниеТипов("СправочникСсылка.Классы, СправочникСсылка.НоменклатураКласса");
		ТипОбъектНоменклатуры = Тип("СправочникСсылка.ОбъектыНоменклатуры");
		ТипНоменклатураКласса = Тип("СправочникСсылка.НоменклатураКласса");
		ТипКласс              = Тип("СправочникСсылка.Классы");
		
		ПустойКласс = ПредопределенноеЗначение("Справочник.Классы.ПустаяСсылка");
		
		КлассИлиНоменклатура = ОписаниеТиповСсылка.СодержитТип(СтрокаТЧ.ТипЗначения.Типы()[0]);
		ЕстьНоменклатураКласса = СтрокаТЧ.ТипЗначения.СодержитТип(ТипНоменклатураКласса);
		ЕстьОбъектНоменклатуры = СтрокаТЧ.ТипЗначения.СодержитТип(ТипОбъектНоменклатуры);
		
		СтрокаТЧ.НуженИсточникЗначений = (КлассИлиНоменклатура ИЛИ ЕстьОбъектНоменклатуры);
		
		Если КлассИлиНоменклатура И НЕ ЕстьОбъектНоменклатуры
				И (НЕ ТипЗнч(РеквизитыАтрибута.ИсточникЗначений) = ТипКласс) Тогда
			СтрокаТЧ.ИсточникЗначений = ПустойКласс;
		Иначе
			СтрокаТЧ.ИсточникЗначений = РеквизитыАтрибута.ИсточникЗначений;
		КонецЕсли;
		
		КлассТабличнаяЧасть = Ложь;
		Если ЗначениеЗаполнено(СтрокаТЧ.ИсточникЗначений) 
				И ТипЗнч(СтрокаТЧ.ИсточникЗначений) = ТипКласс Тогда
			КлассТабличнаяЧасть = ?(ЗначениеЗаполнено(СтрокаТЧ.ИсточникЗначений), 
				УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначениеРеквизитаОбъекта(
					СтрокаТЧ.ИсточникЗначений, "КлассТабличнаяЧасть"), Ложь);
		КонецЕсли;
		СтрокаТЧ.КлассТабличнаяЧасть = КлассТабличнаяЧасть;
		
		СтрокаТЧ.СоставнойТипЗначения = (ЕстьНоменклатураКласса ИЛИ ЕстьОбъектНоменклатуры);
		Если СтрокаТЧ.СоставнойТипЗначения Тогда
			СтрокаТЧ.ЗначениеАтрибутаКлассаСоставное = СтрокаТЧ.ИсточникЗначений;
		КонецЕсли;
		
		Если КлассИлиНоменклатура И НЕ СтрокаТЧ.СоставнойТипЗначения 
				И ЗначениеЗаполнено(СтрокаТЧ.ИсточникЗначений) Тогда
			СтрокаТЧ.ТипЗначенияПредставление = "(" + Строка(СтрокаТЧ.ИсточникЗначений) + ")";
		Иначе
			СтрокаТЧ.ТипЗначенияПредставление = "(" + Строка(СтрокаТЧ.ТипЗначения) + ")";
		КонецЕсли;
		
		Если НЕ ЭтоСтрока И СтрокаТЧ.МножественноеЗначение Тогда
			ДобавитьСписочныйАтрибут(СтрокаТЧ.АтрибутКласса, СтрокаТЧ.КлассТабличнаяЧасть, СтрокаТЧ.ИсточникЗначений);
		КонецЕсли;
		
		Изменено = Истина;
		
	Иначе
		СтрокаТЧ = Найдено[0];
		Если СтрокаТЧ.СтатусНаследования = 4 Тогда
			СтрокаТЧ.СтатусНаследования = 3;
			ПараметрыЗаполнения = ПолучитьЗначениеАтрибута(СтрокаТЧ.АтрибутКласса);
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, ПараметрыЗаполнения);
			ЭтоСтрока = СтрокаТЧ.ТипЗначения.СодержитТип(Тип("Строка"));
			
			Если НЕ ЭтоСтрока И (СтрокаТЧ.МножественноеЗначение ИЛИ СтрокаТЧ.СписокДоступныхЗначений) Тогда
				ДобавитьСписочныйАтрибут(СтрокаТЧ.АтрибутКласса, СтрокаТЧ.КлассТабличнаяЧасть, СтрокаТЧ.ИсточникЗначений);
			КонецЕсли;
			
			Изменено = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.Атрибуты.ТекущаяСтрока = СтрокаТЧ.ПолучитьИдентификатор();
	
	Модифицированность = Модифицированность ИЛИ Изменено;
	НастроитьОтображениеДанныхАтрибута(Объект, Элементы, ТекРежимЗаполненияАтрибутаШаблона, Редактирование);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьАтрибутыШаблонов(ШаблонКодаКласса, ШаблонНаименованияКласса, ШаблонКодаНоменклатуры, 
		ШаблонНаименованияНоменклатуры, ШаблонКодаОбъекта, ШаблонНаименованияОбъекта)
	
	Если ЗначениеЗаполнено(ШаблонКодаКласса) Тогда
		АтрибутыШаблонаКласса = ПолучитьАтрибутыШаблона(ШаблонКодаКласса);
	КонецЕсли;
	Если ЗначениеЗаполнено(ШаблонНаименованияКласса) Тогда
		АтрибутыШаблонаНаименованияКласса = ПолучитьАтрибутыШаблона(ШаблонНаименованияКласса);
		Если НЕ АтрибутыШаблонаКласса = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(АтрибутыШаблонаКласса, АтрибутыШаблонаНаименованияКласса);
		Иначе
			АтрибутыШаблонаКласса = АтрибутыШаблонаНаименованияКласса;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ШаблонКодаНоменклатуры) Тогда
		АтрибутыШаблонаНоменклатуры = ПолучитьАтрибутыШаблона(ШаблонКодаНоменклатуры);
	КонецЕсли;
	Если ЗначениеЗаполнено(ШаблонНаименованияНоменклатуры) Тогда
		АтрибутыШаблонаНаименованияНоменклатуры = ПолучитьАтрибутыШаблона(ШаблонНаименованияНоменклатуры);
		Если НЕ АтрибутыШаблонаНоменклатуры = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(АтрибутыШаблонаНоменклатуры, АтрибутыШаблонаНаименованияНоменклатуры);
		Иначе
			АтрибутыШаблонаНоменклатуры = АтрибутыШаблонаНаименованияНоменклатуры;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ШаблонКодаОбъекта) Тогда
		АтрибутыШаблонаОбъекта = ПолучитьАтрибутыШаблона(ШаблонКодаОбъекта);
	КонецЕсли;
	Если ЗначениеЗаполнено(ШаблонНаименованияОбъекта) Тогда
		АтрибутыШаблонаНаименованияОбъекта = ПолучитьАтрибутыШаблона(ШаблонНаименованияОбъекта);
		Если НЕ АтрибутыШаблонаОбъекта = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(АтрибутыШаблонаОбъекта, АтрибутыШаблонаНаименованияОбъекта);
		Иначе
			АтрибутыШаблонаОбъекта = АтрибутыШаблонаНаименованияОбъекта;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Новый Структура("АтрибутыШаблонаКласса, АтрибутыШаблонаНоменклатуры, АтрибутыШаблонаОбъекта", 
		АтрибутыШаблонаКласса, АтрибутыШаблонаНоменклатуры, АтрибутыШаблонаОбъекта);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьАтрибутыШаблона(ШаблонЗаполнения)
	
	ЭлементыШаблона = УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначениеРеквизитаОбъекта(
		ШаблонЗаполнения, "ЭлементыШаблона").Выгрузить();
	СтрокиШаблона = ЭлементыШаблона.Скопировать(Новый Структура("ТипСтроки", Перечисления.ТипыСтрокШаблона.АтрибутОбъекта));
	Возврат СтрокиШаблона.ВыгрузитьКолонку("АтрибутКласса");
	
КонецФункции

&НаСервере
Процедура ДобавитьСписочныйАтрибут(АтрибутКласса, КлассТабличнаяЧасть, ИсточникЗначений)
	
	Найдено = СписочныеАтрибуты.НайтиСтроки(Новый Структура("ТипОбъекта, АтрибутКласса", 0, АтрибутКласса));
	Если Найдено.Количество() = 0 Тогда
		
		СписочныйАтрибут = СписочныеАтрибуты.Добавить();
		СписочныйАтрибут.ИДАтрибута          = НайтиНовыйИД(СписочныеАтрибуты, "ИДАтрибута", 2);
		СписочныйАтрибут.АтрибутКласса       = АтрибутКласса;
		СписочныйАтрибут.КлассТабличнаяЧасть = КлассТабличнаяЧасть;
		СписочныйАтрибут.ТипОбъекта          = 0;
		СписочныйАтрибут.ИсточникЗначений    = ИсточникЗначений;
		
		Если НЕ КлассТабличнаяЧасть Тогда
			НайденоЗначения = Объект.ЗначенияСписочныхАтрибутов.НайтиСтроки(Новый Структура("АтрибутКласса", АтрибутКласса));
			Если НайденоЗначения.Количество() = 0 Тогда 
				ЗаполнитьЗначенияСписочныхАтрибутов(Объект.Класс.Ссылка, АтрибутКласса);
			КонецЕсли;
		КонецЕсли;
		
		СписокСтраницАтрибутов = Элементы.ПереключательАтрибутов.СписокВыбора;
		СписокСтраницАтрибутов.Добавить(СписочныйАтрибут.ИДАтрибута, АтрибутКласса);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТехОперацию(ВидОперации, Знач ОбъектОперации = Неопределено, ТипСтроки=0)
	
	Если ТекТехКарта < 0 Тогда
		Возврат
	КонецЕсли;
	
	СтрокаТехОперации = Неопределено;
	ЭлементыОпераций = СоставТехКарты.ПолучитьЭлементы();
	
	Если ОбъектОперации = Неопределено Тогда
		ОбъектОперации = Объект.Класс.Ссылка;
	КонецЕсли;
	
	Если СтрокаТехОперации = Неопределено Тогда
		СтрокаТехОперации = ЭлементыОпераций.Добавить();
		СтрокаТехОперации.ТипСтроки = ТипСтроки;
		Если ТипСтроки = 0 Тогда
			СтрокаТехОперации.ВидОперации = ВидОперации;
		Иначе
			СтрокаТехОперации.ТехКартаВложенная = ВидОперации;
		КонецЕсли;
		СтрокаТехОперации.СтатусНаследования = 1;
		СтрокаТехОперации.ИДСтроки = НайтиНовыйИД(Объект.СтрокиТабличныхАтрибутов, "ИДСтроки");
		СтрокаТехОперации.ОбъектОперации = ОбъектОперации;
	КонецЕсли;
	
	Элементы.СоставТехКарты.ТекущаяСтрока = СтрокаТехОперации.ПолучитьИдентификатор();
	Элементы.СоставТехКарты.ТекущийЭлемент = ?(ТипСтроки = 0, 
		Элементы.СоставТехКартыВидОперации, Элементы.СоставТехКартыТехКартаВложенная);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтрокуТехОперации() Экспорт
	
	Элементы.СоставТехКарты.ИзменитьСтроку();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьТехОперацию(Выбраны, УдалитьИзДерева=Ложь)
	
	ТекДанныеТехКарты = Элементы.ТехКарты.ТекущиеДанные;
	Если ТекДанныеТехКарты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	УдалитьВыбранныеСтрокиТабличногоАтрибута(СоставТехКарты, Выбраны, ТекДанныеТехКарты.ИДСтроки, 
		ПредопределенноеЗначение("ПланВидовХарактеристик.АтрибутыКласса.ТехОперации"));
	
	Если УдалитьИзДерева Тогда
		ЭлементыДерева = СоставТехКарты.ПолучитьЭлементы();
		Для Каждого ИДСтроки ИЗ Выбраны Цикл
			СтрокаКУдалению = СоставТехКарты.НайтиПоИдентификатору(ИДСтроки);
				ЭлементыДерева.Удалить(СтрокаКУдалению);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ТекстЗапросаЗначенияАтрибутовМаксУровень()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВТ_МаксУровниЗначений.АтрибутКласса КАК АтрибутКласса,
		|	ВТ_ЗначенияАтрибутов.ЗначениеАтрибутаКласса КАК ЗначениеАтрибутаКласса,
		|	ВЫБОР
		|		КОГДА ВТ_ЗначенияАтрибутов.УровеньНаследования ЕСТЬ NULL
		|			ТОГДА 0
		|		ИНАЧЕ ВТ_ЗначенияАтрибутов.УровеньНаследования * 2 + 1
		|	КОНЕЦ КАК УровеньЗначения
		|ИЗ
		|	ВТ_МаксУровниЗначений КАК ВТ_МаксУровниЗначений
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗначенияАтрибутов КАК ВТ_ЗначенияАтрибутов
		|		ПО ВТ_МаксУровниЗначений.АтрибутКласса = ВТ_ЗначенияАтрибутов.АтрибутКласса
		|			И ВТ_МаксУровниЗначений.Уровень = ВТ_ЗначенияАтрибутов.Уровень";
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Функция ПолучитьЗначениеАтрибута(АтрибутКласса)
	
	СтруктураВозврата = 
		Новый Структура("ЗначениеАтрибутаКласса, УровеньЗначения", ПолучитьПустоеЗначениеАтрибута(АтрибутКласса));
		
	ПараметрСписокРодителей = СписокРодителей.Выгрузить();
	ПараметрСписокРодителей.Колонки.Добавить("КлассДляЧтения", Новый ОписаниеТипов("СправочникСсылка.Классы"));
	ПараметрСписокРодителей.ЗаполнитьЗначения(Объект.Класс.Ссылка, "КлассДляЧтения");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("АтрибутКласса",   АтрибутКласса);
	Запрос.УстановитьПараметр("Класс",           Объект.Класс.Ссылка);
	Запрос.УстановитьПараметр("СписокРодителей", ПараметрСписокРодителей);
	ТекстУсловияПоНенаследуемым = "
		|	И НЕ НенаследуемыеЗначения.Класс = &Класс";
	ТекстУсловияПоЗначениям = "
		|	И ЗначенияАтрибутовКласса.АтрибутКласса = &АтрибутКласса";
	
	Запрос.Текст = Справочники.Классы.ТекстЗапросаСписокРодителей() 
			+ УправлениеНСИФункцииВызовСервераПереопределяемый.ТекстРазделителяЗапросовПакета()
		+ Справочники.Классы.ТекстЗапросаНеНаследуемыеАтрибуты(ТекстУсловияПоНенаследуемым) 
			+ УправлениеНСИФункцииВызовСервераПереопределяемый.ТекстРазделителяЗапросовПакета()
		+ Справочники.Классы.ТекстЗапросаЗначенияАтрибутов(ТекстУсловияПоЗначениям)         
			+ УправлениеНСИФункцииВызовСервераПереопределяемый.ТекстРазделителяЗапросовПакета()
		+ ТекстЗапросаЗначенияАтрибутовМаксУровень()
		;
		
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, Результат);
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПустоеЗначениеАтрибута(АтрибутКласса)
	
	Если ТипЗнч(АтрибутКласса) = Тип("ПланВидовХарактеристикСсылка.АтрибутыКласса") Тогда
		ТипЗначения = УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначениеРеквизитаОбъекта(
			АтрибутКласса, "ТипЗначения");
	ИначеЕсли ТипЗнч(АтрибутКласса) = Тип("СправочникСсылка.ВложенныеАтрибутыКласса") Тогда
		ЗначенияРеквизитов = УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначенияРеквизитовОбъекта(
			АтрибутКласса, Новый Структура("АтрибутКласса, ТипЗначения",
			"АтрибутКласса", "ВЫРАЗИТЬ(АтрибутКласса КАК ПланВидовХарактеристик.АтрибутыКласса).ТипЗначения"));
		ТипАтрибута = ТипЗнч(ЗначенияРеквизитов.АтрибутКласса);
		Если ТипАтрибута = Тип("ПланВидовХарактеристикСсылка.АтрибутыКласса") Тогда
			ТипЗначения = ЗначенияРеквизитов.ТипЗначения;
		ИначеЕсли ТипАтрибута = Тип("ПеречислениеСсылка.РеквизитыКлассаНоменклатуры") Тогда
			МетаданныеСпр = Метаданные.НайтиПоТипу(ЗначенияРеквизитов.ТипЗначения.Типы()[0]);
			МетаданныеРеквизита = Перечисления.РеквизитыКлассаНоменклатуры.ПолучитьМетаданныеРеквизита(
				МетаданныеСпр, Значенияреквизитов.АтрибутКласса);
			ТипЗначения = МетаданныеРеквизита.Тип;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ?(НЕ ТипЗначения = Неопределено, ТипЗначения.ПривестиЗначение(), Неопределено);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьКомандыУправленияЗначениямиСписочногоАтрибута(Объект, Элементы, ТекДанные, Редактирование)
	
	Если Редактирование И НЕ ТекДанные = Неопределено И ТекДанные.СтатусНаследования = 3 Тогда
		ДоступностьКомандУправления = Истина;
		ПометкаНаследовать = Истина;
		ПометкаНеНаследовать = Ложь;
	ИначеЕсли Редактирование И НЕ ТекДанные = Неопределено И ТекДанные.СтатусНаследования = 4 Тогда
		ДоступностьКомандУправления = Истина;
		ПометкаНаследовать = Ложь;
		ПометкаНеНаследовать = Истина;
	Иначе
		ДоступностьКомандУправления = Ложь;
		ПометкаНаследовать = Ложь;
		ПометкаНеНаследовать = Ложь;
	КонецЕсли;
	
	Элементы.ЗначенияСписочногоАтрибутаКомандаНаследоватьЗначение.Доступность = ДоступностьКомандУправления;
	Элементы.ЗначенияСписочногоАтрибутаКомандаНаследоватьЗначение.Пометка     = ПометкаНаследовать;
	
	Элементы.ЗначенияСписочногоАтрибутаКомандаНеНаследоватьЗначение.Доступность = ДоступностьКомандУправления;
	Элементы.ЗначенияСписочногоАтрибутаКомандаНеНаследоватьЗначение.Пометка     = ПометкаНеНаследовать;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусНаследованияДляПодчиненных(ТекДанные)
	
	ВложенныеЭлементы = ТекДанные.ПолучитьЭлементы();
	Для Каждого ТекЭлемент ИЗ ВложенныеЭлементы Цикл
		ТекЭлемент.СтатусНаследования   = ТекДанные.СтатусНаследования;
		ТекЭлемент.ДоступноеЗначение    = ТекДанные.ДоступноеЗначение;
		Если НЕ ТекДанные.ДоступноеЗначение Тогда
			ТекЭлемент.ИспользуемоеЗначение = Ложь;
		КонецЕсли;
		УстановитьСтатусНаследованияДляПодчиненных(ТекЭлемент);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ТекстЗапросаЗначенияСписочныхАтрибутовВременныеТаблицы()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ЗначенияСписочныхАтрибутовКласса.ЗначениеАтрибутаКласса КАК ЗначениеАтрибутаКласса,
		|	ЗначенияСписочныхАтрибутовКласса.АтрибутКласса КАК АтрибутКласса,
		|	ЗначенияСписочныхАтрибутовКласса.СтатусНаследования КАК СтатусНаследования,
		|	ЗначенияСписочныхАтрибутовКласса.ДоступноеЗначение КАК ДоступноеЗначение,
		|	ЗначенияСписочныхАтрибутовКласса.ДоступноеЗначениеНаследуемое КАК ДоступноеЗначениеНаследуемое,
		|	ЗначенияСписочныхАтрибутовКласса.ИспользуемоеЗначение КАК ИспользуемоеЗначение
		|ПОМЕСТИТЬ ВТ_ЗначенияСписочныхАтрибутовКласса
		|ИЗ
		|	&ЗначенияСписочныхАтрибутовКласса КАК ЗначенияСписочныхАтрибутовКласса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НоменклатураКласса.Ссылка КАК ЗначениеАтрибутаКласса,
		|	ЕСТЬNULL(ВТ_ЗначенияСписочныхАтрибутовКласса.СтатусНаследования, 2) КАК СтатусНаследования,
		|	ЕСТЬNULL(ВТ_ЗначенияСписочныхАтрибутовКласса.ДоступноеЗначение, ЛОЖЬ) КАК ДоступноеЗначение,
		|	ЕСТЬNULL(ВТ_ЗначенияСписочныхАтрибутовКласса.ИспользуемоеЗначение, ЛОЖЬ) КАК ИспользуемоеЗначение,
		|	НоменклатураКласса.Класс КАК Класс,
		|	ИСТИНА КАК ПрямоеЗначение
		|ПОМЕСТИТЬ ВТ_ЗначенияСписочныхАтрибутовКлассаНоменклатура
		|ИЗ
		|	Справочник.НоменклатураКласса КАК НоменклатураКласса
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗначенияСписочныхАтрибутовКласса КАК ВТ_ЗначенияСписочныхАтрибутовКласса
		|		ПО (ВТ_ЗначенияСписочныхАтрибутовКласса.АтрибутКласса = &АтрибутКласса)
		|			И НоменклатураКласса.Ссылка = ВТ_ЗначенияСписочныхАтрибутовКласса.ЗначениеАтрибутаКласса
		|ГДЕ
		|	НЕ НоменклатураКласса.ЭтоГруппа
		|		И (&ИсточникКласс
		|				И НоменклатураКласса.Класс В ИЕРАРХИИ (&ИсточникЗначений)
		|			ИЛИ НоменклатураКласса.Ссылка В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					ВТ_ЗначенияСписочныхАтрибутовКласса.ЗначениеАтрибутаКласса
		|				ИЗ
		|					ВТ_ЗначенияСписочныхАтрибутовКласса
		|				ГДЕ
		|					ВТ_ЗначенияСписочныхАтрибутовКласса.АтрибутКласса = &АтрибутКласса
		|					И ВТ_ЗначенияСписочныхАтрибутовКласса.ЗначениеАтрибутаКласса ССЫЛКА Справочник.НоменклатураКласса))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НоменклатураКласса.Ссылка,
		|	3,
		|	ИСТИНА, // Доступное значение.
		|	ЛОЖЬ,   // Используемое значение.
		|	НоменклатураКласса.Класс,
		|	ЛОЖЬ
		|ИЗ
		|	Справочник.НоменклатураКласса КАК НоменклатураКласса
		|ГДЕ
		|	НЕ НоменклатураКласса.ЭтоГруппа
		|		И НЕ НоменклатураКласса.ПометкаУдаления
		|		И НоменклатураКласса.Класс В ИЕРАРХИИ
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ВТ_ЗначенияСписочныхАтрибутовКласса.ЗначениеАтрибутаКласса
		|			ИЗ
		|				ВТ_ЗначенияСписочныхАтрибутовКласса
		|			ГДЕ
		|				ВТ_ЗначенияСписочныхАтрибутовКласса.АтрибутКласса = &АтрибутКласса
		|				И ВТ_ЗначенияСписочныхАтрибутовКласса.ЗначениеАтрибутаКласса ССЫЛКА Справочник.Классы
		|				И ВТ_ЗначенияСписочныхАтрибутовКласса.ДоступноеЗначение)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОбъектыНоменклатуры.Ссылка КАК ЗначениеАтрибутаКласса,
		|	ЕСТЬNULL(ВТ_ЗначенияСписочныхАтрибутовКласса.СтатусНаследования, 2) КАК СтатусНаследования,
		|	ЕСТЬNULL(ВТ_ЗначенияСписочныхАтрибутовКласса.ДоступноеЗначение, ЛОЖЬ) КАК ДоступноеЗначение,
		|	ЕСТЬNULL(ВТ_ЗначенияСписочныхАтрибутовКласса.ИспользуемоеЗначение, ЛОЖЬ) КАК ИспользуемоеЗначение,
		|	ОбъектыНоменклатуры.НоменклатураКласса КАК Номенклатура,
		|	ОбъектыНоменклатуры.НоменклатураКласса.Класс КАК Класс,
		|	ИСТИНА КАК ПрямоеЗначение
		|ПОМЕСТИТЬ ВТ_ЗначенияСписочныхАтрибутовКлассаОбъектыНоменклатуры
		|ИЗ
		|	Справочник.ОбъектыНоменклатуры КАК ОбъектыНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗначенияСписочныхАтрибутовКласса КАК ВТ_ЗначенияСписочныхАтрибутовКласса
		|		ПО (ВТ_ЗначенияСписочныхАтрибутовКласса.АтрибутКласса = &АтрибутКласса)
		|			И (ВТ_ЗначенияСписочныхАтрибутовКласса.ЗначениеАтрибутаКласса = ОбъектыНоменклатуры.Ссылка)
		|ГДЕ
		|	(&ИсточникКласс
		|				И ОбъектыНоменклатуры.НоменклатураКласса.Класс В ИЕРАРХИИ (&ИсточникЗначений)
		|			ИЛИ &ИсточникНоменклатура
		|				И ОбъектыНоменклатуры.НоменклатураКласса В (&ИсточникЗначений)
		|			ИЛИ ОбъектыНоменклатуры.Ссылка В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					ВТ_ЗначенияСписочныхАтрибутовКласса.ЗначениеАтрибутаКласса
		|				ИЗ
		|					ВТ_ЗначенияСписочныхАтрибутовКласса
		|				ГДЕ
		|					ВТ_ЗначенияСписочныхАтрибутовКласса.АтрибутКласса = &АтрибутКласса
		|					И ВТ_ЗначенияСписочныхАтрибутовКласса.ЗначениеАтрибутаКласса ССЫЛКА Справочник.ОбъектыНоменклатуры))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОбъектыНоменклатуры.Ссылка,
		|	3,
		|	ИСТИНА, // Доступное значение.
		|	ЛОЖЬ,   // Используемое значение.
		|	ОбъектыНоменклатуры.НоменклатураКласса,
		|	ОбъектыНоменклатуры.НоменклатураКласса.Класс,
		|	ЛОЖЬ
		|ИЗ
		|	Справочник.ОбъектыНоменклатуры КАК ОбъектыНоменклатуры
		|ГДЕ
		|	НЕ ОбъектыНоменклатуры.ПометкаУдаления
		|	И ОбъектыНоменклатуры.НоменклатураКласса В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ВТ_ЗначенияСписочныхАтрибутовКлассаНоменклатура.ЗначениеАтрибутаКласса
		|			ИЗ
		|				ВТ_ЗначенияСписочныхАтрибутовКлассаНоменклатура
		|			ГДЕ
		|				(ВТ_ЗначенияСписочныхАтрибутовКлассаНоменклатура.ДоступноеЗначение
		|					ИЛИ ВТ_ЗначенияСписочныхАтрибутовКлассаНоменклатура.ИспользуемоеЗначение))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗначенияСписочныхАтрибутовКлассаНоменклатура.ЗначениеАтрибутаКласса,
		|	ВТ_ЗначенияСписочныхАтрибутовКлассаНоменклатура.Класс,
		|	МАКСИМУМ(ВТ_ЗначенияСписочныхАтрибутовКлассаНоменклатура.ПрямоеЗначение) КАК ПрямоеЗначение
		|ПОМЕСТИТЬ ВТ_НоменклатураПроверкаПрямогоЗначения
		|ИЗ
		|	ВТ_ЗначенияСписочныхАтрибутовКлассаНоменклатура КАК ВТ_ЗначенияСписочныхАтрибутовКлассаНоменклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЗначенияСписочныхАтрибутовКлассаНоменклатура.ЗначениеАтрибутаКласса,
		|	ВТ_ЗначенияСписочныхАтрибутовКлассаНоменклатура.Класс
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗначенияСписочныхАтрибутовКлассаОбъектыНоменклатуры.ЗначениеАтрибутаКласса,
		|	ВТ_ЗначенияСписочныхАтрибутовКлассаОбъектыНоменклатуры.Номенклатура,
		|	ВТ_ЗначенияСписочныхАтрибутовКлассаОбъектыНоменклатуры.Класс,
		|	МАКСИМУМ(ВТ_ЗначенияСписочныхАтрибутовКлассаОбъектыНоменклатуры.ПрямоеЗначение) КАК ПрямоеЗначение
		|ПОМЕСТИТЬ ВТ_ОбъектыНоменклатурыПровекаПрямогоЗначения
		|ИЗ
		|	ВТ_ЗначенияСписочныхАтрибутовКлассаОбъектыНоменклатуры КАК ВТ_ЗначенияСписочныхАтрибутовКлассаОбъектыНоменклатуры
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЗначенияСписочныхАтрибутовКлассаОбъектыНоменклатуры.ЗначениеАтрибутаКласса,
		|	ВТ_ЗначенияСписочныхАтрибутовКлассаОбъектыНоменклатуры.Класс,
		|	ВТ_ЗначенияСписочныхАтрибутовКлассаОбъектыНоменклатуры.Номенклатура";
	Возврат ТекстЗапроса;

КонецФункции

&НаСервере
Функция ТекстЗапросаЗначенияСписочныхАтрибутовСИерархией()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Классы.Ссылка КАК ЗначениеАтрибутаКласса,
		|	ЕСТЬNULL(ВТ_ЗначенияСписочныхАтрибутовКласса.СтатусНаследования, 2) КАК СтатусНаследования,
		|	ЕСТЬNULL(ВТ_ЗначенияСписочныхАтрибутовКласса.ИспользуемоеЗначение, ЛОЖЬ) КАК ИспользуемоеЗначение,
		|	ЕСТЬNULL(ВТ_ЗначенияСписочныхАтрибутовКласса.ДоступноеЗначение, ЛОЖЬ) КАК ДоступноеЗначение,
		|	ЕСТЬNULL(ВТ_ЗначенияСписочныхАтрибутовКласса.ДоступноеЗначениеНаследуемое, ЛОЖЬ) КАК ДоступноеЗначениеНаследуемое,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_ЗначенияСписочныхАтрибутовКласса.СтатусНаследования, 2) > 2
		|				И ВТ_ЗначенияСписочныхАтрибутовКласса.ДоступноеЗначениеНаследуемое
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК МожноИзменятьДоступноеЗначение,
		|	Классы.ЗначениеАтрибута КАК МожетБытьИспользуемымЗначением,
		|	ИСТИНА КАК ВИерархии
		|ИЗ
		|	Справочник.Классы КАК Классы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗначенияСписочныхАтрибутовКласса КАК ВТ_ЗначенияСписочныхАтрибутовКласса
		|		ПО Классы.Ссылка = ВТ_ЗначенияСписочныхАтрибутовКласса.ЗначениеАтрибутаКласса
		|			И (ВТ_ЗначенияСписочныхАтрибутовКласса.АтрибутКласса = &АтрибутКласса)
		|ГДЕ
		|	(&ИсточникКласс
		|				И Классы.Ссылка В ИЕРАРХИИ (&ИсточникЗначений)
		|			ИЛИ Классы.Ссылка В
		|				(ВЫБРАТЬ
		|					ВТ_ЗначенияСписочныхАтрибутовКласса.ЗначениеАтрибутаКласса
		|				ИЗ
		|					ВТ_ЗначенияСписочныхАтрибутовКласса
		|				ГДЕ
		|					ВТ_ЗначенияСписочныхАтрибутовКласса.АтрибутКласса = &АтрибутКласса))
		|	И НЕ Классы.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗначениеАтрибутаКласса,
		|	СтатусНаследования
		|ИТОГИ
		|	ЛОЖЬ КАК ВИерархии
		|ПО
		|	ЗначениеАтрибутаКласса ИЕРАРХИЯ
		|АВТОУПОРЯДОЧИВАНИЕ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НоменклатураПроверкаПрямогоЗначения.ЗначениеАтрибутаКласса КАК ЗначениеАтрибутаКласса,
		|	ЕСТЬNULL(ВТ_ЗначенияСписочныхАтрибутовКлассаНоменклатураНеПрямое.СтатусНаследования, ВТ_ЗначенияСписочныхАтрибутовКлассаНоменклатураПрямое.СтатусНаследования) КАК СтатусНаследования,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_ЗначенияСписочныхАтрибутовКлассаНоменклатураПрямое.ИспользуемоеЗначение, ЛОЖЬ) = ИСТИНА
		|				ИЛИ ЕСТЬNULL(ВТ_ЗначенияСписочныхАтрибутовКлассаНоменклатураНеПрямое.ИспользуемоеЗначение, ЛОЖЬ) = ИСТИНА
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ИспользуемоеЗначение,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_ЗначенияСписочныхАтрибутовКлассаНоменклатураПрямое.ДоступноеЗначение, ЛОЖЬ) = ИСТИНА
		|				ИЛИ ЕСТЬNULL(ВТ_ЗначенияСписочныхАтрибутовКлассаНоменклатураНеПрямое.ДоступноеЗначение, ЛОЖЬ) = ИСТИНА
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ДоступноеЗначение,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_ЗначенияСписочныхАтрибутовКлассаНоменклатураНеПрямое.ДоступноеЗначение, ЛОЖЬ) = ИСТИНА
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК МожноИзменятьДоступноеЗначение,
		|	&ТипАтрибутаНоменклатура КАК МожноИзменятьИспользуемоеЗначение,
		|	ВТ_НоменклатураПроверкаПрямогоЗначения.Класс КАК Класс
		|ИЗ
		|	ВТ_НоменклатураПроверкаПрямогоЗначения КАК ВТ_НоменклатураПроверкаПрямогоЗначения
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗначенияСписочныхАтрибутовКлассаНоменклатура КАК ВТ_ЗначенияСписочныхАтрибутовКлассаНоменклатураПрямое
		|		ПО ВТ_НоменклатураПроверкаПрямогоЗначения.ЗначениеАтрибутаКласса = ВТ_ЗначенияСписочныхАтрибутовКлассаНоменклатураПрямое.ЗначениеАтрибутаКласса
		|			И (ВТ_ЗначенияСписочныхАтрибутовКлассаНоменклатураПрямое.ПрямоеЗначение)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗначенияСписочныхАтрибутовКлассаНоменклатура КАК ВТ_ЗначенияСписочныхАтрибутовКлассаНоменклатураНеПрямое
		|		ПО ВТ_НоменклатураПроверкаПрямогоЗначения.ЗначениеАтрибутаКласса = ВТ_ЗначенияСписочныхАтрибутовКлассаНоменклатураНеПрямое.ЗначениеАтрибутаКласса
		|			И (НЕ ВТ_ЗначенияСписочныхАтрибутовКлассаНоменклатураНеПрямое.ПрямоеЗначение)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗначениеАтрибутаКласса,
		|	СтатусНаследования
		|ИТОГИ
		|	Класс КАК ЗначениеАтрибутаКласса,
		|	1 КАК СтатусНаследования
		|ПО
		|	Класс
		|АВТОУПОРЯДОЧИВАНИЕ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОбъектыНоменклатурыПровекаПрямогоЗначения.ЗначениеАтрибутаКласса КАК ЗначениеАтрибутаКласса,
		|	ЕСТЬNULL(ВТ_ЗначенияСписочныхАтрибутовКлассаОбъектыНоменклатурыНеПрямоеЗначение.СтатусНаследования, ВТ_ЗначенияСписочныхАтрибутовКлассаОбъектыНоменклатурыПрямоеЗначение.СтатусНаследования) КАК СтатусНаследования,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_ЗначенияСписочныхАтрибутовКлассаОбъектыНоменклатурыПрямоеЗначение.ИспользуемоеЗначение, ЛОЖЬ) = ИСТИНА
		|				ИЛИ ЕСТЬNULL(ВТ_ЗначенияСписочныхАтрибутовКлассаОбъектыНоменклатурыНеПрямоеЗначение.ИспользуемоеЗначение, ЛОЖЬ) = ИСТИНА
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ИспользуемоеЗначение,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_ЗначенияСписочныхАтрибутовКлассаОбъектыНоменклатурыПрямоеЗначение.ДоступноеЗначение, ЛОЖЬ) = ИСТИНА
		|				ИЛИ ЕСТЬNULL(ВТ_ЗначенияСписочныхАтрибутовКлассаОбъектыНоменклатурыНеПрямоеЗначение.ДоступноеЗначение, ЛОЖЬ) = ИСТИНА
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ДоступноеЗначение,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_ЗначенияСписочныхАтрибутовКлассаОбъектыНоменклатурыНеПрямоеЗначение.ДоступноеЗначение, ЛОЖЬ) = ИСТИНА
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК МожноИзменятьДоступноеЗначение,
		|	&ТипАтрибутаОбъектНоменклатуры КАК МожноИзменятьИспользуемоеЗначение,
		|	ВТ_ОбъектыНоменклатурыПровекаПрямогоЗначения.Класс КАК Класс,
		|	ВТ_ОбъектыНоменклатурыПровекаПрямогоЗначения.Номенклатура КАК Номенклатура
		|ИЗ
		|	ВТ_ОбъектыНоменклатурыПровекаПрямогоЗначения КАК ВТ_ОбъектыНоменклатурыПровекаПрямогоЗначения
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗначенияСписочныхАтрибутовКлассаОбъектыНоменклатуры КАК ВТ_ЗначенияСписочныхАтрибутовКлассаОбъектыНоменклатурыПрямоеЗначение
		|		ПО ВТ_ОбъектыНоменклатурыПровекаПрямогоЗначения.ЗначениеАтрибутаКласса = ВТ_ЗначенияСписочныхАтрибутовКлассаОбъектыНоменклатурыПрямоеЗначение.ЗначениеАтрибутаКласса
		|			И (ВТ_ЗначенияСписочныхАтрибутовКлассаОбъектыНоменклатурыПрямоеЗначение.ПрямоеЗначение)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗначенияСписочныхАтрибутовКлассаОбъектыНоменклатуры КАК ВТ_ЗначенияСписочныхАтрибутовКлассаОбъектыНоменклатурыНеПрямоеЗначение
		|		ПО ВТ_ОбъектыНоменклатурыПровекаПрямогоЗначения.ЗначениеАтрибутаКласса = ВТ_ЗначенияСписочныхАтрибутовКлассаОбъектыНоменклатурыНеПрямоеЗначение.ЗначениеАтрибутаКласса
		|			И (НЕ ВТ_ЗначенияСписочныхАтрибутовКлассаОбъектыНоменклатурыНеПрямоеЗначение.ПрямоеЗначение)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗначениеАтрибутаКласса,
		|	СтатусНаследования
		|ИТОГИ
		|	ВЫБОР
		|		КОГДА Номенклатура ЕСТЬ NULL
		|			ТОГДА Класс
		|		ИНАЧЕ Номенклатура
		|	КОНЕЦ КАК ЗначениеАтрибутаКласса,
		|	1 КАК СтатусНаследования
		|ПО
		|	Класс,
		|	Номенклатура
		|АВТОУПОРЯДОЧИВАНИЕ";
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Функция ОбработатьДеревоСписочныхЗначенийАтрибутов(ДеревоЗначений, ИсточникЗначений)
	
	ДеревоРезультат = ДеревоЗначений.Скопировать();
	ДеревоРезультат.Строки.Очистить();
	
	ТекРодитель = ДеревоЗначений;
	ТекИд = ТекРодитель.Строки.Количество(); // от последнего элемента до первого
	
	ТекРодительНового = ДеревоРезультат;
	
	СтекОбхода = Новый Массив;
	Пока ТекИд > 0 ИЛИ СтекОбхода.Количество() > 0 Цикл
		Если ТекИд > 0 Тогда
			СтрокаДерева = ТекРодитель.Строки[ТекИд - 1];
			
			Если СтрокаДерева.Строки.Количество() > 0 Тогда
				// Если в дочерних строках есть этот же атрибут, значит надо удалить дубль.
				СтрокаНайдено = СтрокаДерева.Строки.Найти(СтрокаДерева.ЗначениеАтрибутаКласса, "ЗначениеАтрибутаКласса");
				Если НЕ СтрокаНайдено = Неопределено Тогда
					Если СтрокаНайдено.Строки.Количество() > 0 Тогда
						ЗаполнитьЗначенияСвойств(СтрокаДерева, СтрокаНайдено.Строки[0]);
					Иначе
						ЗаполнитьЗначенияСвойств(СтрокаДерева, СтрокаНайдено);
					КонецЕсли;
					СтрокаДерева.Строки.Удалить(СтрокаНайдено);
				КонецЕсли;
				
				Если СтрокаДерева.ЗначениеАтрибутаКласса = ИсточникЗначений Тогда
					СтрокаДерева.ВИерархии = Ложь;
				КонецЕсли;
				
				СтрокаНового = Неопределено;
				// Не учитываем элементы верхних уровней (уровнем выше, чем источик значений).
				Если СтрокаДерева.ВИерархии Тогда
					СтрокаНового = ТекРодительНового.Строки.Вставить(0);
					ЗаполнитьЗначенияСвойств(СтрокаНового, СтрокаДерева);
					Если НЕ ТекРодительНового = ДеревоРезультат Тогда
						Если ТекРодительНового.ДоступноеЗначениеНаследуемое Тогда
							СтрокаНового.ДоступноеЗначениеНаследуемое   = ТекРодительНового.ДоступноеЗначениеНаследуемое;
							СтрокаНового.МожноИзменятьДоступноеЗначение = Ложь;
						КонецЕсли;
						
						Если ТекРодительНового.ДоступноеЗначение И СтрокаНового.СтатусНаследования <= 3 Тогда
							СтрокаНового.ДоступноеЗначение              = Истина;
							СтрокаНового.МожноИзменятьДоступноеЗначение = Ложь;
							СтрокаНового.СтатусНаследования             = ТекРодительНового.СтатусНаследования;
							СтрокаНового.ДоступноеЗначениеНаследуемое   = ТекРодительНового.ДоступноеЗначениеНаследуемое
							
						ИначеЕсли ТекРодительНового.СтатусНаследования > 3 Тогда
							СтрокаНового.ДоступноеЗначение              = Ложь;
							СтрокаНового.МожноИзменятьДоступноеЗначение = Ложь;
							СтрокаНового.СтатусНаследования             = ТекРодительНового.СтатусНаследования;
							СтрокаНового.ДоступноеЗначениеНаследуемое   = ТекРодительНового.ДоступноеЗначениеНаследуемое
							
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				Если СтрокаДерева.Строки.Количество() > 0 Тогда
					// Если есть дочерние строки, перейдем на уровень ниже.
					СтекОбхода.Вставить(0, ТекИд - 1);
					ТекРодитель = СтрокаДерева;
					ТекИд = ТекРодитель.Строки.Количество();
					Если НЕ СтрокаНового = Неопределено Тогда
						ТекРодительНового = СтрокаНового;
					КонецЕсли;
				Иначе
					ТекИд = ТекРодитель.Строки.Индекс(СтрокаДерева);
				КонецЕсли;
			Иначе
				СтрокаНового = Неопределено;
				Если СтрокаДерева.ВИерархии Тогда
					СтрокаНового = ТекРодительНового.Строки.Вставить(0);
					ЗаполнитьЗначенияСвойств(СтрокаНового, СтрокаДерева);
					Если НЕ ТекРодительНового = ДеревоРезультат Тогда
						Если ТекРодительНового.ДоступноеЗначениеНаследуемое Тогда
							СтрокаНового.ДоступноеЗначениеНаследуемое   = ТекРодительНового.ДоступноеЗначениеНаследуемое;
							СтрокаНового.МожноИзменятьДоступноеЗначение = Ложь;
						КонецЕсли;
						
						Если ТекРодительНового.ДоступноеЗначение И СтрокаНового.СтатусНаследования <= 3 Тогда
							СтрокаНового.ДоступноеЗначение              = Истина;
							СтрокаНового.МожноИзменятьДоступноеЗначение = Ложь;
							СтрокаНового.СтатусНаследования             = ТекРодительНового.СтатусНаследования;
							СтрокаНового.ДоступноеЗначениеНаследуемое   = ТекРодительНового.ДоступноеЗначениеНаследуемое
							
						ИначеЕсли ТекРодительНового.СтатусНаследования > 3 Тогда
							СтрокаНового.ДоступноеЗначение              = Ложь;
							СтрокаНового.МожноИзменятьДоступноеЗначение = Ложь;
							СтрокаНового.СтатусНаследования             = ТекРодительНового.СтатусНаследования;
							СтрокаНового.ДоступноеЗначениеНаследуемое   = ТекРодительНового.ДоступноеЗначениеНаследуемое
							
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				ТекИд = ТекРодитель.Строки.Индекс(СтрокаДерева);
			КонецЕсли;
		КонецЕсли;
		
		Если ТекИд <= 0 И СтекОбхода.Количество() > 0 Тогда
			ТекИд = СтекОбхода[0];
			СтекОбхода.Удалить(0);
			Если ТекРодитель.ВИерархии Тогда
				ТекРодительНового = ТекРодительНового.Родитель;
				Если ТекРодительНового = Неопределено Тогда
					ТекРодительНового = ДеревоРезультат;
				КонецЕсли;
			КонецЕсли;
			ТекРодитель = ТекРодитель.Родитель;
			Если ТекРодитель = Неопределено Тогда
				ТекРодитель = ДеревоЗначений;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДеревоРезультат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСоответствиеКолонокПодчиненныхОбъектов(ИДОбъекта, КолонкиАтрибутовПодчиненныхОбъектов)
	Результат = Новый Соответствие;
	Найдено = КолонкиАтрибутовПодчиненныхОбъектов.НайтиСтроки(Новый Структура("ИДОбъекта", ИДОбъекта));
	Для Каждого СтрокаКолонка ИЗ Найдено Цикл
		Результат.Вставить(СтрокаКолонка.АтрибутКласса, СтрокаКолонка);
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаСервере
Функция ПолучитьТаблицыАтрибутовТехкарт()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА НазначениеАтрибутов.Класс В (ЗНАЧЕНИЕ(Справочник.Классы.СтрокиТехОпераций), ЗНАЧЕНИЕ(Справочник.Классы.ВложенныеТехКарты))
		|			ТОГДА 0
		|		КОГДА НазначениеАтрибутов.Класс = ЗНАЧЕНИЕ(Справочник.Классы.ТехнологическиеКарты)
		|			ТОГДА 1
		|	КОНЕЦ КАК ИДОбъекта,
		|	НазначениеАтрибутов.АтрибутКласса,
		|	ВЫБОР
		|		КОГДА НазначениеАтрибутов.АтрибутКласса ССЫЛКА ПланВидовХарактеристик.АтрибутыКласса
		|			ТОГДА АтрибутыКласса.ТипЗначения
		|		КОГДА НазначениеАтрибутов.АтрибутКласса ССЫЛКА Справочник.ВложенныеАтрибутыКласса
		|				И ВложенныеАтрибутыКласса.АтрибутКласса ССЫЛКА ПланВидовХарактеристик.АтрибутыКласса
		|			ТОГДА ВЫРАЗИТЬ(ВложенныеАтрибутыКласса.АтрибутКласса КАК ПланВидовХарактеристик.АтрибутыКласса).ТипЗначения
		|	КОНЕЦ КАК ТипЗначения,
		|	НазначениеАтрибутов.МинЗначение,
		|	НазначениеАтрибутов.МаксЗначение,
		|	НазначениеАтрибутов.РежимЗаполнения,
		|	НазначениеАтрибутов.РежимИспользования,
		|	НазначениеАтрибутов.Формат,
		|	ВЫБОР
		|		КОГДА НазначениеАтрибутов.АтрибутКласса ССЫЛКА ПланВидовХарактеристик.АтрибутыКласса
		|			ТОГДА НазначениеАтрибутов.ИсточникЗначений
		|		КОГДА НазначениеАтрибутов.АтрибутКласса ССЫЛКА Справочник.ВложенныеАтрибутыКласса
		|			ТОГДА ВложенныеАтрибутыКласса.Источник
		|	КОНЕЦ КАК ИсточникЗначений,
		|	ВЫБОР
		|		КОГДА НазначениеАтрибутов.АтрибутКласса ССЫЛКА Справочник.ВложенныеАтрибутыКласса
		|				И ВложенныеАтрибутыКласса.АтрибутКласса ССЫЛКА Перечисление.РеквизитыКлассаНоменклатуры
		|			ТОГДА ВложенныеАтрибутыКласса.АтрибутКласса
		|	КОНЕЦ КАК ВложенныйРеквизит,
		|	НазначениеАтрибутов.СписокДоступныхЗначений,
		|	НазначениеАтрибутов.МножественноеЗначение,
		|	НазначениеАтрибутов.Порядок КАК Порядок,
		|	ВЫБОР
		|		КОГДА НазначениеАтрибутов.АтрибутКласса = ЗНАЧЕНИЕ(ПланВидовХарактеристик.АтрибутыКласса.ТипТехКарты)
		|			ТОГДА ""ТипТехКарты""
		|		КОГДА НазначениеАтрибутов.АтрибутКласса = ЗНАЧЕНИЕ(ПланВидовХарактеристик.АтрибутыКласса.ВидОперации)
		|			ТОГДА ""ВидОперации""
		|		КОГДА НазначениеАтрибутов.АтрибутКласса = ЗНАЧЕНИЕ(ПланВидовХарактеристик.АтрибутыКласса.ОбъектОперации)
		|			ТОГДА ""ОбъектОперации""
		|		КОГДА НазначениеАтрибутов.АтрибутКласса = ЗНАЧЕНИЕ(ПланВидовХарактеристик.АтрибутыКласса.ТехКарты)
		|			ТОГДА ""ТехКартаВложенная""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ИмяКолонки,
		|	ВЫБОР
		|		КОГДА НазначениеАтрибутов.ИсточникЗначений ССЫЛКА Справочник.Классы
		|				И НЕ НазначениеАтрибутов.ИсточникЗначений = ЗНАЧЕНИЕ(Справочник.Классы.ПустаяСсылка)
		|			ТОГДА ВЫРАЗИТЬ(НазначениеАтрибутов.ИсточникЗначений КАК Справочник.Классы).КлассТабличнаяЧасть
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК КлассТабличнаяЧасть
		|ПОМЕСТИТЬ ВТ_ВсеАтрибуты
		|ИЗ
		|	РегистрСведений.НазначениеАтрибутов КАК НазначениеАтрибутов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.АтрибутыКласса КАК АтрибутыКласса
		|		ПО НазначениеАтрибутов.АтрибутКласса = АтрибутыКласса.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВложенныеАтрибутыКласса КАК ВложенныеАтрибутыКласса
		|		ПО НазначениеАтрибутов.АтрибутКласса = ВложенныеАтрибутыКласса.Ссылка
		|ГДЕ
		|	НазначениеАтрибутов.Класс В 
		|			(ЗНАЧЕНИЕ(Справочник.Классы.СтрокиТехОпераций), 
		|			 ЗНАЧЕНИЕ(Справочник.Классы.ВложенныеТехКарты), 
		|			 ЗНАЧЕНИЕ(Справочник.Классы.ТехнологическиеКарты))
		|		И НЕ (НазначениеАтрибутов.Класс, НазначениеАтрибутов.АтрибутКласса) В 
		|			(ВЫБРАТЬ ЗНАЧЕНИЕ(Справочник.Классы.ВложенныеТехКарты), ЗНАЧЕНИЕ(ПланВидовХарактеристик.АтрибутыКласса.ОбъектОперации))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВсеАтрибуты.ИДОбъекта,
		|	ВТ_ВсеАтрибуты.АтрибутКласса,
		|	ВТ_ВсеАтрибуты.ТипЗначения,
		|	ВТ_ВсеАтрибуты.ВложенныйРеквизит,
		|	ВТ_ВсеАтрибуты.МинЗначение,
		|	ВТ_ВсеАтрибуты.МаксЗначение,
		|	ВТ_ВсеАтрибуты.РежимЗаполнения,
		|	ВТ_ВсеАтрибуты.РежимИспользования,
		|	ВТ_ВсеАтрибуты.Формат,
		|	ВТ_ВсеАтрибуты.ИсточникЗначений,
		|	ВТ_ВсеАтрибуты.СписокДоступныхЗначений,
		|	ВТ_ВсеАтрибуты.МножественноеЗначение,
		|	ВТ_ВсеАтрибуты.Порядок КАК Порядок,
		|	ВЫРАЗИТЬ(ВТ_ВсеАтрибуты.ИмяКолонки КАК СТРОКА(50)) КАК ИмяКолонки,
		|	ВТ_ВсеАтрибуты.КлассТабличнаяЧасть
		|ИЗ
		|	ВТ_ВсеАтрибуты КАК ВТ_ВсеАтрибуты
		|ГДЕ
		|	ВТ_ВсеАтрибуты.ИДОбъекта = 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВсеАтрибуты.ИДОбъекта,
		|	ВТ_ВсеАтрибуты.АтрибутКласса,
		|	ВТ_ВсеАтрибуты.ТипЗначения,
		|	ВТ_ВсеАтрибуты.ВложенныйРеквизит,
		|	ВТ_ВсеАтрибуты.МинЗначение,
		|	ВТ_ВсеАтрибуты.МаксЗначение,
		|	ВТ_ВсеАтрибуты.РежимЗаполнения,
		|	ВТ_ВсеАтрибуты.РежимИспользования,
		|	ВТ_ВсеАтрибуты.Формат,
		|	ВТ_ВсеАтрибуты.ИсточникЗначений,
		|	ВТ_ВсеАтрибуты.СписокДоступныхЗначений,
		|	ВТ_ВсеАтрибуты.МножественноеЗначение,
		|	ВТ_ВсеАтрибуты.Порядок КАК Порядок,
		|	ВЫРАЗИТЬ(ВТ_ВсеАтрибуты.ИмяКолонки КАК СТРОКА(50)) КАК ИмяКолонки,
		|	ВТ_ВсеАтрибуты.КлассТабличнаяЧасть
		|ИЗ
		|	ВТ_ВсеАтрибуты КАК ВТ_ВсеАтрибуты
		|ГДЕ
		|	ВТ_ВсеАтрибуты.ИДОбъекта = 1
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВсеАтрибуты.АтрибутКласса,
		|	ВТ_ВсеАтрибуты.ИсточникЗначений,
		|	ВЫРАЗИТЬ(ВТ_ВсеАтрибуты.ИсточникЗначений КАК ПланВидовХарактеристик.АтрибутыКласса).ТипЗначения КАК ТипИсточникаЗначений,
		|	ВТ_ВсеАтрибуты.ВложенныйРеквизит
		|ИЗ
		|	ВТ_ВсеАтрибуты КАК ВТ_ВсеАтрибуты
		|ГДЕ
		|	НЕ ВТ_ВсеАтрибуты.ВложенныйРеквизит ЕСТЬ NULL";
	РезультатыЗапросов = Запрос.ВыполнитьПакет();
	
	Результат = Новый Массив;
	
	ТипыЗначенийРеквизитов = Новый Соответствие;
	
	ВыборкаВложенныхРеквизитов = РезультатыЗапросов[3].Выбрать();
	Пока ВыборкаВложенныхРеквизитов.Следующий() Цикл 
		ТипРеквизита = ТипыЗначенийРеквизитов[ВыборкаВложенныхРеквизитов.АтрибутКласса];
		Если ТипРеквизита = Неопределено Тогда
			МетаданныеСпр = Метаданные.НайтиПоТипу(ВыборкаВложенныхРеквизитов.ТипИсточникаЗначений.Типы()[0]);
			МетаданныеРеквизита = Перечисления.РеквизитыКлассаНоменклатуры.ПолучитьМетаданныеРеквизита(МетаданныеСпр, 
				ВыборкаВложенныхРеквизитов.ВложенныйРеквизит);
			ТипыЗначенийРеквизитов.Вставить(ВыборкаВложенныхРеквизитов.АтрибутКласса, МетаданныеРеквизита.Тип);
		КонецЕсли;
	КонецЦикла;
	
	ТипВложенныйАтрибут = Тип("СправочникСсылка.ВложенныеАтрибутыКласса");
	
	ТаблицаАтрибутов = РезультатыЗапросов[1].Выгрузить();
	ТаблицаАтрибутов.Колонки.Добавить("ТипЗначенияРеквизита", Новый ОписаниеТипов("Строка"));
	
	Для Каждого СтрокаТаблицы ИЗ ТаблицаАтрибутов Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ТипЗначения) И ТипЗнч(СтрокаТаблицы.АтрибутКласса) = ТипВложенныйАтрибут Тогда
			ТипРеквизита = ТипыЗначенийРеквизитов[СтрокаТаблицы.АтрибутКласса];
			Если НЕ ТипРеквизита = Неопределено Тогда
				СтрокаТаблицы.ТипЗначения = ТипРеквизита;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Результат.Добавить(Новый Структура("ИДОбъекта, ИмяТаблицы, ТаблицаАтрибутов", 
		0, "СоставТехКарты", ТаблицаАтрибутов));
	
	ТаблицаАтрибутов = РезультатыЗапросов[2].Выгрузить();
	ТаблицаАтрибутов.Колонки.Добавить("ТипЗначенияРеквизита", Новый ОписаниеТипов("Строка"));
	
	Для Каждого СтрокаТаблицы ИЗ ТаблицаАтрибутов Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ТипЗначения) И ТипЗнч(СтрокаТаблицы.АтрибутКласса) = ТипВложенныйАтрибут Тогда
			ТипРеквизита = ТипыЗначенийРеквизитов[СтрокаТаблицы.АтрибутКласса];
			Если НЕ ТипРеквизита = Неопределено Тогда
				СтрокаТаблицы.ТипЗначения = ТипРеквизита;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Результат.Добавить(Новый Структура("ИДОбъекта, ИмяТаблицы, ТаблицаАтрибутов", 
		1, "ТехКарты", ТаблицаАтрибутов));
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура УдалитьКолонкиАтрибутовПодчиненныхОбъектов(ИДОбъекта, ИмяТаблицы)
	
	Найдено = КолонкиАтрибутовПодчиненныхОбъектов.НайтиСтроки(Новый Структура("ИДОбъекта", ИДОбъекта));
	МассивУдаляемых = Новый Массив;
	Для Каждого СтрокаКолонка ИЗ Найдено Цикл
		Если НЕ ПустаяСтрока(СтрокаКолонка.ИмяКолонки) Тогда
			МассивУдаляемых.Добавить(ИмяТаблицы + "." + СтрокаКолонка.ИмяКолонки);
			Элементы.Удалить(Элементы[СтрокаКолонка.ИмяПоля]);
		КонецЕсли;
		КолонкиАтрибутовПодчиненныхОбъектов.Удалить(СтрокаКолонка);
	КонецЦикла;
	
	ИзменитьРеквизиты(, МассивУдаляемых);
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьКолонкиАтрибутовПодчиненныхОбъектов(ИДОбъекта, ИмяТаблицы, ТаблицаАтрибутов, Знач ИмяЭлемента="")
	
	КолонкиТаблицы = ТаблицаАтрибутов.Колонки;
	ЕстьСтатусНаследования  = НЕ (КолонкиТаблицы.Найти("СтатусНаследования") = Неопределено);
	ЕстьКлассТабличнаяЧасть = НЕ (КолонкиТаблицы.Найти("КлассТабличнаяЧасть") = Неопределено);
	
	Если ИмяЭлемента = "" Тогда
		ИмяЭлемента = ИмяТаблицы;
	КонецЕсли;
	
	ТипСтрока = Тип("Строка");
	
	Н = 1;
	МассивДобавляемых = Новый Массив;
	Для Каждого СтрокаКолонки ИЗ ТаблицаАтрибутов Цикл
		ЭтоНенаследуемый = ЕстьСтатусНаследования И СтрокаКолонки.СтатусНаследования > 3;
		Если НЕ ЗначениеЗаполнено(СтрокаКолонки.ТипЗначения) И ЗначениеЗаполнено(СтрокаКолонки.ТипЗначенияРеквизита) Тогда
			СтрокаКолонки.ТипЗначения = ЗначениеИзСтрокиВнутр(СтрокаКолонки.ТипЗначенияРеквизита);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаКолонки.ТипЗначения) Тогда
			Продолжить;
		КонецЕсли;
		
		ЭтоСтрока = СтрокаКолонки.ТипЗначения.СодержитТип(ТипСтрока);
		Если ЭтоНенаследуемый ИЛИ НЕ ЭтоСтрока И СтрокаКолонки.МножественноеЗначение Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаКолонки.ИмяКолонки) Тогда
			ИмяРеквизита = ИмяТаблицы + "Атрибут" + Н;
			НовыйРеквизит = Новый РеквизитФормы(
				ИмяРеквизита, СтрокаКолонки.ТипЗначения, ИмяТаблицы, Строка(СтрокаКолонки.АтрибутКласса));
			МассивДобавляемых.Добавить(НовыйРеквизит);
			СтрокаКолонки.ИмяКолонки = ИмяРеквизита;
		Иначе
			ИмяРеквизита = СтрокаКолонки.ИмяКолонки;
		КонецЕсли;
		
		СтрокаТЧ = КолонкиАтрибутовПодчиненныхОбъектов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаКолонки);
		СтрокаТЧ.ИмяПоля = ИмяЭлемента + ИмяРеквизита;
		СтрокаТЧ.ИДОбъекта = ИДОбъекта;
		СтрокаТЧ.ЭтоВложенныйАтрибут = (ТипЗнч(СтрокаТЧ.АтрибутКласса) = Тип("СправочникСсылка.ВложенныеАтрибутыКласса"));
		
		Н = Н + 1;
	КонецЦикла;
	
	ИзменитьРеквизиты(МассивДобавляемых);
	
	Для Каждого СтрокаКолонки ИЗ ТаблицаАтрибутов Цикл
		Если ПустаяСтрока(СтрокаКолонки.ИмяКолонки) Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяПоля = ИмяЭлемента + СтрокаКолонки.ИмяКолонки;
		
		Найдено = Элементы.Найти(ИмяПоля);
		Если Не Найдено = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйЭлемент = Элементы.Добавить(ИмяПоля, Тип("ПолеФормы"), Элементы[ИмяЭлемента]);
		НовыйЭлемент.Вид         = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = ИмяТаблицы + "." + СтрокаКолонки.ИмяКолонки;
		НовыйЭлемент.Заголовок   = Строка(СтрокаКолонки.АтрибутКласса);
		НовыйЭлемент.Видимость   = Истина;
		НовыйЭлемент.Ширина      = 14;
		НовыйЭлемент.ТолькоПросмотр = (ТипЗнч(СтрокаКолонки.АтрибутКласса) = Тип("СправочникСсылка.ВложенныеАтрибутыКласса"));
		
		Если СтрокаКолонки.РежимЗаполнения = Перечисления.РежимыЗаполненияАтрибутов.ОбязательныйДляНоменклатуры Тогда
			НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;
		КонецЕсли;
		
		НовыйЭлемент.УстановитьДействие("НачалоВыбора", "АтрибутПодчиненногоНачалоВыбора");
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВложенныеТабличныеЧасти(ТаблицаАтрибутов, ТипОбъекта, СписокЗначений)
	
	Для Каждого СтрокаАтрибут ИЗ ТаблицаАтрибутов Цикл
		Если СтрокаАтрибут.КлассТабличнаяЧасть И СтрокаАтрибут.МножественноеЗначение Тогда
			СписочныйАтрибут = СписочныеАтрибуты.Добавить();
			СписочныйАтрибут.ИДАтрибута          = НайтиНовыйИД(СписочныеАтрибуты, "ИДАтрибута", 2);
			СписочныйАтрибут.АтрибутКласса       = СтрокаАтрибут.АтрибутКласса;
			СписочныйАтрибут.КлассТабличнаяЧасть = Истина;
			СписочныйАтрибут.ТипОбъекта          = ТипОбъекта;
			СписочныйАтрибут.ИсточникЗначений    = СтрокаАтрибут.ИсточникЗначений;
			
			СписокЗначений.Добавить(СписочныйАтрибут.ИДАтрибута, Строка(СписочныйАтрибут.АтрибутКласса));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере 
Функция ТекстЗапросаТипыСтрок()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Классы.Ссылка КАК СтрокаОпераций,
		|	0 КАК ТипСтроки
		|ИЗ
		|	Справочник.Классы КАК Классы
		|ГДЕ
		|	Классы.Ссылка В(&ЗначенияСтрок)
		|	И Классы.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.Классы.СтрокиТехОпераций))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Классы.Ссылка,
		|	2
		|ИЗ
		|	Справочник.Классы КАК Классы
		|ГДЕ
		|	Классы.Ссылка В(&ЗначенияСтрок)
		|	И Классы.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.Классы.ВложенныеТехКарты))";
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Процедура ВывестиСоставТехКартыНаСервере(ТехКарта)
	
	Если ТехКарта < 0 Тогда
		СоставТехКарты.ПолучитьЭлементы().Очистить();
		Возврат;
	КонецЕсли;
	
	ДеревоСоставТехКарты = РеквизитФормыВЗначение("СоставТехКарты");
	ДеревоСоставТехКарты.Строки.Очистить();
	
	Объект.СтрокиТабличныхАтрибутов.Сортировать("ИДСтрокиРодителя, АтрибутКласса, Порядок");
	СтруктураПоиска = Новый Структура("ИДСтрокиРодителя", ТехКарта);
	НайденоСтроки = Объект.СтрокиТабличныхАтрибутов.НайтиСтроки(СтруктураПоиска);
	
	ВложеннаяТехКарта = Справочники.Классы.ВложенныеТехКарты;
	
	СоответствиеСтрокТабличногоАтрибута = Новый Соответствие;
	СтруктураПоискаПоТипам = Новый Структура("СтрокаОпераций");
	
	Для Каждого СтрокаОперация ИЗ НайденоСтроки Цикл
		
		СтрокаСостава = ДеревоСоставТехКарты.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСостава, СтрокаОперация);
		СоответствиеСтрокТабличногоАтрибута.Вставить(СтрокаОперация.ИДСтроки, СтрокаСостава);
		
		ЕстьЗначениеАтрибутаКласса = ЗначениеЗаполнено(СтрокаОперация.ЗначениеАтрибутаКласса);
		
		Если НЕ ЕстьЗначениеАтрибутаКласса 
				И СтрокаОперация.ИсточникЗначений = ВложеннаяТехКарта Тогда
			СтрокаСостава.ТипСтроки = 2;
			
		ИначеЕсли ЕстьЗначениеАтрибутаКласса Тогда
			СтруктураПоискаПоТипам.СтрокаОпераций = СтрокаОперация.ЗначениеАтрибутаКласса;
			НайденоТипы = ТипыСтрок.НайтиСтроки(СтруктураПоискаПоТипам);
			Если НайденоТипы.Количество() > 0 Тогда
				СтрокаСостава.ТипСтроки = НайденоТипы[0].ТипСтроки;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	// Заполнение таб.части.
	Объект.ЗначенияТабличныхАтрибутов.Сортировать("ИДСтрокиРодителя, АтрибутКласса, ИДСтроки");
	НайденоЗначения = Объект.ЗначенияТабличныхАтрибутов.НайтиСтроки(СтруктураПоиска);
	
	СоответствиеКолонок = ПолучитьСоответствиеКолонокПодчиненныхОбъектов(0, КолонкиАтрибутовПодчиненныхОбъектов);
	ТипОбъектНоменклатуры = Тип("СправочникСсылка.ОбъектыНоменклатуры");
	ТипНоменклатураКласса = Тип("СправочникСсылка.НоменклатураКласса");
	ТипКласс = Тип("СправочникСсылка.Классы");
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(ТипОбъектНоменклатуры);
	МассивТипов.Добавить(ТипНоменклатураКласса);
	МассивТипов.Добавить(ТипКласс);
	
	Для Каждого СтрокаЗначение ИЗ НайденоЗначения Цикл
		СтрокаТЧ = СоответствиеСтрокТабличногоАтрибута[СтрокаЗначение.ИДСтроки];
		Если СтрокаТЧ = Неопределено Тогда
			СтрокаТЧ = ДеревоСоставТехКарты.Строки.Добавить();
			СтрокаТЧ.ИДСтроки = СтрокаЗначение.ИДСтроки;
			СоответствиеСтрокТабличногоАтрибута.Вставить(СтрокаЗначение.ИДСтроки, СтрокаТЧ);
		КонецЕсли;
		
		СтрокаКолонка = СоответствиеКолонок[СтрокаЗначение.АтрибутТаблицы];
		Если НЕ СтрокаКолонка = Неопределено Тогда
			СоставнойТип = (СтрокаКолонка.ТипЗначения.СодержитТип(ТипНоменклатураКласса) 
				ИЛИ СтрокаКолонка.ТипЗначения.СодержитТип(ТипОбъектНоменклатуры));
			ЭтоЭлементСоставногоТипа = СоставнойТип 
				И НЕ (МассивТипов.Найти(ТипЗнч(СтрокаЗначение.ЗначениеАтрибутаТаблицы)) = Неопределено);
			СтрокаТЧ[СтрокаКолонка.ИмяКолонки] = ?(СоставнойТип И ЭтоЭлементСоставногоТипа,
				СтрокаЗначение.ЗначениеАтрибутаТаблицы,
				СтрокаКолонка.ТипЗначения.ПривестиЗначение(СтрокаЗначение.ЗначениеАтрибутаТаблицы));
		КонецЕсли;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоСоставТехКарты, "СоставТехКарты");
	
	ОбновитьДанныеТекКласса();
	
КонецПроцедуры

&НаСервере
Процедура ВывестиТехкартыНаСервере()
	
	ВывестиТаблицуВложенногоАтрибута("ТехКарты", 0, ПланыВидовХарактеристик.АтрибутыКласса.ТехКарты, 1);
	
	// Заполним наиментвание типа тех.карты.
	СоответствиеКолонок = ПолучитьСоответствиеКолонокПодчиненныхОбъектов(1, КолонкиАтрибутовПодчиненныхОбъектов);
	АтрибутТипТХ = ПланыВидовХарактеристик.АтрибутыКласса.ТипТехКарты;
	СтрокаКолонка = СоответствиеКолонок[АтрибутТипТХ];
	Для Каждого СтрокаТЧ ИЗ ТехКарты Цикл
		СтрокаТЧ.НаименованиеТипа = Строка(СтрокаТЧ[СтрокаКолонка.ИмяКолонки]);
	КонецЦикла;
	
	// Операции, доступные для подбора.
	ВывесиДоступныеОперацииНаСервере();
	
	// Типы строк операций.
	ЗначенияСтрок = Объект.СтрокиТабличныхАтрибутов.Выгрузить(Новый Структура("АтрибутКласса", 
		ПланыВидовХарактеристик.АтрибутыКласса.ТехОперации), "ИсточникЗначений, ЗначениеАтрибутаКласса");
	Для Каждого СтрокаТЗ ИЗ ЗначенияСтрок Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТЗ.ЗначениеАтрибутаКласса) Тогда
			СтрокаТЗ.ЗначениеАтрибутаКласса = СтрокаТЗ.ИсточникЗначений;
		КонецЕсли;
	КонецЦикла;
	ЗначенияСтрок = ЗначенияСтрок.ВыгрузитьКолонку("ЗначениеАтрибутаКласса");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗначенияСтрок", ЗначенияСтрок);
	Запрос.Текст = ТекстЗапросаТипыСтрок();
	ЗначениеВРеквизитФормы(Запрос.Выполнить().Выгрузить(), "ТипыСтрок");
	
	ТекТехКарта = -1;
	ТекОперация = -1;
	
	// Таб.части операций.
	ПодготовитьВложеннуюТаблицуТехкарт();
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьВложеннуюТаблицуТехкарт()
	
	Если ТекТаблицаТехКарты = ПланыВидовХарактеристик.АтрибутыКласса.ТехОперации Тогда
		ТипОбъекта = 1;
		ТекТаблицаНаВывод    = "ТекТаблицаОперации";
		ПереключательТаблицы = "ПереключательТабличныхАтрибутовОпераций";
		ИмяЭлементаТаблицы   = "ЗначениеТабличногоАтрибутаОперации";
	Иначе
		ТипОбъекта = 2;
		ТекТаблицаНаВывод    = "ТекТаблицаТехКарты";
		ПереключательТаблицы = "ПереключательТабличныхАтрибутовТехКарт";
		ИмяЭлементаТаблицы   = "ЗначениеТабличногоАтрибутаТехКарты";
	КонецЕсли;
	
	НайденоТабЧасти = СписочныеАтрибуты.НайтиСтроки(Новый Структура("ТипОбъекта", ТипОбъекта));
	Если НайденоТабЧасти.Количество() > 0 Тогда
		ИсточникЗначений = Неопределено;
		// Поиск таблицы на вывод.
		Если ЗначениеЗаполнено(ЭтаФорма[ТекТаблицаНаВывод]) Тогда
			Для Каждого СтрокаАтрибут ИЗ НайденоТабЧасти Цикл
				Если СтрокаАтрибут.АтрибутКласса = ЭтаФорма[ТекТаблицаНаВывод] Тогда
					ИсточникЗначений = СтрокаАтрибут.ИсточникЗначений;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		// Если таблица на вывод не найдена, выберем первую вложенную таблицу.
		Если ИсточникЗначений = Неопределено Тогда
			ЭтаФорма[ТекТаблицаНаВывод]    = НайденоТабЧасти[0].АтрибутКласса;
			ИсточникЗначений               = НайденоТабЧасти[0].ИсточникЗначений;
			ЭтаФорма[ПереключательТаблицы] = НайденоТабЧасти[0].ИДАтрибута;
		КонецЕсли;
		
		ПодготовитьТаблицуВложенногоАтрибута(ИсточникЗначений, ИмяЭлементаТаблицы);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьТаблицуВложенногоАтрибута(ИсточникЗначений, ИмяЭлемента)
	
	ТекСписокРодителей = Справочники.Классы.ПолучитьТаблицуРодителей(ИсточникЗначений);
	ТаблицаАтрибутов   = Справочники.Классы.ПолучитьТаблицуАтрибутов(ТекСписокРодителей);
	ТаблицаАтрибутов.Колонки.Добавить("ИмяКолонки", Новый ОписаниеТипов("Строка"));
	
	УдалитьКолонкиАтрибутовПодчиненныхОбъектов(2, "ЗначениеТабличногоАтрибута");
	ПодготовитьКолонкиАтрибутовПодчиненныхОбъектов(2, "ЗначениеТабличногоАтрибута", ТаблицаАтрибутов, ИмяЭлемента);
	
КонецПроцедуры

&НаСервере
Процедура ВывестиТаблицуВложенногоАтрибута(Знач ТаблицаФормы, ИДСтрокиРодителя, АтрибутКласса, ИДОбъекта)
	
	ТаблицаФормы = ЭтаФорма[ТаблицаФормы];
	
	СтруктураПоиска = Новый Структура("ИДСтрокиРодителя, АтрибутКласса", ИДСтрокиРодителя, АтрибутКласса);
	ТаблицаСтрок = Объект.СтрокиТабличныхАтрибутов.Выгрузить(СтруктураПоиска);
	ТаблицаСтрок.Сортировать("Порядок");
	ТаблицаФормы.Загрузить(ТаблицаСтрок);
	
	СоответствиеСтрокТабличногоАтрибута = Новый Соответствие;
	Для Каждого СтрокаТЗ ИЗ ТаблицаФормы Цикл
		СоответствиеСтрокТабличногоАтрибута.Вставить(СтрокаТЗ.ИДСтроки, СтрокаТЗ);
	КонецЦикла;
	
	// Заполнение колонок таб.части.
	Объект.ЗначенияТабличныхАтрибутов.Сортировать("ИДСтрокиРодителя, АтрибутКласса, ИДСтроки");
	НайденоЗначения = Объект.ЗначенияТабличныхАтрибутов.НайтиСтроки(СтруктураПоиска);
	
	СоответствиеКолонок = ПолучитьСоответствиеКолонокПодчиненныхОбъектов(ИДОбъекта, КолонкиАтрибутовПодчиненныхОбъектов);
	
	Для Каждого СтрокаЗначение ИЗ НайденоЗначения Цикл
		СтрокаТЧ = СоответствиеСтрокТабличногоАтрибута[СтрокаЗначение.ИДСтроки];
		Если СтрокаТЧ = Неопределено Тогда
			СтрокаТЧ = ТаблицаФормы.Добавить();
			СтрокаТЧ.ИДСтроки = СтрокаЗначение.ИДСтроки;
			СоответствиеСтрокТабличногоАтрибута.Вставить(СтрокаЗначение.ИДСтроки, СтрокаТЧ);
		КонецЕсли;
		
		СтрокаКолонка = СоответствиеКолонок[СтрокаЗначение.АтрибутТаблицы];
		Если НЕ СтрокаКолонка = Неопределено Тогда
			СтрокаТЧ[СтрокаКолонка.ИмяКолонки] = 
				СтрокаКолонка.ТипЗначения.ПривестиЗначение(СтрокаЗначение.ЗначениеАтрибутаТаблицы);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьТаблицуУзловойСтруктурыВоВременноеХранилище()
	
	ДеревоВыбора = РеквизитФормыВЗначение("ДоступныеОперации");
	ДеревоВыбора.Строки.Очистить();
	
	// Узловая структура.
	СтруктураПоиска = Новый Структура("АтрибутКласса, ИспользуемоеЗначение",
		ПланыВидовХарактеристик.АтрибутыКласса.УзловаяСтруктура, Истина);
	МассивУзлов = Объект.ЗначенияСписочныхАтрибутов.Выгрузить(
		СтруктураПоиска, "ЗначениеАтрибутаКласса").ВыгрузитьКолонку("ЗначениеАтрибутаКласса");
	ВывестиУзлыОперации(МассивУзлов, ДеревоВыбора.Строки, , Ложь);
	
	ДеревоВыбора.Колонки.Добавить("ДоступенВыбор", Новый ОписаниеТипов("Булево"));
	Для Каждого СтрокаДерева ИЗ ДеревоВыбора.Строки Цикл 
		СтрокаДерева.ДоступенВыбор = Истина;
		Если СтрокаДерева.Строки.Количество() > 0 Тогда
			Для Каждого ПодстрокаДерева ИЗ СтрокаДерева.Строки Цикл
				ПодстрокаДерева.ДоступенВыбор = Истина;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	// Тек.класс.
	СтрокаДерева = ДеревоВыбора.Строки.Вставить(0);
	СтрокаДерева.КартинкаСтрок = 1;
	СтрокаДерева.Объект = Объект.Класс.Ссылка;
	СтрокаДерева.ДоступенВыбор = Истина;
	Если НЕ ЗначениеЗаполнено(СтрокаДерева.Объект) Тогда
		СтрокаДерева.ПредставлениеЗначения = ?(ПустаяСтрока(Объект.Наименование), НСтр("ru='(Этот класс)'"), Объект.Наименование);
	КонецЕсли;
	
	Адрес = ПоместитьВоВременноеХранилище(ДеревоВыбора, УникальныйИдентификатор);
	Возврат Адрес;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПорядокСтрокТабличныхАтрибутов(ТаблицаФормы, ИДСтрокиРодителя, АтрибутКласса)
	
	// Настройка порядка строк.
	СоответствиеСтрок = Новый Соответствие;
	Для Каждого СтрокаТЧ ИЗ ТаблицаФормы Цикл
		СоответствиеСтрок.Вставить(СтрокаТЧ.ИДСтроки, ТаблицаФормы.Индекс(СтрокаТЧ));
	КонецЦикла;
	
	НайденоПорядок = Объект.СтрокиТабличныхАтрибутов.НайтиСтроки(
		Новый Структура("ИДСтрокиРодителя, АтрибутКласса", ИДСтрокиРодителя, АтрибутКласса));
	Для Каждого СтрокаПорядок ИЗ НайденоПорядок Цикл
		СтрокаПорядок.Порядок = СоответствиеСтрок[СтрокаПорядок.ИДСтроки];
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВложенныеСтрокиТабличногоАтрибута(ИДСтроки)
	
	СтруктураПоиска = Новый Структура("ИДСтрокиРодителя", ИДСтроки);
	
	Найдено = Объект.СтрокиТабличныхАтрибутов.НайтиСтроки(СтруктураПоиска);
	Для Каждого СтрокаНайдено ИЗ Найдено Цикл
		УдалитьВложенныеСтрокиТабличногоАтрибута(СтрокаНайдено.ИДСтроки);
		Объект.СтрокиТабличныхАтрибутов.Удалить(СтрокаНайдено);
	КонецЦикла;
	
	Найдено = Объект.ЗначенияТабличныхАтрибутов.НайтиСтроки(СтруктураПоиска);
	Для Каждого СтрокаНайдено ИЗ Найдено Цикл
		Объект.ЗначенияТабличныхАтрибутов.Удалить(СтрокаНайдено);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВыбранныеСтрокиТабличногоАтрибута(ТаблицаФормы, Выбраны, ИДСтрокиРодителя, АтрибутКласса)
	
	СтруктураПоиска = Новый Структура("ИДСтрокиРодителя, АтрибутКласса, ИДСтроки", ИДСтрокиРодителя, АтрибутКласса);
	
	Для Каждого ИДСтроки ИЗ Выбраны Цикл
		СтрокаКУдалению = ТаблицаФормы.НайтиПоИдентификатору(ИДСтроки);
		СтруктураПоиска.ИДСтроки = СтрокаКУдалению.ИДСтроки;
		
		Найдено = Объект.СтрокиТабличныхАтрибутов.НайтиСтроки(СтруктураПоиска);
		Если Найдено.Количество() > 0 Тогда
			Объект.СтрокиТабличныхАтрибутов.Удалить(Найдено[0]);
		КонецЕсли;
		
		Найдено = Объект.ЗначенияТабличныхАтрибутов.НайтиСтроки(СтруктураПоиска);
		Для Каждого СтрокаЗначение ИЗ Найдено Цикл
			Объект.ЗначенияТабличныхАтрибутов.Удалить(СтрокаЗначение);
		КонецЦикла;
		
		УдалитьВложенныеСтрокиТабличногоАтрибута(СтруктураПоиска.ИДСтроки);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоместитьЗначенияАтрибутовСтрокВДанныеОбработки(ТекДанные, ОтменаРедактирования, ИДСтрокиРодителя, АтрибутКласса, ИДОбъекта)
	
	СтруктураПоиска = Новый Структура("ИДСтрокиРодителя, АтрибутКласса, ИДСтроки", 
		ИДСтрокиРодителя, АтрибутКласса, ТекДанные.ИДСтроки);
	
	НайденоЗначения = Объект.ЗначенияТабличныхАтрибутов.НайтиСтроки(СтруктураПоиска);
	НайденоКолонки  = КолонкиАтрибутовПодчиненныхОбъектов.НайтиСтроки(Новый Структура("ИДОбъекта", ИДОбъекта));
	
	АтрибутКлассаВложеннаяКарта = ПредопределенноеЗначение("ПланВидовХарактеристик.АтрибутыКласса.ТехКарты");
	ТипКласс = Новый ОписаниеТипов("СправочникСсылка.Классы");

	// Чтение вложенных атрибутов.
	НайденоВложенныеАтрибуты = КолонкиАтрибутовПодчиненныхОбъектов.НайтиСтроки(Новый Структура("ИДОбъекта, ЭтоВложенныйАтрибут", ИДОбъекта, Истина));
	Если НайденоВложенныеАтрибуты.Количество() > 0 Тогда
		СоответствиеОбъектов        = Новый Соответствие;
		МассивВложенныхАтрибутов    = Новый Массив;
		МассивКлассовДляЧтения      = Новый Массив;
		МассивНоменклатурыДляЧтения = Новый Массив;
		
		Для Каждого СтрокаВложенныйАтрибут ИЗ НайденоВложенныеАтрибуты Цикл
			МассивВложенныхАтрибутов.Добавить(СтрокаВложенныйАтрибут.АтрибутКласса);
			Для Каждого КолонкаИсточник ИЗ НайденоКолонки Цикл
				Если КолонкаИсточник.АтрибутКласса = СтрокаВложенныйАтрибут.ИсточникЗначений Тогда
					ОбъектИсточник = ТекДанные[КолонкаИсточник.ИмяКолонки];
					Если ЗначениеЗаполнено(ОбъектИсточник) И СоответствиеОбъектов[СтрокаВложенныйАтрибут.ИсточникЗначений] = Неопределено Тогда
						СоответствиеОбъектов.Вставить(СтрокаВложенныйАтрибут.ИсточникЗначений, ОбъектИсточник);
						Если ТипЗнч(ОбъектИсточник) = Тип("СправочникСсылка.Классы") Тогда
							МассивКлассовДляЧтения.Добавить(ОбъектИсточник);
						ИначеЕсли ТипЗнч(ОбъектИсточник) = Тип("СправочникСсылка.НоменклатураКласса") Тогда
							МассивНоменклатурыДляЧтения.Добавить(ОбъектИсточник);
						КонецЕсли;
					КонецЕсли;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		ЗначенияВложенныхАтрибутов = ПрочитатьЗначенияВложенныхАтрибутов(СоответствиеОбъектов,
			МассивКлассовДляЧтения, МассивНоменклатурыДляЧтения, МассивВложенныхАтрибутов);
	КонецЕсли;
	
	Для Каждого СтрокаКолонка ИЗ НайденоКолонки Цикл
		Заполнено = Ложь;
		Если СтрокаКолонка.ЭтоВложенныйАтрибут Тогда
			Если НЕ ЗначенияВложенныхАтрибутов = Неопределено Тогда
				ЗначениеВложенногоАтрибута = ЗначенияВложенныхАтрибутов[СтрокаКолонка.АтрибутКласса];
			Иначе
				ЗначениеВложенногоАтрибута = Неопределено;
			КонецЕсли;
			
			ТекДанные[СтрокаКолонка.ИмяКолонки] = ЗначениеВложенногоАтрибута;
			
			Для Каждого СтрокаЗначение ИЗ НайденоЗначения Цикл
				Если СтрокаКолонка.АтрибутКласса = СтрокаЗначение.АтрибутТаблицы Тогда
					СтрокаЗначение.ЗначениеАтрибутаТаблицы = ЗначениеВложенногоАтрибута;
					Заполнено = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если НЕ Заполнено И ЗначениеЗаполнено(ЗначениеВложенногоАтрибута) Тогда
				СтрокаЗначение = Объект.ЗначенияТабличныхАтрибутов.Добавить();
				СтрокаЗначение.ИДСтрокиРодителя        = ИДСтрокиРодителя;
				СтрокаЗначение.АтрибутКласса           = АтрибутКласса;
				СтрокаЗначение.АтрибутТаблицы          = СтрокаКолонка.АтрибутКласса;
				СтрокаЗначение.ИДСтроки                = ТекДанные.ИДСтроки;
				СтрокаЗначение.ЗначениеАтрибутаТаблицы = ЗначениеВложенногоАтрибута;
			КонецЕсли;
			
		Иначе
			Для Каждого СтрокаЗначение ИЗ НайденоЗначения Цикл
				Если СтрокаКолонка.АтрибутКласса = СтрокаЗначение.АтрибутТаблицы Тогда
					Если ОтменаРедактирования Тогда
						// Восстановление предыдущих значений.
						Если СтрокаКолонка.АтрибутКласса = АтрибутКлассаВложеннаяКарта Тогда
							ТекДанные[СтрокаКолонка.ИмяКолонки] = ТипКласс.ПривестиЗначение(СтрокаЗначение.ЗначениеАтрибутаТаблицы);
						Иначе
							ТекДанные[СтрокаКолонка.ИмяКолонки] = 
								СтрокаКолонка.ТипЗначения.ПривестиЗначение(СтрокаЗначение.ЗначениеАтрибутаТаблицы);
						КонецЕсли;
					Иначе
						// Сохранение новых значений.
						СтрокаЗначение.ЗначениеАтрибутаТаблицы = ТекДанные[СтрокаКолонка.ИмяКолонки];
					КонецЕсли;
					Заполнено = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если НЕ Заполнено Тогда
				Если ОтменаРедактирования Тогда
					// Восстановление предыдущих значений.
					ТекДанные[СтрокаКолонка.ИмяКолонки] = СтрокаКолонка.ТипЗначения.ПривестиЗначение();
				Иначе
					// Сохранение новых значений.
					СтрокаЗначение = Объект.ЗначенияТабличныхАтрибутов.Добавить();
					СтрокаЗначение.ИДСтрокиРодителя        = ИДСтрокиРодителя;
					СтрокаЗначение.АтрибутКласса           = АтрибутКласса;
					СтрокаЗначение.АтрибутТаблицы          = СтрокаКолонка.АтрибутКласса;
					СтрокаЗначение.ИДСтроки                = ТекДанные.ИДСтроки;
					СтрокаЗначение.ЗначениеАтрибутаТаблицы = ТекДанные[СтрокаКолонка.ИмяКолонки];
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПрочитатьЗначенияВложенныхАтрибутов(СоответствиеОбъектов, 
		МассивКлассовДляЧтения, МассивНоменклатурыДляЧтения, МассивВложенныхАтрибутов)
	
	Возврат Справочники.ВложенныеАтрибутыКласса.ПрочитатьЗначенияВложенныхАтрибутов(СоответствиеОбъектов, 
		МассивКлассовДляЧтения, МассивНоменклатурыДляЧтения, МассивВложенныхАтрибутов);
	
КонецФункции

&НаКлиенте
Процедура РазвернутьСвернутьДеревоФормы(ЭлементДерево, ДеревоФормы, РежимРазвернуть=Истина)
	
	ЭлементыДерева = ДеревоФормы.ПолучитьЭлементы();
	Для Каждого СтрокаДерева ИЗ ЭлементыДерева Цикл
		Если РежимРазвернуть Тогда
			ЭлементДерево.Развернуть(СтрокаДерева.ПолучитьИдентификатор(), Истина);
		Иначе
			ЭлементДерево.Свернуть(СтрокаДерева.ПолучитьИдентификатор());
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтрокуУзла(СтрокиДерева, СоответствиеСтрокУзлов, ТекКласс)
	
	УзелРодитель = СоответствиеСтрокУзлов[ТекКласс];
	Если УзелРодитель = Неопределено Тогда
		СтрокаТекКласс = СтрокиДерева.Добавить();
		СтрокаТекКласс.КартинкаСтрок = 1;
		СтрокаТекКласс.ТипСтроки     = 1;
		СтрокаТекКласс.Объект = ТекКласс;
		
		СоответствиеСтрокУзлов.Вставить(ТекКласс, СтрокаТекКласс);
	ИначеЕсли ТипЗнч(УзелРодитель) = Тип("СправочникСсылка.Классы") Тогда
		СтрокаУзла = ПолучитьСтрокуУзла(СтрокиДерева, СоответствиеСтрокУзлов, УзелРодитель);
		СтрокиВложенные = СтрокаУзла.Строки;
		
		СтрокаТекКласс = СтрокиВложенные.Добавить();
		СтрокаТекКласс.КартинкаСтрок = 1;
		СтрокаТекКласс.ТипСтроки     = 1;
		СтрокаТекКласс.Объект = ТекКласс;
		
		СоответствиеСтрокУзлов.Вставить(ТекКласс, СтрокаТекКласс);
	Иначе
		СтрокаТекКласс = УзелРодитель;
	КонецЕсли;
	
	
	Возврат СтрокаТекКласс;
	
КонецФункции

&НаСервере
Процедура ВывестиУзлыОперации(МассивУзлов, СтрокиДерева, СоответствиеСтрокУзлов=Неопределено, ВыводитьВидыОпераций=Истина)
	
	Если СоответствиеСтрокУзлов = Неопределено Тогда
		СоответствиеСтрокУзлов = Новый Соответствие;
	КонецЕсли;
	
	ТаблицаРодителей = Справочники.Классы.ПолучитьТаблицуРодителей(МассивУзлов);
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	// Получаем значения атрибутов узлов (доступные виды операций, узловая структура).
	АтрибутДоступныеОперации = ПланыВидовХарактеристик.АтрибутыКласса.ДоступныеВидыОпераций;
	АтрибутУзловаяСтруктура = ПланыВидовХарактеристик.АтрибутыКласса.УзловаяСтруктура;
	
	АтрибутыКласса = Новый Массив;
	АтрибутыКласса.Добавить(АтрибутУзловаяСтруктура);
	АтрибутыКласса.Добавить(АтрибутДоступныеОперации);
	
	ТаблицаАтрибутов = Справочники.Классы.ПолучитьЗначенияСписочныхАтрибутов(ТаблицаРодителей, АтрибутыКласса);
	
	МассивУзловВложенных = Новый Массив;
	ТекКласс = Неопределено;
	
	Для Каждого СтрокаТаблицы ИЗ ТаблицаАтрибутов Цикл
		Если СтрокаТаблицы.АтрибутКласса = АтрибутДоступныеОперации Тогда
			Если НЕ ТекКласс = СтрокаТаблицы.КлассДляЧтения Тогда
				СтрокаУзла = ПолучитьСтрокуУзла(СтрокиДерева, СоответствиеСтрокУзлов, СтрокаТаблицы.КлассДляЧтения);
				СтрокиОпераций = СтрокаУзла.Строки;
				ТекКласс = СтрокаТаблицы.КлассДляЧтения;
			КонецЕсли;
			
			Если ВыводитьВидыОпераций Тогда
				СтрокаОперации = СтрокиОпераций.Добавить();
				СтрокаОперации.КартинкаСтрок = 3;
				СтрокаОперации.ТипСтроки     = 2;
				СтрокаОперации.Объект = СтрокаТаблицы.ЗначениеАтрибутаКласса;
			КонецЕсли;
			
		ИначеЕсли СтрокаТаблицы.АтрибутКласса = АтрибутУзловаяСтруктура Тогда
			ТекКлассДляЧтения = СоответствиеСтрокУзлов[СтрокаТаблицы.ЗначениеАтрибутаКласса];
			Если ТекКлассДляЧтения = Неопределено И НЕ СтрокаТаблицы.ЗначениеАтрибутаКласса = СтрокаТаблицы.КлассДляЧтения Тогда
				МассивУзловВложенных.Добавить(СтрокаТаблицы.ЗначениеАтрибутаКласса);
				СоответствиеСтрокУзлов.Вставить(СтрокаТаблицы.ЗначениеАтрибутаКласса, СтрокаТаблицы.КлассДляЧтения);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	// Получаем тех.карты по узлам.
	
	ТабличныеАтрибуты = Новый Массив();
	ТабличныеАтрибуты.Добавить(ПланыВидовХарактеристик.АтрибутыКласса.ТехКарты);
	
	ТаблицаТехКарт = Справочники.Классы.ПолучитьСтрокиТабличныхАтрибутов(ТаблицаРодителей, ТабличныеАтрибуты);
		
	ТекКласс = Неопределено;
	Для Каждого СтрокаТК ИЗ ТаблицаТехКарт Цикл
		Если НЕ ТекКласс = СтрокаТК.КлассДляЧтения Тогда
			СтрокаУзла = ПолучитьСтрокуУзла(СтрокиДерева, СоответствиеСтрокУзлов, СтрокаТК.КлассДляЧтения);
			СтрокиВложенные = СтрокаУзла.Строки;
			ТекКласс = СтрокаТК.КлассДляЧтения;
		КонецЕсли;
		
		Если ВыводитьВидыОпераций Тогда
			СтрокаВложеннойТехкарты = СтрокиВложенные.Добавить();
			СтрокаВложеннойТехкарты.КартинкаСтрок = 2;
			СтрокаВложеннойТехкарты.ТипСтроки     = 3;
			СтрокаВложеннойТехкарты.Объект = ?(ЗначениеЗаполнено(СтрокаТК.ЗначениеАтрибутаКласса), 
				СтрокаТК.ЗначениеАтрибутаКласса, СтрокаТК.ИсточникЗначений);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивУзловВложенных.Количество() > 0 Тогда
		ВывестиУзлыОперации(МассивУзловВложенных, СтрокиДерева, СоответствиеСтрокУзлов, ВыводитьВидыОпераций);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывесиДоступныеОперацииНаСервере()
	
	ДеревоОпераций = РеквизитФормыВЗначение("ДоступныеОперации");
	ДеревоОпераций.Строки.Очистить();
	
	// Узловая структура.
	СтруктураПоиска = Новый Структура("АтрибутКласса, ИспользуемоеЗначение",
		ПланыВидовХарактеристик.АтрибутыКласса.УзловаяСтруктура, Истина);
	МассивУзлов = Объект.ЗначенияСписочныхАтрибутов.Выгрузить(
		СтруктураПоиска, "ЗначениеАтрибутаКласса").ВыгрузитьКолонку("ЗначениеАтрибутаКласса");
	ВывестиУзлыОперации(МассивУзлов, ДеревоОпераций.Строки);
	
	ЗначениеВРеквизитФормы(ДеревоОпераций, "ДоступныеОперации");
	
	ОбновитьДанныеТекКласса();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеТекКласса()
	
	ЭлементыОпераций = ДоступныеОперации.ПолучитьЭлементы();
	Если ЭлементыОпераций.Количество() > 0 И ЭлементыОпераций[0].Объект = Объект.Класс.Ссылка Тогда
		СтрокаТекКласс = ЭлементыОпераций[0];
		СтрокаТекКласс.ПолучитьЭлементы().Очистить();
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура("АтрибутКласса, ИспользуемоеЗначение",
		ПланыВидовХарактеристик.АтрибутыКласса.ДоступныеВидыОпераций, Истина);
	СписокОпераций = Объект.ЗначенияСписочныхАтрибутов.НайтиСтроки(СтруктураПоиска);
	Если СписокОпераций.Количество() > 0 Тогда
		
		Если СтрокаТекКласс = Неопределено Тогда
			СтрокаТекКласс = ЭлементыОпераций.Вставить(0);
			СтрокаТекКласс.КартинкаСтрок = 1;
			СтрокаТекКласс.ТипСтроки     = 0;
			СтрокаТекКласс.Объект = Объект.Класс.Ссылка;
			Если НЕ ЗначениеЗаполнено(СтрокаТекКласс.Объект) Тогда
				СтрокаТекКласс.ПредставлениеЗначения = 
					?(ПустаяСтрока(Объект.Наименование), НСтр("ru='(Этот класс)'"), Объект.Наименование);
			КонецЕсли;
		КонецЕсли;
		
		СтрокиОпераций = СтрокаТекКласс.ПолучитьЭлементы();
		Для Каждого СтрокаНайдено ИЗ СписокОпераций Цикл
			Если СтрокаНайдено.СтатусНаследования <= 3 Тогда
				СтрокаОперации = СтрокиОпераций.Добавить();
				СтрокаОперации.КартинкаСтрок = 3;
				СтрокаОперации.ТипСтроки     = 2;
				СтрокаОперации.Объект = СтрокаНайдено.ЗначениеАтрибутаКласса;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	// 2. Тех.карты тек.класса.
	СтруктураПоиска = Новый Структура("АтрибутКласса", ПланыВидовХарактеристик.АтрибутыКласса.ТехКарты);
	СписокТК = Объект.СтрокиТабличныхАтрибутов.НайтиСтроки(СтруктураПоиска);
	Если СписокТК.Количество() > 1 И ТекТехКарта >= 0 Тогда
		
		Если СтрокаТекКласс = Неопределено Тогда
			СтрокаТекКласс = ЭлементыОпераций.Вставить(0);
			СтрокаТекКласс.КартинкаСтрок = 1;
			СтрокаТекКласс.ТипСтроки     = 0;
			СтрокаТекКласс.Объект = Объект.Класс.Ссылка;
			Если НЕ ЗначениеЗаполнено(СтрокаТекКласс.Объект) Тогда
				СтрокаТекКласс.ПредставлениеЗначения = 
					?(ПустаяСтрока(Объект.Наименование), НСтр("ru='(Этот класс)'"), Объект.Наименование);
			КонецЕсли;
		КонецЕсли;
		
		СтрокиОпераций = СтрокаТекКласс.ПолучитьЭлементы();
		Для Каждого СтрокаТК ИЗ СписокТК Цикл
			Если НЕ СтрокаТК.ИДСтроки = ТекТехКарта Тогда
				СтрокаТехКарты = СтрокиОпераций.Добавить();
				СтрокаТехКарты.КартинкаСтрок = 2;
				СтрокаТехКарты.ТипСтроки     = 3;
				СтрокаТехКарты.Объект = ?(ЗначениеЗаполнено(СтрокаТК.ЗначениеАтрибутаКласса), 
					СтрокаТК.ЗначениеАтрибутаКласса, СтрокаТК.ИсточникЗначений);
				Если НЕ ЗначениеЗаполнено(СтрокаТК.ЗначениеАтрибутаКласса) Тогда
					СтрокаТехКарты.ПредставлениеЗначения = СтрокаТК.Наименование;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиЗначенияТабличногоАтрибутаНаСервере(АтрибутКласса)
	
	// Подготовка колонок.
	СтруктураПоиска = Новый Структура("АтрибутКласса", АтрибутКласса);
	Найдено = Объект.Атрибуты.НайтиСтроки(СтруктураПоиска);
	Если Найдено.Количество() > 0 Тогда
		ИсточникЗначений = Найдено[0].ИсточникЗначений;
	КонецЕсли;
	
	ТекСписокРодителей = Справочники.Классы.ПолучитьТаблицуРодителей(ИсточникЗначений);
	ТаблицаАтрибутов   = Справочники.Классы.ПолучитьТаблицуАтрибутов(ТекСписокРодителей);
	ТаблицаАтрибутов.Колонки.Добавить("ИмяКолонки", Новый ОписаниеТипов("Строка"));
	
	УдалитьКолонкиАтрибутовПодчиненныхОбъектов(2, "ЗначениеТабличногоАтрибута");
	ПодготовитьКолонкиАтрибутовПодчиненныхОбъектов(2, "ЗначениеТабличногоАтрибута", ТаблицаАтрибутов);
	
	// Заполнение строк таб.части.
	ВывестиТаблицуВложенногоАтрибута("ЗначениеТабличногоАтрибута", 0, АтрибутКласса, 2);
	
КонецПроцедуры

&НаСервере
Процедура ВывестиЗначенияСписочногоАтрибутаНаСервере(АтрибутКласса)
	
	Найдено = Объект.Атрибуты.НайтиСтроки(Новый Структура("АтрибутКласса", АтрибутКласса));
	Если Найдено.Количество() > 0 Тогда
		ИсточникЗначений = Найдено[0].ИсточникЗначений;
		ТипЗначения = Найдено[0].ТипЗначения;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ЗначенияСписочныхАтрибутовКласса", Объект.ЗначенияСписочныхАтрибутов.Выгрузить());
	Запрос.УстановитьПараметр("АтрибутКласса",    АтрибутКласса);
	Запрос.УстановитьПараметр("ИсточникЗначений", ИсточникЗначений);
	Запрос.УстановитьПараметр("ИсточникКласс", Редактирование
		И ЗначениеЗаполнено(ИсточникЗначений) И ТипЗнч(ИсточникЗначений) = Тип("СправочникСсылка.Классы"));
	Запрос.УстановитьПараметр("ИсточникНоменклатура", Редактирование
		И ЗначениеЗаполнено(ИсточникЗначений) И ТипЗнч(ИсточникЗначений) = Тип("СправочникСсылка.НоменклатураКласса"));
	Запрос.УстановитьПараметр("ТипАтрибутаНоменклатура", 
		ТипЗначения.СодержитТип(Тип("СправочникСсылка.НоменклатураКласса")));
	Запрос.УстановитьПараметр("ТипАтрибутаОбъектНоменклатуры", 
		ТипЗначения.СодержитТип(Тип("СправочникСсылка.ОбъектыНоменклатуры")));
		
	Запрос.Текст = ТекстЗапросаЗначенияСписочныхАтрибутовВременныеТаблицы();
	Запрос.Выполнить();
	
	Запрос.Текст = ТекстЗапросаЗначенияСписочныхАтрибутовСИерархией();
	РезультатыЗапросов = Запрос.ВыполнитьПакет();
	
	// Классы.
	ДеревоЗначений = РезультатыЗапросов[0].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ДеревоЗначений = ОбработатьДеревоСписочныхЗначенийАтрибутов(ДеревоЗначений, ИсточникЗначений);
	ЗначениеВРеквизитФормы(ДеревоЗначений, "ЗначенияСписочногоАтрибута");
	
	// Номенклатура классов.
	ДеревоЗначений = РезультатыЗапросов[1].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ЗначениеВРеквизитФормы(ДеревоЗначений, "ЗначенияСписочногоАтрибутаНоменклатура");
	
	// Объекты номенклатуры.
	ДеревоЗначений = РезультатыЗапросов[2].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ЗначениеВРеквизитФормы(ДеревоЗначений, "ЗначенияСписочногоАтрибутаОбъектыНоменклатуры");
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьЭлементовЗначенийСписочногоАтрибута()
			
	// Настройка элементов формы.
	НайденоАтрибуты = Объект.Атрибуты.НайтиСтроки(Новый Структура("АтрибутКласса", ТекСписочныйАтрибут));
	
	ТекИсточникЗначений = НайденоАтрибуты[0].ИсточникЗначений;
	Элементы.ТекИсточникЗначений.Видимость = НайденоАтрибуты[0].НуженИсточникЗначений;
	Если Элементы.ТекИсточникЗначений.Видимость Тогда
		
		ТипОбъектНоменклатуры = Тип("СправочникСсылка.ОбъектыНоменклатуры");
		ЕстьОбъектНоменклатуры = НайденоАтрибуты[0].ТипЗначения.СодержитТип(ТипОбъектНоменклатуры);
		Элементы.ТекИсточникЗначений.ВыбиратьТип = ЕстьОбъектНоменклатуры;
		ТолькоДляОбъекта = (НайденоАтрибуты[0].РежимИспользования =
			ПредопределенноеЗначение("Перечисление.РежимыИспользованияАтрибутов.ТолькоДляОбъектовНоменклатуры"));
		// Условие выбора класса в качестве значения.
		ВидимостьЗначениеКлассаИспользуемое = 
			(НЕ НайденоАтрибуты[0].СоставнойТипЗначения И 
				НЕ ТолькоДляОбъекта И 
				НайденоАтрибуты[0].МножественноеЗначение);
		// Класс мы можем выбрать: 
		//  1. Если в качестве источника значений не указан объект более низкого уровня.
		//  2. Если класс может значение атрибута - множественное, или источник значений - списочный.
		//  3. Если список подходящих классов не пустой или тип атрибута не составной 
		//     (надо показать пользователю хотябы пустой список).
		ВидимостьЗначенияКлассы = (НЕ ЗначениеЗаполнено(ТекИсточникЗначений) 
				ИЛИ ТипЗнч(ТекИсточникЗначений) = Тип("СправочникСсылка.Классы")) 
			И (ВидимостьЗначениеКлассаИспользуемое ИЛИ НайденоАтрибуты[0].СписокДоступныхЗначений)
			И (НЕ НайденоАтрибуты[0].СоставнойТипЗначения ИЛИ ЗначенияСписочногоАтрибута.ПолучитьЭлементы().Количество() > 0);
		
		Элементы.ЗначенияСписочногоАтрибута.Видимость                = ВидимостьЗначенияКлассы;
		Элементы.КоманднаяПанельЗначенияСписочногоАтрибута.Видимость = ВидимостьЗначенияКлассы;
		
		Элементы.ЗначенияСписочногоАтрибутаИспользуемоеЗначение.Видимость = ВидимостьЗначениеКлассаИспользуемое;
		Элементы.ЗначенияСписочногоАтрибутаДоступноеЗначение.Видимость = НайденоАтрибуты[0].СписокДоступныхЗначений;
		
		// Условие выбора номенклатуры в качестве значения.
		ВидимостьЗначениеНоменклатурыИспользуемое = 
			(НЕ ЕстьОбъектНоменклатуры И 
				НЕ ТолькоДляОбъекта И 
				НайденоАтрибуты[0].МножественноеЗначение);
		// Номенклатуру мы можем выбрать, если тип - составной, и в качестве источника не указана конкретная номенклатура.
		ВидимостьНоменклатура = (НайденоАтрибуты[0].СоставнойТипЗначения И (НЕ ЗначениеЗаполнено(ТекИсточникЗначений) 
				ИЛИ НЕ ТипЗнч(ТекИсточникЗначений) = Тип("СправочникСсылка.НоменклатураКласса")))
			И (ВидимостьЗначениеНоменклатурыИспользуемое ИЛИ НайденоАтрибуты[0].СписокДоступныхЗначений);
		
		Элементы.ЗначенияСписочногоАтрибутаНоменклатура.Видимость                = ВидимостьНоменклатура;
		Элементы.КоманднаяПанельЗначенияСписочногоАтрибутаНоменклатура.Видимость = ВидимостьНоменклатура;
		
		Элементы.ЗначенияСписочногоАтрибутаНоменклатураИспользуемоеЗначение.Видимость = 
			ВидимостьЗначениеНоменклатурыИспользуемое;
		Элементы.ЗначенияСписочногоАтрибутаНоменклатураДоступноеЗначение.Видимость = 
			НайденоАтрибуты[0].СписокДоступныхЗначений;
		
		// Объекты номенклатуры мы можем выбирать, если тип атрибута - объект номенклатуры.
		Элементы.ЗначенияСписочногоАтрибутаОбъектыНоменклатуры.Видимость                = ЕстьОбъектНоменклатуры;
		Элементы.КоманднаяПанельЗначенияСписочногоАтрибутаОбъектыНоменклатуры.Видимость = ЕстьОбъектНоменклатуры;
		
		Элементы.ЗначенияСписочногоАтрибутаОбъектыНоменклатурыИспользуемоеЗначение.Видимость = 
			НЕ ТолькоДляОбъекта И 
			НайденоАтрибуты[0].МножественноеЗначение;
		Элементы.ЗначенияСписочногоАтрибутаОбъектыНоменклатурыДоступноеЗначение.Видимость = 
			НайденоАтрибуты[0].СписокДоступныхЗначений;
		
	КонецЕсли;
	
	ЭлементыДерева = ЗначенияСписочногоАтрибута.ПолучитьЭлементы();
	Для Каждого СтрокаСписка ИЗ ЭлементыДерева Цикл
		Элементы.ЗначенияСписочногоАтрибута.Развернуть(СтрокаСписка.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
	
	ЭлементыДерева = ЗначенияСписочногоАтрибутаНоменклатура.ПолучитьЭлементы();
	Для Каждого СтрокаСписка ИЗ ЭлементыДерева Цикл
		Элементы.ЗначенияСписочногоАтрибутаНоменклатура.Развернуть(СтрокаСписка.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
	
	ЭлементыДерева = ЗначенияСписочногоАтрибутаОбъектыНоменклатуры.ПолучитьЭлементы();
	Для Каждого СтрокаСписка ИЗ ЭлементыДерева Цикл
		Элементы.ЗначенияСписочногоАтрибутаОбъектыНоменклатуры.Развернуть(СтрокаСписка.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииЗначенияСписочногоАтрибута(ТекДанные, ИзменитьДоступноеДляВложенных=Ложь)
	
	// Запись изменений в таб.часть обработки.
	Найдено = Объект.ЗначенияСписочныхАтрибутов.НайтиСтроки(
		Новый Структура("АтрибутКласса, ЗначениеАтрибутаКласса", ТекСписочныйАтрибут, ТекДанные.ЗначениеАтрибутаКласса));
	Если (ТекДанные.СтатусНаследования > 2 ИЛИ ТекДанные.ИспользуемоеЗначение ИЛИ ТекДанные.ДоступноеЗначение
			И ТекДанные.МожноИзменятьДоступноеЗначение) Тогда
		Если Найдено.Количество() = 0 Тогда
			СтрокаЗначений = Объект.ЗначенияСписочныхАтрибутов.Добавить();
			СтрокаЗначений.АтрибутКласса = ТекСписочныйАтрибут;
		Иначе
			СтрокаЗначений = Найдено[0];
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтрокаЗначений, ТекДанные);
		СтрокаЗначений.ДоступноеЗначение = ТекДанные.ДоступноеЗначение
			И ТекДанные.МожноИзменятьДоступноеЗначение;
		
	ИначеЕсли Найдено.Количество() > 0 Тогда
		Объект.ЗначенияСписочныхАтрибутов.Удалить(Найдено[0]);
	КонецЕсли;
	
	Если ТипЗнч(ТекДанные.ЗначениеАтрибутаКласса) = Тип("СправочникСсылка.Классы") Тогда
		МассивПроверяемых = Новый Массив;
		МассивПроверяемых.Добавить(ТекДанные.ЗначениеАтрибутаКласса);
		
		// Автоматически проставить флажки вложенных.
		ВложенныеЭлементы = ТекДанные.ПолучитьЭлементы();
		Если ВложенныеЭлементы.Количество() > 0 Тогда
			Для Каждого СтрокаВложенных ИЗ ВложенныеЭлементы Цикл
				Если ИзменитьДоступноеДляВложенных Тогда
					Если ТекДанные.ДоступноеЗначение Тогда
						СтрокаВложенных.ДоступноеЗначение = Истина;
						СтрокаВложенных.МожноИзменятьДоступноеЗначение = Ложь;
					Иначе
						СтрокаВложенных.ДоступноеЗначение = Ложь;
						СтрокаВложенных.МожноИзменятьДоступноеЗначение = Истина;
					КонецЕсли;
					ПриИзмененииЗначенияСписочногоАтрибута(СтрокаВложенных, ИзменитьДоступноеДляВложенных);
				Иначе
					МассивПроверяемых.Добавить(СтрокаВложенных.ЗначениеАтрибутаКласса);
					ДобавитьПодчиненныеЭлементы(СтрокаВложенных, МассивПроверяемых);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		// Связанная номенклатура класса.
		ЭлементыКлассов = ЗначенияСписочногоАтрибутаНоменклатура.ПолучитьЭлементы();
		Для Каждого ТекКласс ИЗ ЭлементыКлассов Цикл
			Если НЕ МассивПроверяемых.Найти(ТекКласс.ЗначениеАтрибутаКласса) = Неопределено Тогда
				ЭлементыНоменклатуры = ТекКласс.ПолучитьЭлементы();
				Для Каждого ТекНоменклатура ИЗ ЭлементыНоменклатуры Цикл
					Изменено = Ложь;
					Если ТекДанные.ДоступноеЗначение Тогда
						ТекНоменклатура.ДоступноеЗначение = Истина;
						ТекНоменклатура.МожноИзменятьДоступноеЗначение = Ложь;
						Изменено = Истина;
					ИначеЕсли НЕ ТекНоменклатура.МожноИзменятьДоступноеЗначение Тогда
						ТекНоменклатура.ДоступноеЗначение = Ложь;
						ТекНоменклатура.МожноИзменятьДоступноеЗначение = Истина;
						Изменено = Истина;
					КонецЕсли;
					Если Изменено Тогда
						ПриИзмененииЗначенияСписочногоАтрибута(ТекНоменклатура);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ТекДанные.ЗначениеАтрибутаКласса) = Тип("СправочникСсылка.НоменклатураКласса") Тогда
		
		// Связанные объекты номенклатуры.
		ЭлементыКлассов = ЗначенияСписочногоАтрибутаОбъектыНоменклатуры.ПолучитьЭлементы();
		Для Каждого ТекКласс ИЗ ЭлементыКлассов Цикл
			ЭлементыНоменклатуры = ТекКласс.ПолучитьЭлементы();
			Для Каждого ТекНоменклатура ИЗ ЭлементыНоменклатуры Цикл
				Если ТекНоменклатура.ЗначениеАтрибутаКласса = ТекДанные.ЗначениеАтрибутаКласса Тогда
					ЭлементыОбъектов = ТекНоменклатура.ПолучитьЭлементы();
					Для Каждого ТекОбъект ИЗ ЭлементыОбъектов Цикл
						Изменено = Ложь;
						Если ТекДанные.ДоступноеЗначение Тогда
							ТекОбъект.ДоступноеЗначение = Истина;
							ТекОбъект.МожноИзменятьДоступноеЗначение = Ложь;
							Изменено = Истина;
						ИначеЕсли НЕ ТекОбъект.МожноИзменятьДоступноеЗначение Тогда
							ТекОбъект.ДоступноеЗначение = Ложь;
							ТекОбъект.МожноИзменятьДоступноеЗначение = Истина;
							Изменено = Истина;
						КонецЕсли;
						Если Изменено Тогда
							ПриИзмененииЗначенияСписочногоАтрибута(ТекОбъект);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПодчиненныеЭлементы(СтрокаВложенных, МассивДобавления)
	
	ВложенныеЭлементы = СтрокаВложенных.ПолучитьЭлементы();
	Если ВложенныеЭлементы.Количество() > 0 Тогда
		Для Каждого СледующийУровень ИЗ ВложенныеЭлементы Цикл
			МассивДобавления.Добавить(СледующийУровень.ЗначениеАтрибутаКласса);
			ДобавитьПодчиненныеЭлементы(СледующийУровень, МассивДобавления);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЭлементыУправленияТаблицами()
	
	Результат = Новый Соответствие;
	Результат.Вставить("ЗначенияСписочногоАтрибута", 
		Элементы.ЗначенияСписочногоАтрибутаКоманды);
	Результат.Вставить("ЗначенияСписочногоАтрибутаНоменклатура", 
		Элементы.ЗначенияСписочногоАтрибутаКомандыНоменклатуры);
	Результат.Вставить("ЗначенияСписочногоАтрибутаОбъектыНоменклатуры", 
		Элементы.ЗначенияСписочногоАтрибутаКомандыОбъектов);
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекущийПользователь()
	
	Возврат ПараметрыСеанса.ТекущийПользователь;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОбъектРедактируется(Класс, ТекущимПользователем=Истина, Пользователь=Неопределено)
	
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект",               Класс);
	Запрос.УстановитьПараметр("ТекПользователь",      ТекущийПользователь());
	Запрос.УстановитьПараметр("ТекущимПользователем", ТекущимПользователем);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БлокировкаРедактированияКлассов.Объект,
		|	БлокировкаРедактированияКлассов.Пользователь
		|ИЗ
		|	РегистрСведений.БлокировкаРедактированияКлассов КАК БлокировкаРедактированияКлассов
		|ГДЕ
		|	БлокировкаРедактированияКлассов.Объект = &Объект
		|	И (БлокировкаРедактированияКлассов.Пользователь = &ТекПользователь) = &ТекущимПользователем";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда
		Результат = Истина;
		Пользователь = РезультатЗапроса.Пользователь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПроверитьЗаблокироватьРедактированиеКлассаНаСервере(Знач Класс, Отказ, Блокировать=Истина, ТолькоВверх=Ложь)
	
	Если Класс = Неопределено Тогда
		Класс = Объект.Класс.Ссылка;
	КонецЕсли;
	
	ТекПользователь = ТекущийПользователь();
	
	МассивРодителей = Справочники.Классы.ПолучитьТаблицуРодителей(Класс).ВыгрузитьКолонку("Класс");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", Класс);
	Запрос.УстановитьПараметр("ТекПользователь", ТекПользователь);
	Запрос.УстановитьПараметр("МассивРодителей", МассивРодителей);
	Запрос.УстановитьПараметр("ТолькоВверх", ТолькоВверх);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БлокировкаРедактированияКлассов.Объект,
		|	БлокировкаРедактированияКлассов.Пользователь
		|ИЗ
		|	РегистрСведений.БлокировкаРедактированияКлассов КАК БлокировкаРедактированияКлассов
		|ГДЕ
		|	(НЕ &ТолькоВверх
		|				И БлокировкаРедактированияКлассов.Объект В ИЕРАРХИИ (&Объект)
		|			ИЛИ БлокировкаРедактированияКлассов.Объект В (&МассивРодителей))
		|	И НЕ БлокировкаРедактированияКлассов.Пользователь = &ТекПользователь";
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		ШаблонСообщения = НСтр("ru = 'Класс ''%1'' заблокирован пользователем ''%2'', редактирующим класс ''%3'''");
		ТекстСообщения = УправлениеНСИФункцииКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(ШаблонСообщения, 
			Строка(Класс), Строка(Результат.Пользователь), Строка(Результат.Объект));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;
	
	Если НЕ Отказ И Блокировать Тогда
		
		Попытка 
			СпрОбъект = ДанныеФормыВЗначение(Объект.Класс, Тип("СправочникОбъект.Классы"));
			СпрОбъект.Заблокировать();
			ЗначениеВДанныеФормы(СпрОбъект, Объект.Класс);
		Исключение 
			ШаблонСообщения = НСтр("ru = 'Ошибка блокировки класса ''%1'' для редактирования'");
			ТекстСообщения = УправлениеНСИФункцииКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
				ШаблонСообщения, Строка(Класс));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецПопытки;
		
		Если НЕ Отказ Тогда
			Запись = РегистрыСведений.БлокировкаРедактированияКлассов.СоздатьМенеджерЗаписи();
			Запись.Объект = Класс;
			Запись.Пользователь = ТекПользователь;
			Запись.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СнятьБлокировкуКласса()
	Запись = РегистрыСведений.БлокировкаРедактированияКлассов.СоздатьМенеджерЗаписи();
	Запись.Объект = Объект.Класс.Ссылка;
	Запись.Удалить();
КонецПроцедуры

&НаСервере
Процедура ОтменитьРедактированиеНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Класс.Ссылка) Тогда
		СнятьБлокировкуКласса();
		ПодготовитьФормуРедактированияКласса(Объект.Класс.Ссылка);
		ПереключательАтрибутов = 0;
		Элементы.ГруппаСтарницыАтрибутов.ТекущаяСтраница = Элементы.ГруппаСтраницаОбщие;
	Иначе
		ШаблонПустаяСсылка = Справочники.ШаблоныЗаполнения.ПустаяСсылка();
		СчетчикПустаяСсылка = Справочники.Счетчики.ПустаяСсылка();
		ПустыеЗначения = Новый Структура("Наименование, НаименованиеПолное, Код, ОтображатьВИерархииТО, Родитель, 
			|ЗначениеАтрибута, НоменклатураКласса, ОбъектыНоменклатуры, КлассТабличнаяЧасть, Статус, НомерПоСчетчику, 
			|ШагСчетчика, ПрисвоенНомерПоШаблону, ФорматКодаРодителя, ШаблонКодаРодителя, РежимКонтроляДублейПоНаименованию,
			|КонтрольДублейВПределахКласса, " + СписокРеквизитовКодированияИменования(),
			"", "", "", Ложь, Справочники.Классы.ПустаяСсылка(), 
			Ложь, Ложь, Ложь, Ложь, Перечисления.СтатусыОбъектовНСИ.ПустаяСсылка(), 
			0, 0, Ложь, "", ШаблонПустаяСсылка, Перечисления.РежимыКонтроляДублей.ПустаяСсылка(),
			Справочники.Классы.ПустаяСсылка(),
			"", ШаблонПустаяСсылка, ШаблонПустаяСсылка, СчетчикПустаяСсылка,
			"", ШаблонПустаяСсылка, ШаблонПустаяСсылка, СчетчикПустаяСсылка,
			"", ШаблонПустаяСсылка, ШаблонПустаяСсылка, СчетчикПустаяСсылка);
		ЗаполнитьЗначенияСвойств(Объект, ПустыеЗначения);
		
		Объект.Атрибуты.Очистить();
		Объект.ЗначенияСписочныхАтрибутов.Очистить();
		Объект.СтрокиТабличныхАтрибутов.Очистить();
		Объект.ЗначенияТабличныхАтрибутов.Очистить();
		
		ЗаголовокРедактируемогоЭлемента = НСтр("ru='(Выберите элемент для редактирования или создайте новый)'");
		
		ПереключательАтрибутов = 0;
		Элементы.ГруппаСтарницыАтрибутов.ТекущаяСтраница = Элементы.ГруппаСтраницаОбщие;
		Элементы.НоменклатураКласса.Доступность  = Истина;
		Элементы.ЗначениеАтрибута.Доступность    = Истина;
		Элементы.ОбъектыНоменклатуры.Доступность = Ложь;
		
		Элементы.ГруппаПараметрыНоменклатуры.Доступность        = Ложь;
		Элементы.ГруппаПараметрыОбъектаНоменклатуры.Доступность = Ложь;
		
		Элементы.ГруппаСтраницыКонтрольДублейПоНаименованию.ТекущаяСтраница = 
			Элементы.ГруппаСтраницаКонтрольДублейКакУРодителя;
		КонтрольДублейКакУРодителя = "";
		
		УстановитьАвтоотметкуНезаполненных(СписокРеквизитовКодированияИменованияНоменклатуры(), Ложь);
		УстановитьАвтоотметкуНезаполненных(СписокРеквизитовКодированияИменованияОбъектов(),     Ложь);
		
		Модифицированность = Ложь;
		Элементы.ГруппаПраваяКолонка.ТолькоПросмотр = Истина;
		УстановитьРежимТолькоПросмотра(Истина, Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере 
Процедура УстановитьАвтоотметкуНезаполненных(СписокРеквизитов, АвтоотметкаНезаполненного)
	
	МассивРеквизитов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СписокРеквизитов);
	Для Каждого ИмяРеквизита ИЗ МассивРеквизитов Цикл
		Элементы[СокрЛП(ИмяРеквизита)].АвтоОтметкаНезаполненного = АвтоотметкаНезаполненного;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьРежимТолькоПросмотра(ТолькоПросмотр, ВозможноРедактироватьКласс=Истина)
	
	Редактирование = НЕ ТолькоПросмотр;
	
	Элементы.ГруппаРеквизитыШапки.ТолькоПросмотр                  = ТолькоПросмотр;
	//Элементы.ГруппаСтарницыАтрибутов.ТолькоПросмотр               = ТолькоПросмотр;
	Элементы.ГруппаСтраницаОбщие.ТолькоПросмотр                   = ТолькоПросмотр;
	Элементы.ГруппаСтраницаПростыеАтрибуты.ТолькоПросмотр         = ТолькоПросмотр;
	Элементы.ГруппаСтраницаСписочныйАтрибут.ТолькоПросмотр        = ТолькоПросмотр;
	Элементы.ГруппаСтраницаТабличныйАтрибут.ТолькоПросмотр        = ТолькоПросмотр;
	Элементы.ГруппаТехКарты.ТолькоПросмотр                        = ТолькоПросмотр;
	Элементы.СоставТехКарты.ТолькоПросмотр                        = ТолькоПросмотр;
	Элементы.ЗначениеТабличногоАтрибутаОперации.ТолькоПросмотр    = ТолькоПросмотр;
	Элементы.ГруппаВложенныеТабличныеЧастиТехКарты.ТолькоПросмотр = ТолькоПросмотр;
	
	Элементы.СформироватьКодПоШаблону.Доступность                             = НЕ ТолькоПросмотр;
	Элементы.ГруппаКомандыДобавленияОпераций.Доступность                      = НЕ ТолькоПросмотр;
	Элементы.ЗначениеТабличногоАтрибутаНастройкаНаследованияСтрок.Доступность = НЕ ТолькоПросмотр;
	
	Элементы.ГруппаВсеАтрибуты.Видимость = НЕ ТолькоПросмотр;
	
	Элементы.ГруппаКомандыДобавленияОпераций.Видимость = НЕ ТолькоПросмотр;
	Элементы.ГруппаПанельПодбораОпераций.Видимость     = НЕ ТолькоПросмотр;
	
	Если ТолькоПросмотр Тогда
		Элементы.ЗаписатьИзменения.Доступность        = Ложь;
		Элементы.ЗаписатьИзменения.КнопкаПоУмолчанию  = Ложь;
		Элементы.РедактироватьКласс.Видимость         = ВозможноРедактироватьКласс;
		Элементы.РедактироватьКласс.КнопкаПоУмолчанию = ВозможноРедактироватьКласс;
		
		// Элементы управления атрибутами (обычными и списочными) не доступны в режиме просмотра.
		Элементы.АтрибутыКомандаНаследовать.Доступность   = Ложь;
		Элементы.АтрибутыКомандаНеНаследовать.Доступность = Ложь;
		
		Элементы.ЗначенияСписочногоАтрибутаКомандаНаследоватьЗначение.Доступность   = Ложь;
		Элементы.ЗначенияСписочногоАтрибутаКомандаНеНаследоватьЗначение.Доступность = Ложь;
		
		Элементы.ЗначенияСписочногоАтрибутаКомандаНаследоватьЗначениеОбъектНоменклатуры.Доступность   = Ложь;
		Элементы.ЗначенияСписочногоАтрибутаКомандаНеНаследоватьЗначениеОбъектНоменклатуры.Доступность = Ложь;
		
		Элементы.ЗначенияСписочногоАтрибутаКомандаНаследоватьЗначениеНоменклатуры.Доступность   = Ложь;
		Элементы.ЗначенияСписочногоАтрибутаКомандаНеНаследоватьЗначениеНоменклатуры.Доступность = Ложь;
	Иначе
		Элементы.РедактироватьКласс.Видимость         = Ложь;
		Элементы.РедактироватьКласс.КнопкаПоУмолчанию = Ложь;
		Элементы.ЗаписатьИзменения.Доступность        = Истина;
		Элементы.ЗаписатьИзменения.КнопкаПоУмолчанию  = Истина;
		
		НастроитьОтображениеДанныхАтрибута(Объект, Элементы, ТекРежимЗаполненияАтрибутаШаблона, Редактирование);
		
		ТекДанные = Неопределено;
		ИДСтроки = Элементы.ЗначенияСписочногоАтрибута.ТекущаяСтрока;
		Если НЕ ИДСтроки = Неопределено Тогда
			ТекДанные = ЗначенияСписочногоАтрибута.НайтиПоИдентификатору(ИДСтроки);
		КонецЕсли;
		
		НастроитьКомандыУправленияЗначениямиСписочногоАтрибута(Объект, Элементы, ТекДанные, Редактирование);
	КонецЕсли;
	
	Элементы.ОтменитьРедактирование.Видимость       = НЕ ТолькоПросмотр;
	
КонецПроцедуры

&НаСервере
Функция СписокРеквизитовКодированияИменования()
	
	СписокРеквизитов = 
		СписокРеквизитовКодированияИменованияКлассов() + ", "
		+ СписокРеквизитовКодированияИменованияНоменклатуры() + ", "
		+ СписокРеквизитовКодированияИменованияОбъектов();
	Возврат СписокРеквизитов;
	
КонецФункции

&НаСервере
Функция СписокРеквизитовКодированияИменованияКлассов()
	
	СписокРеквизитов = 
		"ФорматКодаКласса, ШаблонКодаКласса, ШаблонНаименованияКласса, СчетчикКлассов";
	Возврат СписокРеквизитов;
	
КонецФункции

&НаСервере
Функция СписокРеквизитовКодированияИменованияНоменклатуры()
	
	СписокРеквизитов = 
		"ФорматКодаНоменклатуры, ШаблонКодаНоменклатуры, ШаблонНаименованияНоменклатуры, СчетчикНоменклатуры";
	Возврат СписокРеквизитов;
	
КонецФункции

&НаСервере
Функция СписокРеквизитовКодированияИменованияОбъектов()
	
	СписокРеквизитов = 
		"ФорматКодаОбъекта, ШаблонКодаОбъекта, ШаблонНаименованияОбъекта, СчетчикОбъектовНоменклатуры";
	Возврат СписокРеквизитов;
	
КонецФункции

&НаСервере
Процедура СформироватьКодПоШаблонуНаСервере()
	
	НомерПоСчетчику = Объект.НомерПоСчетчику;
	ШагСчетчика     = Объект.ШагСчетчика;
	
	Отказ = Ложь;
	Если НЕ Объект.ПрисвоенНомерПоШаблону Тогда
		НомерПоСчетчику = 0;
	КонецЕсли;
	
	НовыйКод = ШаблоныСтрокСервер.СформироватьЗначениеПоШаблону(
		Объект.Класс.Ссылка, Объект.ШаблонКодаРодителя, НомерПоСчетчику, ШагСчетчика, Отказ);
	Если НЕ Отказ Тогда
		Объект.Код             = НовыйКод;
		Объект.НомерПоСчетчику = НомерПоСчетчику;
		Объект.ШагСчетчика     = ШагСчетчика;
		Объект.ПрисвоенНомерПоШаблону = Истина;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РодительПриИзмененииНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Объект.Родитель) Тогда
		ТекРодительКласса = Объект.Родитель;
		Возврат;
	КонецЕсли;
	
	// Сохраняем прежние значения.
	ТаблицаАтрибутов                  = Объект.Атрибуты.Выгрузить();
	ТаблицаСписочныхАтрибутов         = Объект.ЗначенияСписочныхАтрибутов.Выгрузить();
		
	Отказ = Ложь;
	ПроверитьЗаблокироватьРедактированиеКлассаНаСервере(Объект.Родитель, Отказ, Ложь, Истина);
	Если Отказ Тогда
		Объект.Родитель = ТекРодительКласса;
		Возврат;
	КонецЕсли;
	
	РеквизитыРодителя = УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначенияРеквизитовОбъекта(Объект.Родитель, 
		"КлассТабличнаяЧасть, " + СписокРеквизитовКодированияИменования());
	ЗаполнитьЗначенияСвойств(Объект, РеквизитыРодителя);
	
	Если НЕ ЗначениеЗаполнено(Объект.Класс.Ссылка) Тогда
		ЗаголовокРедактируемогоЭлемента = УправлениеНСИФункцииКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
			НСтр("ru='Редактирование классов: Создание (Родитель:%1)'"), Объект.Родитель);
	КонецЕсли;
	
	ЗаполнитьСписокРодителей();
	
	// Заполняем атрибуты.
	ЗаполнитьАтрибуты(Неопределено);
	
	// Переносим прежние значения атрибутов.
	СтруктураПоиска = Новый Структура("АтрибутКласса");
	ТекИД = 0;
	
	Если ТаблицаАтрибутов.Количество() > 0 Тогда
		Для Каждого СтрокаАтрибут ИЗ ТаблицаАтрибутов Цикл
			Если СтрокаАтрибут.СтатусНаследования > 4 Тогда
				Продолжить;
			КонецЕсли;
			
			ЭтоСтрока = СтрокаАтрибут.ТипЗначения.СодержитТип(Тип("Строка"));
			ДобавитьСписочныйАтрибут = Ложь;
			
			СтруктураПоиска.АтрибутКласса = СтрокаАтрибут.АтрибутКласса;
			НайденоАтрибуты = Объект.Атрибуты.НайтиСтроки(СтруктураПоиска);
			Если НайденоАтрибуты.Количество() > 0 Тогда
				СтрокаТЧ = НайденоАтрибуты[0];
				// Если атрибут до изменения родителя был ненаследуемым, то и после изменения он будет ненаследуемым.
				Если СтрокаАтрибут.СтатусНаследования = 4 И СтрокаТЧ.СтатусНаследования = 3 Тогда
					СтрокаТЧ.СтатусНаследования = 4;
					СтрокаТЧ.ЗначениеАтрибутаКласса = СтрокаТЧ.ТипЗначения.Привести();
					СтрокаТЧ.УровеньЗначения = 0;
					Если СтрокаАтрибут.МножественноеЗначение ИЛИ СтрокаАтрибут.СписокДоступныхЗначений Тогда
						НайденоСписочные = СписочныеАтрибуты.НайтиСтроки(Новый Структура("ТипОбъекта, АтрибутКласса", 0, СтрокаАтрибут.АтрибутКласса));
						Если НайденоСписочные.Количество() > 0 Тогда
							ЭлементСписка = Элементы.ПереключательАтрибутов.СписокВыбора.НайтиПоЗначению(НайденоСписочные[0].ИДАтрибута);
							Если НЕ ЭлементСписка = Неопределено Тогда
								Элементы.ПереключательАтрибутов.СписокВыбора.Удалить(ЭлементСписка);
							КонецЕсли;
							СписочныеАтрибуты.Удалить(НайденоСписочные[0]);
						КонецЕсли;
					КонецЕсли;
					
				// Если он был наследуемым, копируем его настройки как были до изменения.
				ИначеЕсли СтрокаАтрибут.СтатусНаследования = 3 И СтрокаТЧ.СтатусНаследования = 3 Тогда
					ДобавитьСписочныйАтрибут = (НЕ ЭтоСтрока И НЕ СтрокаТЧ.МножественноеЗначение И НЕ СтрокаТЧ.СписокДоступныхЗначений
						И (СтрокаАтрибут.МножественноеЗначение ИЛИ СтрокаАтрибут.СписокДоступныхЗначений));
					ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаАтрибут);
					
				// Если он был добавленным, а теперь наследуемый - не копируем некоторые настройки.
				ИначеЕсли СтрокаАтрибут.СтатусНаследования = 1 И СтрокаТЧ.СтатусНаследования = 3 Тогда
					ДобавитьСписочныйАтрибут = (НЕ ЭтоСтрока И НЕ СтрокаТЧ.МножественноеЗначение И НЕ СтрокаТЧ.СписокДоступныхЗначений
						И (СтрокаАтрибут.МножественноеЗначение ИЛИ СтрокаАтрибут.СписокДоступныхЗначений));
					ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаАтрибут, , 
						"СтатусНаследования, РежимИспользования, РежимЗаполнения, РежимЗаполненияРодителя");
					
				КонецЕсли;
				
				ИдНайдено = Объект.Атрибуты.Индекс(СтрокаТЧ);
				Если НЕ ИдНайдено = ТекИД Тогда
					Объект.Атрибуты.Сдвинуть(ИдНайдено, ТекИд - ИдНайдено);
				КонецЕсли;
				ТекИД = ТекИД + 1;
				
			Иначе
				// Если у нового родителя такого атрибута нет, а у старого родителя - он был новым, тогда добавляем этот атрибут.
				Если СтрокаАтрибут.СтатусНаследования = 1 Тогда
					СтрокаТЧ = Объект.Атрибуты.Вставить(ТекИД);
					ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаАтрибут);
					Если СтрокаТЧ.МножественноеЗначение И НЕ ЭтоСтрока Тогда
						СтрокаТЧ.ЗначениеАтрибутаКласса = СтрокаТЧ.ТипЗначения.ПривестиЗначение();
						СтрокаТЧ.УровеньЗначения = 0;
					КонецЕсли;
					ДобавитьСписочныйАтрибут = (НЕ ЭтоСтрока 
						И (СтрокаАтрибут.МножественноеЗначение ИЛИ СтрокаАтрибут.СписокДоступныхЗначений));
					ТекИД = ТекИД + 1;
				КонецЕсли;
				
			КонецЕсли;
			
			Если ДобавитьСписочныйАтрибут Тогда
				ДобавитьСписочныйАтрибут(СтрокаТЧ.АтрибутКласса, СтрокаТЧ.КлассТабличнаяЧасть, СтрокаТЧ.ИсточникЗначений);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Заполнение списочных атрибутов.
	Объект.ЗначенияСписочныхАтрибутов.Очистить();
	МассивАтрибутов = СписочныеАтрибуты.Выгрузить(Новый Структура("ТипОбъекта, КлассТабличнаяЧасть", 0, Ложь)).ВыгрузитьКолонку("АтрибутКласса");
	Если МассивАтрибутов.Количество() > 0 Тогда
		ЗаполнитьЗначенияСписочныхАтрибутов(Неопределено, МассивАтрибутов);
	КонецЕсли;
	
	Если ТаблицаСписочныхАтрибутов.Количество() > 0 Тогда
		
		СтруктураПоиска = Новый Структура("АтрибутКласса, ЗначениеАтрибутаКласса");
		
		Для Каждого СтрокаСписочного ИЗ ТаблицаСписочныхАтрибутов Цикл
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаСписочного);
			НайденоСписочные = Объект.ЗначенияСписочныхАтрибутов.НайтиСтроки(СтруктураПоиска);
			Если НайденоСписочные.Количество() > 0 Тогда
				СтрокаТЧ = НайденоСписочные[0];
				Если СтрокаСписочного.СтатусНаследования = 4 И СтрокаТЧ.СтатусНаследования = 3 Тогда
					СтрокаТЧ.СтатусНаследования   = 4;
					СтрокаТЧ.ДоступноеЗначение    = Ложь;
					СтрокаТЧ.ИспользуемоеЗначение = Ложь;
				ИначеЕсли СтрокаСписочного.СтатусНаследования = 2 И СтрокаТЧ.СтатусНаследования = 2 Тогда
					СтрокаТЧ.ДоступноеЗначение    = СтрокаСписочного.ДоступноеЗначение;
					СтрокаТЧ.ИспользуемоеЗначение = СтрокаСписочного.ИспользуемоеЗначение;
				КонецЕсли;
			Иначе
				Если СтрокаСписочного.СтатусНаследования = 2 Тогда
					СтрокаТЧ = Объект.ЗначенияСписочныхАтрибутов.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаСписочного);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	// Заполнение табличных атрибутов.
	ЗаполнитьЗначенияТабличныхАтрибутов(Неопределено);
	
	ТекРодительКласса = Объект.Родитель;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПредставлениеРежимаКонтроляДублей(Знач СписокРодителей)
	ДанныеКонтроляДублей = Справочники.Классы.ПолучитьРежимКонтроляДублейПоНаименованию(СписокРодителей);
	Возврат ДанныеКонтроляДублей.РежимКонтроляДублейПредставление;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСписокВложенныхАтрибутов(ИсточникЗначений)
	
	СписокВложенныхАтрибутов = Неопределено;
	
	Если ТипЗнч(ИсточникЗначений) = Тип("СправочникСсылка.Классы") Тогда
		ТаблицаРодителей = Справочники.Классы.ПолучитьТаблицуРодителей(ИсточникЗначений);
		ТаблицаАтрибутов = Справочники.Классы.ПолучитьТаблицуАтрибутов(ТаблицаРодителей, , Ложь);
		
		СписокВложенныхАтрибутов = Новый СписокЗначений;
		ПеречислениеРеквизитов = Перечисления.РеквизитыКлассаНоменклатуры;
		Для Каждого Значение ИЗ ПеречислениеРеквизитов Цикл
			СписокВложенныхАтрибутов.Добавить(Значение);
		КонецЦикла;
		
		Для Каждого СтрокаАтрибут ИЗ ТаблицаАтрибутов Цикл
			Если СтрокаАтрибут.МножественноеЗначение
					ИЛИ НЕ ТипЗнч(СтрокаАтрибут.АтрибутКласса) = Тип("ПланВидовХарактеристикСсылка.АтрибутыКласса") Тогда
				Продолжить;
			КонецЕсли;
			СписокВложенныхАтрибутов.Добавить(СтрокаАтрибут.АтрибутКласса);
		КонецЦикла;
	КонецЕсли;
	
	Возврат СписокВложенныхАтрибутов;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВложенныйАтрибут(Источник, АтрибутКласса)
	
	Возврат Справочники.ВложенныеАтрибутыКласса.ПолучитьВложенныйАтрибут(Источник, АтрибутКласса);
	
КонецФункции

&НаСервере
Функция ПолучитьРодителяПоКлассу(Класс)
	
	Возврат Справочники.НоменклатураКласса.ПолучитьРодителяПоКлассу(Класс);
	
КонецФункции
 
#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции заполнения обработки

#Область ПроцедурыИФункцииЗаполненияОбработки

&НаСервере
Процедура ВыбратьОбъектРедактирования(Ссылка)
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		СпрОбъект = Ссылка.ПолучитьОбъект();
	Иначе
		СпрОбъект = Справочники.Классы.СоздатьЭлемент();
	КонецЕсли;
	ЗначениеВДанныеФормы(СпрОбъект, Объект.Класс);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьФормуРедактированияКлассаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаписатьНаСервере();
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если Редактирование И ЗначениеЗаполнено(Объект.Класс.Ссылка) Тогда
		СнятьБлокировкуКласса();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДополнительныеПараметры.ВыбраннаяСтрока) И ДополнительныеПараметры.РежимДобавления = 0 Тогда
		Пользователь = Неопределено;
		ОбъектЗаблокирован = ОбъектРедактируется(ДополнительныеПараметры.ВыбраннаяСтрока, Ложь, Пользователь);
		Если ОбъектЗаблокирован Тогда
			ШаблонПредупреждения = НСтр("ru = 'Класс ''%1'' заблокирован для редактирования пользователем ''%2''.'");
			ТекстПредупреждения = УправлениеНСИФункцииКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
				ШаблонПредупреждения, Строка(ДополнительныеПараметры.ВыбраннаяСтрока), Строка(Пользователь));
			ПоказатьПредупреждение(, ТекстПредупреждения);
			
			ВыбратьОбъектРедактирования(Неопределено);
			
			ОтменитьРедактированиеНаСервере();
			Возврат;
			
		КонецЕсли;
	КонецЕсли;
	
	ПодготовитьФормуРедактированияКласса(
		ДополнительныеПараметры.ВыбраннаяСтрока, ДополнительныеПараметры.РежимДобавления);
	Если ПереключательАтрибутов > 1 Тогда 
		ПереключательАтрибутов = 0;
		ПереключитьСтраницуФормы();
	КонецЕсли;
	
	Если НЕ Элементы.КлассыСписок.ТекущийРодитель = Объект.Родитель Тогда
		Элементы.КлассыСписок.ТекущийРодитель = Объект.Родитель;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокРодителей()
	
	НовыйСписокРодителей = Справочники.Классы.ПолучитьТаблицуРодителей(
		Объект.Родитель, "ФорматКодаКласса, ШаблонКодаКласса, ШаблонНаименованияКласса,
		|РежимКонтроляДублейПоНаименованию, КонтрольДублейВПределахКласса");
	
	Если ЗначениеЗаполнено(Объект.Класс.Ссылка) Тогда
		СтрокаТЗ = НовыйСписокРодителей.Добавить();
		СтрокаТЗ.Класс   = Объект.Класс.Ссылка;
		СтрокаТЗ.Уровень = НовыйСписокРодителей.Количество();
	КонецЕсли;
	
	СписокРодителей.Загрузить(НовыйСписокРодителей);
	
	// Заполняем данные родителя.
	Объект.ШаблонКодаРодителя = Справочники.Классы.ПолучитьЗначениеРодителя(
		СписокРодителей, СписокРодителей.Количество() - 1, "ШаблонКодаКласса");
	Объект.ФорматКодаРодителя = Справочники.Классы.ПолучитьЗначениеРодителя(
		СписокРодителей, СписокРодителей.Количество() - 1, "ФорматКодаКласса");
		
	СписокВыбора = Элементы.КонтрольДублейВПределахКласса.СписокВыбора;
	СписокВыбора.Очистить();
	СписокВыбора.ЗагрузитьЗначения(НовыйСписокРодителей.ВыгрузитьКолонку("Класс"));
	ПустоеЗначение = СписокВыбора.Вставить(0, Справочники.Классы.ПустаяСсылка(), НСтр("ru='(Текущий класс)'"));
	
	Если НЕ ЗначениеЗаполнено(Объект.РежимКонтроляДублейПоНаименованию) Тогда
		ДанныеКонтроляДублей = Справочники.Классы.ПолучитьРежимКонтроляДублейПоНаименованию(СписокРодителей);
		КонтрольДублейКакУРодителя = ДанныеКонтроляДублей.РежимКонтроляДублейПредставление;
	Иначе
		КонтрольДублейКакУРодителя = "";
	КонецЕсли;
	
	// Заполнение реквизитов класса по родителю.
	Если НЕ ЗначениеЗаполнено(Объект.ШаблонКодаКласса) И ЗначениеЗаполнено(Объект.ШаблонКодаРодителя) Тогда
		Объект.ШаблонКодаКласса = Объект.ШаблонКодаРодителя;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ФорматКодаКласса) И ЗначениеЗаполнено(Объект.ФорматКодаРодителя) Тогда
		Объект.ФорматКодаКласса = Объект.ФорматКодаРодителя;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуРедактированияКласса(ВыбраннаяСтрока, Режим=0)
	
	Модифицированность = Ложь;
	РежимРедактирования = Ложь;
	
	// Редактирование класса.
	Если Режим = 0 Тогда
		ВыбратьОбъектРедактирования(ВыбраннаяСтрока);
		РеквизитыКласса = УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначенияРеквизитовОбъекта(ВыбраннаяСтрока, 
			"Наименование, Код, Родитель, ОтображатьВИерархииТО, Статус, НаименованиеПолное, 
			|ЗначениеАтрибута, НоменклатураКласса, ОбъектыНоменклатуры, КлассТабличнаяЧасть, 
			|НомерПоСчетчику, ШагСчетчика, ПрисвоенНомерПоШаблону, РежимКонтроляДублейПоНаименованию,
			|КонтрольДублейВПределахКласса, " + СписокРеквизитовКодированияИменования());
		ИсточникЗаполнения = ВыбраннаяСтрока;
		Если НЕ ЗначениеЗаполнено(РеквизитыКласса.Статус) Тогда
			РеквизитыКласса.Статус = Перечисления.СтатусыОбъектовНСИ.Черновик;
		КонецЕсли;
		
		РежимРедактирования = ОбъектРедактируется(ВыбраннаяСтрока);
		
		ЗаголовокРедактируемогоЭлемента = УправлениеНСИФункцииКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
			НСтр("ru='Редактирование классов: %1'"), РеквизитыКласса.Наименование);
		
	// Создание класса.
	ИначеЕсли Режим = 1 Тогда
		
		ВыбратьОбъектРедактирования(Неопределено);
		
		РеквизитыКласса = Новый Структура("Родитель, ОтображатьВИерархииТО, Статус, 
			|ЗначениеАтрибута, НоменклатураКласса, ОбъектыНоменклатуры, Код, Наименование, 
			|НаименованиеПолное, НомерПоСчетчику, ШагСчетчика, ПрисвоенНомерПоШаблону, 
			|РежимКонтроляДублейПоНаименованию, КонтрольДублейВПределахКласса", 
			ВыбраннаяСтрока, Истина, Перечисления.СтатусыОбъектовНСИ.Черновик, 
			Истина, Истина, Ложь, "", "", "", 0, 0, Ложь,
			Перечисления.РежимыКонтроляДублей.ПустаяСсылка(), Справочники.Классы.ПустаяСсылка());
		РеквизитыРодителя = УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначенияРеквизитовОбъекта(ВыбраннаяСтрока, 
			"КлассТабличнаяЧасть, " + СписокРеквизитовКодированияИменования());
		Для Каждого КлючИЗначение ИЗ РеквизитыРодителя Цикл
			РеквизитыКласса.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЦикла;
		
		ИсточникЗаполнения = Неопределено;
		
		Отказ = Ложь;
		ПроверитьЗаблокироватьРедактированиеКлассаНаСервере(ВыбраннаяСтрока, Отказ, Ложь, Истина);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		РежимРедактирования = Истина;
		
		ЗаголовокРедактируемогоЭлемента = УправлениеНСИФункцииКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
			НСтр("ru='Редактирование классов: Создание (Родитель:%1)'"), ВыбраннаяСтрока);
		
	// Копирование класса.
	ИначеЕсли Режим = 2 Тогда
		ВыбратьОбъектРедактирования(Неопределено);
		
		Объект.Код = "";
		
		РеквизитыКласса = УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначенияРеквизитовОбъекта(
			ВыбраннаяСтрока, "Наименование, Родитель, ОтображатьВИерархииТО, НаименованиеПолное, 
			|ЗначениеАтрибута, НоменклатураКласса, ОбъектыНоменклатуры, КлассТабличнаяЧасть, 
			|РежимКонтроляДублейПоНаименованию, КонтрольДублейВПределахКласса,
			|" + СписокРеквизитовКодированияИменования());
		РеквизитыКласса.Вставить("Статус", Перечисления.СтатусыОбъектовНСИ.Черновик);
		РеквизитыКласса.Вставить("НомерПоСчетчику", 0);
		РеквизитыКласса.Вставить("ШагСчетчика",     0);
		РеквизитыКласса.Вставить("ПрисвоенНомерПоШаблону", Ложь);
		
		ИсточникЗаполнения = ВыбраннаяСтрока;
		
		Отказ = Ложь;
		ПроверитьЗаблокироватьРедактированиеКлассаНаСервере(РеквизитыКласса.Родитель, Отказ, Ложь, Истина);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		РежимРедактирования = Истина;
		
		ЗаголовокРедактируемогоЭлемента = УправлениеНСИФункцииКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
			НСтр("ru='Редактирование классов: Создание (Копирование:%1)'"), ВыбраннаяСтрока);
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Объект, РеквизитыКласса);
	
	ТекРодительКласса = Объект.Родитель;
	
	Элементы.ГруппаПраваяКолонка.ТолькоПросмотр = Ложь;
	Элементы.НоменклатураКласса.Доступность     = НЕ Объект.КлассТабличнаяЧасть;
	Элементы.ЗначениеАтрибута.Доступность       = НЕ Объект.КлассТабличнаяЧасть;
	Элементы.ОбъектыНоменклатуры.Доступность    = Объект.НоменклатураКласса;
	
	Элементы.ГруппаПараметрыКласса.Видимость = ЗначениеЗаполнено(Объект.Родитель);
	
	Элементы.ГруппаПараметрыНоменклатуры.Доступность        = Объект.НоменклатураКласса;
	Элементы.ГруппаПараметрыОбъектаНоменклатуры.Доступность = Объект.ОбъектыНоменклатуры;
	
	Элементы.ГруппаСтраницыКонтрольДублейПоНаименованию.ТекущаяСтраница = 
		?(Объект.РежимКонтроляДублейПоНаименованию = Перечисления.РежимыКонтроляДублей.ВПределахКласса,
			Элементы.ГруппаСтраницаКонтрольДублейВПределахКласса,
			Элементы.ГруппаСтраницаКонтрольДублейКакУРодителя);
	
	УстановитьАвтоотметкуНезаполненных(СписокРеквизитовКодированияИменованияНоменклатуры(), Объект.НоменклатураКласса);
	УстановитьАвтоотметкуНезаполненных(СписокРеквизитовКодированияИменованияОбъектов(),     Объект.ОбъектыНоменклатуры);
	
	УстановитьРежимТолькоПросмотра(НЕ РежимРедактирования, ПравоИзменениеКлассов);
	
	ЗаполнитьСписокРодителей();
	ЗаполнитьАтрибуты(ИсточникЗаполнения);
	
	Объект.ЗначенияСписочныхАтрибутов.Очистить();
	МассивАтрибутов = СписочныеАтрибуты.Выгрузить(Новый Структура("ТипОбъекта, КлассТабличнаяЧасть", 0, Ложь)).ВыгрузитьКолонку("АтрибутКласса");
	Если МассивАтрибутов.Количество() > 0 Тогда
		ЗаполнитьЗначенияСписочныхАтрибутов(ИсточникЗаполнения, МассивАтрибутов);
	КонецЕсли;
	
	ЗаполнитьЗначенияТабличныхАтрибутов(ИсточникЗаполнения);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НайтиНовыйИД(ТаблицаФормы, КолонкаИД, Знач МинИД = Неопределено)
	
	Если НЕ ЗначениеЗаполнено(МинИД) Тогда
		МинИД = 1;
	КонецЕсли;
	
	НовыйИД = Макс(ТаблицаФормы.Количество() + 1, МинИД);
	СтруктураПоиска = Новый Структура(КолонкаИД, НовыйИД);
	
	Найдено = Истина;
	Пока Найдено Цикл
		Найдено = (ТаблицаФормы.НайтиСтроки(СтруктураПоиска).Количество() > 0);
		Если Найдено Тогда
			НовыйИД = НовыйИД + 1;
			СтруктураПоиска[КолонкаИД] = НовыйИД;
		КонецЕсли;
	КонецЦикла;
	
	Возврат НовыйИД;
	
КонецФункции

// Атрибуты.

&НаСервере
Функция ПолучитьДополненныйСписокРодителей(Знач ИсточникЗаполнения)
	
	Если ИсточникЗаполнения = Неопределено Тогда
		ИсточникЗаполнения = Справочники.Классы.ПустаяСсылка();
	КонецЕсли;
	
	ПараметрСписокРодителей = СписокРодителей.Выгрузить();
	ПараметрСписокРодителей.Колонки.Добавить("КлассДляЧтения", Новый ОписаниеТипов("СправочникСсылка.Классы"));
	ПараметрСписокРодителей.ЗаполнитьЗначения(ИсточникЗаполнения, "КлассДляЧтения");
	
	Если ПараметрСписокРодителей.Количество() = 0 Тогда
		ПоследняяСтрока = ПараметрСписокРодителей.Добавить();
		ПоследняяСтрока.Класс          = ИсточникЗаполнения;
		ПоследняяСтрока.КлассДляЧтения = ИсточникЗаполнения;
		ПоследняяСтрока.Уровень        = ПараметрСписокРодителей.Количество();
	Иначе
		ПоследняяСтрока = ПараметрСписокРодителей[ПараметрСписокРодителей.Количество() - 1];
		Если ПоследняяСтрока.Класс = Объект.Класс.Ссылка Тогда
			ПоследняяСтрока.Класс = ИсточникЗаполнения;
		ИначеЕсли НЕ ПоследняяСтрока.Класс = ИсточникЗаполнения Тогда
			ПоследняяСтрока = ПараметрСписокРодителей.Добавить();
			ПоследняяСтрока.Класс          = ИсточникЗаполнения;
			ПоследняяСтрока.КлассДляЧтения = ИсточникЗаполнения;
			ПоследняяСтрока.Уровень        = ПараметрСписокРодителей.Количество();
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПараметрСписокРодителей;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьАтрибуты(ИсточникЗаполнения)
	
	// Получаем иерархию классов для получения наследуемых атрибутов и значений.
	ТипОбъектНоменклатуры = Тип("СправочникСсылка.ОбъектыНоменклатуры");
	ТипНоменклатураКласса = Тип("СправочникСсылка.НоменклатураКласса");
	ТипКласс              = Тип("СправочникСсылка.Классы");
	ПустойКласс           = Справочники.Классы.ПустаяСсылка();
	ОписаниеТиповБулево   = Новый ОписаниеТипов("Булево");
	ОписаниеТиповСсылка   = Новый ОписаниеТипов("СправочникСсылка.Классы, СправочникСсылка.НоменклатураКласса");
	
	МассивТипов = ОписаниеТиповСсылка.Типы();
	МассивТипов.Добавить(ТипОбъектНоменклатуры);
	ОписаниеТиповСоставной = Новый ОписаниеТипов(МассивТипов);
	
	МассивСписочныхАктуальных = Новый Массив;
	СоответствиеАтрибутСтрока = Новый Соответствие;
	
	ПараметрСписокРодителей = ПолучитьДополненныйСписокРодителей(ИсточникЗаполнения);
	ТаблицаАтрибутов = Справочники.Классы.ПолучитьТаблицуАтрибутов(ПараметрСписокРодителей);
	
	ТаблицаАтрибутов.Колонки.Добавить("НуженИсточникЗначений",    ОписаниеТиповБулево);
	ТаблицаАтрибутов.Колонки.Добавить("СоставнойТипЗначения",     ОписаниеТиповБулево);
	ТаблицаАтрибутов.Колонки.Добавить("ЭтоВложенныйАтрибут",      ОписаниеТиповБулево);
	ТаблицаАтрибутов.Колонки.Добавить("ЭтотАтрибутВШаблоне", 
		Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(1,0,ДопустимыйЗнак.Неотрицательный)));
	ТаблицаАтрибутов.Колонки.Добавить("ТипЗначенияПредставление", Новый ОписаниеТипов("Строка"));
	ТаблицаАтрибутов.Колонки.Добавить("ЗначениеАтрибутаКлассаСоставное", ОписаниеТиповСоставной); 
	
	ТаблицаСписочныеАтрибуты = РеквизитФормыВЗначение("СписочныеАтрибуты");
	
	СтруктураАтрибутов = ПолучитьАтрибутыШаблонов(Объект.ШаблонКодаКласса, Объект.ШаблонНаименованияКласса, 
		Объект.ШаблонКодаНоменклатуры, Объект.ШаблонНаименованияНоменклатуры, 
		Объект.ШаблонКодаОбъекта, Объект.ШаблонНаименованияОбъекта);
	
	ТипЧисло  = Тип("Число");
	ТипДата   = Тип("Дата");
	ТипСтрока = Тип("Строка");
	
	Для Каждого СтрокаТЗ ИЗ ТаблицаАтрибутов Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТЗ.ТипЗначения) И ЗначениеЗаполнено(СтрокаТЗ.ТипЗначенияРеквизита) Тогда
			СтрокаТЗ.ТипЗначения = ЗначениеИзСтрокиВнутр(СтрокаТЗ.ТипЗначенияРеквизита);
		КонецЕсли;
		ТипЗначения = СтрокаТЗ.ТипЗначения;
		
		Если ЗначениеЗаполнено(ТипЗначения) Тогда
			СтрокаТЗ.ЗначениеАтрибутаКласса = ТипЗначения.ПривестиЗначение(СтрокаТЗ.ЗначениеАтрибутаКласса);
			Если ТипЗначения.СодержитТип(ТипЧисло)
					ИЛИ ТипЗначения.СодержитТип(ТипДата) Тогда
				СтрокаТЗ.МинЗначение  = ТипЗначения.ПривестиЗначение(СтрокаТЗ.МинЗначение);
				СтрокаТЗ.МаксЗначение = ТипЗначения.ПривестиЗначение(СтрокаТЗ.МаксЗначение);
			КонецЕсли;
		КонецЕсли;
		СтрокаТЗ.ЭтоВложенныйАтрибут = (ТипЗнч(СтрокаТЗ.АтрибутКласса) = Тип("СправочникСсылка.ВложенныеАтрибутыКласса"));
		Если (НЕ СтруктураАтрибутов.АтрибутыШаблонаКласса = Неопределено) 
				И (НЕ СтруктураАтрибутов.АтрибутыШаблонаКласса.Найти(СтрокаТЗ.АтрибутКласса) = Неопределено) Тогда
			СтрокаТЗ.ЭтотАтрибутВШаблоне = 1;
		ИначеЕсли (НЕ СтруктураАтрибутов.АтрибутыШаблонаНоменклатуры = Неопределено) 
				И (НЕ СтруктураАтрибутов.АтрибутыШаблонаНоменклатуры.Найти(СтрокаТЗ.АтрибутКласса) = Неопределено) Тогда
			СтрокаТЗ.ЭтотАтрибутВШаблоне = 2;
		ИначеЕсли (НЕ СтруктураАтрибутов.АтрибутыШаблонаОбъекта = Неопределено) 
				И (НЕ СтруктураАтрибутов.АтрибутыШаблонаОбъекта.Найти(СтрокаТЗ.АтрибутКласса) = Неопределено) Тогда
			СтрокаТЗ.ЭтотАтрибутВШаблоне = 3;
		КонецЕсли;
		
		// Проверка типа атрибута.
		КлассИлиНоменклатура   = НЕ СтрокаТЗ.ЭтоВложенныйАтрибут И ОписаниеТиповСсылка.СодержитТип(СтрокаТЗ.ТипЗначения.Типы()[0]);
		ЕстьНоменклатураКласса = НЕ СтрокаТЗ.ЭтоВложенныйАтрибут И СтрокаТЗ.ТипЗначения.СодержитТип(ТипНоменклатураКласса);
		ЕстьОбъектНоменклатуры = НЕ СтрокаТЗ.ЭтоВложенныйАтрибут И СтрокаТЗ.ТипЗначения.СодержитТип(ТипОбъектНоменклатуры);
		
		СтрокаТЗ.СоставнойТипЗначения = (ЕстьНоменклатураКласса ИЛИ ЕстьОбъектНоменклатуры);
		СтрокаТЗ.НуженИсточникЗначений = (КлассИлиНоменклатура ИЛИ ЕстьОбъектНоменклатуры);
		
		// Представление значения атрибута.
		Если КлассИлиНоменклатура И НЕ СтрокаТЗ.СоставнойТипЗначения 
				И ЗначениеЗаполнено(СтрокаТЗ.ИсточникЗначений) Тогда
			СтрокаТЗ.ТипЗначенияПредставление = "(" + Строка(СтрокаТЗ.ИсточникЗначений) + ")";
		Иначе
			СтрокаТЗ.ТипЗначенияПредставление = "(" + Строка(СтрокаТЗ.ТипЗначения) + ")";
		КонецЕсли;
		
		Если КлассИлиНоменклатура И НЕ ЕстьОбъектНоменклатуры
				И НЕ ТипЗнч(СтрокаТЗ.ИсточникЗначений) = ТипКласс Тогда
			СтрокаТЗ.ИсточникЗначений = ПустойКласс;
		КонецЕсли;
		
		Если СтрокаТЗ.СоставнойТипЗначения Тогда
			СтрокаТЗ.ЗначениеАтрибутаКлассаСоставное = ?(ЗначениеЗаполнено(СтрокаТЗ.ЗначениеАтрибутаКласса),
				СтрокаТЗ.ЗначениеАтрибутаКласса, СтрокаТЗ.ИсточникЗначений);
		КонецЕсли;
		
		Если СтрокаТЗ.СтатусНаследования <= 3 И ЗначениеЗаполнено(ТипЗначения) И НЕ ТипЗначения.СодержитТип(ТипСтрока) 
				И (СтрокаТЗ.МножественноеЗначение ИЛИ СтрокаТЗ.СписокДоступныхЗначений) Тогда
			
			МассивСписочныхАктуальных.Добавить(СтрокаТЗ.АтрибутКласса);
			
			Найдено = ТаблицаСписочныеАтрибуты.НайтиСтроки(Новый Структура("ТипОбъекта, АтрибутКласса", 0, СтрокаТЗ.АтрибутКласса));
			Если Найдено.Количество() = 0 Тогда
				СписочныйАтрибут = ТаблицаСписочныеАтрибуты.Добавить();
				СписочныйАтрибут.ИДАтрибута          = НайтиНовыйИД(ТаблицаСписочныеАтрибуты, "ИДАтрибута", 2);
				СписочныйАтрибут.АтрибутКласса       = СтрокаТЗ.АтрибутКласса;
				СписочныйАтрибут.КлассТабличнаяЧасть = СтрокаТЗ.КлассТабличнаяЧасть;
				СписочныйАтрибут.ТипОбъекта          = 0;
				СписочныйАтрибут.ИсточникЗначений    = СтрокаТЗ.ИсточникЗначений;
				СоответствиеАтрибутСтрока.Вставить(СтрокаТЗ.АтрибутКласса, СписочныйАтрибут);
			Иначе
				СоответствиеАтрибутСтрока.Вставить(СтрокаТЗ.АтрибутКласса, Найдено[0]);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Объект.Атрибуты.Загрузить(ТаблицаАтрибутов);
	
	// Удаляем лишние списочные атрибуты.
	КолВо = ТаблицаСписочныеАтрибуты.Количество();
	Для Н = 1 По КолВо Цикл
		СписочныйАтрибут = ТаблицаСписочныеАтрибуты[КолВо - Н];
		Если СписочныйАтрибут.ТипОбъекта = 0 
				И СоответствиеАтрибутСтрока[СписочныйАтрибут.АтрибутКласса] = Неопределено Тогда
			ТаблицаСписочныеАтрибуты.Удалить(КолВо - Н);
		КонецЕсли;
	КонецЦикла;
	
	// Очищаем список страниц списочных атрибутов.
	КолВо = Элементы.ПереключательАтрибутов.СписокВыбора.Количество();
	Для Н = 1 По КолВо - 2 Цикл
		Элементы.ПереключательАтрибутов.СписокВыбора.Удалить(КолВо - Н);
	КонецЦикла;
	
	ТаблицаСписочныеАтрибуты.Сортировать("ТипОбъекта");
	
	// Настраиваем список страниц списочных атрибутов.
	Н = 0;
	Для Каждого АтрибутКласса ИЗ МассивСписочныхАктуальных Цикл
		СписочныйАтрибут = СоответствиеАтрибутСтрока[АтрибутКласса];
		Индекс = ТаблицаСписочныеАтрибуты.Индекс(СписочныйАтрибут);
		Если НЕ Индекс = Н Тогда
			ТаблицаСписочныеАтрибуты.Сдвинуть(Индекс, Н - Индекс);
		КонецЕсли;
		
		Элементы.ПереключательАтрибутов.СписокВыбора.Добавить(СписочныйАтрибут.ИДАтрибута, АтрибутКласса);
		Н = Н + 1;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ТаблицаСписочныеАтрибуты, "СписочныеАтрибуты");
	
КонецПроцедуры

// Списочные атрибуты.

&НаСервере
Процедура ЗаполнитьЗначенияСписочныхАтрибутов(ИсточникЗаполнения, АтрибутКласса=Неопределено)
	
	ПараметрСписокРодителей = ПолучитьДополненныйСписокРодителей(ИсточникЗаполнения);
	
	ОтборПоАтрибуту = (ЗначениеЗаполнено(АтрибутКласса));
	
	ТаблицаАтрибутов = Справочники.Классы.ПолучитьЗначенияСписочныхАтрибутов(ПараметрСписокРодителей, АтрибутКласса);
	Если НЕ ОтборПоАтрибуту Тогда
		Объект.ЗначенияСписочныхАтрибутов.Загрузить(ТаблицаАтрибутов);
	Иначе
		Для Каждого СтрокаТЗ ИЗ ТаблицаАтрибутов Цикл
			НоваяСтрока = Объект.ЗначенияСписочныхАтрибутов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Табличные атрибуты.

&НаСервере
Функция ТекстЗапросаТаблицаРодителей()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Классы.Ссылка КАК КлассДляЧтения,
		|	Классы.Ссылка КАК Класс
		|ИЗ
		|	Справочник.Классы КАК Классы
		|ГДЕ
		|	НЕ Классы.ПометкаУдаления
		|	И Классы.Ссылка В (&КлассыДляЧтения)
		|ИТОГИ
		|	МАКСИМУМ(КлассДляЧтения)
		|ПО
		|	Класс,
		|	Класс ТОЛЬКО ИЕРАРХИЯ";
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Процедура ПрочитатьЗначенияТабличныхАтрибутов(ПараметрСписокРодителей, ДанныеТабличныхАтрибутов, НовыйИДСтроки = 1, СоответствиеИДСтрок = Неопределено)
	
	// Чтение строк табличных атрибутов.
	ТаблицаАтрибутов = Справочники.Классы.ПолучитьСтрокиТабличныхАтрибутов(
		ПараметрСписокРодителей, ДанныеТабличныхАтрибутов);
	ТаблицаАтрибутов.Колонки.Добавить("ИДСтроки");
	
	Если ТаблицаАтрибутов.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	СоответствиеИДСтрокВложенных = Новый Соответствие;
	СтрокиТаблицы = Новый Массив;
	
	Для Каждого СтрокаТЗ ИЗ ТаблицаАтрибутов Цикл
		
		Если СтрокаТЗ.СтатусНаследования > 3 Тогда
			Продолжить;
		КонецЕсли;
		
		ЗначениеПоиска = ?(ЗначениеЗаполнено(СтрокаТЗ.ЗначениеАтрибутаКласса), 
			СтрокаТЗ.ЗначениеАтрибутаКласса, СтрокаТЗ.ИсточникЗначений);
			
		// Формируем соответствие для быстрого добавления элементов следующего уровня вложенности.
		МассивСтрок = СоответствиеИДСтрокВложенных[ЗначениеПоиска];
		Если МассивСтрок = Неопределено Тогда
			МассивСтрок = Новый Массив;
			СоответствиеИДСтрокВложенных.Вставить(ЗначениеПоиска, МассивСтрок);
			СтрокиТаблицы.Добавить(ЗначениеПоиска);
		КонецЕсли;
		
		// Ищем строки-родители для текущего уровня вложенности (если уровень - первый, то родитель - корень дерева).
		Если СоответствиеИДСтрок = Неопределено Тогда
			МассивРодителей = Новый Массив;
			МассивРодителей.Добавить(Новый Структура("ИДСтроки, ЗначениеАтрибутаКласса, СтатусНаследования", 0, Неопределено, 1));
		Иначе
			МассивРодителей = СоответствиеИДСтрок[СтрокаТЗ.КлассДляЧтения];
			Если МассивРодителей = Неопределено Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		// Добавляем строку в найденные строки-родители.
		Для Каждого СтрокаРодитель ИЗ МассивРодителей Цикл
			СтрокаТЗ.ИДСтроки = НовыйИДСтроки;
			
			СтрокаТЧ = Объект.СтрокиТабличныхАтрибутов.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаТЗ);
			
			СтрокаТЧ.ИДСтрокиРодителя   = СтрокаРодитель.ИДСтроки;
			Если СтрокаРодитель.ИДСтроки > 0 И НЕ ЗначениеЗаполнено(СтрокаРодитель.ЗначениеАтрибутаКласса) Тогда
				// Если родительская строка - наследуемая, то и текущая строка - тоже наследуемая.
				СтрокаТЧ.СтатусНаследования = Макс(СтрокаТЧ.СтатусНаследования, СтрокаРодитель.СтатусНаследования);
				Если ЗначениеЗаполнено(СтрокаТЧ.ЗначениеАтрибутаКласса) И СтрокаТЧ.СтатусНаследования >= 3 Тогда 
					СтрокаТЧ.ИсточникЗначений = СтрокаТЧ.ЗначениеАтрибутаКласса;
					СтрокаТЧ.ЗначениеАтрибутаКласса = Справочники.Классы.ПустаяСсылка();
				КонецЕсли;
			КонецЕсли;
			МассивСтрок.Добавить(СтрокаТЧ);
			
			НовыйИДСтроки = НовыйИДСтроки + 1;
		КонецЦикла;
	КонецЦикла;
	
	// Чтение значений атрибутов строк.
	
	// Таблица родителей для чтения атрибутов строк.
	ТаблицаРодителей = Справочники.Классы.ПолучитьТаблицуРодителей(СтрокиТаблицы);
	
	ДанныеТабличныхАтрибутовВложенных = Новый Массив;
	МассивОбъектовДляЧтения = Новый Массив;
	
	СтруктураПоискаРодителя = Новый Структура("Класс");
	
	// Вывод значений атрибутов строк.
	ЗначенияАтрибутов = Справочники.Классы.ПолучитьТаблицуАтрибутов(ТаблицаРодителей);
	Для Каждого СтрокаЗначений ИЗ ЗначенияАтрибутов Цикл
		Если СтрокаЗначений.МножественноеЗначение И СтрокаЗначений.КлассТабличнаяЧасть Тогда
			ДанныеТабличныхАтрибутовВложенных.Добавить(СтрокаЗначений.АтрибутКласса);
		КонецЕсли;
		
		МассивСтрок = СоответствиеИДСтрокВложенных[СтрокаЗначений.КлассДляЧтения];
		Если МассивСтрок = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		// Подмена объекта назначения в иерархии наследования.
		Если СтрокаЗначений.АтрибутКласса = ПланыВидовХарактеристик.АтрибутыКласса.ОбъектОперации 
				И ЗначениеЗаполнено(СтрокаЗначений.ЗначениеАтрибутаКласса) Тогда
			СтруктураПоискаРодителя.Класс = СтрокаЗначений.ЗначениеАтрибутаКласса;
			Найдено = СписокРодителей.НайтиСтроки(СтруктураПоискаРодителя);
			Если Найдено.Количество() > 0 Тогда
				СтрокаЗначений.ЗначениеАтрибутаКласса = Объект.Класс.Ссылка;
			КонецЕсли;
		КонецЕсли;
		
		// Добавление значений атрибутов строк в данные обработки.
		Для Каждого СтрокаТаб ИЗ МассивСтрок Цикл
			СтрокаТЧ = Объект.ЗначенияТабличныхАтрибутов.Добавить();
			СтрокаТЧ.ИДСтрокиРодителя        = СтрокаТаб.ИДСтрокиРодителя;
			СтрокаТЧ.АтрибутКласса           = СтрокаТаб.АтрибутКласса;
			СтрокаТЧ.ИДСтроки                = СтрокаТаб.ИДСтроки;
			СтрокаТЧ.АтрибутТаблицы          = СтрокаЗначений.АтрибутКласса;
			СтрокаТЧ.ЗначениеАтрибутаТаблицы = СтрокаЗначений.ЗначениеАтрибутаКласса;
		КонецЦикла;
	КонецЦикла;
	
	
	Если ДанныеТабличныхАтрибутовВложенных.Количество() > 0 Тогда
		ПрочитатьЗначенияТабличныхАтрибутов(
			ТаблицаРодителей, ДанныеТабличныхАтрибутовВложенных, НовыйИДСтроки, СоответствиеИДСтрокВложенных);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияТабличныхАтрибутов(ИсточникЗаполнения)
	
	Объект.СтрокиТабличныхАтрибутов.Очистить();
	Объект.ЗначенияТабличныхАтрибутов.Очистить();
	
	// Чтение строк табличных атрибутов.
	ДанныеТабличныхАтрибутов = СписочныеАтрибуты.Выгрузить(
		Новый Структура("ТипОбъекта, КлассТабличнаяЧасть", 0, Истина), "АтрибутКласса").ВыгрузитьКолонку("АтрибутКласса");
	Если ДанныеТабличныхАтрибутов.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	НовыйИДСтроки = 1;
	ПараметрСписокРодителей = ПолучитьДополненныйСписокРодителей(ИсточникЗаполнения);
	ПрочитатьЗначенияТабличныхАтрибутов(ПараметрСписокРодителей, ДанныеТабличныхАтрибутов, НовыйИДСтроки);
	
КонецПроцедуры

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// Запись изменений в базу данных.

#Область ПроцедурыИФункцииЗаписиИзмененийВБазу

&НаСервере
Процедура ЗаписатьНаСервере()
	
	Если НЕ Редактирование Тогда
		Модифицированность = Ложь;
		Возврат;
	КонецЕсли;
	
	СнятьБлокировку = Истина;
	ЭтоНовый = Ложь;
	
	// Если формат и шаблон кода - наследуются от родителя, 
	// тогда в текущем классе записываем пустые значения.
	Если Объект.ФорматКодаКласса = Объект.ФорматКодаРодителя Тогда
		Объект.ФорматКодаКласса = "";
	КонецЕсли;
	Если Объект.ШаблонКодаКласса = Объект.ШаблонКодаРодителя Тогда
		Объект.ШаблонКодаКласса = Справочники.ШаблоныЗаполнения.ПустаяСсылка();
	КонецЕсли;
	
	// 1. Реквизиты шапки.
	Если ЗначениеЗаполнено(Объект.Класс.Ссылка) Тогда
		Изменено = Ложь;
		РеквизитыШапки = УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначенияРеквизитовОбъекта(Объект.Класс.Ссылка, 
			"Наименование, НаименованиеПолное, Код, Родитель, ОтображатьВИерархииТО, 
			|ЗначениеАтрибута, НоменклатураКласса, ОбъектыНоменклатуры, Статус, КлассТабличнаяЧасть, 
			|НомерПоСчетчику, ШагСчетчика, ПрисвоенНомерПоШаблону, РежимКонтроляДублейПоНаименованию,
			|КонтрольДублейВПределахКласса, " + СписокРеквизитовКодированияИменования());
		Для Каждого КлючИЗначение ИЗ РеквизитыШапки Цикл
			Если НЕ Объект[КлючИЗначение.Ключ] = КлючИЗначение.Значение Тогда
				Изменено = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		ЭтоНовый = Истина;
		Изменено = Истина;
		СнятьБлокировку = Ложь;
	КонецЕсли;
	
	Если Изменено Тогда
		Попытка
			СпрОбъект = ДанныеФормыВЗначение(Объект.Класс, Тип("СправочникОбъект.Классы"));
			ЗаполнитьЗначенияСвойств(СпрОбъект, Объект);
			СпрОбъект.Записать();
			ЗаполнитьЗначенияСвойств(Объект, СпрОбъект, "Код, ПрисвоенНомерПоШаблону, НомерПоСчетчику, ШагСчетчика");
			ЗначениеВДанныеФормы(СпрОбъект, Объект.Класс);
			
		Исключение
			ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации("Запись класса", УровеньЖурналаРегистрации.Ошибка, СпрОбъект.Метаданные(), 
				СпрОбъект.Ссылка, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
 			ВыбратьОбъектРедактирования(Неопределено);
			ОтменитьРедактированиеНаСервере();
			Возврат;
			
		КонецПопытки;
		
		Элементы.КлассыСписок.Обновить();
		Если ЭтоНовый Тогда
			Объект.Код = Объект.Класс.Код;
			Элементы.КлассыСписок.ТекущаяСтрока = Объект.Класс.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Запись класса", УровеньЖурналаРегистрации.Информация, 
		Метаданные.Справочники.Классы, Объект.Класс.Ссылка, "Начало записи");
	
	// Если формат и шаблон кода - наследуются от родителя, 
	// восстанавливаем значения родителя.
	Если НЕ ЗначениеЗаполнено(Объект.ШаблонКодаКласса) И ЗначениеЗаполнено(Объект.ШаблонКодаРодителя) Тогда
		Объект.ШаблонКодаКласса = Объект.ШаблонКодаРодителя;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ФорматКодаКласса) И ЗначениеЗаполнено(Объект.ФорматКодаРодителя) Тогда
		Объект.ФорматКодаКласса = Объект.ФорматКодаРодителя;
	КонецЕсли;
	
	// 3. Атрибуты.
	ЗаписатьАтрибуты();
	
	// 4. Значения списочных атрибутов.
	ЗаписатьЗначенияСписочныхАтрибутов();
	
	// 5. Значения табличных атрибутов.
	ЗаписатьЗначенияТабличныхАтрибутов();
	
	ЗаписьЖурналаРегистрации("Запись класса", УровеньЖурналаРегистрации.Информация, 
		Метаданные.Справочники.Классы, Объект.Класс.Ссылка, "Окончание записи");
	
	Модифицированность = Ложь;
	
	Если СнятьБлокировку Тогда
		СнятьБлокировкуКласса();
	КонецЕсли;
	
КонецПроцедуры

// Простые атрибуты.

&НаСервере
Функция ТекстЗапросаИзмененияИспользованияВСоставеОбъектов()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТаблицаИспользования.Класс КАК Класс,
		|	ТаблицаИспользования.АтрибутКласса КАК АтрибутКласса
		|ПОМЕСТИТЬ ВТ_ТаблицаИспользования
		|ИЗ
		|	&ТаблицаИспользования КАК ТаблицаИспользования
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МножественныеЗначенияАтрибутов.Класс КАК Класс,
		|	МножественныеЗначенияАтрибутов.АтрибутКласса КАК АтрибутКласса,
		|	-1 КАК ВидДействия
		|ПОМЕСТИТЬ ВТ_ДанныеСравнения
		|ИЗ
		|	РегистрСведений.МножественныеЗначенияАтрибутов КАК МножественныеЗначенияАтрибутов
		|ГДЕ
		|	МножественныеЗначенияАтрибутов.ЗначениеАтрибутаКласса = &Класс
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ТаблицаИспользования.Класс,
		|	ВТ_ТаблицаИспользования.АтрибутКласса,
		|	1
		|ИЗ
		|	ВТ_ТаблицаИспользования КАК ВТ_ТаблицаИспользования
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеСравнения.Класс КАК Класс,
		|	ВТ_ДанныеСравнения.АтрибутКласса КАК АтрибутКласса,
		|	СУММА(ВТ_ДанныеСравнения.ВидДействия) КАК ВидДействия
		|ИЗ
		|	ВТ_ДанныеСравнения КАК ВТ_ДанныеСравнения
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ДанныеСравнения.Класс,
		|	ВТ_ДанныеСравнения.АтрибутКласса
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВТ_ДанныеСравнения.ВидДействия) <> 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	Класс,
		|	АтрибутКласса
		|АВТОУПОРЯДОЧИВАНИЕ";
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Функция ТекстЗапросаИзмененияАтрибутовВременныеТаблицы()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ДанныеАтрибутов.АтрибутКласса,
		|	ДанныеАтрибутов.НомерСтроки КАК Порядок,
		|	ДанныеАтрибутов.РежимИспользования,
		|	ДанныеАтрибутов.РежимЗаполнения,
		|	ДанныеАтрибутов.МножественноеЗначение,
		|	ДанныеАтрибутов.СписокДоступныхЗначений,
		|	ДанныеАтрибутов.ИсточникЗначений,
		|	ДанныеАтрибутов.МинЗначение,
		|	ДанныеАтрибутов.МаксЗначение,
		|	ДанныеАтрибутов.ДобавлениеСтрокТабЧастиВНоменклатуреКласса,
		|	ДанныеАтрибутов.ДобавлениеСтрокТабЧастиВОбъектахНоменклатуры,
		|	ДанныеАтрибутов.Формат
		|ПОМЕСТИТЬ ВТ_ДанныеДобавленныхАтрибутов
		|ИЗ
		|	&ДанныеДобавленныхАтрибутов КАК ДанныеАтрибутов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеАтрибутов.АтрибутКласса,
		|	ДанныеАтрибутов.НомерСтроки КАК Порядок,
		|	ДанныеАтрибутов.РежимИспользования,
		|	ДанныеАтрибутов.РежимЗаполнения,
		|	ДанныеАтрибутов.МножественноеЗначение,
		|	ДанныеАтрибутов.СписокДоступныхЗначений,
		|	ДанныеАтрибутов.ИсточникЗначений,
		|	ДанныеАтрибутов.МинЗначение,
		|	ДанныеАтрибутов.МаксЗначение,
		|	ДанныеАтрибутов.ДобавлениеСтрокТабЧастиВНоменклатуреКласса,
		|	ДанныеАтрибутов.ДобавлениеСтрокТабЧастиВОбъектахНоменклатуры,
		|	ДанныеАтрибутов.Формат
		|ПОМЕСТИТЬ ВТ_ДанныеНаследованныхАтрибутов
		|ИЗ
		|	&ДанныеНаследованныхАтрибутов КАК ДанныеАтрибутов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НазначениеАтрибутов.АтрибутКласса,
		|	НазначениеАтрибутов.РежимИспользования,
		|	НазначениеАтрибутов.РежимЗаполнения,
		|	НазначениеАтрибутов.МножественноеЗначение,
		|	НазначениеАтрибутов.СписокДоступныхЗначений,
		|	НазначениеАтрибутов.ИсточникЗначений,
		|	НазначениеАтрибутов.МинЗначение,
		|	НазначениеАтрибутов.МаксЗначение,
		|	НазначениеАтрибутов.ДобавлениеСтрокТабЧастиВНоменклатуреКласса,
		|	НазначениеАтрибутов.ДобавлениеСтрокТабЧастиВОбъектахНоменклатуры,
		|	НазначениеАтрибутов.Формат,
		|	НазначениеАтрибутов.Порядок
		|ПОМЕСТИТЬ ВТ_ДанныеАтрибутовСохраненные
		|ИЗ
		|	РегистрСведений.НазначениеАтрибутов КАК НазначениеАтрибутов
		|ГДЕ
		|	НазначениеАтрибутов.Класс = &Класс
		|	И (НазначениеАтрибутов.АтрибутКласса ССЫЛКА ПланВидовХарактеристик.АтрибутыКласса
		|		ИЛИ НазначениеАтрибутов.АтрибутКласса ССЫЛКА Справочник.ВложенныеАтрибутыКласса)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеДобавленныхАтрибутов.АтрибутКласса,
		|	ВТ_ДанныеДобавленныхАтрибутов.Порядок,
		|	ВТ_ДанныеДобавленныхАтрибутов.РежимИспользования,
		|	ВТ_ДанныеДобавленныхАтрибутов.РежимЗаполнения,
		|	ВТ_ДанныеДобавленныхАтрибутов.МножественноеЗначение,
		|	ВТ_ДанныеДобавленныхАтрибутов.СписокДоступныхЗначений,
		|	ВТ_ДанныеДобавленныхАтрибутов.ИсточникЗначений,
		|	ВТ_ДанныеДобавленныхАтрибутов.МинЗначение,
		|	ВТ_ДанныеДобавленныхАтрибутов.МаксЗначение,
		|	ВТ_ДанныеДобавленныхАтрибутов.ДобавлениеСтрокТабЧастиВНоменклатуреКласса,
		|	ВТ_ДанныеДобавленныхАтрибутов.ДобавлениеСтрокТабЧастиВОбъектахНоменклатуры,
		|	ВТ_ДанныеДобавленныхАтрибутов.Формат,
		|	ВЫБОР 
		|		КОГДА НЕ ВТ_ДанныеДобавленныхАтрибутов.РежимЗаполнения = ЕСТЬNULL(ВТ_ДанныеАтрибутовСохраненные.РежимЗаполнения, НЕОПРЕДЕЛЕНО) 
		|			ТОГДА ИСТИНА 
		|		ИНАЧЕ ЛОЖЬ 
		|	КОНЕЦ КАК РежимЗаполненияИзменен
		|ПОМЕСТИТЬ ВТ_ДанныеИзмененныхАтрибутов
		|ИЗ
		|	ВТ_ДанныеДобавленныхАтрибутов КАК ВТ_ДанныеДобавленныхАтрибутов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеАтрибутовСохраненные КАК ВТ_ДанныеАтрибутовСохраненные
		|		ПО ВТ_ДанныеДобавленныхАтрибутов.АтрибутКласса = ВТ_ДанныеАтрибутовСохраненные.АтрибутКласса
		|ГДЕ
		|	(НЕ ВТ_ДанныеДобавленныхАтрибутов.РежимИспользования = ЕСТЬNULL(ВТ_ДанныеАтрибутовСохраненные.РежимИспользования, НЕОПРЕДЕЛЕНО)
		|			ИЛИ НЕ ВТ_ДанныеДобавленныхАтрибутов.РежимЗаполнения = ЕСТЬNULL(ВТ_ДанныеАтрибутовСохраненные.РежимЗаполнения, НЕОПРЕДЕЛЕНО)
		|			ИЛИ НЕ ВТ_ДанныеДобавленныхАтрибутов.МножественноеЗначение = ЕСТЬNULL(ВТ_ДанныеАтрибутовСохраненные.МножественноеЗначение, НЕОПРЕДЕЛЕНО)
		|			ИЛИ НЕ ВТ_ДанныеДобавленныхАтрибутов.СписокДоступныхЗначений = ЕСТЬNULL(ВТ_ДанныеАтрибутовСохраненные.СписокДоступныхЗначений, НЕОПРЕДЕЛЕНО)
		|			ИЛИ НЕ ВТ_ДанныеДобавленныхАтрибутов.ИсточникЗначений = ЕСТЬNULL(ВТ_ДанныеАтрибутовСохраненные.ИсточникЗначений, НЕОПРЕДЕЛЕНО)
		|			ИЛИ НЕ ВТ_ДанныеДобавленныхАтрибутов.МинЗначение = ЕСТЬNULL(ВТ_ДанныеАтрибутовСохраненные.МинЗначение, НЕОПРЕДЕЛЕНО)
		|			ИЛИ НЕ ВТ_ДанныеДобавленныхАтрибутов.МаксЗначение = ЕСТЬNULL(ВТ_ДанныеАтрибутовСохраненные.МаксЗначение, НЕОПРЕДЕЛЕНО)
		|			ИЛИ НЕ ВТ_ДанныеДобавленныхАтрибутов.ДобавлениеСтрокТабЧастиВНоменклатуреКласса = ЕСТЬNULL(ВТ_ДанныеАтрибутовСохраненные.ДобавлениеСтрокТабЧастиВНоменклатуреКласса, НЕОПРЕДЕЛЕНО)
		|			ИЛИ НЕ ВТ_ДанныеДобавленныхАтрибутов.ДобавлениеСтрокТабЧастиВОбъектахНоменклатуры = ЕСТЬNULL(ВТ_ДанныеАтрибутовСохраненные.ДобавлениеСтрокТабЧастиВОбъектахНоменклатуры, НЕОПРЕДЕЛЕНО)
		|			ИЛИ НЕ ВТ_ДанныеДобавленныхАтрибутов.Формат = ЕСТЬNULL(ВТ_ДанныеАтрибутовСохраненные.Формат, НЕОПРЕДЕЛЕНО)
		|			ИЛИ НЕ ВТ_ДанныеДобавленныхАтрибутов.Порядок = ЕСТЬNULL(ВТ_ДанныеАтрибутовСохраненные.Порядок, НЕОПРЕДЕЛЕНО))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ДанныеНаследованныхАтрибутов.АтрибутКласса,
		|	ВТ_ДанныеНаследованныхАтрибутов.Порядок,
		|	ВТ_ДанныеНаследованныхАтрибутов.РежимИспользования,
		|	ВТ_ДанныеНаследованныхАтрибутов.РежимЗаполнения,
		|	ВТ_ДанныеНаследованныхАтрибутов.МножественноеЗначение,
		|	ВТ_ДанныеНаследованныхАтрибутов.СписокДоступныхЗначений,
		|	ВТ_ДанныеНаследованныхАтрибутов.ИсточникЗначений,
		|	ВТ_ДанныеНаследованныхАтрибутов.МинЗначение,
		|	ВТ_ДанныеНаследованныхАтрибутов.МаксЗначение,
		|	ВТ_ДанныеНаследованныхАтрибутов.ДобавлениеСтрокТабЧастиВНоменклатуреКласса,
		|	ВТ_ДанныеНаследованныхАтрибутов.ДобавлениеСтрокТабЧастиВОбъектахНоменклатуры,
		|	ВТ_ДанныеНаследованныхАтрибутов.Формат,
		|	ВЫБОР 
		|		КОГДА НЕ ВТ_ДанныеНаследованныхАтрибутов.РежимЗаполнения = ЕСТЬNULL(ВТ_ДанныеАтрибутовСохраненные.РежимЗаполнения, НЕОПРЕДЕЛЕНО)
		|			ТОГДА ИСТИНА 
		|		ИНАЧЕ ЛОЖЬ 
		|	КОНЕЦ
		|ИЗ
		|	ВТ_ДанныеНаследованныхАтрибутов КАК ВТ_ДанныеНаследованныхАтрибутов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеАтрибутовСохраненные КАК ВТ_ДанныеАтрибутовСохраненные
		|		ПО ВТ_ДанныеНаследованныхАтрибутов.АтрибутКласса = ВТ_ДанныеАтрибутовСохраненные.АтрибутКласса
		|ГДЕ
		|	(НЕ ВТ_ДанныеНаследованныхАтрибутов.РежимИспользования = ЕСТЬNULL(ВТ_ДанныеАтрибутовСохраненные.РежимИспользования, НЕОПРЕДЕЛЕНО)
		|			ИЛИ НЕ ВТ_ДанныеНаследованныхАтрибутов.РежимЗаполнения = ЕСТЬNULL(ВТ_ДанныеАтрибутовСохраненные.РежимЗаполнения, НЕОПРЕДЕЛЕНО)
		|			ИЛИ НЕ ВТ_ДанныеНаследованныхАтрибутов.МножественноеЗначение = ЕСТЬNULL(ВТ_ДанныеАтрибутовСохраненные.МножественноеЗначение, НЕОПРЕДЕЛЕНО)
		|			ИЛИ НЕ ВТ_ДанныеНаследованныхАтрибутов.СписокДоступныхЗначений = ЕСТЬNULL(ВТ_ДанныеАтрибутовСохраненные.СписокДоступныхЗначений, НЕОПРЕДЕЛЕНО)
		|			ИЛИ НЕ ВТ_ДанныеНаследованныхАтрибутов.ИсточникЗначений = ЕСТЬNULL(ВТ_ДанныеАтрибутовСохраненные.ИсточникЗначений, НЕОПРЕДЕЛЕНО)
		|			ИЛИ НЕ ВТ_ДанныеНаследованныхАтрибутов.МинЗначение = ЕСТЬNULL(ВТ_ДанныеАтрибутовСохраненные.МинЗначение, НЕОПРЕДЕЛЕНО)
		|			ИЛИ НЕ ВТ_ДанныеНаследованныхАтрибутов.МаксЗначение = ЕСТЬNULL(ВТ_ДанныеАтрибутовСохраненные.МаксЗначение, НЕОПРЕДЕЛЕНО)
		|			ИЛИ НЕ ВТ_ДанныеНаследованныхАтрибутов.ДобавлениеСтрокТабЧастиВНоменклатуреКласса = ЕСТЬNULL(ВТ_ДанныеАтрибутовСохраненные.ДобавлениеСтрокТабЧастиВНоменклатуреКласса, НЕОПРЕДЕЛЕНО)
		|			ИЛИ НЕ ВТ_ДанныеНаследованныхАтрибутов.ДобавлениеСтрокТабЧастиВОбъектахНоменклатуры = ЕСТЬNULL(ВТ_ДанныеАтрибутовСохраненные.ДобавлениеСтрокТабЧастиВОбъектахНоменклатуры, НЕОПРЕДЕЛЕНО)
		|			ИЛИ НЕ ВТ_ДанныеНаследованныхАтрибутов.Формат = ЕСТЬNULL(ВТ_ДанныеАтрибутовСохраненные.Формат, НЕОПРЕДЕЛЕНО)
		|			ИЛИ НЕ ВТ_ДанныеНаследованныхАтрибутов.Порядок = ЕСТЬNULL(ВТ_ДанныеАтрибутовСохраненные.Порядок, НЕОПРЕДЕЛЕНО))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ДанныеДобавленныхАтрибутов.АтрибутКласса КАК АтрибутКласса,
		|	1 КАК ВидДействия
		|ПОМЕСТИТЬ ВТ_ИзмененияНазначенияАтрибутов
		|ИЗ
		|	ВТ_ДанныеДобавленныхАтрибутов
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ДанныеНаследованныхАтрибутов.АтрибутКласса,
		|	1
		|ИЗ
		|	ВТ_ДанныеНаследованныхАтрибутов
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ДанныеАтрибутовСохраненные.АтрибутКласса,
		|	-1
		|ИЗ
		|	ВТ_ДанныеАтрибутовСохраненные КАК ВТ_ДанныеАтрибутовСохраненные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АтрибутыКласса.Ссылка КАК АтрибутКласса,
		|	1 КАК ВидДействия
		|ПОМЕСТИТЬ ВТ_ИзмененияНенаследуемыеАтрибуты
		|ИЗ
		|	ПланВидовХарактеристик.АтрибутыКласса КАК АтрибутыКласса
		|ГДЕ
		|	АтрибутыКласса.Ссылка В(&ЗапрещеныАтрибуты)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НенаследуемыеЗначения.АтрибутКласса,
		|	-1
		|ИЗ
		|	РегистрСведений.НенаследуемыеЗначения КАК НенаследуемыеЗначения
		|ГДЕ
		|	НенаследуемыеЗначения.Класс = &Класс
		|	И НенаследуемыеЗначения.НеНаследуемыйАтрибут
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗначенияАтрибутов.АтрибутКласса КАК АтрибутКласса,
		|	ЗначенияАтрибутов.ЗначениеАтрибутаКласса КАК ЗначениеАтрибутаКласса
		|ПОМЕСТИТЬ ВТ_ЗначенияАтрибутовКласса
		|ИЗ
		|	&ЗначенияАтрибутов КАК ЗначенияАтрибутов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗначенияАтрибутовКласса.АтрибутКласса КАК АтрибутКласса,
		|	ВТ_ЗначенияАтрибутовКласса.ЗначениеАтрибутаКласса КАК ЗначениеАтрибутаКласса,
		|	1 КАК ВидДействия
		|ПОМЕСТИТЬ ВТ_ИзмененияЗначенияАтрибутовКлассов
		|ИЗ
		|	ВТ_ЗначенияАтрибутовКласса КАК ВТ_ЗначенияАтрибутовКласса
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗначенияАтрибутовКласса.АтрибутКласса,
		|	ЗначенияАтрибутовКласса.ЗначениеАтрибутаКласса,
		|	-1
		|ИЗ
		|	РегистрСведений.ЗначенияАтрибутовКласса КАК ЗначенияАтрибутовКласса
		|ГДЕ
		|	ЗначенияАтрибутовКласса.Класс = &Класс
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ИзмененияЗначенияАтрибутовКлассов.АтрибутКласса КАК АтрибутКласса,
		|	ВЫБОР
		|		КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ИзмененияЗначенияАтрибутовКлассов.ЗначениеАтрибутаКласса) > 1
		|			ТОГДА 1
		|		ИНАЧЕ СУММА(ВТ_ИзмененияЗначенияАтрибутовКлассов.ВидДействия)
		|	КОНЕЦ КАК ВидДействия
		|ПОМЕСТИТЬ ВТ_ВидыДействийЗначенияАтрибутовКлассов
		|ИЗ
		|	ВТ_ИзмененияЗначенияАтрибутовКлассов КАК ВТ_ИзмененияЗначенияАтрибутовКлассов
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ИзмененияЗначенияАтрибутовКлассов.АтрибутКласса
		|
		|ИМЕЮЩИЕ
		|	(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ИзмененияЗначенияАтрибутовКлассов.ЗначениеАтрибутаКласса) > 1
		|		ИЛИ СУММА(ВТ_ИзмененияЗначенияАтрибутовКлассов.ВидДействия) <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Классы.Ссылка КАК Ссылка,
		|	Классы.Родитель
		|ПОМЕСТИТЬ ВТ_ВложенныеКлассы
		|ИЗ
		|	Справочник.Классы КАК Классы
		|ГДЕ
		|	НЕ &Класс = ЗНАЧЕНИЕ(Справочник.Классы.ПустаяСсылка)
		|	И Классы.Ссылка В ИЕРАРХИИ(&Класс)
		|	И НЕ Классы.Ссылка = &Класс
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НазначениеАтрибутов.Класс,
		|	НазначениеАтрибутов.АтрибутКласса,
		|	НазначениеАтрибутов.РежимЗаполнения,
		|	НазначениеАтрибутов.РежимИспользования,
		|	НазначениеАтрибутов.МинЗначение,
		|	НазначениеАтрибутов.МаксЗначение,
		|	НазначениеАтрибутов.Формат,
		|	НазначениеАтрибутов.МножественноеЗначение,
		|	НазначениеАтрибутов.СписокДоступныхЗначений,
		|	НазначениеАтрибутов.ИсточникЗначений,
		|	НазначениеАтрибутов.Порядок,
		|	НазначениеАтрибутов.Предопределенный,
		|	НазначениеАтрибутов.ШаблонЗаполнения,
		|	НазначениеАтрибутов.ДобавлениеСтрокТабЧастиВНоменклатуреКласса,
		|	НазначениеАтрибутов.ДобавлениеСтрокТабЧастиВОбъектахНоменклатуры
		|ПОМЕСТИТЬ ВТ_АтрибутыВложенныхКлассов
		|ИЗ
		|	ВТ_ВложенныеКлассы КАК ВТ_ВложенныеКлассы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НазначениеАтрибутов КАК НазначениеАтрибутов
		|		ПО ВТ_ВложенныеКлассы.Ссылка = НазначениеАтрибутов.Класс
		|ГДЕ
		|	НазначениеАтрибутов.АтрибутКласса В
		|			(ВЫБРАТЬ
		|				ВТ_ДанныеИзмененныхАтрибутов.АтрибутКласса
		|			ИЗ
		|				ВТ_ДанныеИзмененныхАтрибутов КАК ВТ_ДанныеИзмененныхАтрибутов
		|			ГДЕ
		|				ВТ_ДанныеИзмененныхАтрибутов.РежимЗаполненияИзменен)";
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаИзмененияАтрибутовТаблицыИзменения()
	
	// 0 - Удаление строк из назначения атрибутов атрибутов.
	// 1 - Ненаследуемые значения.
	// 2 - Значения атрибутов класса.
	// 3 - Измененные свойства атрибутов.
	// 4 - Вложенные классы.
	// 5 - Атрибуты вложенных классов.
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВТ_ИзмененияНазначенияАтрибутов.АтрибутКласса КАК АтрибутКласса,
		|	СУММА(ВТ_ИзмененияНазначенияАтрибутов.ВидДействия) КАК ВидДействия
		|ИЗ
		|	ВТ_ИзмененияНазначенияАтрибутов КАК ВТ_ИзмененияНазначенияАтрибутов
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ИзмененияНазначенияАтрибутов.АтрибутКласса
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВТ_ИзмененияНазначенияАтрибутов.ВидДействия) < 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ИзмененияНенаследуемыеАтрибуты.АтрибутКласса КАК АтрибутКласса,
		|	СУММА(ВТ_ИзмененияНенаследуемыеАтрибуты.ВидДействия) КАК ВидДействия
		|ИЗ
		|	ВТ_ИзмененияНенаследуемыеАтрибуты КАК ВТ_ИзмененияНенаследуемыеАтрибуты
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ИзмененияНенаследуемыеАтрибуты.АтрибутКласса
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВТ_ИзмененияНенаследуемыеАтрибуты.ВидДействия) <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВидыДействийЗначенияАтрибутовКлассов.АтрибутКласса КАК АтрибутКласса,
		|	ВТ_ВидыДействийЗначенияАтрибутовКлассов.ВидДействия КАК ВидДействия,
		|	ВТ_ЗначенияАтрибутовКласса.ЗначениеАтрибутаКласса КАК ЗначениеАтрибутаКласса
		|ИЗ
		|	ВТ_ВидыДействийЗначенияАтрибутовКлассов КАК ВТ_ВидыДействийЗначенияАтрибутовКлассов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗначенияАтрибутовКласса КАК ВТ_ЗначенияАтрибутовКласса
		|		ПО ВТ_ВидыДействийЗначенияАтрибутовКлассов.АтрибутКласса = ВТ_ЗначенияАтрибутовКласса.АтрибутКласса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеИзмененныхАтрибутов.АтрибутКласса,
		|	ВТ_ДанныеИзмененныхАтрибутов.Порядок,
		|	ВТ_ДанныеИзмененныхАтрибутов.РежимИспользования,
		|	ВТ_ДанныеИзмененныхАтрибутов.РежимЗаполнения,
		|	ВТ_ДанныеИзмененныхАтрибутов.МножественноеЗначение,
		|	ВТ_ДанныеИзмененныхАтрибутов.СписокДоступныхЗначений,
		|	ВТ_ДанныеИзмененныхАтрибутов.ИсточникЗначений,
		|	ВТ_ДанныеИзмененныхАтрибутов.МинЗначение,
		|	ВТ_ДанныеИзмененныхАтрибутов.МаксЗначение,
		|	ВТ_ДанныеИзмененныхАтрибутов.ДобавлениеСтрокТабЧастиВНоменклатуреКласса,
		|	ВТ_ДанныеИзмененныхАтрибутов.ДобавлениеСтрокТабЧастиВОбъектахНоменклатуры,
		|	ВТ_ДанныеИзмененныхАтрибутов.РежимЗаполненияИзменен,
		|	ВТ_ДанныеИзмененныхАтрибутов.Формат
		|ИЗ
		|	ВТ_ДанныеИзмененныхАтрибутов КАК ВТ_ДанныеИзмененныхАтрибутов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВложенныеКлассы.Ссылка КАК Ссылка,
		|	ИСТИНА КАК ЭтоЛист
		|ИЗ
		|	ВТ_ВложенныеКлассы КАК ВТ_ВложенныеКлассы
		|ГДЕ
		|	НЕ ВТ_ВложенныеКлассы.Ссылка В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					ВТ_ВложенныеКлассы.Родитель
		|				ИЗ
		|					ВТ_ВложенныеКлассы КАК ВТ_Классы)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка
		|ИТОГИ
		|	ВЫБОР
		|		КОГДА Ссылка = МАКСИМУМ(Ссылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоЛист
		|ПО
		|	Ссылка ИЕРАРХИЯ
		|АВТОУПОРЯДОЧИВАНИЕ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_АтрибутыВложенныхКлассов.Класс КАК Класс,
		|	ВТ_АтрибутыВложенныхКлассов.АтрибутКласса КАК АтрибутКласса,
		|	ВТ_АтрибутыВложенныхКлассов.РежимЗаполнения,
		|	ВТ_АтрибутыВложенныхКлассов.РежимИспользования,
		|	ВТ_АтрибутыВложенныхКлассов.МинЗначение,
		|	ВТ_АтрибутыВложенныхКлассов.МаксЗначение,
		|	ВТ_АтрибутыВложенныхКлассов.Формат,
		|	ВТ_АтрибутыВложенныхКлассов.МножественноеЗначение,
		|	ВТ_АтрибутыВложенныхКлассов.СписокДоступныхЗначений,
		|	ВТ_АтрибутыВложенныхКлассов.ИсточникЗначений,
		|	ВТ_АтрибутыВложенныхКлассов.Порядок,
		|	ВТ_АтрибутыВложенныхКлассов.Предопределенный,
		|	ВТ_АтрибутыВложенныхКлассов.ШаблонЗаполнения,
		|	ВТ_АтрибутыВложенныхКлассов.ДобавлениеСтрокТабЧастиВНоменклатуреКласса,
		|	ВТ_АтрибутыВложенныхКлассов.ДобавлениеСтрокТабЧастиВОбъектахНоменклатуры
		|ИЗ
		|	ВТ_АтрибутыВложенныхКлассов КАК ВТ_АтрибутыВложенныхКлассов
		|
		|УПОРЯДОЧИТЬ ПО
		|	Класс,
		|	АтрибутКласса";
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере 
Процедура ЗаписатьАтрибуты()
	
	// Атрибуты текущего уровня (для записи в РС Назначение атрибутов).
	СтруктураОтбораПоСтатусу = Новый Структура("СтатусНаследования", 1);
	СтрокиДобавленоАтрибут   = Объект.Атрибуты.Выгрузить(СтруктураОтбораПоСтатусу);
	
	СтруктураОтбораПоСтатусу.СтатусНаследования = 2;
	СтрокиДобавленоВложенные = Объект.Атрибуты.НайтиСтроки(СтруктураОтбораПоСтатусу);
	Для Каждого СтрокаВложенный ИЗ СтрокиДобавленоВложенные Цикл
		СтрокаДобавлено = СтрокиДобавленоАтрибут.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДобавлено, СтрокаВложенный);
	КонецЦикла;
	
	// Наследуемые атрибуты.
	СтруктураОтбораПоСтатусу.СтатусНаследования = 3;
	СтрокиНаследованыеАтрибуты = Объект.Атрибуты.Выгрузить(СтруктураОтбораПоСтатусу);
	
	// Ненаследуемые атрибуты.
	СтруктураОтбораПоСтатусу.СтатусНаследования = 4;
	СтрокиЗапрещено = Объект.Атрибуты.Выгрузить(СтруктураОтбораПоСтатусу);
	
	ТипСтрока = Тип("Строка");
	
	// Значения атрибутов.
	СтрокиЗначенияАтрибутов = Объект.Атрибуты.Выгрузить(Новый Структура("УровеньЗначения", 1));
	КолВо = СтрокиЗначенияАтрибутов.Количество();
	Для Н = 1 По КолВо Цикл
		СтрокаТЗ = СтрокиЗначенияАтрибутов[КолВо - Н];
		Если СтрокаТЗ.МножественноеЗначение 
				И НЕ СтрокаТЗ.ТипЗначения.СодержитТип(ТипСтрока) Тогда
			СтрокиЗначенияАтрибутов.Удалить(СтрокаТЗ);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДобавленоАтрибуты",            СтрокиДобавленоАтрибут.ВыгрузитьКолонку("АтрибутКласса"));
	Запрос.УстановитьПараметр("ДанныеДобавленныхАтрибутов",   СтрокиДобавленоАтрибут);
	Запрос.УстановитьПараметр("ДанныеНаследованныхАтрибутов", СтрокиНаследованыеАтрибуты);
	Запрос.УстановитьПараметр("ЗапрещеныАтрибуты",            СтрокиЗапрещено.ВыгрузитьКолонку("АтрибутКласса"));
	Запрос.УстановитьПараметр("ЗначенияАтрибутов",            СтрокиЗначенияАтрибутов);
	Запрос.УстановитьПараметр("Класс",                        Объект.Класс.Ссылка);
	Запрос.Текст = ТекстЗапросаИзмененияАтрибутовВременныеТаблицы();
	Запрос.Выполнить();
	
	Запрос.Текст = ТекстЗапросаИзмененияАтрибутовТаблицыИзменения();
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	// Удаление строк из назначения атрибутов атрибутов.
	ВыборкаИзменений = РезультатыЗапроса[0].Выбрать();
	Пока ВыборкаИзменений.Следующий() Цикл
		Запись = РегистрыСведений.НазначениеАтрибутов.СоздатьМенеджерЗаписи();
		Запись.Класс = Объект.Класс.Ссылка;
		Запись.АтрибутКласса = ВыборкаИзменений.АтрибутКласса;
		Запись.Удалить();
	КонецЦикла;
	
	// Ненаследуемые значения.
	ВыборкаИзменений = РезультатыЗапроса[1].Выбрать();
	Пока ВыборкаИзменений.Следующий() Цикл
		Запись = РегистрыСведений.НенаследуемыеЗначения.СоздатьМенеджерЗаписи();
		Запись.Класс = Объект.Класс.Ссылка;
		Запись.АтрибутКласса = ВыборкаИзменений.АтрибутКласса;
		Если ВыборкаИзменений.ВидДействия > 0 Тогда
			Запись.НеНаследуемыйАтрибут = Истина;
			Запись.Записать();
		Иначе
			Запись.Удалить();
		КонецЕсли;
	КонецЦикла;
	
	// Значения атрибутов класса.
	ВыборкаИзменений = РезультатыЗапроса[2].Выбрать();
	Пока ВыборкаИзменений.Следующий() Цикл
		Запись = РегистрыСведений.ЗначенияАтрибутовКласса.СоздатьМенеджерЗаписи();
		Запись.Класс = Объект.Класс.Ссылка;
		Запись.АтрибутКласса = ВыборкаИзменений.АтрибутКласса;
		Если ВыборкаИзменений.ВидДействия > 0 Тогда
			Запись.ЗначениеАтрибутаКласса = ВыборкаИзменений.ЗначениеАтрибутаКласса;
			Запись.Записать();
		Иначе
			Запись.Удалить();
		КонецЕсли;
	КонецЦикла;
	
	РежимыЗаполненияАтрибутов = Новый Соответствие;
	
	// Измененные свойства атрибутов.
	ВыборкаИзменений = РезультатыЗапроса[3].Выбрать();
	Пока ВыборкаИзменений.Следующий() Цикл
		Запись = РегистрыСведений.НазначениеАтрибутов.СоздатьМенеджерЗаписи();
		Запись.Класс = Объект.Класс.Ссылка;
		ЗаполнитьЗначенияСвойств(Запись, ВыборкаИзменений);
		Запись.Записать();
		
		Если ВыборкаИзменений.РежимЗаполненияИзменен Тогда
			РежимыЗаполненияАтрибутов.Вставить(ВыборкаИзменений.АтрибутКласса, ВыборкаИзменений.РежимЗаполнения);
		КонецЕсли;
	КонецЦикла;
	
	Если РежимыЗаполненияАтрибутов.Количество() > 0 Тогда
		ВыборкаПоВложеннымКлассам = РезультатыЗапроса[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ТаблицаАтрибутовВложенныхКлассов = РезультатыЗапроса[5].Выгрузить();
		ОбработатьРежимЗаполненияВложенныхКлассов(ВыборкаПоВложеннымКлассам, 
			ТаблицаАтрибутовВложенныхКлассов, РежимыЗаполненияАтрибутов);
	КонецЕсли;
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбработатьРежимЗаполненияВложенныхКлассов(ВыборкаПоВложеннымКлассам, 
		ТаблицаАтрибутовВложенныхКлассов, РежимыЗаполненияАтрибутов)
	
	РежимыЗаполнения = Перечисления.РежимыЗаполненияАтрибутов;
	ИндексыРежимовЗаполнения = Новый Соответствие;
	ИндексыРежимовЗаполнения.Вставить(РежимыЗаполнения.Необязательный,              0);
	ИндексыРежимовЗаполнения.Вставить(РежимыЗаполнения.ОбязательныйДляОбъекта,      1);
	ИндексыРежимовЗаполнения.Вставить(РежимыЗаполнения.ОбязательныйДляНоменклатуры, 2);
	ИндексыРежимовЗаполнения.Вставить(РежимыЗаполнения.ОбязательныйДляКласса,       3);
	
	СтруктураПоиска = Новый Структура("Класс");
	Пока ВыборкаПоВложеннымКлассам.Следующий() Цикл
		
		Если НЕ ВыборкаПоВложеннымКлассам.ЭтоЛист Тогда
			РежимыЗаполненияВложенных = Новый Соответствие;
			Для Каждого КлючИЗначение ИЗ РежимыЗаполненияАтрибутов Цикл
				РежимыЗаполненияВложенных.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
			КонецЦикла;
		КонецЕсли;
		
		СтруктураПоиска.Класс = ВыборкаПоВложеннымКлассам.Ссылка;
		НайденоВложенныеАтрибуты = ТаблицаАтрибутовВложенныхКлассов.НайтиСтроки(СтруктураПоиска);
		Если НайденоВложенныеАтрибуты.Количество() > 0 Тогда
			Для Каждого СтрокаАтрибута ИЗ НайденоВложенныеАтрибуты Цикл
				
				РежимЗаполнения = СтрокаАтрибута.РежимЗаполнения;
				РежимРодителя = РежимыЗаполненияАтрибутов[СтрокаАтрибута.АтрибутКласса];
				
				Если РежимЗаполнения = РежимРодителя Тогда
					Продолжить;
				КонецЕсли;
				
				Запись = РегистрыСведений.НазначениеАтрибутов.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(Запись, СтрокаАтрибута);
				Запись.РежимЗаполнения = РежимРодителя;
				Запись.Записать();
				
				Если НЕ ВыборкаПоВложеннымКлассам.ЭтоЛист Тогда
					РежимыЗаполненияВложенных.Вставить(СтрокаАтрибута.АтрибутКласса, РежимРодителя);
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		Если НЕ ВыборкаПоВложеннымКлассам.ЭтоЛист Тогда
			ВыборкаРекурсивно = ВыборкаПоВложеннымКлассам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			ОбработатьРежимЗаполненияВложенныхКлассов(ВыборкаРекурсивно, 
				ТаблицаАтрибутовВложенныхКлассов, РежимыЗаполненияВложенных);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Списочные атрибуты.

&НаСервере
Функция ТекстЗапросаИзмененияСписочныхАтрибутовВременныеТаблицы()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ДобавленныеЗначения.АтрибутКласса КАК АтрибутКласса,
		|	ДобавленныеЗначения.ЗначениеАтрибутаКласса КАК ЗначениеАтрибутаКласса,
		|	ДобавленныеЗначения.ДоступноеЗначение КАК ДоступноеЗначение,
		|	ДобавленныеЗначения.ИспользуемоеЗначение КАК ИспользуемоеЗначение
		|ПОМЕСТИТЬ ВТ_ДобавленныеЗначения
		|ИЗ
		|	&ДобавленныеЗначения КАК ДобавленныеЗначения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДобавленныеЗначения.АтрибутКласса КАК АтрибутКласса,
		|	ВТ_ДобавленныеЗначения.ЗначениеАтрибутаКласса КАК ЗначениеАтрибутаКласса,
		|	1 КАК ВидДействия
		|ПОМЕСТИТЬ ВТ_ИзмененияМножественныеЗначенияАтрибутов
		|ИЗ
		|	ВТ_ДобавленныеЗначения КАК ВТ_ДобавленныеЗначения
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МножественныеЗначенияАтрибутов.АтрибутКласса,
		|	МножественныеЗначенияАтрибутов.ЗначениеАтрибутаКласса,
		|	-1
		|ИЗ
		|	РегистрСведений.МножественныеЗначенияАтрибутов КАК МножественныеЗначенияАтрибутов
		|ГДЕ
		|	МножественныеЗначенияАтрибутов.Класс = &Класс
		|	И НЕ МножественныеЗначенияАтрибутов.ТабличныйАтрибут
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ИзмененияМножественныеЗначенияАтрибутов.АтрибутКласса КАК АтрибутКласса,
		|	ВТ_ИзмененияМножественныеЗначенияАтрибутов.ЗначениеАтрибутаКласса КАК ЗначениеАтрибутаКласса,
		|	СУММА(ВТ_ИзмененияМножественныеЗначенияАтрибутов.ВидДействия) КАК ВидДействия
		|ПОМЕСТИТЬ ВТ_ИзмененияМножественныеЗначенияАтрибутовСвернуто
		|ИЗ
		|	ВТ_ИзмененияМножественныеЗначенияАтрибутов КАК ВТ_ИзмененияМножественныеЗначенияАтрибутов
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ИзмененияМножественныеЗначенияАтрибутов.АтрибутКласса,
		|	ВТ_ИзмененияМножественныеЗначенияАтрибутов.ЗначениеАтрибутаКласса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НенаследуемыеЗначения.АтрибутКласса КАК АтрибутКласса,
		|	НенаследуемыеЗначения.ЗначениеАтрибутаКласса КАК ЗначениеАтрибутаКласса
		|ПОМЕСТИТЬ ВТ_НенаследуемыеЗначения
		|ИЗ
		|	&НенаследуемыеЗначения КАК НенаследуемыеЗначения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НенаследуемыеЗначения.АтрибутКласса КАК АтрибутКласса,
		|	ВТ_НенаследуемыеЗначения.ЗначениеАтрибутаКласса КАК ЗначениеАтрибутаКласса,
		|	1 КАК ВидДействия
		|ПОМЕСТИТЬ ВТ_ИзмененияНенаследуемыеЗначения
		|ИЗ
		|	ВТ_НенаследуемыеЗначения КАК ВТ_НенаследуемыеЗначения
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НенаследуемыеЗначения.АтрибутКласса,
		|	НенаследуемыеЗначения.ЗначениеАтрибутаКласса,
		|	-1
		|ИЗ
		|	РегистрСведений.НенаследуемыеЗначения КАК НенаследуемыеЗначения
		|ГДЕ
		|	НенаследуемыеЗначения.Класс = &Класс
		|	И НенаследуемыеЗначения.АтрибутКласса В  (&СписочныеАтрибутыКласса)
		|	И НЕ НенаследуемыеЗначения.НеНаследуемыйАтрибут";
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Функция ТекстЗапросаИзмененияСписочныхАтрибутовТаблицыИзменения()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВТ_ИзмененияМножественныеЗначенияАтрибутовСвернуто.АтрибутКласса,
		|	ВТ_ИзмененияМножественныеЗначенияАтрибутовСвернуто.ЗначениеАтрибутаКласса,
		|	ВТ_ИзмененияМножественныеЗначенияАтрибутовСвернуто.ВидДействия,
		|	ВТ_ДобавленныеЗначения.ДоступноеЗначение,
		|	ВТ_ДобавленныеЗначения.ИспользуемоеЗначение
		|ИЗ
		|	ВТ_ИзмененияМножественныеЗначенияАтрибутовСвернуто КАК ВТ_ИзмененияМножественныеЗначенияАтрибутовСвернуто
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДобавленныеЗначения КАК ВТ_ДобавленныеЗначения
		|		ПО ВТ_ИзмененияМножественныеЗначенияАтрибутовСвернуто.АтрибутКласса = ВТ_ДобавленныеЗначения.АтрибутКласса
		|			И ВТ_ИзмененияМножественныеЗначенияАтрибутовСвернуто.ЗначениеАтрибутаКласса = ВТ_ДобавленныеЗначения.ЗначениеАтрибутаКласса
		|			И (ВТ_ИзмененияМножественныеЗначенияАтрибутовСвернуто.ВидДействия >= 0)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МножественныеЗначенияАтрибутов КАК МножественныеЗначенияАтрибутов
		|		ПО ВТ_ИзмененияМножественныеЗначенияАтрибутовСвернуто.АтрибутКласса = МножественныеЗначенияАтрибутов.АтрибутКласса
		|			И ВТ_ИзмененияМножественныеЗначенияАтрибутовСвернуто.ЗначениеАтрибутаКласса = МножественныеЗначенияАтрибутов.ЗначениеАтрибутаКласса
		|			И (ВТ_ИзмененияМножественныеЗначенияАтрибутовСвернуто.ВидДействия = 0)
		|			И (МножественныеЗначенияАтрибутов.Класс = &Класс)
		|ГДЕ
		|	(ВТ_ИзмененияМножественныеЗначенияАтрибутовСвернуто.ВидДействия <> 0
		|			ИЛИ ВТ_ДобавленныеЗначения.ДоступноеЗначение <> ЕСТЬNULL(МножественныеЗначенияАтрибутов.ДоступноеЗначение, ЛОЖЬ)
		|			ИЛИ ВТ_ДобавленныеЗначения.ИспользуемоеЗначение <> ЕСТЬNULL(МножественныеЗначенияАтрибутов.ИспользуемоеЗначение, ЛОЖЬ))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ИзмененияНенаследуемыеЗначения.АтрибутКласса КАК АтрибутКласса,
		|	ВТ_ИзмененияНенаследуемыеЗначения.ЗначениеАтрибутаКласса КАК ЗначениеАтрибутаКласса,
		|	СУММА(ВТ_ИзмененияНенаследуемыеЗначения.ВидДействия) КАК ВидДействия
		|ИЗ
		|	ВТ_ИзмененияНенаследуемыеЗначения КАК ВТ_ИзмененияНенаследуемыеЗначения
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ИзмененияНенаследуемыеЗначения.АтрибутКласса,
		|	ВТ_ИзмененияНенаследуемыеЗначения.ЗначениеАтрибутаКласса
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВТ_ИзмененияНенаследуемыеЗначения.ВидДействия) <> 0";
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Процедура ЗаписатьЗначенияСписочныхАтрибутов()
	
	СтрокиДобавленныеЗначения   = Объект.ЗначенияСписочныхАтрибутов.Выгрузить(Новый Структура("СтатусНаследования", 2));
	СтрокиНенаследуемыеЗначения = Объект.ЗначенияСписочныхАтрибутов.Выгрузить(Новый Структура("СтатусНаследования", 4));
	
	ТаблицаАтрибуты = Объект.ЗначенияСписочныхАтрибутов.Выгрузить(, "АтрибутКласса");
	ТаблицаАтрибуты.Свернуть("АтрибутКласса");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Класс", Объект.Класс.Ссылка);
	Запрос.УстановитьПараметр("ДобавленныеЗначения", СтрокиДобавленныеЗначения);
	Запрос.УстановитьПараметр("НенаследуемыеЗначения", СтрокиНенаследуемыеЗначения);
	Запрос.УстановитьПараметр("СписочныеАтрибутыКласса", ТаблицаАтрибуты.ВыгрузитьКолонку("АтрибутКласса"));

	Запрос.Текст = ТекстЗапросаИзмененияСписочныхАтрибутовВременныеТаблицы();
	Запрос.Выполнить();
	
	Запрос.Текст = ТекстЗапросаИзмененияСписочныхАтрибутовТаблицыИзменения();
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	// Использование в составе объектов.
	ВыборкаИзменений = РезультатыЗапроса[0].Выбрать();
	Пока ВыборкаИзменений.Следующий() Цикл
		Запись = РегистрыСведений.МножественныеЗначенияАтрибутов.СоздатьМенеджерЗаписи();
		Запись.Класс = Объект.Класс.Ссылка;
		ЗаполнитьЗначенияСвойств(Запись, ВыборкаИзменений);
		Если ВыборкаИзменений.ВидДействия >= 0 Тогда
			Запись.Записать();
		Иначе
			Запись.Удалить();
		КонецЕсли;
	КонецЦикла;
	
	// Ненаследуемые значения.
	ВыборкаИзменений = РезультатыЗапроса[1].Выбрать();
	Пока ВыборкаИзменений.Следующий() Цикл
		Запись = РегистрыСведений.НенаследуемыеЗначения.СоздатьМенеджерЗаписи();
		Запись.Класс                  = Объект.Класс.Ссылка;
		Запись.АтрибутКласса          = ВыборкаИзменений.АтрибутКласса;
		Запись.ЗначениеАтрибутаКласса = ВыборкаИзменений.ЗначениеАтрибутаКласса;
		Если ВыборкаИзменений.ВидДействия > 0 Тогда
			Запись.Записать();
		Иначе
			Запись.Удалить();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Табличные атрибуты.

&НаСервере
Функция ТекстЗапросаИерархияКлассовСтрокТабличныхАтрибутов()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СтрокиТабличныхАтрибутов.ИДСтрокиРодителя,
		|	СтрокиТабличныхАтрибутов.АтрибутКласса,
		|	СтрокиТабличныхАтрибутов.ИДСтроки,
		|	СтрокиТабличныхАтрибутов.Порядок,
		|	СтрокиТабличныхАтрибутов.СтатусНаследования,
		|	СтрокиТабличныхАтрибутов.ИсточникЗначений,
		|	СтрокиТабличныхАтрибутов.ЗначениеАтрибутаКласса,
		|	СтрокиТабличныхАтрибутов.Наименование
		|ПОМЕСТИТЬ ВТ_СтрокиТабличныхАтрибутовНовые
		|ИЗ
		|	&СтрокиТабличныхАтрибутов КАК СтрокиТабличныхАтрибутов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗначенияТабличныхАтрибутов.ИДСтрокиРодителя,
		|	ЗначенияТабличныхАтрибутов.АтрибутКласса,
		|	ЗначенияТабличныхАтрибутов.АтрибутТаблицы,
		|	ЗначенияТабличныхАтрибутов.ЗначениеАтрибутаТаблицы,
		|	ЗначенияТабличныхАтрибутов.ИДСтроки
		|ПОМЕСТИТЬ ВТ_ЗначенияТабличныхАтрибутов
		|ИЗ
		|	&ЗначенияТабличныхАтрибутов КАК ЗначенияТабличныхАтрибутов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Классы.Ссылка КАК КлассДляЧтения,
		|	Классы.Ссылка КАК Класс
		|ИЗ
		|	Справочник.Классы КАК Классы
		|ГДЕ
		|	НЕ Классы.ПометкаУдаления
		|	И Классы.Ссылка В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ВТ_СтрокиТабличныхАтрибутовНовые.ЗначениеАтрибутаКласса
		|			ИЗ
		|				ВТ_СтрокиТабличныхАтрибутовНовые КАК ВТ_СтрокиТабличныхАтрибутовНовые
		|		
		|			ОБЪЕДИНИТЬ ВСЕ
		|		
		|			ВЫБРАТЬ
		|				&Класс)
		|ИТОГИ
		|	МАКСИМУМ(КлассДляЧтения)
		|ПО
		|	Класс,
		|	Класс ТОЛЬКО ИЕРАРХИЯ";
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Функция ТекстЗапросаДанныеТабличныхАтрибутов()
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ТаблицаАтрибутов.АтрибутКласса КАК АтрибутКласса,
		|	ВТ_ТаблицаАтрибутов.Порядок КАК Порядок
		|ИЗ
		|	ВТ_ТаблицаАтрибутов КАК ВТ_ТаблицаАтрибутов
		|ГДЕ
		|	ВТ_ТаблицаАтрибутов.МножественноеЗначение
		|	И ВТ_ТаблицаАтрибутов.КлассТабличнаяЧасть
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,
		|	АтрибутКласса
		|АВТОУПОРЯДОЧИВАНИЕ";
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере 
Функция ТекстЗапросаЗначенияАтрибутовСтрокВременныеТаблицы()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВТ_СтрокиТабличныхАтрибутовНовые.ЗначениеАтрибутаКласса КАК КлассДляЧтения,
		|	ВТ_ЗначенияТабличныхАтрибутов.АтрибутТаблицы,
		|	ВТ_ЗначенияТабличныхАтрибутов.ЗначениеАтрибутаТаблицы
		|ПОМЕСТИТЬ ВТ_ЗначенияАтрибутовСтрокДляЗаписи
		|ИЗ
		|	ВТ_СтрокиТабличныхАтрибутовНовые КАК ВТ_СтрокиТабличныхАтрибутовНовые
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗначенияТабличныхАтрибутов КАК ВТ_ЗначенияТабличныхАтрибутов
		|		ПО ВТ_СтрокиТабличныхАтрибутовНовые.ИДСтрокиРодителя = ВТ_ЗначенияТабличныхАтрибутов.ИДСтрокиРодителя
		|			И ВТ_СтрокиТабличныхАтрибутовНовые.АтрибутКласса = ВТ_ЗначенияТабличныхАтрибутов.АтрибутКласса
		|			И ВТ_СтрокиТабличныхАтрибутовНовые.ИДСтроки = ВТ_ЗначенияТабличныхАтрибутов.ИДСтроки
		|ГДЕ
		|	ВТ_ЗначенияТабличныхАтрибутов.АтрибутТаблицы ССЫЛКА ПланВидовХарактеристик.АтрибутыКласса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СтрокиТабличныхАтрибутовНовые.ЗначениеАтрибутаКласса КАК Класс,
		|	ВТ_СтрокиТабличныхАтрибутовПодчиненныхНовые.АтрибутКласса,
		|	ВТ_СтрокиТабличныхАтрибутовПодчиненныхНовые.ЗначениеАтрибутаКласса КАК ЗначениеАтрибутаКласса,
		|	ВТ_СтрокиТабличныхАтрибутовПодчиненныхНовые.Порядок
		|ПОМЕСТИТЬ ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи
		|ИЗ
		|	ВТ_СтрокиТабличныхАтрибутовНовые КАК ВТ_СтрокиТабличныхАтрибутовНовые
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СтрокиТабличныхАтрибутовНовые КАК ВТ_СтрокиТабличныхАтрибутовПодчиненныхНовые
		|		ПО ВТ_СтрокиТабличныхАтрибутовНовые.ИДСтроки = ВТ_СтрокиТабличныхАтрибутовПодчиненныхНовые.ИДСтрокиРодителя
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Класс,
		|	ВТ_СтрокиТабличныхАтрибутовНовые.АтрибутКласса,
		|	ВТ_СтрокиТабличныхАтрибутовНовые.ЗначениеАтрибутаКласса,
		|	ВТ_СтрокиТабличныхАтрибутовНовые.Порядок
		|ИЗ
		|	ВТ_СтрокиТабличныхАтрибутовНовые КАК ВТ_СтрокиТабличныхАтрибутовНовые
		|ГДЕ
		|	ВТ_СтрокиТабличныхАтрибутовНовые.ИДСтрокиРодителя = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтрокиТабличныхАтрибутов.КлассДляЧтения,
		|	СтрокиТабличныхАтрибутов.АтрибутКласса,
		|	СтрокиТабличныхАтрибутов.ЗначениеАтрибутаКласса,
		|	СтрокиТабличныхАтрибутов.ИсточникЗначений,
		|	СтрокиТабличныхАтрибутов.СтатусНаследования,
		|	СтрокиТабличныхАтрибутов.Порядок,
		|	СтрокиТабличныхАтрибутов.Уровень,
		|	СтрокиТабличныхАтрибутов.УровеньТекКласса
		|ПОМЕСТИТЬ ВТ_СтрокиТабличныхАтрибутов
		|ИЗ
		|	&СтрокиТабличныхАтрибутов КАК СтрокиТабличныхАтрибутов";
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере 
Функция ТекстЗапросаЗначенияАтрибутовСтрок()
	
	// 0 - Значения атрибутов строк таб.частей.
	// 1 - Строки табличных атрибутов.
	// 2 - Ненаследуемые атрибуты.
	// 3 - Переименование строк.
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВТ_ЗначенияАтрибутовСтрокДляЗаписи.КлассДляЧтения,
		|	ВТ_ЗначенияАтрибутовСтрокДляЗаписи.АтрибутТаблицы КАК АтрибутКласса,
		|	ВТ_ЗначенияАтрибутовСтрокДляЗаписи.ЗначениеАтрибутаТаблицы КАК ЗначениеАтрибутаКласса
		|ИЗ
		|	ВТ_ЗначенияАтрибутовСтрокДляЗаписи КАК ВТ_ЗначенияАтрибутовСтрокДляЗаписи
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаАтрибутов КАК ВТ_ТаблицаАтрибутов
		|		ПО (ВТ_ТаблицаАтрибутов.КлассДляЧтения = ВТ_ЗначенияАтрибутовСтрокДляЗаписи.КлассДляЧтения)
		|			И (ВТ_ТаблицаАтрибутов.АтрибутКласса = ВТ_ЗначенияАтрибутовСтрокДляЗаписи.АтрибутТаблицы)
		|ГДЕ
		|	(ВТ_ТаблицаАтрибутов.ЗначениеАтрибутаКласса ЕСТЬ NULL
		|			ИЛИ НЕ ВТ_ЗначенияАтрибутовСтрокДляЗаписи.ЗначениеАтрибутаТаблицы = ВТ_ТаблицаАтрибутов.ЗначениеАтрибутаКласса)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи.Класс,
		|	ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи.АтрибутКласса,
		|	ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи.ЗначениеАтрибутаКласса,
		|	ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи.Порядок,
		|	1 КАК ВидДействия
		|ИЗ
		|	ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи КАК ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтрокиТабличныхАтрибутов КАК ВТ_СтрокиТабличныхАтрибутов
		|		ПО ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи.Класс = ВТ_СтрокиТабличныхАтрибутов.КлассДляЧтения
		|			И ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи.АтрибутКласса = ВТ_СтрокиТабличныхАтрибутов.АтрибутКласса
		|			И ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи.ЗначениеАтрибутаКласса = ВТ_СтрокиТабличныхАтрибутов.ЗначениеАтрибутаКласса
		|ГДЕ
		|	(ВТ_СтрокиТабличныхАтрибутов.Порядок ЕСТЬ NULL
		|			ИЛИ НЕ ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи.Порядок = ВТ_СтрокиТабличныхАтрибутов.Порядок)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_СтрокиТабличныхАтрибутов.КлассДляЧтения,
		|	ВТ_СтрокиТабличныхАтрибутов.АтрибутКласса,
		|	ВТ_СтрокиТабличныхАтрибутов.ЗначениеАтрибутаКласса,
		|	0,
		|	-1
		|ИЗ
		|	ВТ_СтрокиТабличныхАтрибутов КАК ВТ_СтрокиТабличныхАтрибутов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи КАК ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи
		|		ПО ВТ_СтрокиТабличныхАтрибутов.КлассДляЧтения = ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи.Класс
		|			И ВТ_СтрокиТабличныхАтрибутов.АтрибутКласса = ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи.АтрибутКласса
		|			И ВТ_СтрокиТабличныхАтрибутов.ЗначениеАтрибутаКласса = ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи.ЗначениеАтрибутаКласса
		|ГДЕ
		|	ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи.ЗначениеАтрибутаКласса ЕСТЬ NULL
		|	И ВТ_СтрокиТабличныхАтрибутов.Уровень = ВТ_СтрокиТабличныхАтрибутов.УровеньТекКласса
		|	И НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ВТ_СтрокиТабличныхАтрибутов.ЗначениеАтрибутаКласса КАК Справочник.Классы).ПометкаУдаления, ИСТИНА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СтрокиТабличныхАтрибутов.КлассДляЧтения,
		|	ВТ_СтрокиТабличныхАтрибутов.АтрибутКласса,
		|	ВЫБОР
		|		КОГДА НЕ ВТ_СтрокиТабличныхАтрибутов.ЗначениеАтрибутаКласса = ЗНАЧЕНИЕ(Справочник.Классы.ПустаяСсылка)
		|			ТОГДА ВТ_СтрокиТабличныхАтрибутов.ЗначениеАтрибутаКласса
		|		ИНАЧЕ ВТ_СтрокиТабличныхАтрибутов.ИсточникЗначений
		|	КОНЕЦ КАК ЗначениеАтрибутаКласса
		|ИЗ
		|	ВТ_СтрокиТабличныхАтрибутов КАК ВТ_СтрокиТабличныхАтрибутов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи КАК ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи
		|		ПО ВТ_СтрокиТабличныхАтрибутов.КлассДляЧтения = ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи.Класс
		|			И ВТ_СтрокиТабличныхАтрибутов.АтрибутКласса = ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи.АтрибутКласса
		|			И ВТ_СтрокиТабличныхАтрибутов.ЗначениеАтрибутаКласса = ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи.ЗначениеАтрибутаКласса
		|ГДЕ
		|	ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи.ЗначениеАтрибутаКласса ЕСТЬ NULL
		|	И ВТ_СтрокиТабличныхАтрибутов.Уровень < ВТ_СтрокиТабличныхАтрибутов.УровеньТекКласса
		|	И ВТ_СтрокиТабличныхАтрибутов.СтатусНаследования <= 3
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СтрокиТабличныхАтрибутовНовые.ЗначениеАтрибутаКласса КАК ЗначениеАтрибутаКласса,
		|	ВТ_СтрокиТабличныхАтрибутовНовые.Наименование,
		|	ВТ_СтрокиТабличныхАтрибутовНовые.ИсточникЗначений,
		|	ВТ_СтрокиТабличныхАтрибутовНовые.ИДСтрокиРодителя,
		|	ВТ_СтрокиТабличныхАтрибутовНовые.АтрибутКласса,
		|	ВТ_СтрокиТабличныхАтрибутовНовые.ИДСтроки
		|ИЗ
		|	ВТ_СтрокиТабличныхАтрибутовНовые КАК ВТ_СтрокиТабличныхАтрибутовНовые
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Классы КАК Классы
		|		ПО ВТ_СтрокиТабличныхАтрибутовНовые.ЗначениеАтрибутаКласса = Классы.Ссылка
		|ГДЕ
		|	(ВТ_СтрокиТабличныхАтрибутовНовые.Наименование <> Классы.Наименование
		|			ИЛИ ВТ_СтрокиТабличныхАтрибутовНовые.Наименование = """")
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗначениеАтрибутаКласса
		|АВТОУПОРЯДОЧИВАНИЕ";
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Функция СформироватьНаименованиеСтрокиТабличногоАтрибута(СтрокаТЧ, КодЭлемента)
	
	Если СтрокаТЧ.АтрибутКласса = ПланыВидовХарактеристик.АтрибутыКласса.ТехКарты Тогда
		Если ПустаяСтрока(СтрокаТЧ.Наименование) Тогда
			НайденоТипТехКарты = Объект.ЗначенияТабличныхАтрибутов.НайтиСтроки(Новый Структура(
				"ИДСтрокиРодителя, АтрибутКласса, ИДСтроки, АтрибутТаблицы",
				СтрокаТЧ.ИДСтрокиРодителя, СтрокаТЧ.АтрибутКласса, СтрокаТЧ.ИДСтроки,
				ПланыВидовХарактеристик.АтрибутыКласса.ТипТехКарты));
			Если НайденоТипТехКарты.Количество() > 0 И ЗначениеЗаполнено(НайденоТипТехКарты[0].ЗначениеАтрибутаТаблицы) Тогда
				Результат = Строка(НайденоТипТехКарты[0].ЗначениеАтрибутаТаблицы);
			Иначе
				Результат = Строка(СтрокаТЧ.ИсточникЗначений);
			КонецЕсли;
		Иначе
			Результат = СтрокаТЧ.Наименование;
		КонецЕсли;
	Иначе
		Результат = Строка(СтрокаТЧ.ИсточникЗначений) + "/" + ШаблоныСтрокКлиентСервер.УдалитьНезначащиеНули(КодЭлемента);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаписатьЗначенияТабличныхАтрибутов()
	
	// 1. Запись классов новых строк.
	Для Каждого СтрокаТЧ ИЗ Объект.СтрокиТабличныхАтрибутов Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ЗначениеАтрибутаКласса) Тогда
			НовыйКласс = Справочники.Классы.СоздатьЭлемент();
			НовыйКласс.Родитель            = СтрокаТЧ.ИсточникЗначений;
			НовыйКласс.КлассТабличнаяЧасть = Истина;
			НовыйКласс.НоменклатураКласса  = СтрокаТЧ.НоменклатураКласса;
			НовыйКласс.ОбъектыНоменклатуры = СтрокаТЧ.ОбъектыНоменклатуры;
			НовыйКласс.Статус = Перечисления.СтатусыОбъектовНСИ.Активный;
			НовыйКласс.УстановитьНовыйКод();
			НовыйКласс.Наименование = СформироватьНаименованиеСтрокиТабличногоАтрибута(СтрокаТЧ, НовыйКласс.Код);
			НовыйКласс.Записать();
			
			СтрокаТЧ.ЗначениеАтрибутаКласса = НовыйКласс.Ссылка;
			СтрокаТЧ.Наименование           = НовыйКласс.Наименование;
		КонецЕсли;
	КонецЦикла;
	
	// 2. Чтение атрибутов классов.
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.УстановитьПараметр("СтрокиТабличныхАтрибутов",   Объект.СтрокиТабличныхАтрибутов.Выгрузить());
	Запрос.УстановитьПараметр("ЗначенияТабличныхАтрибутов", Объект.ЗначенияТабличныхАтрибутов.Выгрузить());
	Запрос.УстановитьПараметр("Класс", Объект.Класс.Ссылка);
	Запрос.Текст = ТекстЗапросаИерархияКлассовСтрокТабличныхАтрибутов();
	
	// Таблица родителей для чтения атрибутов строк табличных частей.
	ТаблицаРодителей = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.Прямой);
	ТаблицаРодителей.Колонки.Добавить("Уровень", Новый ОписаниеТипов("Число"));
	
	ТекКлассДляЧтения = Неопределено;
	Для Каждого СтрокаТЗ ИЗ ТаблицаРодителей Цикл
		Если НЕ СтрокаТЗ.КлассДляЧтения = ТекКлассДляЧтения Тогда
			Н = 0;
			ТекКлассДляЧтения = СтрокаТЗ.КлассДляЧтения;
			ПредКласс = Неопределено;
		КонецЕсли;
		Если НЕ ПредКласс = СтрокаТЗ.Класс Тогда
			СтрокаТЗ.Уровень = Н;
			Н = Н + 1;
			ПредКласс = СтрокаТЗ.Класс;
		КонецЕсли;
	КонецЦикла;
	
	НайденоУдалить = ТаблицаРодителей.НайтиСтроки(Новый Структура("Уровень", 0));
	Для Каждого СтрокаТЗ ИЗ НайденоУдалить Цикл
		ТаблицаРодителей.Удалить(СтрокаТЗ);
	КонецЦикла;
	
	// Записанные значения атрибутов строк таб.частей.
	Справочники.Классы.ПолучитьТаблицуАтрибутов(ТаблицаРодителей, МенеджерВТ);
	
	// Таблица списочных атрибутов строк таб.частей (вложеные таб.части).
	Запрос.Текст = ТекстЗапросаДанныеТабличныхАтрибутов();
	ТаблицаАтрибутов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("АтрибутКласса");
	
	// Записанные строки таб.частей.
	СтрокиТабличныхАтрибутов = Справочники.Классы.ПолучитьСтрокиТабличныхАтрибутов(ТаблицаРодителей, ТаблицаАтрибутов);
	
	// Сравниваем записанные строки с данными формы.
	Запрос.УстановитьПараметр("СтрокиТабличныхАтрибутов", СтрокиТабличныхАтрибутов);
	Запрос.Текст = ТекстЗапросаЗначенияАтрибутовСтрокВременныеТаблицы();
	Запрос.Выполнить();
	
	Запрос.Текст = ТекстЗапросаЗначенияАтрибутовСтрок();
	Результаты = Запрос.ВыполнитьПакет();
	
	// 3. Запись изменений.
	
	// Значения атрибутов строк таб.частей.
	Выборка = Результаты[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.ЗначенияАтрибутовКласса.СоздатьМенеджерЗаписи();
		Запись.Класс                  = Выборка.КлассДляЧтения;
		Запись.АтрибутКласса          = Выборка.АтрибутКласса;
		Запись.ЗначениеАтрибутаКласса = Выборка.ЗначениеАтрибутаКласса;
		Запись.Записать();
	КонецЦикла;
	
	// Строки табличных атрибутов.
	Выборка = Результаты[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.МножественныеЗначенияАтрибутов.СоздатьМенеджерЗаписи();
		Запись.Класс                  = Выборка.Класс;
		Запись.АтрибутКласса          = Выборка.АтрибутКласса;
		Запись.ЗначениеАтрибутаКласса = Выборка.ЗначениеАтрибутаКласса;
		Если Выборка.ВидДействия > 0 Тогда
			Запись.Порядок = Выборка.Порядок;
			Запись.ИспользуемоеЗначение = Истина;
			Запись.ТабличныйАтрибут = Истина;
			Запись.Записать();
		Иначе
			Запись.Удалить();
		КонецЕсли;
	КонецЦикла;
	
	// Ненаследуемые атрибуты.
	Выборка = Результаты[2].Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.НенаследуемыеЗначения.СоздатьМенеджерЗаписи();
		Запись.Класс                  = Выборка.КлассДляЧтения;
		Запись.АтрибутКласса          = Выборка.АтрибутКласса;
		Запись.ЗначениеАтрибутаКласса = Выборка.ЗначениеАтрибутаКласса;
		Запись.Записать();
	КонецЦикла;
	
	// Переименование строк.
	Выборка = Результаты[3].Выбрать();
	Пока Выборка.Следующий() Цикл
		СпрОбъект = Выборка.ЗначениеАтрибутаКласса.ПолучитьОбъект();
		СпрОбъект.Наименование = СформироватьНаименованиеСтрокиТабличногоАтрибута(Выборка, СпрОбъект.Код);
		СпрОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ТекстЗапросаОбновлениеСтрокДочернихКлассов()
	
	ТекстЗапроса = 
		"";
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Процедура ОбновитьСтрокиДочернихОбъектов(ТаблицаПередачиНаследуемым)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаПередачиНаследуемым", ТаблицаПередачиНаследуемым);
	Запрос.Текст = ТекстЗапросаОбновлениеСтрокДочернихКлассов();
	
	//\Не реализовано!
	
КонецПроцедуры

#КонецОбласти


#КонецОбласти
