
#Область ПрограммныйИнтерфейс
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ШаблонПредставления = "План работ [%3] %1 от %2 ";
	Представление = СтрШаблон(ШаблонПредставления, Данные.Номер, Данные.Дата, Данные.ВидПлана);
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
	Поля.Добавить("Ссылка");
	Поля.Добавить("ВидПлана");
КонецПроцедуры
#КонецОбласти
