
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда
		// Здесь описываются значения по умолчанию.
		ИспользоватьОтборПоОрганизациям = Ложь;
		ПереноситьАктивыВУпп = Истина;
		ОтражатьПринятиеКУчетуОСВУПП = Истина;
		ОтражатьСписаниеОСВУПП = Ложь;
		ОтражатьВыявленныеДефекты = Истина;
		ОтражатьЗаказыНаРемонт = Истина;
		ВыгружатьПоступлениеИВнутреннееПотребление = Истина;
		РемонтыПоППР = Истина;
		РемонтыПоДефектам = Истина;
		РемонтыПоВнешнимОснованиям = Истина;
		ИспользоватьОтборПоСкладам = Ложь;
		РежимВыгрузкиПриНеобходимости = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПриНеобходимости;
		РежимВыгрузкиПоУсловию = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПоУсловию;
		РежимВыгрузкиДокументов = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПоУсловию;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
