///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Отправляет SMS через SMS.RU.
//
// Параметры:
//  НомераПолучателей - Массив - номера получателей в формате +7ХХХХХХХХХХ;
//  Текст 			  - Строка - текст сообщения, длиной не более 480 символов;
//  ИмяОтправителя 	  - Строка - имя отправителя, которое будет отображаться вместо номера входящего SMS;
//  Логин			  - Строка - логин пользователя услуги отправки sms;
//  Пароль			  - Строка - пароль пользователя услуги отправки sms.
//
// Возвращаемое значение:
//  Структура: ОтправленныеСообщения - Массив структур: НомерОтправителя.
//                                                  ИдентификаторСообщения.
//             ОписаниеОшибки        - Строка - пользовательское представление ошибки, если пустая строка,
//                                          то ошибки нет.
Функция ОтправитьSMS(НомераПолучателей, Текст, ИмяОтправителя, Логин, Пароль) Экспорт
	
	Результат = Новый Структура("ОтправленныеСообщения,ОписаниеОшибки", Новый Массив, "");
	
	// Подготовка строки получателей.
	СтрокаПолучателей = МассивПолучателейСтрокой(НомераПолучателей);
	
	// Проверка на заполнение обязательных параметров.
	Если ПустаяСтрока(СтрокаПолучателей) Или ПустаяСтрока(Текст) Тогда
		Результат.ОписаниеОшибки = НСтр("es='Los parámetros equivocados del mensaje';ru='Неверные параметры сообщения';en='Invalid message options'");
		Возврат Результат;
	КонецЕсли;
	
	// Подготовка параметров запроса.
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("login", Логин);
	ПараметрыЗапроса.Вставить("password", Пароль);
	ПараметрыЗапроса.Вставить("text", Текст);
	ПараметрыЗапроса.Вставить("to", СтрокаПолучателей);
	ПараметрыЗапроса.Вставить("from", ИмяОтправителя);
	
	// отправка запроса
	ТекстОтвета = ВыполнитьЗапрос("sms/send", ПараметрыЗапроса);
	Если Не ЗначениеЗаполнено(ТекстОтвета) Тогда
		Результат.ОписаниеОшибки = Результат.ОписаниеОшибки + НСтр("es='La unión no es establecida';ru='Соединение не установлено';en='Connection failed'");
		Возврат Результат;
	КонецЕсли;
	
	ИдентификаторыСообщений = СтрРазделить(ТекстОтвета, Символы.ПС);
	
	ОтветСервера = ИдентификаторыСообщений[0];
	ИдентификаторыСообщений.Удалить(0);
	
	Если ОтветСервера = "100" Тогда
		НомераПолучателей = СтрРазделить(СтрокаПолучателей, ",", Ложь);
		Если ИдентификаторыСообщений.Количество() < НомераПолучателей.Количество() Тогда
			Результат.ОписаниеОшибки = НСтр("es='La respuesta del servidor no es discernida';ru='Ответ сервера не распознан';en='Server response not recognized'");
			Возврат Результат;
		КонецЕсли;
		
		Для Индекс = 0 По НомераПолучателей.ВГраница() Цикл
			НомерПолучателя = НомераПолучателей[Индекс];
			ИдентификаторСообщения = ИдентификаторыСообщений[Индекс];
			Если Не ПустаяСтрока(НомерПолучателя) Тогда
				ОтправленноеСообщение = Новый Структура("НомерПолучателя,ИдентификаторСообщения",
					НомерПолучателя,ИдентификаторСообщения);
				Результат.ОтправленныеСообщения.Добавить(ОтправленноеСообщение);
			КонецЕсли;
		КонецЦикла;
	Иначе
		Результат.ОписаниеОшибки = ОписаниеОшибкиОтправки(ОтветСервера);
		ЗаписьЖурналаРегистрации(НСтр("es='El envío SMS';ru='Отправка SMS';en='SMS sending'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , , Результат.ОписаниеОшибки);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает текстовое представление статуса доставки сообщения.
//
// Параметры:
//  ИдентификаторСообщения - Строка - идентификатор, присвоенный sms при отправке;
//  НастройкиОтправкиSMS   - Структура - см. ОтправкаSMSПовтИсп.НастройкиОтправкиSMS;
//
// Возвращаемое значение:
//  Строка - статус доставки. См. описание функции ОтправкаSMS.СтатусДоставки.
Функция СтатусДоставки(ИдентификаторСообщения, НастройкиОтправкиSMS) Экспорт
	
	Логин = НастройкиОтправкиSMS.Логин;
	Пароль = НастройкиОтправкиSMS.Пароль;
	
	// Подготовка параметров запроса.
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("login", Логин);
	ПараметрыЗапроса.Вставить("password", Пароль);
	ПараметрыЗапроса.Вставить("id", ИдентификаторСообщения);
	
	// отправка запроса
	КодСостояния = ВыполнитьЗапрос("sms/status", ПараметрыЗапроса);
	Если Не ЗначениеЗаполнено(КодСостояния) Тогда
		Возврат "Ошибка";
	КонецЕсли;
	
	Результат = СтатусДоставкиSMS(КодСостояния);
	Если Результат = "Ошибка" Тогда
		ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("es='No consiguió recibir el estatus de la entrega SMS (id: ""%3""): "
"%1 (el código de la falta: %2)';ru='Не удалось получить статус доставки SMS (id: ""%3""):"
"%1 (код ошибки: %2)';en='Failed to get SMS delivery status (id:"" ""%3"" ""):"
"%1 (error code:%2)'"), ОписаниеОшибкиПолученияСтатуса(КодСостояния), КодСостояния, ИдентификаторСообщения);
		ЗаписьЖурналаРегистрации(НСтр("es='El envío SMS';ru='Отправка SMS';en='SMS sending'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтатусДоставкиSMS(КодСостояния)
	СоответствиеСтатусов = Новый Соответствие;
	СоответствиеСтатусов.Вставить("-1", "НеОтправлялось");
	СоответствиеСтатусов.Вставить("100", "НеОтправлялось");
	СоответствиеСтатусов.Вставить("101", "Отправляется");
	СоответствиеСтатусов.Вставить("102", "Отправлено");
	СоответствиеСтатусов.Вставить("103", "Доставлено");
	СоответствиеСтатусов.Вставить("104", "НеДоставлено");
	СоответствиеСтатусов.Вставить("105", "НеДоставлено");
	СоответствиеСтатусов.Вставить("106", "НеДоставлено");
	СоответствиеСтатусов.Вставить("107", "НеДоставлено");
	СоответствиеСтатусов.Вставить("108", "НеДоставлено");
	
	Результат = СоответствиеСтатусов[НРег(КодСостояния)];
	Возврат ?(Результат = Неопределено, "Ошибка", Результат);
КонецФункции

Функция ОписанияОшибок()
	ОписанияОшибок = Новый Соответствие;
	ОписанияОшибок.Вставить("200", НСтр("es='La autorización no es cumplida: equivocado api_id.';ru='Авторизация не выполнена: неверный api_id.';en='Authorization failed: invalid api_id.'"));
	ОписанияОшибок.Вставить("201", НСтр("es='La autorización no es cumplida: equivocado api_id.';ru='Авторизация не выполнена: неверный api_id.';en='Authorization failed: invalid api_id.'"));
	ОписанияОшибок.Вставить("202", НСтр("es='Es incorrectamente indicado el destinatario.';ru='Неправильно указан получатель.';en='Invalid recipient.'"));
	ОписанияОшибок.Вставить("203", НСтр("es='Es incorrectamente indicado el destinatario.';ru='Неправильно указан получатель.';en='Invalid recipient.'"));
	ОписанияОшибок.Вставить("204", НСтр("es='No hay texto del mensaje.';ru='Нет текста сообщения.';en='No message text.'"));
	ОписанияОшибок.Вставить("205", НСтр("es='El nombre del remitente no es arreglado con el proveedor (SMS.RU).';ru='Имя отправителя не согласовано с провайдером (SMS.RU).';en='The name of the sender is not agreed with the provider (SMS.RU).'"));
	ОписанияОшибок.Вставить("206", НСтр("es='El mensaje demasiado largo (supera 8 SMS).';ru='Сообщение слишком длинное (превышает 8 SMS).';en='The message is too long (exceeds 8 SMS).'"));
	ОписанияОшибок.Вставить("207", НСтр("es='Es alcanzado el límite del día al envío de los mensajes.';ru='Достигнут дневной лимит на отправку сообщений.';en='The daily limit for sending messages has been reached.'"));
	ОписанияОшибок.Вставить("208", НСтр("es='A este número (o un de los números) no es posible enviar los mensajes, o es indicado más de 100 números en la lista de los destinatarios';ru='На этот номер (или один из номеров) нельзя отправлять сообщения, либо указано более 100 номеров в списке получателей';en='You cannot send messages to this number (or one of the numbers), or more than 100 numbers are indicated in the recipient list'"));
	ОписанияОшибок.Вставить("209", НСтр("es='El parámetro time es indicado incorrectamente.';ru='Параметр time указан неправильно.';en='The time parameter is incorrect.'"));
	ОписанияОшибок.Вставить("210", НСтр("es='El número del destinatario (o un de los números) en la hoja de parada (cm. En el gabinete personal en el sitio).';ru='Номер получателя (или один из номеров) в стоп-листе (см. в личном кабинете на сайте).';en=""The recipient's number (or one of the numbers) in the stop list (see in your account on the website)."""));
	ОписанияОшибок.Вставить("211", НСтр("es='Se usa GET, donde es necesario usar POST.';ru='Используется GET, где необходимо использовать POST.';en='GET is used, where it is necessary to use POST.'"));
	ОписанияОшибок.Вставить("212", НСтр("es='El método no es encontrado.';ru='Метод не найден.';en='Method not found.'"));
	ОписанияОшибок.Вставить("220", НСтр("es='La codificación equivocada del texto del mensaje (es necesario usar UTF-8).';ru='Неверная кодировка текста сообщения (необходимо использовать UTF-8).';en='Incorrect message text encoding (must use UTF-8).'"));
	ОписанияОшибок.Вставить("230", НСтр("es='El servicio es temporalmente inaccesible.';ru='Сервис временно недоступен.';en='Service is temporarily unavailable.'"));
	ОписанияОшибок.Вставить("300", НСтр("es='El mensaje no es costumbre al envío: es alcanzado el límite del día de los mensajes a un número (60 шт).';ru='Сообщение не принято к отправке: достигнут дневной лимит сообщений на один номер (60 шт).';en='The message was not accepted for sending: the daily limit of messages to one number (60 pcs) was reached.'"));
	ОписанияОшибок.Вставить("301", НСтр("es='La autorización no es cumplida: token ha caducado (ha cumplido la validez, o se ha cambiado IP del remitente.';ru='Авторизация не выполнена: token устарел (истек срок действия, либо изменился IP отправителя.';en='Authorization failed: token is outdated (expired, or sender IP has changed.'"));
	ОписанияОшибок.Вставить("302", НСтр("es='La autorización no es cumplida: el login o la consigna son indicados incorrectamente.';ru='Авторизация не выполнена: логин или пароль указаны неверно.';en='Authorization failed: login or password is incorrect.'"));
	
	Возврат ОписанияОшибок;
КонецФункции

Функция ОписаниеОшибкиОтправки(КодОшибки)
	ОписанияОшибок = ОписанияОшибок();
	ТекстСообщения = ОписанияОшибок[КодОшибки];
	Если ТекстСообщения = Неопределено Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("es='El mensaje no es enviado (el código de la falta: %1).';ru='Сообщение не отправлено (код ошибки: %1).';en='Message not sent (error code:%1).'"), КодОшибки);
	КонецЕсли;
	Возврат ТекстСообщения;
КонецФункции

Функция ОписаниеОшибкиПолученияСтатуса(КодОшибки)
	ОписанияОшибок =ОписанияОшибок();
	ТекстСообщения = ОписанияОшибок[КодОшибки];
	Если ТекстСообщения = Неопределено Тогда
		ТекстСообщения = НСтр("es='La renuncia de la ejecución de la operación';ru='Отказ выполнения операции';en='Operation failure'");
	КонецЕсли;
	Возврат ТекстСообщения;
КонецФункции

Функция ВыполнитьЗапрос(ИмяМетода, ПараметрыЗапроса)
	
	HTTPЗапрос = ОтправкаSMS.ПодготовитьHTTPЗапрос("/" + ИмяМетода, ПараметрыЗапроса);
	HTTPОтвет = Неопределено;
	
	Попытка
		Соединение = Новый HTTPСоединение("sms.ru", , , , ПолучениеФайловИзИнтернета.ПолучитьПрокси("https"),
			60, ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение());
			
		HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("es='El envío SMS';ru='Отправка SMS';en='SMS sending'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Если HTTPОтвет <> Неопределено Тогда
		Возврат HTTPОтвет.ПолучитьТелоКакСтроку();
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция МассивПолучателейСтрокой(Массив)
	Получатели = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Получатели, Массив, Истина);
	
	Результат = "";
	Для Каждого Получатель Из Получатели Цикл
		Номер = ФорматироватьНомер(Получатель);
		Если НЕ ПустаяСтрока(Номер) Тогда 
			Если Не ПустаяСтрока(Результат) Тогда
				Результат = Результат + ",";
			КонецЕсли;
			Результат = Результат + Номер;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

Функция ФорматироватьНомер(Номер)
	Результат = "";
	ДопустимыеСимволы = "+1234567890";
	Для Позиция = 1 По СтрДлина(Номер) Цикл
		Символ = Сред(Номер,Позиция,1);
		Если СтрНайти(ДопустимыеСимволы, Символ) > 0 Тогда
			Результат = Результат + Символ;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;	
КонецФункции

// Возвращает список разрешений для отправки SMS с использованием всех доступных провайдеров.
//
// Возвращаемое значение:
//  Массив.
//
Функция Разрешения() Экспорт
	
	Протокол = "HTTP";
	Адрес = "sms.ru";
	Порт = Неопределено;
	Описание = НСтр("es='El envío SMS a través de ""SMS.RU"".';ru='Отправка SMS через ""SMS.RU"".';en='Sending SMS through ""SMS.RU"".'");
	
	МодульРаботаВБезопасномРежиме = ОбщегоНазначения.ОбщийМодуль("РаботаВБезопасномРежиме");
	
	Разрешения = Новый Массив;
	Разрешения.Добавить(
		МодульРаботаВБезопасномРежиме.РазрешениеНаИспользованиеИнтернетРесурса(Протокол, Адрес, Порт, Описание));
	
	Возврат Разрешения;
КонецФункции

Процедура ПриОпределенииНастроек(Настройки) Экспорт
	
	Настройки.АдресОписанияУслугиВИнтернете = "http://sms.ru";
	
КонецПроцедуры

#КонецОбласти

