#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

 // Удаляет записи по файлам, которые пометили на удаление. 
//
// Параметры:
//  Владелец - ДокументСсылка.торо_ВыявленныеДефекты - .
//  МассивИдентификаторовФайлов - Массив строк - идентификаторы прикрепленных файлов из Документооборота.
//
Процедура УдалитьНесуществующиеВДокументооборотеЗаписи(Владелец, МассивИдентификаторовФайлов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НаличиеПрикрепленныхФайловВДокументообороте.ВладелецФайла КАК ВладелецФайла,
		|	НаличиеПрикрепленныхФайловВДокументообороте.ИдентификаторВладельцаФайла КАК ИдентификаторВладельцаФайла,
		|	НаличиеПрикрепленныхФайловВДокументообороте.ИдентификаторФайла КАК ИдентификаторФайла
		|ИЗ
		|	РегистрСведений.гкс_НаличиеПрикрепленныхФайловВДокументообороте КАК НаличиеПрикрепленныхФайловВДокументообороте
		|ГДЕ
		|	НаличиеПрикрепленныхФайловВДокументообороте.ВладелецФайла = &ВладелецФайла
		|	И НЕ НаличиеПрикрепленныхФайловВДокументообороте.ИдентификаторФайла В (&МассивИдентификаторов)";
	
	Запрос.УстановитьПараметр("ВладелецФайла", Владелец);
	Запрос.УстановитьПараметр("МассивИдентификаторов", МассивИдентификаторовФайлов);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
				
		Выборка = РезультатЗапроса.Выбрать();		
		Пока Выборка.Следующий() Цикл
			СтруктураЗаписи = Новый Структура;
			СтруктураЗаписи.Вставить("ВладелецФайла", Выборка.ВладелецФайла);
			СтруктураЗаписи.Вставить("ИдентификаторВладельцаФайла", Выборка.ИдентификаторВладельцаФайла);
			СтруктураЗаписи.Вставить("ИдентификаторФайла", Выборка.ИдентификаторФайла);
			
			гкс_ОбменДаннымиСервер.УдалитьНаборЗаписейВРегистреСведений(СтруктураЗаписи, "гкс_НаличиеПрикрепленныхФайловВДокументообороте");		
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
