
&НаСервере
&ИзменениеИКонтроль("УстановитьДоступностьРегистрацииНачислений")
Функция гкс_УстановитьДоступностьРегистрацииНачислений()
	
	#Удаление
	РегистрацияНачисленийДоступна = Пользователи.РолиДоступны("ДобавлениеИзменениеНачисленнойЗарплатыРасширенная, ЧтениеНачисленнойЗарплатыРасширенная"); 
	#КонецУдаления
	#Вставка
	РегистрацияНачисленийДоступна = Пользователи.РолиДоступны(
		"ДобавлениеИзменениеПроведениеПометкаУдаленияУвольнений, ЧтениеУвольнений, гкс_РедактированиеЗаявкиНаРемонт"); 
	#КонецВставки

КонецФункции
