////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПЕРЕМЕННЫЕ

&НаКлиенте
Перем СтруктураДанныхДоРедактирования;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПравоРедактирования = ПравоДоступа("Редактирование", Объект.Ссылка.Метаданные());
	
	// СтандартныеПодсистемы.Свойства
	Контекст = Новый Структура();
	Контекст.Вставить("Объект",                     Объект);
	Контекст.Вставить("ИмяЭлементаДляРазмещения",   "ГруппаДополнительныеРеквизиты");
	Контекст.Вставить("ПроизвольныйОбъект",         Ложь);
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, Контекст);
	// Конец СтандартныеПодсистемы.Свойства
	
	торо_УправлениеСвойствами.ПроставитьПризнакОбщегоСвойстваВТаблицеДопРеквизитов(ЭтаФорма, Неопределено);
	ПривязатьОбработчикИзмененияДопРеквизитов();
	УнаследоватьДопРеквизитыИзТиповогоОР();
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтотОбъект, Объект, "КонтактнаяИнформация", ПоложениеЗаголовкаЭлементаФормы.Лево);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	торо_СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка, Новый Структура("УстановитьСвойствоЭлементовФормыОтПрав", Истина));
	
	Если Параметры.Свойство("СтруктураИерархии") И ЗначениеЗаполнено(Параметры.СтруктураИерархии) Тогда
		ТекСтруктураИерархии = Параметры.СтруктураИерархии;
	Иначе
		ТекСтруктураИерархии = Константы.торо_ИерархияДляВводаНовыхОР.Получить();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОписаниеОшибки = "";
		Если слкМенеджерЗащиты.ПроверитьЛицензииСеанса(ОписаниеОшибки) <> Истина Тогда
			ТекстСообщения = НСтр("es='¡La licencia no es descubierta! La creación del objeto de la reparación es imposible.';ru='Лицензия не обнаружена! Создание объекта ремонта невозможно.';en='No license found! Creating a repair facility is not possible.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			Возврат;
		КонецЕсли;
		
		РодительИерархии = ?(Параметры.Свойство("РодительИерархии"), Параметры.РодительИерархии, Справочники.торо_ОбъектыРемонта.ПустаяСсылка());
		ЭтоНовыйЭлемент = Истина;
		
		Модифицированность = Истина;
		ЗаполнитьПослеКопирования();
	КонецЕсли;
	
	Родитель = НайтиРодителяИерархии(ТекСтруктураИерархии, Объект.Ссылка);
	Если НЕ ЗначениеЗаполнено(Родитель) и ЗначениеЗаполнено(РодительИерархии) Тогда
		Родитель = РодительИерархии;
	КонецЕсли;

	ОтображатьИзображение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР","ОбъектыРемонта_ОтображатьИзображение", Ложь);
	
	ТекТиповойОР  = Объект.ТиповойОР;
	ПредТиповойОР = Объект.ТиповойОР;
	
	ОбновитьЗначенияНаработки = Истина;

	МодифицированностьПараметровНаработки   = Ложь;
	МодифицированностьНормРемонтов          = Ложь;
	МодифицированностьИзмеряемыхПоказателей = Ложь;
	МодифицированностьМаксЗначНаработки = Ложь;
	
	КоличествоПусков.Загрузить(РегистрыНакопления.торо_КоличествоПусковОР.Обороты('00010101',ТекущаяДата(),Новый Структура("ОбъектРемонта", Объект.Ссылка)));
	
	// ЖЦ Оборудования++
	ФОИспользоватьДокументыЖЦОборудования = ПолучитьФункциональнуюОпцию("торо_ИспользоватьДокументыПринятияИСписанияОборудования");
	Если ФОИспользоватьДокументыЖЦОборудования Тогда
		ЗаполнитьДатыЭксплуатации();
		УстановитьФлагПланированияИДоступность(Не ЗначениеЗаполнено(Объект.Ссылка));
	КонецЕсли; 
	// ЖЦ Оборудования--
	
	// Гарантии++
	ФОИспользоватьГарантии = ПолучитьФункциональнуюОпцию("торо_ИспользоватьГарантии");
	Если ФОИспользоватьГарантии Тогда
		ТаблицаГарантий = торо_ГарантийноеОбслуживание.ПолучитьТаблицуГарантий(Объект.Ссылка);
		
		Если Не ТаблицаГарантий = Неопределено  Тогда
			ГарантииОбъектаРемонта.Загрузить(ТаблицаГарантий);
		КонецЕсли; 
		
		Если ГарантииОбъектаРемонта.Количество() > 0 Тогда
			ЕстьГарантияДляОбъекта = Истина;
		Иначе
			ЕстьГарантияДляОбъекта = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	// Гарантии--
	
	// Ремонты_по_состоянию++
	ФОИспользоватьРемонтыПоСостоянию = ПолучитьФункциональнуюОпцию("торо_ИспользоватьРемонтыПоСостоянию");
	// Ремонты_по_состоянию--
	
	УстановитьВидимостьДоступность(Истина);
	УстановитьПараметрыЗапросовНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	торо_УправлениеСвойствами.ПроставитьПризнакОбщегоСвойстваВТаблицеДопРеквизитов(ЭтаФорма, Неопределено);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
    УправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
    // Конец СтандартныеПодсистемы.КонтактнаяИнформация
			
	Если Не Объект.ФайлКартинки.Пустая() Тогда
		АдресКартинки = НавигационнаяСсылкаКартинки(Объект.ФайлКартинки, УникальныйИдентификатор);
	Иначе
		АдресКартинки = "";
	Конецесли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Имена элементов формы типа ТаблицаФормы, в которых необходимо обрабатывать события изменения строк.
	Массив = Новый Массив;
	Массив.Добавить("ТабЗапчастейОбъектовРемонта");
	Массив.Добавить("ТабЗатратПоВидамРемонта");
	Массив.Добавить("НормативныеРемонты");
	Массив.Добавить("СписокПараметровНаработки");
	Массив.Добавить("ПредшествующиеРемонты");
	Массив.Добавить("ЗамещаемыеРемонты");
	Массив.Добавить("ТаблицаОценокРМ");
	торо_СобытияФормКлиент.ЗаполнитьСтруктуруДанныхДоРедактирования(СтруктураДанныхДоРедактирования,Массив);
			
	Если ЗначениеЗаполнено(Объект.ТиповойОР) И НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТиповойОРПриИзменении(Элементы.ТиповойОР);
	КонецЕсли;
	
	ВыбраноОсновное = Истина;
	ВыборОсновногоЗависимого = "Основное";
	
	Кнопка = ЭтаФорма.ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ГруппаГлобальные.ПодчиненныеЭлементы.Найти("ПодменюПечать");
	Если Кнопка <> Неопределено Тогда
		Кнопка.Вид = ВидГруппыФормы.Подменю;
		Кнопка.Картинка = БиблиотекаКартинок.Печать;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтаФорма, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	Если Не Отказ Тогда  // Проверка выполняется только если отключена возможность вводить документ ЖЦ оборудования.
		Если НЕ ФОИспользоватьДокументыЖЦОборудования
			И ЗначениеЗаполнено(Объект.ДатаВводаВЭксплуатацию) 
			И Объект.ДатаВыпуска > Объект.ДатаВводаВЭксплуатацию Тогда
			
			ТекстСообщение = НСтр("es='¡La fecha de la salida no puede ser más de fechas de la introducción en la explotación!';ru='Дата выпуска не может быть больше даты ввода в эксплуатацию!';en='Release date cannot be greater than the commissioning date!'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщение,,,, Отказ);
		КонецЕсли;
	КонецЕсли;

	ПроверитьЗаполнениеНормативныхРемонтов(Отказ);
	ПроверитьЗаполнениеЗамещаемыхРемонтов(Отказ);
	ПроверитьЗаполнениеГарантийОбъектовРемонта(Отказ);
	ПроверитьЗаполнениеПараметровНаработки(Отказ);
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
    УправлениеКонтактнойИнформацией.ОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, Объект, Отказ);
    // Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Проверка уникальности штрих-кода
	Если Не ШтрихКодУникален() Тогда
		Вопрос(НСтр("es='Es imposible anotar el objeto de la reparación: ¡la línea-código introducida no es único!';
			|ru='Невозможно записать объект ремонта: введённый штрих-код не уникален!';
			|en='Unable to record repair object: entered barcode is not unique!'"), РежимДиалогаВопрос.ОК, 0);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Объект.ВнешнийОбъект Тогда
		Объект.Организация = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
		Объект.Подразделение = ПредопределенноеЗначение("Справочник.СтруктураПредприятия.ПустаяСсылка");
	Иначе
		Объект.Контрагент = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
		Объект.ДоговорКонтрагента = ПредопределенноеЗначение("Справочник.ДоговорыКонтрагентов.ПустаяСсылка");
	КонецЕсли;
	
	Если ФОИспользоватьДокументыЖЦОборудования Тогда
		
		Если Не ЗначениеЗаполнено(ДатаВводаВЭксплуатацию) Тогда 
			ТекстСообщения = НСтр("es='El objeto de la reparación será inaccesible para la selección en los documentos ""la Introducción de los datos iniciales"", ""el Recuento de la elaboración de la maquinaria"", ""el Estado de los objetos de la reparación"". Introduzcan el documento ""la Aceptación del objeto de la reparación al recuento"" (el Grupo ""el Estatus del objeto de la reparación"")';ru='Объект ремонта будет недоступен для подбора в документы ""Ввод начальных данных"", ""Учет наработки оборудования"", ""Состояния объектов ремонта"". Введите документ ""Принятие объекта ремонта к учету"" (Группа ""Статус объекта ремонта"")';en='The repair object will not be available for selection in the documents ""Input of initial data"", ""Accounting for equipment operating time"", ""Status of repair objects"". Enter the document ""Acceptance of the repair object for accounting"" (Group ""Status of the repair object"")'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,"ВвестиОткрытьДокументПринятиеКУчету");
		КонецЕсли;
		
		Объект.ДатаВводаВЭксплуатацию = ДатаВводаВЭксплуатацию;
		
	Иначе
		
		Если Не ЗначениеЗаполнено(Объект.ДатаВводаВЭксплуатацию) Тогда
			ТекстСообщения = НСтр("es='>. La anotación no es cumplida.';ru='Не заполнено поле <Дата ввода в эксплуатацию>. Запись не выполнена.';en='The field <Дата ввода в эксплуатацию> is not filled. Recording failed.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли; 
		
	КонецЕсли;
	
	Если (МодифицированностьНормРемонтов Или МодифицированностьЗамещаемыхРемонтов Или  МодифицированностьПредшествующихРемонтов)
		И ЗначениеЗаполнено(ВРНачалоЦикла) Тогда
		
		Элементы.Перерасчитать.Доступность 	= Ложь;
		Элементы.Построить.Доступность 		= Ложь;
		Элементы.Настройки.Доступность 		= Ложь;
		
		ВРНачалоЦикла = Неопределено;
		торо_РаботаСМнемосхемами.мнс_СоздатьЧистуюКарту(ПолеМнемосхемы);
		ОчиститьПолеТабличногоДокумента();
		Декорация1 = "";
		
		ТекстСообщения = НСтр("es='Los datos en вкладке <la Estructura del ciclo de reparación> eran limpiados, puesto que las normas son cambiadas.';ru='Данные на вкладке <Структура ремонтного цикла> были очищены, так как нормативы изменены.';en='The data on the <Структура ремонтного цикла> tab has been cleared because the specifications have been changed.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
			
	Для каждого Ремонт Из НормативныеРемонты Цикл 
		
		СтрокиПредРемонтов = ПредшествующиеРемонты.НайтиСтроки(Новый Структура("ТиповойОР, ВидРемонта", Ремонт.ТиповойОР, Ремонт.ВидРемонта));
		
		Если СтрокиПредРемонтов.Количество() = 0 И Ремонт.Удален = Ложь Тогда 
			ШаблонСообщения = НСтр("es='Para la reparación ""%1"" en las reparaciones normativas no son rellenadas las reparaciones que preceden. ¡La anotación era anulada!';ru='Для ремонта ""%1"" в нормативных ремонтах не заполнены предшествующие ремонты. Запись была отменена!';en='For repairs ""%1"" in regulatory repairs, previous repairs were not completed. Recording has been canceled!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Ремонт.ВидРемонта);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		 КонецЕсли;		 
	 КонецЦикла;
	 
	 Если НЕ Отказ и ЗначениеЗаполнено(Объект.ТиповойОР) Тогда
		 Для каждого Ремонт Из НормативныеРемонты Цикл 
			 Если НЕ ЗначениеЗаполнено(Ремонт.ТиповойОР) И Ремонт.Удален = Ложь Тогда
				 СовпадающиеРемонты = НормативныеРемонты.НайтиСтроки(Новый Структура("ТиповойОР, ВидРемонта", Объект.ТиповойОР, Ремонт.ВидРемонта));
				 Если СовпадающиеРемонты.Количество() > 0 Тогда 
					 СовпадающиеРемонты[0].Удален = Истина;
					 МодифицированностьНормРемонтов = Истина;
				 КонецЕсли;
			 КонецЕсли;
		 КонецЦикла;
	 КонецЕсли;
	 
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
		
	Если НЕ Отказ Тогда
				
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ТекущийОбъект.ДополнительныеСвойства.Вставить("ТекСтруктураИерархии", ТекСтруктураИерархии);
			ТекущийОбъект.ДополнительныеСвойства.Вставить("РодительИерархии", РодительИерархии);
		КонецЕсли;
		
	КонецЕсли;
	
	СтеретьЗначенияУнаследованныхРеквизитовТиповогоОР();
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
    УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
    // Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекОбъект = Объект.Ссылка;
	Иначе
		ТекОбъект = ТекущийОбъект.Ссылка;
	КонецЕсли;
	
	ЗаписатьПоказателиЭксплуатации(ТекОбъект, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьЗапчасти(ТекОбъект, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	ЗаписатьНормативныеРемонты(ТекОбъект, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	ЗаписатьРемонтныеЦиклы(ТекОбъект, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьОценкиРМ(ТекОбъект, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьГарантии(ТекОбъект, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьОсновноеЗависимоеОборудование(ТекОбъект, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	ПредТиповойОР = Объект.ТиповойОР;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ФОИспользоватьДокументыЖЦОборудования Тогда
		Если Не Объект.Ссылка = Справочники.торо_ОбъектыРемонта.ПустаяСсылка() Тогда
			Элементы.ВвестиОткрытьДокументПринятиеКУчету.Доступность = Истина;
		КонецЕсли;
	КонецЕсли; 
	
	СтруктураВозврата = торо_РаботаСНаработкой.ОбновитьНаработку(Объект.Ссылка, Объект.ТиповойОР);
	
	СписокПараметровНаработки.Очистить();
	
	Для каждого Элем Из СтруктураВозврата Цикл
		НС = СписокПараметровНаработки.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Элем);
	КонецЦикла;
	
	УнаследоватьДопРеквизитыИзТиповогоОР();

	УстановитьПараметрыЗапросовНаСервере();
	УстановитьВидимостьДоступность();
	 
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Для обновления данных в дереве ОР.
	СтруктураРеквизитов = Новый Структура("Ссылка, ПометкаУдаления, Наименование", Объект.Ссылка, Объект.ПометкаУдаления, Объект.Наименование);
	
	Если ЭтоНовыйЭлемент Тогда
		СтруктураРеквизитов.Вставить("ЭтоНовый", ЭтоНовыйЭлемент);						
		СтруктураРеквизитов.Вставить("СтруктураИерархии", ТекСтруктураИерархии);
		СтруктураРеквизитов.Вставить("РодительИерархии", РодительИерархии);
	КонецЕсли;
	
	Оповестить("ЗаписанОбъектРемонта", СтруктураРеквизитов, ЭтаФорма);
	
	ЗаписатьНормативыОРПриИзмененииТиповогоОРНаСервере(Объект.ТиповойОР, Объект.Ссылка);
	УстановитьКоличествоОсновногоЗависимогоОборудования();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если НЕ ЗавершениеРаботы Тогда
		ПриЗакрытииНаСервере(ОтображатьИзображение);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПриЗакрытииНаСервере(ОтображатьИзображение)
		ХранилищеОбщихНастроек.Сохранить("НастройкиТОиР",
	"ОбъектыРемонта_ОтображатьИзображение", ОтображатьИзображение);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.торо_ОбъектыРемонтаПрисоединенныеФайлы") Тогда
		
		Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
			Объект.ФайлКартинки = ВыбранноеЗначение;
			АдресКартинки = НавигационнаяСсылкаКартинки(Объект.ФайлКартинки, УникальныйИдентификатор);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписьДокументаВыявленныеДефекты" Тогда
		
		Элементы.ВыявленныеДефекты.Обновить();
		
	КонецЕсли;
	
	Если ФОИспользоватьДокументыЖЦОборудования
		И ИмяСобытия  = "СОЗДАН_ДОКУМЕНТ_ПРИНЯТИЕ_К_УЧЕТУ"
		И Параметр.Свойство("ОбъектРемонта")
		И Параметр.ОбъектРемонта = Объект.Ссылка Тогда
		
		// >> [Деснол] [Ушаков А.Д.] [06.11.2019]
		торо_ЛокализацияКлиент.ОбновитьФормуОР(ЭтаФорма);
		// << [Деснол] [Ушаков А.Д.] [06.11.2019] 
		ЗаполнитьДатыЭксплуатации();
		
		Если ЗначениеЗаполнено(РегистраторСнятияСУчета) Тогда
			Элементы.ВвестиОткрытьДокументСнятияСУчета.Заголовок   = РегистраторСнятияСУчета;
		Иначе
			Элементы.ВвестиОткрытьДокументСнятияСУчета.Заголовок   = НСтр("es='Introducir el documento ""la Salida del objeto de la reparación""';ru='Ввести документ ""Выбытие объекта ремонта""';en='Enter the document ""Retirement of the repair object""'");
		КонецЕсли;
		
		УстановитьФлагПланированияИДоступность(Истина);
		УстановитьВидимостьДоступность();
		
	ИначеЕсли ФОИспользоватьДокументыЖЦОборудования
		И ИмяСобытия  = "СОЗДАН_ДОКУМЕНТ_СНЯТИЕ_С_УЧЕТА" И Параметр = Объект.Ссылка Тогда	
		
		// >> [Деснол] [Ушаков А.Д.] [06.11.2019]
		торо_ЛокализацияКлиент.ОбновитьФормуОР(ЭтаФорма);
		// << [Деснол] [Ушаков А.Д.] [06.11.2019] 
		ЗаполнитьДатыЭксплуатации();
		УстановитьФлагПланированияИДоступность(Истина);
		УстановитьВидимостьДоступность();
		
	ИначеЕсли ИмяСобытия = "Запись_ПрисоединенныйФайл" ИЛИ ИмяСобытия = "Запись_Файл" Тогда
		
		Модифицированность = Истина;
		СсылкаНаФайл = Неопределено;
		Если ТипЗнч(Источник) = Тип("Массив") Тогда
			Если Источник.Количество() > 0 Тогда
				СсылкаНаФайл = Источник[0];
			КонецЕсли;
		Иначе
			СсылкаНаФайл = Источник;
		КонецЕсли;
		
		Если ВыборИзображения И СсылкаНаФайл <> Неопределено Тогда
			
			Объект.ФайлКартинки = СсылкаНаФайл;
			АдресКартинки = НавигационнаяСсылкаКартинки(Объект.ФайлКартинки, УникальныйИдентификатор);
						
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ИЗМЕНЕН_ТИПОВОЙ_ОБЪЕКТ" Тогда
		Если Модифицированность = Ложь Тогда
			ТиповойОРПриИзменении(ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтаФорма, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
		торо_УправлениеСвойствамиКлиентСервер.НастроитьКнопкиКоманднойПанелиТаблицыДопРеквизитов(ЭтаФорма, ПравоРедактирования);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаправлениеПриИзменении(Элемент)
	// СтандартныеПодсистемы.Свойства
	ОбновитьЭлементыДополнительныхРеквизитов();
	торо_УправлениеСвойствамиКлиентСервер.НастроитьКнопкиКоманднойПанелиТаблицыДопРеквизитов(ЭтаФорма, ПравоРедактирования);
	// Конец СтандартныеПодсистемы.Свойства
	
	Если Объект.Направление = торо_ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(ТекТиповойОР,"Направление") Тогда
		Элемент.ЦветТекста = Новый Цвет(128,128,128);
	Иначе
		Элемент.ЦветТекста = Новый Цвет(0,0,0);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТиповойОРПриИзменении(Элемент)
			
	ЗаполнитьНормативныеРемонты();
	
	// обновить нормативные ремонты
	СтруктураВозврата = ТиповойОРПриИзмененииНаСервере(Объект.Ссылка, ТекТиповойОР, Объект.ТиповойОР);		
	
	Если ЗначениеЗаполнено(ТекТиповойОР) Тогда
		СтрокиДляУдаления = НормативныеРемонты.НайтиСтроки(Новый Структура("ТиповойОР", ТекТиповойОР));
		Для Каждого СтрокаДляУдаления Из СтрокиДляУдаления Цикл
			НормативныеРемонты.Удалить(СтрокаДляУдаления);
		КонецЦикла;
	КонецЕсли;
	
	Для каждого Элем Из СтруктураВозврата Цикл
		НС = НормативныеРемонты.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Элем);
	КонецЦикла;	
	
	// обновить предшествующие ремонты
	
	СтруктураВозврата = ПолучитьПредшествующиеРемонтыНаСервере(Объект.ТиповойОР);
	
	Если ЗначениеЗаполнено(ТекТиповойОР) Тогда
		СтрокиДляУдаления = ПредшествующиеРемонты.НайтиСтроки(Новый Структура("ТиповойОР", ТекТиповойОР));
		Для Каждого СтрокаДляУдаления Из СтрокиДляУдаления Цикл
			ПредшествующиеРемонты.Удалить(СтрокаДляУдаления);
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого Элем Из СтруктураВозврата Цикл
		НС = ПредшествующиеРемонты.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Элем);
	КонецЦикла;	
	МодифицированностьПредшествующихРемонтов = Истина;
	
	// Обновить фиксированные ремонтные циклы
	МассивЦепочек = ОбновитьФиксированныеРемонтныеЦиклы(Объект.Ссылка, Объект.ТиповойОР, Ложь);
	
	Если ЗначениеЗаполнено(ТекТиповойОР) Тогда 
		СтрокиДляУдаления = ТабличноеПолеРемонтныеЦиклыОборудования.НайтиСтроки(Новый Структура("ГруппаОбъектовРемонтов, ТиповойОР", ТекТиповойОР, Истина));
		Для каждого Строка Из СтрокиДляУдаления Цикл 
			ТабличноеПолеРемонтныеЦиклыОборудования.Удалить(Строка);
		КонецЦикла;
		
		СтрокиДляУдаления = РемЦиклыОборудования.НайтиСтроки(Новый Структура("ГруппаОбъектовРемонтов, ТиповойОР", ТекТиповойОР, Истина));
		Для каждого Строка Из СтрокиДляУдаления Цикл
			РемЦиклыОборудования.Удалить(Строка);
		КонецЦикла;
	КонецЕсли;
	
	Для каждого Элем Из МассивЦепочек Цикл
		НС = ТабличноеПолеРемонтныеЦиклыОборудования.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Элем);
		
		НС = РемЦиклыОборудования.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Элем);
	КонецЦикла;
	МодифицированностьРемЦиклов = Истина;
	
	СтруктураВозврата = ПолучитьЗамещаемыеРемонтыНаСервере(Объект.ТиповойОР);
	
	Если ЗначениеЗаполнено(ТекТиповойОР) Тогда
		СтрокиДляУдаления = ЗамещаемыеРемонты.НайтиСтроки(Новый Структура("ТиповойОР", ТекТиповойОР));
		Для Каждого СтрокаДляУдаления Из СтрокиДляУдаления Цикл
			ЗамещаемыеРемонты.Удалить(СтрокаДляУдаления);
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого Элем Из СтруктураВозврата Цикл
		НС = ЗамещаемыеРемонты.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Элем);
	КонецЦикла;
	МодифицированностьЗамещаемыхРемонтов = Истина;
	
	Если Элемент = Элементы.ТиповойОР Тогда
		ИзмененИзготовитель = Ложь;
		ИзмененоНаправление = Ложь;
		текИзготовительТипового = торо_ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(ТекТиповойОР, "Изготовитель");
		текНаправлениеТипового = торо_ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(ТекТиповойОР, "Направление");
		Если текИзготовительТипового = Объект.Изготовитель ИЛИ НЕ ЗначениеЗаполнено(Объект.Изготовитель) Тогда
			Объект.Изготовитель = торо_ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(Объект.ТиповойОР, "Изготовитель");
			Элементы.Изготовитель.ЦветТекста = Новый Цвет(128,128,128);
		КонецЕсли; 
		Если текНаправлениеТипового = Объект.Направление ИЛИ НЕ ЗначениеЗаполнено(Объект.Направление) Тогда
			Объект.Направление  = торо_ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(Объект.ТиповойОР, "Направление");
			Элементы.Направление.ЦветТекста = Новый Цвет(128,128,128);
		КонецЕсли; 
		
	КонецЕсли;	
	
	МодифицированностьНормРемонтов = Истина;
	
	Если НЕ МодифицированностьИзмеряемыхПоказателей Тогда
		СтруктураКонтрПоказателей = ОбновитьИзмеряемыеПоказатели(Объект.Ссылка, Объект.ТиповойОР);
		СписокИзмеряемыхПоказателей.Очистить();
		Для Каждого Элем Из СтруктураКонтрПоказателей Цикл
			НС = СписокИзмеряемыхПоказателей.Добавить();
			
			ЗаполнитьЗначенияСвойств(НС, Элем);
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекТиповойОР) Тогда
		СтрокиДляУдаления = ПараметрыОповещенияПоСостояниямОР.НайтиСтроки(Новый Структура("ТиповойОР", ТекТиповойОР));
		Для Каждого СтрокаДляУдаления Из СтрокиДляУдаления Цикл
			ПараметрыОповещенияПоСостояниямОР.Удалить(СтрокаДляУдаления);
		КонецЦикла;
	КонецЕсли;
	
	ТекТиповойОР = Объект.ТиповойОР;
	
	МассивРемонтовИзТипового = СписокИзмеряемыхПоказателей.НайтиСтроки(Новый Структура("ИзТиповогоОР",Истина));
	Для Каждого Эл Из МассивРемонтовИзТипового Цикл
		СписокИзмеряемыхПоказателей.Удалить(Эл);
	КонецЦикла;
	
	СтруктураКонтрПоказателей = ОбновитьИзмеряемыеПоказатели(Объект.Ссылка, Объект.ТиповойОР);
	Для Каждого Элем Из СтруктураКонтрПоказателей Цикл
		Если Элем.ИзТиповогоОР Тогда
			НС = СписокИзмеряемыхПоказателей.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Элем); 
		КонецЕсли;
	КонецЦикла;
	
	
	Массив = ПолучитьПараметрыОповещенияПоКонтролируемымПоказателям(Объект.Ссылка, Объект.ТиповойОР);
	Для Каждого Эл Из Массив Цикл
		Если ЗначениеЗаполнено(Эл.ТиповойОР) Тогда
			ЗаполнитьЗначенияСвойств(ПараметрыОповещенияПоСостояниямОР.Добавить(),Эл);
		КонецЕсли;
	КонецЦикла;
	
	МодифицированностьИзмеряемыхПоказателей = Истина;
	
	// Заполнить таблицу запчастей.
	Если НЕ МодифицированностьЗапчастейОР Тогда
		СтруктураВозврата = ЗаполнитьТабЗапчастейОбъектовРемонта(Параметры.Ключ);
		Если СтруктураВозврата.Свойство("Запчасти") Тогда
			
			ТабЗапчастейОбъектовРемонта.Очистить();
			Для Каждого Стр Из СтруктураВозврата.Запчасти Цикл
				
				НС = ТабЗапчастейОбъектовРемонта.Добавить();
				ЗаполнитьЗначенияСвойств(НС,Стр);
				НС.ХарактеристикиИспользуются = торо_НоменклатураСервер.ПолучитьХарактеристикиИспользуются(НС.Номенклатура);
				
			КонецЦикла;
			
		КонецЕсли;
		Если СтруктураВозврата.Свойство("НормаЗапчастей") Тогда
			
			ТабЗатратПоВидамРемонта.Очистить();
			Для Каждого Стр Из СтруктураВозврата.НормаЗапчастей Цикл
				
				НС = ТабЗатратПоВидамРемонта.Добавить();
				ЗаполнитьЗначенияСвойств(НС,Стр);
				
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	МодифицированностьЗапчастейОР = Истина;
	МодифицированностьНормативныхЗатратПоЗапчастям = Истина;
	Если ЗначениеЗаполнено(Объект.ТиповойОР) Тогда
		
		СтрВозврата = ПолучитьЗапчастиИзТиповогоОР(Объект.ТиповойОР);
		
		// ТабЗатратПоВидамРемонта
		мУдаления = Новый Массив;
		Для каждого ТекСтрока из ТабЗатратПоВидамРемонта Цикл
			Если ТекСтрока.ИзТипового = Истина Тогда
				мУдаления.Добавить(ТекСтрока);
			КонецЕсли;
		КонецЦикла;
		
		Для каждого ТекСтрока из мУдаления Цикл
			ТабЗатратПоВидамРемонта.Удалить(текСтрока);
		КонецЦикла;
		
		Если СтрВозврата.Свойство("НормативныеЗатраты") Тогда
			Для каждого ТекСтрока из СтрВозврата.НормативныеЗатраты Цикл
				нс = ТабЗатратПоВидамРемонта.Добавить();
				ЗаполнитьЗначенияСвойств(нс, ТекСтрока);
				нс.ИзТипового = Истина;
				нс.ТиповойОр = Объект.ТиповойОР;
				нс.ОбъектРемонта = Объект.Ссылка;
			КонецЦикла;
		КонецЕсли;
		
		// ТабЗапчастейОбъектовРемонта
		мУдаления.Очистить();
		Для каждого ТекСтрока из ТабЗапчастейОбъектовРемонта Цикл
			Если ТекСтрока.ИзТипового = Истина Тогда
				мУдаления.Добавить(ТекСтрока);
			КонецЕсли;
		КонецЦикла;
		
		Для каждого ТекСтрока из мУдаления Цикл
			ТабЗапчастейОбъектовРемонта.Удалить(текСтрока);
		КонецЦикла;
		
		Если СтрВозврата.Свойство("Запчасти") Тогда
			Для каждого ТекСтрока из СтрВозврата.Запчасти Цикл
				НайС = ТабЗапчастейОбъектовРемонта.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", ТекСтрока.Номенклатура, ТекСтрока.Характеристика));
				нс = ТабЗапчастейОбъектовРемонта.Добавить();
				ЗаполнитьЗначенияСвойств(нс, ТекСтрока);
				нс.ИзТипового = Истина;
				нс.ТиповойОр = Объект.ТиповойОР;
				нс.ОбъектРемонта = Объект.Ссылка;
				нс.Удален = НайС.Количество() > 0;
				нс.ХарактеристикиИспользуются = торо_НоменклатураСервер.ПолучитьХарактеристикиИспользуются(ТекСтрока.Номенклатура);
				
				Если нс.Удален тогда
					НайС = ТабЗатратПоВидамРемонта.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, ИзТипового", 
						ТекСтрока.Номенклатура, ТекСтрока.Характеристика, истина));
						
					Для каждого текЗатрата из Найс цикл
						текЗатрата.Удален = Истина;	
					КонецЦикла;	
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		
	Иначе
		
		мУдаления = Новый Массив;
		Для каждого ТекСтрока из ТабЗапчастейОбъектовРемонта Цикл
			Если ТекСтрока.ИзТипового = Истина Тогда
				мУдаления.Добавить(ТекСтрока);
			КонецЕсли;
		КонецЦикла;
		
		Для каждого ТекСтрока из мУдаления Цикл
			ТабЗапчастейОбъектовРемонта.Удалить(текСтрока);
		КонецЦикла;
		
		мУдаления.Очистить();
		Для каждого ТекСтрока из ТабЗатратПоВидамРемонта Цикл
			Если ТекСтрока.ИзТипового = Истина Тогда
				мУдаления.Добавить(ТекСтрока);
			КонецЕсли;
		КонецЦикла;
		
		Для каждого ТекСтрока из мУдаления Цикл
			ТабЗатратПоВидамРемонта.Удалить(текСтрока);
		КонецЦикла;
		
	КонецЕсли;
	
	ПанельОРПриСменеСтраницы(Элементы.ПанельОР, Элементы.ПанельОР.ТекущаяСтраница);
	
	// СтандартныеПодсистемы.Свойства
	ОбновитьЭлементыДополнительныхРеквизитов();
	торо_УправлениеСвойствамиКлиентСервер.НастроитьКнопкиКоманднойПанелиТаблицыДопРеквизитов(ЭтаФорма, ПравоРедактирования);
	// Конец СтандартныеПодсистемы.Свойства
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТиповойОРПриИзмененииНаСервере(ОбъектРемонта, ТекТиповойОР, НовТиповойОР)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_НормативныеРемонтыОборудования.ВидРемонта,
	|	торо_НормативныеРемонтыОборудования.Ссылка КАК ТиповойОР,
	|	торо_НормативныеРемонтыОборудования.НормативныйРемонт,
	|	торо_НормативныеРемонтыОборудования.СпособПланирования,
	|	торо_НормативныеРемонтыОборудования.ГрафикРемонтныхРабот,
	|	торо_НормативныеРемонтыОборудования.СпособВыполнения,
	|	торо_НормативныеРемонтыОборудования.НеИспользоватьВПланированииДатуВводаВЭксплуатацию,
	|	торо_НормативныеРемонтыОборудования.СпособУчетаДатыОтсчета,
	|	торо_НормативныеРемонтыОборудования.НеУчаствуетВПланировании,
	|	торо_НормативныеРемонтыОборудования.РазрешитьСокращатьМежремонтныйПериодПриПланировании,
	|	торо_НормативныеРемонтыОборудования.НеУчитыватьПриПланированииГрафикРаботыОборудования,
	|	торо_НормативныеРемонтыОборудования.НеУчитыватьПриПланированииГрафикРемонтныхРабот,
	|	торо_НормативныеРемонтыОборудования.НеУчитыватьПродолжительность,
	|	торо_НормативныеРемонтыОборудования.ИспользоватьКоэффициентыРемонтныхОсобенностей,
	|	торо_НормативныеРемонтыОборудования.УчитыватьПростоиОборудования
	|ИЗ
	|	Справочник.торо_ТиповыеОР.НормативныеРемонты КАК торо_НормативныеРемонтыОборудования
	|ГДЕ
	|	торо_НормативныеРемонтыОборудования.Ссылка = &НовТиповойОР
	|	И торо_НормативныеРемонтыОборудования.Статус = ЗНАЧЕНИЕ(Перечисление.торо_СтатусыНормативныхРемонтовИТехКарт.Действует)";
	
	Запрос.УстановитьПараметр("ОбъектРемонта", ОбъектРемонта);
	Запрос.УстановитьПараметр("НовТиповойОР", НовТиповойОР);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	СтруктураВозврата = Новый Массив;
	Пока Выборка.Следующий() Цикл
		
		СтруктураДляДобавления = Новый Структура("ВидРемонта, ТиповойОР, НормативныйРемонт, СпособПланирования, ГрафикРемонтныхРабот, 
												 |СпособВыполнения, НеИспользоватьВПланированииДатуВводаВЭксплуатацию, СпособУчетаДатыОтсчета,
												 |НеУчаствуетВПланировании, РазрешитьСокращатьМежремонтныйПериодПриПланировании, 
												 |НеУчитыватьПриПланированииГрафикРаботыОборудования, НеУчитыватьПриПланированииГрафикРемонтныхРабот, 
												 |НеУчитыватьПродолжительность, ИспользоватьКоэффициентыРемонтныхОсобенностей, УчитыватьПростоиОборудования");
		ЗаполнитьЗначенияСвойств(СтруктураДляДобавления,Выборка);
		СтруктураВозврата.Добавить(СтруктураДляДобавления);
				
	КонецЦикла;
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаКлиенте
Процедура АдресКартинкиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗаблокироватьДанныеФормыДляРедактирования();
	ДобавитьИзображениеНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлКартинкиПриИзменении(Элемент)

	Если Не Объект.ФайлКартинки.Пустая() Тогда
		АдресКартинки = НавигационнаяСсылкаКартинки(Объект.ФайлКартинки, УникальныйИдентификатор);
	Иначе
		АдресКартинки = "";
	Конецесли;

КонецПроцедуры // ФайлКартинкиПриИзменении()

&НаКлиенте
Процедура ВнешнийОбъектПриИзменении(Элемент)
	ПоказыватьКонтрагента = Объект.ВнешнийОбъект;
	Элементы.СтраницаКонтрагента.Видимость = ПоказыватьКонтрагента;
	Элементы.СтарницаОрганизации.Видимость = НЕ ПоказыватьКонтрагента;
КонецПроцедуры

&НаКлиенте
Процедура ПанельОРПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	// устанавливаем фильтры для таблиц
	Если ТекущаяСтраница = Элементы.СтраницаНормативыПланирования Тогда
		СтраницыНормативыПланированияПриСменеСтраницы(Элементы.СтраницыНормативыПланирования,Элементы.СтраницыНормативыПланирования.ПодчиненныеЭлементы[0]);
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаПоказателиЭксплуатации Тогда
		ТекСтраницаПараметр = Элементы.СтраницыПоказателиЭксплуатации.ТекущаяСтраница;
		Если ТекСтраницаПараметр = Неопределено Тогда
			ТекСтраницаПараметр = Элементы.СтраницыПоказателиЭксплуатации.ПодчиненныеЭлементы[0];
		КонецЕсли;
		СтраницыПоказателиЭксплуатацииПриСменеСтраницы(Элементы.СтраницыПоказателиЭксплуатации, ТекСтраницаПараметр);
	ИначеЕсли ТекущаяСтраница = Элементы.ГруппаДополнительныеРеквизиты Тогда
		торо_УправлениеСвойствамиКлиентСервер.НастроитьКнопкиКоманднойПанелиТаблицыДопРеквизитов(ЭтаФорма, ПравоРедактирования);
	Иначе
		// на случай неправильной (старой) компоновки страниц
		Если Элементы.СтраницыПоказателиЭксплуатации.ПодчиненныеЭлементы.Индекс(ТекущаяСтраница) <> -1 Тогда
			СтраницыПоказателиЭксплуатацииПриСменеСтраницы(Элемент, ТекущаяСтраница);
		ИначеЕсли Элементы.СтраницыНормативыПланирования.ПодчиненныеЭлементы.Индекс(ТекущаяСтраница) <> -1 Тогда
			СтраницыНормативыПланированияПриСменеСтраницы(Элемент, ТекущаяСтраница);
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ИзготовительПриИзменении(Элемент)
	
	Если Объект.Изготовитель = торо_ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(ТекТиповойОР,"Изготовитель") Тогда
		Элемент.ЦветТекста = Новый Цвет(128,128,128);
	Иначе
		Элемент.ЦветТекста = Новый Цвет(0,0,0);
	КонецЕсли;
	
КонецПроцедуры

#Область ПОКАЗАТЕЛИ_ЭКСПЛУАТАЦИИ

&НаКлиенте
Процедура СтраницыПоказателиЭксплуатацииПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.СтраницаНаработка Тогда
		
		Если Не МодифицированностьПараметровНаработки Тогда
			
			СтруктураВозврата = торо_РаботаСНаработкой.ОбновитьНаработку(Объект.Ссылка, Объект.ТиповойОР);
			
			СписокПараметровНаработки.Очистить();
			
			Для каждого Элем Из СтруктураВозврата Цикл
				НС = СписокПараметровНаработки.Добавить();
				ЗаполнитьЗначенияСвойств(НС, Элем);
			КонецЦикла;
			
		КонецЕсли;
		
		Если Не МодифицированностьМаксЗначНаработки Тогда
			
			СтруктураВозврата = ОбновитьМаксимальныеЗначенияПоказателейНаработки(Объект.Ссылка, Объект.ТиповойОР);
			
			ТабМаксимальныхЗначенийНаработки.Очистить();
			Для каждого Элем Из СтруктураВозврата Цикл
				НС = ТабМаксимальныхЗначенийНаработки.Добавить();
				ЗаполнитьЗначенияСвойств(НС, Элем);
			КонецЦикла;
			
		КонецЕсли;
		
		Если ОбновитьЗначенияНаработки Тогда
			
			ОбновитьЖурналНаработки(Истина);
			
			ОбновитьЗначенияНаработки = Ложь;
			
		КонецЕсли;
		
		ОбновитьЗначенияИзноса();
		
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаКонтролируемыеПоказатели Тогда
		
		Если НЕ МодифицированностьИзмеряемыхПоказателей Тогда
			СтруктураКонтрПоказателей = ОбновитьИзмеряемыеПоказатели(Объект.Ссылка, Объект.ТиповойОР);
			СписокИзмеряемыхПоказателей.Очистить();
			Для Каждого Элем Из СтруктураКонтрПоказателей Цикл
				НС = СписокИзмеряемыхПоказателей.Добавить();
				
				ЗаполнитьЗначенияСвойств(НС, Элем);
			КонецЦикла;
			
			// Ремонты_по_состоянию++
			Если НЕ МодифицированностьПараметровОповещенияОСостоянииОР Тогда
				МассивСтруктурПараметровОповещения = ПолучитьПараметрыОповещенияПоКонтролируемымПоказателям(Объект.Ссылка, Объект.ТиповойОР);
				ПараметрыОповещенияПоСостояниямОР.Очистить();
				Для Каждого ЭлементМассива Из МассивСтруктурПараметровОповещения Цикл
					
					ЗаполнитьЗначенияСвойств(ПараметрыОповещенияПоСостояниямОР.Добавить(),ЭлементМассива);
					
				КонецЦикла;
			КонецЕсли;
			// Ремонты_по_состоянию--
			
		КонецЕсли;
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаСостояниеОР Тогда
		
		Если Элементы.СтраницыСостояний.ТекущаяСтраница = Элементы.СтраницыСостояний.ПодчиненныеЭлементы.ГрафикСостоянияОР Тогда
			ПостроитьГрафикСостоянийОР();	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыСостоянийПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если Элементы.СтраницыСостояний.ТекущаяСтраница = Элементы.СтраницыСостояний.ПодчиненныеЭлементы.ГрафикСостоянияОР Тогда
		ПостроитьГрафикСостоянийОР();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоПериодуПриИзменении(Элемент)
	Если ОтборПоПериоду Тогда
		Элементы.ДатаНачала.Доступность = Истина;
		Элементы.ДатаОкончания.Доступность = Истина;
	Иначе
		Элементы.ДатаНачала.Доступность = Ложь;
		Элементы.ДатаОкончания.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	Если ДатаНачала < Объект.ДатаВводаВЭксплуатацию Тогда
		ТекстСообщения = НСтр("es='La fecha ha comenzado menos que la fecha de la introducción en la explotación del objeto de la reparación';ru='Дата начала меньше, чем дата ввода в эксплуатацию объекта ремонта';en='Start date is less than the date of commissioning of the repair facility'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолосаРегулированияИнтервалаГрафикаПриИзменении(Элемент)
	
	Если ПолосаРегулированияИнтервалаГрафика < 1 Тогда
		ГрафикСостоянийОР.ПоддержкаМасштаба = ПоддержкаМасштабаДиаграммыГанта.ВсеДанные;
	Иначе
		ГрафикСостоянийОР.ПоддержкаМасштаба = ПоддержкаМасштабаДиаграммыГанта.Период;
		ГрафикСостоянийОР.ЕдиницаПериодическогоВарианта = ТипЕдиницыШкалыВремени["День"];
		ГрафикСостоянийОР.КратностьПериодическогоВарианта = ПолосаРегулированияИнтервалаГрафика;	
	КонецЕсли;
	
КонецПроцедуры

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокИзмеряемыхПоказателей
&НаКлиенте
Процедура СписокИзмеряемыхПоказателейОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("ПланВидовХарактеристикСсылка.торо_ИзмеряемыеПоказателиОбъектовРемонта") Тогда
		
		СписокПоказателейВТаблице = СписокИзмеряемыхПоказателей.НайтиСтроки(Новый Структура("Показатель", ВыбранноеЗначение));
		Если СписокПоказателейВТаблице.Количество() = 0 Тогда
			
			НС = СписокИзмеряемыхПоказателей.Добавить();
			СтруктураЗначенийПолей = ПолучитьЗначенияКонтролируемыхПоказателей(ВыбранноеЗначение,Объект.Ссылка,Истина);
			СтруктураЗначенийПолей.Вставить("ОбъектРемонта", Объект.Ссылка);
			СтруктураЗначенийПолей.Вставить("Показатель"   , ВыбранноеЗначение);
			
			Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
				СтруктураЗначенийПолей.Вставить("Доступность", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "ТипЗначения").СодержитТип(Тип("Число")));
			Иначе
				СтруктураЗначенийПолей.Вставить("Доступность", Ложь);
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(НС, СтруктураЗначенийПолей);
			
			МодифицированностьИзмеряемыхПоказателей = Истина;
			Модифицированность = Истина;
		ИначеЕсли СписокПоказателейВТаблице.Количество() = 1 И СписокПоказателейВТаблице[0].Удален Тогда
			Строка = СписокПоказателейВТаблице[0];
			СтруктураЗначенийПолей = ПолучитьЗначенияКонтролируемыхПоказателей(Строка.Показатель,Объект.Ссылка, Истина);
			ЗаполнитьЗначенияСвойств(Строка, СтруктураЗначенийПолей);
			Строка.ОбъектРемонта = Объект.Ссылка;
			Строка.ТиповойОР = ПредопределенноеЗначение("Справочник.торо_ТиповыеОР.ПустаяСсылка");
			Строка.ИзТиповогоОР = Ложь;
			Строка.Удален = Ложь;
			
			МодифицированностьИзмеряемыхПоказателей = Истина;
			Модифицированность = Истина;
		Иначе
			ШаблонСообщения = НСтр("es='¡El índice escogido %1 hay ya en la lista!';ru='Выбранный показатель %1 уже имеется в списке!';en='The selected metric%1 is already in the list!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ВыбранноеЗначение);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокИзмеряемыхПоказателейПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НЕ ОтменаРедактирования Тогда
		
		ТекДанные = Элемент.ТекущиеДанные;
		
		Если НоваяСтрока Тогда
			ТекДанные.ОбъектРемонта = Объект.Ссылка;
		КонецЕсли;
		
		МодифицированностьИзмеряемыхПоказателей = Истина;
		
		Если ТекДанные.ЗначенияКонтролируемыхПоказателейИзОР Тогда
			ТекДанные.ОбъектРемонта = Объект.Ссылка;

		Иначе
			СтруктураЗначенийПолей = ПолучитьЗначенияКонтролируемыхПоказателей(ТекДанные.Показатель,ТекДанные.ОбъектРемонта, Истина);
			
			ЗаполнитьЗначенияСвойств(ТекДанные, СтруктураЗначенийПолей);
			ТекДанные.Доступность = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекДанные.Показатель, "ТипЗначения").СодержитТип(Тип("Число"));
				
		КонецЕсли;
		
		СписокИзмеряемыхПоказателейПриАктивизацииСтроки(Элементы.СписокИзмеряемыхПоказателей);
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокИзмеряемыхПоказателейПослеУдаления(Элемент)
	МодифицированностьИзмеряемыхПоказателей = Истина;
	Элементы.СписокИзмеряемыхПоказателей.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура СписокИзмеряемыхПоказателейПриАктивизацииСтроки(Элемент)
	
	ЗначенияКонтролируемыхПоказателей.Отбор.Элементы.Очистить();
	
	Если Элементы.СписокИзмеряемыхПоказателей.ТекущиеДанные <> Неопределено Тогда
		ЭлемОтбора = ЗначенияКонтролируемыхПоказателей.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлемОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлемОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОбъектРемонта");
		ЭлемОтбора.ПравоеЗначение = Объект.Ссылка;
		ЭлемОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
		ЭлемОтбора = ЗначенияКонтролируемыхПоказателей.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлемОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлемОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Показатель");
		ЭлемОтбора.ПравоеЗначение = Элементы.СписокИзмеряемыхПоказателей.ТекущиеДанные.Показатель;
		ЭлемОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный; 
	Иначе
		
		ЭлемОтбора = ЗначенияКонтролируемыхПоказателей.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлемОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлемОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОбъектРемонта");
		ЭлемОтбора.ПравоеЗначение = Объект.Ссылка;
		ЭлемОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
		ЭлемОтбора = ЗначенияКонтролируемыхПоказателей.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлемОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлемОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Показатель");
		ЭлемОтбора.ПравоеЗначение = ПредопределенноеЗначение("ПланВидовХарактеристик.торо_ИзмеряемыеПоказателиОбъектовРемонта.ПустаяСсылка");
		ЭлемОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
	КонецЕсли;
	
	Если Элементы.СписокИзмеряемыхПоказателей.ТекущиеДанные <> Неопределено Тогда
		ОтборПараметровОповещений = Новый ФиксированнаяСтруктура("Показатель",Элементы.СписокИзмеряемыхПоказателей.ТекущиеДанные.Показатель);
		Элементы.ПараметрыОповещенияПоСостояниямОР.ОтборСтрок = ОтборПараметровОповещений;
	Иначе
		ОтборПараметровОповещений = Новый ФиксированнаяСтруктура("Показатель",ПредопределенноеЗначение("ПланВидовХарактеристик.торо_ИзмеряемыеПоказателиОбъектовРемонта.ПустаяСсылка"));
		Элементы.ПараметрыОповещенияПоСостояниямОР.ОтборСтрок = ОтборПараметровОповещений;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокИзмеряемыхПоказателейПередНачаломИзменения(Элемент, Отказ)
	
	ТабПоле = Элементы.СписокИзмеряемыхПоказателей;
	Если ТабПоле.ТекущиеДанные <> Неопределено 
		И НЕ ТабПоле.ТекущиеДанные.ЗначенияКонтролируемыхПоказателейИзОР
		И Элементы.СписокИзмеряемыхПоказателей.ТекущийЭлемент.Имя <> "СписокИзмеряемыхПоказателейЗначенияКонтролируемыхПоказателейИзОР" Тогда
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокИзмеряемыхПоказателейЗначенияКонтролируемыхПоказателейИзОРПриИзменении(Элемент)
	
	ТекДанные = Элементы.СписокИзмеряемыхПоказателей.ТекущиеДанные;
	Если ТекДанные.ЗначенияКонтролируемыхПоказателейИзОР Тогда
		ТекДанные.ИзТиповогоОР = Не ТекДанные.ЗначенияКонтролируемыхПоказателейИзОР;
	КонецЕсли;
	ТекДанные.ОбъектРемонта = Объект.Ссылка;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокИзмеряемыхПоказателейПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если НЕ (НоваяСтрока И ОтменаРедактирования) Тогда
		ТекДанные = Элемент.ТекущиеДанные;
		Если Не ЗначениеЗаполнено(ТекДанные.Показатель) Тогда
			ТекстСообщения = НСтр("es='Indiquen el índice controlado.';ru='Укажите контролируемый показатель.';en='Specify the target metric.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "СписокИзмеряемыхПоказателей[" + СписокИзмеряемыхПоказателей.Индекс(ТекДанные) + "].Показатель",, Отказ);
		ИначеЕсли СписокИзмеряемыхПоказателей.НайтиСтроки(Новый Структура("Показатель", ТекДанные.Показатель)).Количество() > 1 Тогда
			ШаблонСообщения = НСтр("ru = 'Выбранный показатель %1 уже имеется в списке!");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекДанные.Показатель);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
		Если ТекДанные.ЗначенияКонтролируемыхПоказателейИзОР Тогда
			ТекстСообщения = "";
			Если ТипЗнч(ТекДанные.КритическийМинимум) = Тип("Число") 
				И ТипЗнч(ТекДанные.ДопустимыйМинимум) = Тип("Число") 
				И ТипЗнч(ТекДанные.ДопустимыйМаксимум) = Тип("Число") 
				И ТипЗнч(ТекДанные.КритическийМаксимум) = Тип("Число") Тогда
				Если ТекДанные.КритическийМинимум > ТекДанные.ДопустимыйМинимум Тогда
					ТекстСообщения = ТекстСообщения + НСтр("es='¡El mínimo crítico supera el mínimo admisible! ';ru='Критический минимум превышает допустимый минимум! ';en='Critical minimum exceeds the allowable minimum! '");
				КонецЕсли;
				Если ТекДанные.ДопустимыйМинимум > ТекДанные.ДопустимыйМаксимум Тогда
					ТекстСообщения = ТекстСообщения + НСтр("es='¡El mínimo admisible supera el máximo admisible! ';ru='Допустимый минимум превышает допустимый максимум! ';en='Allowable minimum exceeds allowable maximum! '");
				КонецЕсли;
				Если ТекДанные.ДопустимыйМаксимум > ТекДанные.КритическийМаксимум Тогда
					ТекстСообщения = ТекстСообщения + НСтр("es='¡El máximo admisible supera el máximo crítico! ';ru='Допустимый максимум превышает критический максимум! ';en='Allowable maximum exceeds critical maximum! '");
				КонецЕсли;
			КонецЕсли;
			Если ТекстСообщения <> "" Тогда
				ТекстСообщения = ТекстСообщения + НСтр("es='¡Prueben redactar las fronteras de los significados admisibles!';ru='Попробуйте отредактировать границы допустимых значений!';en='Try editing the boundaries of the allowed values!'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			КонецЕсли;
		КонецЕсли;
			
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокИзмеряемыхПоказателейПередУдалением(Элемент, Отказ)
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если НЕ ТекДанные.ИзТиповогоОР Тогда
		
		МассивСтрок = ПараметрыОповещенияПоСостояниямОР.НайтиСтроки(Новый Структура("ОбъектРемонта,Показатель",Объект.Ссылка,ТекДанные.Показатель));
		Для Каждого СтрокаКУдалению Из МассивСтрок Цикл
			ПараметрыОповещенияПоСостояниямОР.Удалить(СтрокаКУдалению);
			МодифицированностьПараметровОповещенияОСостоянииОР = Истина;
		КонецЦикла;
		
		// Взамен удаленной добавим строку типового, если такая есть
		ДанныеПоказателяТипового = ПолучитьДанныеПоказателяТипового(ТекДанные.Показатель,Объект.ТиповойОР);
		Если ДанныеПоказателяТипового <> Неопределено Тогда
			Отказ = Истина;
			ЗаполнитьЗначенияСвойств(ТекДанные,ДанныеПоказателяТипового);
			МассивСтруктурПараметровОповещения = ПолучитьПараметрыОповещенияПоКонтролируемымПоказателям(ПредопределенноеЗначение("Справочник.торо_ОбъектыРемонта.ПустаяСсылка"), Объект.ТиповойОР);
			Для Каждого ПараметрыОповещения Из МассивСтруктурПараметровОповещения Цикл
				Если ПараметрыОповещения.Показатель = ТекДанные.Показатель И ПараметрыОповещения.ТиповойОР = Объект.ТиповойОР Тогда
					ЗаполнитьЗначенияСвойств(ПараметрыОповещенияПоСостояниямОР.Добавить(),ПараметрыОповещения);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	Иначе 
		Отказ = Истина;
		ТекДанные.Удален = НЕ ТекДанные.Удален;
		Если ТекДанные.Удален Тогда
			ТекДанные.ОбъектРемонта = Объект.Ссылка;
			УстановитьОтборНеИспользуемыхСтрок(Элементы.СписокИзмеряемыхПоказателейПоказыватьУдаленныеПоказатели.Пометка,"СписокИзмеряемыхПоказателей");
		Иначе
			ТекДанные.ОбъектРемонта = ПредопределенноеЗначение("Справочник.торо_ОбъектыРемонта.ПустаяСсылка");
		КонецЕсли;
	КонецЕсли;
	
	МодифицированностьИзмеряемыхПоказателей = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокИзмеряемыхПоказателейПоказательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокОтбора = Новый СписокЗначений();
	
	Для каждого Строка Из СписокИзмеряемыхПоказателей Цикл
		
		Если НЕ Строка.Удален Тогда
			СписокОтбора.Добавить(Строка.Показатель);
		КонецЕсли;
		
	КонецЦикла;
	
	
	ПараметрыФормыСтруктура = Новый Структура("КлючНазначенияИспользования, ЗакрыватьПриВыборе", "ОбъектыРемонта", Ложь);
	
	ФормаВыбораПоказателя = ПолучитьФорму("ПланВидовХарактеристик.торо_ИзмеряемыеПоказателиОбъектовРемонта.ФормаВыбора", ПараметрыФормыСтруктура, Элемент, Объект.Ссылка);
	ФормаВыбораПоказателя.ЗакрыватьПриВыборе = Истина;
	
	ФормаВыбораПоказателя.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура СписокИзмеряемыхПоказателейПоказательОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СписокПоказателейВТаблице = СписокИзмеряемыхПоказателей.НайтиСтроки(Новый Структура("Показатель", ВыбранноеЗначение));
	СтандартнаяОбработка = Ложь;
	Если СписокПоказателейВТаблице.Количество() = 0 Тогда
		
		ТекДанные = Элементы.СписокИзмеряемыхПоказателей.ТекущиеДанные;
		ПоказательДоИзменения = ТекДанные.Показатель;
		СтруктураЗначенийПолей = ПолучитьЗначенияКонтролируемыхПоказателей(ВыбранноеЗначение,Объект.Ссылка,Истина);
		СтруктураЗначенийПолей.Вставить("ОбъектРемонта", Объект.Ссылка);
		СтруктураЗначенийПолей.Вставить("Показатель"   , ВыбранноеЗначение);
		
		ЗаполнитьЗначенияСвойств(ТекДанные, СтруктураЗначенийПолей);
		
		МодифицированностьИзмеряемыхПоказателей = Истина;
	ИначеЕсли СписокПоказателейВТаблице.Количество() = 1 И СписокПоказателейВТаблице[0].Удален Тогда
		СписокИзмеряемыхПоказателей.Удалить(СписокПоказателейВТаблице[0]);
		Строка = Элементы.СписокИзмеряемыхПоказателей.ТекущиеДанные;
		СтруктураЗначенийПолей = ПолучитьЗначенияКонтролируемыхПоказателей(ВыбранноеЗначение,Объект.Ссылка,Истина);
		
		ЗаполнитьЗначенияСвойств(Строка, СтруктураЗначенийПолей);
		Строка.Показатель = ВыбранноеЗначение;
		Строка.ОбъектРемонта = Объект.Ссылка;
		Строка.ТиповойОР = ПредопределенноеЗначение("Справочник.торо_ТиповыеОР.ПустаяСсылка");
		Строка.ИзТиповогоОР = Ложь;
		Строка.Удален = Ложь;
		
		МодифицированностьИзмеряемыхПоказателей = Истина;
	Иначе
		ШаблонСообщения = НСтр("es='¡El índice escogido %1 hay ya en la lista!';ru='Выбранный показатель %1 уже имеется в списке!';en='The selected metric%1 is already in the list!'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ВыбранноеЗначение);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗначенияКонтролируемыхПоказателей

&НаКлиенте
Процедура ЗначенияКонтролируемыхПоказателейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПараметрыОповещенияПоСостояниямОР
&НаКлиенте
Процедура ПараметрыОповещенияПоСостояниямОРПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НЕ ОтменаРедактирования Тогда
		МодифицированностьПараметровОповещенияОСостоянииОР = Истина;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыОповещенияПоСостояниямОРПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекДанные = Элементы.СписокИзмеряемыхПоказателей.ТекущиеДанные;
		Если ТекДанные <> Неопределено Тогда
			Элемент.ТекущиеДанные.ОбъектРемонта = Объект.Ссылка;
			Элемент.ТекущиеДанные.Показатель = ТекДанные.Показатель;
			Элемент.ТекущиеДанные.ID = Новый УникальныйИдентификатор;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыОповещенияПоСостояниямОРПослеУдаления(Элемент)
	
	МодифицированностьПараметровОповещенияОСостоянииОР = Истина;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыОповещенияПоСостояниямОРПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Элементы.СписокИзмеряемыхПоказателей.ТекущиеДанные = Неопределено Тогда
		ТекстСообщения = НСтр("es='Escojan el índice controlado en la lista de los índices.';ru='Выберите контролируемый показатель в списке показателей.';en='Select a metric in the metric list.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,Отказ);
	ИначеЕсли Элементы.СписокИзмеряемыхПоказателей.ТекущиеДанные.ИзТиповогоОР Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокПараметровНаработки

&НаКлиенте
Процедура СписокПараметровНаработкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	// Запись данных до редактирования
	Если НЕ НоваяСтрока Тогда
		СтруктураКолонок = Новый Структура("Период, ОбъектРемонта, Показатель, ПлановаяНаработка, 
		|ПериодПлановойНаработки, ПродолжительностьПериодаПлановойНаработки, КоэффициентИспользованияОборудования");
		ЗаполнитьЗначенияСвойств(СтруктураКолонок, Элемент.ТекущиеДанные);
		СтруктураДанныхДоРедактирования.Вставить(Элемент.Имя,СтруктураКолонок);
	КонецЕсли;
	
	Если НоваяСтрока Тогда 
		
		Элемент.ТекущиеДанные.КоэффициентИспользованияОборудования = 1;
		Элемент.ТекущиеДанные.ПродолжительностьПериодаПлановойНаработки = 1;
		Элемент.ТекущиеДанные.ОбъектРемонта = Объект.Ссылка;
		
	ИначеЕсли ЗначениеЗаполнено(Элемент.ТекущиеДанные.ОбъектРемонта) 
		И Элемент.ТекущиеДанные.ОбъектРемонта <> Объект.Ссылка Тогда
		
		Элемент.ТекущиеДанные.Период = Объект.ДатаВводаВЭксплуатацию;
		Элемент.ТекущиеДанные.КоэффициентИспользованияОборудования = 1;
		Элемент.ТекущиеДанные.ПродолжительностьПериодаПлановойНаработки = 1;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СписокПараметровНаработкиПоказательПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокПараметровНаработки.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Период) Тогда
		НайденныеСтроки = СписокПараметровНаработки.НайтиСтроки(Новый Структура("Показатель", ТекущиеДанные.Показатель));
		Если НайденныеСтроки.Количество() = 1 Тогда 
			ТекущиеДанные.Период = Объект.ДатаВводаВЭксплуатацию;
		Иначе 
			ТекущиеДанные.Период = ТекущаяДата();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПараметровНаработкиПередУдалением(Элемент, Отказ)
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ДанныеНаработки = ТабВыработкиОбъектаРемонта.НайтиСтроки(Новый Структура("Показатель",ТекДанные.Показатель));
		Если ДанныеНаработки.Количество() > 0 Тогда
			ТекстСообщения = НСтр("es='No es posible quitar el índice, si por él es introducida ya la elaboración.';ru='Нельзя удалить показатель, если по нему уже введена наработка.';en='Can not delete a metric if you have already entered a run time for it.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			Возврат;
		КонецЕсли;
		
		НайденныеСтроки = СписокПараметровНаработки.НайтиСтроки(Новый Структура("ОбъектРемонта, Показатель", ТекДанные.ОбъектРемонта, ТекДанные.Показатель));
		Если НайденныеСтроки.Количество() = 1 Тогда
			НайденныеСтроки = ТабМаксимальныхЗначенийНаработки.НайтиСтроки(Новый Структура("ОбъектРемонта, Показатель", ТекДанные.ОбъектРемонта, ТекДанные.Показатель));
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				ТабМаксимальныхЗначенийНаработки.Удалить(НайденнаяСтрока);
			КонецЦикла;
			МодифицированностьМаксЗначНаработки = Истина;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СписокПараметровНаработкиПослеУдаления(Элемент)
	МодифицированностьПараметровНаработки = Истина;
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокПараметровНаработкиПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элементы.СписокПараметровНаработки.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		
		Если ТипЗнч(ТекДанные.ОбъектРемонта) = Тип ("СправочникСсылка.торо_ТиповыеОР") Тогда 
			Элементы.ТабВыработкиОбъектаРемонтаВводНаработки.Доступность = Ложь;
			Элементы.ТабВыработкиОбъектаРемонтаОбновитьЖурналНаработки.Доступность = Ложь;
			Элементы.ТабВыработкиОбъектаРемонтаОткрытьОтчетНаработкаОборудования.Доступность = Ложь;
		Иначе 
			Элементы.ТабВыработкиОбъектаРемонтаВводНаработки.Доступность = Истина;
			Элементы.ТабВыработкиОбъектаРемонтаОбновитьЖурналНаработки.Доступность = Истина;
			Элементы.ТабВыработкиОбъектаРемонтаОткрытьОтчетНаработкаОборудования.Доступность = Истина;
		КонецЕсли;
		
		Элементы.ТабВыработкиОбъектаРемонта.ОтборСтрок = Новый ФиксированнаяСтруктура("Показатель", ТекДанные.Показатель);
		
		СтруктураОтбора = Новый Структура("Показатель",ТекДанные.Показатель);
		Если НЕ Элементы.ТабМаксимальныхЗначенийНаработкиПоказыватьУдаленныеМаксЗначенияНаработки.Пометка Тогда
			СтруктураОтбора.Вставить("Удален", Ложь);
		КонецЕсли;
		Элементы.ТабМаксимальныхЗначенийНаработки.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураОтбора);
		МассивСтрок = ТабВыработкиОбъектаРемонта.НайтиСтроки(Новый Структура("Показатель",ТекДанные.Показатель));
		
		НаработкаАбсолютная  = 0;
		НаработкаПослеСброса = 0;
		
		Для каждого Строка Из МассивСтрок Цикл
			
			Наработка = ?(Строка.ВидДвижения = ВидДвиженияНакопления.Приход,1,-1) * Строка.Наработка;
			
			НаработкаПослеСброса = НаработкаПослеСброса + Наработка;
			Если Строка.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
				НаработкаАбсолютная = НаработкаАбсолютная + Наработка;
			КонецЕсли;
			
		КонецЦикла;
		ТекстПодвалаНаработки = Строка(НаработкаПослеСброса) + " / " + Строка(НаработкаАбсолютная);
	Иначе
		ТекстПодвалаНаработки = "0 / 0";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПараметровНаработкиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если НЕ ОтменаРедактирования Тогда
		
		Элемент.ТекущиеДанные.ОбъектРемонта = Объект.Ссылка;
		
		МодифицированностьПараметровНаработки = Истина;
		Модифицированность = Истина;
		
		Если ТипЗнч(Элемент.ТекущиеДанные.ОбъектРемонта) = Тип ("СправочникСсылка.торо_ТиповыеОР") Тогда 
			Элементы.ТабВыработкиОбъектаРемонтаВводНаработки.Доступность = Ложь;
			Элементы.ТабВыработкиОбъектаРемонтаОбновитьЖурналНаработки.Доступность = Ложь;
			Элементы.ТабВыработкиОбъектаРемонтаОткрытьОтчетНаработкаОборудования.Доступность = Ложь;
		Иначе 
			Элементы.ТабВыработкиОбъектаРемонтаВводНаработки.Доступность = Истина;
			Элементы.ТабВыработкиОбъектаРемонтаОбновитьЖурналНаработки.Доступность = Истина;
			Элементы.ТабВыработкиОбъектаРемонтаОткрытьОтчетНаработкаОборудования.Доступность = Истина;
		КонецЕсли;

		// Дополнительно, если имеются максимальные значения для параметра из типового -- проставляем ОР в нем.
		Если ЗначениеЗаполнено(Объект.ТиповойОР) Тогда
			Отбор = Новый Структура();
			Отбор.Вставить("Показатель", Элемент.ТекущиеДанные.Показатель);
			МассивСтрокМаксЗначенийНаработки = ТабМаксимальныхЗначенийНаработки.НайтиСтроки(Отбор);
			Для каждого Элем Из МассивСтрокМаксЗначенийНаработки Цикл
				Элем.ОбъектРемонта = Объект.Ссылка;
				МодифицированностьМаксЗначНаработки = Истина;	
			КонецЦикла; 
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПараметровНаработкиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекДанные = Элемент.ТекущиеДанные;
	ТекСтрока = Элемент.ТекущаяСтрока;
	ТекстОшибки = "";
	Если НЕ ОтменаРедактирования Тогда
		
		Если НЕ Объект.ЭтоГруппа Тогда 
			// проверка
			ИмяТЧ = "СписокПараметровНаработки";
			НомерСтроки = СписокПараметровНаработки.Индекс(Элемент.ДанныеСтроки(ТекСтрока)) + 1;
						
			Если ЗначениеЗаполнено(ТекДанные.Период) И ЗначениеЗаполнено(ТекДанные.Показатель) Тогда
				
				Строки = СписокПараметровНаработки.НайтиСтроки(Новый Структура("Период, Показатель",ТекДанные.Период, ТекДанные.Показатель));			
				
				Если Строки.Количество() > 1 Тогда
					ТекстОшибки = СтрШаблон(НСтр("es='El índice de la elaboración planificada para el período <%1> es dado ya en otra línea de la tabla.';ru='Показатель плановой наработки на период <%1> уже задан в другой строке таблицы.';en='The planned operating time indicator for the period <%1> is already set in another row of the table.'"),ТекДанные.Период); 
				КонецЕсли;

			КонецЕсли;
			
			Если ТекстОшибки <> "" Тогда
				#Если НЕ ВебКлиент Тогда
					Отказ = Истина;
				#КонецЕсли
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
			КонецЕсли;
			
			Если ТекДанные.Период < Объект.ДатаВыпуска Тогда
				ТекстСообщения = Нстр("es='La fecha de la introducción de la elaboración no puede ser menos de fechas de la salida.';ru='Дата ввода наработки не может быть меньше даты выпуска.';en='The input date for operating hours cannot be less than the release date.'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "СписокПараметровНаработки[" + ТекСтрока + "].Период");
				Отказ = Истина;
			КонецЕсли; 
		КонецЕсли;
		
	ИначеЕсли НЕ НоваяСтрока Тогда
		// возврат старых значений
		ЗаполнитьЗначенияСвойств(ТекДанные,СтруктураДанныхДоРедактирования[Элемент.Имя]);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПараметровНаработкиПериодПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокПараметровНаработки.ТекущиеДанные;
	ТекущаяСтрока = Элементы.СписокПараметровНаработки.ТекущаяСтрока;
	Если ТекущиеДанные <> Неопределено Тогда
		Если ТекущиеДанные.Период < Объект.ДатаВыпуска Тогда
			ТекстСообщения = Нстр("es='La fecha de la introducción de la elaboración no puede ser menos de fechas de la salida.';ru='Дата ввода наработки не может быть меньше даты выпуска.';en='The input date for operating hours cannot be less than the release date.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "СписокПараметровНаработки[" + ТекущаяСтрока + "].Период");
			СтандартнаяОбработка = Ложь;
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТабМаксимальныхЗначенийНаработки

&НаКлиенте
Процедура ТабМаксимальныхЗначенийНаработкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ТекДанные = Элементы.СписокПараметровНаработки.ТекущиеДанные;
	
	Если Не ТекДанные = Неопределено Тогда
		МассивСтрок = ТабМаксимальныхЗначенийНаработки.НайтиСтроки(Новый Структура("Показатель", ТекДанные.Показатель));
		Если МассивСтрок.Количество() > 0 Тогда
			ШаблонСообщения = НСтр("es='Para el índice de la elaboración <%1> es introducido ya su significado máximo o el recurso fijado.';ru='Для показателя наработки <%1> уже введено его максимальное значение или назначенный ресурс.';en='For operating time indicator <%1>, its maximum value or assigned resource has already been entered.'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекДанные.Показатель);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
	Иначе
		ТекстСообщения = НСтр("es='de la elaboración!';ru='Не выбран показатель наработки!';en='No operating time indicator selected!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ТабМаксимальныхЗначенийНаработкиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекДанные = Элементы.СписокПараметровНаработки.ТекущиеДанные;
	ТекСтрокаМаксимальногоЗначения = Элементы.ТабМаксимальныхЗначенийНаработки.ТекущиеДанные;
		
	Если Не ТекДанные = Неопределено 
		И Не ТекСтрокаМаксимальногоЗначения = Неопределено Тогда
		ТекСтрокаМаксимальногоЗначения.Показатель = ТекДанные.Показатель;
		ТекСтрокаМаксимальногоЗначения.ОбъектРемонта = Объект.Ссылка;
		Если ТекСтрокаМаксимальногоЗначения.МаксимальноеЗначение < 0 Тогда
			ТекстСообщения = НСтр("es='¡El significado máximo de la elaboración no puede ser negativo!';ru='Максимальное значение наработки не может быть отрицательным!';en='Maximum running hours cannot be negative!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабМаксимальныхЗначенийНаработкиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если Не ОтменаРедактирования Тогда
		МодифицированностьМаксЗначНаработки = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабМаксимальныхЗначенийНаработкиПослеУдаления(Элемент)
	МодифицированностьМаксЗначНаработки = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТабМаксимальныхЗначенийНаработкиПоказательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	МассивПараметровНаработки = Новый Массив;
	Для Каждого Строка Из СписокПараметровНаработки Цикл
		МассивПараметровНаработки.Добавить(Строка.Показатель);
	КонецЦикла;
	ПараметрыФормы = Новый Структура("СписокПараметровНаработки",МассивПараметровНаработки);
	Форма = ПолучитьФорму("Справочник.ПараметрыВыработкиОС.ФормаВыбора",ПараметрыФормы,Элемент);
	ОткрытьФорму(Форма);

КонецПроцедуры

&НаКлиенте
Процедура ТабМаксимальныхЗначенийНаработкиПоказательАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СписокЗначенийПараметровНаработки = Новый СписокЗначений;
	Для Каждого Строка Из СписокПараметровНаработки Цикл
		СписокЗначенийПараметровНаработки.Добавить(Строка.Показатель);
	КонецЦикла;
	
	ДанныеВыбора = СписокЗначенийПараметровНаработки;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабМаксимальныхЗначенийНаработкиПередУдалением(Элемент, Отказ)
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные.ОбъектРемонта = Объект.Ссылка Тогда
		
		// Взамен удаленной добавим строку типового, если такая есть
		ДанныеПоказателяТипового = ПолучитьДанныеМаксЗначенияНаработкиТипового(ТекДанные.Показатель,Объект.ТиповойОР);
		Если ДанныеПоказателяТипового <> Неопределено Тогда
			Отказ = Истина;
			ЗаполнитьЗначенияСвойств(ТекДанные,ДанныеПоказателяТипового);
		КонецЕсли;
		
	Иначе 
		Отказ = Истина;
		ТекДанные.Удален = НЕ ТекДанные.Удален;
		
		Если ТекДанные.Удален Тогда
			ТекДанные.ОбъектРемонта = Объект.Ссылка;
		Иначе
			ТекДанные.ОбъектРемонта = ПредопределенноеЗначение("Справочник.торо_ОбъектыРемонта.ПустаяСсылка");
		КонецЕсли;
		
		СписокПараметровНаработкиПриАктивизацииСтроки(Элементы.ТабМаксимальныхЗначенийНаработки);
	КонецЕсли;
	

	МодифицированностьМаксЗначНаработки = Истина;
		
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьУдаленныеМаксЗначенияНаработки(Команда)
	
	Элементы.ТабМаксимальныхЗначенийНаработкиПоказыватьУдаленныеМаксЗначенияНаработки.Пометка = НЕ Элементы.ТабМаксимальныхЗначенийНаработкиПоказыватьУдаленныеМаксЗначенияНаработки.Пометка;
	СписокПараметровНаработкиПриАктивизацииСтроки(Элементы.ТабМаксимальныхЗначенийНаработки);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеМаксЗначенияНаработкиТипового(Показатель,Типовой)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_МаксимальныеЗначенияНаработкиОР.ОбъектРемонта,
	               |	торо_МаксимальныеЗначенияНаработкиОР.Показатель,
	               |	торо_МаксимальныеЗначенияНаработкиОР.МаксимальноеЗначение,
	               |	торо_МаксимальныеЗначенияНаработкиОР.НазначенныйРесурс
	               |ИЗ
	               |	РегистрСведений.торо_МаксимальныеЗначенияНаработкиОР КАК торо_МаксимальныеЗначенияНаработкиОР
	               |ГДЕ
	               |	торо_МаксимальныеЗначенияНаработкиОР.ОбъектРемонта = &ТиповойОР
	               |	И торо_МаксимальныеЗначенияНаработкиОР.Показатель = &Показатель";
						
	Запрос.УстановитьПараметр("ТиповойОР",Типовой);
	Запрос.УстановитьПараметр("Показатель",Показатель);
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		СтруктураДляВозврата = Новый Структура("ОбъектРемонта,Показатель,МаксимальноеЗначение,НазначенныйРесурс,Удален");
		ЗаполнитьЗначенияСвойств(СтруктураДляВозврата,Выборка);
		СтруктураДляВозврата.Удален = Ложь;
		
		Возврат СтруктураДляВозврата;
		
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ТабМаксимальныхЗначенийНаработкиНазначенныйРесурсПриИзменении(Элемент)
	
	ОбновитьЗначенияИзноса(Элементы.ТабМаксимальныхЗначенийНаработки.ТекущиеДанные);
	
КонецПроцедуры	

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТабВыработкиОбъектаРемонта

&НаКлиенте
Процедура ТабВыработкиОбъектаРемонтаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекДанные = Элементы.ТабВыработкиОбъектаРемонта.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда
		Если ТипЗнч(ТекДанные.Регистратор) = Тип("ДокументСсылка.торо_УчетНаработкиОборудования") Тогда
			ИмяФормыДляОткрытия = "Документ.торо_УчетНаработкиОборудования.ФормаОбъекта";
		ИначеЕсли ТипЗнч(ТекДанные.Регистратор) = Тип("ДокументСсылка.торо_УстановкаПроизвольногоЗначенияНаработки") Тогда
			ИмяФормыДляОткрытия = "Документ.торо_УстановкаПроизвольногоЗначенияНаработки.ФормаОбъекта"; 
		Иначе
			ИмяФормыДляОткрытия = "Документ.торо_ВводНачальныхДанных.ФормаОбъекта";
		КонецЕсли; 
		ОткрытьФорму(ИмяФормыДляОткрытия, Новый Структура("Ключ", ТекДанные.Регистратор), ЭтаФорма,,,,Новый ОписаниеОповещения("ОбработкаВводаДокументаНаработки",ЭтаФорма));
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область НОРМАТИВЫ_ПЛАНИРОВАНИЯ

&НаКлиенте
Процедура СтраницыНормативыПланированияПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.СтраницаНормативныеРемонты Тогда
		
		ЗаполнитьНормативныеРемонты();
		
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаЗапчасти Тогда
		
		Если НЕ МодифицированностьЗапчастейОР Тогда
			СтруктураВозврата = ЗаполнитьТабЗапчастейОбъектовРемонта(Параметры.Ключ);
			Если СтруктураВозврата.Свойство("Запчасти") Тогда
				
				ТабЗапчастейОбъектовРемонта.Очистить();
				Для Каждого Стр Из СтруктураВозврата.Запчасти Цикл
					
					НС = ТабЗапчастейОбъектовРемонта.Добавить();
					ЗаполнитьЗначенияСвойств(НС,Стр);
					НС.ХарактеристикиИспользуются = торо_НоменклатураСервер.ПолучитьХарактеристикиИспользуются(НС.Номенклатура);
					
				КонецЦикла;
				
			КонецЕсли;
			Если СтруктураВозврата.Свойство("НормаЗапчастей") Тогда
				
				ТабЗатратПоВидамРемонта.Очистить();
				Для Каждого Стр Из СтруктураВозврата.НормаЗапчастей Цикл
					
					НС = ТабЗатратПоВидамРемонта.Добавить();
					ЗаполнитьЗначенияСвойств(НС,Стр);
					
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
		
		МассивВозврата = ЗаполнитьИсториюЗапчастейОРНаСервере(Объект.Ссылка);
		Для Каждого Стр ИЗ МассивВозврата Цикл
			
			НС = ТабИсторииЗаменыЗЧ.Добавить();
			ЗаполнитьЗначенияСвойств(НС,Стр);
			
		КонецЦикла;
		
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаОценкаРМ Тогда
		
		Если НЕ ТаблицаОценокРММодифицированность Тогда
			МассивВозврата = ПрочитатьОценкиРМ(Объект.Ссылка, Объект.ТиповойОР);
			
			РСНЗТаблицаОценокРМ.Очистить();
			
			Для каждого Элем Из МассивВозврата Цикл
				
				НС = РСНЗТаблицаОценокРМ.Добавить();
				ЗаполнитьЗначенияСвойств(НС, Элем);
				
			КонецЦикла;
			
			ОбновитьОценкиРМ(Элементы.ТаблицаОценокРМОтображатьИсторию.Пометка);
		КонецЕсли;
		
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаКоэффициентыРемонтныхОсобенностей Тогда
		
		ОбновитьКоэффициентыРемонтныхОсобенностей();
		
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаФиксированныеРемонтныеЦиклы Тогда
		
		// Цепочки
		Если НЕ МодифицированностьРемЦиклов Тогда
			МассивЦепочек = ОбновитьФиксированныеРемонтныеЦиклы(Объект.Ссылка, Объект.ТиповойОР);
			
			ТабличноеПолеРемонтныеЦиклыОборудования.Очистить();
			РемЦиклыОборудования.Очистить();
			
			Для каждого Элем Из МассивЦепочек Цикл
				
				НС = ТабличноеПолеРемонтныеЦиклыОборудования.Добавить();
				ЗаполнитьЗначенияСвойств(НС, Элем);
				
				НС = РемЦиклыОборудования.Добавить();
				ЗаполнитьЗначенияСвойств(НС, Элем);
				
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаВизуализацияРемонтногоЦикла Тогда
		
		Если МодифицированностьНормРемонтов ИЛИ МодифицированностьЗамещаемыхРемонтов ИЛИ МодифицированностьПредшествующихРемонтов ИЛИ НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		//	ПоказатьВопрос(Новый ОписаниеОповещения("ПанельОРПриСменеСтраницыЗавершение", ЭтотОбъект, Новый Структура("ТекущаяСтраница, Элемент", ТекущаяСтраница, Элемент)), НСтр("es='Para la continuación es necesario anotar la información sobre el objeto. ¿Anotar?';ru='Для продолжения необходимо записать информацию об объекте. Записать?';en='To continue, you must record information about the object. To record?'"), РежимДиалогаВопрос.ДаНет);
			
			Элементы.Перерасчитать.Доступность 	= Ложь;
			Элементы.Построить.Доступность 		= Ложь;
			Элементы.Настройки.Доступность 		= Ложь;
			
			ВРНачалоЦикла = Неопределено;
			торо_РаботаСМнемосхемами.мнс_СоздатьЧистуюКарту(ПолеМнемосхемы);
			ОчиститьПолеТабличногоДокумента();
			Декорация1			= "";
			Возврат;   
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ВидыРемонтаЗаполненные = ЗаполнитьВидыРемонтаНаСервере();
			МассивРемонтов = Новый Массив;
			Для каждого Ремонт Из ЗапланированныеРемонты Цикл
				МассивРемонтов.Добавить(Ремонт);	
			КонецЦикла;	
			Для каждого РемонтТекущий из МассивРемонтов Цикл
				Если НормативныеРемонты.НайтиСтроки(Новый Структура("ВидРемонта", РемонтТекущий.ВидРемонтныхРабот)).Количество() = 0 Тогда	
					ЗапланированныеРемонты.Удалить(ЗапланированныеРемонты.Индекс(РемонтТекущий));	
				КонецЕсли;
			КонецЦикла;
			Для каждого РемонтТекущий из ВидыРемонтаЗаполненные Цикл
				Если ЗапланированныеРемонты.НайтиСтроки(Новый Структура("ВидРемонтныхРабот", РемонтТекущий.Значение)).Количество() = 0 Тогда
					НС = ЗапланированныеРемонты.Добавить();
					НС.ВидРемонтныхРабот = РемонтТекущий.Значение;
					НС.Цвет = Новый Цвет(255, 255, 255);
					НС.ЦветТекста = Новый Цвет(0, 0, 0);
					НС.Выбран = Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли ТекущаяСтраница = Элементы.ОсновноеИЗависимоеОборудование Тогда
		
		Если Не МодифицированностьОсновныхЗависимых Тогда
			Если Не ВкладкаОсновноеЗависимоеОткрывалась Тогда
				ИнициализироватьОсновноеЗависимоеОборудование();
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВРНачалоЦиклаПриИзменении(Элемент)
	
	Если НЕ ВРНачалоЦикла = ПредопределенноеЗначение("Справочник.торо_ВидыРемонтов.ПустаяСсылка") Тогда
		Элементы.Перерасчитать.Доступность 	= Истина;
		Элементы.Построить.Доступность 		= Истина;
		Элементы.Настройки.Доступность 		= Истина;
	Иначе 
		Элементы.Перерасчитать.Доступность 	= Ложь;
		Элементы.Построить.Доступность 		= Ложь;
		Элементы.Настройки.Доступность 		= Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВРНачалоЦиклаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтраница = Элементы.ПанельОР.ТекущаяСтраница;
	
	Если МодифицированностьНормРемонтов ИЛИ НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		//ПоказатьВопрос(Новый ОписаниеОповещения("ПанельОРПриСменеСтраницыЗавершение", ЭтотОбъект, Новый Структура("ТекущаяСтраница, Элемент", ТекущаяСтраница, Элемент)), НСтр("es='Para la continuación es necesario anotar la información sobre el objeto. ¿Anotar?';ru='Для продолжения необходимо записать информацию об объекте. Записать?';en='To continue, you must record information about the object. To record?'"), РежимДиалогаВопрос.ДаНет);
		ДопПараметры = Новый Структура("ТекущаяСтраница", ТекущаяСтраница);
		ОписаниеОповещения = Новый ОписаниеОповещения("ВРНачалоЦиклаНачалоВыбора_ПослеВопросаОЗаписи", ЭтотОбъект, ДопПараметры);
		ПоказатьВопрос(ОписаниеОповещения, НСтр("es='Para la continuación es necesario anotar la información sobre el objeto. ¿Anotar?';ru='Для продолжения необходимо записать информацию об объекте. Записать?';en='To continue, you must record information about the object. To record?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		
		Если НормативныеРемонты.Количество() = 0 Тогда 
			ЗаполнитьНормативныеРемонты();
		КонецЕсли;
		
		СписокЗначВР = Новый СписокЗначений;
		Для каждого Элем Из НормативныеРемонты Цикл
			Если НЕ Элем.Удален И СписокЗначВР.НайтиПоЗначению(Элем.ВидРемонта) = Неопределено Тогда
				СписокЗначВР.Добавить(Элем.ВидРемонта);
			КонецЕсли;
		КонецЦикла;
		
		Если СписокЗначВР.Количество() > 0 Тогда
			СписокЗначВР.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ВРНачалоЦиклаНачалоВыбораВыборИзСписка", ЭтаФорма, Новый Структура("Элемент", Элемент)), НСтр("es='Escojan el tipo de la reparación';ru='Выберите вид ремонта';en='Choose type of repair'"));
		Иначе
			ТекстСообщения = НСтр("es='¡Las reparaciones normativas faltan!';ru='Нормативные ремонты отсутствуют!';en='No normative repairs!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеМнемосхемыВыбор(Элемент)
	
	Если НЕ Элемент.ТекущийЭлемент = Неопределено Тогда
		Масс = СоответствиеИндексаИНомераКолонки.НайтиСтроки(Новый Структура("ТекЭлементИмя", Элемент.ТекущийЭлемент.Имя));
		Если Масс.Количество() = 0 Тогда
			Масс = СоответствиеИндексаИНомераКолонки.НайтиСтроки(Новый Структура("ТекЭлементИмя", Элемент.ТекущийЭлемент.КонецЭлемент.Имя));
			СтруктураНомерКолонкиСдвиг = Масс[0];
		Иначе
			СтруктураНомерКолонкиСдвиг = Масс[0];
		КонецЕсли;
		НомерКолонки = СтруктураНомерКолонкиСдвиг.НомерКолонки;
		СдвигСтрок = СтруктураНомерКолонкиСдвиг.СдвигСтрок;
		ИндексСтроки = 9 + КолонкиНаработки.Количество();
		Элементы.ПолеТД.ТекущаяОбласть = ПолеТД.Область(3+СдвигСтрок,НомерКолонки,6 + ИндексСтроки - 7+СдвигСтрок);
		ЭтаФорма.ТекущийЭлемент = Элементы.ПолеТД;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборОсновногоЗависимогоПриИзменении(Элемент)
	
	// Сначала необходимо сохранить текущие настройки в ТЗ.
	СохранитьДанныеИзЭлементовФормы(ЭтаФорма);
	УстановитьКоличествоОсновногоЗависимогоОборудования();
	
	ВыбраноОсновное = (ВыборОсновногоЗависимого = "Основное");
	
	УстановитьВидимостьЭлементовФормыОсновноеЗависимое();
	ЗаполнитьОсновныеИЗависимыеРемонтыНаФорме();
	
КонецПроцедуры

#Область ОбработчикиСобытийЭлементовТаблицыФормыНормативныеРемонты

&НаКлиенте
Процедура НормативныеРемонтыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если НЕ ОтменаРедактирования Тогда
		МодифицированностьНормРемонтов = Истина;
		ТекДанные = Элемент.ТекущиеДанные;
		
		Если НоваяСтрока Тогда
			// переопределим предшествующие ремонты
			СтрокиПредшРемонтов = ПредшествующиеРемонты.НайтиСтроки(Новый Структура("ТиповойОР, ВидРемонта", ТекДанные.ТиповойОР, ТекДанные.ВидРемонта));
			Если СтрокиПредшРемонтов.Количество() Тогда
				Для Каждого Строка Из СтрокиПредшРемонтов Цикл
					НС = ПредшествующиеРемонты.Добавить();
					ЗаполнитьЗначенияСвойств(НС, Строка);
					НС.ТиповойОР = ПредопределенноеЗначение("Справочник.торо_ТиповыеОР.ПустаяСсылка");
				КонецЦикла;
			Иначе 
				НС = ПредшествующиеРемонты.Добавить();
				НС.ВидРемонта = ТекДанные.ВидРемонта;
				НС.ПредшествующийВидРемонта = ТекДанные.ВидРемонта;
				НС.ТиповойОР = ПредопределенноеЗначение("Справочник.торо_ТиповыеОР.ПустаяСсылка");
			КонецЕсли;
			
			// переопределим замещаемые ремонты
			СтрокиЗамещРемонтов = ЗамещаемыеРемонты.НайтиСтроки(Новый Структура("ТиповойОР, ВидРемонта", ТекДанные.ТиповойОР, ТекДанные.ВидРемонта));
			Для Каждого Строка Из СтрокиЗамещРемонтов Цикл
				НС = ЗамещаемыеРемонты.Добавить();
				ЗаполнитьЗначенияСвойств(НС, Строка);
				НС.ТиповойОР = ПредопределенноеЗначение("Справочник.торо_ТиповыеОР.ПустаяСсылка");
			КонецЦикла;
			Если СтрокиЗамещРемонтов.Количество() Тогда
				МодифицированностьЗамещаемыхРемонтов = Истина;
			КонецЕсли;
			
			МодифицированностьПредшествующихРемонтов = Истина;
			
			Если ЗапланированныеРемонты.НайтиСтроки(Новый Структура("ВидРемонтныхРабот",ТекДанные.ВидРемонта)).Количество() = 0 Тогда
				НС = ЗапланированныеРемонты.Добавить();
				НС.ВидРемонтныхРабот = ТекДанные.ВидРемонта;
				НС.Цвет = Новый Цвет(255, 255, 255);
				НС.ЦветТекста = Новый Цвет(0, 0, 0);
				НС.Выбран = Истина;
			КонецЕсли;
			
		Иначе
			
			СтарыйВидРемонта = СтруктураДанныхДоРедактирования[Элемент.Имя].ВидРемонта;
			СтрокиЗапланированныхРемонтов = ЗапланированныеРемонты.НайтиСтроки(Новый Структура("ВидРемонтныхРабот", СтарыйВидРемонта)); 
			Для каждого Строка из СтрокиЗапланированныхРемонтов Цикл
				Строка.ВидРемонтныхРабот = ТекДанные.ВидРемонта;
				Строка.Цвет = Новый Цвет(255, 255, 255);
				Строка.ЦветТекста = Новый Цвет(0, 0, 0);
				Строка.Выбран = Истина;
			КонецЦикла;
		КонецЕсли;
		
		НормативныеРемонтыПриАктивизацииСтроки(Элементы.НормативныеРемонты);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НормативныеРемонтыПослеУдаления(Элемент)
	МодифицированностьНормРемонтов = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НормативныеРемонтыПередНачаломИзменения(Элемент, Отказ)
	
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ТиповойОР) Тогда	
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НормативныеРемонтыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекДанные = Элемент.ТекущиеДанные;
		
	Если Копирование Тогда
		
		ТекДанные.ТиповойОР = ПредопределенноеЗначение("Справочник.торо_ТиповыеОР.ПустаяСсылка");
		ТекДанные.ВидРемонта = ПредопределенноеЗначение("Справочник.торо_ВидыРемонтов.ПустаяСсылка");
		МодифицированностьНормРемонтов = Истина;
		
	ИначеЕсли НоваяСтрока Тогда
		
		ТекДанные.ГрафикРемонтныхРабот = ПолучитьЗначениеГрафикаРемРаботНаСервере();
			
		ТекДанные.СпособВыполнения = ПредопределенноеЗначение("Перечисление.СпособыСтроительства.Хозспособ");
			
		ТекДанные.СпособУчетаДатыОтсчета = ПредопределенноеЗначение("Перечисление.торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот.ИспользоватьДатуВводаВЭксплуатацию");
		
		МодифицированностьНормРемонтов = Истина;
			
	КонецЕсли;
	
	// Запись данных до редактирования
	Если НЕ НоваяСтрока Тогда
		торо_СобытияФормКлиент.ПриНачалеРедактирования(Элемент,СтруктураДанныхДоРедактирования,Элемент.ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НормативныеРемонтыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	ТекДанные = Элемент.ТекущиеДанные;
	
	Если НЕ ОтменаРедактирования Тогда
		
		МассивСтрок = НормативныеРемонты.НайтиСтроки(Новый Структура("ТиповойОР, ВидРемонта", ТекДанные.ТиповойОР, ТекДанные.ВидРемонта));
		Если МассивСтрок.Количество() > 1 Тогда
			ТекстСообщения = НСтр("es='¡El tipo dado de la reparación es añadido ya!';ru='Данный вид ремонта уже добавлен!';en='This type of repair has already been added!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ТекДанные.ВидРемонта) Тогда
			ТекстСообщения = НСтр("es='¡Escojan el tipo de la reparación!';ru='Выберите вид ремонта!';en='Choose the type of repair!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
		Если Не Отказ И Не НоваяСтрока И  СтруктураДанныхДоРедактирования[Элемент.Имя] <> Неопределено
			И СтруктураДанныхДоРедактирования[Элемент.Имя].ВидРемонта <> ТекДанные.ВидРемонта Тогда
			СтарыйВР = СтруктураДанныхДоРедактирования[Элемент.Имя].ВидРемонта;
			НайденныеСтроки = ПредшествующиеРемонты.НайтиСтроки(Новый Структура("ВидРемонта, ТиповойОР", СтарыйВР, ПредопределенноеЗначение("Справочник.торо_ТиповыеОР.ПустаяСсылка")));
			Для Каждого Найденная Из НайденныеСтроки Цикл
				Найденная.ВидРемонта = ТекДанные.ВидРемонта;
			КонецЦикла;
			НайденныеСтроки = ПредшествующиеРемонты.НайтиСтроки(Новый Структура("ПредшествующийВидРемонта, ТиповойОР", СтарыйВР, ПредопределенноеЗначение("Справочник.торо_ТиповыеОР.ПустаяСсылка")));
			Для Каждого Найденная Из НайденныеСтроки Цикл
				Найденная.ПредшествующийВидРемонта = ТекДанные.ВидРемонта;
			КонецЦикла;
			НайденныеСтроки = ЗамещаемыеРемонты.НайтиСтроки(Новый Структура("ВидРемонта, ТиповойОР", СтарыйВР, ПредопределенноеЗначение("Справочник.торо_ТиповыеОР.ПустаяСсылка")));
			Для Каждого Найденная Из НайденныеСтроки Цикл
				Найденная.ВидРемонта = ТекДанные.ВидРемонта;
			КонецЦикла;
			НайденныеСтроки = ЗамещаемыеРемонты.НайтиСтроки(Новый Структура("ЗамещаемыйВидРемонта, ТиповойОР", СтарыйВР, ПредопределенноеЗначение("Справочник.торо_ТиповыеОР.ПустаяСсылка")));
			Для Каждого Найденная Из НайденныеСтроки Цикл
				Найденная.ЗамещаемыйВидРемонта = ТекДанные.ВидРемонта;
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли Не НоваяСтрока Тогда
		// возврат старых значений
		ЗаполнитьЗначенияСвойств(ТекДанные,СтруктураДанныхДоРедактирования[Элемент.Имя]);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НормативныеРемонтыПриАктивизацииСтроки(Элемент)
	Если НЕ Элементы.НормативныеРемонты.ТекущиеДанные = Неопределено Тогда
		ПараметрыОтбора = Новый ФиксированнаяСтруктура("ВидРемонта, ТиповойОР", Элементы.НормативныеРемонты.ТекущиеДанные.ВидРемонта, Элементы.НормативныеРемонты.ТекущиеДанные.ТиповойОР);
		Элементы.ПредшествующиеРемонты.ОтборСтрок = ПараметрыОтбора;
		Элементы.ЗамещаемыеРемонты.ОтборСтрок = ПараметрыОтбора;
		
		Если ЗначениеЗаполнено(Элементы.НормативныеРемонты.ТекущиеДанные.ТиповойОР) Тогда
			ЗапретРедактированияНормРемонтов = ЗначениеЗаполнено(Элементы.НормативныеРемонты.ТекущиеДанные.ТиповойОР);
		Иначе
			ЗапретРедактированияНормРемонтов = Ложь;
		КонецЕсли;
		
		
		Элементы.ГрафикРемонтныхРабот.ТолькоПросмотр = ЗапретРедактированияНормРемонтов;
		Элементы.СпособВыполнения.ТолькоПросмотр = ЗапретРедактированияНормРемонтов;
		Элементы.СпособУчетаДатыОтсчета.ТолькоПросмотр = ЗапретРедактированияНормРемонтов;
		Элементы.УчитыватьПростоиОборудования.ТолькоПросмотр = ЗапретРедактированияНормРемонтов;
		Элементы.НеИспользоватьВПланировании.ТолькоПросмотр = ЗапретРедактированияНормРемонтов;
		Элементы.НеУчитыватьПриПланированииГрафикРаботОборудования.ТолькоПросмотр = ЗапретРедактированияНормРемонтов;
		Элементы.НеУчитыватьПриПланированииГрафикРемонтныхРабот.ТолькоПросмотр = ЗапретРедактированияНормРемонтов;
		Элементы.НеУчитыватьПродолжительность.ТолькоПросмотр = ЗапретРедактированияНормРемонтов;
		Элементы.ИспользоватьКоэффициентыРемонтныхОсобенностей.ТолькоПросмотр = ЗапретРедактированияНормРемонтов;
		Элементы.НормативныеРемонтыНеИспользоватьВПланированииДатуВводаВЭксплуатацию.ТолькоПросмотр = ЗапретРедактированияНормРемонтов;
		Элементы.НормативныеРемонтыРазрешитьСокращатьМежремонтныйПериодПриПланировании.ТолькоПросмотр = ЗапретРедактированияНормРемонтов;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НормативныеРемонтыПередУдалением(Элемент, Отказ)
	
	ТекДанные = Элемент.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекДанные.ТиповойОР) Тогда
		
		Отказ = Истина;
		Если НЕ ТекДанные.Удален Тогда
		
			СтруктураСвязанныхСтрок = НайтиСвязанныеСтроки(ТекДанные.ВидРемонта,ТекДанные.ТиповойОР);
			ТекстВопроса = "";
			Если СтруктураСвязанныхСтрок.МассивУдаляемыхСтрокПредшествующиеРемонты.Количество() > 0 Тогда
				ТекстВопроса = ТекстВопроса + НСтр("es='"
"	- Las reparaciones que preceden';ru='"
"	- Предшествующие ремонты';en='"
"	- Preceding repairs'");
			КонецЕсли;
			
			Если СтруктураСвязанныхСтрок.МассивУдаляемыхСтрокЗамещаемыеРемонты.Количество() > 0 Тогда
				ТекстВопроса = ТекстВопроса + НСтр("es='"
"	- Las reparaciones sustituidas';ru='"
"	- Замещаемые ремонты';en='"
"	- Replaceable repairs'");
			КонецЕсли;
			
			Если СтруктураСвязанныхСтрок.МассивУдаляемыхСтрокТабЗатратПоВидамРемонта.Количество() > 0 Тогда
				ТекстВопроса = ТекстВопроса + НСтр("es='"
"	- Los gastos normativos a ТОиР';ru='"
"	- Нормативные затраты при ТОиР';en='"
"	- Standard expenses during maintenance and repairs'");
			КонецЕсли;
			
			Если СтруктураСвязанныхСтрок.МассивУдаляемыхСтрокРМ.Количество() > 0 Тогда
				ТекстВопроса = ТекстВопроса + НСтр("es='"
"	- La apreciación РМ';ru='"
"	- Оценка РМ';en='"
"	- Risk management assessment'");
			КонецЕсли;
			
			Если ЕстьОсновноеЗависимоеОборудованиеПоВидуРемонта(ТекДанные.ВидРемонта) Тогда
				ТекстВопроса = ТекстВопроса + НСтр("es='"
"	- Los tipos de la reparación para el ajuste de la maquinaria básica y dependiente de las reparaciones de parada';ru='"
"	- Виды ремонта для настройки основного и зависимого оборудования остановочных ремонтов';en='"
"	- Repair types for setting Main and dependent equipment of stopping repairs'");
			КонецЕсли;
						
			Если ТекстВопроса <> "" Тогда
				ТекстВопроса = СтрШаблон(НСтр("es='El tipo escogido de la reparación se usa en las tablas: el %1 "
"a la desaparición del tipo de la reparación, las líneas vinculadas en estas tablas serán quitadas. ¿Continuar?';ru='Выбранный вид ремонта используется в таблицах:%1"
"При удалении вида ремонта, связанные строки в этих таблицах будут удалены. Продолжить?';en='The selected repair type is used in the tables:% 1"
"When a repair type is deleted, the related rows in these tables will be deleted. Continue?'"),ТекстВопроса);
				СтруктураСвязанныхСтрок.Вставить("ТекДанные",ТекДанные);
				ПоказатьВопрос(Новый ОписаниеОповещения("НормативныеРемонтыПередУдалениемЗавершение",ЭтаФорма,СтруктураСвязанныхСтрок),ТекстВопроса,РежимДиалогаВопрос.ДаНет);
			Иначе
				ТекДанные.Удален = НЕ ТекДанные.Удален;
				Для Каждого Элем Из СтруктураСвязанныхСтрок.МассивУдаляемыхСтрокЗапланированныеРемонты Цикл
					ЗапланированныеРемонты.Удалить(Элем);
				КонецЦикла;
				УстановитьОтборНеИспользуемыхСтрок(Элементы.НормативныеРемонтыПоказыватьУдаленныеНормативы.Пометка,"НормативныеРемонты");
				МодифицированностьНормРемонтов = Истина;
			КонецЕсли;
		Иначе
			ТекДанные.Удален = Ложь;
			МодифицированностьНормРемонтов = Истина;
		КонецЕсли;
			
	Иначе
		
		СтруктураСвязанныхСтрок = НайтиСвязанныеСтроки(ТекДанные.ВидРемонта,ТекДанные.ТиповойОР);
		
		ТекстВопроса = "";
		Если СтруктураСвязанныхСтрок.МассивУдаляемыхСтрокПредшествующиеРемонты.Количество() > 0 Тогда
			ТекстВопроса = ТекстВопроса + НСтр("es='"
"	- Las reparaciones que preceden';ru='"
"	- Предшествующие ремонты';en='"
"	- Preceding repairs'");
		КонецЕсли;
		
		Если СтруктураСвязанныхСтрок.МассивУдаляемыхСтрокЗамещаемыеРемонты.Количество() > 0 Тогда
			ТекстВопроса = ТекстВопроса + НСтр("es='"
"	- Las reparaciones que preceden';ru='"
"	- Предшествующие ремонты';en='"
"	- Preceding repairs'");
		КонецЕсли;
		
		Если СтруктураСвязанныхСтрок.МассивУдаляемыхСтрокТабЗатратПоВидамРемонта.Количество() > 0 Тогда
			ТекстВопроса = ТекстВопроса + НСтр("es='"
"	- Los gastos normativos a ТОиР';ru='"
"	- Нормативные затраты при ТОиР';en='"
"	- Standard expenses during maintenance and repairs'");
		КонецЕсли;
		
		Если СтруктураСвязанныхСтрок.МассивУдаляемыхСтрокТабЗатратПоВидамРемонта.Количество() > 0 Тогда
			ТекстВопроса = ТекстВопроса + НСтр("es='"
"	- Los gastos normativos a ТОиР';ru='"
"	- Нормативные затраты при ТОиР';en='"
"	- Standard expenses during maintenance and repairs'");
		КонецЕсли;
		
		Если СтруктураСвязанныхСтрок.МассивУдаляемыхСтрокРМ.Количество() > 0 Тогда
			ТекстВопроса = ТекстВопроса + НСтр("es='"
"	- La apreciación РМ';ru='"
"	- Оценка РМ';en='"
"	- Risk management assessment'");
		КонецЕсли;
		
		Если ЕстьОсновноеЗависимоеОборудованиеПоВидуРемонта(ТекДанные.ВидРемонта) Тогда
			ТекстВопроса = ТекстВопроса + НСтр("es='"
"	- Los tipos de la reparación para el ajuste de la maquinaria básica y dependiente de las reparaciones de parada';ru='"
"	- Виды ремонта для настройки основного и зависимого оборудования остановочных ремонтов';en='"
"	- Repair types for setting Main and dependent equipment of stopping repairs'");
		КонецЕсли;
		
		Если ТекстВопроса <> "" Тогда
			ТекстВопроса = СтрШаблон(НСтр("es='El tipo escogido de la reparación se usa en las tablas: el %1 "
"a la desaparición del tipo de la reparación, las líneas vinculadas en estas tablas serán quitadas. ¿Continuar?';ru='Выбранный вид ремонта используется в таблицах:%1"
"При удалении вида ремонта, связанные строки в этих таблицах будут удалены. Продолжить?';en='The selected repair type is used in the tables:% 1"
"When a repair type is deleted, the related rows in these tables will be deleted. Continue?'"),ТекстВопроса);
			Отказ = Истина;
			СтруктураСвязанныхСтрок.Вставить("ТекДанные",ТекДанные);
			ПоказатьВопрос(Новый ОписаниеОповещения("НормативныеРемонтыПередУдалениемЗавершение",ЭтаФорма,СтруктураСвязанныхСтрок),ТекстВопроса,РежимДиалогаВопрос.ДаНет);
		Иначе
			Для Каждого Элем Из СтруктураСвязанныхСтрок.МассивУдаляемыхСтрокЗапланированныеРемонты Цикл
				ЗапланированныеРемонты.Удалить(Элем);
			КонецЦикла;
			МодифицированностьНормРемонтов = Истина;
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НормативныеРемонтыНормативныйРемонтНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("Справочник.торо_ИдентификаторыТехКарт.ФормаВыбора", Новый Структура("ОтборПоСтатусам", ПредопределенноеЗначение("Перечисление.торо_СтатусыНормативныхРемонтовИТехКарт.Действует")), Элемент);
		
КонецПроцедуры

&НаКлиенте
Процедура ГрафикРемонтныхРаботПриИзменении(Элемент)
	МодифицированностьНормРемонтов = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СпособВыполненияПриИзменении(Элемент)
	МодифицированностьНормРемонтов = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СпособУчетаДатыОтсчетаПриИзменении(Элемент)
	МодифицированностьНормРемонтов = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НеИспользоватьВПланированииПриИзменении(Элемент)
	МодифицированностьНормРемонтов = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НеУчитыватьПриПланированииГрафикРаботОборудованияПриИзменении(Элемент)
	МодифицированностьНормРемонтов = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НеУчитыватьПриПланированииГрафикРемонтныхРаботПриИзменении(Элемент)
	МодифицированностьНормРемонтов = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НеУчитыватьПродолжительностьПриИзменении(Элемент)
	МодифицированностьНормРемонтов = Истина;
КонецПроцедуры

&НаКлиенте
Процедура УчитыватьПростоиОборудованияПриИзменении(Элемент)
	МодифицированностьНормРемонтов = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьКоэффициентыРемонтныхОсобенностейПриИзменении(Элемент)
	МодифицированностьНормРемонтов = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НормативныеРемонтыНеИспользоватьВПланированииДатуВводаВЭксплуатациюПриИзменении(Элемент)
	МодифицированностьНормРемонтов = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НормативныеРемонтыРазрешитьСокращатьМежремонтныйПериодПриПланированииПриИзменении(Элемент)
	МодифицированностьНормРемонтов = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПредшествующиеРемонты
&НаКлиенте
Процедура ПредшествующиеРемонтыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если Элементы.НормативныеРемонты.ТекущиеДанные = Неопределено Тогда
		ТекстСообщения = НСтр("es='la reparación normativa!';ru='Не указан нормативный ремонт!';en='No regulatory repair specified!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	ИначеЕсли ЗначениеЗаполнено(Элементы.НормативныеРемонты.ТекущиеДанные.ТиповойОР) Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПредшествующиеРемонтыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элементы.ПредшествующиеРемонты.ТекущиеДанные.ВидРемонта = Элементы.НормативныеРемонты.ТекущиеДанные.ВидРемонта;
	КонецЕсли;
	
	// Запись данных до редактирования
	Если НЕ НоваяСтрока Тогда
		торо_СобытияФормКлиент.ПриНачалеРедактирования(Элемент,СтруктураДанныхДоРедактирования,Элемент.ТекущиеДанные);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПредшествующиеРемонтыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если не ОтменаРедактирования Тогда
		МодифицированностьПредшествующихРемонтов = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПредшествующиеРемонтыПослеУдаления(Элемент)
	МодифицированностьПредшествующихРемонтов = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПредшествующиеРемонтыПередНачаломИзменения(Элемент, Отказ)
	
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ТиповойОР) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредшествующиеРемонтыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	ТекДанные = Элемент.ТекущиеДанные;
	Если НЕ ОтменаРедактирования Тогда
		Если Не ЗначениеЗаполнено(ТекДанные.ПредшествующийВидРемонта) Тогда
			ТекстСообщения = НСтр("es='Indiquen el tipo que precede de la reparación.';ru='Укажите предшествующий вид ремонта.';en='Specify the previous type of repair.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
		МассивСтрок = ПредшествующиеРемонты.НайтиСтроки(Новый Структура("ТиповойОР, ВидРемонта, ПредшествующийВидРемонта", ТекДанные.ТиповойОР, ТекДанные.ВидРемонта, ТекДанные.ПредшествующийВидРемонта));
		Если МассивСтрок.Количество() > 1 Тогда
			ТекстСообщения = НСтр("es='¡El tipo dado de la reparación es añadido ya!';ru='Данный вид ремонта уже добавлен!';en='This type of repair has already been added!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
		
	ИначеЕсли Не НоваяСтрока Тогда
		// возврат старых значений
		ЗаполнитьЗначенияСвойств(ТекДанные,СтруктураДанныхДоРедактирования[Элемент.Имя]);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПредшествующиеРемонтыПередУдалением(Элемент, Отказ)
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ТиповойОР) Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПредшествующиеРемонтыПредшествующийВидРемонтаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокОтбора = Новый СписокЗначений();
	
	Для каждого Строка Из НормативныеРемонты Цикл
		
		Если НЕ Строка.Удален Тогда
			СписокОтбора.Добавить(Строка.ВидРемонта);
		КонецЕсли;
		
	КонецЦикла;
	ПараметрыФормыСтруктура = Новый Структура("КлючНазначенияИспользования, СписокОтбора", "ПредшествующиеРемонты", СписокОтбора);	
	ФормаВыборка = ПолучитьФорму("Справочник.торо_ВидыРемонтов.ФормаВыбора", ПараметрыФормыСтруктура, Элемент);
	ФормаВыборка.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредшествующиеРемонтыПредшествующийВидРемонтаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	СписокОтбора = Новый СписокЗначений;
	Для каждого Строка Из НормативныеРемонты Цикл
		Если НЕ Строка.Удален Тогда
			СписокОтбора.Добавить(Строка.ВидРемонта);
		КонецЕсли;
	КонецЦикла;
	ПараметрыПолученияДанных.Отбор.Вставить("Ссылка", СписокОтбора);
КонецПроцедуры

&НаКлиенте
Процедура ПредшествующиеРемонтыПредшествующийВидРемонтаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СписокРемонтовДляВыбора = Новый СписокЗначений;
	
	Для Каждого строка из НормативныеРемонты Цикл
		СписокРемонтовДляВыбора.Добавить(строка.ВидРемонта);	
	КонецЦикла;
	
	ПараметрыПолученияДанных.Отбор.Вставить("Ссылка", СписокРемонтовДляВыбора);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗамещаемыеРемонты
&НаКлиенте
Процедура ЗамещаемыеРемонтыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если Элементы.НормативныеРемонты.ТекущиеДанные = Неопределено Тогда
		ТекстСообщения = НСтр("es='la reparación normativa!';ru='Не указан нормативный ремонт!';en='No regulatory repair specified!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	ИначеЕсли ЗначениеЗаполнено(Элементы.НормативныеРемонты.ТекущиеДанные.ТиповойОР) Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗамещаемыеРемонтыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элементы.ЗамещаемыеРемонты.ТекущиеДанные.ВидРемонта = Элементы.НормативныеРемонты.ТекущиеДанные.ВидРемонта;
	КонецЕсли;
	
	// Запись данных до редактирования
	Если НЕ НоваяСтрока Тогда
		торо_СобытияФормКлиент.ПриНачалеРедактирования(Элемент,СтруктураДанныхДоРедактирования,Элемент.ТекущиеДанные);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗамещаемыеРемонтыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если не ОтменаРедактирования Тогда
		МодифицированностьЗамещаемыхРемонтов = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗамещаемыеРемонтыПослеУдаления(Элемент)
	МодифицированностьЗамещаемыхРемонтов = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗамещаемыеРемонтыПередНачаломИзменения(Элемент, Отказ)
	
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ТиповойОР) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗамещаемыеРемонтыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если НЕ ОтменаРедактирования Тогда
		Если Не ЗначениеЗаполнено(ТекДанные.ЗамещаемыйВидРемонта) Тогда
			ТекстСообщения = НСтр("es='Indiquen el tipo de la reparación sustituida.';ru='Укажите вид замещаемого ремонта.';en='Specify the type of repair being replaced.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
		МассивСтрок = ЗамещаемыеРемонты.НайтиСтроки(Новый Структура("ВидРемонта, ТиповойОР, ЗамещаемыйВидРемонта", 
													ТекДанные.ВидРемонта, ТекДанные.ТиповойОР, ТекДанные.ЗамещаемыйВидРемонта));
		Если МассивСтрок.Количество() > 1 Тогда
			ТекстСообщения = НСтр("es='¡El tipo dado de la reparación es añadido ya!';ru='Данный вид ремонта уже добавлен!';en='This type of repair has already been added!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
	ИначеЕсли Не НоваяСтрока Тогда
		// возврат старых значений
		ЗаполнитьЗначенияСвойств(ТекДанные,СтруктураДанныхДоРедактирования[Элемент.Имя]);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗамещаемыеРемонтыПередУдалением(Элемент, Отказ)
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ТиповойОР) Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗамещаемыеРемонтыЗамещаемыйВидРемонтаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	СписокОтбора = Новый СписокЗначений();
	
	Для каждого Строка Из НормативныеРемонты Цикл
		
		Если НЕ Элементы.НормативныеРемонты.ТекущиеДанные.ВидРемонта = Строка.ВидРемонта И НЕ Строка.Удален Тогда
			СписокОтбора.Добавить(Строка.ВидРемонта);
		КонецЕсли;
		
	КонецЦикла;
	ПараметрыФормыСтруктура = Новый Структура("КлючНазначенияИспользования, СписокОтбора", "ПредшествующиеРемонты", СписокОтбора);	
	ФормаВыборка = ПолучитьФорму("Справочник.торо_ВидыРемонтов.ФормаВыбора", ПараметрыФормыСтруктура, Элемент);
	ФормаВыборка.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗамещаемыеРемонтыЗамещаемыйВидРемонтаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СписокОтбора = Новый СписокЗначений;
	ТекущиеДанныеНормативов = Элементы.НормативныеРемонты.ТекущиеДанные;
	Если ТекущиеДанныеНормативов <> Неопределено Тогда
		ТекущийВидРемонта = ТекущиеДанныеНормативов.ВидРемонта;
	КонецЕсли; 
	Для каждого Строка Из НормативныеРемонты Цикл
		
		Если НЕ Строка.Удален И ТекущийВидРемонта <> Строка.ВидРемонта Тогда
			СписокОтбора.Добавить(Строка.ВидРемонта);
		КонецЕсли;
		
	КонецЦикла;
	ПараметрыПолученияДанных.Отбор.Вставить("Ссылка", СписокОтбора);
КонецПроцедуры

&НаКлиенте
Процедура ЗамещаемыеРемонтыЗамещаемыйВидРемонтаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	СписокОтбора = Новый СписокЗначений;
	ТекущиеДанныеНормативов = Элементы.НормативныеРемонты.ТекущиеДанные;
	Если ТекущиеДанныеНормативов <> Неопределено Тогда
		ТекущийВидРемонта = ТекущиеДанныеНормативов.ВидРемонта;
	КонецЕсли; 
	Для каждого Строка Из НормативныеРемонты Цикл
		Если НЕ Строка.Удален И ТекущийВидРемонта <> Строка.ВидРемонта Тогда
			СписокОтбора.Добавить(Строка.ВидРемонта);
		КонецЕсли;
	КонецЦикла;
	ПараметрыПолученияДанных.Отбор.Вставить("Ссылка", СписокОтбора);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТабличноеПолеРемонтныеЦиклыОборудования
&НаКлиенте
Процедура ТабличноеПолеРемонтныеЦиклыОборудованияПриАктивизацииСтроки(Элемент)
	
	ТекСтрокаРемонтныеЦиклыОборудования = Элементы.ТабличноеПолеРемонтныеЦиклыОборудования.ТекущиеДанные;
	
	Если ТекСтрокаРемонтныеЦиклыОборудования = Неопределено Тогда
		ТабличноеПолеСоставРемонтногоЦикла.Очистить();			
	Иначе
		
		Элементы.ТабличноеПолеРемонтныеЦиклыОборудованияУдалить.Доступность     = (НЕ ТекСтрокаРемонтныеЦиклыОборудования.ТиповойОР);
		Элементы.ТабличноеПолеРемонтныеЦиклыОборудованияИзменить.Доступность    = (НЕ ТекСтрокаРемонтныеЦиклыОборудования.ТиповойОР);
		Элементы.ТабличноеПолеРемонтныеЦиклыОборудованияСкопировать.Доступность = (НЕ ТекСтрокаРемонтныеЦиклыОборудования.ТиповойОР);
		Элементы.ТабличноеПолеРемонтныеЦиклыОборудованияКонтекстноеМенюУдалить.Доступность     = (НЕ ТекСтрокаРемонтныеЦиклыОборудования.ТиповойОР);
		Элементы.ТабличноеПолеРемонтныеЦиклыОборудованияКонтекстноеМенюИзменить.Доступность    = (НЕ ТекСтрокаРемонтныеЦиклыОборудования.ТиповойОР);
		Элементы.ТабличноеПолеРемонтныеЦиклыОборудованияКонтекстноеМенюСкопировать.Доступность = (НЕ ТекСтрокаРемонтныеЦиклыОборудования.ТиповойОР);
		
		
		МассивРемонтов = ЗаполнитьПоследовательностьРемонтовНаСервере(ТекСтрокаРемонтныеЦиклыОборудования.ВидЦепочки);
		
		ТабличноеПолеСоставРемонтногоЦикла.Очистить();
		Для каждого Элем Из МассивРемонтов Цикл
			
			НС = ТабличноеПолеСоставРемонтногоЦикла.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Элем);
			
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТабличноеПолеРемонтныеЦиклыОборудованияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Копирование Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТабличноеПолеРемонтныеЦиклыОборудованияПередНачаломИзменения(Элемент, Отказ)
	
	Если Элемент.ТекущиеДанные.ТиповойОР Тогда	
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличноеПолеРемонтныеЦиклыОборудованияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если Не ОтменаРедактирования Тогда
		МодифицированностьРемЦиклов = Истина;
		ТабличноеПолеРемонтныеЦиклыОборудованияПриАктивизацииСтроки(Элементы.ТабличноеПолеРемонтныеЦиклыОборудования);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТабличноеПолеРемонтныеЦиклыОборудованияПередУдалением(Элемент, Отказ)
	МодифицированностьРемЦиклов = Истина;
	Если Элемент.ТекущиеДанные.ТиповойОР Тогда	
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличноеПолеРемонтныеЦиклыОборудованияВидЦепочкиПриИзменении(Элемент)
	
	МасСтрок = ТабличноеПолеРемонтныеЦиклыОборудования.НайтиСтроки(Новый Структура("ВидЦепочки", Элементы.ТабличноеПолеРемонтныеЦиклыОборудования.ТекущиеДанные.ВидЦепочки));
	Если МасСтрок.Количество() = 1 Тогда
		
		Если НормативныеРемонты.Количество() = 0 Тогда 
			ЗаполнитьНормативныеРемонты();
		КонецЕсли;
		
		ДобавлятьЦепочку = ПроверитьПересеченияНаСервере(Элементы.ТабличноеПолеРемонтныеЦиклыОборудования.ТекущиеДанные.ВидЦепочки);	
		Если НЕ ДобавлятьЦепочку Тогда
			Элементы.ТабличноеПолеРемонтныеЦиклыОборудования.ТекущиеДанные.ВидЦепочки = ПредопределенноеЗначение("Справочник.торо_ЦепочкиРемонта.ПустаяСсылка");
		КонецЕсли;
		
	Иначе
		ШаблонСообщения = НСтр("es='La cadenita ""%1"" es ya en la lista de los ciclos fijados de reparación';ru='Цепочка ""%1"" уже есть в списке фиксированных ремонтных циклов';en=""Chain '%1' is already in the list of fixed repair cycles""");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, Элементы.ТабличноеПолеРемонтныеЦиклыОборудования.ТекущиеДанные.ВидЦепочки);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			
		Элементы.ТабличноеПолеРемонтныеЦиклыОборудования.ТекущиеДанные.ВидЦепочки = ПредопределенноеЗначение("Справочник.торо_ЦепочкиРемонта.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличноеПолеРемонтныеЦиклыОборудованияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.ГруппаОбъектовРемонтов = Объект.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличноеПолеРемонтныеЦиклыОборудованияПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если НЕ ОтменаРедактирования Тогда
		ТекДанные = Элементы.ТабличноеПолеРемонтныеЦиклыОборудования.ТекущиеДанные;
		
		Если НЕ ТекДанные = Неопределено Тогда
			Если НЕ ЗначениеЗаполнено(ТекДанные.ВидЦепочки) Тогда
				ТекстСообщения = НСтр("es='de la cadenita!';ru='Не указан вид цепочки!';en='The type of chain is not specified!'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТабЗапчастейОбъектовРемонта

&НаКлиенте
Процедура ТабЗапчастейОбъектовРемонтаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если Не ОтменаРедактирования Тогда
		
		МодифицированностьЗапчастейОР = Истина;
		МодифицированностьНормативныхЗатратПоЗапчастям = Истина;
		Модифицированность = Истина;
		Если НоваяСтрока Тогда
			Элемент.ТекущиеДанные.ОбъектРемонта = Параметры.Ключ;
		КонецЕсли;
		ТекДанные = Элементы.ТабЗапчастейОбъектовРемонта.ТекущиеДанные;
		Если СтруктураДанныхДоРедактирования[Элемент.Имя] = Неопределено Тогда
			Возврат;
		КонецЕсли;
		Если НЕ НоваяСтрока И ТекДанные <> Неопределено Тогда
			// Заменим номенклатуру в существующих строках нормативных затрат запчастей.
			МассивСтрок = ТабЗатратПоВидамРемонта.НайтиСтроки(Новый Структура("Номенклатура, Характеристика",
			СтруктураДанныхДоРедактирования[Элемент.Имя].Номенклатура, СтруктураДанныхДоРедактирования[Элемент.Имя].Характеристика));
			Для Каждого Эл Из МассивСтрок Цикл
				МодифицированностьНормативныхЗатратПоЗапчастям = Истина;
				Эл.Номенклатура = ТекДанные.Номенклатура;
				Эл.Характеристика = ТекДанные.Характеристика;
			КонецЦикла;
			
		КонецЕсли;
		Если ТекДанные <> Неопределено и НоваяСтрока Или ТекДанные.Номенклатура <> СтруктураДанныхДоРедактирования[Элемент.Имя].Номенклатура Тогда
			СтруктураОтбора = Новый ФиксированнаяСтруктура("Номенклатура, Характеристика", ТекДанные.Номенклатура, ТекДанные.Характеристика);
			Элементы.ТабЗатратПоВидамРемонта.ОтборСтрок = СтруктураОтбора;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабЗапчастейОбъектовРемонтаПослеУдаления(Элемент)
	
	МодифицированностьЗапчастейОР = Истина;
	МодифицированностьНормативныхЗатратПоЗапчастям = Истина;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабЗапчастейОбъектовРемонтаПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если НЕ ТекДанные = Неопределено Тогда
		
		ТекущаяНоменклатура = ТекДанные.Номенклатура;
		ТекущаяХарактеристика = ТекДанные.Характеристика;
		
		СтруктураОтбора = УстановитьОтборДляТЧТабЗатратПоВидамРемонта(ТекущаяНоменклатура, ТекущаяХарактеристика);
		Элементы.ТабЗатратПоВидамРемонта.ОтборСтрок = СтруктураОтбора;
		
		СтруктураОтбора = Новый ФиксированнаяСтруктура("Запчасть", ТекущаяНоменклатура);
		Элементы.ТабИсторииЗаменыЗЧ.ОтборСтрок 		= СтруктураОтбора;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабЗапчастейОбъектовРемонтаПередУдалением(Элемент, Отказ)
	
	ТекДанные = Элемент.ТекущиеДанные;
	МодифицированностьЗапчастейОР = Истина;
	МодифицированностьНормативныхЗатратПоЗапчастям = Истина;
	Модифицированность = Истина;
	Если ТекДанные.ИзТипового Тогда
		Отказ = Истина;
		ТекДанные.Удален = НЕ ТекДанные.Удален;
		
		Если ТекДанные.Удален Тогда
			УстановитьОтборНеИспользуемыхСтрок(Элементы.ТабЗапчастейОбъектовРемонтаПоказыватьУдаленныеЗапчасти.Пометка,"ТабЗапчастейОбъектовРемонта");
		КонецЕсли;
		
		МассивСтрок = ТабЗатратПоВидамРемонта.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, ИзТипового",
			ТекДанные.Номенклатура, ТекДанные.Характеристика, Истина)); 
		Если МассивСтрок.Количество() > 0 Тогда
			МодифицированностьНормативныхЗатратПоЗапчастям = Истина;
		КонецЕсли;
			
		Для Каждого СтрокаНорм Из МассивСтрок Цикл
			СтрокаНорм.Удален = ТекДанные.Удален;
		КонецЦикла;
		
		текДанные = Элементы.ТабЗапчастейОбъектовРемонта.ТекущиеДанные;
		Элементы.ТабЗатратПоВидамРемонта.ОтборСтрок = 
			УстановитьОтборДляТЧТабЗатратПоВидамРемонта(?(текДанные = неопределено, неопределено, текДанные.Номенклатура),
														?(текДанные = неопределено, неопределено, текДанные.Характеристика));
	Иначе	
		УдалитьСвязанныеСтрокиПоЗапчастям(ТекДанные.Номенклатура, ТекДанные.Характеристика);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабЗапчастейОбъектовРемонтаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Номенклатура") Тогда
		
		МодифицированностьЗапчастейОР = Истина;
		МодифицированностьНормативныхЗатратПоЗапчастям = Истина;
		Модифицированность = Истина;
		
		СтруктураПараметр = Новый Структура();
		СтруктураПараметр.Вставить("Номенклатура",ВыбранноеЗначение);
		СтруктураПараметр.Вставить("Характеристика",ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка"));
		СтруктураПараметр.Вставить("Удален",Ложь);
		СтруктураПараметр.Вставить("ИзТипового",Ложь);
		
		Если ТабЗапчастейОбъектовРемонта.НайтиСтроки(СтруктураПараметр).Количество() = 0 Тогда
			НС = ТабЗапчастейОбъектовРемонта.Добавить();
			НС.ИзТипового = Ложь;
			НС.Количество = 1;
			НС.Номенклатура = ВыбранноеЗначение;
			НС.ОбъектРемонта = Объект.Ссылка;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Строка") Тогда
		ДобавитьНоменклатуруИзПодбора(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабЗапчастейОбъектовРемонтаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	// Запись данных до редактирования
	Если НЕ НоваяСтрока Тогда
		торо_СобытияФормКлиент.ПриНачалеРедактирования(Элемент,СтруктураДанныхДоРедактирования,Элемент.ТекущиеДанные);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТабЗапчастейОбъектовРемонтаПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекДанные = Элемент.ТекущиеДанные;
	ТекСтрока = Элемент.ТекущаяСтрока;
	ТекстОшибки = "";
	Если НЕ ОтменаРедактирования Тогда
		// проверка
		Если ТекДанные.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка") Тогда
			ТекстОшибки = НСтр("es='Indiquen la nomenclatura.';ru='Укажите номенклатуру.';en='Specify nomenclature.'");
		Иначе
			СтруктураПараметр = Новый Структура;
			СтруктураПараметр.Вставить("Номенклатура",ТекДанные.Номенклатура);
			СтруктураПараметр.Вставить("Характеристика",ТекДанные.Характеристика);
			СтруктураПараметр.Вставить("Удален",Ложь);
			СтруктураПараметр.Вставить("ИзТипового",Ложь);
			
			СтрокиНоменклатуры = ТабЗапчастейОбъектовРемонта.НайтиСтроки(СтруктураПараметр);
			Если СтрокиНоменклатуры.Количество() > 1 Тогда
				ТекстОшибки = НСтр("es='La nomenclatura es añadida ya en otra línea.';ru='Номенклатура уже добавлена в другой строке.';en='The nomenclature is already added on another line.'");
			ИначеЕсли ТекДанные.Количество = 0 Тогда
				ТекстОшибки = НСтр("es='Indiquen la cantidad de la nomenclatura.';ru='Укажите количество номенклатуры.';en='Specify the quantity of the item.'");
			КонецЕсли;
		КонецЕсли;
		
		Если ТекстОшибки = "" И СтруктураДанныхДоРедактирования[Элемент.Имя] <> Неопределено Тогда
			
			МассивСтрок = ТабЗатратПоВидамРемонта.НайтиСтроки(?(НоваяСтрока, Новый Структура("Номенклатура, Характеристика",ТекДанные.Номенклатура, ТекДанные.Характеристика), 
												Новый Структура("Номенклатура, Характеристика", СтруктураДанныхДоРедактирования[Элемент.Имя].Номенклатура, 
																								СтруктураДанныхДоРедактирования[Элемент.Имя].Характеристика)));
			
			МаксКол = 0;
			
			Для каждого Элем Из МассивСтрок Цикл
				Если Элем.Количество > МаксКол Тогда
					МаксКол = Элем.Количество;
					ВР = Элем.ВидРемонта;
				КонецЕсли;
			КонецЦикла;
			
			Если МаксКол > ТекДанные.Количество Тогда
				Если ЗначениеЗаполнено(ВР) Тогда
					ТекстОшибки = СтрШаблон(НСтр("es='La cantidad de los gastos a ТОиР (%1) para el tipo de la reparación ""%2"" más que la cantidad como parte del objeto de la reparación.';ru='Количество затрат при ТОиР (%1) для вида ремонта ""%2"" больше, чем количество в составе объекта ремонта.';en='The amount of expenses during MRO (%1) for the type of repair ""%2"" is greater than the amount in the structure of the repair object.'"),МаксКол,ВР);
				Иначе
					ТекстОшибки = СтрШаблон(НСтр("es='La cantidad de los gastos a ТОиР (%1) más que la cantidad como parte del objeto de la reparación.';ru='Количество затрат при ТОиР (%1) больше, чем количество в составе объекта ремонта.';en='The amount of expenses during MRO (%1) is greater than the amount in the structure of the repair object.'"),МаксКол);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТекстОшибки <> "" Тогда
			#Если НЕ ВебКлиент Тогда
				Отказ = Истина;
			#КонецЕсли
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки,, "ТабЗапчастейОбъектовРемонта");
		КонецЕсли;

	ИначеЕсли НЕ НоваяСтрока Тогда
		// возврат старых значений
		ЗаполнитьЗначенияСвойств(ТекДанные,СтруктураДанныхДоРедактирования[Элемент.Имя]);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабЗапчастейОбъектовРемонтаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные <> Неопределено И Копирование Тогда
		Если ТекДанные.ИзТипового Тогда  
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ТабЗапчастейОбъектовРемонтаНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТабЗапчастейОбъектовРемонта.ТекущиеДанные;
	
	ТекущаяСтрока.ХарактеристикиИспользуются = торо_НоменклатураСервер.ПолучитьХарактеристикиИспользуются(ТекущаяСтрока.Номенклатура);
	
	Если Не ТекущаяСтрока.ХарактеристикиИспользуются Тогда
		ТекущаяСтрока.Характеристика = Неопределено;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТабЗапчастейОбъектовРемонтаХарактеристикаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.ТабЗапчастейОбъектовРемонта.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущиеДанные.Номенклатура, "ВидНоменклатуры");
		ИспользованиеХарактеристик = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидНоменклатуры, "ИспользованиеХарактеристик");
		ПараметрыПолученияДанных.Отбор.Очистить();
		Если ИспользованиеХарактеристик = ПредопределенноеЗначение("Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры") Тогда
			ПараметрыПолученияДанных.Отбор.Вставить("Владелец", ВидНоменклатуры);
		Иначе
			ПараметрыПолученияДанных.Отбор.Вставить("Владелец", ТекущиеДанные.Номенклатура);
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТабЗапчастейОбъектовРемонтаХарактеристикаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.ТабЗапчастейОбъектовРемонта.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущиеДанные.Номенклатура, "ВидНоменклатуры");
		ИспользованиеХарактеристик = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидНоменклатуры, "ИспользованиеХарактеристик");
		ПараметрыПолученияДанных.Отбор.Очистить();
		Если ИспользованиеХарактеристик = ПредопределенноеЗначение("Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры") Тогда
			ПараметрыПолученияДанных.Отбор.Вставить("Владелец", ВидНоменклатуры);
		Иначе
			ПараметрыПолученияДанных.Отбор.Вставить("Владелец", ТекущиеДанные.Номенклатура);
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТабЗапчастейОбъектовРемонтаХарактеристикаСоздание(Элемент, СтандартнаяОбработка)
	Если Элементы.ТабЗапчастейОбъектовРемонта.ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(Элементы.ТабЗапчастейОбъектовРемонта.ТекущиеДанные.Номенклатура) Тогда
		Вид = торо_ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(Элементы.ТабЗапчастейОбъектовРемонта.ТекущиеДанные.Номенклатура, "ВидНоменклатуры");
		СтруктураПараметров = Новый Структура("ВидНоменклатуры, Владелец", Вид, Элементы.ТабЗапчастейОбъектовРемонта.ТекущиеДанные.Номенклатура);
		ОткрытьФорму("Справочник.ХарактеристикиНоменклатуры.Форма.ФормаЭлемента", СтруктураПараметров);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТабЗатратПоВидамРемонта

&НаКлиенте
Процедура ТабЗатратПоВидамРемонтаПослеУдаления(Элемент)
	
	МодифицированностьНормативныхЗатратПоЗапчастям = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабЗатратПоВидамРемонтаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НЕ ОтменаРедактирования Тогда
		МодифицированностьНормативныхЗатратПоЗапчастям = Истина;
		
		Если Элементы.ТабЗапчастейОбъектовРемонта.ТекущиеДанные <> Неопределено Тогда
			ТекущаяНоменклатура = Элементы.ТабЗапчастейОбъектовРемонта.ТекущиеДанные.Номенклатура;
			ТекущаяХарактеристика = Элементы.ТабЗапчастейОбъектовРемонта.ТекущиеДанные.Характеристика;
			
			Элементы.ТабЗатратПоВидамРемонта.ОтборСтрок = УстановитьОтборДляТЧТабЗатратПоВидамРемонта(ТекущаяНоменклатура,ТекущаяХарактеристика);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабЗатратПоВидамРемонтаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	ТекДанныеЗапчастей = Элементы.ТабЗапчастейОбъектовРемонта.ТекущиеДанные;
	Если ТекДанныеЗапчастей = Неопределено Тогда
		ТекстСообщения = НСтр("es='¡La adición de los gastos normativos según los tipos de la reparación es posible solamente las partes de recambio concretas!';ru='Добавление нормативных затрат по видам ремонта возможно только для конкретных запчастей!';en='Adding standard costs by type of repair is only possible for specific spare parts!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		Возврат;
	КонецЕсли;
	
	Если ТекДанныеЗапчастей.Удален Тогда
		ТекстСообщения = НСтр("es='¡La adición de los gastos normativos según los tipos de la reparación es posible solamente las partes de recambio usadas!';ru='Добавление нормативных затрат по видам ремонта возможно только для используемых запчастей!';en='Adding standard costs by type of repair is only possible for used parts!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабЗатратПоВидамРемонтаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элементы.ТабЗатратПоВидамРемонта.ТекущиеДанные.ОбъектРемонта = Параметры.Ключ;
		Элементы.ТабЗатратПоВидамРемонта.ТекущиеДанные.Номенклатура = Элементы.ТабЗапчастейОбъектовРемонта.ТекущиеДанные.Номенклатура;
		Элементы.ТабЗатратПоВидамРемонта.ТекущиеДанные.Характеристика = Элементы.ТабЗапчастейОбъектовРемонта.ТекущиеДанные.Характеристика;
	КонецЕсли;
	
	// Запись данных до редактирования
	Если НЕ НоваяСтрока Тогда
		торо_СобытияФормКлиент.ПриНачалеРедактирования(Элемент,СтруктураДанныхДоРедактирования,Элемент.ТекущиеДанные);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТабЗатратПоВидамРемонтаВидРемонтаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НормативныеРемонты.Количество() = 0 Тогда
		ЗаполнитьНормативныеРемонты();
	КонецЕсли;
	
	СписокОтбора = Новый СписокЗначений();
	
	Для каждого Строка Из НормативныеРемонты Цикл
		Если НЕ Строка.Удален Тогда
			СписокОтбора.Добавить(Строка.ВидРемонта);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыФормыСтруктура = Новый Структура("КлючНазначенияИспользования, СписокОтбора", "ПредшествующиеРемонты", СписокОтбора);	
	ФормаВыборка = ПолучитьФорму("Справочник.торо_ВидыРемонтов.ФормаВыбора", ПараметрыФормыСтруктура, Элемент);
	ФормаВыборка.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ТабЗатратПоВидамРемонтаПередУдалением(Элемент, Отказ)
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные.ИзТипового Тогда
		Отказ = Истина;
		ТекДанные.Удален = НЕ ТекДанные.Удален;
		
		текДанные = Элементы.ТабЗапчастейОбъектовРемонта.ТекущиеДанные;
		Если текДанные <> Неопределено Тогда
			Элементы.ТабЗатратПоВидамРемонта.ОтборСтрок = УстановитьОтборДляТЧТабЗатратПоВидамРемонта(
				Элементы.ТабЗапчастейОбъектовРемонта.ТекущиеДанные.Номенклатура, 
				Элементы.ТабЗапчастейОбъектовРемонта.ТекущиеДанные.Характеристика);
		КонецЕсли;
		МодифицированностьНормативныхЗатратПоЗапчастям = Истина;		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТабЗатратПоВидамРемонтаПередНачаломИзменения(Элемент, Отказ)
	Если Элемент.ТекущиеДанные.ИзТипового Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТабЗатратПоВидамРемонтаПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	ТекДанные = Элемент.ТекущиеДанные;
	ТекСтрока = Элемент.ТекущаяСтрока;
	ТекДанныеЗапчастей = Элементы.ТабЗапчастейОбъектовРемонта.ТекущиеДанные;
	ТекстОшибки = "";
	Если НЕ ОтменаРедактирования Тогда
		// проверка
		Если ТекДанные.ВидРемонта = ПредопределенноеЗначение("Справочник.торо_ВидыРемонтов.ПустаяСсылка") Тогда
			ТекстОшибки = НСтр("es='Indiquen el tipo de la reparación.';ru='Укажите вид ремонта.';en='Specify the type of repair.'");
		Иначе
			Если ТекДанные.Количество = 0 Тогда
				ТекстОшибки = НСтр("es='Indiquen la cantidad de la nomenclatura a ТОиР.';ru='Укажите количество номенклатуры при ТОиР.';en='Specify the quantity of the item during MRO.'");
			Иначе
				
				Если ТекДанныеЗапчастей <> Неопределено Тогда
					
					СтруктураПараметр = Новый Структура("ВидРемонта,Номенклатура, Характеристика,Удален,ИзТИпового");
					ЗаполнитьЗначенияСвойств(СтруктураПараметр,ТекДанные);
					СтруктураПараметр.Удален = Ложь;
										
					СтрокиНоменклатуры = ТабЗатратПоВидамРемонта.НайтиСтроки(СтруктураПараметр);
					Если СтрокиНоменклатуры.Количество() > 1 Тогда
						ТекстОшибки = НСтр("es='El tipo de la reparación es añadida ya en otra línea.';ru='Вид ремонта уже добавлена в другой строке.';en='The repair type has already been added to another line.'");
					КонецЕсли;
				
					Если ТекДанные.Количество > ТекДанныеЗапчастей.Количество Тогда
						ТекстОшибки = СтрШаблон(НСтр("es='La cantidad de los gastos a ТОиР (%1) más que la cantidad como parte del objeto de la reparación.';ru='Количество затрат при ТОиР (%1) больше, чем количество в составе объекта ремонта.';en='The amount of expenses during MRO (%1) is greater than the amount in the structure of the repair object.'"),ТекДанные.Количество);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ТекстОшибки <> "" Тогда
			#Если НЕ ВебКлиент Тогда
				Отказ = Истина;
			#КонецЕсли
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки,, "ТабЗатратПоВидамРемонта");
		КонецЕсли;

	ИначеЕсли НЕ НоваяСтрока Тогда
		// возврат старых значений
		ЗаполнитьЗначенияСвойств(ТекДанные,СтруктураДанныхДоРедактирования[Элемент.Имя]);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТабЗатратПоВидамРемонтаВидРемонтаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	текЗапчасть = Элементы.ТабЗапчастейОбъектовРемонта.ТекущиеДанные;
	
	СписокОтбора = Новый СписокЗначений(); 	
	
	Для каждого Строка Из НормативныеРемонты Цикл		
		СписокОтбора.Добавить(Строка.ВидРемонта);		
	КонецЦикла; 
	
	НайденВНормативах = СписокОтбора.НайтиПоЗначению(ВыбранноеЗначение);
	Если НайденВНормативах = Неопределено тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьПредупреждение(Неопределено, СтрЗаменить(Нстр("es='¡El tipo de la reparación %ВидРемонта del % no es encontrado en la lista de las reparaciones normativas!';ru='Вид ремонта %ВидРемонта% не найден в списке нормативных ремонтов!';en='Type of repair %ВидРемонта% not found in the list of normative repairs!'"),
		"%ВидРемонта%", ВыбранноеЗначение),,НСтр("es='La elección del tipo de la reparación...';ru='Выбор вида ремонта...';en='Selecting the type of repair ...'"));	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТабЗатратПоВидамРемонтаВидРемонтаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	Если Ожидание > 0 Тогда
		СтандартнаяОбработка = Ложь;
		Если ЗначениеЗаполнено(Текст) Тогда
			ДанныеВыбора = Новый СписокЗначений;
			Для каждого ТекСтрока из НормативныеРемонты Цикл
				Если СтрНачинаетсяС(ВРег(ТекСтрока.ВидРемонта), ВРег(текст)) Тогда
					ДанныеВыбора.Добавить(ТекСтрока.ВидРемонта);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТабЗатратПоВидамРемонтаПриИзменении(Элемент)
	МодифицированностьЗапчастейОР = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаОценокРМ
&НаКлиенте
Процедура ТаблицаОценокРМПередНачаломИзменения(Элемент, Отказ)
	
	ТекСтрока = Элементы.ТаблицаОценокРМ.ТекущиеДанные;
	Если ТипЗнч(ТекСтрока.ГруппаОбъектовРемонтов) = Тип("СправочникСсылка.торо_ТиповыеОР") Тогда  
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОценокРМПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда 
		ТекДанные = Элементы.ТаблицаОценокРМ.ТекущиеДанные;
		Если Не ТекДанные.ГруппаОбъектовРемонтов = Объект.Ссылка Тогда
			ТекДанные.ГруппаОбъектовРемонтов = Объект.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	// Запись данных до редактирования
	Если НЕ НоваяСтрока Тогда
		торо_СобытияФормКлиент.ПриНачалеРедактирования(Элемент,СтруктураДанныхДоРедактирования,Элемент.ТекущиеДанные);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОценокРМПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекДанные = Элементы.ТаблицаОценокРМ.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если НЕ ОтменаРедактирования Тогда
		
		СтруктураПараметр = Новый Структура("ГруппаОбъектовРемонтов, ВидРемонта,Сезон,Период");
		ЗаполнитьЗначенияСвойств(СтруктураПараметр,ТекДанные);
		
		Строки = ТаблицаОценокРМ.НайтиСтроки(СтруктураПараметр);
		Количество = 0;
		Если Строки.Количество() > 1 Тогда 
			ТекстСообщения = НСтр("es='¡La línea corriente de las apreciaciones del riesgo-management duplica ya introducido!';ru='Текущая строка оценок риск-менеджмента дублирует уже введенную!';en='The current line of risk management assessments duplicates the already entered!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Возврат;
		КонецЕсли;
		ТаблицаОценокРММодифицированность = Истина;
		Модифицированность = Модифицированность Или ТаблицаОценокРММодифицированность;
		
		Если НоваяСтрока Тогда
			ЗаполнитьЗначенияСвойств(РСНЗТаблицаОценокРМ.Добавить(),ТекДанные);
		Иначе
			ДанныеДоРедактирования = СтруктураДанныхДоРедактирования[Элемент.Имя];
			Строки = РСНЗТаблицаОценокРМ.НайтиСтроки(Новый Структура("ВидРемонта,Сезон,Период", ДанныеДоРедактирования.ВидРемонта, ДанныеДоРедактирования.Сезон, ДанныеДоРедактирования.Период));
			Если Строки.Количество() > 0 Тогда
				ЗаполнитьЗначенияСвойств(Строки[0],ТекДанные);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОценокРМПередУдалением(Элемент, Отказ)
	ТекДанные = Элементы.ТаблицаОценокРМ.ТекущиеДанные;
	
	Строки = РСНЗТаблицаОценокРМ.НайтиСтроки(Новый Структура("ВидРемонта,Сезон,Период",ТекДанные.ВидРемонта,ТекДанные.Сезон,ТекДанные.Период));
	Для Каждого Строка Из Строки Цикл
		РСНЗТаблицаОценокРМ.Удалить(Строка);
	КонецЦикла; 
	ТаблицаОценокРММодифицированность = Истина;
	Модифицированность = Модифицированность Или ТаблицаОценокРММодифицированность;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОценокРМВидРемонтаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокОтбора = Новый СписокЗначений();
	
	Для каждого Строка Из НормативныеРемонты Цикл
		
		Если НЕ Строка.Удален Тогда
			СписокОтбора.Добавить(Строка.ВидРемонта);
		КонецЕсли;
		
	КонецЦикла;
	ПараметрыФормыСтруктура = Новый Структура("КлючНазначенияИспользования, СписокОтбора", "ПредшествующиеРемонты", СписокОтбора);	
	ФормаВыборка = ПолучитьФорму("Справочник.торо_ВидыРемонтов.ФормаВыбора", ПараметрыФормыСтруктура, Элемент);
	ФормаВыборка.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОценокРМВидРемонтаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СписокОтбора = Новый СписокЗначений();
	
	Для каждого Строка Из НормативныеРемонты Цикл
		
		Если НЕ Строка.Удален Тогда
			СписокОтбора.Добавить(Строка.ВидРемонта);
		КонецЕсли;
		
	КонецЦикла;

	ПараметрыПолученияДанных.Отбор.Вставить("Ссылка", СписокОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОценокРМВидРемонтаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	СписокОтбора = Новый СписокЗначений();
	
	Для каждого Строка Из НормативныеРемонты Цикл
		
		Если НЕ Строка.Удален Тогда
			СписокОтбора.Добавить(Строка.ВидРемонта);
		КонецЕсли;
		
	КонецЦикла;

	ПараметрыПолученияДанных.Отбор.Вставить("Ссылка", СписокОтбора);

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОценокРМВидРемонтаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СписокОтбора = Новый СписокЗначений();
	
	Для каждого Строка Из НормативныеРемонты Цикл
		
		Если НЕ Строка.Удален Тогда
			СписокОтбора.Добавить(Строка.ВидРемонта);
		КонецЕсли;
		
	КонецЦикла;

	Если ЗначениеЗаполнено(ВыбранноеЗначение) И СписокОтбора.НайтиПоЗначению(ВыбранноеЗначение) = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокОбъектовРемонта

&НаКлиенте
Процедура СписокОбъектовРемонтаПриАктивизацииСтроки(Элемент)
	
	УстановитьОтборВТЧВидыРемонтаЭтогоОбъекта();
	УстановитьПараметрыВыбораВидаРемонтаосновногоСвязанного();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОбъектовРемонтаПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Если Не (НоваяСтрока И ОтменаРедактирования) Тогда
			Если СписокОбъектовРемонта.НайтиСтроки(Новый Структура("ОбъектРемонта", ТекДанные.ОбъектРемонта)).Количество() > 1 Тогда
				ТекстСообщения = НСтр("es='¡El objeto escogido de la reparación es añadido ya!';ru='Выбранный объект ремонта уже добавлен!';en='The selected repair object has already been added!'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			КонецЕсли;
			Если Не ЗначениеЗаполнено(ТекДанные.ОбъектРемонта) Тогда
				ТекстСообщения = НСтр("es='¡Escojan el objeto de la reparación!';ru='Выберите объект ремонта!';en='Select a repair object!'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОбъектовРемонтаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	УстановитьКоличествоОсновногоЗависимогоОборудования();
	МодифицированностьОсновныхЗависимых = Истина;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОбъектовРемонтаПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	ТекстВопроса = НСтр("es='Los datos vinculados serán limpiados. ¿Continuar?';ru='Связанные данные будут очищены. Продолжить?';en='Related data will be cleared. Continue?'");
	ПоказатьВопрос(Новый ОписаниеОповещения("СписокОбъектовРемонтаПередУдалениемЗавершение", ЭтаФорма), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОбъектовРемонтаПередУдалениемЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Для Каждого ВыделеннаяСтрока Из Элементы.СписокОбъектовРемонта.ВыделенныеСтроки Цикл
			ДанныеСтроки = Элементы.СписокОбъектовРемонта.ДанныеСтроки(ВыделеннаяСтрока);
			
			СтруктураПоиска = Новый Структура("ОбъектРемонта", ДанныеСтроки.ОбъектРемонта);
			НайденныеСтрокиВР = ВидыРемонтаЭтогоОбъекта.НайтиСтроки(СтруктураПоиска);
			
			Для каждого СтрокаВР из НайденныеСтрокиВР Цикл
				СтруктураПоиска = Новый Структура("ОбъектРемонта, ВидРемонтаЭтогоОбъекта", СтрокаВР.ОбъектРемонта, СтрокаВР.ВидРемонта);
				НайденныеСтроки = ВидыРемонтаОсновногоСвязанного.НайтиСтроки(СтруктураПоиска);
				Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
					ВидыРемонтаОсновногоСвязанного.Удалить(НайденнаяСтрока);
				КонецЦикла;
				
				ВидыРемонтаЭтогоОбъекта.Удалить(СтрокаВР);
			КонецЦикла;
						
			СписокОбъектовРемонта.Удалить(СписокОбъектовРемонта.НайтиПоИдентификатору(ВыделеннаяСтрока));
		КонецЦикла;
		
		УстановитьКоличествоОсновногоЗависимогоОборудования();
		
		МодифицированностьОсновныхЗависимых = Истина;
		Модифицированность = Истина; 
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СписокОбъектовРемонтаОбъектРемонтаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СписокОбъектовРемонта.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		СписокОбъектовРемонтаОбъектРемонтаПриИзмененииИзменитьСвязанныеТЧ(ТекущиеДанные.ОбъектРемонта, ВыбранноеЗначение);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокОбъектовРемонтаОбъектРемонтаПриИзменении(Элемент)
	
	УстановитьОтборВТЧВидыРемонтаЭтогоОбъекта();
	УстановитьПараметрыВыбораВидаРемонтаосновногоСвязанного();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВидыРемонтаЭтогоОбъекта

&НаКлиенте
Процедура ВидыРемонтаЭтогоОбъектаПриАктивизацииСтроки(Элемент)
	УстановитьОтборВТЧОсновныеЗависимыеРемонты();
КонецПроцедуры

&НаКлиенте
Процедура ВидыРемонтаЭтогоОбъектаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ТекущиеДанныеСпискаОР = Элементы.СписокОбъектовРемонта.ТекущиеДанные;
	
	Если ТекущиеДанныеСпискаОР = Неопределено ИЛИ Копирование Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли; 
	
	СтрокиВР = ВидыРемонтаЭтогоОбъекта.НайтиСтроки(Новый Структура("ОбъектРемонта", ТекущиеДанныеСпискаОР.ОбъектРемонта));
	ЕстьЛюбойВР = Ложь;
	Для каждого Строка из СтрокиВР Цикл
		Если НЕ ЗначениеЗаполнено(Строка.ВидРемонта) Тогда
			ЕстьЛюбойВР = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьЛюбойВР Тогда
		ТекстСообщения = НСтр("es='En la tabla es indicado ya el significado <cualquier tipo de la reparación>, la adición es anulada.';ru='В таблице уже указано значение <любой вид ремонта>, добавление отменено.';en='The table already indicates the value <any type of repair>, the addition is canceled.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыРемонтаЭтогоОбъектаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.ВидыРемонтаЭтогоОбъекта.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НоваяСтрока Тогда
		ТекущиеДанныеОР = Элементы.СписокОбъектовРемонта.ТекущиеДанные;
		Если ТекущиеДанныеОР <> Неопределено Тогда
			ТекущиеДанные.ОбъектРемонта = ТекущиеДанныеОР.ОбъектРемонта;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыРемонтаЭтогоОбъектаПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Если Не (НоваяСтрока И ОтменаРедактирования) Тогда
			Если ВидыРемонтаЭтогоОбъекта.НайтиСтроки(Новый Структура("ОбъектРемонта, ВидРемонта", ТекДанные.ОбъектРемонта, ТекДанные.ВидРемонта)).Количество() > 1 Тогда
				ТекстСообщения = НСтр("es='¡El tipo escogido de la reparación es añadido ya!';ru='Выбранный вид ремонта уже добавлен!';en='The selected repair type has already been added!'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыРемонтаЭтогоОбъектаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	УстановитьОтборВТЧОсновныеЗависимыеРемонты();
	
	МодифицированностьОсновныхЗависимых = Истина;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыРемонтаЭтогоОбъектаПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	ТекстВопроса = НСтр("es='Los datos vinculados serán limpiados. ¿Continuar?';ru='Связанные данные будут очищены. Продолжить?';en='Related data will be cleared. Continue?'");
	ПоказатьВопрос(Новый ОписаниеОповещения("ВидыРемонтаЭтогоОбъектаПередУдалениемЗавершение", ЭтаФорма), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыРемонтаЭтогоОбъектаПередУдалениемЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Для Каждого ВыделеннаяСтрока Из Элементы.ВидыРемонтаЭтогоОбъекта.ВыделенныеСтроки Цикл
			ДанныеСтроки = Элементы.ВидыРемонтаЭтогоОбъекта.ДанныеСтроки(ВыделеннаяСтрока);
			
			СтруктураПоиска = Новый Структура("ОбъектРемонта, ВидРемонтаЭтогоОбъекта", ДанныеСтроки.ОбъектРемонта, ДанныеСтроки.ВидРемонта);
			НайденныеСтроки = ВидыРемонтаОсновногоСвязанного.НайтиСтроки(СтруктураПоиска);
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				ВидыРемонтаОсновногоСвязанного.Удалить(НайденнаяСтрока);
			КонецЦикла;
			
			ВидыРемонтаЭтогоОбъекта.Удалить(ВидыРемонтаЭтогоОбъекта.НайтиПоИдентификатору(ВыделеннаяСтрока));
		КонецЦикла;
		
		МодифицированностьОсновныхЗависимых = Истина;
		Модифицированность = Истина;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВидыРемонтаЭтогоОбъектаВидРемонтаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокОтбора = Новый СписокЗначений();
	
	Для каждого Строка Из НормативныеРемонты Цикл
		Если НЕ Строка.Удален Тогда
			СписокОтбора.Добавить(Строка.ВидРемонта);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыФормыСтруктура = Новый Структура("КлючНазначенияИспользования, СписокОтбора", "Визуализация", СписокОтбора);	
	ОткрытьФорму("Справочник.торо_ВидыРемонтов.ФормаВыбора", ПараметрыФормыСтруктура, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыРемонтаЭтогоОбъектаВидРемонтаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ВидыРемонтаЭтогоОбъекта.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ВидыРемонтаЭтогоОбъектаПриИзмененииИзменитьСвязанныеТЧ(ТекущиеДанные.ВидРемонта, ВыбранноеЗначение, ТекущиеДанные.ОбъектРемонта);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыРемонтаЭтогоОбъектаВидРемонтаПриИзменении(Элемент)
	
	УстановитьОтборВТЧОсновныеЗависимыеРемонты();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыРемонтаЭтогоОбъектаВидРемонтаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СписокОтбора = Новый СписокЗначений();
	
	Для каждого Строка Из НормативныеРемонты Цикл
		Если НЕ Строка.Удален Тогда
			СписокОтбора.Добавить(Строка.ВидРемонта);
		КонецЕсли;
	КонецЦикла;

	ПараметрыПолученияДанных.Отбор.Вставить("Ссылка", СписокОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыРемонтаЭтогоОбъектаВидРемонтаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	СписокОтбора = Новый СписокЗначений();
	
	Для каждого Строка Из НормативныеРемонты Цикл
		Если НЕ Строка.Удален Тогда
			СписокОтбора.Добавить(Строка.ВидРемонта);
		КонецЕсли;
	КонецЦикла;

	ПараметрыПолученияДанных.Отбор.Вставить("Ссылка", СписокОтбора);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВидыРемонтаОсновногоСвязанного

&НаКлиенте
Процедура ВидыРемонтаОсновногоСвязанногоПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ТекущиеДанныеВР = Элементы.ВидыРемонтаЭтогоОбъекта.ТекущиеДанные;
	
	Если ТекущиеДанныеВР = Неопределено ИЛИ Копирование Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли; 
	
	СтрокиВР = ВидыРемонтаОсновногоСвязанного.НайтиСтроки(Новый Структура("ОбъектРемонта, ВидРемонтаЭтогоОбъекта", ТекущиеДанныеВР.ОбъектРемонта, ТекущиеДанныеВР.ВидРемонта));
	ЕстьЛюбойВР = Ложь;
	Для каждого Строка из СтрокиВР Цикл
		Если НЕ ЗначениеЗаполнено(Строка.ВидРемонтаСвязанногоОбъекта) Тогда
			ЕстьЛюбойВР = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьЛюбойВР Тогда
		ТекстСообщения = НСтр("es='En la tabla es indicado ya el significado <cualquier tipo de la reparación>, la adición es anulada.';ru='В таблице уже указано значение <любой вид ремонта>, добавление отменено.';en='The table already indicates the value <any type of repair>, the addition is canceled.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыРемонтаОсновногоСвязанногоПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.ВидыРемонтаОсновногоСвязанного.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НоваяСтрока Тогда
		
		ТекущиеДанныеВРЭтогоОбъекта = Элементы.ВидыРемонтаЭтогоОбъекта.ТекущиеДанные;
		Если ТекущиеДанныеВРЭтогоОбъекта <> Неопределено Тогда
			ТекущиеДанные.ВидРемонтаЭтогоОбъекта = ТекущиеДанныеВРЭтогоОбъекта.ВидРемонта;
			ТекущиеДанные.ОбъектРемонта = ТекущиеДанныеВРЭтогоОбъекта.ОбъектРемонта;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыРемонтаОсновногоСвязанногоПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекущиеДанные = Элементы.ВидыРемонтаОсновногоСвязанного.ТекущиеДанные;
	
	Если Не ТекущиеДанные = Неопределено Тогда
		
		Если Не (НоваяСтрока И ОтменаРедактирования) Тогда
			
			СтруктураПоиска = Новый Структура("ОбъектРемонта, ВидРемонтаЭтогоОбъекта, ВидРемонтаСвязанногоОбъекта", 
												ТекущиеДанные.ОбъектРемонта,
												ТекущиеДанные.ВидРемонтаЭтогоОбъекта,
												ТекущиеДанные.ВидРемонтаСвязанногоОбъекта);
			
			Если ВидыРемонтаОсновногоСвязанного.НайтиСтроки(СтруктураПоиска).Количество() > 1 Тогда
				ТекстСообщения = НСтр("es='¡El tipo escogido de la reparación es añadido ya!';ru='Выбранный вид ремонта уже добавлен!';en='The selected repair type has already been added!'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыРемонтаОсновногоСвязанногоПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	МодифицированностьОсновныхЗависимых = Истина;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыРемонтаОсновногоСвязанногоПриИзменении(Элемент)
	
	МодифицированностьОсновныхЗависимых = Истина;
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ЖурналыДокументов

&НаКлиенте
Процедура СтраницыЖурналыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если Элемент.ТекущаяСтраница = Элементы.СтраницаАктыПоРемонтам Тогда
		Элементы.ВыполненныеРемонтыГарантийныйРемонт.Видимость = ПолучитьФОИспользоватьГарантииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыявленныеДефектыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекДанные = Элементы.ВыявленныеДефекты.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ОткрытьФорму("Документ.торо_ВыявленныеДефекты.ФормаОбъекта", Новый Структура("Ключ", ТекДанные.Документ), ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиНаРемонтВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ЗаявкиНаРемонт.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ОткрытьФорму("Документ.торо_ЗаявкаНаРемонт.ФормаОбъекта", Новый Структура("Ключ", ТекДанные.Ссылка), ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НарядыНаВыполнениеРемонтныхРаботВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекДанные = Элементы.НарядыНаВыполнениеРемонтныхРабот.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ОткрытьФорму("Документ.торо_НарядНаВыполнениеРемонтныхРабот.ФормаОбъекта", Новый Структура("Ключ", ТекДанные.Документ), ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполненныеРемонтыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекДанные = Элементы.ВыполненныеРемонты.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Если ТипЗнч(ТекДанные.Ссылка) = Тип("ДокументСсылка.торо_АктОВыполненииЭтапаРабот") Тогда
			ОткрытьФорму("Документ.торо_АктОВыполненииЭтапаРабот.ФормаОбъекта", Новый Структура("Ключ", ТекДанные.Ссылка), ЭтаФорма);
		Иначе
			ОткрытьФорму("Документ.торо_ВводНачальныхДанных.ФормаОбъекта", Новый Структура("Ключ", ТекДанные.Ссылка), ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПредстоящиеРемонтыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекДанные = Элементы.ПредстоящиеРемонты.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Если ТипЗнч(ТекДанные.Регистратор) = Тип("ДокументСсылка.торо_ПланГрафикРемонта") Тогда
			ОткрытьФорму("Документ.торо_ПланГрафикРемонта.ФормаОбъекта", Новый Структура("Ключ, ID", ТекДанные.Регистратор, ТекДанные.ID), ЭтаФорма);
		Иначе
			ОткрытьЗначение(ТекДанные.Регистратор);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте 
Процедура ПредстоящиеРегМероприятияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекДанные = Элементы.ПредстоящиеРегМероприятия.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда 
		Если ТипЗнч(ТекДанные.Регистратор) = Тип ("ДокументСсылка.торо_ГрафикРегламентныхМероприятийТОиР") Тогда
			ОткрытьФорму("Документ.торо_ГрафикРегламентныхМероприятийТОиР.ФормаОбъекта", Новый Структура("Ключ, ID", ТекДанные.Регистратор, ТекДанные.ID), ЭтаФорма);
		Иначе 
			ОткрытьЗначение(ТекДанные.Регистратор);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НарядыНаРегМероприятияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.НарядыНаРегМероприятия.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда 
		ОткрытьФорму("Документ.торо_НарядНаРегламентноеМероприятие.ФормаОбъекта", Новый Структура("Ключ", ТекущиеДанные.Документ), ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполненныеРегМероприятияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекДанные = Элементы.ВыполненныеРегМероприятия.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Если ТипЗнч(ТекДанные.Ссылка) = Тип("ДокументСсылка.торо_АктОВыполненииРегламентногоМероприятия") Тогда
			ОткрытьФорму("Документ.торо_АктОВыполненииРегламентногоМероприятия.ФормаОбъекта", Новый Структура("Ключ", ТекДанные.Ссылка), ЭтаФорма);
		Иначе
			ОткрытьФорму("Документ.торо_ВводНачальныхДанных.ФормаОбъекта", Новый Структура("Ключ", ТекДанные.Ссылка), ЭтаФорма);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура АктПриемкиОборудованияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекДанные = Элементы.АктыПриемкиОборудования.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ОткрытьФорму("Документ.торо_АктПриемкиОборудования.ФормаОбъекта", Новый Структура("Ключ", ТекДанные.Документ), ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Гарантии

&НаКлиенте
Процедура ЕстьГарантияДляОбъектаПриИзменении(Элемент)
	
	Если ЕстьГарантияДляОбъекта Тогда
		Элементы.СтраницаГарантийныеРемонты.Видимость = Истина;
	Иначе
		Если ГарантииОбъектаРемонта.Количество() > 0 Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаСнятияФлажкаГарантий",ЭтаФорма);
			ПоказатьВопрос(ОписаниеОповещения,НСтр("es='La tabla de los plazos de las garantías es rellenada. ¿Limpiar la tabla de las garantías?';ru='Таблица сроков гарантий заполнена. Очистить таблицу гарантий?';en='The warranty period table is full. Clear the warranty table?'"),РежимДиалогаВопрос.ДаНет,,,НСтр("es='Para el objeto de la reparación hay una garantía';ru='Для объекта ремонта имеется гарантия';en='There is a guarantee for the repair object'"));
		Иначе
			Элементы.СтраницаГарантийныеРемонты.Видимость = Ложь;
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

#Область ОбработчикиСобытийЭлементовТаблицыФормыГарантииОбъектаРемонта

&НаКлиенте
Процедура ГарантииОбъектаРемонтаПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если Не (НоваяСтрока И ОтменаРедактирования) И ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(ТекущиеДанные.УсловияГарантии) Тогда
		РеквизитыГарантии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущиеДанные.УсловияГарантии, "ПроверятьПериодГарантии, ДатаНачалаГарантии");
		Если РеквизитыГарантии.ПроверятьПериодГарантии 
			И РеквизитыГарантии.ДатаНачалаГарантии < Объект.ДатаВыпуска Тогда
			ШаблонСообщения = НСтр("es='¡La fecha del comienzo de la garantía no puede ser menos de fechas de la salida (%1)!';ru='Дата начала гарантии не может быть меньше даты выпуска (%1)!';en='Warranty start date cannot be less than the release date (%1)!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Формат(Объект.ДатаВыпуска,"ДФ=dd.MM.yyyy"));
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЕсли;
	КонецЕсли;
	
	МодифицированностьГарантий = Истина;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ГарантииОбъектаРемонтаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если НоваяСтрока И Не ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные.ОбъектРемонта = Объект.Ссылка;
		Если НоваяСтрока И ГарантииОбъектаРемонта.Количество() = 1 Тогда
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГарантииОбъектаРемонтаПередУдалением(Элемент, Отказ)
	ТекущиеДаные = Элемент.ТекущиеДанные;
	Если Не ТекущиеДаные = Неопределено
		И Не ТекущиеДаные.ОбъектРемонта = Объект.Ссылка Тогда
		Отказ = Истина;
	КонецЕсли; 
	Если Не Отказ Тогда
		МодифицированностьГарантий = Истина;
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГарантииОбъектаРемонтаПриАктивизацииСтроки(Элемент)
	
	ТекущиеДаные = Элемент.ТекущиеДанные;
	Если Не ТекущиеДаные = Неопределено И Не ТекущиеДаные.ОбъектРемонта = Объект.Ссылка Тогда
		Элементы.ГарантииОбъектаРемонтаУдалить.Доступность = Ложь;
	Иначе
		Элементы.ГарантииОбъектаРемонтаУдалить.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ИсторияПеремещенияОборудования

&НаКлиенте
Процедура ВыборВидаИерархииИсторияПриИзменении(Элемент)
	
	ПолучитьИсториюПеремещения();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияПеремещенияОборудования1Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Не Элемент.ТекущиеДанные = Неопределено Тогда
		ПоказатьЗначение(,Элемент.ТекущиеДанные.Регистратор);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДополнительныеРеквизиты

&НаКлиенте
Процедура Подключаемый_Свойства_ЗначенияДополнительныхРеквизитовПриИзменении(Элемент)
	
	торо_УправлениеСвойствамиКлиент.Свойства_ЗначенияДополнительныхРеквизитовПриИзменении(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_Свойства_ЗначенияДополнительныхРеквизитовПриАктивизацииСтроки(Элемент)
	
	торо_УправлениеСвойствамиКлиент.Свойства_ЗначенияДополнительныхРеквизитовПриАктивизацииСтроки(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_Свойства_ЗначенияДополнительныхРеквизитовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_Свойства_ЗначенияДополнительныхРеквизитовПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_Свойства_ЗначенияДополнительныхРеквизитовПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	торо_УправлениеСвойствамиКлиент.Свойства_ЗначенияДополнительныхРеквизитовПриОкончанииРедактирования(ЭтаФорма, Элемент, НоваяСтрока, ОтменаРедактирования);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_Свойства_ЗначенияДополнительныхРеквизитовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	торо_УправлениеСвойствамиКлиент.Свойства_ЗначенияДополнительныхРеквизитовВыбор(ЭтаФорма, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДополнительныйРеквизитПриИзменении(Элемент)

	Если ЭтаФорма.Свойства_ОтображатьЗначенияВТаблице Тогда
		
		ТекущиеДанные = Элементы.Свойства_ЗначенияДополнительныхРеквизитов.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			СтрокаУнаследованного = УнаследованныеДопРеквизиты.НайтиСтроки(Новый Структура("Свойство", ТекущиеДанные.Свойство));
			
			Если СтрокаУнаследованного.Количество() > 0 Тогда
				СтрокаУнаследованного = СтрокаУнаследованного[0];
				ТекущиеДанные.ЭтоУнаследованный = (ТекущиеДанные.Значение = СтрокаУнаследованного.Значение);
			КонецЕсли;
		КонецЕсли;
	
	Иначе
		
		ИмяРеквизитаЗначение = Элемент.Имя;
		СтрокаУнаследованного = УнаследованныеДопРеквизиты.НайтиСтроки(Новый Структура("ИмяРеквизитаЗначение", ИмяРеквизитаЗначение));
		
		Если СтрокаУнаследованного.Количество() > 0 Тогда
			СтрокаУнаследованного = СтрокаУнаследованного[0];
			ЭтоУнаследованный = (ЭтаФорма[ИмяРеквизитаЗначение] = СтрокаУнаследованного.Значение);
			УстановитьОформлениеДопРеквизита(Элемент, ЭтоУнаследованный);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДополнительныйРеквизитОчистка(Элемент, СтандартнаяОбработка)

	Если ЭтаФорма.Свойства_ОтображатьЗначенияВТаблице Тогда
		
		ТекущиеДанные = Элементы.Свойства_ЗначенияДополнительныхРеквизитов.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			СтрокаУнаследованного = УнаследованныеДопРеквизиты.НайтиСтроки(Новый Структура("Свойство", ТекущиеДанные.Свойство));
			
			Если СтрокаУнаследованного.Количество() > 0 Тогда
				СтандартнаяОбработка = Ложь;
				СтрокаУнаследованного = СтрокаУнаследованного[0];
				ТекущиеДанные.Значение = СтрокаУнаследованного.Значение;
				ТекущиеДанные.ЭтоУнаследованный = Истина;
			Иначе
				СтрокаОписания = ЭтаФорма.Свойства_ОписаниеДополнительныхРеквизитов.НайтиСтроки(Новый Структура("Свойство", ТекущиеДанные.Свойство));
				Если СтрокаОписания.Количество() = 0 Тогда
					Возврат;
				КонецЕсли;
				СтрокаОписания = СтрокаОписания[0];
				
				УнаследоватьРеквизитЕслиВозможно(СтрокаОписания.ИмяРеквизитаЗначение, СтрокаОписания.Свойство, СтандартнаяОбработка, ТекущиеДанные.ПолучитьИдентификатор());
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ИмяРеквизитаЗначение = Элемент.Имя;
		СтрокаУнаследованного = УнаследованныеДопРеквизиты.НайтиСтроки(Новый Структура("ИмяРеквизитаЗначение", ИмяРеквизитаЗначение));
		Если СтрокаУнаследованного.Количество() > 0 Тогда
			СтандартнаяОбработка = Ложь;
			СтрокаУнаследованного = СтрокаУнаследованного[0];
			ЭтаФорма[ИмяРеквизитаЗначение] = СтрокаУнаследованного.Значение;
			УстановитьОформлениеДопРеквизита(Элемент, Истина);
		Иначе
			СтрокаОписания = ЭтаФорма.Свойства_ОписаниеДополнительныхРеквизитов.НайтиСтроки(Новый Структура("ИмяРеквизитаЗначение", ИмяРеквизитаЗначение));
			Если СтрокаОписания.Количество() = 0 Тогда
				Возврат;
			КонецЕсли;
			СтрокаОписания = СтрокаОписания[0];
			
			УнаследоватьРеквизитЕслиВозможно(ИмяРеквизитаЗначение, СтрокаОписания.Свойство, СтандартнаяОбработка);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКонтактнаяИнформация

// СтандартныеПодсистемы.КонтактнаяИнформация
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)
        УправлениеКонтактнойИнформациейКлиент.ПриИзменении(ЭтотОбъект, Элемент);
КонецПроцедуры
	
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриНажатии(Элемент, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОчистка(Элемент, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.Очистка(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияВыполнитьКоманду(Команда)
    УправлениеКонтактнойИнформациейКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиент.АвтоПодборАдреса(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Элемент.Имя, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ОбновитьКонтактнуюИнформацию(Результат)
    УправлениеКонтактнойИнформацией.ОбновитьКонтактнуюИнформацию(ЭтотОбъект, Объект, Результат);
КонецПроцедуры
// Конец СтандартныеПодсистемы.КонтактнаяИнформация

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Скопировать(Команда)
	
	ДанныеДляКопирования = ПолучитьДанныеДляКопирования(Объект.Ссылка);
	
	РодительИерархииДляКопирования  = ДанныеДляКопирования.РодительИерархии;
	СтруктураИерархииДляКопирования = ДанныеДляКопирования.ИерархияДляВводаНовыхОР;
	
	торо_РаботаСИерархией20Клиент.СоздатьОбъектРемонтаКопированием(ЭтаФорма, Объект.Ссылка, Объект.ЭтоГруппа, СтруктураИерархииДляКопирования, РодительИерархииДляКопирования);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ВвестиОткрытьДокументПринятиеКУчету(Команда)
	
	Если ЗначениеЗаполнено(РегистраторПринятияКУчету) Тогда
		ОткрытьФорму("Документ.торо_ПринятиеОРКУчету.ФормаОбъекта", Новый Структура("Ключ", РегистраторПринятияКУчету), ЭтаФорма);
	Иначе
		
		ЗначенияЗаполнения = Новый Структура();
		ЗначенияЗаполнения.Вставить("ОбъектРемонта", Объект.Ссылка);
		ЗначенияЗаполнения.Вставить("ТекСтруктураИерархии", ТекСтруктураИерархии);
		
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
		
		ОткрытьФорму("Документ.торо_ПринятиеОРКУчету.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиОткрытьДокументСнятияСУчета(Команда)
	
	Если ЗначениеЗаполнено(РегистраторСнятияСУчета) Тогда
		ОткрытьФорму("Документ.торо_ВыбытиеОбъектаРемонта.ФормаОбъекта", Новый Структура("Ключ", РегистраторСнятияСУчета), ЭтаФорма);
	Иначе
		ЗначенияЗаполнения = Новый Структура();
		ЗначенияЗаполнения.Вставить("ОбъектРемонта", Объект.Ссылка);
		ЗначенияЗаполнения.Вставить("ТекСтруктураИерархии", ТекСтруктураИерархии);
		
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);

		ОткрытьФорму("Документ.торо_ВыбытиеОбъектаРемонта.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзображение(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ТекстВопроса = НСтр("es='Para la elección de la imagen es necesario anotar el objeto. ¿Anotar?';ru='Для выбора изображения необходимо записать объект. Записать?';en='To select an image, an object must be recorded. To record?'");
		Ответ = Неопределено;

		ПоказатьВопрос(Новый ОписаниеОповещения("ДобавитьИзображениеЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
        Возврат;
		
	КонецЕсли;
	
	ДобавитьИзображениеФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьИзображение(Команда)
	
	ОчиститьСообщения();
	
	Если ЗначениеЗаполнено(Объект.ФайлКартинки) Тогда
		
		РаботаСФайламиКлиент.ОткрытьФормуФайла(Объект.ФайлКартинки);
		
	Иначе
		
		ТекстСообщения = НСтр("es='Falta la imagen para la redacción';ru='Отсутствует изображение для редактирования';en='Missing image for editing.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "АдресКартинки");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьИзображение(Команда)
	
	Объект.ФайлКартинки = ПредопределенноеЗначение("Справочник.НоменклатураПрисоединенныеФайлы.ПустаяСсылка");
	АдресКартинки = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотретьИзображение(Команда)
	
	ПросмотретьПрисоединенныйФайл("ФайлКартинки", "АдресКартинки",
		НСтр("es='Falta la imagen para la presentación';ru='Отсутствует изображение для просмотра';en='Missing image to view'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКартинкуИзПрисоединенныхФайлов(Команда)
	
	РаботаСФайламиКлиент.ОткрытьФормуВыбораФайлов(Объект.Ссылка, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьИзображение(Команда)
	ОтображатьИзображение = Не ОтображатьИзображение;
	Элементы.ФормаПоказатьСкрытьИзображение.Пометка = ОтображатьИзображение;
	Элементы.ГруппаДанныеЭксплПравая.Видимость      = ОтображатьИзображение;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПоложениеВИерархии(Команда)
	
	ПараметрыФормы = Новый Структура("ТекущаяСтрока, СтруктураИерархии", Объект.Ссылка, ТекСтруктураИерархии);
	ОткрытьФорму("Справочник.торо_ОбъектыРемонта.ФормаВыбора", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТехническиеДанные(Команда)
	ТиповойОРПриИзменении(Элементы.ТиповойОР);
КонецПроцедуры

#Область ПОКАЗАТЕЛИ_ЭКСПЛУАТАЦИИ

// Измеряемые показатели 

&НаКлиенте
Процедура ПодборКонтролируемыхПоказателей(Команда)
	
	СтандартнаяОбработка = Ложь;
	СписокОтбора = Новый СписокЗначений();
	
	Для каждого Строка Из СписокИзмеряемыхПоказателей Цикл
		Если НЕ Строка.Удален Тогда
			СписокОтбора.Добавить(Строка.Показатель);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыФормыСтруктура = Новый Структура("КлючНазначенияИспользования, СписокОтбора, ЗакрыватьПриВыборе", "ОбъектыРемонта", СписокОтбора, Ложь);
	ОткрытьФорму("ПланВидовХарактеристик.торо_ИзмеряемыеПоказателиОбъектовРемонта.ФормаВыбора", ПараметрыФормыСтруктура, Элементы.СписокИзмеряемыхПоказателей, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияКонтролируемыхПоказателейПоказатьЛегенду(Команда)
	
	ЭлементФормыКнопка = Элементы.ЗначенияКонтролируемыхПоказателейПоказатьЛегенду;
	ВидимостьЛегенды = Не ЭлементФормыКнопка.Пометка;
	ЭлементФормыКнопка.Пометка = ВидимостьЛегенды;
	Элементы.ЗначенияКонтролируемыхПоказателейЛегенда.Видимость = ВидимостьЛегенды;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьУдаленныеПоказатели(Команда)
	Элементы.СписокИзмеряемыхПоказателейПоказыватьУдаленныеПоказатели.Пометка = НЕ Элементы.СписокИзмеряемыхПоказателейПоказыватьУдаленныеПоказатели.Пометка;
	УстановитьОтборНеИспользуемыхСтрок(Элементы.СписокИзмеряемыхПоказателейПоказыватьУдаленныеПоказатели.Пометка,"СписокИзмеряемыхПоказателей");
КонецПроцедуры

&НаКлиенте
Процедура ВводЗначенияКонтрПоказателей(Команда)
	
	ТекДанные = Элементы.СписокИзмеряемыхПоказателей.ТекущиеДанные;
	Если ТекДанные = Неопределено ИЛИ ТекДанные.Удален Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Или МодифицированностьИзмеряемыхПоказателей Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ВводЗначенияКонтрПоказателейВопросЗаписать", ЭтотОбъект), НСтр("es='¿Anotar el objeto de la reparación para la introducción de la información por los índices medidos?';ru='Записать объект ремонта для ввода информации по измеряемым показателям?';en='Write the object of repair to enter information on the measured indicators?'"), РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	ВводЗначенияКонтрПоказателейЗавершение();
	
КонецПроцедуры

// Наработка

&НаКлиенте
Процедура ВводНаработки(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ВводНаработкиВопросЗаписать",ЭтотОбъект),НСтр("es='¿Anotar el objeto de la reparación para la introducción de la información por la elaboración?';ru='Записать объект ремонта для ввода информации по наработке?';en='Write the repair object to enter operating time information?'"),
		РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;	
	
	ВводНаработкиФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЖурналНаработки(Команда)
	
	МассивСтрокНаработки = ПолучитьМассивДокументовНаработки(Объект.Ссылка);
		
	ТабВыработкиОбъектаРемонта.Очистить();
	Для каждого Элемент Из МассивСтрокНаработки Цикл
		НС = ТабВыработкиОбъектаРемонта.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Элемент);
	КонецЦикла;
	
	СписокПараметровНаработкиПриАктивизацииСтроки(Истина);
	ОбновитьЗначенияИзноса();
			
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьМаксЗначенияПараметровНаработки(Команда)
	
	ОбновитьМаксЗначенияПараметровНаработкиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетСостояниеОборудованияНаработка(Команда)
	
	Если ТипЗнч(Элементы.СписокПараметровНаработки.ТекущиеДанные.ОбъектРемонта) = Тип ("СправочникСсылка.торо_ТиповыеОР") Тогда 
		ТекстСообщения = НСтр("es='El índice dado de la elaboración no se es apropiado a este objeto de la reparación.';ru='Данный показатель наработки не присвоен этому объекту ремонта.';en='This operating time indicator is not assigned to this repair facility.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	
	Если Элементы.СписокПараметровНаработки.ТекущиеДанные <> Неопределено Тогда
		
		ПараметрыОтчет = Новый Структура();
		ПараметрыОтчет.Вставить("ОбъектРемонта",Объект.Ссылка);	
		ПараметрыОтчет.Вставить("ТекПоказательНаработки",Элементы.СписокПараметровНаработки.ТекущиеДанные.Показатель);
		ПараметрыОтчет.Вставить("СформироватьПриОткрытии",Истина);
		ПараметрыОтчет.Вставить("ВыводитьСуммуВыделенныхЯчеек",Ложь);
		
		ОткрытьФорму("Отчет.торо_СостояниеОборудования.Форма",ПараметрыОтчет);
	Иначе
		ТекстСообщения = НСтр("es='de la elaboración. Para la conclusión del informe añadan el índice a la forma.';ru='Не выбран показатель наработки. Для вывода отчета добавьте показатель на форму.';en='No running time indicator selected. To display a report, add a metric to the form.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетНаработкаОборудования(Команда)
	
	ПараметрыОтчет = Новый Структура();
	ПараметрыОтчет.Вставить("ОбъектРемонта", Объект.Ссылка);	
	ПараметрыОтчет.Вставить("СтруктураИерархии", ТекСтруктураИерархии);
	ПараметрыОтчет.Вставить("ВместеСПодчиненными", Ложь);
	ПараметрыОтчет.Вставить("ДатаНач", НачалоГода(ТекущаяДата()));
	ПараметрыОтчет.Вставить("ДатаКон", ТекущаяДата());
	ПараметрыОтчет.Вставить("ВыводитьСуммуВыделенныхЯчеек",Ложь);
	ПараметрыОтчет.Вставить("СформироватьПриОткрытии",Истина);
	
	ОткрытьФорму("Отчет.торо_НаработкаОборудованияСПоследнихРемонтов.Форма",ПараметрыОтчет);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоказательИзТипового(Команда)
	ТекущиеДанные = Элементы.СписокПараметровНаработки.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
	    ТекстСообщения = НСтр("es='¡Escojan el índice!';ru='Выберите показатель!';en='Choose an indicator!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	МассивПоказателей = Новый Массив;
	МассивПоказателей.Добавить(ТекущиеДанные.Показатель);
	
	МассивПоказателейСЗначениями = ПоказателиИзТиповыхОР(Объект.ТиповойОР, МассивПоказателей);
	Если МассивПоказателейСЗначениями.Количество() = 0 Тогда
	    ШаблонСообщения = НСтр("en='Typical EI %1 does not have %2 indicator!';es='¡A tipo ОР %1 no hay índice %2!';ru='У типового ОР %1 нет показателя %2!'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, Объект.ТиповойОР, ТекущиеДанные.Показатель);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	СтруктураПараметр = Новый Структура;
	СтруктураПараметр.Вставить("ТекущиеДанные", ТекущиеДанные);
	СтруктураПараметр.Вставить("МассивПоказателей", МассивПоказателей);
	СтруктураПараметр.Вставить("МассивСтрокПоказателей", Новый Массив);
	СтруктураПараметр.Вставить("ПоказателиСЗначениями", МассивПоказателейСЗначениями);
	Если ЗначениеЗаполнено(ТекущиеДанные.ПлановаяНаработка)
		Или ЗначениеЗаполнено(ТекущиеДанные.ПродолжительностьПериодаПлановойНаработки)
		Или ЗначениеЗаполнено(ТекущиеДанные.ПериодПлановойНаработки)
		Или ЗначениеЗаполнено(ТекущиеДанные.КоэффициентИспользованияОборудования) Тогда
		ТекстВопроса = НСтр("es='Para el índice escogido son rellenados los campos. ¿Перезаполнить de ellos?';ru='Для выбранного показателя заполнены поля. Перезаполнить их?';en='Fields are filled for the selected indicator. Refill them?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПоказателиЗавершение", ЭтотОбъект, СтруктураПараметр);
	    ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
	    ЗаполнитьПоказателиЗавершение(КодВозвратаДиалога.Да, СтруктураПараметр);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВыбранныеПоказателиИзТипового(Команда)
	ВыделенныеСтроки = Элементы.СписокПараметровНаработки.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() = 0 Тогда
	    ТекстСообщения = НСтр("es='¡Escojan el índice!';ru='Выберите показатель!';en='Choose an indicator!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	МассивПоказателей = Новый Массив;
	МассивСтрокПоказателей = Новый Массив;
	ЕстьЗаполненныеПоля = Ложь;
	Для каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
	    Показатель = СписокПараметровНаработки.НайтиПоИдентификатору(ВыделеннаяСтрока);
		МассивПоказателей.Добавить(Показатель.Показатель);
		МассивСтрокПоказателей.Добавить(Показатель);
		ЕстьЗаполненныеПоля = ЗначениеЗаполнено(Показатель.ПлановаяНаработка)
								Или ЗначениеЗаполнено(Показатель.ПродолжительностьПериодаПлановойНаработки)
								Или ЗначениеЗаполнено(Показатель.ПериодПлановойНаработки)
								Или ЗначениеЗаполнено(Показатель.КоэффициентИспользованияОборудования);
	КонецЦикла;
	
	ПоказателиСЗначениями = ПоказателиИзТиповыхОР(Объект.ТиповойОР, МассивПоказателей, Истина);
	Если ПоказателиСЗначениями.Количество() = 0 Тогда
	    ШаблонСообщения = НСтр("en='No indicator selected from sample EI  %1!';es='¡No es escogido ni un índice de tipo ОР %1!';ru='Не выбран ни один показатель из типового ОР %1!'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, Объект.ТиповойОР);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;

	СтруктураПараметр = Новый Структура;
	СтруктураПараметр.Вставить("ТекущиеДанные", Неопределено);
	СтруктураПараметр.Вставить("МассивПоказателей", МассивПоказателей);
	СтруктураПараметр.Вставить("МассивСтрокПоказателей", МассивСтрокПоказателей);
	СтруктураПараметр.Вставить("ПоказателиСЗначениями", ПоказателиСЗначениями);
	Если ЕстьЗаполненныеПоля Тогда
		ТекстВопроса = НСтр("es='Cerca de algunos índices son rellenados los campos. ¿Перезаполнить de ellos?';ru='У некоторых показателей заполнены поля. Перезаполнить их?';en='Some indicators are filled with fields. Refill them?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПоказателиЗавершение", ЭтотОбъект, СтруктураПараметр);
	    ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
	    ЗаполнитьПоказателиЗавершение(КодВозвратаДиалога.Да, СтруктураПараметр);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоказателиИзТипового(Команда)
	МассивПоказателей = Новый Массив;
	ЕстьЗаполненныеПоля = Ложь;
	Для каждого СтрокаПоказателя Из СписокПараметровНаработки Цикл
		МассивПоказателей.Добавить(СтрокаПоказателя.Показатель);
		ЕстьЗаполненныеПоля = ЗначениеЗаполнено(СтрокаПоказателя.ПлановаяНаработка)
								Или ЗначениеЗаполнено(СтрокаПоказателя.ПродолжительностьПериодаПлановойНаработки)
								Или ЗначениеЗаполнено(СтрокаПоказателя.ПериодПлановойНаработки)
								Или ЗначениеЗаполнено(СтрокаПоказателя.КоэффициентИспользованияОборудования);
	КонецЦикла;
	
	Если МассивПоказателей.Количество() = 0 Тогда
	    ТекстСообщения = НСтр("es='¡Escojan el índice!';ru='Выберите показатель!';en='Choose an indicator!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ПоказателиСЗначениями = ПоказателиИзТиповыхОР(Объект.ТиповойОР, МассивПоказателей);
	Если ПоказателиСЗначениями.Количество() = 0 Тогда
	    ШаблонСообщения = НСтр("en='No indicator selected from sample EI  %1!';es='¡No es escogido ni un índice de tipo ОР %1!';ru='Не выбран ни один показатель из типового ОР %1!'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, Объект.ТиповойОР);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;

	СтруктураПараметр = Новый Структура;
	СтруктураПараметр.Вставить("ТекущиеДанные", Неопределено);
	СтруктураПараметр.Вставить("МассивПоказателей", МассивПоказателей);
	СтруктураПараметр.Вставить("МассивСтрокПоказателей", Новый Массив);
	СтруктураПараметр.Вставить("ПоказателиСЗначениями", ПоказателиСЗначениями);
	Если ЕстьЗаполненныеПоля Тогда
		ТекстВопроса = НСтр("es='Cerca de algunos índices son rellenados los campos. ¿Перезаполнить de ellos?';ru='У некоторых показателей заполнены поля. Перезаполнить их?';en='Some indicators are filled with fields. Refill them?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПоказателиЗавершение", ЭтотОбъект, СтруктураПараметр);
	    ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
	    ЗаполнитьПоказателиЗавершение(КодВозвратаДиалога.Да, СтруктураПараметр);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоказателиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт

	ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
	МассивПоказателей = ДополнительныеПараметры.МассивПоказателей;
	МассивСтрокПоказателей = ДополнительныеПараметры.МассивСтрокПоказателей;
	ПоказателиСЗначениями = ДополнительныеПараметры.ПоказателиСЗначениями;
	
	Если Не ТекущиеДанные = Неопределено Тогда
		ИсключаемыеСвойства = "";
		ИсключаемыеСвойства = ИсключаемыеСвойства + ?(ЗначениеЗаполнено(ТекущиеДанные.ПлановаяНаработка) И РезультатВопроса = КодВозвратаДиалога.Нет, "ПлановаяНаработка,", "");
		ИсключаемыеСвойства = ИсключаемыеСвойства + ?(ЗначениеЗаполнено(ТекущиеДанные.ПродолжительностьПериодаПлановойНаработки) И РезультатВопроса = КодВозвратаДиалога.Нет, "ПродолжительностьПериодаПлановойНаработки,", "");
		ИсключаемыеСвойства = ИсключаемыеСвойства + ?(ЗначениеЗаполнено(ТекущиеДанные.ПериодПлановойНаработки) И РезультатВопроса = КодВозвратаДиалога.Нет, "ПериодПлановойНаработки,", "");
		ИсключаемыеСвойства = ИсключаемыеСвойства + ?(ЗначениеЗаполнено(ТекущиеДанные.КоэффициентИспользованияОборудования) И РезультатВопроса = КодВозвратаДиалога.Нет, "КоэффициентИспользованияОборудования,", "");
		Если ЗначениеЗаполнено(ИсключаемыеСвойства) Тогда
		    ИсключаемыеСвойства = Лев(ИсключаемыеСвойства, СтрДлина(ИсключаемыеСвойства) - 1);
		КонецЕсли; 
				
		Если ПоказателиСЗначениями.Количество() > 0 Тогда
		    ЗаполнитьЗначенияСвойств(ТекущиеДанные, ПоказателиСЗначениями[0],, ИсключаемыеСвойства);
			ТекущиеДанные.ОбъектРемонта = Объект.Ссылка;
			МодифицированностьПараметровНаработки = Истина;
			Модифицированность = Истина;
		КонецЕсли;
				
		Возврат;
	КонецЕсли; 

	Если ТипЗнч(ПоказателиСЗначениями) = Тип("Соответствие") Тогда
	    Для каждого СтрокаТЧ Из МассивСтрокПоказателей Цикл
		    НайденныйПоказатель = ПоказателиСЗначениями.Получить(СтрокаТЧ.Показатель);
			Если Не ЗначениеЗаполнено(НайденныйПоказатель) Тогда
			    Продолжить;
			КонецЕсли;
			
			ИсключаемыеСвойства = "";
			ИсключаемыеСвойства = ИсключаемыеСвойства + ?(ЗначениеЗаполнено(СтрокаТЧ.ПлановаяНаработка) И РезультатВопроса = КодВозвратаДиалога.Нет, "ПлановаяНаработка,", "");
			ИсключаемыеСвойства = ИсключаемыеСвойства + ?(ЗначениеЗаполнено(СтрокаТЧ.ПродолжительностьПериодаПлановойНаработки) И РезультатВопроса = КодВозвратаДиалога.Нет, "ПродолжительностьПериодаПлановойНаработки,", "");
			ИсключаемыеСвойства = ИсключаемыеСвойства + ?(ЗначениеЗаполнено(СтрокаТЧ.ПериодПлановойНаработки) И РезультатВопроса = КодВозвратаДиалога.Нет, "ПериодПлановойНаработки,", "");
			ИсключаемыеСвойства = ИсключаемыеСвойства + ?(ЗначениеЗаполнено(СтрокаТЧ.КоэффициентИспользованияОборудования) И РезультатВопроса = КодВозвратаДиалога.Нет, "КоэффициентИспользованияОборудования,", "");
			Если ЗначениеЗаполнено(ИсключаемыеСвойства) Тогда
			    ИсключаемыеСвойства = Лев(ИсключаемыеСвойства, СтрДлина(ИсключаемыеСвойства) - 1);
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, НайденныйПоказатель,, ИсключаемыеСвойства);
			СтрокаТЧ.ОбъектРемонта = Объект.Ссылка;
			МодифицированностьПараметровНаработки = Истина;
			Модифицированность = Истина;
		КонецЦикла;
	ИначеЕсли ТипЗнч(ПоказателиСЗначениями) = Тип("Массив") Тогда
	    Для каждого Показатель Из ПоказателиСЗначениями Цикл
			СтруктураПоиска = Новый Структура("Показатель", Показатель.Показатель);
			НайденныеПоказатели = СписокПараметровНаработки.НайтиСтроки(СтруктураПоиска);
			
			Для каждого НайденныйПоказатель Из НайденныеПоказатели Цикл
				ИсключаемыеСвойства = "";
				ИсключаемыеСвойства = ИсключаемыеСвойства + ?(ЗначениеЗаполнено(НайденныйПоказатель.ПлановаяНаработка) И РезультатВопроса = КодВозвратаДиалога.Нет, "ПлановаяНаработка,", "");
				ИсключаемыеСвойства = ИсключаемыеСвойства + ?(ЗначениеЗаполнено(НайденныйПоказатель.ПродолжительностьПериодаПлановойНаработки) И РезультатВопроса = КодВозвратаДиалога.Нет, "ПродолжительностьПериодаПлановойНаработки,", "");
				ИсключаемыеСвойства = ИсключаемыеСвойства + ?(ЗначениеЗаполнено(НайденныйПоказатель.ПериодПлановойНаработки) И РезультатВопроса = КодВозвратаДиалога.Нет, "ПериодПлановойНаработки,", "");
				ИсключаемыеСвойства = ИсключаемыеСвойства + ?(ЗначениеЗаполнено(НайденныйПоказатель.КоэффициентИспользованияОборудования) И РезультатВопроса = КодВозвратаДиалога.Нет, "КоэффициентИспользованияОборудования,", "");
				Если ЗначениеЗаполнено(ИсключаемыеСвойства) Тогда
				    ИсключаемыеСвойства = Лев(ИсключаемыеСвойства, СтрДлина(ИсключаемыеСвойства) - 1);
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(НайденныйПоказатель, Показатель,, ИсключаемыеСвойства);
				НайденныйПоказатель.ОбъектРемонта = Объект.Ссылка;
				МодифицированностьПараметровНаработки = Истина;
				Модифицированность = Истина;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

// Состояние ОР

&НаКлиенте
Процедура ВводСостояния(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ВводСостоянияЗавершение", ЭтотОбъект), НСтр("es='¿Anotar el objeto de la reparación para la introducción de la información sobre el estado?';ru='Записать объект ремонта для ввода информации о состоянии?';en='Write a repair item to enter status information?'"), РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	ВводСостоянияФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ВводСостоянияНаПериод(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ВводСостоянияНаПериодЗавершение", ЭтотОбъект), НСтр("es='¿Anotar el objeto de la reparación para la introducción de la información sobre el estado?';ru='Записать объект ремонта для ввода информации о состоянии?';en='Write a repair item to enter status information?'"), РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	ВводСостоянияНаПериодФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	Строить = Истина;
	Если ОтборПоПериоду Тогда
		Если Не ЗначениеЗаполнено(ДатаНачала) Тогда
			Строить = Ложь;
			ТекстСообщения = НСтр("es='¡No es rellenada la fecha ha comenzado para la selección!';ru='Не заполнена дата начала для отбора!';en='Start date for selection is not filled!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ДатаОкончания) Тогда
			Строить = Ложь;
			ТекстСообщения = НСтр("es='la selección!';ru='Не заполнена дата окончания для отбора!';en='Not completed completion date for selection!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		Если Строить И ДатаНачала > ДатаОкончания Тогда
			Строить = Ложь;
			ТекстСообщения = НСтр("es='¡La fecha ha comenzado para la selección más de fechas de la terminación!';ru='Дата начала для отбора больше даты окончания!';en='The start date for the selection is greater than the end date!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
		
	Если Строить Тогда	
		ПостроитьГрафикСостоянийОР();	
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьЛегенду(Команда)
	
	Элементы.ПоказыватьЛегенду.Пометка = Не Элементы.ПоказыватьЛегенду.Пометка;
	
	Элементы.ЛегендаГрафика.Видимость = Элементы.ПоказыватьЛегенду.Пометка;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетСостояниеОборудования(Команда)
	
	Если Элементы.СписокИзмеряемыхПоказателей.ТекущиеДанные <> Неопределено Тогда
		
		ПараметрыОтчет = Новый Структура();
		ПараметрыОтчет.Вставить("ОбъектРемонта",Объект.Ссылка);	
		ПараметрыОтчет.Вставить("СформироватьПриОткрытии",Истина);
		ПараметрыОтчет.Вставить("ВыводитьСуммуВыделенныхЯчеек",Ложь);
		
		ОткрытьФорму("Отчет.гкс_СостояниеОборудования.Форма",ПараметрыОтчет);
	Иначе
		ТекстСообщения = НСтр("es='No es escogido el índice controlado. Para la conclusión del informe añadan el índice a la forma.';ru='Не выбран контролируемый показатель. Для вывода отчета добавьте показатель на форму.';en='No controlled metric selected. To display a report, add a metric to the form.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область НОРМАТИВЫ_ПЛАНИРОВАНИЯ

&НаКлиенте
Процедура ПоказыватьУдаленныеНормативы(Команда)
	Элементы.НормативныеРемонтыПоказыватьУдаленныеНормативы.Пометка = НЕ Элементы.НормативныеРемонтыПоказыватьУдаленныеНормативы.Пометка;
	УстановитьОтборНеИспользуемыхСтрок(Элементы.НормативныеРемонтыПоказыватьУдаленныеНормативы.Пометка,"НормативныеРемонты");
КонецПроцедуры

&НаКлиенте
Процедура РемонтныеЦиклыОбъекта(Команда)
	
	Элементы.ТабличноеПолеРемонтныеЦиклыОборудованияРемонтныеЦиклыОбъекта.Пометка = Не Элементы.ТабличноеПолеРемонтныеЦиклыОборудованияРемонтныеЦиклыОбъекта.Пометка;
	НаложитьОтборНаРемЦиклы(Элементы.ТабличноеПолеРемонтныеЦиклыОборудованияРемонтныеЦиклыОбъекта.Пометка, Элементы.ТабличноеПолеРемонтныеЦиклыОборудованияРемонтныеЦиклыГруппы.Пометка);
	
КонецПроцедуры

&НаКлиенте
Процедура РемонтныеЦиклыГруппы(Команда)
	
	Элементы.ТабличноеПолеРемонтныеЦиклыОборудованияРемонтныеЦиклыГруппы.Пометка = Не Элементы.ТабличноеПолеРемонтныеЦиклыОборудованияРемонтныеЦиклыГруппы.Пометка;
	НаложитьОтборНаРемЦиклы(Элементы.ТабличноеПолеРемонтныеЦиклыОборудованияРемонтныеЦиклыОбъекта.Пометка, Элементы.ТабличноеПолеРемонтныеЦиклыОборудованияРемонтныеЦиклыГруппы.Пометка);
	
КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоВозрастаниюРемЦиклы(Команда)
	СортироватьПоВозрастаниюНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоУбываниюРемЦиклы(Команда)
	СортироватьПоУбываниюНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Перерасчитать(Команда)
	
	ТаблицаРемонтовВизуализация.Очистить();
	Декорация1 = "";
	
	СписокВидовРемонтов = ЗаполнитьВидыРемонтаНаСервере();
	Если СписокВидовРемонтов.Количество() = 0 Тогда
		ТекстСообщения = НСтр("es='Es imposible contar la estructura del ciclo de reparación, puesto que no son rellenadas las reparaciones normativas';ru='Невозможно рассчитать структуру ремонтного цикла, так как не заполнены нормативные ремонты';en='Unale to calculate the structure of the repair cycle, since regulatory repairs are not completed'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
		
	СписокВидовРемонтов.ЗаполнитьПометки(Истина);
	СписокВидовРемонтов.ПоказатьОтметкуЭлементов(Новый ОписаниеОповещения("ПерерасчитатьЗавершение",ЭтотОбъект), НСтр("es='Escojan los tipos de los trabajos de reparación';ru='Выберите виды ремонтных работ';en='Choose types of repair work'"));
	
КонецПроцедуры

&НаКлиенте
Процедура Построить(Команда)
	Если ТаблицаРемонтовВизуализация.Количество() > 0 Тогда
		НарисоватьМнемосхему(ОбщаяПродолжительность);	
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
	
	МассивРемонтов = Новый Массив;
	
	Для каждого Стр из ЗапланированныеРемонты Цикл
		
		СтруктураПараметр = Новый Структура("ВидРемонтныхРабот, Выбран, Цвет, ЦветТекста, Шрифт");
		ЗаполнитьЗначенияСвойств(СтруктураПараметр,Стр);
				
		МассивРемонтов.Добавить(СтруктураПараметр);
		
	КонецЦикла;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаЗакрытияФормыНастроек", ЭтаФорма);
	ОткрытьФорму("Справочник.торо_ОбъектыРемонта.Форма.ФормаВРВизуализация", Новый Структура("МассивРемонтов, Нормировать",МассивРемонтов, Нормировать),ЭтаФорма,ЭтаФорма,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	Если МожноПечататьВизуализацию Тогда
		ТабДок = ПечатьНаСервере();
		КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("СтруктураРемонтногоЦикла");
		КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабДок;
		УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм);
	Иначе
		ТекстСообщения = НСтр("es='¡Es imposible desellar la estructura del ciclo de reparación, puesto que no es construido!';ru='Невозможно распечатать структуру ремонтного цикла, так как она еще не построена!';en='Unable to print the repair cycle structure, as it has not yet been built!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборЗапчастей(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимПодбораБезСуммовыхПараметров",        Истина);
	ПараметрыФормы.Вставить("ИспользоватьДатыОтгрузки",                 Истина);
	ПараметрыФормы.Вставить("СкрыватьКолонкуВидЦены",                   Истина);
	ПараметрыФормы.Вставить("СкрыватьКомандуЦеныНоменклатуры",          Истина);
	ПараметрыФормы.Вставить("Заголовок",                                НСтр("es='La selección de las partes de recambio';ru='Подбор запчастей';en='Parts selection'"));
	ПараметрыФормы.Вставить("ЗаголовокКнопкиЗапрашиватьКоличествоИЦену",НСтр("es='Pedir la cantidad';ru='Запрашивать количество';en='Request quantity'"));
	ПараметрыФормы.Вставить("Дата",                                     ТекущаяДата());
	ПараметрыФормы.Вставить("Документ",                                 Объект.Ссылка);
	ПараметрыФормы.Вставить("КлючНазначенияИспользования",				"ПростойПодборНоменклатуры");
	ПараметрыФормы.Вставить("ОтборПоТипуНоменклатуры",					Новый Массив(Элементы.ТабЗапчастейОбъектовРемонтаНоменклатура.ПараметрыВыбора[0].Значение));
	
	ОткрытьФорму("Обработка.торо_ПодборНоменклатуры.Форма", ПараметрыФормы, Элементы.ТабЗапчастейОбъектовРемонта, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьУдаленныеЗапчасти(Команда)
	
	Элементы.ТабЗапчастейОбъектовРемонтаПоказыватьУдаленныеЗапчасти.Пометка = НЕ Элементы.ТабЗапчастейОбъектовРемонтаПоказыватьУдаленныеЗапчасти.Пометка;
	УстановитьОтборНеИспользуемыхСтрок(Элементы.ТабЗапчастейОбъектовРемонтаПоказыватьУдаленныеЗапчасти.Пометка,"ТабЗапчастейОбъектовРемонта");
	
	текДанные = Элементы.ТабЗапчастейОбъектовРемонта.ТекущиеДанные;
	Если текДанные <> Неопределено Тогда
		Элементы.ТабЗатратПоВидамРемонта.ОтборСтрок = УстановитьОтборДляТЧТабЗатратПоВидамРемонта(
			Элементы.ТабЗапчастейОбъектовРемонта.ТекущиеДанные.Номенклатура,
			Элементы.ТабЗапчастейОбъектовРемонта.ТекущиеДанные.Характеристика);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьИсторию(Команда)
	
	Элементы.ТаблицаОценокРМОтображатьИсторию.Пометка = НЕ Элементы.ТаблицаОценокРМОтображатьИсторию.Пометка;
	ОбновитьОценкиРМ(Элементы.ТаблицаОценокРМОтображатьИсторию.Пометка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВидыРемонтовИзНормативов(Команда)
	Для Каждого ТекСтрока Из НормативныеРемонты Цикл
		ВведенныеОценки = РСНЗТаблицаОценокРМ.НайтиСтроки(Новый Структура("ВидРемонта, Период", ТекСтрока.ВидРемонта, НачалоМесяца(ТекущаяДата())));
		Если ВведенныеОценки.Количество() = 0 Тогда 
			НС = РСНЗТаблицаОценокРМ.Добавить();
			НС.Период = НачалоМесяца(ТекущаяДата());
			НС.ВидРемонта = ТекСтрока.ВидРемонта;
			НС.ГруппаОбъектовРемонтов = Объект.Ссылка;
			НС.Сезон = ПредопределенноеЗначение("Справочник.торо_Сезоны.ПустаяСсылка");
		КонецЕсли;
	КонецЦикла;
	
	ОбновитьОценкиРМ(Элементы.ТаблицаОценокРМОтображатьИсторию.Пометка);
	
	ТаблицаОценокРММодифицированность = Истина;
	Модифицированность = Модифицированность Или ТаблицаОценокРММодифицированность;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуРМ(Команда)
	МассивСтруктурСтрокТЧ = Новый Массив;
	КолонкиТЧ = "НомерСтроки, Период, ГруппаОбъектовРемонтов, ВидРемонта, Сезон, ВероятностьВыходаИзСтроя, Ущерб";
	Для каждого СтрокаТЧ Из ТаблицаОценокРМ Цикл
		Если НЕ СтрокаТЧ.ТиповойОР Тогда
			СтруктураСтроки = Новый Структура(КолонкиТЧ);
			ЗаполнитьЗначенияСвойств(СтруктураСтроки, СтрокаТЧ);
			СтруктураСтроки.НомерСтроки = ТаблицаОценокРМ.Индекс(СтрокаТЧ) + 1;
			МассивСтруктурСтрокТЧ.Добавить(СтруктураСтроки);
		КонецЕсли; 
	КонецЦикла;
	МассивВидовРемонта = Новый Массив;
	Для каждого Ремонт Из НормативныеРемонты Цикл
		Результат = МассивВидовРемонта.Найти(Ремонт.ВидРемонта);
		Если Результат = Неопределено Тогда
			МассивВидовРемонта.Добавить(Ремонт.ВидРемонта);	
		КонецЕсли; 
	КонецЦикла; 
	ПараметрыФормыЗаполнения = Новый Структура("МассивСтруктурСтрокТЧ, Ссылка, МассивВидовРемонта", МассивСтруктурСтрокТЧ, Объект.Ссылка, МассивВидовРемонта);
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ЗаполнитьДанныеОбИзмененииРМ", ЭтотОбъект);
	ОткрытьФорму("Справочник.торо_ОбъектыРемонта.Форма.ФормаЗаполненияОценкиРМ", ПараметрыФормыЗаполнения, ЭтаФорма,,,,ОписаниеОповещенияОЗакрытии,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОсновныеИЗависимыеПоИерархии(Команда)
	
	ОткрытьФорму("Справочник.торо_СтруктурыОР.ФормаВыбора",,,,,,Новый ОписаниеОповещения("ЗаполнитьОсновныеИЗависимыеПоИерархииВыбранаИерархия", ЭтаФорма), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗацикливаниеОсновногоЗависимогоОборудования(Команда)
	
	СохранитьДанныеИзЭлементовФормы(ЭтаФорма);
	УстановитьКоличествоОсновногоЗависимогоОборудования();
	ЗаполнитьОсновныеИЗависимыеРемонтыНаФорме();
	
	ЕстьЗацикливание = Ложь;
	
	ПроверитьЗацикливаниеОсновногоЗависимогоОборудованияНаСервере(ЕстьЗацикливание);
	
	Если НЕ ЕстьЗацикливание Тогда
		ТекстСообщения = НСтр("es='Las ciclaciones no existen.';ru='Зацикливания нет.';en='There is no looping.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область ЖурналыДокументов

&НаКлиенте
Процедура ОтображатьТолькоПроведенныеДефекты(Команда)
	Кнопка = Элементы.ВыявленныеДефектыОтображатьТолькоПроведенныеДефекты;
	Кнопка.Пометка = НЕ Кнопка.Пометка;
	УстановитьПараметрыЗапросовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьТолькоПроведенныеЗаявки(Команда)
	Кнопка = Элементы.ЗаявкиНаРемонтОтображатьТолькоПроведенныеЗаявки;
	Кнопка.Пометка = НЕ Кнопка.Пометка;
	УстановитьПараметрыЗапросовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьТолькоПроведенныеНаряды(Команда)
	Кнопка = Элементы.НарядыОтображатьТолькоПроведенныеНаряды;
	Кнопка.Пометка = НЕ Кнопка.Пометка;
	УстановитьПараметрыЗапросовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьТолькоПроведенныеАкты(Команда)
	Кнопка = Элементы.ВыполненныеРемонтыОтображатьТолькоПроведенныеАкты;
	Кнопка.Пометка = НЕ Кнопка.Пометка;
	УстановитьПараметрыЗапросовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьТолькоПроведенныеППР(Команда)
	Кнопка = Элементы.ПредстоящиеРемонтыОтображатьТолькоПроведенныеППР;
	Кнопка.Пометка = НЕ Кнопка.Пометка;
	УстановитьПараметрыЗапросовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьТолькоПроведенныеРМ(Команда)
	Кнопка = Элементы.ПредстоящиеРегМероприятияОтображатьТолькоПроведенныеРМ;
	Кнопка.Пометка = НЕ Кнопка.Пометка;
	УстановитьПараметрыЗапросовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьТолькоПроведенныеНарядыРМ(Команда)
	Кнопка = Элементы.НарядыРМОтображатьТолькоПроведенные;
	Кнопка.Пометка = НЕ Кнопка.Пометка;
	УстановитьПараметрыЗапросовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьТолькоПроведенныеАктыРМ(Команда)
	Кнопка = Элементы.ВыполненныеРМОтображатьТолькоПроведенные;
	Кнопка.Пометка = НЕ Кнопка.Пометка;
	УстановитьПараметрыЗапросовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьТолькоПроведенныеАктыПриемки(Команда)
	Кнопка = Элементы.АктыПриемкиОтображатьТолькоПроведенныеАкты;
	Кнопка.Пометка = НЕ Кнопка.Пометка;
	УстановитьПараметрыЗапросовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВвестиДефект(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ВвестиДефектПослеВопросаОЗаписи", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, НСтр("es='Para la continuación es necesario anotar la información sobre el objeto. ¿Anotar?';ru='Для продолжения необходимо записать информацию об объекте. Записать?';en='To continue, you must record information about the object. To record?'"), РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	ВвестиДефектЗавершение();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РаботаСИзображением

&НаКлиенте
Процедура ДобавитьИзображениеЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		 Если ЭтаФорма.ПроверитьЗаполнение() Тогда
			 Если ЭтаФорма.Записать() Тогда
				 ДобавитьИзображениеФрагмент();
			 КонецЕсли;
		 КонецЕсли;
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзображениеФрагмент()
    
    ВыборИзображения = Истина;
    ИдентификаторФайла = Новый УникальныйИдентификатор;
    
    РаботаСФайламиКлиент.ДобавитьФайлы(Объект.Ссылка, ИдентификаторФайла, торо_ОбщегоНазначенияКлиентСервер.ФильтрФайловИзображений());
    ВыборИзображения = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ПросмотретьПрисоединенныйФайл(ИмяРеквизитаОбъекта, ИмяРеквизитаФормы, ТекстСообщенияОбОшибке)
	
	ОчиститьСообщения();
	
	Если ЗначениеЗаполнено(Объект[ИмяРеквизитаОбъекта]) Тогда
		РаботаСФайламиКлиент.ОткрытьФайл(
			РаботаСФайламиСлужебныйВызовСервера.ПолучитьДанныеФайла(
				ЭтаФорма.Объект[ИмяРеквизитаОбъекта],
				УникальныйИдентификатор));
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщенияОбОшибке,, ИмяРеквизитаФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НавигационнаяСсылкаКартинки(ФайлКартинки, ИдентификаторФормы)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		АдресКартинки = РаботаСФайлами.ДанныеФайла(ФайлКартинки, ИдентификаторФормы).СсылкаНаДвоичныеДанныеФайла;
	Исключение
		ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		АдресКартинки = "";
	КонецПопытки;
	
	Возврат АдресКартинки;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьИзображениеНаКлиенте()
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ТекстВопроса = НСтр("es='Para la elección de la imagen es necesario anotar el objeto. ¿Anotar?';ru='Для выбора изображения необходимо записать объект. Записать?';en='To select an image, an object must be recorded. To record?'");
		Ответ = Неопределено;

		ПоказатьВопрос(Новый ОписаниеОповещения("ДобавитьИзображениеНаКлиентеЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
        Возврат;
		
	КонецЕсли;
	
	ДобавитьИзображениеНаКлиентеФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзображениеНаКлиентеЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		 Если ЭтаФорма.ПроверитьЗаполнение() Тогда
			 Если ЭтаФорма.Записать() Тогда
				 ДобавитьИзображениеНаКлиентеФрагмент();
			 КонецЕсли;
		 КонецЕсли;
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзображениеНаКлиентеФрагмент()
    
    Перем ИдентификаторФайла;
    
    ВыборИзображения   = Истина;
    ИдентификаторФайла = Новый УникальныйИдентификатор;
    
    РаботаСФайламиКлиент.ДобавитьФайлы(Объект.Ссылка, ИдентификаторФайла, торо_ОбщегоНазначенияКлиентСервер.ФильтрФайловИзображений());
    ВыборИзображения   = Ложь;

КонецПроцедуры

#КонецОбласти

#Область ПОКАЗАТЕЛИ_ЭКСПЛУАТАЦИИ

&НаСервере
Процедура ЗаписатьПоказателиЭксплуатации(ТекОбъект, Отказ)
	
	Если МодифицированностьПараметровНаработки Тогда
				
		Попытка
			ТаблицаЗначенийПараметровНаработки = СписокПараметровНаработки.Выгрузить();
			МассивСтрокПараметров = ТаблицаЗначенийПараметровНаработки.НайтиСтроки(Новый Структура("ОбъектРемонта", ТекОбъект));
			ТаблицаБуфер = ТаблицаЗначенийПараметровНаработки.Скопировать(МассивСтрокПараметров);
			
			НаборПараметровНаработки = РегистрыСведений.торо_ПараметрыНаработкиОбъектовРемонта.СоздатьНаборЗаписей();
			НаборПараметровНаработки.Отбор.ОбъектРемонта.Установить(ТекОбъект);
			НаборПараметровНаработки.Загрузить(ТаблицаБуфер);
			НаборПараметровНаработки.Записать();
			
			МодифицированностьПараметровНаработки = Ложь;
		Исключение
			ТекстСообщения = НСтр("es='No consiguió anotar los parámetros de la elaboración: ';ru='Не удалось записать параметры наработки: ';en='Failed to write running hours: '") + ОписаниеОшибки();
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			Возврат;
		КонецПопытки;
		
	КонецЕсли;
	
	Если МодифицированностьМаксЗначНаработки Тогда
		
		Для каждого Строка из ТабМаксимальныхЗначенийНаработки Цикл
			Если НЕ ЗначениеЗаполнено(Строка.ОбъектРемонта) Тогда
				Строка.ОбъектРемонта = ТекОбъект;
			КонецЕсли;
		КонецЦикла;
		
		Попытка
			ТабМаксЗнач = ТабМаксимальныхЗначенийНаработки.Выгрузить();
			// Удалить строки, которые могут быть получены из параметров Типовго ОР и не прописаны для текущего ОР.
			
			ПараметрыОтбора = Новый Структура("ОбъектРемонта", ТекОбъект);
			ВременнаяТЗ = ТабМаксЗнач.Скопировать(ПараметрыОтбора);
			ТабМаксЗнач.Очистить();
			ТабМаксЗнач = ВременнаяТЗ.Скопировать();
			
			НаборКонтролируемыхПоказателей = РегистрыСведений.торо_МаксимальныеЗначенияНаработкиОР.СоздатьНаборЗаписей();
			НаборКонтролируемыхПоказателей.Отбор.ОбъектРемонта.Установить(ТекОбъект);
			НаборКонтролируемыхПоказателей.Загрузить(ТабМаксЗнач);
			НаборКонтролируемыхПоказателей.Записать();
			
			МодифицированностьМаксЗначНаработки = Ложь;
		Исключение
			ТекстСообщения = НСтр("es='No consiguió anotar los significados máximos de la elaboración: ';ru='Не удалось записать максимальные значения наработки: ';en='Failed to record maximum running hours: '") + ОписаниеОшибки();
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			Возврат;
		КонецПопытки;
		
	КонецЕсли;

	Если МодифицированностьИзмеряемыхПоказателей Тогда		
		
		
		Попытка
			ЗаписиОР = СписокИзмеряемыхПоказателей.НайтиСтроки(Новый Структура("ОбъектРемонта", ТекОбъект));
			
			НаборКонтролируемыхПоказателей = РегистрыСведений.торо_ИзмеряемыеПоказателиОбъектовРемонта.СоздатьНаборЗаписей();
			НаборКонтролируемыхПоказателей.Отбор.ОбъектРемонта.Установить(ТекОбъект);
			НаборКонтролируемыхПоказателей.Прочитать();
			НаборКонтролируемыхПоказателей.Очистить();
			
			Для Каждого СтрПоказателя Из ЗаписиОР Цикл
				Если СтрПоказателя.ИзТиповогоОР И НЕ СтрПоказателя.ЗначенияКонтролируемыхПоказателейИзОР И НЕ СтрПоказателя.Удален Тогда
					Продолжить;
				КонецЕсли;
				ЗаполнитьЗначенияСвойств(НаборКонтролируемыхПоказателей.Добавить(),СтрПоказателя);
			КонецЦикла;
			
			НаборКонтролируемыхПоказателей.Записать();
			
			МодифицированностьИзмеряемыхПоказателей = Ложь;
		Исключение
			ТекстСообщения = НСтр("es='No consiguió anotar los índices controlados: ';ru='Не удалось записать контролируемые показатели: ';en='Failed to record monitored metrics: '") + ОписаниеОшибки();
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			Возврат;
		КонецПопытки;
		
	КонецЕсли;
	
	Если МодифицированностьПараметровОповещенияОСостоянииОР Тогда
		
		Для каждого Строка из ПараметрыОповещенияПоСостояниямОР Цикл
			Если НЕ ЗначениеЗаполнено(Строка.ОбъектРемонта) Тогда
				Строка.ОбъектРемонта = ТекОбъект;
			КонецЕсли;
		КонецЦикла;
		
		Попытка
			ТаблицаПараметровОповещения = ПараметрыОповещенияПоСостояниямОР.Выгрузить(Новый Структура("ТиповойОР", Справочники.торо_ТиповыеОР.ПустаяСсылка()));
			
			НаборПараметровОповещения = РегистрыСведений.торо_ПараметрыОповещенияОСостоянииОборудования.СоздатьНаборЗаписей();
			НаборПараметровОповещения.Отбор.ОбъектРемонта.Установить(ТекОбъект);
			НаборПараметровОповещения.Загрузить(ТаблицаПараметровОповещения);
			НаборПараметровОповещения.Записать();
			
			МодифицированностьПараметровОповещенияОСостоянииОР = Ложь;
		Исключение
			ТекстСообщения = НСтр("es='No consiguió anotar los parámetros del aviso sobre el estado de la maquinaria: ';ru='Не удалось записать параметры оповещения о состоянии оборудования: ';en='Failed to record equipment status alert parameters: '") + ОписаниеОшибки();
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			Возврат;
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

#Область КонтролируемыеПоказатели

&НаСервереБезКонтекста
Функция ОбновитьИзмеряемыеПоказатели(ОбъектРемонта, ТиповойОР)
	
	СтруктураВозврата = Новый Массив;
	
	СписокТиповых = Новый Массив;
	Если ЗначениеЗаполнено(ТиповойОР) Тогда
		СписокТиповых.Добавить(ТиповойОР);
	КонецЕсли;
	
	ТаблицаРодителейТиповых = торо_ОбщегоНазначения.ПолучитьТаблицуРодителейСпискаОбъектов(СписокТиповых, Тип("СправочникСсылка.торо_ТиповыеОР"), Истина);
	ТаблицаРодителейТиповых.Колонки.Добавить("ОбъектРемонта", Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта"));
	ТаблицаРодителейТиповых.ЗаполнитьЗначения(ОбъектРемонта, "ОбъектРемонта");
	
	МассивПоказателей = ПланыВидовХарактеристик.торо_ИзмеряемыеПоказателиОбъектовРемонта.ПолучитьСтруктуруИзмеряемыхПоказателейОбъектовРемонта(ОбъектРемонта,,Истина,,ТаблицаРодителейТиповых);
	
	Для Каждого СтрокаПоказатель из МассивПоказателей Цикл	
		
		СтруктураСтроки = Новый Структура("ОбъектРемонта, Показатель, ДопустимыйМинимум,
										  |ДопустимыйМаксимум, КритическийМинимум, КритическийМаксимум,
										  |ЗначенияКонтролируемыхПоказателейИзОР, ИзТиповогоОР,
    									  |ТочкаЗамера,ТиповойОР,Удален, Доступность");
		
		ЗаполнитьЗначенияСвойств(СтруктураСтроки,СтрокаПоказатель);
		СтруктураСтроки.Доступность = Истина;
		
		Если НЕ ТипЗнч(СтруктураСтроки.ДопустимыйМаксимум) = Тип("Число") Тогда
			СтруктураСтроки.ДопустимыйМаксимум = 0;
		КонецЕсли;
		Если НЕ ТипЗнч(СтруктураСтроки.КритическийМинимум) = Тип("Число") Тогда
			СтруктураСтроки.КритическийМинимум = 0;
		КонецЕсли;
		Если НЕ ТипЗнч(СтруктураСтроки.КритическийМаксимум) = Тип("Число") Тогда
			СтруктураСтроки.КритическийМаксимум = 0;
		КонецЕсли;
		Если НЕ ТипЗнч(СтруктураСтроки.ДопустимыйМаксимум) = Тип("Число") Тогда
			СтруктураСтроки.ДопустимыйМаксимум = 0;
		КонецЕсли;
		
		СтруктураСтроки.Доступность = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураСтроки.Показатель, "ТипЗначения").СодержитТип(Тип("Число"));
		
		СтруктураВозврата.Добавить(СтруктураСтроки);
		
	КонецЦикла;
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПараметрыОповещенияПоКонтролируемымПоказателям(ОбъектРемонта, ТиповойОР)
	МассивВозврата = Новый Массив;
	Если ЗначениеЗаполнено(ОбъектРемонта) ИЛИ ЗначениеЗаполнено(ТиповойОР) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.ОбъектРемонта КАК ОбъектРемонта,
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.Показатель КАК Показатель,
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.ТиповойОР КАК ТиповойОР,
		               |	2 КАК Приоритет,
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.ВариантЗначения КАК ВариантЗначения,
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.Значение КАК Значение,
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.СобытиеВозникновенияОповещения КАК СобытиеВозникновенияОповещения,
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.ВидСравнения КАК ВидСравнения,
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.ID КАК ID,
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.Значение1 КАК Значение1,
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.ВариантЗначения1 КАК ВариантЗначения1,
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.ПараметрыВводаДефекта КАК ПараметрыВводаДефекта
		               |ПОМЕСТИТЬ ТабИсточников
		               |ИЗ
		               |	РегистрСведений.торо_ПараметрыОповещенияОСостоянииОборудования КАК торо_ПараметрыОповещенияОСостоянииОборудования
		               |ГДЕ
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.ОбъектРемонта = &ОбъектРемонта
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.ОбъектРемонта,
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.Показатель,
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.ТиповойОР,
		               |	1,
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.ВариантЗначения,
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.Значение,
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.СобытиеВозникновенияОповещения,
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.ВидСравнения,
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.ID,
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.Значение1,
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.ВариантЗначения1,
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.ПараметрыВводаДефекта
		               |ИЗ
		               |	РегистрСведений.торо_ПараметрыОповещенияОСостоянииОборудования КАК торо_ПараметрыОповещенияОСостоянииОборудования
		               |ГДЕ
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.ТиповойОР = &ТиповойОР
		               |	
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
					   |ВЫБРАТЬ
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.ОбъектРемонта,
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.Показатель,
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.ТиповойОР,
		               |	0,
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.ВариантЗначения,
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.Значение,
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.СобытиеВозникновенияОповещения,
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.ВидСравнения,
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.ID,
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.Значение1,
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.ВариантЗначения1,
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.ПараметрыВводаДефекта
		               |ИЗ
		               |	РегистрСведений.торо_ПараметрыОповещенияОСостоянииОборудования КАК торо_ПараметрыОповещенияОСостоянииОборудования
		               |ГДЕ
		               |	торо_ПараметрыОповещенияОСостоянииОборудования.ТиповойОР = &РодительТОР
		               |;

		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	МАКСИМУМ(ТабПриоритетов.Приоритет) КАК Приоритет,
		               |	ТабПриоритетов.Показатель КАК Показатель
		               |ПОМЕСТИТЬ ТабПриоритетов
		               |ИЗ
		               |	ТабИсточников КАК ТабПриоритетов
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТабПриоритетов.Показатель
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТабИсточников.ОбъектРемонта КАК ОбъектРемонта,
		               |	ТабИсточников.Показатель КАК Показатель,
		               |	ТабИсточников.ТиповойОР КАК ТиповойОР,
		               |	ТабИсточников.ВариантЗначения КАК ВариантЗначения,
		               |	ТабИсточников.Значение КАК Значение,
		               |	ТабИсточников.СобытиеВозникновенияОповещения КАК СобытиеВозникновенияОповещения,
		               |	ТабИсточников.ВидСравнения КАК ВидСравнения,
		               |	ТабИсточников.ID КАК ID,
		               |	ТабИсточников.Значение1 КАК Значение1,
		               |	ТабИсточников.ВариантЗначения1 КАК ВариантЗначения1,
		               |	ТабИсточников.ПараметрыВводаДефекта КАК ПараметрыВводаДефекта
		               |ИЗ
		               |	ТабИсточников КАК ТабИсточников
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабПриоритетов КАК ТабПриоритетов
		               |		ПО ТабИсточников.Показатель = ТабПриоритетов.Показатель
		               |			И ТабИсточников.Приоритет = ТабПриоритетов.Приоритет";
		Запрос.УстановитьПараметр("ОбъектРемонта",ОбъектРемонта);
		Запрос.УстановитьПараметр("ТиповойОР",?(ЗначениеЗаполнено(ТиповойОР),ТиповойОР,NULL));
		Запрос.УстановитьПараметр("РодительТОР",?(ЗначениеЗаполнено(ТиповойОР.Родитель),ТиповойОР.Родитель,NULL));
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				СтруктураПараметр = Новый Структура("ОбъектРемонта,Показатель,ТиповойОР,ВариантЗначения,
													|Значение,СобытиеВозникновенияОповещения,ВидСравнения,
													|ID,Значение1,ВариантЗначения1,ПараметрыВводаДефекта");
				ЗаполнитьЗначенияСвойств(СтруктураПараметр,Выборка);
				МассивВозврата.Добавить(СтруктураПараметр);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Возврат МассивВозврата;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЗначенияКонтролируемыхПоказателей(ИзмеряемыйПоказатель,ОР,НеУчитыватьОР = Ложь)
	СтруктураЗначенийПолей = Новый Структура();
	МассивПоказателей = ПланыВидовХарактеристик.торо_ИзмеряемыеПоказателиОбъектовРемонта.ПолучитьСтруктуруИзмеряемыхПоказателейОбъектовРемонта(ОР,ИзмеряемыйПоказатель,Истина, НеУчитыватьОР);
	Если МассивПоказателей.Количество() > 0 Тогда
		СтрокаПоказателя = МассивПоказателей[0];
		СтруктураЗначенийПолей.Вставить("ДопустимыйМинимум", 	СтрокаПоказателя.ДопустимыйМинимум);
		СтруктураЗначенийПолей.Вставить("ДопустимыйМаксимум",	СтрокаПоказателя.ДопустимыйМаксимум);
		СтруктураЗначенийПолей.Вставить("КритическийМинимум",	СтрокаПоказателя.КритическийМинимум);
		СтруктураЗначенийПолей.Вставить("КритическийМаксимум",	СтрокаПоказателя.КритическийМаксимум);
		СтруктураЗначенийПолей.Вставить("ЗначенияКонтролируемыхПоказателейИзОР",СтрокаПоказателя.ЗначенияКонтролируемыхПоказателейИзОР);
		СтруктураЗначенийПолей.Вставить("ИзТиповогоОР",СтрокаПоказателя.ИзТиповогоОР);
	ИначеЕсли НеУчитыватьОР Тогда
		СтруктураЗначенийПолей.Вставить("ДопустимыйМинимум", 	ИзмеряемыйПоказатель.ДопустимыйМинимум);
		СтруктураЗначенийПолей.Вставить("ДопустимыйМаксимум",	ИзмеряемыйПоказатель.ДопустимыйМаксимум);
		СтруктураЗначенийПолей.Вставить("КритическийМинимум",	ИзмеряемыйПоказатель.КритическийМинимум);
		СтруктураЗначенийПолей.Вставить("КритическийМаксимум",	ИзмеряемыйПоказатель.КритическийМаксимум);
		СтруктураЗначенийПолей.Вставить("ЗначенияКонтролируемыхПоказателейИзОР",Ложь);
		СтруктураЗначенийПолей.Вставить("ИзТиповогоОР",Ложь);
	КонецЕсли;
	
	Если ИзмеряемыйПоказатель.ТипЗначения.СодержитТип(Тип("Число")) Тогда
		Если НЕ ТипЗнч(СтруктураЗначенийПолей.ДопустимыйМаксимум) = Тип("Число") Тогда
			СтруктураЗначенийПолей.ДопустимыйМаксимум = 0;
		КонецЕсли;
		Если НЕ ТипЗнч(СтруктураЗначенийПолей.КритическийМинимум) = Тип("Число") Тогда
			СтруктураЗначенийПолей.КритическийМинимум = 0;
		КонецЕсли;
		Если НЕ ТипЗнч(СтруктураЗначенийПолей.КритическийМаксимум) = Тип("Число") Тогда
			СтруктураЗначенийПолей.КритическийМаксимум = 0;
		КонецЕсли;
		Если НЕ ТипЗнч(СтруктураЗначенийПолей.ДопустимыйМинимум) = Тип("Число") Тогда
			СтруктураЗначенийПолей.ДопустимыйМинимум = 0;
		КонецЕсли;
	КонецЕсли;

	Возврат СтруктураЗначенийПолей;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеПоказателяТипового(Показатель,Типовой)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_ИзмеряемыеПоказателиОбъектовРемонта.ОбъектРемонта КАК ТиповойОР,
	               |	торо_ИзмеряемыеПоказателиОбъектовРемонта.Показатель,
	               |	ВЫБОР
	               |		КОГДА торо_ИзмеряемыеПоказателиОбъектовРемонта.ЗначенияКонтролируемыхПоказателейИзОР
	               |			ТОГДА торо_ИзмеряемыеПоказателиОбъектовРемонта.ДопустимыйМинимум
	               |		ИНАЧЕ торо_ПВХИзмеряемыеПоказателиОбъектовРемонта.ДопустимыйМинимум
	               |	КОНЕЦ КАК ДопустимыйМинимум,
	               |	ВЫБОР
	               |		КОГДА торо_ИзмеряемыеПоказателиОбъектовРемонта.ЗначенияКонтролируемыхПоказателейИзОР
	               |			ТОГДА торо_ИзмеряемыеПоказателиОбъектовРемонта.ДопустимыйМаксимум
	               |		ИНАЧЕ торо_ПВХИзмеряемыеПоказателиОбъектовРемонта.ДопустимыйМаксимум
	               |	КОНЕЦ КАК ДопустимыйМаксимум,
	               |	ВЫБОР
	               |		КОГДА торо_ИзмеряемыеПоказателиОбъектовРемонта.ЗначенияКонтролируемыхПоказателейИзОР
	               |			ТОГДА торо_ИзмеряемыеПоказателиОбъектовРемонта.КритическийМинимум
	               |		ИНАЧЕ торо_ПВХИзмеряемыеПоказателиОбъектовРемонта.КритическийМинимум
	               |	КОНЕЦ КАК КритическийМинимум,
	               |	ВЫБОР
	               |		КОГДА торо_ИзмеряемыеПоказателиОбъектовРемонта.ЗначенияКонтролируемыхПоказателейИзОР
	               |			ТОГДА торо_ИзмеряемыеПоказателиОбъектовРемонта.КритическийМаксимум
	               |		ИНАЧЕ торо_ПВХИзмеряемыеПоказателиОбъектовРемонта.КритическийМаксимум
	               |	КОНЕЦ КАК КритическийМаксимум,
	               |	торо_ИзмеряемыеПоказателиОбъектовРемонта.ЗначенияКонтролируемыхПоказателейИзОР,
	               |	торо_ИзмеряемыеПоказателиОбъектовРемонта.ТочкаЗамера
	               |ИЗ
	               |	РегистрСведений.торо_ИзмеряемыеПоказателиОбъектовРемонта КАК торо_ИзмеряемыеПоказателиОбъектовРемонта
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.торо_ИзмеряемыеПоказателиОбъектовРемонта КАК торо_ПВХИзмеряемыеПоказателиОбъектовРемонта
	               |		ПО торо_ИзмеряемыеПоказателиОбъектовРемонта.Показатель = торо_ПВХИзмеряемыеПоказателиОбъектовРемонта.Ссылка
	               |ГДЕ
	               |	(ВЫРАЗИТЬ(торо_ИзмеряемыеПоказателиОбъектовРемонта.ОбъектРемонта КАК Справочник.торо_ТиповыеОР)) = &ТиповойОР
	               |	И торо_ИзмеряемыеПоказателиОбъектовРемонта.Показатель = &Показатель";
	Запрос.УстановитьПараметр("ТиповойОР",Типовой);
	Запрос.УстановитьПараметр("Показатель",Показатель);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		СтруктураВозврат = Новый Структура("ТиповойОР,Показатель, ДопустимыйМинимум,ДопустимыйМаксимум, 
											|КритическийМинимум, КритическийМаксимум,ЗначенияКонтролируемыхПоказателейИзОР,
											|ТочкаЗамера,ИзТиповогоОР,Удален");
		ЗаполнитьЗначенияСвойств(СтруктураВозврат,Выборка);
		СтруктураВозврат.Вставить("ОбъектРемонта",Справочники.торо_ОбъектыРемонта.ПустаяСсылка());
		СтруктураВозврат.ИзТиповогоОР = Истина;
		СтруктураВозврат.Удален = Ложь;					
		
		Возврат СтруктураВозврат;
		
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Функция ПоказательУдаленНаСервере(ОР,Показатель)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_ИзмеряемыеПоказателиОбъектовРемонта.ОбъектРемонта
	               |ИЗ
	               |	РегистрСведений.торо_ИзмеряемыеПоказателиОбъектовРемонта КАК торо_ИзмеряемыеПоказателиОбъектовРемонта
	               |ГДЕ
	               |	торо_ИзмеряемыеПоказателиОбъектовРемонта.ОбъектРемонта = &ОбъектРемонта
	               |	И торо_ИзмеряемыеПоказателиОбъектовРемонта.Показатель = &Показатель
	               |	И торо_ИзмеряемыеПоказателиОбъектовРемонта.Удален";
	Запрос.УстановитьПараметр("ОбъектРемонта",ОР);
	Запрос.УстановитьПараметр("Показатель",Показатель);
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

&НаКлиенте
Процедура ВводЗначенияКонтрПоказателейВопросЗаписать(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Если ЭтаФорма.ПроверитьЗаполнение() Тогда
			Если ЭтаФорма.Записать() Тогда
				ВводЗначенияКонтрПоказателейЗавершение();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВводЗначенияКонтрПоказателейЗавершение()
	
	ТекДанные = Элементы.СписокИзмеряемыхПоказателей.ТекущиеДанные;
	Если ТекДанные = Неопределено ИЛИ ПоказательУдаленНаСервере(Объект.Ссылка,ТекДанные.Показатель) ИЛИ Не ПроверитьСтатусНаСервере("торо_УчетКонтролируемыхПоказателей") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураОснования = Новый Структура("ОбъектРемонта, Показатель", Объект.Ссылка, ТекДанные.Показатель);
	ПараметрыФормы = Новый Структура("Основание", СтруктураОснования);
	ОткрытьФорму("Документ.торо_УчетКонтролируемыхПоказателей.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область Наработка

&НаСервереБезКонтекста
Функция ОбновитьМаксимальныеЗначенияПоказателейНаработки(ОбъектРемонта, ТиповойОР)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_МаксимальныеЗначенияНаработкиОР.ОбъектРемонта,
	|	торо_МаксимальныеЗначенияНаработкиОР.Показатель,
	|	торо_МаксимальныеЗначенияНаработкиОР.МаксимальноеЗначение,
	|	торо_МаксимальныеЗначенияНаработкиОР.НазначенныйРесурс,
	|	0 КАК Приоритет,
	|	торо_МаксимальныеЗначенияНаработкиОР.Удален
	|ПОМЕСТИТЬ ВсеПараметры
	|ИЗ
	|	РегистрСведений.торо_МаксимальныеЗначенияНаработкиОР КАК торо_МаксимальныеЗначенияНаработкиОР
	|ГДЕ
	|	торо_МаксимальныеЗначенияНаработкиОР.ОбъектРемонта = &ОбъектРемонта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_МаксимальныеЗначенияНаработкиОР.ОбъектРемонта,
	|	торо_МаксимальныеЗначенияНаработкиОР.Показатель,
	|	торо_МаксимальныеЗначенияНаработкиОР.МаксимальноеЗначение,
	|	торо_МаксимальныеЗначенияНаработкиОР.НазначенныйРесурс,
	|	1,
	|	торо_МаксимальныеЗначенияНаработкиОР.Удален
	|ИЗ
	|	РегистрСведений.торо_МаксимальныеЗначенияНаработкиОР КАК торо_МаксимальныеЗначенияНаработкиОР
	|ГДЕ
	|	торо_МаксимальныеЗначенияНаработкиОР.ОбъектРемонта = &Типовой
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеПараметры.ОбъектРемонта,
	|	ВсеПараметры.Показатель,
	|	ВсеПараметры.МаксимальноеЗначение,
	|	ВсеПараметры.НазначенныйРесурс,
	|	ВсеПараметры.Удален
	|ИЗ
	|	ВсеПараметры КАК ВсеПараметры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВсеПараметры.Показатель КАК Показатель,
	|			МИНИМУМ(ВсеПараметры.Приоритет) КАК Приоритет
	|		ИЗ
	|			ВсеПараметры КАК ВсеПараметры
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВсеПараметры.Показатель) КАК ВложенныйЗапрос
	|		ПО ВсеПараметры.Показатель = ВложенныйЗапрос.Показатель
	|			И ВсеПараметры.Приоритет = ВложенныйЗапрос.Приоритет";
	
	Запрос.УстановитьПараметр("ОбъектРемонта", ОбъектРемонта);
	Запрос.УстановитьПараметр("Типовой", ТиповойОР);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	СтруктураВозврата = Новый Массив;
	
	Пока Выборка.Следующий() Цикл	
		СтруктураПараметр = Новый Структура("ОбъектРемонта, Показатель, МаксимальноеЗначение, НазначенныйРесурс, Удален");
		ЗаполнитьЗначенияСвойств(СтруктураПараметр,Выборка);
		
		СтруктураВозврата.Добавить(СтруктураПараметр);
	КонецЦикла;
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаСервере
Процедура ОбновитьМаксЗначенияПараметровНаработкиНаСервере() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаПараметров.Показатель,
	               |	ТаблицаПараметров.ОбъектРемонта
	               |ПОМЕСТИТЬ ТаблицаПараметров
	               |ИЗ
	               |	&ТаблицаПараметров КАК ТаблицаПараметров
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаПараметров.Показатель,
	               |	ТаблицаПараметров.ОбъектРемонта
	               |ПОМЕСТИТЬ ТаблицаПараметровОР
	               |ИЗ
	               |	ТаблицаПараметров КАК ТаблицаПараметров
	               |ГДЕ
	               |	ТаблицаПараметров.ОбъектРемонта = &ОбъектРемонта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	торо_МаксимальныеЗначенияНаработкиОР.ОбъектРемонта,
	               |	торо_МаксимальныеЗначенияНаработкиОР.Показатель,
	               |	торо_МаксимальныеЗначенияНаработкиОР.МаксимальноеЗначение,
	               |	торо_МаксимальныеЗначенияНаработкиОР.НазначенныйРесурс
	               |ИЗ
	               |	РегистрСведений.торо_МаксимальныеЗначенияНаработкиОР КАК торо_МаксимальныеЗначенияНаработкиОР
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПараметровОР КАК ТаблицаПараметровОР
	               |		ПО торо_МаксимальныеЗначенияНаработкиОР.Показатель = ТаблицаПараметровОР.Показатель
	               |ГДЕ
	               |	торо_МаксимальныеЗначенияНаработкиОР.ОбъектРемонта = &ТиповойОбъектРемонта";
	Запрос.УстановитьПараметр("ОбъектРемонта", Объект.Ссылка);
	Запрос.УстановитьПараметр("ТиповойОбъектРемонта", Объект.ТиповойОР);
	Запрос.УстановитьПараметр("ТаблицаПараметров", СписокПараметровНаработки.Выгрузить());
	
	СтруктураМаксЗначенийПоказателей = Запрос.Выполнить().Выгрузить();
	Для Каждого Элем Из СтруктураМаксЗначенийПоказателей Цикл
		Отбор = Новый Структура();
		Отбор.Вставить("Показатель", Элем.Показатель);
		МассивПоказателей = ТабМаксимальныхЗначенийНаработки.НайтиСтроки(Отбор);
		Если МассивПоказателей.Количество() > 0 Тогда
			Для каждого Показатель Из МассивПоказателей Цикл
				Показатель.ОбъектРемонта = Объект.Ссылка;
				МодифицированностьМаксЗначНаработки = Истина;
			КонецЦикла; 
		КонецЕсли; 
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнениеПараметровНаработки(Отказ)
	
	ИндексСтроки = 0;
	ШаблонСообщения = НСтр("es='En la tabla de los parámetros de la elaboración en la línea %1 no es rellenado el campo ""%2"".';ru='В таблице параметров наработки в строке %1 не заполнено поле ""%2"".';en='In the operating time table in the row% 1, the field ""% 2"" is not filled.'");
	
	СтруктураПроверяемыхПолей = Новый Структура;
	СтруктураПроверяемыхПолей.Вставить("Период", "Дата введения");
	СтруктураПроверяемыхПолей.Вставить("Показатель", "Показатель наработки");
	СтруктураПроверяемыхПолей.Вставить("ПродолжительностьПериодаПлановойНаработки", "Продолжительность периода плановой наработки");
	СтруктураПроверяемыхПолей.Вставить("ПериодПлановойНаработки", "Период плановой наработки");
	СтруктураПроверяемыхПолей.Вставить("ПлановаяНаработка", "Плановая наработка");
	СтруктураПроверяемыхПолей.Вставить("КоэффициентИспользованияОборудования", "Коэффициент использования оборудования");
	
	Для каждого Строчка Из СписокПараметровНаработки Цикл
		Если Строчка.ОбъектРемонта <> Объект.Ссылка Тогда
			ИндексСтроки = ИндексСтроки + 1;
			Продолжить;
		КонецЕсли;
		
		Для каждого КлючИЗначение из СтруктураПроверяемыхПолей Цикл
			Если НЕ ЗначениеЗаполнено(Строчка[КлючИЗначение.Ключ]) Тогда
				ТекстСообщения = СтрШаблон(ШаблонСообщения, Строка(ИндексСтроки+1), КлючИЗначение.Значение);
				ПутьКДанным = "СписокПараметровНаработки[" + ИндексСтроки + "]." + КлючИЗначение.Ключ;
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, ПутьКДанным,, Отказ);
			КонецЕсли;
		КонецЦикла;
		
		ИндексСтроки = ИндексСтроки + 1;

	КонецЦикла;
	
	МаксимальноеЗначение = Истина;
	Для каждого Строчка Из ТабМаксимальныхЗначенийНаработки Цикл
		
		Если Строчка.МаксимальноеЗначение = 0 И Строчка.НазначенныйРесурс = 0 Тогда
			МаксимальноеЗначение = Ложь;
		КонецЕсли;                                                               
		
	КонецЦикла;
	
	Если НЕ МаксимальноеЗначение Тогда
		ТекстСообщения = НСтр("es='"" o ""el recurso Fijado"".';ru='Не заполнено поле ""Максимальное значение наработки"" или ""Назначенный ресурс"".';en='The field ""Maximum operating time"" or ""Assigned resource"" is not filled.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьЗаполненностьПараметровНаработки(ТабПараметрыНаработкиОбъектовРемонта)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_ТиповыеОРНормативныеРемонты.ВидРемонта КАК ВидРемонта,
	               |	торо_ТиповыеОРНормативныеРемонты.Ссылка КАК ТиповойОР
	               |ПОМЕСТИТЬ РассчитываемыеПоНаработке
	               |ИЗ
	               |	Справочник.торо_ТиповыеОР.НормативныеРемонты КАК торо_ТиповыеОРНормативныеРемонты
	               |ГДЕ
	               |	торо_ТиповыеОРНормативныеРемонты.ВидРемонта = &ВР
	               |	И торо_ТиповыеОРНормативныеРемонты.Ссылка = &Ссылка
	               |	И торо_ТиповыеОРНормативныеРемонты.СпособПланирования.ИспользоватьПараметрыНаработки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&Ссылка КАК ОбъектРемонта,
	               |	ТабПараметрыНаработки.Показатель КАК Показатель,
	               |	ТабПараметрыНаработки.Период КАК Период,
	               |	ТабПараметрыНаработки.ПлановаяНаработка КАК ПлановаяНаработка,
	               |	ТабПараметрыНаработки.ПериодПлановойНаработки КАК ПериодПлановойНаработки,
	               |	ТабПараметрыНаработки.ПродолжительностьПериодаПлановойНаработки КАК ПродолжительностьПериодаПлановойНаработки,
	               |	ТабПараметрыНаработки.КоэффициентИспользованияОборудования КАК КоэффициентИспользованияОборудования
	               |ПОМЕСТИТЬ ТабПараметрыНаработки
	               |ИЗ
	               |	&ТабПараметрыНаработки КАК ТабПараметрыНаработки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РассчитываемыеПоНаработке.ВидРемонта КАК ВидРемонта,
	               |	торо_ПараметрыНаработкиОбъектовРемонта.Показатель КАК Показатель
	               |ПОМЕСТИТЬ ПараметрыПлановойНаработки
	               |ИЗ
	               |	РассчитываемыеПоНаработке КАК РассчитываемыеПоНаработке
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТабПараметрыНаработки КАК торо_ПараметрыНаработкиОбъектовРемонта
	               |		ПО (торо_ПараметрыНаработкиОбъектовРемонта.ОбъектРемонта = РассчитываемыеПоНаработке.ТиповойОР)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПараметрыПлановойНаработки.ВидРемонта КАК ВидРемонта
	               |ИЗ
	               |	ПараметрыПлановойНаработки КАК ПараметрыПлановойНаработки
	               |ГДЕ
	               |	ПараметрыПлановойНаработки.Показатель = NULL";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("ВР", ВРНачалоЦикла);
	Запрос.УстановитьПараметр("ТабПараметрыНаработки", ТабПараметрыНаработкиОбъектовРемонта);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		ТекстСообщения = НСтр("ru = 'Проверьте заполненность показателей плановой наработки.'");

		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	Иначе
		СтруктураВозврата = торо_РаботаСНаработкой.ОбновитьНаработку(Объект.Ссылка, Объект.ТиповойОР);
		Если СтруктураВозврата.Количество() <> 0 Тогда
			Для Каждого Строка из СтруктураВозврата Цикл
				Если Не ЗначениеЗаполнено(Строка.Период) ИЛИ Не ЗначениеЗаполнено(Строка.ПлановаяНаработка) ИЛИ Не ЗначениеЗаполнено(Строка.ПродолжительностьПериодаПлановойНаработки) Тогда
					ТекстСообщения = НСтр("ru = 'Проверьте заполненность показателей плановой наработки.'");

					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
					Возврат Ложь;
				Иначе
					Возврат Истина;
				КонецЕсли;
			КонецЦикла;
		Иначе
			ТекстСообщения = НСтр("ru = 'Проверьте заполненность показателей плановой наработки.'");

			ОбщегоНазначения.СообщитьПользователю();
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ВводНаработкиВопросЗаписать(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Если ЭтаФорма.ПроверитьЗаполнение() Тогда
			Если ЭтаФорма.Записать() Тогда
				ВводНаработкиФрагмент();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВводНаработкиФрагмент()
	
	Если Не ПроверитьСтатусНаСервере("торо_УчетНаработкиОборудования") Тогда
		Возврат;
	КонецЕсли;

	ТекущиеДанные = Элементы.СписокПараметровНаработки.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда 
		
		ОткрытьФормуНовогоДокументаНаработки(ТекущиеДанные.Показатель);
				
	Иначе
		Попытка
			СписокОтбора = Новый СписокЗначений();
			
			Для каждого Строка Из СписокПараметровНаработки Цикл
				
				СписокОтбора.Добавить(Строка.Показатель);
				
			КонецЦикла;			
			
			ПараметрыФормыСтруктура = Новый Структура("КлючНазначенияИспользования, СписокПараметровНаработки, 
													  |ЗакрыватьПриВыборе, ВидСравнения");
			ПараметрыФормыСтруктура.КлючНазначенияИспользования = "ОбъектыРемонта";
			ПараметрыФормыСтруктура.СписокПараметровНаработки = СписокОтбора;
			ПараметрыФормыСтруктура.ЗакрыватьПриВыборе = Истина;
			ПараметрыФормыСтруктура.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			
			ФормаВыбораПоказателя = ПолучитьФорму("Справочник.ПараметрыВыработкиОС.Форма.ФормаВыбора", ПараметрыФормыСтруктура, ЭтаФорма, Объект.Ссылка);
		Исключение
			ПоказатьПредупреждение(Неопределено, ИнформацияОбОшибке().Причина.Описание);
			Возврат;
		КонецПопытки;
		
		ФормаВыбораПоказателя.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
		ФормаВыбораПоказателя.ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ВводНаработкиЗавершение",ЭтотОбъект);
		ФормаВыбораПоказателя.Открыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВводНаработкиЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
   Показатель = РезультатЗакрытия;
	
	 Если НЕ Показатель = Неопределено Тогда
		 ОткрытьФормуНовогоДокументаНаработки(Показатель);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНовогоДокументаНаработки(Показатель)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВводаДокументаНаработки", ЭтаФорма);
	СтруктураОснования = Новый Структура("ОбъектРемонта, Показатель, Иерархия", Объект.Ссылка, Показатель, ТекСтруктураИерархии);
	ПараметрыФормы = Новый Структура("Основание", СтруктураОснования);
		
	ОткрытьФорму("Документ.торо_УчетНаработкиОборудования.ФормаОбъекта",ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВводаДокументаНаработки(Результат, ДопПараметры) Экспорт
	ОбновитьЖурналНаработки(Истина);	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗначенияИзноса(ТекДанные = Неопределено)
	
	ТекДата = ТекущаяДата();
	Если ТекДанные <> Неопределено Тогда
		Если ТекДанные.НазначенныйРесурс <> 0 Тогда
			МассивСтрок = ТабВыработкиОбъектаРемонта.НайтиСтроки(Новый Структура("Показатель",ТекДанные.Показатель ));
			
			НаработкаАбсолютная  = 0;
			
			Для каждого Строка Из МассивСтрок Цикл
				
				Если Строка.ВидДвижения = ВидДвиженияНакопления.Приход И Строка.Период <= ТекДата Тогда
					НаработкаАбсолютная = НаработкаАбсолютная + Строка.Наработка;
				КонецЕсли;
				
			КонецЦикла;
			
			Если НаработкаАбсолютная > ТекДанные.НазначенныйРесурс Тогда 
				ТекДанные.Износ = "0%";
			Иначе 
				ТекДанные.Износ = Формат(((ТекДанные.НазначенныйРесурс - НаработкаАбсолютная)/ТекДанные.НазначенныйРесурс)*100, "ЧДЦ=2; ЧН=0") + "%";
			КонецЕсли;
		КонецЕсли;
	Иначе
		Для Каждого Строка Из ТабМаксимальныхЗначенийНаработки Цикл
			Если Строка.НазначенныйРесурс <> 0 Тогда
				МассивСтрок = ТабВыработкиОбъектаРемонта.НайтиСтроки(Новый Структура("Показатель",Строка.Показатель));
				
				НаработкаАбсолютная  = 0;
				
				Для каждого СтрокаНайденная Из МассивСтрок Цикл
					
					Если СтрокаНайденная.ВидДвижения = ВидДвиженияНакопления.Приход И СтрокаНайденная.Период <= ТекДата Тогда
						НаработкаАбсолютная = НаработкаАбсолютная + СтрокаНайденная.Наработка;
					КонецЕсли;
					
				КонецЦикла;
				
				Если НаработкаАбсолютная > Строка.НазначенныйРесурс Тогда
					Строка.Износ = "0%";
				Иначе 
					Строка.Износ = Формат(((Строка.НазначенныйРесурс - НаработкаАбсолютная)/Строка.НазначенныйРесурс)*100, "ЧДЦ=2; ЧН=0") + "%";
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМассивДокументовНаработки(Ссылка)
	
	Массив = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_НаработкаОбъектовРемонта.Период КАК Период,
	|	торо_НаработкаОбъектовРемонта.Регистратор КАК Регистратор,
	|	торо_НаработкаОбъектовРемонта.Показатель КАК Показатель,
	|	торо_НаработкаОбъектовРемонта.Наработка КАК Наработка,
	|	торо_НаработкаОбъектовРемонта.ДатаНач КАК ДатаНач,
	|	торо_НаработкаОбъектовРемонта.ВидДвижения КАК ВидДвижения,
	|	ВЫБОР
	|		КОГДА торо_НаработкаОбъектовРемонта.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА 28
	|		ИНАЧЕ 29
	|	КОНЕЦ КАК Картинка
	|ИЗ
	|	РегистрНакопления.торо_НаработкаОбъектовРемонта КАК торо_НаработкаОбъектовРемонта
	|ГДЕ
	|	торо_НаработкаОбъектовРемонта.ОбъектРемонта = &ОбъектРемонта
	|	И НЕ торо_НаработкаОбъектовРемонта.Регистратор.Организация ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
				   
	Запрос.УстановитьПараметр("ОбъектРемонта", Ссылка);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл 
			Структура = Новый Структура("Период, Регистратор, Показатель, Наработка, ВидДвижения, Картинка");
			ЗаполнитьЗначенияСвойств(Структура, Выборка);
			Массив.Добавить(Структура);	
		КонецЦикла; 
	КонецЕсли; 
	
	Возврат Массив;
	
КонецФункции

&НаСервере
Функция ПолучитьТаблицуПараметровНаработки()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ПараметрыНаработкиОбъектовРемонта.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_ПараметрыНаработкиОбъектовРемонта.Показатель КАК Показатель,
	|	торо_ПараметрыНаработкиОбъектовРемонта.Период КАК Период,
	|	0 КАК Приоритет,
	|	торо_ПараметрыНаработкиОбъектовРемонта.ПлановаяНаработка КАК ПлановаяНаработка,
	|	торо_ПараметрыНаработкиОбъектовРемонта.ПериодПлановойНаработки КАК ПериодПлановойНаработки,
	|	торо_ПараметрыНаработкиОбъектовРемонта.ПродолжительностьПериодаПлановойНаработки КАК ПродолжительностьПериодаПлановойНаработки,
	|	торо_ПараметрыНаработкиОбъектовРемонта.КоэффициентИспользованияОборудования КАК КоэффициентИспользованияОборудования
	|ПОМЕСТИТЬ ПоказателиОР
	|ИЗ
	|	РегистрСведений.торо_ПараметрыНаработкиОбъектовРемонта КАК торо_ПараметрыНаработкиОбъектовРемонта
	|ГДЕ
	|	торо_ПараметрыНаработкиОбъектовРемонта.ОбъектРемонта = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРодителей.Приоритет КАК Приоритет,
	|	ТаблицаРодителей.Родитель КАК Родитель
	|ПОМЕСТИТЬ ТаблицаРодителей
	|ИЗ
	|	&ТаблицаРодителей КАК ТаблицаРодителей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	торо_ПараметрыНаработкиОбъектовРемонта.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_ПараметрыНаработкиОбъектовРемонта.Показатель КАК Показатель,
	|	торо_ПараметрыНаработкиОбъектовРемонта.Период КАК Период,
	|	ТаблицаРодителей.Приоритет КАК Приоритет,
	|	торо_ПараметрыНаработкиОбъектовРемонта.ПлановаяНаработка КАК ПлановаяНаработка,
	|	торо_ПараметрыНаработкиОбъектовРемонта.ПериодПлановойНаработки КАК ПериодПлановойНаработки,
	|	торо_ПараметрыНаработкиОбъектовРемонта.ПродолжительностьПериодаПлановойНаработки КАК ПродолжительностьПериодаПлановойНаработки,
	|	торо_ПараметрыНаработкиОбъектовРемонта.КоэффициентИспользованияОборудования КАК КоэффициентИспользованияОборудования
	|ПОМЕСТИТЬ ПоказателиГрупп
	|ИЗ
	|	РегистрСведений.торо_ПараметрыНаработкиОбъектовРемонта.СрезПоследних(
	|			,
	|			ОбъектРемонта В
	|					(ВЫБРАТЬ
	|						ТаблицаРодителей.Родитель
	|					ИЗ
	|						ТаблицаРодителей КАК ТаблицаРодителей)
	|				И НЕ Показатель В
	|						(ВЫБРАТЬ
	|							ПоказателиОР.Показатель
	|						ИЗ
	|							ПоказателиОР КАК ПоказателиОР)) КАК торо_ПараметрыНаработкиОбъектовРемонта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаРодителей КАК ТаблицаРодителей
	|		ПО торо_ПараметрыНаработкиОбъектовРемонта.ОбъектРемонта = ТаблицаРодителей.Родитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоказателиОР.ОбъектРемонта КАК ОбъектРемонта,
	|	ПоказателиОР.Показатель КАК Показатель,
	|	ПоказателиОР.Период КАК Период,
	|	ПоказателиОР.Приоритет КАК Приоритет,
	|	ПоказателиОР.ПлановаяНаработка КАК ПлановаяНаработка,
	|	ПоказателиОР.ПериодПлановойНаработки КАК ПериодПлановойНаработки,
	|	ПоказателиОР.ПродолжительностьПериодаПлановойНаработки КАК ПродолжительностьПериодаПлановойНаработки,
	|	ПоказателиОР.КоэффициентИспользованияОборудования КАК КоэффициентИспользованияОборудования
	|ПОМЕСТИТЬ ВсеПоказатели
	|ИЗ
	|	ПоказателиОР КАК ПоказателиОР
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоказателиГрупп.ОбъектРемонта,
	|	ПоказателиГрупп.Показатель,
	|	ПоказателиГрупп.Период,
	|	ПоказателиГрупп.Приоритет,
	|	ПоказателиГрупп.ПлановаяНаработка,
	|	ПоказателиГрупп.ПериодПлановойНаработки,
	|	ПоказателиГрупп.ПродолжительностьПериодаПлановойНаработки,
	|	ПоказателиГрупп.КоэффициентИспользованияОборудования
	|ИЗ
	|	ПоказателиГрупп КАК ПоказателиГрупп
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Ссылка КАК ОбъектРемонта,
	|	ВсеПоказатели.Показатель КАК Показатель,
	|	ВсеПоказатели.Период КАК Период,
	|	ВсеПоказатели.Приоритет КАК Приоритет,
	|	ВсеПоказатели.ПлановаяНаработка КАК ПлановаяНаработка,
	|	ВсеПоказатели.ПериодПлановойНаработки КАК ПериодПлановойНаработки,
	|	ВсеПоказатели.ПродолжительностьПериодаПлановойНаработки КАК ПродолжительностьПериодаПлановойНаработки,
	|	ВсеПоказатели.КоэффициентИспользованияОборудования КАК КоэффициентИспользованияОборудования
	|ИЗ
	|	ВсеПоказатели КАК ВсеПоказатели
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВсеПоказатели.Показатель КАК Показатель,
	|			МИНИМУМ(ВсеПоказатели.Приоритет) КАК Приоритет
	|		ИЗ
	|			ВсеПоказатели КАК ВсеПоказатели
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВсеПоказатели.Показатель) КАК ВнутреннийЗапрос
	|		ПО ВсеПоказатели.Показатель = ВнутреннийЗапрос.Показатель
	|			И ВсеПоказатели.Приоритет = ВнутреннийЗапрос.Приоритет
	|ГДЕ
	|	ВсеПоказатели.Приоритет = 0";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	СписокРодителей = торо_РаботаСНаработкой.ПолучитьСписокРодителейТиповогоОбъекта(Объект.ТиповойОР);
	СписокРодителей.Добавить(Объект.ТиповойОР);
	ТаблицаРодителей = Новый ТаблицаЗначений;
	ТаблицаРодителей.Колонки.Добавить("Приоритет", Новый ОписаниеТипов("Число"));
	ТаблицаРодителей.Колонки.Добавить("Родитель", Новый ОписаниеТипов("СправочникСсылка.торо_ТиповыеОР"));
	СчетчикЦикла = СписокРодителей.Количество() - 1;
	Пока СчетчикЦикла >= 0 Цикл
		НоваяСтрокаТабл = ТаблицаРодителей.Добавить();
		НоваяСтрокаТабл.Родитель = СписокРодителей[СчетчикЦикла].Значение;
		НоваяСтрокаТабл.Приоритет = СчетчикЦикла + 1;
		СчетчикЦикла = СчетчикЦикла - 1;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТаблицаРодителей", ТаблицаРодителей);
	
	Результат = Запрос.Выполнить();
	ТаблицаПоказателей = Результат.Выгрузить();
	
	Возврат ТаблицаПоказателей;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПоказателиИзТиповыхОР(Знач ТиповойОР, МассивПоказателей, ВернутьСоответствие = Ложь)
	ТаблицаРодителей = Новый ТаблицаЗначений;
	ТаблицаРодителей.Колонки.Добавить("Приоритет", Новый ОписаниеТипов("Число"));
	ТаблицаРодителей.Колонки.Добавить("Родитель", Новый ОписаниеТипов("СправочникСсылка.торо_ТиповыеОР"));
	
	НоваяСтрокаТабл = ТаблицаРодителей.Добавить();
	НоваяСтрокаТабл.Родитель = ТиповойОР;
	НоваяСтрокаТабл.Приоритет = 1;
	
	СчетчикЦикла = 2;
	
	Пока ЗначениеЗаполнено(ТиповойОР.Родитель) Цикл
		НоваяСтрокаТабл = ТаблицаРодителей.Добавить();
		НоваяСтрокаТабл.Родитель = ТиповойОР.Родитель;;
		НоваяСтрокаТабл.Приоритет = СчетчикЦикла;
		СчетчикЦикла = СчетчикЦикла + 1;
		ТиповойОР = ТиповойОР.Родитель;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
					|	ТаблицаРодителей.Приоритет КАК Приоритет,
					|	ТаблицаРодителей.Родитель КАК Родитель
					|	
					|ПОМЕСТИТЬ ТаблицаРодителей
					|ИЗ
					|	&ТаблицаРодителей КАК ТаблицаРодителей
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
					|	торо_ПараметрыНаработкиОбъектовРемонта.ОбъектРемонта КАК ОбъектРемонта,
					|	торо_ПараметрыНаработкиОбъектовРемонта.Показатель КАК Показатель,
					|	торо_ПараметрыНаработкиОбъектовРемонта.ПлановаяНаработка КАК ПлановаяНаработка,
					|	торо_ПараметрыНаработкиОбъектовРемонта.ПериодПлановойНаработки КАК ПериодПлановойНаработки,
					|	торо_ПараметрыНаработкиОбъектовРемонта.ПродолжительностьПериодаПлановойНаработки КАК ПродолжительностьПериодаПлановойНаработки,
					|	торо_ПараметрыНаработкиОбъектовРемонта.КоэффициентИспользованияОборудования КАК КоэффициентИспользованияОборудования,
					|	ТаблицаРодителей.Приоритет
					|ПОМЕСТИТЬ ПоказателиГрупп
					|ИЗ
					|	РегистрСведений.торо_ПараметрыНаработкиОбъектовРемонта.СрезПоследних(
					|			,
					|			ОбъектРемонта В
					|					(ВЫБРАТЬ
					|						ТаблицаРодителей.Родитель
					|					ИЗ
					|						ТаблицаРодителей КАК ТаблицаРодителей)
					|			И Показатель В (&Показатели)) КАК торо_ПараметрыНаработкиОбъектовРемонта
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаРодителей КАК ТаблицаРодителей
					|		ПО торо_ПараметрыНаработкиОбъектовРемонта.ОбъектРемонта = ТаблицаРодителей.Родитель
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ПоказателиГрупп.ОбъектРемонта КАК ОбъектРемонта,
					|	ПоказателиГрупп.Показатель КАК Показатель,
					|	ПоказателиГрупп.ПлановаяНаработка КАК ПлановаяНаработка,
					|	ПоказателиГрупп.ПериодПлановойНаработки КАК ПериодПлановойНаработки,
					|	ПоказателиГрупп.ПродолжительностьПериодаПлановойНаработки КАК ПродолжительностьПериодаПлановойНаработки,
					|	ПоказателиГрупп.КоэффициентИспользованияОборудования КАК КоэффициентИспользованияОборудования
					|ИЗ
					|	ПоказателиГрупп КАК ПоказателиГрупп
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ  (ВЫБРАТЬ
					|									ПоказателиГрупп.Показатель КАК Показатель,
					|									МИНИМУМ(ПоказателиГрупп.Приоритет) КАК Приоритет
					|						    	ИЗ
					|									ПоказателиГрупп КАК ПоказателиГрупп
					|		
					|								СГРУППИРОВАТЬ ПО
					|									ПоказателиГрупп.Показатель) КАК ВложенныйЗапрос
					|		ПО ПоказателиГрупп.Показатель = ВложенныйЗапрос.Показатель
					|			И ПоказателиГрупп.Приоритет = ВложенныйЗапрос.Приоритет";
	
	Запрос.УстановитьПараметр("Показатели", МассивПоказателей);
	Запрос.УстановитьПараметр("ТаблицаРодителей", ТаблицаРодителей);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Если ВернутьСоответствие Тогда
	    ПоказателиСЗначениями = Новый Соответствие;
	Иначе
	    ПоказателиСЗначениями = Новый Массив;
	КонецЕсли;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураПараметра = Новый Структура("ОбъектРемонта, Показатель, ПлановаяНаработка, ПериодПлановойНаработки, ПродолжительностьПериодаПлановойНаработки, КоэффициентИспользованияОборудования");
		ЗаполнитьЗначенияСвойств(СтруктураПараметра, ВыборкаДетальныеЗаписи);
		Если ВернутьСоответствие Тогда
		    ПоказателиСЗначениями.Вставить(ВыборкаДетальныеЗаписи.Показатель, СтруктураПараметра);
		Иначе
		    ПоказателиСЗначениями.Добавить(СтруктураПараметра);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПоказателиСЗначениями;
КонецФункции

#КонецОбласти

#Область СостояниеОР

&НаСервере
Процедура ПостроитьГрафикСостоянийОР()
	// тут строим график
	
	ГрафикСостоянийОР.Очистить();
	ГрафикСостоянийОР.АвтоОпределениеПолногоИнтервала = Ложь;
	ГрафикСостоянийОР.ОтображатьЛегенду = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	торо_ТекущееСостояниеОР.ВидЭксплуатации КАК ВидЭксплуатации,
	               |	торо_ТекущееСостояниеОР.Период КАК Период,
	               |	торо_ТекущееСостояниеОР.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ ТаблицаСостояний
	               |ИЗ
	               |	РегистрСведений.торо_ТекущееСостояниеОР КАК торо_ТекущееСостояниеОР
	               |ГДЕ
	               |	торо_ТекущееСостояниеОР.ОбъектРемонта = &ОбъектРемонта
	               |	И НЕ торо_ТекущееСостояниеОР.Регистратор.Организация ЕСТЬ NULL
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаСостояний.ВидЭксплуатации КАК ВидЭксплуатации,
	               |	ВЫБОР
	               |		КОГДА ГОД(ТаблицаСостояний.Период) < 1000
	               |			ТОГДА ДАТАВРЕМЯ(1000, 1, 1)
	               |		ИНАЧЕ ТаблицаСостояний.Период
	               |	КОНЕЦ КАК Период,
	               |	МИНИМУМ(ВЫБОР
	               |			КОГДА ВспромогательнаяТаблица.Период ЕСТЬ NULL
	               |					И &ДатаОкончания = ДАТАВРЕМЯ(2999, 12, 31)
	               |				ТОГДА ДОБАВИТЬКДАТЕ(ТаблицаСостояний.Период, ДЕНЬ, 1)
	               |			КОГДА ВспромогательнаяТаблица.Период ЕСТЬ NULL
	               |				ТОГДА &ДатаОкончания
	               |			ИНАЧЕ ВспромогательнаяТаблица.Период
	               |		КОНЕЦ) КАК ДатаКон,
	               |	ТаблицаСостояний.Регистратор КАК Регистратор,
	               |	ВЫБОР
	               |		КОГДА ВспромогательнаяТаблица.Период ЕСТЬ NULL
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ОткрытоеСостояние
	               |ИЗ
	               |	ТаблицаСостояний КАК ТаблицаСостояний
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСостояний КАК ВспромогательнаяТаблица
	               |		ПО ТаблицаСостояний.Период < ВспромогательнаяТаблица.Период
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТаблицаСостояний.Период,
	               |	ТаблицаСостояний.ВидЭксплуатации,
	               |	ТаблицаСостояний.Регистратор,
	               |	ВЫБОР
	               |		КОГДА ВспромогательнаяТаблица.Период ЕСТЬ NULL
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ
	               |
	               |ИМЕЮЩИЕ
	               |	МИНИМУМ(ЕСТЬNULL(ВспромогательнаяТаблица.Период, &ТекДата)) >= &ДатаНачала И
	               |	ТаблицаСостояний.Период <= &ДатаОкончания
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период
	               |ИТОГИ ПО
	               |	ВидЭксплуатации";
	
	Если ОтборПоПериоду Тогда			   
		Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
		Если ДатаНачала > ДатаОкончания Тогда
			ТекстСообщения = НСтр("es='¡La fecha de la terminación del período es más pequeña que la fecha del comienzo!';ru='Дата окончания периода меньше даты начала!';en='Period end date is less than start date!'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	Иначе
		Запрос.УстановитьПараметр("ДатаНачала",'1000.01.01');
		Запрос.УстановитьПараметр("ДатаОкончания",'2999.12.31');
	КонецЕсли;
	Запрос.УстановитьПараметр("ОбъектРемонта", Объект.Ссылка);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	
	Результат = Запрос.Выполнить();
	ЗаполнитьТабличноеПолеСостоянийОР(Результат);
	
	ВыборкаПоВидЭксплуатации = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Серия = ГрафикСостоянийОР.Серии.Добавить();
	Серия.Цвет = WebЦвета.Красный;
	
	НачалоПериода = Дата('1000.01.01');
	КонецПериода = Дата('1000.01.01');
	
	ГрафикСостоянийОР.Окантовка = Истина;
	
	Пока ВыборкаПоВидЭксплуатации.Следующий() Цикл
		ТочкаДиаграммы = ГрафикСостоянийОР.Точки.Добавить();
		ТочкаДиаграммы.Текст = ВыборкаПоВидЭксплуатации.ВидЭксплуатации; 
		
		Если ТочкаДиаграммы.Текст = "" Тогда
			ТочкаДиаграммы.Текст = "Не установлено";
		КонецЕсли;
		
		Выборка = ВыборкаПоВидЭксплуатации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока  Выборка.Следующий() Цикл
			Если Выборка.Период > Выборка.ДатаКон Тогда
				Продолжить;
			КонецЕсли;
			
			Значение = ГрафикСостоянийОР.ПолучитьЗначение(ТочкаДиаграммы, Серия);
			Интервал = Значение.Добавить();
			Интервал.Начало = Выборка.Период;
			Интервал.Конец  = Выборка.ДатаКон;
			Интервал.Расшифровка = Выборка.Регистратор;
			
			Если Выборка.ВидЭксплуатации.ТипЭксплуатации = Перечисления.торо_ТипЭксплуатации.Эксплуатация Тогда
				Интервал.Цвет = WebЦвета.Зеленый;
			ИначеЕсли Выборка.ВидЭксплуатации.ТипЭксплуатации = Перечисления.торо_ТипЭксплуатации.Простой Тогда
				Интервал.Цвет = WebЦвета.Красный;
			ИначеЕсли Выборка.ВидЭксплуатации.ТипЭксплуатации = Перечисления.торо_ТипЭксплуатации.Испытания Тогда
				Интервал.Цвет = WebЦвета.Синий;
			КонецЕсли;
			
			НачалоПериода = ?(НачалоПериода = Дата('1000.01.01'),Выборка.Период,Мин(НачалоПериода,Выборка.Период));
			КонецПериода = Макс(КонецПериода,Выборка.ДатаКон);
			Если Выборка.ОткрытоеСостояние Тогда
				Интервал.Текст = "с " + Строка(Выборка.Период);
			Иначе 
				Интервал.Текст = Строка(Выборка.Период) + " - " + Строка(Выборка.ДатаКон);
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	Если ОтборПоПериоду Тогда
		ДатаПланированияДляИнтервала = ДатаНачала;
		ДатаОкончанияДляИнтервала = ДатаОкончания;
	Иначе	
		Если Год(НачалоПериода)<1000 Тогда
			ДатаПланированияДляИнтервала = '10000101';
		ИначеЕсли Год(НачалоПериода)>2999 Тогда
			ДатаПланированияДляИнтервала = '29991231';
		Иначе
			ДатаПланированияДляИнтервала = НачалоПериода;
		КонецЕсли;
		Если Год(КонецПериода)<1000 Тогда
			ДатаОкончанияДляИнтервала = '10000101';
		ИначеЕсли Год(КонецПериода)>2999 Тогда
			ДатаОкончанияДляИнтервала = '29991231';
		Иначе
			ДатаОкончанияДляИнтервала = КонецПериода;
		КонецЕсли;
	КонецЕсли;
	ГрафикСостоянийОР.УстановитьПолныйИнтервал(НачалоДня(ДатаПланированияДляИнтервала), КонецДня(ДатаОкончанияДляИнтервала));
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличноеПолеСостоянийОР(РезультатЗапроса)
	
	ПолеТДТаблицаСостояний.Очистить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	ТЗСостояний = РезультатЗапроса.Выгрузить();
	ТЗСостояний.Сортировать("Период Возр");
	Пока ТЗСостояний[0].Период = null Цикл
		ТзСостояний.Удалить(0);
	КонецЦикла;
	ТабДок = ПолеТДТаблицаСостояний;
	ПервичныйСдвигСтрок = 0;
	
	ИндексСтроки = 2 + ТЗСостояний.Количество() + 1;
	флВсеНарисовано = Ложь;
	СдвигСтрокПоляТД = ПервичныйСдвигСтрок;
	
	КоличествоСостояний = ТЗСостояний.Количество();
	КоличествоКолонокПоляТД = 15;
	ЭтоПерваяЧастьТаблицы = Истина;
	
	Пока НЕ флВсеНарисовано Цикл
		
		Если КоличествоКолонокПоляТД = 1 Тогда
			Прервать;
		КонецЕсли;
		
		Если КоличествоСостояний + 1 > КоличествоКолонокПоляТД Тогда
			ЧертитьКолонок = КоличествоКолонокПоляТД;
			КоличествоСостояний = КоличествоСостояний - КоличествоКолонокПоляТД + 1;
		Иначе 
			ЧертитьКолонок = КоличествоСостояний + 1;
			флВсеНарисовано = Истина;
		КонецЕсли;
		
		ОбластьВывода = ТабДок.Область(1,1,1,1);
		ОбластьВывода.ШиринаКолонки = 4; 
		
		ОбластьВывода = ТабДок.Область(3+ СдвигСтрокПоляТД,2,7 + СдвигСтрокПоляТД,ЧертитьКолонок + 1);
		ОбластьВывода.ГраницаСверху = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
		ОбластьВывода.ГраницаСлева = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
		ОбластьВывода.ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
		ОбластьВывода.ГраницаСправа = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
		ОбластьВывода.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
		ОбластьВывода.ВысотаСтроки = 22;
		
		ОбластьВывода = ТабДок.Область(3+ СдвигСтрокПоляТД,2,7 + СдвигСтрокПоляТД+1);
		ОбластьВывода.ШиринаКолонки = 15;
		ОбластьВывода.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
		ОбластьВывода.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
		Если НЕ ЭтоПерваяЧастьТаблицы Тогда
			ОбластьВывода = ТабДок.Область(3+ СдвигСтрокПоляТД - 1, 2);
			// >> [Деснол] [Ушаков А.Д.] [26.09.2019] 
			ОбластьВывода.Текст = НСтр("es='Continuación';ru='Продолжение';en='continuation'");
			//ОбластьВывода.Текст = "Продолжение";
			// << [Деснол] [Ушаков А.Д.] [26.09.2019] 
		КонецЕсли;
		ЭтоПерваяЧастьТаблицы = Ложь;
		ОбластьВывода = ТабДок.Область(3 + СдвигСтрокПоляТД, 3,3 + СдвигСтрокПоляТД,ЧертитьКолонок+1);
		ОбластьВывода.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		ОбластьВывода.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
		ОбластьВывода.Объединить();
		// >> [Деснол] [Ушаков А.Д.] [26.09.2019] 
		ОбластьВывода.Текст = НСтр("es='Periodo:';ru='Период:';en='The period:'");
		ОбластьВывода = ТабДок.Область(3 + СдвигСтрокПоляТД, 2);
		ОбластьВывода.Текст = НСтр("es='Condición:';ru='Состояние:';en='Status:'"); 
		ОбластьВывода.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
		ОбластьВывода = ТабДок.Область(4 + СдвигСтрокПоляТД, 2);
		ОбластьВывода.Текст = НСтр("es='No instalado';ru='Не установлено';en='Not installed'"); 
		ОбластьВывода.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
		ОбластьВывода = ТабДок.Область(5+СдвигСтрокПоляТД, 2);
		ОбластьВывода.Текст = НСтр("es='Prueba';ru='Испытания';en='Test'");
		ОбластьВывода.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
		ОбластьВывода = ТабДок.Область(6 + СдвигСтрокПоляТД, 2);
		ОбластьВывода.Текст = НСтр("es='Operación';ru='Эксплуатация';en='Operation'");
		ОбластьВывода.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
		ОбластьВывода = ТабДок.Область(7 + СдвигСтрокПоляТД, 2);
		ОбластьВывода.Текст = НСтр("es='Simple';ru='Простой';en='Simple'");
		// << [Деснол] [Ушаков А.Д.] [26.09.2019] 
		ОбластьВывода.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
		СдвигСтрокПоляТД = СдвигСтрокПоляТД + 7;
	КонецЦикла;
	
	СдвигСтрокПоляТД = ПервичныйСдвигСтрок;
	Номер = 1;
	
	Для Каждого СтрокаСостояния Из ТЗСостояний Цикл
		ТипЭксплуатации = ?(ЗначениеЗаполнено(СтрокаСостояния.ВидЭксплуатации),СтрокаСостояния.ВидЭксплуатации.ТипЭксплуатации,Неопределено);
		Если ТипЭксплуатации = Перечисления.торо_ТипЭксплуатации.Эксплуатация Тогда
			ДопИндекс = 6;
		ИначеЕсли ТипЭксплуатации = Перечисления.торо_ТипЭксплуатации.Простой Тогда
			ДопИндекс = 7;
		ИначеЕсли ТипЭксплуатации = Перечисления.торо_ТипЭксплуатации.Испытания Тогда
			ДопИндекс = 5;
		ИначеЕсли ТипЭксплуатации = Неопределено Тогда
			ДопИндекс = 4;
		КонецЕсли;
		
		ОбластьВывода2 = ТабДок.Область(ДопИндекс + СдвигСтрокПоляТД,Номер + 2);
		ОбластьВывода2.ШиринаКолонки = 10;
		ОбластьВывода2.Текст = Строка(Формат(СтрокаСостояния.Период,"ДФ=dd.MM.yyyy")) + " -"+ Символы.ПС + Строка(Формат(СтрокаСостояния.ДатаКон,"ДФ=dd.MM.yyyy"));
		
		Номер = Номер + 1;
		
		Если ОбластьВывода2.Лево = КоличествоКолонокПоляТД + 1 Тогда
			СдвигСтрокПоляТД = СдвигСтрокПоляТД + 7;
			Номер = 1;	
		КонецЕсли;
		
	КонецЦикла;
	
	Если СтрокаСостояния.ОткрытоеСостояние Тогда
		ОбластьВывода2.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
		ОбластьВывода2.Текст ="с " + Строка(Формат(СтрокаСостояния.Период,"ДФ=dd.MM.yyyy"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВводСостоянияЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Если ЭтаФорма.ПроверитьЗаполнение() Тогда
			Если ЭтаФорма.Записать() Тогда
				ВводСостоянияФрагмент();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВводСостоянияФрагмент()
	
	Перем НС, ФормаДокСостояния;
	
	Если Не ПроверитьСтатусНаСервере("торо_СостоянияОбъектовРемонта") Тогда
		Возврат;
	КонецЕсли;
	Попытка
		
		ЗначенияЗаполнения = Новый Структура();
		ЗначенияЗаполнения.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.торо_ВидыОперацийОтклоненияВРаботеОборудования.ВидЭксплуатации"));
		ЗначенияЗаполнения.Вставить("ОбъектРемонта", Объект.Ссылка);
		ЗначенияЗаполнения.Вставить("СтруктураИерархии", ТекСтруктураИерархии);
		
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения, СтруктураИерархии", ЗначенияЗаполнения, ТекСтруктураИерархии);
		ОткрытьФорму("Документ.торо_СостоянияОбъектовРемонта.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
		
	Исключение
		ПоказатьПредупреждение(Неопределено, ИнформацияОбОшибке().Причина.Описание);
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ВводСостоянияНаПериодЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Если ЭтаФорма.ПроверитьЗаполнение() Тогда
			Если ЭтаФорма.Записать() Тогда
				ВводСостоянияНаПериодФрагмент();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВводСостоянияНаПериодФрагмент()
	
	Перем НС, ФормаДокСостояния;
	
	Если Не ПроверитьСтатусНаСервере("торо_СостоянияОбъектовРемонта") Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		
		ЗначенияЗаполнения = Новый Структура();
		ЗначенияЗаполнения.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.торо_ВидыОперацийОтклоненияВРаботеОборудования.ВидЭксплуатацииНаПериод"));
		ЗначенияЗаполнения.Вставить("ОбъектРемонта", Объект.Ссылка);
		ЗначенияЗаполнения.Вставить("СтруктураИерархии", ТекСтруктураИерархии);
		
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения, СтруктураИерархии", ЗначенияЗаполнения, ТекСтруктураИерархии);
		ОткрытьФорму("Документ.торо_СостоянияОбъектовРемонта.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
		
	Исключение
		ПоказатьПредупреждение(Неопределено, ИнформацияОбОшибке().Причина.Описание);
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область НОРМАТИВЫ_ПЛАНИРОВАНИЯ

#Область НормативныеРемонты

&НаКлиенте
Процедура ЗаполнитьНормативныеРемонты()
		
	Если НЕ МодифицированностьНормРемонтов Тогда
		
		СтруктураВозврата = ЗаполнитьНормативныеРемонтыНаСервере(Объект.Ссылка);
		
		НормативныеРемонты.Очистить();
		Для каждого Элем Из СтруктураВозврата Цикл
			НС = НормативныеРемонты.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Элем);
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ТиповойОР) Тогда
		Для каждого Ремонт Из НормативныеРемонты Цикл 
			Если НЕ ЗначениеЗаполнено(Ремонт.ТиповойОР) И Ремонт.Удален = Ложь Тогда
				СовпадающиеРемонты = НормативныеРемонты.НайтиСтроки(Новый Структура("ТиповойОР, ВидРемонта", Объект.ТиповойОР, Ремонт.ВидРемонта));
				Если СовпадающиеРемонты.Количество() > 0 Тогда 
					СовпадающиеРемонты[0].Удален = Истина;
					МодифицированностьНормРемонтов = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если не МодифицированностьПредшествующихРемонтов Тогда
		СтруктураВозврата = ЗаполнитьПредшествующиеРемонтыНаСервере(Объект.Ссылка);
		
		ПредшествующиеРемонты.Очистить();
		Для Каждого Элем Из СтруктураВозврата Цикл
			НС = ПредшествующиеРемонты.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Элем);
		КонецЦикла;
		
	КонецЕсли;
	
	Если не МодифицированностьЗамещаемыхРемонтов Тогда
		СтруктураВозврата = ЗаполнитьЗамещаемыеРемонтыНаСервере(Объект.Ссылка);
		
		ЗамещаемыеРемонты.Очистить();
		Для Каждого Элем Из СтруктураВозврата Цикл
			НС = ЗамещаемыеРемонты.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Элем);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаполнитьНормативныеРемонтыНаСервере(ОбъектРемонта)
	
	Если ЗначениеЗаполнено(ОбъектРемонта) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_НормативныеРемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта,
		|	торо_НормативныеРемонтыОборудования.ВидРемонта КАК ВидРемонта,
		|	торо_НормативныеРемонтыОборудования.ТиповойОР КАК ТиповойОР,
		|	торо_НормативныеРемонтыОборудования.НормативныйРемонт КАК НормативныйРемонт,
		|	торо_НормативныеРемонтыОборудования.СпособПланирования КАК СпособПланирования,
		|	торо_НормативныеРемонтыОборудования.ГрафикРемонтныхРабот КАК ГрафикРемонтныхРабот,
		|	торо_НормативныеРемонтыОборудования.СпособВыполнения КАК СпособВыполнения,
		|	торо_НормативныеРемонтыОборудования.НеИспользоватьВПланированииДатуВводаВЭксплуатацию КАК НеИспользоватьВПланированииДатуВводаВЭксплуатацию,
		|	торо_НормативныеРемонтыОборудования.СпособУчетаДатыОтсчета КАК СпособУчетаДатыОтсчета,
		|	торо_НормативныеРемонтыОборудования.НеУчаствуетВПланировании КАК НеУчаствуетВПланировании,
		|	торо_НормативныеРемонтыОборудования.РазрешитьСокращатьМежремонтныйПериодПриПланировании КАК РазрешитьСокращатьМежремонтныйПериодПриПланировании,
		|	торо_НормативныеРемонтыОборудования.НеУчитыватьПриПланированииГрафикРаботыОборудования КАК НеУчитыватьПриПланированииГрафикРаботыОборудования,
		|	торо_НормативныеРемонтыОборудования.НеУчитыватьПриПланированииГрафикРемонтныхРабот КАК НеУчитыватьПриПланированииГрафикРемонтныхРабот,
		|	торо_НормативныеРемонтыОборудования.НеУчитыватьПродолжительность КАК НеУчитыватьПродолжительность,
		|	торо_НормативныеРемонтыОборудования.ИспользоватьКоэффициентыРемонтныхОсобенностей КАК ИспользоватьКоэффициентыРемонтныхОсобенностей,
		|	торо_НормативныеРемонтыОборудования.УчитыватьПростоиОборудования КАК УчитыватьПростоиОборудования,
		|	ВЫБОР
		|		КОГДА торо_НормативныеРемонтыОборудованияУдаленные.ОбъектРемонта ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Удален,
		|	торо_НормативныеРемонтыОборудования.СтратегияОбслуживания КАК СтратегияОбслуживания,
		|	торо_НормативныеРемонтыОборудования.ИсточникСтратегии КАК ИсточникСтратегии
		|ИЗ
		|	РегистрСведений.торо_НормативныеРемонтыОборудования КАК торо_НормативныеРемонтыОборудования
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_НормативныеРемонтыОборудованияУдаленные КАК торо_НормативныеРемонтыОборудованияУдаленные
		|		ПО торо_НормативныеРемонтыОборудования.ОбъектРемонта = торо_НормативныеРемонтыОборудованияУдаленные.ОбъектРемонта
		|			И торо_НормативныеРемонтыОборудования.ВидРемонта = торо_НормативныеРемонтыОборудованияУдаленные.ВидРемонта
		|			И торо_НормативныеРемонтыОборудования.ТиповойОР = торо_НормативныеРемонтыОборудованияУдаленные.ТиповойОР
		|ГДЕ
		|	торо_НормативныеРемонтыОборудования.ОбъектРемонта = &ОбъектРемонта";
		
		Запрос.УстановитьПараметр("ОбъектРемонта", ОбъектРемонта);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		СтруктураВозврата = Новый Массив;
		Пока Выборка.Следующий() Цикл
			
			СтруктураПараметр = Новый Структура("ВидРемонта, ТиповойОР, НормативныйРемонт, СпособПланирования, ГрафикРемонтныхРабот,
												|СпособВыполнения, НеИспользоватьВПланированииДатуВводаВЭксплуатацию, СпособУчетаДатыОтсчета,
												|НеУчаствуетВПланировании, РазрешитьСокращатьМежремонтныйПериодПриПланировании,
												|НеУчитыватьПриПланированииГрафикРаботыОборудования, НеУчитыватьПриПланированииГрафикРемонтныхРабот,
												|НеУчитыватьПродолжительность, ИспользоватьКоэффициентыРемонтныхОсобенностей, 
												|УчитыватьПростоиОборудования, Удален, СтратегияОбслуживания, ИсточникСтратегии");
			ЗаполнитьЗначенияСвойств(СтруктураПараметр,Выборка);
						
			СтруктураВозврата.Добавить(СтруктураПараметр);
			
		КонецЦикла;
		
		Возврат СтруктураВозврата;
		
	Иначе
		
		Возврат Новый Массив;
		
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗаполнитьПредшествующиеРемонтыНаСервере(ОбъектРемонта)
	
	Если ЗначениеЗаполнено(ОбъектРемонта) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ПредшествующиеНормативныеРемонтыОборудования.ВидРемонта,
		|	торо_ПредшествующиеНормативныеРемонтыОборудования.ПредшествующийВидРемонта,
		|	торо_ПредшествующиеНормативныеРемонтыОборудования.ТиповойОР
		|ИЗ
		|	РегистрСведений.торо_ПредшествующиеНормативныеРемонтыОборудования КАК торо_ПредшествующиеНормативныеРемонтыОборудования
		|ГДЕ
		|	торо_ПредшествующиеНормативныеРемонтыОборудования.ОбъектРемонта = &ОбъектРемонта";
		
		Запрос.УстановитьПараметр("ОбъектРемонта", ОбъектРемонта);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		СтруктураВозврата = Новый Массив;
		Пока Выборка.Следующий() Цикл
			
			СтруктураВозврата.Добавить(Новый Структура("ВидРемонта, ТиповойОР, ПредшествующийВидРемонта",
			Выборка.ВидРемонта, Выборка.ТиповойОР, Выборка.ПредшествующийВидРемонта));
			
		КонецЦикла;
		
		Возврат СтруктураВозврата;
		
	Иначе
		
		Возврат Новый Массив;
		
	КонецЕсли;		
КонецФункции

&НаСервереБезКонтекста
Функция ЗаполнитьЗамещаемыеРемонтыНаСервере(ОбъектРемонта)
	
	Если ЗначениеЗаполнено(ОбъектРемонта) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.ВидРемонта,
		|	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.ЗамещаемыйВидРемонта,
		|	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.ТиповойОР,
		|	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.СпособЗамещения,
		|	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.НачальнаяГраница,
		|	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.КонечнаяГраница
		|ИЗ
		|	РегистрСведений.торо_ПараметрыЗамещенияПланированияРемонтныхРабот КАК торо_ПараметрыЗамещенияПланированияРемонтныхРабот
		|ГДЕ
		|	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.ОбъектРемонта = &ОбъектРемонта";
		
		Запрос.УстановитьПараметр("ОбъектРемонта", ОбъектРемонта);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		СтруктураВозврата = Новый Массив;
		Пока Выборка.Следующий() Цикл
			
			СтруктураПараметр = Новый Структура("ВидРемонта, ТиповойОР, ЗамещаемыйВидРемонта,
												|СпособЗамещения, НачальнаяГраница, КонечнаяГраница");
			ЗаполнитьЗначенияСвойств(СтруктураПараметр,Выборка);
			
			СтруктураВозврата.Добавить(СтруктураПараметр);
			
		КонецЦикла;
		
		Возврат СтруктураВозврата;
		
	Иначе
		
		Возврат Новый Массив;
		
	КонецЕсли;		
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПредшествующиеРемонтыНаСервере(НовТиповойОР)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_ТиповыеОРНормативныеРемонты.ВидРемонта,
	|	торо_ТиповыеОРНормативныеРемонты.Ссылка
	|ПОМЕСТИТЬ ДействующиеВР
	|ИЗ
	|	Справочник.торо_ТиповыеОР.НормативныеРемонты КАК торо_ТиповыеОРНормативныеРемонты
	|ГДЕ
	|	торо_ТиповыеОРНормативныеРемонты.Ссылка = &Ссылка
	|	И торо_ТиповыеОРНормативныеРемонты.Статус = ЗНАЧЕНИЕ(Перечисление.торо_СтатусыНормативныхРемонтовИТехКарт.Действует)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ТиповыеОРПредшествующиеРемонты.ВидРемонта,
	|	торо_ТиповыеОРПредшествующиеРемонты.ПредшествующийВидРемонта,
	|	торо_ТиповыеОРПредшествующиеРемонты.Ссылка КАК ТиповойОР
	|ИЗ
	|	ДействующиеВР КАК торо_ТиповыеОРНормативныеРемонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТиповыеОР.ПредшествующиеРемонты КАК торо_ТиповыеОРПредшествующиеРемонты
	|		ПО торо_ТиповыеОРНормативныеРемонты.Ссылка = торо_ТиповыеОРПредшествующиеРемонты.Ссылка
	|			И торо_ТиповыеОРНормативныеРемонты.ВидРемонта = торо_ТиповыеОРПредшествующиеРемонты.ВидРемонта
	|			И (торо_ТиповыеОРПредшествующиеРемонты.ПредшествующийВидРемонта В
	|				(ВЫБРАТЬ
	|					ДействующиеВР.ВидРемонта
	|				ИЗ
	|					ДействующиеВР КАК ДействующиеВР))";
	
	Запрос.УстановитьПараметр("Ссылка", НовТиповойОР);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	СтруктураВозврата = Новый Массив;
	Пока Выборка.Следующий() Цикл
		
		СтруктураВозврата.Добавить(Новый Структура("ВидРемонта, ТиповойОР, ПредшествующийВидРемонта",
		Выборка.ВидРемонта, Выборка.ТиповойОР, Выборка.ПредшествующийВидРемонта));
		
	КонецЦикла;
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЗамещаемыеРемонтыНаСервере(НовТиповойОР)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_ТиповыеОРНормативныеРемонты.ВидРемонта,
	|	торо_ТиповыеОРНормативныеРемонты.Ссылка
	|ПОМЕСТИТЬ ДействующиеВР
	|ИЗ
	|	Справочник.торо_ТиповыеОР.НормативныеРемонты КАК торо_ТиповыеОРНормативныеРемонты
	|ГДЕ
	|	торо_ТиповыеОРНормативныеРемонты.Ссылка = &Ссылка
	|	И торо_ТиповыеОРНормативныеРемонты.Статус = ЗНАЧЕНИЕ(Перечисление.торо_СтатусыНормативныхРемонтовИТехКарт.Действует)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ТиповыеОРЗамещаемыеРемонты.Ссылка КАК ТиповойОР,
	|	торо_ТиповыеОРЗамещаемыеРемонты.ВидРемонта,
	|	торо_ТиповыеОРЗамещаемыеРемонты.ЗамещаемыйВидРемонта,
	|	торо_ТиповыеОРЗамещаемыеРемонты.СпособЗамещения,
	|	торо_ТиповыеОРЗамещаемыеРемонты.НачальнаяГраница,
	|	торо_ТиповыеОРЗамещаемыеРемонты.КонечнаяГраница
	|ИЗ
	|	ДействующиеВР КАК торо_ТиповыеОРНормативныеРемонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТиповыеОР.ЗамещаемыеРемонты КАК торо_ТиповыеОРЗамещаемыеРемонты
	|		ПО торо_ТиповыеОРНормативныеРемонты.Ссылка = торо_ТиповыеОРЗамещаемыеРемонты.Ссылка
	|			И торо_ТиповыеОРНормативныеРемонты.ВидРемонта = торо_ТиповыеОРЗамещаемыеРемонты.ВидРемонта
	|			И (торо_ТиповыеОРЗамещаемыеРемонты.ЗамещаемыйВидРемонта В
	|				(ВЫБРАТЬ
	|					ДействующиеВР.ВидРемонта
	|				ИЗ
	|					ДействующиеВР КАК ДействующиеВР))";
	
	Запрос.УстановитьПараметр("Ссылка", НовТиповойОР);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	СтруктураВозврата = Новый Массив;
	Пока Выборка.Следующий() Цикл
		
		СтруктураПараметр = Новый Структура("ВидРемонта, ТиповойОР, ЗамещаемыйВидРемонта,
											|СпособЗамещения, НачальнаяГраница, КонечнаяГраница");
		ЗаполнитьЗначенияСвойств(СтруктураПараметр,Выборка);
		
		СтруктураВозврата.Добавить(СтруктураПараметр);
		
	КонецЦикла;
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ИзменитьПредшествующиеРемонтыНаСервере(ОбъектРемонта, ТекТиповойОР, НовТиповойОР)
	
	НаборЗаписей = РегистрыСведений.торо_ПредшествующиеНормативныеРемонтыОборудования.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОбъектРемонта.Установить(ОбъектРемонта);
	НаборЗаписей.Отбор.ТиповойОР.Установить(ТекТиповойОР);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_ТиповыеОРПредшествующиеРемонты.ВидРемонта КАК ВидРемонта,
	|	торо_ТиповыеОРПредшествующиеРемонты.ПредшествующийВидРемонта
	|ПОМЕСТИТЬ ВТ_ПредшествующиеРемонты
	|ИЗ
	|	Справочник.торо_ТиповыеОР.ПредшествующиеРемонты КАК торо_ТиповыеОРПредшествующиеРемонты
	|ГДЕ
	|	торо_ТиповыеОРПредшествующиеРемонты.Ссылка = &ТиповойОР
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ТиповыеОРНормативныеРемонты.ВидРемонта КАК ВидРемонта
	|ПОМЕСТИТЬ ВТ_ВидРемонта_Действует
	|ИЗ
	|	Справочник.торо_ТиповыеОР.НормативныеРемонты КАК торо_ТиповыеОРНормативныеРемонты
	|ГДЕ
	|	торо_ТиповыеОРНормативныеРемонты.Статус = &СтатусДействует
	|	И торо_ТиповыеОРНормативныеРемонты.Ссылка = &ТиповойОР
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ПредшествующиеРемонты.ВидРемонта,
	|	ВТ_ПредшествующиеРемонты.ПредшествующийВидРемонта
	|ИЗ
	|	ВТ_ПредшествующиеРемонты КАК ВТ_ПредшествующиеРемонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВидРемонта_Действует КАК ВТ_ВидРемонта_Действует
	|		ПО ВТ_ПредшествующиеРемонты.ВидРемонта = ВТ_ВидРемонта_Действует.ВидРемонта";
	
	Запрос.УстановитьПараметр("ТиповойОР", НовТиповойОР);
	Запрос.УстановитьПараметр("СтатусДействует", Перечисления.торо_СтатусыНормативныхРемонтовИТехКарт.Действует);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	НаборЗаписей = РегистрыСведений.торо_ПредшествующиеНормативныеРемонтыОборудования.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОбъектРемонта.Установить(ОбъектРемонта);
	НаборЗаписей.Отбор.ТиповойОР.Установить(НовТиповойОР);
	НаборЗаписей.Прочитать();
	
	Пока Выборка.Следующий() Цикл
		
		НС = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Выборка);
		НС.ОбъектРемонта = ОбъектРемонта;
		НС.ТиповойОР = НовТиповойОР;
		НС.Приоритет = Истина;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьЗамещаемыеРемонтыНаСервере(ОбъектРемонта, ТекТиповойОР, НовТиповойОР)
	
	НаборЗаписей = РегистрыСведений.торо_ПараметрыЗамещенияПланированияРемонтныхРабот.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОбъектРемонта.Установить(ОбъектРемонта);
	НаборЗаписей.Отбор.ТиповойОР.Установить(ТекТиповойОР);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_ТиповыеОРЗамещаемыеРемонты.ВидРемонта,
	|	торо_ТиповыеОРЗамещаемыеРемонты.ЗамещаемыйВидРемонта,
	|	торо_ТиповыеОРЗамещаемыеРемонты.СпособЗамещения,
	|	торо_ТиповыеОРЗамещаемыеРемонты.НачальнаяГраница,
	|	торо_ТиповыеОРЗамещаемыеРемонты.КонечнаяГраница
	|ИЗ
	|	Справочник.торо_ТиповыеОР.ЗамещаемыеРемонты КАК торо_ТиповыеОРЗамещаемыеРемонты
	|ГДЕ
	|	торо_ТиповыеОРЗамещаемыеРемонты.Ссылка = &ТиповойОР";
	
	Запрос.УстановитьПараметр("ТиповойОР", НовТиповойОР);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	НаборЗаписей = РегистрыСведений.торо_ПараметрыЗамещенияПланированияРемонтныхРабот.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОбъектРемонта.Установить(ОбъектРемонта);
	НаборЗаписей.Отбор.ТиповойОР.Установить(НовТиповойОР);
	НаборЗаписей.Прочитать();
	
	Пока Выборка.Следующий() Цикл
		
		НС = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Выборка);
		НС.ОбъектРемонта = ОбъектРемонта;
		НС.ТиповойОР = НовТиповойОР;
		НС.Приоритет = Истина;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнениеНормативныхРемонтов(Отказ)

		Если МодифицированностьНормРемонтов Тогда		 
			
		Для Каждого Стр Из НормативныеРемонты Цикл
			Если Не Стр.Удален Тогда
				Если НЕ ЗначениеЗаполнено(Стр.ВидРемонта) Тогда
					ШаблонСообщения = НСтр("es='No consiguió anotar las reparaciones normativas: no es rellenado el campo ""el Tipo de la reparación"" en la línea № %1';ru='Не удалось записать нормативные ремонты: не заполнено поле ""Вид ремонта"" в строке № %1';en='Failed to record standard repairs: the field “Type of repair” in line № %1 is not filled'");
					ТекстСообщения = СтрШаблон(ШаблонСообщения, Строка(Стр.ПолучитьИдентификатор()+1));
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(Стр.НормативныйРемонт) Тогда
					ШаблонСообщения = НСтр("es='No consiguió anotar las reparaciones normativas: no es rellenado el campo ""la tarjeta Tecnológica"" en la línea № %1';ru='Не удалось записать нормативные ремонты: не заполнено поле ""Технологическая карта"" в строке № %1';en='Failed to record normative repairs: the “Route map” field is not filled in line № %1'");
					ТекстСообщения = СтрШаблон(ШаблонСообщения, Строка(Стр.ПолучитьИдентификатор()+1));
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(Стр.СпособПланирования) Тогда
					ШаблонСообщения = НСтр("es='No consiguió anotar las reparaciones normativas: no es rellenado el campo ""el Modo de la planificación"" en la línea № %1';ru='Не удалось записать нормативные ремонты: не заполнено поле ""Способ планирования"" в строке № %1';en='Failed to record normative repairs: the ""Planning method"" field is not filled in line № %1'");
					ТекстСообщения = СтрШаблон(ШаблонСообщения, Строка(Стр.ПолучитьИдентификатор()+1));
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(Стр.ГрафикРемонтныхРабот) Тогда
					ШаблонСообщения = НСтр("es='No consiguió anotar las reparaciones normativas: no es rellenado el campo ""el Gráfico de los trabajos de reparación"" en la línea № %1';ru='Не удалось записать нормативные ремонты: не заполнено поле ""График ремонтных работ"" в строке № %1';en='Failed to record normative repairs: the ""Repair schedule"" field is not filled in line № %1'");
					ТекстСообщения = СтрШаблон(ШаблонСообщения, Строка(Стр.ПолучитьИдентификатор()+1));
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(Стр.СпособВыполнения) Тогда
					ШаблонСообщения = НСтр("es='No consiguió anotar las reparaciones normativas: no es rellenado el campo ""el Modo de la ejecución"" en la línea № %1';ru='Не удалось записать нормативные ремонты: не заполнено поле ""Способ выполнения"" в строке № %1';en='Failed to record standard repairs: the ""Execution method"" field is not filled in line № %1'");
					ТекстСообщения = СтрШаблон(ШаблонСообщения, Строка(Стр.ПолучитьИдентификатор()+1));
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				КонецЕсли;
				Если Не ЗначениеЗаполнено(Стр.СпособУчетаДатыОтсчета) Тогда
					ШаблонСообщения = НСтр("es='No consiguió anotar las reparaciones normativas: no es rellenado el campo ""el Modo del recuento de la fecha de la lectura"" en la línea № %1';ru='Не удалось записать нормативные ремонты: не заполнено поле ""Способ учета даты отсчета"" в строке № %1';en='Failed to record normative repairs: the ""Method of accounting for the reference date"" field in line № %1 is not filled'");
					ТекстСообщения = СтрШаблон(ШаблонСообщения, Строка(Стр.ПолучитьИдентификатор()+1));
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнениеЗамещаемыхРемонтов(Отказ)
	
	Для каждого СтрЗамещРемонта Из ЗамещаемыеРемонты Цикл
		Если ЗначениеЗаполнено(СтрЗамещРемонта.ЗамещаемыйВидРемонта) Тогда
			Если ЗначениеЗаполнено(СтрЗамещРемонта.ТиповойОР) Тогда 
				Продолжить;
			КонецЕсли;
			
			МежремонтныйИнтервал = ВычислениеМежремонтногоИнтервала(СтрЗамещРемонта);
			Если НЕ МежремонтныйИнтервал = Неопределено Тогда
				Если МежремонтныйИнтервал <= СтрЗамещРемонта.НачальнаяГраница Тогда
					ШаблонСообщения = НСтр("es='Es rellenado el campo ""los Días del comienzo"" para la reparación %1 en la línea %2';ru='Некорректно заполнено поле ""Дней от начала"" для ремонта %1 в строке %2';en='The ""Days from start"" field is incorrectly filled for repair %1 on line %2'");
					ТекстСообщения = СтрШаблон(ШаблонСообщения, СтрЗамещРемонта.ВидРемонта, СтрЗамещРемонта.ЗамещаемыйВидРемонта);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				КонецЕсли;
				Если МежремонтныйИнтервал <= СтрЗамещРемонта.КонечнаяГраница Тогда
					ШаблонСообщения = НСтр("es='Es rellenado el campo ""los Días de la terminación"" para la reparación %1 en la línea %2';ru='Некорректно заполнено поле ""Дней от окончания"" для ремонта %1 в строке %2';en='The ""Days from the end"" field is incorrectly filled for repair %1 in line %2'");
					ТекстСообщения = СтрШаблон(ШаблонСообщения, СтрЗамещРемонта.ВидРемонта, СтрЗамещРемонта.ЗамещаемыйВидРемонта);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаСДублями = Новый ТаблицаЗначений;
	ТаблицаСДублями.Колонки.Добавить("Ремонт"); 
	Для Каждого СтрокаЗамещения ИЗ ЗамещаемыеРемонты Цикл
		Для Каждого СтрокаЗамещения1 Из ЗамещаемыеРемонты Цикл
			Если СтрокаЗамещения.ВидРемонта = СтрокаЗамещения1.ВидРемонта
				И СтрокаЗамещения.ЗамещаемыйВидРемонта = СтрокаЗамещения1.ЗамещаемыйВидРемонта
				И СтрокаЗамещения.ТиповойОР = СтрокаЗамещения1.ТиповойОР
				И СтрокаЗамещения <> СтрокаЗамещения1 Тогда
				ТаблицаСДублями.Добавить().Ремонт = СтрокаЗамещения.ВидРемонта;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ТаблицаСДублями.Свернуть("Ремонт");
	
	Если ЗначениеЗаполнено(ТаблицаСДублями) Тогда
		ТекстСообщения = НСтр("es='No son correctamente ajustadas las reparaciones sustituidas cerca de los tipos de la reparación:';ru='Не корректно настроены замещаемые ремонты у видов ремонта:';en='Replaceable repairs for types of repairs are not correctly configured:'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		Для Каждого СтрокаРемонта Из ТаблицаСДублями Цикл
			ТекстСообщения = " - " + СтрокаРемонта.Ремонт;
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ВычислениеМежремонтногоИнтервала(ТекДанные)
	
	Перем МежремонтныйИнтервал;
	
	Запрос = Новый Запрос;
	Таб = НормативныеРемонты.Выгрузить(,"ВидРемонта, СпособПланирования");
	Запрос.УстановитьПараметр("Таб", Таб);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таб.СпособПланирования
	|ПОМЕСТИТЬ ОпредСпособПланирования
	|ИЗ
	|	&Таб КАК Таб
	|ГДЕ
	|	Таб.ВидРемонта = &ВидРемонта
	|	И Таб.СпособПланирования <>ЗНАЧЕНИЕ(Справочник.торо_СпособыПланированияРемонтныхРабот.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_СпособыПланированияРемонтныхРабот.ИспользоватьПараметрыНаработки,
	|	торо_СпособыПланированияРемонтныхРабот.ИспользоватьПериодичность,
	|	торо_СпособыПланированияРемонтныхРабот.КоличествоПериодов,
	|	торо_СпособыПланированияРемонтныхРабот.ПериодичностьРемонтныхРабот КАК Периодичность,
	|	ОпредСпособПланирования.СпособПланирования КАК СпособПланирования
	|ИЗ
	|	ОпредСпособПланирования КАК ОпредСпособПланирования
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_СпособыПланированияРемонтныхРабот КАК торо_СпособыПланированияРемонтныхРабот
	|		ПО ОпредСпособПланирования.СпособПланирования = торо_СпособыПланированияРемонтныхРабот.Ссылка";
	
	
	Запрос.УстановитьПараметр("ВидРемонта", ТекДанные.ЗамещаемыйВидРемонта);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДляПериодичности = Результат.Выбрать();
	
	Если ВыборкаДляПериодичности.Следующий() Тогда
		
		Если ВыборкаДляПериодичности.ИспользоватьПериодичность Тогда
			
			Если ВыборкаДляПериодичности.Периодичность = Перечисления.Периодичность.Год Тогда
				Период = 365;
			ИначеЕсли ВыборкаДляПериодичности.Периодичность = Перечисления.Периодичность.Полугодие Тогда
				Период = 182;
			ИначеЕсли ВыборкаДляПериодичности.Периодичность = Перечисления.Периодичность.Квартал Тогда
				Период = 90;
			ИначеЕсли ВыборкаДляПериодичности.Периодичность = Перечисления.Периодичность.Месяц Тогда
				Период = 28;
			ИначеЕсли ВыборкаДляПериодичности.Периодичность = Перечисления.Периодичность.Декада Тогда
				Период = 10;
			ИначеЕсли ВыборкаДляПериодичности.Периодичность = Перечисления.Периодичность.Неделя Тогда
				Период = 7;
			Иначе Период = 1;
			КонецЕсли;
			
			МежремонтныйИнтервал = ВыборкаДляПериодичности.КоличествоПериодов * Период;
			
		КонецЕсли;
		
		Если ВыборкаДляПериодичности.ИспользоватьПараметрыНаработки Тогда
			
			Запрос3 = Новый Запрос;
			
			Если СписокПараметровНаработки.Количество() > 0 Тогда
				
				ТаблНараб = СписокПараметровНаработки.Выгрузить(, "ОбъектРемонта,Показатель,ПродолжительностьПериодаПлановойНаработки,ПериодПлановойНаработки,ПлановаяНаработка,КоэффициентИспользованияОборудования"); 
				
			Иначе
				
				СписокОтбора = Новый СписокЗначений;
				СписокОтбора.Добавить(Объект.Ссылка);
				
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	торо_ПараметрыНаработкиОбъектовРемонта.ОбъектРемонта,
				|	торо_ПараметрыНаработкиОбъектовРемонта.Показатель,
				|	торо_ПараметрыНаработкиОбъектовРемонта.ПлановаяНаработка,
				|	торо_ПараметрыНаработкиОбъектовРемонта.ПериодПлановойНаработки,
				|	торо_ПараметрыНаработкиОбъектовРемонта.КоэффициентИспользованияОборудования,
				|	торо_ПараметрыНаработкиОбъектовРемонта.Период,
				|	торо_ПараметрыНаработкиОбъектовРемонта.ПродолжительностьПериодаПлановойНаработки
				|ИЗ
				|	РегистрСведений.торо_ПараметрыНаработкиОбъектовРемонта КАК торо_ПараметрыНаработкиОбъектовРемонта
				|ГДЕ
				|	торо_ПараметрыНаработкиОбъектовРемонта.ОбъектРемонта В(&СписокОтбора)";
				
				Запрос.УстановитьПараметр("СписокОтбора", СписокОтбора);
				
				Результат = Запрос.Выполнить();
				ТаблНараб = Результат.Выгрузить();
				
			КонецЕсли;
			
			Запрос3.УстановитьПараметр("ТаблНараб", ТаблНараб);
			
			
			Запрос3.Текст = 
			"ВЫБРАТЬ
			|	ТаблНараб.Показатель,
			|	ТаблНараб.ПродолжительностьПериодаПлановойНаработки,
			|	ТаблНараб.ПериодПлановойНаработки,
			|	ТаблНараб.ПлановаяНаработка * ТаблНараб.КоэффициентИспользованияОборудования КАК ПлановаяНаработка
			|ПОМЕСТИТЬ ВыбрПараметрыНаработки
			|ИЗ
			|	&ТаблНараб КАК ТаблНараб
			|ГДЕ
			|	ТаблНараб.ОбъектРемонта = &ОбъектРемонта
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	торо_СпособыПланированияРемонтныхРаботПараметрыНаработки.ЗначениеПараметраНаработки,
			|	торо_СпособыПланированияРемонтныхРаботПараметрыНаработки.ПараметрНаработки
			|ПОМЕСТИТЬ ВыбрСпобобыПланирования
			|ИЗ
			|	Справочник.торо_СпособыПланированияРемонтныхРабот.ПараметрыНаработки КАК торо_СпособыПланированияРемонтныхРаботПараметрыНаработки
			|ГДЕ
			|	торо_СпособыПланированияРемонтныхРаботПараметрыНаработки.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВыбрСпобобыПланирования.ЗначениеПараметраНаработки,
			|	ЕстьNULL(ВыбрПараметрыНаработки.ПродолжительностьПериодаПлановойНаработки,0) КАК ПродолжительностьПериодаПлановойНаработки,
			|	ВыбрПараметрыНаработки.ПериодПлановойНаработки,
			|	ЕстьNULL(ВыбрПараметрыНаработки.ПлановаяНаработка,0) КАК ПлановаяНаработка
			|ИЗ
			|	ВыбрСпобобыПланирования КАК ВыбрСпобобыПланирования
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВыбрПараметрыНаработки КАК ВыбрПараметрыНаработки
			|		ПО ВыбрСпобобыПланирования.ПараметрНаработки = ВыбрПараметрыНаработки.Показатель";
			
			
			Запрос3.УстановитьПараметр("Ссылка", ВыборкаДляПериодичности.СпособПланирования);
			Запрос3.УстановитьПараметр("ОбъектРемонта", Объект.Ссылка);
			
			Результат = Запрос3.Выполнить();
			
			ВыборкаДляНаработки = Результат.Выбрать();
			ВыборкаДляНаработки.Следующий();
			
			Если ВыборкаДляНаработки.ПлановаяНаработка > 0 И ВыборкаДляНаработки.ПродолжительностьПериодаПлановойНаработки > 0 Тогда
				
				
				Если ВыборкаДляНаработки.ПериодПлановойНаработки = Перечисления.Периодичность.Год Тогда
					ПериодПлановойНаработки = 365;
				ИначеЕсли ВыборкаДляНаработки.ПериодПлановойНаработки = Перечисления.Периодичность.Полугодие Тогда
					ПериодПлановойНаработки = 182;
				ИначеЕсли ВыборкаДляНаработки.ПериодПлановойНаработки = Перечисления.Периодичность.Квартал Тогда
					ПериодПлановойНаработки = 90;
				ИначеЕсли ВыборкаДляНаработки.ПериодПлановойНаработки = Перечисления.Периодичность.Месяц Тогда
					ПериодПлановойНаработки = 28;
				ИначеЕсли ВыборкаДляНаработки.ПериодПлановойНаработки = Перечисления.Периодичность.Декада Тогда
					ПериодПлановойНаработки = 10;
				ИначеЕсли ВыборкаДляНаработки.ПериодПлановойНаработки = Перечисления.Периодичность.Неделя Тогда
					ПериодПлановойНаработки = 7;
				Иначе ПериодПлановойНаработки = 1;
				КонецЕсли;
				
				ПериодВДнях = ПериодПлановойНаработки * ВыборкаДляНаработки.ПродолжительностьПериодаПлановойНаработки;
				ПланНарабВДень = ВыборкаДляНаработки.ПлановаяНаработка / ПериодВДнях;
				
				МежремИнтервал = ВыборкаДляНаработки.ЗначениеПараметраНаработки / ПланНарабВДень;
				Если ЗначениеЗаполнено(МежремонтныйИнтервал) Тогда
					Если МежремИнтервал < МежремонтныйИнтервал Тогда
						МежремонтныйИнтервал = МежремИнтервал;
					КонецЕсли;
				Иначе МежремонтныйИнтервал = МежремИнтервал;
				КонецЕсли;
			Иначе 
				ШаблонСообщения = НСтр("ru = 'Проверьте заполнение показателей на вкладке ""Наработка"", Параметров планирования по наработке в способе планирования %1'");
				ТекстСообщения = СтрШаблон(ШаблонСообщения, ВыборкаДляПериодичности.СпособПланирования);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		КонецЕсли;
		
		
	Иначе 
		ТекстСообщения = НСтр("ru = 'Проверьте заполнение ""Способ планирования""'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	Возврат МежремонтныйИнтервал;
	
КонецФункции 

&НаСервере
Процедура ЗаписатьНормативныеРемонты(ТекОбъект, Отказ)

	Если МодифицированностьНормРемонтов Тогда
		
		Попытка
			
			НаборЗаписейДействующие = РегистрыСведений.торо_НормативныеРемонтыОборудования.СоздатьНаборЗаписей();
			НаборЗаписейДействующие.Отбор.ОбъектРемонта.Установить(ТекОбъект);
			НаборЗаписейУдаленные	= РегистрыСведений.торо_НормативныеРемонтыОборудованияУдаленные.СоздатьНаборЗаписей();
			НаборЗаписейУдаленные.Отбор.ОбъектРемонта.Установить(ТекОбъект);
			
			Для Каждого СтрокаНорматива Из НормативныеРемонты Цикл
					
				Если НЕ ЗначениеЗаполнено(СтрокаНорматива.ТиповойОР) Тогда
					
					НС = НаборЗаписейДействующие.Добавить();
					ЗаполнитьЗначенияСвойств(НС,СтрокаНорматива);
					НС.ОбъектРемонта = ТекОбъект;
					НС.Приоритет = Истина;
					
				ИначеЕсли СтрокаНорматива.Удален Тогда
					
					НС = НаборЗаписейДействующие.Добавить();
					ЗаполнитьЗначенияСвойств(НС,СтрокаНорматива);
					НС.ОбъектРемонта = ТекОбъект;
					НС.Приоритет = Ложь;
					
					НС = НаборЗаписейУдаленные.Добавить();
					ЗаполнитьЗначенияСвойств(НС,СтрокаНорматива,"ТиповойОР,ВидРемонта");
					НС.ОбъектРемонта = ТекОбъект;
					
				Иначе	
					
					НС = НаборЗаписейДействующие.Добавить();
					ЗаполнитьЗначенияСвойств(НС,СтрокаНорматива);
					НС.ОбъектРемонта = ТекОбъект;
					НС.Приоритет = НормативныеРемонты.НайтиСтроки(Новый Структура("ВидРемонта,ТиповойОР",СтрокаНорматива.ВидРемонта,Справочники.торо_ТиповыеОР.ПустаяСсылка())).Количество() = 0;
					
				КонецЕсли;
				
			КонецЦикла;
			
			НаборЗаписейДействующие.Записать();
			НаборЗаписейУдаленные.Записать();
			
		Исключение
			ТекстСообщения = НСтр("es='No consiguió anotar las reparaciones normativas: ';ru='Не удалось записать нормативные ремонты: ';en='Failed to record regulatory repairs: '") + ОписаниеОшибки();
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			Возврат;
		КонецПопытки;
		
	КонецЕсли;
	
	Если МодифицированностьНормРемонтов ИЛИ МодифицированностьПредшествующихРемонтов Тогда
		
		Попытка
			Если ПредТиповойОР <> Объект.ТиповойОР Тогда
				ИзменитьПредшествующиеРемонтыНаСервере(ТекОбъект, ПредТиповойОР, Объект.ТиповойОР);
			КонецЕсли;
			
			НаборЗаписей = РегистрыСведений.торо_ПредшествующиеНормативныеРемонтыОборудования.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ОбъектРемонта.Установить(ТекОбъект);
			НаборЗаписей.Отбор.ТиповойОР.Установить(Справочники.торо_ТиповыеОР.ПустаяСсылка());
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			НаборЗаписей.Записать();
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ТабТекПредшествующих",ПредшествующиеРемонты.Выгрузить(Новый Структура("ТиповойОР",Справочники.торо_ТиповыеОР.ПустаяСсылка())));
			Запрос.УстановитьПараметр("ОбъектРемонта",ТекОбъект);
			Запрос.Текст = "ВЫБРАТЬ
			|	ТабПредРемонтов.ВидРемонта,
			|	ТабПредРемонтов.ПредшествующийВидРемонта,
			|	ТабПредРемонтов.ТиповойОР
			|ПОМЕСТИТЬ ТабПредРемонтов
			|ИЗ
			|	&ТабТекПредшествующих КАК ТабПредРемонтов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	торо_ПредшествующиеНормативныеРемонтыОборудования.ВидРемонта,
			|	торо_ПредшествующиеНормативныеРемонтыОборудования.ПредшествующийВидРемонта,
			|	торо_ПредшествующиеНормативныеРемонтыОборудования.ТиповойОР,
			|	ЛОЖЬ КАК Приоритет
			|ПОМЕСТИТЬ ТабСПриоритетами
			|ИЗ
			|	РегистрСведений.торо_ПредшествующиеНормативныеРемонтыОборудования КАК торо_ПредшествующиеНормативныеРемонтыОборудования
			|ГДЕ
			|	торо_ПредшествующиеНормативныеРемонтыОборудования.ОбъектРемонта = &ОбъектРемонта
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ТабПредРемонтов.ВидРемонта,
			|	ТабПредРемонтов.ПредшествующийВидРемонта,
			|	ТабПредРемонтов.ТиповойОР,
			|	ИСТИНА
			|ИЗ
			|	ТабПредРемонтов КАК ТабПредРемонтов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТабСПриоритетами.ВидРемонта,
			|	ТабСПриоритетами.ТиповойОР,
			|	МАКСИМУМ(ТабСПриоритетами.Приоритет) КАК Приоритет
			|ПОМЕСТИТЬ ТабСМаксПриоритетами
			|ИЗ
			|	ТабСПриоритетами КАК ТабСПриоритетами
			|
			|СГРУППИРОВАТЬ ПО
			|	ТабСПриоритетами.ВидРемонта,
			|	ТабСПриоритетами.ТиповойОР
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТабСПриоритетами.ВидРемонта,
			|	ТабСПриоритетами.ПредшествующийВидРемонта,
			|	ТабСПриоритетами.ТиповойОР,
			|	&ОбъектРемонта КАК ОбъектРемонта,
			|	ВЫБОР
			|		КОГДА торо_НормативныеРемонтыОборудования.ВидРемонта ЕСТЬ NULL 
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ТабСПриоритетами.Приоритет
			|	КОНЕЦ КАК Приоритет
			|ИЗ
			|	ТабСМаксПриоритетами КАК ТабСМаксПриоритетами
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабСПриоритетами КАК ТабСПриоритетами
			|		ПО ТабСМаксПриоритетами.ВидРемонта = ТабСПриоритетами.ВидРемонта
			|			И ТабСМаксПриоритетами.ТиповойОР = ТабСПриоритетами.ТиповойОР
			|			И ТабСМаксПриоритетами.Приоритет = ТабСПриоритетами.Приоритет
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_НормативныеРемонтыОборудования КАК торо_НормативныеРемонтыОборудования
			|		ПО ТабСМаксПриоритетами.ВидРемонта = торо_НормативныеРемонтыОборудования.ВидРемонта
			|			И (торо_НормативныеРемонтыОборудования.ОбъектРемонта = &ОбъектРемонта
			|				И торо_НормативныеРемонтыОборудования.ТиповойОР = ЗНАЧЕНИЕ(Справочник.торо_ТиповыеОР.ПустаяСсылка)
			|				И торо_НормативныеРемонтыОборудования.Приоритет)";
			
			Результат = Запрос.Выполнить();
			
			Если Не Результат.Пустой() Тогда
				Выборка = Результат.Выбрать();
				
				Пока Выборка.Следующий() Цикл
					
					Если Не ЗначениеЗаполнено(Выборка.ПредшествующийВидРемонта) Тогда
						ШаблонСообщения = НСтр("es='No consiguió anotar las reparaciones que preceden: para el tipo de la reparación <%1> no es rellenado el campo ""el tipo que Precede de la reparación""';ru='Не удалось записать предшествующие ремонты: для вида ремонта <%1> не заполнено поле ""Предшествующий вид ремонта""';en='Failed to record previous repairs: for the type of repair <%1> the field ""Previous type of repair"" is not filled'");
						ТекстСообщения = СтрШаблон(ШаблонСообщения, Выборка.ВидРемонта);
						ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
					ИначеЕсли Не ЗначениеЗаполнено(Выборка.ВидРемонта) Тогда
						ТекстСообщения = НСтр("es='No consiguió anotar las reparaciones que preceden: en una de las líneas no es rellenado el campo ""el Tipo de la reparación""';ru='Не удалось записать предшествующие ремонты: в одной из строк не заполнено поле ""Вид ремонта""';en='Failed to record previous repairs: in one of the lines the field “Type of repair” is not filled'");
						ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
					КонецЕсли;
					
					Если Отказ Тогда
						Продолжить;
					КонецЕсли;
					
					НаборЗаписейОР = РегистрыСведений.торо_ПредшествующиеНормативныеРемонтыОборудования.СоздатьНаборЗаписей();
					НаборЗаписейОР.Отбор.ОбъектРемонта.Установить(ТекОбъект);
					НаборЗаписейОР.Отбор.ТиповойОР.Установить(Выборка.ТиповойОР);
					НаборЗаписейОР.Отбор.ВидРемонта.Установить(Выборка.ВидРемонта);
					НаборЗаписейОР.Отбор.ПредшествующийВидРемонта.Установить(Выборка.ПредшествующийВидРемонта);
					
					ЗаполнитьЗначенияСвойств(НаборЗаписейОР.Добавить(),Выборка);
					
					НаборЗаписейОР.Записать(Истина);
					
				КонецЦикла;
			КонецЕсли;
			
			Если Отказ Тогда
				Возврат;
			КонецЕсли;
			
		Исключение
			ТекстСообщения = НСтр("es='No consiguió anotar las reparaciones que preceden: ';ru='Не удалось записать предшествующие ремонты: ';en='Failed to record previous repairs: '") + ОписаниеОшибки();
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			Возврат;
		КонецПопытки;
		
	КонецЕсли;
	
	Если МодифицированностьНормРемонтов ИЛИ МодифицированностьЗамещаемыхРемонтов Тогда
		
		Попытка
			Если ПредТиповойОР <> Объект.ТиповойОР Тогда
				ИзменитьЗамещаемыеРемонтыНаСервере(ТекОбъект, ПредТиповойОР, Объект.ТиповойОР);
			КонецЕсли;
			
			НаборЗаписей = РегистрыСведений.торо_ПараметрыЗамещенияПланированияРемонтныхРабот.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ОбъектРемонта.Установить(ТекОбъект);
			НаборЗаписей.Отбор.ТиповойОР.Установить(Справочники.торо_ТиповыеОР.ПустаяСсылка());
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			НаборЗаписей.Записать();
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ТабТекЗамещающих",ЗамещаемыеРемонты.Выгрузить(Новый Структура("ТиповойОР",Справочники.торо_ТиповыеОР.ПустаяСсылка())));
			Запрос.УстановитьПараметр("ОбъектРемонта",ТекОбъект);
			Запрос.Текст = "ВЫБРАТЬ
			|	ТабТекЗамещающих.ВидРемонта,
			|	ТабТекЗамещающих.ЗамещаемыйВидРемонта,
			|	ТабТекЗамещающих.ТиповойОР,
			|	ТабТекЗамещающих.СпособЗамещения,
			|	ТабТекЗамещающих.НачальнаяГраница,
			|	ТабТекЗамещающих.КонечнаяГраница
			|ПОМЕСТИТЬ ТабТекЗамещающих
			|ИЗ
			|	&ТабТекЗамещающих КАК ТабТекЗамещающих
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.ВидРемонта,
			|	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.ЗамещаемыйВидРемонта,
			|	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.ТиповойОР,
			|	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.СпособЗамещения,
			|	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.НачальнаяГраница,
			|	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.КонечнаяГраница,
			|	ЛОЖЬ КАК Приоритет
			|ПОМЕСТИТЬ ТабСПриоритетами
			|ИЗ
			|	РегистрСведений.торо_ПараметрыЗамещенияПланированияРемонтныхРабот КАК торо_ПараметрыЗамещенияПланированияРемонтныхРабот
			|ГДЕ
			|	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.ОбъектРемонта = &ОбъектРемонта
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ТабТекЗамещающих.ВидРемонта,
			|	ТабТекЗамещающих.ЗамещаемыйВидРемонта,
			|	ТабТекЗамещающих.ТиповойОР,
			|	ТабТекЗамещающих.СпособЗамещения,
			|	ТабТекЗамещающих.НачальнаяГраница,
			|	ТабТекЗамещающих.КонечнаяГраница,
			|	ИСТИНА
			|ИЗ
			|	ТабТекЗамещающих КАК ТабТекЗамещающих
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТабСПриоритетами.ВидРемонта,
			|	ТабСПриоритетами.ТиповойОР,
			|	МАКСИМУМ(ТабСПриоритетами.Приоритет) КАК Приоритет
			|ПОМЕСТИТЬ ТабСМаксПриоритетами
			|ИЗ
			|	ТабСПриоритетами КАК ТабСПриоритетами
			|
			|СГРУППИРОВАТЬ ПО
			|	ТабСПриоритетами.ВидРемонта,
			|	ТабСПриоритетами.ТиповойОР
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТабСПриоритетами.ВидРемонта,
			|	ТабСПриоритетами.ЗамещаемыйВидРемонта,
			|	ТабСПриоритетами.ТиповойОР,
			|	ТабСПриоритетами.СпособЗамещения,
			|	ТабСПриоритетами.НачальнаяГраница,
			|	ТабСПриоритетами.КонечнаяГраница,
			|	ВЫБОР
			|		КОГДА торо_НормативныеРемонтыОборудования.ВидРемонта ЕСТЬ NULL 
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ТабСПриоритетами.Приоритет
			|	КОНЕЦ КАК Приоритет,
			|	&ОбъектРемонта КАК ОбъектРемонта
			|ИЗ
			|	ТабСМаксПриоритетами КАК ТабСМаксПриоритетами
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабСПриоритетами КАК ТабСПриоритетами
			|		ПО ТабСМаксПриоритетами.ВидРемонта = ТабСПриоритетами.ВидРемонта
			|			И ТабСМаксПриоритетами.ТиповойОР = ТабСПриоритетами.ТиповойОР
			|			И ТабСМаксПриоритетами.Приоритет = ТабСПриоритетами.Приоритет
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_НормативныеРемонтыОборудования КАК торо_НормативныеРемонтыОборудования
			|		ПО ТабСМаксПриоритетами.ВидРемонта = торо_НормативныеРемонтыОборудования.ВидРемонта
			|			И (торо_НормативныеРемонтыОборудования.ОбъектРемонта = &ОбъектРемонта
			|				И торо_НормативныеРемонтыОборудования.ТиповойОР = ЗНАЧЕНИЕ(Справочник.торо_ТиповыеОР.ПустаяСсылка)
			|				И торо_НормативныеРемонтыОборудования.Приоритет)";
			
			
			Результат = Запрос.Выполнить();
			
			Если Не Результат.Пустой() Тогда
				Выборка = Результат.Выбрать();
				
				Пока Выборка.Следующий() Цикл
					
					Если Не ЗначениеЗаполнено(Выборка.ЗамещаемыйВидРемонта) Тогда
						ШаблонСообщения = НСтр("es='No consiguió anotar las reparaciones que preceden: para el tipo de la reparación <%1> no es rellenado el campo ""el tipo Sustituido de la reparación""';ru='Не удалось записать предшествующие ремонты: для вида ремонта <%1> не заполнено поле ""Замещаемый вид ремонта""';en='Failed to record previous repairs: for the type of repair <%1> the field ""Substitute type of repair"" is not filled'");
						ТекстСообщения = СтрШаблон(ШаблонСообщения, Выборка.ВидРемонта);
						ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
					ИначеЕсли Не ЗначениеЗаполнено(Выборка.ВидРемонта) Тогда
						ТекстСообщения = НСтр("es='No consiguió anotar las reparaciones que preceden: en una de las líneas no es rellenado el campo ""el Tipo de la reparación""';ru='Не удалось записать предшествующие ремонты: в одной из строк не заполнено поле ""Вид ремонта""';en='Failed to record previous repairs: in one of the lines the field “Type of repair” is not filled'");
						ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
					КонецЕсли;
					
					Если Отказ Тогда
						Продолжить;
					КонецЕсли;
					
					НаборЗаписейОР = РегистрыСведений.торо_ПараметрыЗамещенияПланированияРемонтныхРабот.СоздатьНаборЗаписей();
					НаборЗаписейОР.Отбор.ОбъектРемонта.Установить(ТекОбъект);
					НаборЗаписейОР.Отбор.ТиповойОР.Установить(Выборка.ТиповойОР);
					НаборЗаписейОР.Отбор.ВидРемонта.Установить(Выборка.ВидРемонта);
					НаборЗаписейОР.Отбор.ЗамещаемыйВидРемонта.Установить(Выборка.ЗамещаемыйВидРемонта);
					
					ЗаполнитьЗначенияСвойств(НаборЗаписейОР.Добавить(),Выборка);
					
					НаборЗаписейОР.Записать(Истина);
					
				КонецЦикла;
			КонецЕсли;
			
		Исключение
			ТекстСообщения = НСтр("es='No consiguió anotar las reparaciones sustituidas: ';ru='Не удалось записать замещаемые ремонты: ';en='Failed to record replacement repairs: '") + ОписаниеОшибки();
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Возврат;
		КонецПопытки;
		
	КонецЕсли;
	
	МодифицированностьНормРемонтов = Ложь;
	МодифицированностьЗамещаемыхРемонтов = Ложь;
	МодифицированностьПредшествующихРемонтов = Ложь;
	
КонецПроцедуры

&НаКлиенте
Функция НайтиСвязанныеСтроки(ВидРемонта,ТиповойОР)
	
	СтруктураВозврата = Новый Структура("МассивУдаляемыхСтрокПредшествующиеРемонты, МассивУдаляемыхСтрокЗамещаемыеРемонты,
										|МассивУдаляемыхСтрокТабЗатратПоВидамРемонта,МассивУдаляемыхСтрокЗапланированныеРемонты,
										|МассивУдаляемыхСтрокРМ");
	СтруктураВозврата.МассивУдаляемыхСтрокПредшествующиеРемонты = Новый Массив;
	СтруктураВозврата.МассивУдаляемыхСтрокЗамещаемыеРемонты = Новый Массив;
	СтруктураВозврата.МассивУдаляемыхСтрокТабЗатратПоВидамРемонта = Новый Массив;
	СтруктураВозврата.МассивУдаляемыхСтрокЗапланированныеРемонты = Новый Массив;
	СтруктураВозврата.МассивУдаляемыхСтрокРМ = Новый Массив;
						
	МассивУдаляемыхСтрокПредшествующиеРемонты = ПредшествующиеРемонты.НайтиСтроки(Новый Структура("ВидРемонта, ТиповойОР", ВидРемонта, ТиповойОР));
	МассивУдаляемыхСтрокЗамещаемыеРемонты = ЗамещаемыеРемонты.НайтиСтроки(Новый Структура("ВидРемонта,ТиповойОР", ВидРемонта, ТиповойОР));
	
	КолНормРемонтов = НормативныеРемонты.НайтиСтроки(Новый Структура("ВидРемонта,Удален",ВидРемонта,Ложь)).Количество();
	Если КолНормРемонтов = 1 Тогда
		
		ЕщеУдаляемыеСтрокиПредшествующиеРемонты = ПредшествующиеРемонты.НайтиСтроки(Новый Структура("ПредшествующийВидРемонта, ТиповойОР", ВидРемонта, ПредопределенноеЗначение("Справочник.торо_ТиповыеОР.ПустаяСсылка")));
		
		Для каждого Эл Из ЕщеУдаляемыеСтрокиПредшествующиеРемонты Цикл
			Если МассивУдаляемыхСтрокПредшествующиеРемонты.Найти(Эл) = Неопределено Тогда
				МассивУдаляемыхСтрокПредшествующиеРемонты.Добавить(Эл);
			КонецЕсли;
		КонецЦикла;
		
		ЕщеУдаляемыеСтрокиЗамещаемыеРемонты = ЗамещаемыеРемонты.НайтиСтроки(Новый Структура("ЗамещаемыйВидРемонта, ТиповойОР", ВидРемонта, ПредопределенноеЗначение("Справочник.торо_ТиповыеОР.ПустаяСсылка")));
		
		Для каждого Эл Из ЕщеУдаляемыеСтрокиЗамещаемыеРемонты Цикл
			Если МассивУдаляемыхСтрокЗамещаемыеРемонты.Найти(Эл) = Неопределено Тогда
				МассивУдаляемыхСтрокЗамещаемыеРемонты.Добавить(Эл);
			КонецЕсли;
		КонецЦикла;
		
		СтруктураВозврата.МассивУдаляемыхСтрокТабЗатратПоВидамРемонта = ТабЗатратПоВидамРемонта.НайтиСтроки(Новый Структура("ВидРемонта", ВидРемонта));
		СтруктураВозврата.МассивУдаляемыхСтрокЗапланированныеРемонты = ЗапланированныеРемонты.НайтиСтроки(Новый Структура("ВидРемонтныхРабот", ВидРемонта));
	КонецЕсли;
	
	СтруктураВозврата.МассивУдаляемыхСтрокПредшествующиеРемонты = МассивУдаляемыхСтрокПредшествующиеРемонты;
	СтруктураВозврата.МассивУдаляемыхСтрокЗамещаемыеРемонты = МассивУдаляемыхСтрокЗамещаемыеРемонты;
	
	Если НЕ ТаблицаОценокРММодифицированность Тогда
		МассивВозврата = ПрочитатьОценкиРМ(Объект.Ссылка, Объект.ТиповойОР);
		
		РСНЗТаблицаОценокРМ.Очистить();
		
		Для каждого Элем Из МассивВозврата Цикл
			
			НС = РСНЗТаблицаОценокРМ.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Элем);
			
		КонецЦикла;
		
		ОбновитьОценкиРМ(Элементы.ТаблицаОценокРМОтображатьИсторию.Пометка);
	КонецЕсли;
	СтруктураВозврата.МассивУдаляемыхСтрокРМ = РСНЗТаблицаОценокРМ.НайтиСтроки(Новый Структура("ВидРемонта", ВидРемонта));
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаКлиенте
Процедура НормативныеРемонтыПередУдалениемЗавершение(Результат,ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Для каждого Элем Из ДополнительныеПараметры.МассивУдаляемыхСтрокПредшествующиеРемонты Цикл
			ПредшествующиеРемонты.Удалить(Элем);
			МодифицированностьПредшествующихРемонтов = Истина;
		КонецЦикла;
		
		Для каждого Элем Из ДополнительныеПараметры.МассивУдаляемыхСтрокЗамещаемыеРемонты Цикл
			ЗамещаемыеРемонты.Удалить(Элем);
			МодифицированностьЗамещаемыхРемонтов = Истина;
		КонецЦикла;
		
		Для каждого Элем Из ДополнительныеПараметры.МассивУдаляемыхСтрокТабЗатратПоВидамРемонта Цикл
			ТабЗатратПоВидамРемонта.Удалить(Элем);
			МодифицированностьНормативныхЗатратПоЗапчастям = Истина;
			МодифицированностьЗапчастейОР = Истина;
		КонецЦикла;
		
		Для каждого Элем Из ДополнительныеПараметры.МассивУдаляемыхСтрокЗапланированныеРемонты Цикл
			ЗапланированныеРемонты.Удалить(Элем);
		КонецЦикла;
		
		УдалитьОсновноеЗависимоеОборудованиеПоВидуРемонта(ДополнительныеПараметры.ТекДанные.ВидРемонта);
			
		Для каждого Элем Из ДополнительныеПараметры.МассивУдаляемыхСтрокРМ Цикл
			РСНЗТаблицаОценокРМ.Удалить(Элем);
			НайденныеСтроки = ТаблицаОценокРМ.НайтиСтроки(Новый Структура("ВидРемонта, Сезон, Период", Элем.ВидРемонта, Элем.Сезон, Элем.Период));
			Для каждого Строка Из НайденныеСтроки Цикл
				ТаблицаОценокРМ.Удалить(Строка);
			КонецЦикла; 
			ТаблицаОценокРММодифицированность = Истина;
		КонецЦикла;	
				
		Если ЗначениеЗаполнено(ДополнительныеПараметры.ТекДанные.ТиповойОР) Тогда
			ДополнительныеПараметры.ТекДанные.Удален = Истина;
			УстановитьОтборНеИспользуемыхСтрок(Элементы.НормативныеРемонтыПоказыватьУдаленныеНормативы.Пометка,"НормативныеРемонты");
		Иначе
			Если ЗначениеЗаполнено(Объект.ТиповойОР) Тогда
				СовпадающиеРемонты = НормативныеРемонты.НайтиСтроки(Новый Структура("ТиповойОР, ВидРемонта", Объект.ТиповойОР, ДополнительныеПараметры.ТекДанные.ВидРемонта));
				Если СовпадающиеРемонты.Количество() > 0 Тогда 
					СовпадающиеРемонты[0].Удален = Ложь;
				КонецЕсли;
			КонецЕсли;
			НормативныеРемонты.Удалить(ДополнительныеПараметры.ТекДанные);
		КонецЕсли;
		
		МодифицированностьНормРемонтов = Истина;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РемонтныеЦиклы

&НаСервереБезКонтекста
Функция ЗаполнитьПоследовательностьРемонтовНаСервере(Цепочка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_ЦепочкиРемонтаПоследовательностьРемонтов.Ссылка,
	|	торо_ЦепочкиРемонтаПоследовательностьРемонтов.НомерСтроки,
	|	торо_ЦепочкиРемонтаПоследовательностьРемонтов.ВидРемонта,
	|	торо_ЦепочкиРемонтаПоследовательностьРемонтов.НормативныйРемонт,
	|	торо_ЦепочкиРемонтаПоследовательностьРемонтов.СпособПланирования,
	|	торо_ЦепочкиРемонтаПоследовательностьРемонтов.ГрафикРемонтныхРабот,
	|	торо_ЦепочкиРемонтаПоследовательностьРемонтов.СпособВыполнения,
	|	торо_ЦепочкиРемонтаПоследовательностьРемонтов.РазрешитьСокращатьМежремонтныйПериодПриПланировании,
	|	торо_ЦепочкиРемонтаПоследовательностьРемонтов.НеУчитыватьПриПланированииГрафикРаботыОборудования,
	|	торо_ЦепочкиРемонтаПоследовательностьРемонтов.НеУчитыватьПриПланированииГрафикРемонтныхРабот,
	|	торо_ЦепочкиРемонтаПоследовательностьРемонтов.НеУчитыватьПродолжительность
	|ИЗ
	|	Справочник.торо_ЦепочкиРемонта.ПоследовательностьРемонтов КАК торо_ЦепочкиРемонтаПоследовательностьРемонтов
	|ГДЕ
	|	торо_ЦепочкиРемонтаПоследовательностьРемонтов.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Цепочка);
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	МассивРемонтов = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Структ = Новый Структура("НомерСтроки, ВидРемонта, НормативныйРемонт, СпособПланирования, ГрафикРемонтныхРабот, СпособВыполнения, 
		|РазрешитьСокращатьМежремонтныйПериодПриПланировании, НеУчитыватьПриПланированииГрафикРаботыОборудования, НеУчитыватьПриПланированииГрафикРемонтныхРабот, НеУчитыватьПродолжительность");
		
		ЗаполнитьЗначенияСвойств(Структ, Выборка);
		
		МассивРемонтов.Добавить(Структ);
		
	КонецЦикла;
	
	Возврат МассивРемонтов;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОбновитьФиксированныеРемонтныеЦиклы(ОбъектРемонта, ТиповойОР, ТолькоОР = Истина, ТолькоТиповыеОР = Истина)
	
	МассивЦепочек = Новый Массив;
	
	СписокОтбора = Новый СписокЗначений;
	Если ТолькоОР И ЗначениеЗаполнено(ОбъектРемонта) Тогда 
		СписокОтбора.Добавить(ОбъектРемонта);
	КонецЕсли;
	Если ТолькоТиповыеОР И ЗначениеЗаполнено(ТиповойОР) Тогда
		СписокОтбора.Добавить(ТиповойОР);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_РемонтныеЦиклыОборудования.ВидЦепочки,
	|	торо_РемонтныеЦиклыОборудования.ГруппаОбъектовРемонтов,
	|	торо_РемонтныеЦиклыОборудования.НеУчитыватьПростоиОборудования
	|ИЗ
	|	РегистрСведений.торо_РемонтныеЦиклыОборудования КАК торо_РемонтныеЦиклыОборудования
	|ГДЕ
	|	торо_РемонтныеЦиклыОборудования.ГруппаОбъектовРемонтов В(&СписокОтбора)";
	
	Запрос.УстановитьПараметр("СписокОтбора", СписокОтбора);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	МассивЦепочек = Новый Массив;
	Пока Выборка.Следующий() Цикл
		
		Структ = Новый Структура("ВидЦепочки, ГруппаОбъектовРемонтов, НеУчитыватьПростоиОборудования, ТиповойОР");
		ЗаполнитьЗначенияСвойств(Структ, Выборка);
		Структ.ТиповойОР = ?(ТипЗнч(Выборка.ГруппаОбъектовРемонтов) = Тип("СправочникСсылка.торо_ТиповыеОР"), Истина, Ложь);
		МассивЦепочек.Добавить(Структ);
		
	КонецЦикла;
	
	Возврат МассивЦепочек;
	
КонецФункции

&НаСервере
Процедура ЗаписатьРемонтныеЦиклы(ТекОбъект, Отказ)
	
	// Цепочки
	Если МодифицированностьРемЦиклов Тогда 
		
		Для каждого Строка из ТабличноеПолеРемонтныеЦиклыОборудования Цикл
			Если НЕ ЗначениеЗаполнено(Строка.ГруппаОбъектовРемонтов) Тогда
				Строка.ГруппаОбъектовРемонтов = ТекОбъект;
			КонецЕсли;
		КонецЦикла;
		
		Попытка
			
			ТаблицаЗначенийРемонтныеЦиклыОборудования = ТабличноеПолеРемонтныеЦиклыОборудования.Выгрузить();
			МассивСтрокЦиклов = ТаблицаЗначенийРемонтныеЦиклыОборудования.НайтиСтроки(Новый Структура("ГруппаОбъектовРемонтов", ТекОбъект));
			ТаблицаБуфер = ТаблицаЗначенийРемонтныеЦиклыОборудования.Скопировать(МассивСтрокЦиклов);
			
			НаборРемонтныхЦикловОборудования = РегистрыСведений.торо_РемонтныеЦиклыОборудования.СоздатьНаборЗаписей();
			НаборРемонтныхЦикловОборудования.Отбор.ГруппаОбъектовРемонтов.Установить(ТекОбъект);
			НаборРемонтныхЦикловОборудования.Загрузить(ТаблицаБуфер);
			НаборРемонтныхЦикловОборудования.Записать();
			
			МодифицированностьРемЦиклов = Ложь;
			
		Исключение
			ТекстСообщения = НСтр("es='No consiguió anotar los ciclos fijados de reparación: ';ru='Не удалось записать фиксированные ремонтные циклы: ';en='Failed to record fixed repair cycles: '") + ОписаниеОшибки();
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецПопытки;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура НаложитьОтборНаРемЦиклы(ТолькоОР, ТолькоТиповыеОР)
	
	Если ТолькоОР и ТолькоТиповыеОР Тогда
		
		ТабличноеПолеРемонтныеЦиклыОборудования.Загрузить(РемЦиклыОборудования.Выгрузить());
		
	ИначеЕсли ТолькоОР Тогда
		
		ТабличноеПолеРемонтныеЦиклыОборудования.Загрузить(РемЦиклыОборудования.Выгрузить(Новый Структура("ТиповойОР", Ложь)));
		
	ИначеЕсли ТолькоТиповыеОР Тогда
		
		ТабличноеПолеРемонтныеЦиклыОборудования.Загрузить(РемЦиклыОборудования.Выгрузить(Новый Структура("ТиповойОР", Истина)));
		
	Иначе
		
		ТабличноеПолеРемонтныеЦиклыОборудования.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьПересеченияНаСервере(ТекЦепочка)
	
	СтандартнаяОбработка = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_ЦепочкиРемонтаПоследовательностьРемонтов.ВидРемонта,
	|	торо_ЦепочкиРемонтаПоследовательностьРемонтов.Ссылка
	|ПОМЕСТИТЬ Ремонты
	|ИЗ
	|	Справочник.торо_ЦепочкиРемонта.ПоследовательностьРемонтов КАК торо_ЦепочкиРемонтаПоследовательностьРемонтов
	|ГДЕ
	|	торо_ЦепочкиРемонтаПоследовательностьРемонтов.Ссылка В(&МассивСсылок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_ЦепочкиРемонтаПоследовательностьРемонтов.ВидРемонта,
	|торо_ЦепочкиРемонтаПоследовательностьРемонтов.Ссылка
	|ПОМЕСТИТЬ РемонтыНовые
	|ИЗ
	|	Справочник.торо_ЦепочкиРемонта.ПоследовательностьРемонтов КАК торо_ЦепочкиРемонтаПоследовательностьРемонтов
	|ГДЕ
	|	торо_ЦепочкиРемонтаПоследовательностьРемонтов.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ремонты.ВидРемонта КАК ВидРемонтаСтарый,
	|	РемонтыНовые.ВидРемонта КАК ВидРемонтаНовый,
	|	Ремонты.Ссылка
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РемонтыНовые КАК РемонтыНовые
	|		ПО Ремонты.ВидРемонта = РемонтыНовые.ВидРемонта";
	
	Запрос.УстановитьПараметр("Ссылка", ТекЦепочка);
	
	МассивЦепочек = ТабличноеПолеРемонтныеЦиклыОборудования.Выгрузить().ВыгрузитьКолонку("ВидЦепочки");
	ИндексТекЦепочки = МассивЦепочек.Найти(ТекЦепочка);
	Если ИндексТекЦепочки <> Неопределено Тогда
		МассивЦепочек.Удалить(ИндексТекЦепочки);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивЦепочек);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	флДобавлятьЦепочку = Истина;
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка <> ТекЦепочка Тогда
			флДобавлятьЦепочку = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ флДобавлятьЦепочку Тогда
		СтандартнаяОбработка = Ложь;
		ШаблонСообщения = НСтр("es='La cadenita ""%1"" no es posible añadir en la lista de los ciclos fijados de reparación, puesto que contiene los tipos de las reparaciones que entran en otras cadenitas escogidas.';ru='Цепочку ""%1"" нельзя добавить в список фиксированных ремонтных циклов, так как она содержит виды ремонтов, входящие в другие выбранные цепочки.';en='The chain ""%1"" cannot be added to the list of fixed repair cycles, since it contains the types of repairs included in other selected chains'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекЦепочка);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	МассивРемонтов = НормативныеРемонты.Выгрузить().ВыгрузитьКолонку("ВидРемонта");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_ЦепочкиРемонтаПоследовательностьРемонтов.ВидРемонта,
	|	торо_ЦепочкиРемонтаПоследовательностьРемонтов.Ссылка
	|ИЗ
	|	Справочник.торо_ЦепочкиРемонта.ПоследовательностьРемонтов КАК торо_ЦепочкиРемонтаПоследовательностьРемонтов
	|ГДЕ
	|   торо_ЦепочкиРемонтаПоследовательностьРемонтов.ВидРемонта В (&МассивРемонтов)
	|	И торо_ЦепочкиРемонтаПоследовательностьРемонтов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("МассивРемонтов", МассивРемонтов);
	Запрос.УстановитьПараметр("Ссылка", ТекЦепочка);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтандартнаяОбработка = Ложь;
		ШаблонСообщения = НСтр("es='¡El tipo de la reparación ""%1"" es escogido de la cadenita ""%2"" ya en calidad de la reparación normativa!';ru='Вид ремонта ""%1"" из цепочки ""%2"" уже выбран в качестве нормативного ремонта!';en='Repair type ""% 1"" from the chain ""% 2"" is already selected as a standard repair!'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, Выборка.ВидРемонта, Выборка.Ссылка);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЦикла;
	
	Возврат СтандартнаяОбработка;
	
КонецФункции

&НаСервере
Процедура СортироватьПоВозрастаниюНаСервере()
	
	ТаблЦиклов = ТабличноеПолеРемонтныеЦиклыОборудования.Выгрузить();
	ТаблЦиклов.Сортировать("ВидЦепочки Возр");
	ТабличноеПолеРемонтныеЦиклыОборудования.Загрузить(ТаблЦиклов);
	
КонецПроцедуры

&НаСервере
Процедура СортироватьПоУбываниюНаСервере()
	
	ТаблЦиклов = ТабличноеПолеРемонтныеЦиклыОборудования.Выгрузить();
	ТаблЦиклов.Сортировать("ВидЦепочки Убыв");
	ТабличноеПолеРемонтныеЦиклыОборудования.Загрузить(ТаблЦиклов);
	
КонецПроцедуры

#КонецОбласти

#Область СтруктураРемонтногоЦикла

#Область ПостроениеСхемы

&НаКлиенте
Процедура НарисоватьМнемосхему(ОбщаяПродолжительность)
	
	торо_РаботаСМнемосхемами.мнс_СоздатьЧистуюКарту(ПолеМнемосхемы);
	Элементы.ПолеМнемосхемы.ТекущийЭлемент = Неопределено;
	
	КолСтрокСхемы = 0;
	
	Если Элементы.ПолеТД.Ширина < 20 Тогда
		ПоказатьПредупреждение(, НСтр("es='La dimensión de la ventana es demasiado pequeña. ¡Es imposible sacar la tabla!';ru='Размер окна слишком мал. Невозможно вывести таблицу!';en='Tab size is too small. Unable to display table!'"));
		Возврат;
	КонецЕсли;
	
	Если ТаблицаРемонтовВизуализация.Количество() > 0 Тогда
		
		КоличествоРемонтов = Новый Соответствие;
		Для каждого Стр Из ТаблицаРемонтовВизуализация Цикл
		
			ЗначениеКлюча = КоличествоРемонтов.Получить(Стр.ВидРемонтныхРабот);
			Если ЗначениеКлюча = Неопределено Тогда
				КоличествоРемонтов.Вставить(Стр.ВидРемонтныхРабот, 1);
			Иначе
				КоличествоРемонтов.Вставить(Стр.ВидРемонтныхРабот, ЗначениеКлюча + 1);
			КонецЕсли;
		
		КонецЦикла; 
		
		ПоследняяСтрокаРемонта = ТаблицаРемонтовВизуализация[ТаблицаРемонтовВизуализация.Количество() - 1];
		РазностьДат = (ПоследняяСтрокаРемонта.ДатаНач - ПоследняяСтрокаРемонта.ДатаПредшествующегоТогожеВида) / 86400;
		// >> [Деснол] [Ушаков А.Д.] [26.09.2019] 
		Надпись1 = НСтр("es='Total:';ru='Всего:';en='Total:'");
		//Надпись1 = "Всего:";
		// << [Деснол] [Ушаков А.Д.] [26.09.2019] 
		Для каждого Стр Из КоличествоРемонтов Цикл
			// >> [Деснол] [Ушаков А.Д.] [26.09.2019] 
			Надпись1 = Надпись1 + Символы.ПС + Стр.Ключ + ": " + Стр.Значение + НСтр("es='pcs';ru=' шт.';en=' pieces'");
			// << [Деснол] [Ушаков А.Д.] [26.09.2019] 
		КонецЦикла;
		
		// >> [Деснол] [Ушаков А.Д.] [26.09.2019] 
		Надпись1 = Надпись1 + Символы.ПС + НСтр("es='Días calendario:';ru='Календарных дней:';en='calendar day'") + ?(РазностьДат > 0,РазностьДат - 1, 0) + Символы.ПС +
		НСтр("es='Días laborables: ';ru='Рабочих дней: ';en='Working day:'") + ПоследняяСтрокаРемонта.ДниОтПредшествующего;
		// << [Деснол] [Ушаков А.Д.] [26.09.2019] 
		
		МассивКолонокНаработки = КолонкиНаработки.НайтиСтроки(Новый Структура("ПредшествующийТогоЖеВида", Истина));
		
		Для Каждого КолонкаНаработки из МассивКолонокНаработки Цикл
			ИмяКолонки = КолонкаНаработки.ИмяКолонки;	
			
			СтрокиНаработки = ЗначенияНаработки.НайтиСтроки(Новый Структура("ID, ВидРемонтныхРабот, Показатель", ПоследняяСтрокаРемонта.ID, ПоследняяСтрокаРемонта.ВидРемонтныхРабот, ИмяКолонки));
			
			Если СтрокиНаработки.Количество() Тогда
				СтрНар = СтрокиНаработки[0];
				
				Надпись1 = Надпись1 + "
				|" + КолонкаНаработки.Показатель + ": " + СтрНар.Значение;
			КонецЕсли;
		КонецЦикла;
		Декорация1 = Надпись1;
	КонецЕсли;
	
	Если ТаблицаРемонтовВизуализация.Количество() > 100 Тогда
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("НарисоватьМнемосхемуЗавершение", ЭтотОбъект), НСтр("es='La conclusión del esquema del ciclo de reparación puede ocupar el largo tiempo. ¿Sacar el esquema?';ru='Вывод схемы ремонтного цикла может занять продолжительное время. Вывести схему?';en='The conclusion of the repair cycle scheme may take a long time. Print the circuit?'"), РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	НарисоватьМнемосхемуЗавершение(Неопределено, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура НарисоватьМнемосхемуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
#Если Не МобильноеПриложениеКлиент Тогда
	Ответ = РезультатВопроса;
	
    Флаг                    = Ложь;
    ИндексЭлемента          = Неопределено;
    НачалоСтроки            = Неопределено;
    КонецСтроки             = Неопределено;
    НаправлениеЭлемента     = "Вправо";
    СоединятьЛинией         = Истина;
    ШиринаПоля              = Элементы.ПолеМнемосхемы.Ширина * 10 - 150;
    
    ИндексСтроки            = 8 + КолонкиНаработки.Количество() + 1;
    флВсеНарисовано         = Ложь;
    СдвигСтрокПоляТД        = 0;
    КоличествоРемонтов      = ТаблицаРемонтовВизуализация.Количество(); // - 1;
    ШиринаПоляТД            = Элементы.ПолеТД.Ширина * 15 - 150;
    КоличествоКолонокПоляТД = Цел((ШиринаПоляТД - 50) / 50) - 1;
    ЭтоПерваяЧастьТаблицы   = Истина;
	 
	 МаксЭлементовДляВебКлиента = 10;
	 
	Если КоличествоРемонтов + 1 > 16 Тогда
		КолвоКолонокМнемосхемы = 16;
	Иначе
		КолвоКолонокМнемосхемы = КоличествоРемонтов+1;
	КонецЕсли;
	
	
	Пока НЕ флВсеНарисовано Цикл
		
		Если КоличествоКолонокПоляТД = 1 Тогда
			Прервать;
		КонецЕсли;
		
		Если КоличествоРемонтов + 1 > КоличествоКолонокПоляТД Тогда
            ЧертитьКолонок     = КоличествоКолонокПоляТД;
            КоличествоРемонтов = КоличествоРемонтов - КоличествоКолонокПоляТД + 1;
		Иначе 
            ЧертитьКолонок  = КоличествоРемонтов + 1;
            флВсеНарисовано = Истина;
		КонецЕсли;
		
		ОбластьВывода = ПолеТД.Область(3 + СдвигСтрокПоляТД,2,6 + ИндексСтроки - 7 + СдвигСтрокПоляТД,ЧертитьКолонок + 1);
        ОбластьВывода.ГраницаСверху           = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
        ОбластьВывода.ГраницаСлева            = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
        ОбластьВывода.ГраницаСнизу            = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
        ОбластьВывода.ГраницаСправа           = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
        ОбластьВывода.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		
		ОбластьВывода = ПолеТД.Область(3 + СдвигСтрокПоляТД,3,6 + ИндексСтроки - 7 + СдвигСтрокПоляТД,ЧертитьКолонок + 1);
		ОбластьВывода.ШиринаКолонки = 8;
		
		
		ОбластьВывода = ПолеТД.Область(3 + СдвигСтрокПоляТД,2,6 + ИндексСтроки - 7 + СдвигСтрокПоляТД);
        ОбластьВывода.ШиринаКолонки           = 20;
        ОбластьВывода.РазмещениеТекста        = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
        ОбластьВывода.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
		Если НЕ ЭтоПерваяЧастьТаблицы Тогда
            ОбластьВывода       = ПолеТД.Область(3 + СдвигСтрокПоляТД - 1, 2);
			// >> [Деснол] [Ушаков А.Д.] [26.09.2019] 
			ОбластьВывода.Текст = НСтр("es='Continuación';ru='Продолжение';en='continuation'");
			//ОбластьВывода.Текст = "Продолжение";
			// << [Деснол] [Ушаков А.Д.] [26.09.2019] 
		КонецЕсли;
		ЭтоПерваяЧастьТаблицы = Ложь;
        ОбластьВывода       = ПолеТД.Область(3 + СдвигСтрокПоляТД, 2);
 		// >> [Деснол] [Ушаков А.Д.] [26.09.2019] 
        ОбластьВывода.Текст = НСтр("es='Tipo de reparación';ru='Вид ремонта';en='Type of repair'"); 
        ОбластьВывода       = ПолеТД.Область(4 + СдвигСтрокПоляТД, 2);
        ОбластьВывода.Текст = НСтр("es='Duración (h)';ru='Продолжительность (ч)';en='Duration (h)'"); 
        ОбластьВывода       = ПолеТД.Область(5 + СдвигСтрокПоляТД, 2);
        ОбластьВывода.Текст = НСтр("es='Tech. días laborables (del anterior)';ru='Тек. рабочие дни (от предшествующего)';en='Flowed. working days (from previous)'");
        ОбластьВывода       = ПолеТД.Область(6 + СдвигСтрокПоляТД, 2);
        ОбластьВывода.Текст = НСтр("es='Tech. días calendario (del anterior)';ru='Тек. календарные дни (от предшествующего)';en='Flowed. calendar days (from previous)'");
        ОбластьВывода       = ПолеТД.Область(7 + СдвигСтрокПоляТД, 2);
        ОбластьВывода.Текст = НСтр("es='Horario de apertura (del anterior del mismo tipo)';ru='Время работы (от предшествующего того же вида)';en='Operating time (from the previous of the same kind)'");
		// << [Деснол] [Ушаков А.Д.] [26.09.2019] 
		
		ДопИндекс = 0;
		Для Каждого КолонкаНаработки из КолонкиНаработки Цикл
			
			ОбластьВывода = ПолеТД.Область(8 + ДопИндекс + СдвигСтрокПоляТД, 2);
			// >> [Деснол] [Ушаков А.Д.] [26.09.2019] 
			ОбластьВывода.Текст = ПолучитьНаименованиеПоказателя(КолонкаНаработки.Показатель) + " (" + ?(КолонкаНаработки.ПредшествующийТогоЖеВида, 
																										НСтр("es='de un anterior del mismo tipo';ru='от предшествующего того же вида';en='from the preceding of the same species'"), 
																										НСтр("es='de anteriores';ru='от предшествующего';en='from the previous'")) + ")"; 	 
			// << [Деснол] [Ушаков А.Д.] [26.09.2019] 
			ДопИндекс = ДопИндекс + 1;
		КонецЦикла;
		
		ОбластьВывода = ПолеТД.Область(8 + ДопИндекс + СдвигСтрокПоляТД, 2);
		// >> [Деснол] [Ушаков А.Д.] [26.09.2019] 
		ОбластьВывода.Текст = НСтр("es='Se calcula sobre un tiempo de funcionamiento.';ru='Рассчитан по наработке';en='Calculated by the operating time'");
		//ОбластьВывода.Текст = "Рассчитан по наработке";
		// << [Деснол] [Ушаков А.Д.] [26.09.2019] 
		
		СдвигСтрокПоляТД = СдвигСтрокПоляТД + ИндексСтроки - 1;
		
		
	КонецЦикла;
	
	СдвигСтрокПоляТД = 0;
	Номер = 1;
	
	
	
	Если ТаблицаРемонтовВизуализация.Количество() > 0 Тогда
		ДатаНачПервого = ТаблицаРемонтовВизуализация[0].ДатаНач;
	КонецЕсли;
	Для Каждого СтрокаРемонта Из ТаблицаРемонтовВизуализация Цикл
		Если Не ЗначениеЗаполнено(СтрокаРемонта.ВидРемонтныхРабот) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Ответ = КодВозвратаДиалога.Да ИЛИ Ответ = Неопределено Тогда
			
			Если Нормировать Тогда
				Шаг = Окр((СтрокаРемонта.ДатаНач - СтрокаРемонта.ДатаПредшествующего) / ОбщаяПродолжительность * 40 / МинШаг);
				Если Шаг = 0 Тогда
					Шаг = 1;
				КонецЕсли;
			Иначе
				Шаг = 40;
			КонецЕсли;
			
			#Если ВебКлиент Тогда
				ДошлиДоКраяЭкрана = (Номер = МаксЭлементовДляВебКлиента+?(СдвигСтрокПоляТД>0, 0, 1));
			#Иначе
				ДошлиДоКраяЭкрана = Не (Элементы.ПолеМнемосхемы.ТекущийЭлемент = Неопределено) И (Элементы.ПолеМнемосхемы.ТекущийЭлемент.Лево + Шаг > ШиринаПоля);
			#КонецЕсли

			Если Не (Элементы.ПолеМнемосхемы.ТекущийЭлемент = Неопределено) И ДошлиДоКраяЭкрана Тогда
				КонецСтроки = Элементы.ПолеМнемосхемы.ТекущийЭлемент;
				Элементы.ПолеМнемосхемы.ТекущийЭлемент = НачалоСтроки;
				НаправлениеЭлемента = "Вниз";
				Шаг = 40;
				СоединятьЛинией = Ложь;
			КонецЕсли;
			
			НайденныеСтроки = СоответсвиеЦветов.НайтиСтроки(Новый Структура("ВидРемонтныхРабот", СтрокаРемонта.ВидРемонтныхРабот));
			Если НайденныеСтроки.Количество() > 0 Тогда
				СтрокаВидРемонта =  НайденныеСтроки[0];
                ЦветВР     = СтрокаВидРемонта.Цвет;
                ЦветТекста = СтрокаВидРемонта.ЦветТекста;
                Шрифт      = СтрокаВидРемонта.Шрифт; 
			Иначе
				ЦветВР     = Новый Цвет(255,255,255);
                ЦветТекста = Новый Цвет(0,0,0);
                Шрифт      = Новый Шрифт(); 
			КонецЕсли; 

			СтруктураДопСвойств = Новый Структура("Наименование, Фигура, ЦветВР,ЦветТекста,Шрифт, Подсказка");
			СтруктураДопСвойств.Наименование = ПолучитьКодДляВР(СтрокаРемонта.ВидРемонтныхРабот);
			СтруктураДопСвойств.Фигура = ФигурыГрафическойСхемы.Блок;
			СтруктураДопСвойств.ЦветВР = ЦветВР;
			СтруктураДопСвойств.ЦветТекста = ЦветТекста;
			СтруктураДопСвойств.Шрифт = Шрифт;
			СтруктураДопСвойств.Подсказка =  "Дата начала: "+Строка(СтрокаРемонта.ДатаНач);
						
			ДобавитьЭлемент(Новый Картинка,ИндексЭлемента,НаправлениеЭлемента, СоединятьЛинией,Шаг, СтруктураДопСвойств);
			
			Если Элементы.ПолеМнемосхемы.ТекущийЭлемент = Неопределено Тогда
				ТекстСообщения = НСтр("es='¡No consiguió construir el mnemoesquema!';ru='Построить мнемосхему не удалось!';en='Build a mimic failed!'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
				Прервать;
			КонецЕсли;
			
			НС = СоответствиеИндексаИНомераКолонки.Добавить();
			НС.ТекЭлементИмя = Элементы.ПолеМнемосхемы.ТекущийЭлемент.Имя;
			НС.НомерКолонки = Номер + 2;
			НС.СдвигСтрок = СдвигСтрокПоляТД;
			
			Если (НачалоСтроки = Неопределено Или НаправлениеЭлемента = "Вниз") Тогда
				
				Если НаправлениеЭлемента = "Вниз" Тогда 
					ТекЭлемент = ИндексЭлемента;
					
					НачалоСтроки = Элементы.ПолеМнемосхемы.ТекущийЭлемент;
					
					СтруктураЭлем = Новый Структура("КонецСтроки,ТекЭлемент",КонецСтроки,Элементы.ПолеМнемосхемы.ТекущийЭлемент);
					торо_РаботаСМнемосхемами.мнс_СоздатьЛинию(КонецСтроки.Имя,Элементы.ПолеМнемосхемы.ТекущийЭлемент.Имя, ПолеМнемосхемы);
					
					ОбновитьОтображениеДанных();
					
					КолСтрокСхемы = КолСтрокСхемы + 1;
					
				Иначе
					ДатаПервого = СтрокаРемонта.ДатаНач;
					НачалоСтроки = Элементы.ПолеМнемосхемы.ТекущийЭлемент;
				КонецЕсли;
				
				СоединятьЛинией = Истина;
				НаправлениеЭлемента = "Вправо";
			КонецЕсли;	
			
		КонецЕсли;
		
		Флаг = Истина;
		ДатаПоследнего = СтрокаРемонта.ДатаКон;

		ОбластьВывода = ПолеТД.Область(3 + СдвигСтрокПоляТД,Номер + 2);
		ОбластьВывода.Текст = ПолучитьКодДляВР(СтрокаРемонта.ВидРемонтныхРабот);
		
		ОбластьВывода2 = ПолеТД.Область(4 + СдвигСтрокПоляТД,Номер + 2);
		Продолжительность = Формат((СтрокаРемонта.Продолжительность) / 3600,"ЧДЦ=1"); 
		ОбластьВывода2.Текст = ?(СтрокаРемонта.НеУчитыватьПродолжительность,"(","") + Продолжительность + ?(СтрокаРемонта.НеУчитыватьПродолжительность,")","");   // продолжительность (часов)
		
		ОбластьВывода2 = ПолеТД.Область(5 + СдвигСтрокПоляТД,Номер + 2);
		ОбластьВывода2.Текст = СтрокаРемонта.Дни; 	// рабочих дней от предыдущего 
		
		ОбластьВывода2 = ПолеТД.Область(6 + СдвигСтрокПоляТД,Номер + 2);
		РазностьДат = (СтрокаРемонта.ДатаНач - СтрокаРемонта.ДатаПредшествующего) / 86400;
		ОбластьВывода2.Текст = ?(РазностьДат > 0,РазностьДат - 1, 0); 	// календарных дней от предыдущего
		
		ОбластьВывода2 = ПолеТД.Область(7 + СдвигСтрокПоляТД, Номер + 2);
		ОбластьВывода2.Текст = СтрокаРемонта.ДниОтПредшествующего;
		
		ДопИндекс = 0;
		Для Каждого КолонкаНаработки из КолонкиНаработки Цикл
			ИмяКолонки = КолонкаНаработки.ИмяКолонки;	
			
			СтрокиНаработки = ЗначенияНаработки.НайтиСтроки(Новый Структура("ID, ВидРемонтныхРабот, Показатель", СтрокаРемонта.ID, СтрокаРемонта.ВидРемонтныхРабот, ИмяКолонки));
			
			Если СтрокиНаработки.Количество() Тогда
				СтрНар = СтрокиНаработки[0];
				
				ОбластьВывода2 = ПолеТД.Область(8 + ДопИндекс + СдвигСтрокПоляТД,Номер + 2);
				ОбластьВывода2.Текст = СтрНар.Значение;
							
				// очередная наработка 
				ДопИндекс = ДопИндекс + 1;
			КонецЕсли;
		КонецЦикла;
		
		ОбластьВывода2 = ПолеТД.Область(8 + ДопИндекс + СдвигСтрокПоляТД, Номер + 2);
		ОбластьВывода2.Текст = ?(СтрокаРемонта.РассчитанПоПериодичности = Ложь, "v", "");
		
		Номер = Номер + 1;
		
		Если Не (Элементы.ПолеТД.ТекущаяОбласть = Неопределено) И (ОбластьВывода2.Лево + 2)*50 > ШиринаПоляТД Тогда 
			СдвигСтрокПоляТД = СдвигСтрокПоляТД + ИндексСтроки - 1;
			Номер = 1;
		КонецЕсли;
		
	КонецЦикла;
	
	МожноПечататьВизуализацию = Истина;
#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЭлемент(Картинка=Неопределено,ИндексЭлемента, НаправлениеЭлемента, СоединятьЛинией, Шаг = 40, СтруктураДопСвойств)
	
	Шаг = ?(Шаг = 0,1,Шаг);
	
	ТекЭлемент = Элементы.ПолеМнемосхемы.ТекущийЭлемент;
	
	Если ТекЭлемент <> Неопределено И ТекЭлемент.Имя = "Фоновый объект" Тогда
		ТекЭлемент = Неопределено;
	КонецЕсли;
	
	Если ТекЭлемент <> Неопределено И ТипЗнч(ТекЭлемент) <> Тип("ЭлементГрафическойСхемыДекорация") Тогда
		ТекЭлемент = Неопределено;
	КонецЕсли;
	
	Если ТекЭлемент = Неопределено Тогда
		
		Если ПолеМнемосхемы.ЭлементыГрафическойСхемы.Количество() = 0 Тогда
			
			торо_РаботаСМнемосхемами.мнс_СоздатьНовуюКарту(ПолеМнемосхемы,Картинка, СтруктураДопСвойств);
			
			ОбновитьОтображениеДанных();
			
			Элементы.ПолеМнемосхемы.ТекущийЭлемент = ПолеМнемосхемы.ЭлементыГрафическойСхемы[0];
			
			ИндексЭлемента = 0;
			
			Возврат;
			
		Иначе
			
			Инд = ПолеМнемосхемы.ЭлементыГрафическойСхемы.Количество();
			
			Пока Инд > 0 Цикл
				Если ТипЗнч(ПолеМнемосхемы.ЭлементыГрафическойСхемы[Инд-1]) = Тип("ЭлементГрафическойСхемыДекорация") 
					И ПолеМнемосхемы.ЭлементыГрафическойСхемы[Инд-1].Имя <> "Фоновый объект" Тогда
					ТекЭлемент = ПолеМнемосхемы.ЭлементыГрафическойСхемы[Инд-1];
					Прервать;
				Иначе
					Инд = Инд - 1;
				КонецЕсли;
			КонецЦикла;
			
			НомерДобавленногоЭлемента = неопределено;
			
			Если ТекЭлемент = Неопределено Тогда
				торо_РаботаСМнемосхемами.мнс_СоздатьПервыйЭлемент(ПолеМнемосхемы,Картинка, СтруктураДопСвойств);
				НомерДобавленногоЭлемента = ПолеМнемосхемы.ЭлементыГрафическойСхемы.Количество();
			Иначе
				торо_РаботаСМнемосхемами.мнс_СоздатьУзел(ТекЭлемент.Имя, ПолеМнемосхемы, НаправлениеЭлемента, СоединятьЛинией, ТолщинаСоединительнойЛинии, Шаг,Картинка,НомерДобавленногоЭлемента, СтруктураДопСвойств);
			КонецЕсли;
			
			ОбновитьОтображениеДанных();
			
			Элементы.ПолеМнемосхемы.ТекущийЭлемент = ПолеМнемосхемы.ЭлементыГрафическойСхемы[НомерДобавленногоЭлемента - 1];
			
			ИндексЭлемента = НомерДобавленногоЭлемента - 1;
			
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	НомерДобавленногоЭлемента = неопределено;
	
	торо_РаботаСМнемосхемами.мнс_СоздатьУзел(ТекЭлемент.Имя, ПолеМнемосхемы, НаправлениеЭлемента, СоединятьЛинией,1, Шаг,Картинка,НомерДобавленногоЭлемента, СтруктураДопСвойств);
	
	ОбновитьОтображениеДанных();
	
	Элементы.ПолеМнемосхемы.ТекущийЭлемент = ПолеМнемосхемы.ЭлементыГрафическойСхемы[НомерДобавленногоЭлемента - 1];
	
	ИндексЭлемента = НомерДобавленногоЭлемента - 1;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗакрытияФормыНастроек(Результат, ПараметрыВыбора) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗапланированныеРемонты.Очистить();
	Для каждого Элем Из Результат.МассивРемонтов Цикл
		
		НС = ЗапланированныеРемонты.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Элем);
		
	КонецЦикла;
	
	Нормировать = Результат.Нормировать;
	
	Если Результат.Пересчитать Тогда
		
		МожноПечататьВизуализацию = Ложь;
		
		ТаблицаРемонтовВизуализация.Очистить();
		
		Для каждого Стр Из ТаблицаРемонтов Цикл
			
			НС = ТаблицаРемонтовВизуализация.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Стр);
			
		КонецЦикла;
		
		Для Каждого ЗапланированныйВидРемонта Из ЗапланированныеРемонты Цикл
			Если ЗапланированныйВидРемонта.Выбран Тогда
				Продолжить;
			КонецЕсли;
			МассивНеВидимыхРемонтов = ТаблицаРемонтовВизуализация.НайтиСтроки(Новый Структура("ВидРемонтныхРабот",ЗапланированныйВидРемонта.ВидРемонтныхРабот));
			Для Каждого СтрокаНВРемонта Из МассивНеВидимыхРемонтов Цикл
				ТаблицаРемонтовВизуализация.Удалить(СтрокаНВРемонта);
			КонецЦикла;
		КонецЦикла;
		
		РассчитатьПараметрыОтПредыдущего();
	Иначе
		
		Для Каждого ЗапланированныйВидРемонта Из ЗапланированныеРемонты Цикл
			Если ЗапланированныйВидРемонта.Выбран Тогда
				Продолжить;
			КонецЕсли;
			МассивНеВидимыхРемонтов = ТаблицаРемонтовВизуализация.НайтиСтроки(Новый Структура("ВидРемонтныхРабот",ЗапланированныйВидРемонта.ВидРемонтныхРабот));
			Для Каждого СтрокаНВРемонта Из МассивНеВидимыхРемонтов Цикл
				ТаблицаРемонтовВизуализация.Удалить(СтрокаНВРемонта);
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;
	
	СоответсвиеЦветов.Очистить();
	Для Каждого СтрокаРемонт Из ЗапланированныеРемонты Цикл
		Если Не СтрокаРемонт.Выбран Тогда
			Продолжить;
		КонецЕсли;
		НС = СоответсвиеЦветов.Добавить();
		НС.ВидРемонтныхРабот = СтрокаРемонт.ВидРемонтныхРабот;
		НС.Цвет = СтрокаРемонт.Цвет;
		НС.ЦветТекста = СтрокаРемонт.ЦветТекста;
		НС.Шрифт = СтрокаРемонт.Шрифт;
	КонецЦикла;
	
	Если ТаблицаРемонтов.Количество()>0 Тогда
		ПоследнийРемонт = ТаблицаРемонтов[ТаблицаРемонтов.Количество() - 1];
		ДатаПоследнего = ТаблицаРемонтов[0].ДатаНач;
		ОбщаяПродолжительность = ПоследнийРемонт.ДатаНач - ДатаПоследнего;
		
		Если ОбщаяПродолжительность = 0 Тогда
			ОбщаяПродолжительность = 1;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерерасчитатьЗавершение(Список, ДополнительныеПараметры) Экспорт
	
	Если Список = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокНеНужныхВР = Новый СписокЗначений;

	Для Каждого ЭлементСписка Из Список Цикл
		Если НЕ ЭлементСписка.Пометка Тогда
			СписокНеНужныхВР.Добавить(ЭлементСписка.Значение);
		КонецЕсли; 
	КонецЦикла;
	
	РасчетВыполнен = ПерерасчитатьНаСервере(СписокНеНужныхВР);
	
	Если Не РасчетВыполнен Тогда
		Возврат;
	КонецЕсли;
	
	НарисоватьМнемосхему(ОбщаяПродолжительность);
	 
КонецПроцедуры

&НаСервере
Функция ПерерасчитатьНаСервере(СписокНеНужныхВР)
	
	ПолеТД.Очистить();
	ПолеТД.АвтоМасштаб = Истина;
	
	СоответствиеИндексаИНомераКолонки.Очистить();
	
	Для каждого ЭлемСписка Из СписокНеНужныхВР Цикл
		
		МассивСтрок = ТаблицаОбъектыРемонта.НайтиСтроки(Новый Структура("ВидРемонтныхРабот", ЭлемСписка.Значение));
		
		Если МассивСтрок.Количество() Тогда
			ТаблицаОбъектыРемонта.Удалить(МассивСтрок[0]);
		КонецЕсли;
		
	КонецЦикла;
	
	ТабПараметрыНаработки = ПолучитьТаблицуПараметровНаработки();
	ТабПараметрыНаработкиОбъектовРемонта.Загрузить(ТабПараметрыНаработки);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ТаблицаПланРемонтов"     , Документы.торо_ПланГрафикРемонта.ПустаяСсылка().ПланРемонтов.ВыгрузитьКолонки());
	СтруктураДанных.Вставить("ТаблицаОбъектыРемонта"   , ТаблицаОбъектыРемонта.Выгрузить().Скопировать(,"ОбъектРемонтныхРабот,ВидРемонтныхРабот,ПлановыйГрафикРаботы,РемонтнаяГруппа"));
	СтруктураДанных.Вставить("ДатаПланирования"        , НачалоДня(ТекущаяДата()));
	СтруктураДанных.Вставить("ПериодичностьДетализации", Перечисления.Периодичность.Год);
	СтруктураДанных.Вставить("КоличествоПериодов"      , 1);
	СтруктураДанных.Вставить("ТабПараметрыНаработкиОбъектовРемонта", ТабПараметрыНаработкиОбъектовРемонта.Выгрузить());
	СтруктураДанных.Вставить("ВРНачалоЦикла"           , ВРНачалоЦикла);
	СтруктураДанных.Вставить("ВизуализацияТипОР"       , Ложь);
	
	ТабНормативов = Новый ТаблицаЗначений;
	СтруктураДанных.Вставить("ТаблицаНормативов", ТабНормативов);
	
	// Для совместимости с расчетом ППР создаем пустую таблицу
	ТаблицаЦепочки = Новый ТаблицаЗначений;
	ТаблицаЦепочки.Колонки.Добавить("ОбъектРемонтныхРабот", Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта"));
	ТаблицаЦепочки.Колонки.Добавить("Цепочка",              Новый ОписаниеТипов("СправочникСсылка.торо_ЦепочкиРемонта"));
	
	СтруктураДанных.Вставить("ТаблицаЦепочки", ТаблицаЦепочки);
	
	ДатаПланированияОкончание = Неопределено;
	ВыполнятьРасчет = ПроверкаПередРасчетом(СтруктураДанных["ДатаПланирования"], ДатаПланированияОкончание, ТаблицаОбъектыРемонта.Выгрузить().Скопировать(, "ОбъектРемонтныхРабот, ВидРемонтныхРабот"), СтруктураДанных["ТабПараметрыНаработкиОбъектовРемонта"]);
	
	Если ВыполнятьРасчет Тогда
		
		СтруктураДанных.Вставить("ДатаОкончанияВизуализации",ДатаПланированияОкончание);
		ТабРемонтов = торо_РасчетППР.РасчетППР(Неопределено,,,СтруктураДанных);
		
		Если ТабРемонтов = ложь или ТабРемонтов.Количество() = 0 Тогда
			ТекстСообщения = НСтр("ru = 'Не удалось рассчитать ремонтный цикл, проверьте настройки планирования!'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат ложь;
		Иначе
			ТаблицаРемонтов.Загрузить(ТабРемонтов);
		КонецЕсли;
		
		ТаблицаНормативов.Загрузить(СтруктураДанных.ТаблицаНормативов);
		
		ТаблицаРемонтов.Сортировать("ДатаНач");
		
		СтрокиНачало = ТаблицаРемонтов.НайтиСтроки(Новый Структура("ВидРемонтныхРабот", ВРНачалоЦикла));
		Если СтрокиНачало.Количество() > 0 Тогда
			СтрНачало = СтрокиНачало[0];
			ИндексНачало = ТаблицаРемонтов.Индекс(СтрНачало);
			Пока ИндексНачало > 0 Цикл
				ТаблицаРемонтов.Удалить(0);
				ИндексНачало = ИндексНачало - 1;
			КонецЦикла;
		КонецЕсли;
		
		
		КоличествоРемонтов = ТаблицаРемонтов.Количество();
		Пока КоличествоРемонтов > 0 Цикл
			Если ТаблицаРемонтов[КоличествоРемонтов - 1].ВидРемонтныхРабот = ВРНачалоЦикла Тогда
				Прервать;
			Иначе
				ТаблицаРемонтов.Удалить(КоличествоРемонтов - 1);
				КоличествоРемонтов = КоличествоРемонтов - 1;
			КонецЕсли;
		КонецЦикла;
		
		
		Если ТаблицаРемонтов.Количество() > 0 Тогда
			
			ЗапланРемонты = ТаблицаОбъектыРемонта.Выгрузить().Скопировать(,"ВидРемонтныхРабот");
			
			Массив = Новый Массив;
			Массив.Добавить(Тип("Булево"));
			ОписаниеТиповБул = Новый ОписаниеТипов(Массив);
			ЗапланРемонты.Колонки.Добавить("Выбран",ОписаниеТиповБул);
			Массив = Новый Массив;
			Массив.Добавить(Тип("Цвет"));
			ОписаниеТиповЦвет = Новый ОписаниеТипов(Массив);
			ЗапланРемонты.Колонки.Добавить("Цвет",ОписаниеТиповЦвет);
			ЗапланРемонты.ЗаполнитьЗначения(Истина,"Выбран");
			ЗапланРемонты.ЗаполнитьЗначения(Новый Цвет(255, 255, 255) ,"Цвет");
			
			Нормировать = Ложь;
			
		Иначе
			ТекстСообщения = НСтр("ru = 'Не удалось рассчитать ремонтный цикл, проверьте настройки планирования!'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат Ложь;
			
		КонецЕсли;
		
		ТаблицаРемонтовВизуализация.Загрузить(ТаблицаРемонтов.Выгрузить().Скопировать());
		РассчитатьПараметрыОтПредыдущего();
		
		Если ТаблицаРемонтов.Количество() > 0 Тогда
			ПоследнийРемонт = ТаблицаРемонтов[ТаблицаРемонтов.Количество() - 1];
			ДатаПоследнего = ТаблицаРемонтов[0].ДатаНач;
			ОбщаяПродолжительность = ПоследнийРемонт.ДатаНач - ДатаПоследнего;
			
			Если ОбщаяПродолжительность = 0 Тогда
				ОбщаяПродолжительность = 1;
			КонецЕсли;
			
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
КонецФункции

&НаСервере
Процедура ОчиститьПолеТабличногоДокумента()
	
	ПолеТД.Очистить();

КонецПроцедуры	

&НаСервере
Процедура РассчитатьПараметрыОтПредыдущего()
	Номер = 1;
	Если ТаблицаРемонтовВизуализация.Количество() > 0 Тогда
		ДатаНачПервого = ТаблицаРемонтовВизуализация[0].ДатаНач;
		ДатаПредшествующего = ДатаНачПервого;
	КонецЕсли;
		
	Для Каждого СтрРемонт Из ТаблицаРемонтовВизуализация Цикл
		СтрРемонт.ДатаПредшествующего = Мин(НачалоДня(ДатаПредшествующего),СтрРемонт.ДатаНач);
		ДатаПредшествующего = СтрРемонт.ДатаКон;
	КонецЦикла;
	
	Если ТаблицаРемонтовВизуализация.Количество() > 0 Тогда
		ПоследняяСтрокаРемонта = ТаблицаРемонтовВизуализация[ТаблицаРемонтовВизуализация.Количество() - 1];
		СтрокаДляПодвала = ТаблицаРемонтовВизуализация.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаДляПодвала,ПоследняяСтрокаРемонта);
		СтрокаДляПодвала.Замещен = Ложь;
	КонецЕсли;
	
	МассивГрафиков = Новый Массив(1);
	МассивГрафиков[0] = Объект.ПлановыйГрафикРаботы;
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	торо_РасчетППР.СоздатьВТРасписанияРаботыНаПериодСКопированиемПериода(МенеджерВТ,МассивГрафиков,ДатаНачПервого,ДатаПредшествующего,Истина);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаРемонтов.ДатаНач,
	               |	ТаблицаРемонтов.ДатаКон,
	               |	ТаблицаРемонтов.ВидРемонтныхРабот,
	               |	ТаблицаРемонтов.Замещен,
	               |	ТаблицаРемонтов.ДатаПредшествующего,
	               |	ТаблицаРемонтов.РассчитанПоПериодичности,
	               |	ТаблицаРемонтов.ID
	               |ПОМЕСТИТЬ ТаблицаРемонтов
	               |ИЗ
	               |	&ТаблицаРемонтов КАК ТаблицаРемонтов
	               |ГДЕ
	               |	НЕ ТаблицаРемонтов.Замещен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаНормативов.ВидРемонтныхРабот,
	               |	ТаблицаНормативов.ПлановыйГрафикРаботы,
	               |	ТаблицаНормативов.НормативныйРемонт,
	               |	ТаблицаНормативов.НеУчитыватьПриПланированииГрафикРаботыОборудования,
	               |	ТаблицаНормативов.Продолжительность,
	               |	ТаблицаНормативов.НеУчитыватьПродолжительность
	               |ПОМЕСТИТЬ ТаблицаНормативов
	               |ИЗ
	               |	&ТаблицаНормативов КАК ТаблицаНормативов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТРасписанияРаботы.ГрафикРаботы,
	               |	ВТРасписанияРаботы.ДатаГрафика,
	               |	РАЗНОСТЬДАТ(ВТРасписанияРаботы.ВремяОкончания, ВТРасписанияРаботы.ВремяНачала, ЧАС) КАК ОсновноеЗначение
	               |ПОМЕСТИТЬ ТаблицаГрафиковСоВременем
	               |ИЗ
	               |	ВТРасписанияРаботы КАК ВТРасписанияРаботы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаРемонтов.ДатаНач,
	               |	ТаблицаРемонтов.ДатаКон,
	               |	ТаблицаРемонтов.ВидРемонтныхРабот,
	               |	ТаблицаРемонтов.Замещен,
	               |	ТаблицаРемонтов.ДатаПредшествующего,
	               |	ТаблицаРемонтов.РассчитанПоПериодичности,
	               |	ТаблицаРемонтов.ID,
	               |	ТаблицаНормативов.ПлановыйГрафикРаботы,
	               |	ТаблицаНормативов.НормативныйРемонт,
	               |	ТаблицаНормативов.НеУчитыватьПриПланированииГрафикРаботыОборудования,
	               |	ТаблицаНормативов.НеУчитыватьПродолжительность,
	               |	ЕСТЬNULL(ТаблицаНормативов.Продолжительность, 0) КАК Продолжительность
	               |ПОМЕСТИТЬ ТаблицаСНормативами
	               |ИЗ
	               |	ТаблицаРемонтов КАК ТаблицаРемонтов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаНормативов КАК ТаблицаНормативов
	               |		ПО ТаблицаРемонтов.ВидРемонтныхРабот = ТаблицаНормативов.ВидРемонтныхРабот
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаСНормативами.ДатаНач КАК ДатаНач,
	               |	ТаблицаСНормативами.ДатаКон,
	               |	ТаблицаСНормативами.ВидРемонтныхРабот,
	               |	ТаблицаСНормативами.Замещен,
	               |	ТаблицаСНормативами.ДатаПредшествующего КАК ДатаПредшествующего,
	               |	ТаблицаСНормативами.РассчитанПоПериодичности,
	               |	ТаблицаСНормативами.ПлановыйГрафикРаботы,
	               |	ТаблицаСНормативами.НормативныйРемонт,
	               |	ТаблицаСНормативами.НеУчитыватьПриПланированииГрафикРаботыОборудования,
	               |	ТаблицаСНормативами.НеУчитыватьПродолжительность,
	               |	ТаблицаСНормативами.Продолжительность,
	               |	ТаблицаСНормативами.ID,
	               |	СУММА(ЕСТЬNULL(ТаблицаГрафиковСоВременем.ОсновноеЗначение, 0)) КАК Часы,
	               |	СУММА(ВЫБОР
	               |			КОГДА ТаблицаГрафиковСоВременем.ОсновноеЗначение ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК Дни,
	               |	0 КАК ФактическаяНаработка
	               |ПОМЕСТИТЬ ТаблицаРемонтыИНормативы
	               |ИЗ
	               |	ТаблицаСНормативами КАК ТаблицаСНормативами
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаГрафиковСоВременем КАК ТаблицаГрафиковСоВременем
	               |		ПО ТаблицаСНормативами.ПлановыйГрафикРаботы = ТаблицаГрафиковСоВременем.ГрафикРаботы
	               |			И ТаблицаСНормативами.ДатаПредшествующего < ТаблицаГрафиковСоВременем.ДатаГрафика
	               |			И ТаблицаСНормативами.ДатаНач > ТаблицаГрафиковСоВременем.ДатаГрафика
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТаблицаСНормативами.Замещен,
	               |	ТаблицаСНормативами.ПлановыйГрафикРаботы,
	               |	ТаблицаСНормативами.ВидРемонтныхРабот,
	               |	ТаблицаСНормативами.ДатаПредшествующего,
	               |	ТаблицаСНормативами.РассчитанПоПериодичности,
	               |	ТаблицаСНормативами.ДатаНач,
	               |	ТаблицаСНормативами.ДатаКон,
	               |	ТаблицаСНормативами.НеУчитыватьПродолжительность,
	               |	ТаблицаСНормативами.НормативныйРемонт,
	               |	ТаблицаСНормативами.НеУчитыватьПриПланированииГрафикРаботыОборудования,
	               |	ТаблицаСНормативами.Продолжительность,
	               |	ТаблицаСНормативами.ID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаРемонтов.ВидРемонтныхРабот,
	               |	ТаблицаРемонтов.ID,
	               |	ТаблицаРемонтов.ДатаНач КАК ДатаНач,
	               |	ТаблицаРемонтов.ДатаКон,
	               |	ЕСТЬNULL(ДОБАВИТЬКДАТЕ(МАКСИМУМ(ТаблицаРемонтов1.ДатаКон), ДЕНЬ, 1), ТаблицаРемонтов.ДатаНач) КАК ДатаПредшествующегоТогожеВида,
	               |	ТаблицаРемонтов.Замещен,
	               |	ТаблицаРемонтов.ДатаПредшествующего,
	               |	ТаблицаРемонтов.РассчитанПоПериодичности,
	               |	ТаблицаРемонтов.ПлановыйГрафикРаботы,
	               |	ТаблицаРемонтов.НормативныйРемонт,
	               |	ТаблицаРемонтов.НеУчитыватьПриПланированииГрафикРаботыОборудования,
	               |	ТаблицаРемонтов.НеУчитыватьПродолжительность,
	               |	ТаблицаРемонтов.Продолжительность,
	               |	ТаблицаРемонтов.Часы,
	               |	ТаблицаРемонтов.Дни,
	               |	ТаблицаРемонтов.ФактическаяНаработка
	               |ПОМЕСТИТЬ РемонтыСПредшествующими
	               |ИЗ
	               |	ТаблицаРемонтыИНормативы КАК ТаблицаРемонтов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРемонтыИНормативы КАК ТаблицаРемонтов1
	               |		ПО ТаблицаРемонтов.ВидРемонтныхРабот = ТаблицаРемонтов1.ВидРемонтныхРабот
	               |			И ТаблицаРемонтов.ДатаНач > ТаблицаРемонтов1.ДатаКон
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТаблицаРемонтов.ВидРемонтныхРабот,
	               |	ТаблицаРемонтов.ID,
	               |	ТаблицаРемонтов.ДатаНач,
	               |	ТаблицаРемонтов.ДатаКон,
	               |	ТаблицаРемонтов.Замещен,
	               |	ТаблицаРемонтов.ДатаПредшествующего,
	               |	ТаблицаРемонтов.РассчитанПоПериодичности,
	               |	ТаблицаРемонтов.ПлановыйГрафикРаботы,
	               |	ТаблицаРемонтов.НормативныйРемонт,
	               |	ТаблицаРемонтов.НеУчитыватьПриПланированииГрафикРаботыОборудования,
	               |	ТаблицаРемонтов.НеУчитыватьПродолжительность,
	               |	ТаблицаРемонтов.Продолжительность,
	               |	ТаблицаРемонтов.Часы,
	               |	ТаблицаРемонтов.Дни,
	               |	ТаблицаРемонтов.ФактическаяНаработка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РемонтыСПредшествующими.ВидРемонтныхРабот,
	               |	РемонтыСПредшествующими.ДатаНач КАК ДатаНач,
	               |	РемонтыСПредшествующими.ДатаКон,
	               |	РемонтыСПредшествующими.ДатаПредшествующегоТогожеВида,
	               |	РемонтыСПредшествующими.Замещен,
	               |	РемонтыСПредшествующими.ДатаПредшествующего КАК ДатаПредшествующего,
	               |	РемонтыСПредшествующими.РассчитанПоПериодичности,
	               |	РемонтыСПредшествующими.ПлановыйГрафикРаботы,
	               |	РемонтыСПредшествующими.НормативныйРемонт,
	               |	РемонтыСПредшествующими.НеУчитыватьПриПланированииГрафикРаботыОборудования,
	               |	РемонтыСПредшествующими.НеУчитыватьПродолжительность,
	               |	РемонтыСПредшествующими.Продолжительность,
	               |	РемонтыСПредшествующими.Часы,
	               |	РемонтыСПредшествующими.Дни,
	               |	РемонтыСПредшествующими.ФактическаяНаработка,
	               |	СУММА(ВЫБОР
	               |			КОГДА ТаблицаГрафиковСоВременем.ОсновноеЗначение ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК ДниОтПредшествующего,
	               |	РемонтыСПредшествующими.ID
	               |ИЗ
	               |	РемонтыСПредшествующими КАК РемонтыСПредшествующими
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаГрафиковСоВременем КАК ТаблицаГрафиковСоВременем
	               |		ПО РемонтыСПредшествующими.ПлановыйГрафикРаботы = ТаблицаГрафиковСоВременем.ГрафикРаботы
	               |			И РемонтыСПредшествующими.ДатаПредшествующегоТогожеВида < ТаблицаГрафиковСоВременем.ДатаГрафика
	               |			И РемонтыСПредшествующими.ДатаНач > ТаблицаГрафиковСоВременем.ДатаГрафика
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РемонтыСПредшествующими.ВидРемонтныхРабот,
	               |	РемонтыСПредшествующими.ДатаНач,
	               |	РемонтыСПредшествующими.ДатаКон,
	               |	РемонтыСПредшествующими.ДатаПредшествующегоТогожеВида,
	               |	РемонтыСПредшествующими.Замещен,
	               |	РемонтыСПредшествующими.ДатаПредшествующего,
	               |	РемонтыСПредшествующими.РассчитанПоПериодичности,
	               |	РемонтыСПредшествующими.ПлановыйГрафикРаботы,
	               |	РемонтыСПредшествующими.НормативныйРемонт,
	               |	РемонтыСПредшествующими.НеУчитыватьПриПланированииГрафикРаботыОборудования,
	               |	РемонтыСПредшествующими.НеУчитыватьПродолжительность,
	               |	РемонтыСПредшествующими.Продолжительность,
	               |	РемонтыСПредшествующими.Часы,
	               |	РемонтыСПредшествующими.Дни,
	               |	РемонтыСПредшествующими.ФактическаяНаработка,
	               |	РемонтыСПредшествующими.ID
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаНач,
	               |	ДатаПредшествующего УБЫВ";
	
	Запрос.УстановитьПараметр("ТаблицаРемонтов",ТаблицаРемонтовВизуализация.Выгрузить());
	Запрос.УстановитьПараметр("ТаблицаНормативов",ТаблицаНормативов.Выгрузить());
	
	ТаблицаРемонтовВизуализация.Загрузить(Запрос.Выполнить().Выгрузить());
	
	ИндексСтроки = 7;
	СоответсвиеИменКолонок = Новый Соответствие;
	
	КолонкиНаработки.Очистить();
	ЗначенияНаработки.Очистить();
	
	РассчитатьНаработкуДляВизуализации(ИндексСтроки, "ДатаПредшествующего");
	РассчитатьНаработкуДляВизуализации(ИндексСтроки, "ДатаПредшествующегоТогожеВида");
	
	Если ТаблицаРемонтовВизуализация.Количество() > 0 Тогда
		ПоследнийРемонт = ТаблицаРемонтовВизуализация[ТаблицаРемонтовВизуализация.Количество() - 1];
		ДатаПоследнего = ТаблицаРемонтовВизуализация[0].ДатаНач;
		ОбщаяПродолжительность = ПоследнийРемонт.ДатаНач - ДатаПоследнего;
		
		Если ОбщаяПродолжительность = 0 Тогда
			ОбщаяПродолжительность = 1;
		КонецЕсли;
	КонецЕсли;
	
	
	ТаблицаШагов = Новый ТаблицаЗначений;
	Если ТаблицаШагов.Колонки.Найти("Шаг") = Неопределено Тогда
		ТаблицаШагов.Колонки.Добавить("Шаг");
	КонецЕсли;
	
	Для Каждого СтрокаРемонта Из ТаблицаРемонтовВизуализация Цикл
		СтрокаШаг = ТаблицаШагов.Добавить();
		СтрокаШаг.Шаг = (СтрокаРемонта.ДатаНач - СтрокаРемонта.ДатаПредшествующего) / ОбщаяПродолжительность;
		Если СтрокаШаг.Шаг = 0 Тогда 
			ТаблицаШагов.Удалить(СтрокаШаг);
		КонецЕсли;
	КонецЦикла;
	ТаблицаШагов.Сортировать("Шаг Возр");
	Если ТаблицаШагов.Количество() > 0 Тогда
		МинШаг = ТаблицаШагов[0].Шаг;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьНаработкуДляВизуализации(ИндексСтроки, ТипДатыНачала)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТаблицаРемонтов.ДатаНач КАК ДатаОкончания,
	|	ТаблицаРемонтов." + ТипДатыНачала + " КАК ДатаНачала,
	|	ТаблицаРемонтов.ПлановыйГрафикРаботы
	|ПОМЕСТИТЬ ТаблицаРемонтов
	|ИЗ
	|	&ТаблицаРемонтов КАК ТаблицаРемонтов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ПараметрыНаработкиОбъектовРемонтаСрезПоследних.Показатель,
	|	торо_ПараметрыНаработкиОбъектовРемонтаСрезПоследних.ОбъектРемонта,
	|	торо_ПараметрыНаработкиОбъектовРемонтаСрезПоследних.ПлановаяНаработка,
	|	торо_ПараметрыНаработкиОбъектовРемонтаСрезПоследних.ПериодПлановойНаработки,
	|	торо_ПараметрыНаработкиОбъектовРемонтаСрезПоследних.ПродолжительностьПериодаПлановойНаработки,
	|	торо_ПараметрыНаработкиОбъектовРемонтаСрезПоследних.КоэффициентИспользованияОборудования
	|ПОМЕСТИТЬ ТаблицаНаработки
	|ИЗ
	|	РегистрСведений.торо_ПараметрыНаработкиОбъектовРемонта.СрезПоследних(, ОбъектРемонта В (&СписокОР)) КАК торо_ПараметрыНаработкиОбъектовРемонтаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаРемонтов.ДатаНачала,
	|	ТаблицаРемонтов.ДатаОкончания,
	|	ТаблицаНаработки.Показатель,
	|	ТаблицаНаработки.ОбъектРемонта,
	|	ТаблицаРемонтов.ПлановыйГрафикРаботы КАК ПлановыйГрафикРаботы,
	|	ТаблицаНаработки.ПлановаяНаработка,
	|	ТаблицаНаработки.ПериодПлановойНаработки,
	|	ТаблицаНаработки.ПродолжительностьПериодаПлановойНаработки,
	|	ТаблицаНаработки.КоэффициентИспользованияОборудования
	|ИЗ
	|	ТаблицаНаработки КАК ТаблицаНаработки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаРемонтов КАК ТаблицаРемонтов
	|		ПО (ИСТИНА)";
	
	Запрос.УстановитьПараметр("ТаблицаРемонтов", ТаблицаРемонтовВизуализация.Выгрузить());
	СписокОР = Новый СписокЗначений;
	СписокОР.ЗагрузитьЗначения(ТабПараметрыНаработкиОбъектовРемонта.Выгрузить().ВыгрузитьКолонку("ОбъектРемонта"));
	Запрос.УстановитьПараметр("СписокОР",СписокОР);
	ТаблицаНаработка = Запрос.Выполнить().Выгрузить();
	
	ВариантыПериодов = ТаблицаНаработка.Скопировать(,"ПериодПлановойНаработки");
	ВариантыПериодов.Свернуть("ПериодПлановойНаработки",);
	
	СоответсвиеИменКолонок = Новый Соответствие;
	
	ТабРемонтовВизуализация = ТаблицаРемонтовВизуализация.Выгрузить().Скопировать();
	
	Для Каждого Период Из ВариантыПериодов Цикл
		ТаблицаСПериодом = ТаблицаНаработка.Скопировать(Новый Структура("ПериодПлановойНаработки",Период.ПериодПлановойНаработки));
		ТаблицаСНаработкой = торо_РаботаСНаработкой.РассчитатьВремяРаботыОРСПериодами(ТаблицаСПериодом,Период.ПериодПлановойНаработки,Истина);
		Для Каждого ЗаписьСНаработкой Из ТаблицаСНаработкой Цикл
			
			МассивСПараметрами = ТаблицаНаработка.НайтиСтроки(Новый Структура("ДатаНачала,ДатаОкончания",
			ЗаписьСНаработкой.ДатаНачала,ЗаписьСНаработкой.ДатаОкончания));	
			
			Для Каждого СтрокаСПараметрами Из МассивСПараметрами Цикл 
				Показатель = СтрокаСПараметрами.Показатель;
				ПоказательID = Показатель.УникальныйИдентификатор();
				ИмяКолонки = СоответсвиеИменКолонок.Получить(ПоказательID);
				Если ИмяКолонки = Неопределено Тогда
					ИмяКолонки = "Колонка" + ИндексСтроки;
					
					НоваяКолонка = ТабРемонтовВизуализация.Колонки.Добавить(ИмяКолонки);
					
					СоответсвиеИменКолонок.Вставить(ПоказательID,ИмяКолонки);
					НоваяСтрокаКолнки = КолонкиНаработки.Добавить();
					НоваяСтрокаКолнки.Показатель = Показатель;
					НоваяСтрокаКолнки.ИмяКолонки = ИмяКолонки;
					НоваяСтрокаКолнки.ПредшествующийТогоЖеВида = ?(ТипДатыНачала = "ДатаПредшествующего", Ложь, Истина);
					ТабРемонтовВизуализация.ЗаполнитьЗначения(0,ИмяКолонки);
					ОбластьВывода = ПолеТД.Область(ИндексСтроки, 2);
					ОбластьВывода.Текст = Показатель;
					ИндексСтроки = ИндексСтроки + 1;
				КонецЕсли;
				
				Отбор = Новый Структура;
				Отбор.Вставить(ТипДатыНачала, ЗаписьСНаработкой.ДатаНачала);
				Отбор.Вставить("ДатаНач",ЗаписьСНаработкой.ДатаОкончания); 
				
				МассивСтрок = ТабРемонтовВизуализация.НайтиСтроки(Отбор);
				
				Для Каждого Строка Из МассивСтрок Цикл
					
					Строка[ИмяКолонки] = Строка[ИмяКолонки] 
					+ ЗаписьСНаработкой.Периодов / ?(СтрокаСПараметрами.ПродолжительностьПериодаПлановойНаработки = 0,1,СтрокаСПараметрами.ПродолжительностьПериодаПлановойНаработки) 
					* СтрокаСПараметрами.КоэффициентИспользованияОборудования * СтрокаСПараметрами.ПлановаяНаработка;									
					
					НС = ЗначенияНаработки.Добавить();
					НС.ID = Строка.ID;
					НС.ВидРемонтныхРабот = Строка.ВидРемонтныхРабот;
					НС.Показатель = ИмяКолонки;
					НС.Значение = Строка[ИмяКолонки];
					
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Функция ПроверкаПередРасчетом(ДатаПланирования, ДатаПланированияОкончание, НужныеРемонты, ТабПараметрыНаработкиОбъектовРемонта)
	
	ДатаПланированияОкончание = РассчитатьДатуОкончанияПланирования(ДатаПланирования, ТабПараметрыНаработкиОбъектовРемонта);
	
	Если ДатаПланированияОкончание = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НужныеГода = Новый ТаблицаЗначений;
	ТипГодГрафика = Новый Массив;
	ТипГодГрафика.Добавить(Тип("Число"));
	НужныеГода.Колонки.Добавить("ГодГрафика",Новый ОписаниеТипов(ТипГодГрафика), "ГодГрафика");
	НужныеГода.Добавить().ГодГрафика = Год(ТекущаяДата());
	
	Если НЕ ПроверитьЗаполненностьГрафика(ДатаПланирования,ДатаПланированияОкончание,НужныеГода, НужныеРемонты) Тогда
		Возврат Ложь;
	Иначе 
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПроверитьЗаполненностьГрафика(ДатаПланированияНачало, ДатаПланированияОкончание, НужныеГода, НужныеРемонты)
	
	ГрафикЗаполнен = Истина;
	ТабПлановыйГрафикРаботы = Новый ТаблицаЗначений;
	ТабПлановыйГрафикРаботы.Колонки.Добавить("График", Новый ОписаниеТипов("СправочникСсылка.Календари"));
	НовСтрока = ТабПлановыйГрафикРаботы.Добавить();
	НовСтрока.График = Объект.ПлановыйГрафикРаботы;
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = "ВЫБРАТЬ
	|	торо_ТиповыеОРНормативныеРемонты.ВидРемонта,
	|	торо_ТиповыеОРНормативныеРемонты.Ссылка КАК ТиповойОР,
	|	торо_ТиповыеОРНормативныеРемонты.НормативныйРемонт
	|ПОМЕСТИТЬ ВсеНормРемонтыТиповогоОР
	|ИЗ
	|	Справочник.торо_ТиповыеОР.НормативныеРемонты КАК торо_ТиповыеОРНормативныеРемонты
	|ГДЕ
	|	торо_ТиповыеОРНормативныеРемонты.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НужныеРемонты.ВидРемонтныхРабот
	|ПОМЕСТИТЬ ВидыРемонтов
	|ИЗ
	|	&НужныеРемонты КАК НужныеРемонты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВсеНормРемонтыТиповогоОР.ВидРемонта,
	|	ВсеНормРемонтыТиповогоОР.ТиповойОР,
	|	ВсеНормРемонтыТиповогоОР.НормативныйРемонт
	|ПОМЕСТИТЬ НужныеРемонты
	|ИЗ
	|	ВсеНормРемонтыТиповогоОР КАК ВсеНормРемонтыТиповогоОР
	|ГДЕ
	|	ВсеНормРемонтыТиповогоОР.ВидРемонта В
	|			(ВЫБРАТЬ
	|				НужныеРемонты.ВидРемонтныхРабот
	|			ИЗ
	|				ВидыРемонтов КАК НужныеРемонты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПлановыйГрафикРаботы.График
	|ПОМЕСТИТЬ ПлановыйГрафикРаботы
	|ИЗ
	|	&ПлановыйГрафикРаботы КАК ПлановыйГрафикРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ТиповыеОРНормативныеРемонты.ГрафикРемонтныхРабот
	|ПОМЕСТИТЬ ТабГрафиков
	|ИЗ
	|	НужныеРемонты КАК НужныеРемонты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ТиповыеОР.НормативныеРемонты КАК торо_ТиповыеОРНормативныеРемонты
	|		ПО НужныеРемонты.ВидРемонта = торо_ТиповыеОРНормативныеРемонты.ВидРемонта
	|			И НужныеРемонты.ТиповойОР = торо_ТиповыеОРНормативныеРемонты.Ссылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ПлановыйГрафикРаботы.График
	|ИЗ
	|	ПлановыйГрафикРаботы КАК ПлановыйГрафикРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабГрафиков.ГрафикРемонтныхРабот
	|ИЗ
	|	ТабГрафиков КАК ТабГрафиков";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("ДатаПланированияНачало", ДатаПланированияНачало);
	Запрос.УстановитьПараметр("НужныеРемонты", НужныеРемонты);
	Запрос.УстановитьПараметр("ПлановыйГрафикРаботы", ТабПлановыйГрафикРаботы);
	
	Результат = Запрос.Выполнить();
	МассивГрафиков = Результат.Выгрузить().ВыгрузитьКолонку("ГрафикРемонтныхРабот");
	
	КалендарныеГрафики.СоздатьВТРасписанияРаботыНаПериод(МенеджерВТ, МассивГрафиков, НачалоДня(ДатаПланированияНачало), ДатаПланированияОкончание);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = "ВЫБРАТЬ
	|	НужныеГода.ГодГрафика
	|ПОМЕСТИТЬ НужныеГода
	|ИЗ
	|	&НужныеГода КАК НужныеГода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабГрафиков.ГрафикРемонтныхРабот,
	|	НужныеГода.ГодГрафика
	|ПОМЕСТИТЬ ВремТабл
	|ИЗ
	|	ТабГрафиков КАК ТабГрафиков,
	|	НужныеГода КАК НужныеГода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРасписанияРаботы.ГрафикРаботы,
	|	ГОД(ВТРасписанияРаботы.ДатаГрафика) КАК ГодГрафика,
	|	СУММА(РАЗНОСТЬДАТ(ВТРасписанияРаботы.ВремяНачала, ВТРасписанияРаботы.ВремяОкончания, СЕКУНДА)) КАК ОсновноеЗначение
	|ПОМЕСТИТЬ ВТРасписанияРаботыИзм
	|ИЗ
	|	ВТРасписанияРаботы КАК ВТРасписанияРаботы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТРасписанияРаботы.ГрафикРаботы,
	|	ГОД(ВТРасписанияРаботы.ДатаГрафика)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремТабл.ГрафикРемонтныхРабот КАК ГрафикРаботы,
	|	ВремТабл.ГодГрафика,
	|	ЕСТЬNULL(ВТРасписанияРаботыИзм.ОсновноеЗначение, 0) КАК ОсновноеЗначение
	|ИЗ
	|	ВремТабл КАК ВремТабл
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасписанияРаботыИзм КАК ВТРасписанияРаботыИзм
	|		ПО ВремТабл.ГодГрафика = ВТРасписанияРаботыИзм.ГодГрафика
	|			И ВремТабл.ГрафикРемонтныхРабот = ВТРасписанияРаботыИзм.ГрафикРаботы";
	
	Запрос.УстановитьПараметр("НужныеГода", НужныеГода);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ОсновноеЗначение = 0 Тогда
			ШаблонСообщения = НСтр("ru = 'Не заполнен график %1 за %2 год'");

			ТекстСообщения = СтрШаблон(ШаблонСообщения, Выборка.ГрафикРаботы, Выборка.ГодГрафика);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			ГрафикЗаполнен = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ГрафикЗаполнен;
	
КонецФункции

&НаСервере
Процедура НарисоватьТаблицу(ТабличныйДокумент)
	
	ПервичныйСдвигСтрок = ТабличныйДокумент.ВысотаТаблицы;
	
	ИндексСтроки = 8 + КолонкиНаработки.Количество() + 1;
	флВсеНарисовано = Ложь;
	СдвигСтрокПоляТД = ПервичныйСдвигСтрок;
	КоличествоРемонтов = ТаблицаРемонтовВизуализация.Количество() - 1;
	ШиринаПоляТД = 145;
	КоличествоКолонокПоляТД = 16;
	ЭтоПерваяЧастьТаблицы = Истина;
	
	Пока НЕ флВсеНарисовано Цикл
		
		Если КоличествоКолонокПоляТД = 0 Тогда
			Прервать;
		КонецЕсли;
		
		Если КоличествоРемонтов + 1 >= КоличествоКолонокПоляТД Тогда
			ЧертитьКолонок = КоличествоКолонокПоляТД;
			КоличествоРемонтов = КоличествоРемонтов - КоличествоКолонокПоляТД + 1;
		Иначе 
			ЧертитьКолонок = КоличествоРемонтов + 2;
			флВсеНарисовано = Истина;
		КонецЕсли;
		
		ОбластьВывода = ТабличныйДокумент.Область(1,1,1,1);
		ОбластьВывода.ширинаКолонки = 4;
		
		ОбластьВывода = ТабличныйДокумент.Область(3+ СдвигСтрокПоляТД,2,6 + ИндексСтроки - 7 + СдвигСтрокПоляТД,ЧертитьКолонок+1 );
		ОбластьВывода.ГраницаСверху = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
		ОбластьВывода.ГраницаСлева = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
		ОбластьВывода.ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
		ОбластьВывода.ГраницаСправа = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
		ОбластьВывода.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		
		ОбластьВывода = ТабличныйДокумент.Область(3+ СдвигСтрокПоляТД,2,6 + ИндексСтроки - 7 + СдвигСтрокПоляТД,ЧертитьКолонок);
		ОбластьВывода.ШиринаКолонки = 8;
		
		
		ОбластьВывода = ТабличныйДокумент.Область(3+ СдвигСтрокПоляТД,2,6 + ИндексСтроки - 7 + СдвигСтрокПоляТД+1);
		ОбластьВывода.ШиринаКолонки = 20;
		ОбластьВывода.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
		ОбластьВывода.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
		Если НЕ ЭтоПерваяЧастьТаблицы Тогда
			ОбластьВывода = ТабличныйДокумент.Область(3+ СдвигСтрокПоляТД - 1, 2);
			ОбластьВывода.Текст = "Продолжение";
		КонецЕсли;
		ЭтоПерваяЧастьТаблицы = Ложь;
		ОбластьВывода = ТабличныйДокумент.Область(3 + СдвигСтрокПоляТД, 2);
		ОбластьВывода.Текст = "Вид ремонта"; 
		ОбластьВывода = ТабличныйДокумент.Область(4 + СдвигСтрокПоляТД, 2);
		ОбластьВывода.Текст = "Продолжительность (ч)"; 
		ОбластьВывода = ТабличныйДокумент.Область(5+СдвигСтрокПоляТД, 2);
		ОбластьВывода.Текст = "Тек. рабочие дни (от предшествующего)";
		ОбластьВывода = ТабличныйДокумент.Область(6 + СдвигСтрокПоляТД, 2);
		ОбластьВывода.Текст = "Тек. календарные дни (от предшествующего)";
		ОбластьВывода = ТабличныйДокумент.Область(7 + СдвигСтрокПоляТД, 2);
		ОбластьВывода.Текст = "Время работы (от предшествующего того же вида)";
		
		
		ДопИндекс = 0;
		Для Каждого КолонкаНаработки из КолонкиНаработки Цикл
			
			ОбластьВывода = ТабличныйДокумент.Область(8 + ДопИндекс + СдвигСтрокПоляТД, 2);
			ОбластьВывода.Текст = ПолучитьНаименованиеПоказателя(КолонкаНаработки.Показатель) + " (" + ?(КолонкаНаработки.ПредшествующийТогоЖеВида, "от предшествующего того же вида", "от предшествующего") + ")";	 
			ДопИндекс = ДопИндекс + 1;
		КонецЦикла;
		
		ОбластьВывода = ТабличныйДокумент.Область(8 + ДопИндекс + СдвигСтрокПоляТД, 2);
		ОбластьВывода.Текст = "Рассчитан по наработке";
		
		СдвигСтрокПоляТД = СдвигСтрокПоляТД + ИндексСтроки - 1;
	КонецЦикла;
	
	СдвигСтрокПоляТД = ПервичныйСдвигСтрок;
	Номер = 1;
	
	Если ТаблицаРемонтовВизуализация.Количество() > 0 Тогда
		ДатаНачПервого = ТаблицаРемонтовВизуализация[0].ДатаНач;
	КонецЕсли;
	Для Каждого СтрокаРемонта Из ТаблицаРемонтовВизуализация Цикл
		Если Не ЗначениеЗаполнено(СтрокаРемонта.ВидРемонтныхРабот) Тогда
			Продолжить;
		КонецЕсли;
		
		ДатаПоследнего = СтрокаРемонта.ДатаКон;
		
		ОбластьВывода = ТабличныйДокумент.Область(3+ СдвигСтрокПоляТД,Номер + 2);
		ОбластьВывода.Текст = СтрокаРемонта.ВидРемонтныхРабот.Код;
		
		ОбластьВывода2 = ТабличныйДокумент.Область(4 + СдвигСтрокПоляТД,Номер + 2);
		Продолжительность = Формат((СтрокаРемонта.Продолжительность) / 3600,"ЧДЦ=1"); 
		ОбластьВывода2.Текст = ?(СтрокаРемонта.НеУчитыватьПродолжительность,"(","") + Продолжительность + ?(СтрокаРемонта.НеУчитыватьПродолжительность,")","");   // продолжительность (часов)
		
		ОбластьВывода2 = ТабличныйДокумент.Область(5 + СдвигСтрокПоляТД,Номер + 2);
		ОбластьВывода2.Текст = СтрокаРемонта.Дни; 	// рабочих дней от предыдущего 
		
		ОбластьВывода2 = ТабличныйДокумент.Область(6 + СдвигСтрокПоляТД,Номер + 2);
		РазностьДат = (СтрокаРемонта.ДатаНач - СтрокаРемонта.ДатаПредшествующего) / 86400;
		ОбластьВывода2.Текст = ?(РазностьДат > 0,РазностьДат - 1, 0); 	// календарных дней от предыдущего
		
		ОбластьВывода2 = ТабличныйДокумент.Область(7 + СдвигСтрокПоляТД, Номер + 2);
		ОбластьВывода2.Текст = СтрокаРемонта.ДниОтПредшествующего; // рабочих дней от предшествующего того же вида 
		
		
		ДопИндекс = 0;
		Для Каждого КолонкаНаработки из КолонкиНаработки Цикл
			ИмяКолонки = КолонкаНаработки.ИмяКолонки;	
			
			СтрокиНаработки = ЗначенияНаработки.НайтиСтроки(Новый Структура("ID, ВидРемонтныхРабот, Показатель", СтрокаРемонта.ID, СтрокаРемонта.ВидРемонтныхРабот, ИмяКолонки));
			
			Если СтрокиНаработки.Количество() Тогда
				СтрНар = СтрокиНаработки[0];
				
				ОбластьВывода2 = ТабличныйДокумент.Область(8 + ДопИндекс + СдвигСтрокПоляТД,Номер + 2);
				ОбластьВывода2.Текст = СтрНар.Значение;
				
				// очередная наработка 
				ДопИндекс = ДопИндекс + 1;
			КонецЕсли;
			
		КонецЦикла;
		
		ОбластьВывода2 = ТабличныйДокумент.Область(8 + ДопИндекс + СдвигСтрокПоляТД, Номер + 2);
		ОбластьВывода2.Текст = ?(СтрокаРемонта.РассчитанПоПериодичности = Ложь, "v", "");
		
		Номер = Номер + 1;
		
		Если Не (ТабличныйДокумент.ТекущаяОбласть = Неопределено) И (ОбластьВывода2.Лево)*9 > ШиринаПоляТД Тогда 
			СдвигСтрокПоляТД = СдвигСтрокПоляТД + ИндексСтроки - 1;
			Номер = 1;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ВРНачалоЦиклаНачалоВыбора_ПослеВопросаОЗаписи(Результат, ДопПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		Если ЭтаФорма.Записать() Тогда
			ПанельОРПриСменеСтраницы(Элементы.ПанельОР, ДопПараметры.ТекущаяСтраница);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВРНачалоЦиклаНачалоВыбораВыборИзСписка(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Элемент = ДополнительныеПараметры.Элемент;
	
	Если Не ВыбранныйЭлемент = Неопределено Тогда
		ВРНачалоЦикла = ВыбранныйЭлемент.Значение;
	КонецЕсли;
	
	ВРНачалоЦиклаПриИзменении(Элемент);
	
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере()
	
	ТабДок = Новый ТабличныйДокумент;
	
	ПолужирныйШрифт = Новый Шрифт("Arial", 9,ИСТИНА,,,);
	
	ОбластьДляЗаголовка = ТабДок.ПолучитьОбласть(1,2,4,17);
	ОбластьЗаголовок = ОбластьДляЗаголовка.Область(1,2,4,17);
	ОбластьЗаголовок.Объединить();
	ОбластьЗаголовок.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
	ОбластьЗаголовок.Текст = НСтр("ru = 'Структура ремонтного цикла'");

	ОбластьЗаголовок.Шрифт = Новый Шрифт("Arial", 18, Истина);  
	ОбластьЗаголовок.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	ОбластьЗаголовок.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
	ТабДок.Вывести(ОбластьДляЗаголовка);
	
	ОбластьПараметров = ТабДок.ПолучитьОбласть(6,2,12, 17);
	
	ОбластьОРЗголовок = ОбластьПараметров.Область(2,2,2,17);
	ОбластьОРЗголовок.Объединить();
	ОбластьОРЗголовок.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
	ОбластьОРЗголовок.Шрифт = ПолужирныйШрифт;
	ОбластьОРЗголовок.Текст = НСтр("ru = 'Объект ремонта: '") + торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(Объект.Ссылка);

	ОбластьОРЗголовок.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	
	ОбластьГрафикЗаголовок = ОбластьПараметров.Область(3,2,3,17);
	ОбластьГрафикЗаголовок.Объединить();
	ОбластьГрафикЗаголовок.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
	ОбластьГрафикЗаголовок.Шрифт = ПолужирныйШрифт;
	ОбластьГрафикЗаголовок.Текст = НСтр("ru = 'Плановый график работы: '") + Объект.ПлановыйГрафикРаботы;

	ОбластьГрафикЗаголовок.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	
	ОбластьНормироватьЗаголовок = ОбластьПараметров.Область(4,2,4,17);
	ОбластьНормироватьЗаголовок.Объединить();
	ОбластьНормироватьЗаголовок.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
	ОбластьНормироватьЗаголовок.Шрифт = ПолужирныйШрифт;
	ОбластьНормироватьЗаголовок.Текст = НСтр("ru = 'Нормировать интервалы между ремонтами: '") + ?(Нормировать, НСтр("ru = 'Да'"), НСтр("ru = 'Нет'"));

	ОбластьНормироватьЗаголовок.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	
	ОбластьВРЗаголовок = ОбластьПараметров.Область(5,2,5,17);
	ОбластьВРЗаголовок.Объединить();
	ОбластьВРЗаголовок.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
	ОбластьВРЗаголовок.Шрифт = ПолужирныйШрифт;
	
	ПредставлениеПланируемыхРемонтов = "";
	Для Каждого ПланируемыйВР Из СписокВидовРемонтов Цикл
		ПредставлениеВР = торо_ЗаполнениеДокументов.ПолучитьПредоставленияВРДляПечати(ПланируемыйВР.Значение);
		ПредставлениеПланируемыхРемонтов = ?(ПредставлениеПланируемыхРемонтов = "", ПредставлениеПланируемыхРемонтов, ПредставлениеПланируемыхРемонтов + "; ") + ПредставлениеВР;
	КонецЦикла;
	
	ОбластьВРЗаголовок.Текст = НСтр("ru = 'Планируемые виды ремонтов: '") + ПредставлениеПланируемыхРемонтов;

	ОбластьВРЗаголовок.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
	ОбластьВРЗаголовок.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	
	ОбластьОтображВР = ОбластьПараметров.Область(6,2,6,17);
	ОбластьОтображВР.Объединить();
	ОбластьОтображВР.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
	ОбластьОтображВР.Шрифт = ПолужирныйШрифт;
	ОбластьОтображВР.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
	ОбластьОтображВР.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	
	ОтображаемыеВР = Новый СписокЗначений;
	ОтображаемыеВРТекст = "";
	Для Каждого ЗапланированныйРемонт Из ЗапланированныеРемонты Цикл
		Если ЗапланированныйРемонт.Выбран Тогда
			ПредставлениеВР = торо_ЗаполнениеДокументов.ПолучитьПредоставленияВРДляПечати(ЗапланированныйРемонт.ВидРемонтныхРабот);
			ОтображаемыеВР.Добавить(ЗапланированныйРемонт.ВидРемонтныхРабот, ПредставлениеВР);
			ОтображаемыеВРТекст = ?(ОтображаемыеВРТекст = "", ОтображаемыеВРТекст, ОтображаемыеВРТекст + "; ") + ПредставлениеВР;
		КонецЕсли;
	КонецЦикла;
	ОбластьОтображВР.Текст = НСтр("ru = 'Отображаемые ремонты: '") + ОтображаемыеВРТекст;
	
	ТабДок.Вывести(ОбластьПараметров);
	
	ПолеМнемосхемы.ИспользоватьСетку = Ложь;
	ГрафСхема = ПолеМнемосхемы.ПолучитьКартинку();
	ПолеМнемосхемы.ИспользоватьСетку = Истина;
	
	ОбластьКартинка = ТабДок.ПолучитьОбласть(13,2,13,КолвоКолонокМнемосхемы+1);
	Рис = Областькартинка.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
	Рис.Картинка = ГрафСхема;
	Рис.РазмерКартинки  = РазмерКартинки.Пропорционально;
	Рис.Расположить(ТабДок.Область(2,2,2,КолвоКолонокМнемосхемы+1));
	Рис.Высота = (50+ (90*КолСтрокСхемы) + 20)/4;
	Рис.ГраницаСверху = Ложь;
	Рис.ГраницаСлева = Ложь;
	рис.ГраницаСнизу = Ложь;
	Рис.ГраницаСправа = Ложь;
	
	ТабДок.Вывести(ОбластьКартинка);
	
	НарисоватьТаблицу(ТабДок);
	
	Для Каждого Элемент Из ОтображаемыеВР Цикл
		ОбластьРасшифровкаКода = ТабДок.ПолучитьОбласть(ТабДок.ВысотаТаблицы + 1 ,2,	ТабДок.ВысотаТаблицы + 2, 17);
		ОбластьКод = ОбластьРасшифровкаКода.Область(2,2,2, 17);
		ОбластьКод.Объединить();
		ОбластьКод.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
		ОбластьКод.Шрифт = Новый Шрифт("Arial", 9, Ложь);
		ОбластьКод.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
		ОбластьКод.Текст = СокрЛП(Элемент.Значение.Код) + " - " + Элемент.Значение;
		ТабДок.Вывести(ОбластьРасшифровкаКода);
	КонецЦикла;
	
	
	ТабДок.ОтображатьСетку = Ложь;
	табДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.КлючПараметровПечати = "торо_РемонтныеГруппы_Визуализация";
	ТабДок.ИмяПараметровПечати = "торо_РемонтныеГруппы_Визуализация";
	
	Возврат ТабДок;
	
КонецФункции

&НаСервере
Функция ЗаполнитьВидыРемонтаНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_НормативныеРемонтыОборудования.ОбъектРемонта КАК ОбъектРемонтныхРабот,
	|	торо_НормативныеРемонтыОборудования.ВидРемонта КАК ВидРемонтныхРабот,
	|	&ГрафикРаботы КАК ПлановыйГрафикРаботы,
	|	&РГ КАК РемонтнаяГруппа
	|ИЗ
	|	РегистрСведений.торо_НормативныеРемонтыОборудования КАК торо_НормативныеРемонтыОборудования
	|ГДЕ
	|	торо_НормативныеРемонтыОборудования.ОбъектРемонта = &ОР
	|	И торо_НормативныеРемонтыОборудования.Приоритет
	|	И НЕ торо_НормативныеРемонтыОборудования.НеУчаствуетВПланировании";
	
	Запрос.УстановитьПараметр("ОР", Объект.Ссылка);
	Запрос.УстановитьПараметр("ГрафикРаботы", Объект.ПлановыйГрафикРаботы);
	Запрос.УстановитьПараметр("РГ", Объект.Ссылка.ТиповойОР);
	
	ТаблицаОбъектыРемонта.Загрузить(Запрос.Выполнить().Выгрузить());
	
	СписокВидовРемонтов.Очистить();
	
	Для каждого Строчка Из ТаблицаОбъектыРемонта Цикл
		
		СписокВидовРемонтов.Добавить(Строчка.ВидРемонтныхРабот);
		
	КонецЦикла;
	
	Возврат СписокВидовРемонтов;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьНаименованиеПоказателя(Показатель)
	
	Возврат Показатель.Наименование;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКодДляВР(ВР)
	
	Возврат ВР.Код;
	
КонецФункции

&НаСервере
Функция РассчитатьДатуОкончанияПланирования(ДатаПланирования, ТабПараметрыНаработкиОбъектовРемонта)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	торо_НормативныеРемонтыОборудования.СпособПланирования.ПериодичностьРемонтныхРабот КАК ПериодичностьРемонтныхРабот,
	|	торо_НормативныеРемонтыОборудования.СпособПланирования.КоличествоПериодов КАК КоличествоПериодов
	|ИЗ
	|	РегистрСведений.торо_НормативныеРемонтыОборудования КАК торо_НормативныеРемонтыОборудования
	|ГДЕ
	|	торо_НормативныеРемонтыОборудования.ВидРемонта = &ВидРемонта
	|	И торо_НормативныеРемонтыОборудования.ОбъектРемонта = &Ссылка
	|			И торо_НормативныеРемонтыОборудования.Приоритет";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("ВидРемонта", ВРНачалоЦикла);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Периодичность = Выборка.ПериодичностьРемонтныхРабот;
		КолПериодов = Выборка.КоличествоПериодов;
		
		Если Не ЗначениеЗаполнено(Периодичность) Или Не ЗначениеЗаполнено(КолПериодов) Тогда
			
			РассчитатьПоНаработке = ПроверитьЗаполненностьПараметровНаработки(ТабПараметрыНаработкиОбъектовРемонта);
			Если РассчитатьПоНаработке Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КалендарныеГрафики.ДатаГрафика) КАК Дата
				|ИЗ
				|	РегистрСведений.КалендарныеГрафики КАК КалендарныеГрафики
				|ГДЕ
				|	КалендарныеГрафики.ДатаГрафика МЕЖДУ НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
				|	И КалендарныеГрафики.Календарь = &График
				|	И КалендарныеГрафики.ДеньВключенВГрафик";
				
				Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
				Запрос.УстановитьПараметр("График", Объект.ПлановыйГрафикРаботы);
				
				Выборка = Запрос.Выполнить().Выбрать();
				
				Если Выборка.Следующий() Тогда
					КолвоРабДнейВМесяце = Выборка.Дата;
					Если КолвоРабДнейВМесяце = 0 Тогда
						ТекстСообщения = НСтр("es='del trabajo en el mes corriente';ru='Не заполнен плановый график работы за текущий месяц';en='The planned work schedule for the current month is not filled'");
						ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
						Возврат Неопределено;
					КонецЕсли;
				КонецЕсли;
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	&Ссылка КАК ОбъектРемонта,
				|	ТабПараметрыНаработки.Показатель,
				|	ТабПараметрыНаработки.Период,
				|	ТабПараметрыНаработки.ПлановаяНаработка,
				|	ТабПараметрыНаработки.ПериодПлановойНаработки,
				|	ТабПараметрыНаработки.ПродолжительностьПериодаПлановойНаработки,
				|	ТабПараметрыНаработки.КоэффициентИспользованияОборудования
				|ПОМЕСТИТЬ
				|	ТабПараметрыНаработки
				|ИЗ
				|	&ТабПараметрыНаработки КАК ТабПараметрыНаработки
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	МИНИМУМ(ВЫБОР                     
				|			КОГДА торо_ПараметрыНаработкиОбъектовРемонта.ПериодПлановойНаработки = ЗНАЧЕНИЕ(Перечисление.Периодичность.День)
				|				ТОГДА торо_ПараметрыНаработкиОбъектовРемонта.ПлановаяНаработка / торо_ПараметрыНаработкиОбъектовРемонта.ПродолжительностьПериодаПлановойНаработки
				|			КОГДА торо_ПараметрыНаработкиОбъектовРемонта.ПериодПлановойНаработки = ЗНАЧЕНИЕ(Перечисление.Периодичность.Неделя)
				|				ТОГДА торо_ПараметрыНаработкиОбъектовРемонта.ПлановаяНаработка / торо_ПараметрыНаработкиОбъектовРемонта.ПродолжительностьПериодаПлановойНаработки / 7
				|			КОГДА торо_ПараметрыНаработкиОбъектовРемонта.ПериодПлановойНаработки = ЗНАЧЕНИЕ(Перечисление.Периодичность.Декада)
				|				ТОГДА торо_ПараметрыНаработкиОбъектовРемонта.ПлановаяНаработка / торо_ПараметрыНаработкиОбъектовРемонта.ПродолжительностьПериодаПлановойНаработки / 10
				|			КОГДА торо_ПараметрыНаработкиОбъектовРемонта.ПериодПлановойНаработки = ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
				|				ТОГДА торо_ПараметрыНаработкиОбъектовРемонта.ПлановаяНаработка / торо_ПараметрыНаработкиОбъектовРемонта.ПродолжительностьПериодаПлановойНаработки / 28
				|			КОГДА торо_ПараметрыНаработкиОбъектовРемонта.ПериодПлановойНаработки = ЗНАЧЕНИЕ(Перечисление.Периодичность.Квартал)
				|				ТОГДА торо_ПараметрыНаработкиОбъектовРемонта.ПлановаяНаработка / торо_ПараметрыНаработкиОбъектовРемонта.ПродолжительностьПериодаПлановойНаработки / 90
				|			КОГДА торо_ПараметрыНаработкиОбъектовРемонта.ПериодПлановойНаработки = ЗНАЧЕНИЕ(Перечисление.Периодичность.Полугодие)
				|				ТОГДА торо_ПараметрыНаработкиОбъектовРемонта.ПлановаяНаработка / торо_ПараметрыНаработкиОбъектовРемонта.ПродолжительностьПериодаПлановойНаработки / 182
				|			КОГДА торо_ПараметрыНаработкиОбъектовРемонта.ПериодПлановойНаработки = ЗНАЧЕНИЕ(Перечисление.Периодичность.Год)
				|				ТОГДА торо_ПараметрыНаработкиОбъектовРемонта.ПлановаяНаработка / торо_ПараметрыНаработкиОбъектовРемонта.ПродолжительностьПериодаПлановойНаработки / 365
				|		КОНЕЦ) КАК МаксНаработкаВДень
				|ПОМЕСТИТЬ НаработкаВДень
				|ИЗ
				|	ТабПараметрыНаработки КАК торо_ПараметрыНаработкиОбъектовРемонта
				|ГДЕ
				|	торо_ПараметрыНаработкиОбъектовРемонта.ОбъектРемонта = &Ссылка
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КалендарныеГрафики.ДатаГрафика) КАК Дата
				|ПОМЕСТИТЬ КоличествоДнейВМесяце
				|ИЗ
				|	РегистрСведений.КалендарныеГрафики КАК КалендарныеГрафики
				|ГДЕ
				|	КалендарныеГрафики.ДатаГрафика МЕЖДУ НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
				|	И КалендарныеГрафики.Календарь = &График
				|	И КалендарныеГрафики.ДеньВключенВГрафик
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	торо_СпособыПланированияРемонтныхРаботПараметрыНаработки.ЗначениеПараметраНаработки
				|ПОМЕСТИТЬ ПараметрНаработки
				|ИЗ
				|	Справочник.торо_СпособыПланированияРемонтныхРабот.ПараметрыНаработки КАК торо_СпособыПланированияРемонтныхРаботПараметрыНаработки
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_НормативныеРемонтыОборудования КАК торо_НормативныеРемонтыОборудования
				|		ПО торо_СпособыПланированияРемонтныхРаботПараметрыНаработки.Ссылка = торо_НормативныеРемонтыОборудования.СпособПланирования
				|ГДЕ
				|	торо_НормативныеРемонтыОборудования.ВидРемонта = &ВидРемонта
				|	И торо_НормативныеРемонтыОборудования.ОбъектРемонта = &Ссылка
				|	И торо_НормативныеРемонтыОборудования.Приоритет
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	isnull(ПараметрНаработки.ЗначениеПараметраНаработки / НаработкаВДень.МаксНаработкаВДень / КоличествоДнейВМесяце.Дата, 0) КАК МесяцевНаработки
				|ИЗ
				|	ПараметрНаработки КАК ПараметрНаработки,
				|	КоличествоДнейВМесяце КАК КоличествоДнейВМесяце,
				|	НаработкаВДень КАК НаработкаВДень";
				
				Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
				Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
				Запрос.УстановитьПараметр("График", Объект.ПлановыйГрафикРаботы);
				Запрос.УстановитьПараметр("ВидРемонта", ВРНачалоЦикла);
				Запрос.УстановитьПараметр("ТабПараметрыНаработки", ТабПараметрыНаработкиОбъектовРемонта);
				
				резЗапроса = Запрос.Выполнить();
				Выборка = резЗапроса.Выбрать();
				
				Если Выборка.Следующий() Тогда
					КолПериодов = Цел(Выборка.МесяцевНаработки) + 1;
					Периодичность = Перечисления.Периодичность.Месяц;
				КонецЕсли;
				
			Иначе
				Возврат Неопределено;
			КонецЕсли;
			
		КонецЕсли;
		
		Если Периодичность = Перечисления.Периодичность.Год И ((Год(ДатаПланирования) + 3*КолПериодов) > 3999) Тогда
			ТекстСообщения = НСтр("es='En el modo de la planificación es indicado demasiado el gran significado de la periodicidad. ¡Comprueben los ajustes de la planificación!';ru='В способе планирования указано слишком большое значение периодичности. Проверьте настройки планирования!';en='In the planning method, the frequency value is too high. Check your planning settings!'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат Неопределено;                                                                                                                    
		КонецЕсли;
			
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ДОБАВИТЬКДАТЕ(&ДатаНачала, " + Строка(Периодичность) + ", " + Формат(?(КолПериодов = 0, 1, КолПериодов)*3,"ЧГ=0") + ") КАК ДатаОкончания";
		
		Запрос.УстановитьПараметр("ДатаНачала", ДатаПланирования);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			
			Возврат НачалоДня(Выборка.ДатаОкончания)-1;
		Иначе
			Возврат '39991231235959';
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область Запчасти

&НаСервереБезКонтекста
Функция ЗаполнитьТабЗапчастейОбъектовРемонта(Ссылка)
	
	СтруктураДанных = Новый Структура();
	
	Если НЕ Ссылка.Пустая() Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	торо_Запчасти.ОбъектРемонта,
		               |	торо_Запчасти.Номенклатура,
		               |	торо_Запчасти.Качество,
		               |	торо_Запчасти.Характеристика,
		               |	торо_Запчасти.ТиповойОР,
		               |	торо_Запчасти.Количество,
		               |	ВЫБОР
		               |		КОГДА торо_Запчасти.ТиповойОР = ЗНАЧЕНИЕ(Справочник.торо_ТиповыеОР.ПустаяСсылка)
		               |			ТОГДА ЛОЖЬ
		               |		ИНАЧЕ ИСТИНА
		               |	КОНЕЦ КАК ИзТипового,
		               |	ВЫБОР
		               |		КОГДА торо_ЗапчастиУдаленные.ОбъектРемонта ЕСТЬ NULL 
		               |			ТОГДА ЛОЖЬ
		               |		ИНАЧЕ ИСТИНА
		               |	КОНЕЦ КАК Удален
		               |ИЗ
		               |	РегистрСведений.торо_Запчасти КАК торо_Запчасти
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗапчастиУдаленные КАК торо_ЗапчастиУдаленные
		               |		ПО торо_Запчасти.ОбъектРемонта = торо_ЗапчастиУдаленные.ОбъектРемонта
		               |			И торо_Запчасти.Номенклатура = торо_ЗапчастиУдаленные.Номенклатура
		               |			И торо_Запчасти.Характеристика = торо_ЗапчастиУдаленные.Характеристика
		               |			И торо_Запчасти.ТиповойОР = торо_ЗапчастиУдаленные.ТиповойОР
		               |ГДЕ
		               |	торо_Запчасти.ОбъектРемонта = &ОбъектРемонта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	торо_НормыЗапчастейНаОбъектыРемонта.ОбъектРемонта,
		               |	торо_НормыЗапчастейНаОбъектыРемонта.Номенклатура,
		               |	торо_НормыЗапчастейНаОбъектыРемонта.ВидРемонта,
		               |	торо_НормыЗапчастейНаОбъектыРемонта.ТиповойОР,
		               |	торо_НормыЗапчастейНаОбъектыРемонта.Количество,
		               |	торо_НормыЗапчастейНаОбъектыРемонта.Характеристика,
		               |	ВЫБОР
		               |		КОГДА торо_НормыЗапчастейНаОбъектыРемонта.ТиповойОР = ЗНАЧЕНИЕ(Справочник.торо_ТиповыеОР.ПустаяСсылка)
		               |			ТОГДА ЛОЖЬ
		               |		ИНАЧЕ ИСТИНА
		               |	КОНЕЦ КАК ИзТипового,
		               |	ВЫБОР
		               |		КОГДА торо_НормыЗапчастейНаОбъектыРемонтаУдаленные.ОбъектРемонта ЕСТЬ NULL 
		               |			ТОГДА ЛОЖЬ
		               |		ИНАЧЕ ИСТИНА
		               |	КОНЕЦ КАК Удален
		               |ИЗ
		               |	РегистрСведений.торо_НормыЗапчастейНаОбъектыРемонта КАК торо_НормыЗапчастейНаОбъектыРемонта
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_НормыЗапчастейНаОбъектыРемонтаУдаленные КАК торо_НормыЗапчастейНаОбъектыРемонтаУдаленные
		               |		ПО торо_НормыЗапчастейНаОбъектыРемонта.ОбъектРемонта = торо_НормыЗапчастейНаОбъектыРемонтаУдаленные.ОбъектРемонта
		               |			И торо_НормыЗапчастейНаОбъектыРемонта.Номенклатура = торо_НормыЗапчастейНаОбъектыРемонтаУдаленные.Номенклатура
		               |			И торо_НормыЗапчастейНаОбъектыРемонта.Характеристика = торо_НормыЗапчастейНаОбъектыРемонтаУдаленные.Характеристика
		               |			И торо_НормыЗапчастейНаОбъектыРемонта.ТиповойОР = торо_НормыЗапчастейНаОбъектыРемонтаУдаленные.ТиповойОР
		               |ГДЕ
		               |	торо_НормыЗапчастейНаОбъектыРемонта.ОбъектРемонта = &ОбъектРемонта";
		
		Запрос.УстановитьПараметр("ОбъектРемонта", Ссылка);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		МассивНормЗапчастей = Новый Массив;
		
		Если НЕ МассивРезультатов[0].Пустой() Тогда
			
			МассивЗапчастей = Новый Массив;
			Выборка = МассивРезультатов[0].Выбрать();
			Пока Выборка.Следующий() Цикл
				
				СтруктураПараметр = Новый Структура("ОбъектРемонта,Номенклатура,Качество,Характеристика,
													|Количество,ТиповойОР,Удален,ИзТипового");
				ЗаполнитьЗначенияСвойств(СтруктураПараметр,Выборка);				
				
				МассивЗапчастей.Добавить(СтруктураПараметр);
				
			КонецЦикла;
			
			СтруктураДанных.Вставить("Запчасти",МассивЗапчастей);
			
		КонецЕсли;
		
		Если НЕ МассивРезультатов[1].Пустой() Тогда
			
			МассивНормЗапчастей = Новый Массив;
			
			Выборка = МассивРезультатов[1].Выбрать();
			Пока Выборка.Следующий() Цикл
				
				СтруктураПараметр = Новый Структура("ОбъектРемонта,Номенклатура,ВидРемонта,Количество,
													|ТиповойОР,ИзТипового, Удален, Характеристика");
				ЗаполнитьЗначенияСвойств(СтруктураПараметр,Выборка);
				
				МассивНормЗапчастей.Добавить(СтруктураПараметр);
				
			КонецЦикла;
			
			СтруктураДанных.Вставить("НормаЗапчастей",МассивНормЗапчастей);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктураДанных;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗаполнитьИсториюЗапчастейОРНаСервере(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	торо_ИсторияЗапчастейОбъектаРемонта.Регистратор КАК Ремонт,
	|	торо_ИсторияЗапчастейОбъектаРемонта.ОбъектРемонта,
	|	торо_ИсторияЗапчастейОбъектаРемонта.Запчасть,
	|	торо_ИсторияЗапчастейОбъектаРемонта.СерийныйНомер,
	|	торо_ИсторияЗапчастейОбъектаРемонта.СтатусДвиженияЗЧ,
	|	торо_ИсторияЗапчастейОбъектаРемонта.Количество,
	|	торо_ИсторияЗапчастейОбъектаРемонта.Установлена,
	|	торо_ИсторияЗапчастейОбъектаРемонта.Запчасть.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	торо_ИсторияЗапчастейОбъектаРемонта.Период КАК ДатаЗамены
	|ИЗ
	|	РегистрСведений.торо_ИсторияЗапчастейОбъектаРемонта КАК торо_ИсторияЗапчастейОбъектаРемонта
	|ГДЕ
	|	торо_ИсторияЗапчастейОбъектаРемонта.ОбъектРемонта = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивВозврата = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураПараметр = Новый Структура("Ремонт,ОбъектРемонта,Запчасть,СерийныйНомер,СтатусДвиженияЗЧ,
											|Количество,Установлена,ЕдиницаИзмерения,ДатаЗамены");
		ЗаполнитьЗначенияСвойств(СтруктураПараметр,Выборка);
		
		МассивВозврата.Добавить(СтруктураПараметр);
		
	КонецЦикла;
	
	Возврат МассивВозврата;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЗапчастиИзТиповогоОР(ТиповойОР)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_ТиповыеОРЗапчасти.Номенклатура КАК Номенклатура,
	               |	торо_ТиповыеОРЗапчасти.Количество КАК Количество,
	               |	торо_ТиповыеОРЗапчасти.Характеристика КАК Характеристика,
	               |	торо_ТиповыеОРЗапчасти.Качество КАК Качество
	               |ИЗ
	               |	Справочник.торо_ТиповыеОР.Запчасти КАК торо_ТиповыеОРЗапчасти
	               |ГДЕ
	               |	торо_ТиповыеОРЗапчасти.Ссылка = &ТиповойОР
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	торо_ТиповыеОРНормативныеЗатратыПриТОиР.Номенклатура КАК Номенклатура,
	               |	торо_ТиповыеОРНормативныеЗатратыПриТОиР.ВидРемонта КАК ВидРемонта,
	               |	торо_ТиповыеОРНормативныеЗатратыПриТОиР.Количество КАК Количество,
	               |	торо_ТиповыеОРНормативныеЗатратыПриТОиР.Характеристика КАК Характеристика
	               |ИЗ
	               |	Справочник.торо_ТиповыеОР.НормативныеЗатратыПриТОиР КАК торо_ТиповыеОРНормативныеЗатратыПриТОиР
	               |ГДЕ
	               |	торо_ТиповыеОРНормативныеЗатратыПриТОиР.Ссылка = &ТиповойОР";
	   
	Запрос.УстановитьПараметр("ТиповойОР", ТиповойОР);
	
	Результат = Запрос.ВыполнитьПакет();
	стрВозврата = Новый Структура;
	
	Если НЕ Результат[0].Пустой() Тогда
		Выборка = Результат[0].Выбрать();
		мВозврата = Новый массив;
		
		Пока Выборка.Следующий() Цикл
			СтруктураПараметр = Новый Структура("Номенклатура, Количество, Характеристика, Качество");					
			ЗаполнитьЗначенияСвойств(СтруктураПараметр,Выборка);
			мВозврата.Добавить(СтруктураПараметр);
		КонецЦикла;
			
		стрВозврата.Вставить("Запчасти", мВозврата);
	КонецЕсли;
	
	Если НЕ Результат[1].Пустой() Тогда
		Выборка = Результат[1].Выбрать();
		мВозврата = Новый массив;
		
		Пока Выборка.Следующий() Цикл
			
			СтруктураПараметр = Новый Структура("Номенклатура, Количество, ВидРемонта, Характеристика");			
			ЗаполнитьЗначенияСвойств(СтруктураПараметр,Выборка);
			мВозврата.Добавить(СтруктураПараметр);
		КонецЦикла;
			
		стрВозврата.Вставить("НормативныеЗатраты", мВозврата);
	КонецЕсли;
	
	возврат стрВозврата;
		
КонецФункции

&НаСервере
Процедура ЗаписатьЗапчасти(ТекОбъект, Отказ)
	
	Если МодифицированностьЗапчастейОР или МодифицированностьНормативныхЗатратПоЗапчастям Тогда	
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	торо_Запчасти.Номенклатура КАК Номенклатура,
		               |	торо_Запчасти.Качество КАК Качество,
		               |	торо_Запчасти.Характеристика КАК Характеристика,
		               |	торо_Запчасти.ТиповойОР КАК ТиповойОР,
		               |	торо_Запчасти.Количество КАК Количество
		               |ПОМЕСТИТЬ ВТ_ЗапчастиТОР
		               |ИЗ
		               |	РегистрСведений.торо_Запчасти КАК торо_Запчасти
		               |ГДЕ
		               |	торо_Запчасти.ОбъектРемонта = &ОбъектРемонта
		               |	И торо_Запчасти.ТиповойОР = &ТиповойОР
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	таб.Номенклатура КАК Номенклатура,
		               |	таб.Качество КАК Качество,
		               |	таб.Характеристика КАК Характеристика,
		               |	таб.ТиповойОР КАК ТиповойОР,
		               |	таб.Количество КАК Количество,
		               |	таб.ИзТипового КАК ИзТипового,
		               |	таб.Удален КАК Удален
		               |ПОМЕСТИТЬ ВТ_ЗапчастиОР
		               |ИЗ
		               |	&Запчасти_ОР КАК таб
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	торо_НормыЗапчастейНаОбъектыРемонта.Номенклатура КАК Номенклатура,
		               |	торо_НормыЗапчастейНаОбъектыРемонта.ВидРемонта КАК ВидРемонта,
		               |	торо_НормыЗапчастейНаОбъектыРемонта.ТиповойОР КАК ТиповойОР,
		               |	торо_НормыЗапчастейНаОбъектыРемонта.Характеристика КАК Характеристика,
		               |	торо_НормыЗапчастейНаОбъектыРемонта.Количество КАК Количество
		               |ПОМЕСТИТЬ ВТ_ВР_ТОР
		               |ИЗ
		               |	РегистрСведений.торо_НормыЗапчастейНаОбъектыРемонта КАК торо_НормыЗапчастейНаОбъектыРемонта
		               |ГДЕ
		               |	торо_НормыЗапчастейНаОбъектыРемонта.ОбъектРемонта = &ОбъектРемонта
		               |	И торо_НормыЗапчастейНаОбъектыРемонта.ТиповойОР = &ТиповойОР
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	таб.Номенклатура КАК Номенклатура,
		               |	таб.ВидРемонта КАК ВидРемонта,
		               |	таб.ТиповойОР КАК ТиповойОР,
		               |	таб.Характеристика КАК Характеристика,
		               |	таб.Количество КАК Количество,
		               |	таб.ИзТипового КАК ИзТипового,
		               |	таб.Удален КАК Удален
		               |ПОМЕСТИТЬ ВТ_ВР_ОР
		               |ИЗ
		               |	&ВР_ОР КАК таб
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЕСТЬNULL(ВТ_ЗапчастиТОР.Номенклатура, ВТ_ЗапчастиОР.Номенклатура) КАК Номенклатура,
		               |	ЕСТЬNULL(ВТ_ЗапчастиТОР.Качество, ВТ_ЗапчастиОР.Качество) КАК Качество,
		               |	ЕСТЬNULL(ВТ_ЗапчастиТОР.Характеристика, ВТ_ЗапчастиОР.Характеристика) КАК Характеристика,
		               |	ЕСТЬNULL(ВТ_ЗапчастиТОР.Количество, ВТ_ЗапчастиОР.Количество) КАК Количество,
		               |	ВЫБОР
		               |		КОГДА НЕ ВТ_ЗапчастиТОР.Номенклатура ЕСТЬ NULL
		               |			ТОГДА ВТ_ЗапчастиТОР.ТиповойОР
		               |		ИНАЧЕ ВЫБОР
		               |				КОГДА ВТ_ЗапчастиОР.ТиповойОР = &ТиповойОР
		               |					ТОГДА ВТ_ЗапчастиОР.ТиповойОР
		               |				ИНАЧЕ &ПустойТОР
		               |			КОНЕЦ
		               |	КОНЕЦ КАК ТиповойОР,
		               |	ВЫБОР
		               |		КОГДА НЕ ВТ_ЗапчастиТОР.Номенклатура ЕСТЬ NULL
		               |			ТОГДА ИСТИНА
		               |		ИНАЧЕ ВЫБОР
		               |				КОГДА ВТ_ЗапчастиОР.ТиповойОР = &ТиповойОР
		               |					ТОГДА ИСТИНА
		               |				ИНАЧЕ ЛОЖЬ
		               |			КОНЕЦ
		               |	КОНЕЦ КАК ИзТипового,
		               |	ВЫБОР
		               |		КОГДА (НЕ(ВТ_ЗапчастиТОР.Номенклатура ЕСТЬ NULL
		               |						ИЛИ ВТ_ЗапчастиОР.Номенклатура ЕСТЬ NULL)
		               |				ИЛИ ВТ_ЗапчастиОР.ТиповойОР = &ТиповойОР)
		               |				И ВТ_ЗапчастиОР.Удален
		               |			ТОГДА ИСТИНА
		               |		ИНАЧЕ ЛОЖЬ
		               |	КОНЕЦ КАК Удален
		               |ПОМЕСТИТЬ ВТ_Запчасти
		               |ИЗ
		               |	ВТ_ЗапчастиТОР КАК ВТ_ЗапчастиТОР
		               |		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ЗапчастиОР КАК ВТ_ЗапчастиОР
		               |		ПО ВТ_ЗапчастиТОР.Номенклатура = ВТ_ЗапчастиОР.Номенклатура
		               |			И ВТ_ЗапчастиТОР.Качество = ВТ_ЗапчастиОР.Качество
		               |			И ВТ_ЗапчастиТОР.Характеристика = ВТ_ЗапчастиОР.Характеристика
		               |			И ВТ_ЗапчастиТОР.Количество = ВТ_ЗапчастиОР.Количество
		               |ГДЕ
		               |	(НЕ(ВТ_ЗапчастиТОР.Номенклатура ЕСТЬ NULL
		               |					И ЕСТЬNULL(ВТ_ЗапчастиОР.Удален, ЛОЖЬ))
		               |			ИЛИ ВТ_ЗапчастиОР.ТиповойОР = &ТиповойОР)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_Запчасти.Номенклатура КАК Номенклатура,
		               |	ВТ_Запчасти.Характеристика КАК Характеристика,
		               |	СУММА(1) КАК КоличествоСтрок
		               |ПОМЕСТИТЬ ВТ_ДублиВЗапчастях
		               |ИЗ
		               |	ВТ_Запчасти КАК ВТ_Запчасти
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВТ_Запчасти.Номенклатура,
		               |	ВТ_Запчасти.Характеристика
		               |
		               |ИМЕЮЩИЕ
		               |	СУММА(1) > 1
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_Запчасти.Номенклатура КАК Номенклатура,
		               |	ВТ_Запчасти.Качество КАК Качество,
		               |	ВТ_Запчасти.Характеристика КАК Характеристика,
		               |	ВТ_Запчасти.Количество КАК Количество,
		               |	ВТ_Запчасти.ТиповойОР КАК ТиповойОР,
		               |	ВТ_Запчасти.ИзТипового КАК ИзТипового,
		               |	ВЫБОР
		               |		КОГДА ВТ_ДублиВЗапчастях.Номенклатура ЕСТЬ NULL
		               |			ТОГДА ВТ_Запчасти.Удален
		               |		ИНАЧЕ ИСТИНА
		               |	КОНЕЦ КАК Удален
		               |ПОМЕСТИТЬ ВТ_Запчасти_Промежуточная
		               |ИЗ
		               |	ВТ_Запчасти КАК ВТ_Запчасти
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДублиВЗапчастях КАК ВТ_ДублиВЗапчастях
		               |		ПО ВТ_Запчасти.Номенклатура = ВТ_ДублиВЗапчастях.Номенклатура
		               |			И ВТ_Запчасти.Характеристика = ВТ_ДублиВЗапчастях.Характеристика
		               |			И (ВТ_Запчасти.ИзТипового)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЕСТЬNULL(ВТ_ВР_ТОР.Номенклатура, ВТ_ВР_ОР.Номенклатура) КАК Номенклатура,
		               |	ЕСТЬNULL(ВТ_ВР_ТОР.ВидРемонта, ВТ_ВР_ОР.ВидРемонта) КАК ВидРемонта,
		               |	ЕСТЬNULL(ВТ_ВР_ТОР.Характеристика, ВТ_ВР_ОР.Характеристика) КАК Характеристика,
		               |	ЕСТЬNULL(ВТ_ВР_ТОР.Количество, ВТ_ВР_ОР.Количество) КАК Количество,
		               |	ВЫБОР
		               |		КОГДА НЕ ВТ_ВР_ТОР.Номенклатура ЕСТЬ NULL
		               |			ТОГДА ВТ_ВР_ТОР.ТиповойОР
		               |		ИНАЧЕ ВЫБОР
		               |				КОГДА ВТ_ВР_ОР.ТиповойОР ЕСТЬ NULL
		               |					ТОГДА &ПустойТОР
		               |				ИНАЧЕ ВТ_ВР_ОР.ТиповойОР
		               |			КОНЕЦ
		               |	КОНЕЦ КАК ТиповойОР,
		               |	ВТ_ВР_ОР.ИзТипового КАК ИзТипового,
		               |	ВЫБОР
		               |		КОГДА НЕ(ВТ_ВР_ТОР.Номенклатура ЕСТЬ NULL
		               |						ИЛИ ВТ_ВР_ОР.Номенклатура ЕСТЬ NULL)
		               |				И ВТ_ВР_ОР.Удален
		               |			ТОГДА ИСТИНА
		               |		ИНАЧЕ ЛОЖЬ
		               |	КОНЕЦ КАК Удален
		               |ПОМЕСТИТЬ ВТ_ВР
		               |ИЗ
		               |	ВТ_ВР_ТОР КАК ВТ_ВР_ТОР
		               |		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ВР_ОР КАК ВТ_ВР_ОР
		               |		ПО ВТ_ВР_ТОР.Номенклатура = ВТ_ВР_ОР.Номенклатура
		               |			И ВТ_ВР_ТОР.ВидРемонта = ВТ_ВР_ОР.ВидРемонта
		               |			И ВТ_ВР_ТОР.Характеристика = ВТ_ВР_ОР.Характеристика
		               |			И ВТ_ВР_ТОР.Количество = ВТ_ВР_ОР.Количество
		               |ГДЕ
		               |	НЕ(ВТ_ВР_ТОР.Номенклатура ЕСТЬ NULL
		               |				И ЕСТЬNULL(ВТ_ВР_ОР.Удален, ЛОЖЬ))
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ВР.Номенклатура КАК Номенклатура,
		               |	ВТ_ВР.ВидРемонта КАК ВидРемонта,
		               |	ВТ_ВР.Характеристика КАК Характеристика,
		               |	СУММА(1) КАК КоличествоСтрок
		               |ПОМЕСТИТЬ Вт_ДублиВВР
		               |ИЗ
		               |	ВТ_ВР КАК ВТ_ВР
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВТ_ВР.Номенклатура,
		               |	ВТ_ВР.ВидРемонта,
		               |	ВТ_ВР.Характеристика
		               |
		               |ИМЕЮЩИЕ
		               |	СУММА(1) > 1
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ВР.Номенклатура КАК Номенклатура,
		               |	ВТ_ВР.ВидРемонта КАК ВидРемонта,
		               |	ВТ_ВР.Характеристика КАК Характеристика,
		               |	ВТ_ВР.Количество КАК Количество,
		               |	ВТ_ВР.ТиповойОР КАК ТиповойОР,
		               |	ВТ_ВР.ИзТипового КАК ИзТипового,
		               |	ВЫБОР
		               |		КОГДА Вт_ДублиВВР.Номенклатура ЕСТЬ NULL
		               |			ТОГДА ВТ_ВР.Удален
		               |		ИНАЧЕ ИСТИНА
		               |	КОНЕЦ КАК Удален
		               |ПОМЕСТИТЬ ВТ_ВР_Финальная
		               |ИЗ
		               |	ВТ_ВР КАК ВТ_ВР
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Вт_ДублиВВР КАК Вт_ДублиВВР
		               |		ПО ВТ_ВР.Номенклатура = Вт_ДублиВВР.Номенклатура
		               |			И ВТ_ВР.ВидРемонта = Вт_ДублиВВР.ВидРемонта
		               |			И ВТ_ВР.Характеристика = Вт_ДублиВВР.Характеристика
		               |			И (ВТ_ВР.ИзТипового)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЕСТЬNULL(ВТ_Запчасти.Номенклатура, ВТ_ВР.Номенклатура) КАК Номенклатура,
		               |	ЕСТЬNULL(ВТ_Запчасти.Качество, &ПустоеКачество) КАК Качество,
		               |	ЕСТЬNULL(ВТ_Запчасти.Характеристика, ВТ_ВР.Характеристика) КАК Характеристика,
		               |	МАКСИМУМ(ЕСТЬNULL(ВТ_Запчасти.Количество, ВТ_ВР.Количество)) КАК Количество,
		               |	ЕСТЬNULL(ВТ_Запчасти.ТиповойОР, &ПустойТОР) КАК ТиповойОР,
		               |	ЕСТЬNULL(ВТ_Запчасти.ИзТипового, ЛОЖЬ) КАК ИзТипового,
		               |	ЕСТЬNULL(ВТ_Запчасти.Удален, ЛОЖЬ) КАК Удален,
		               |	МАКСИМУМ(ВЫБОР
		               |			КОГДА ЕСТЬNULL(ВТ_ВР.Удален, ИСТИНА)
		               |				ТОГДА 0
		               |			ИНАЧЕ ВТ_ВР.Количество
		               |		КОНЕЦ) КАК КоличествоДляПроверки
		               |ИЗ
		               |	ВТ_Запчасти_Промежуточная КАК ВТ_Запчасти
		               |		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ВР_Финальная КАК ВТ_ВР
		               |		ПО ВТ_Запчасти.Номенклатура = ВТ_ВР.Номенклатура
		               |			И ВТ_Запчасти.Характеристика = ВТ_ВР.Характеристика
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЕСТЬNULL(ВТ_Запчасти.Удален, ЛОЖЬ),
		               |	ЕСТЬNULL(ВТ_Запчасти.ТиповойОР, &ПустойТОР),
		               |	ЕСТЬNULL(ВТ_Запчасти.Номенклатура, ВТ_ВР.Номенклатура),
		               |	ЕСТЬNULL(ВТ_Запчасти.ИзТипового, ЛОЖЬ),
		               |	ЕСТЬNULL(ВТ_Запчасти.Характеристика, ВТ_ВР.Характеристика),
		               |	ЕСТЬNULL(ВТ_Запчасти.Качество, &ПустоеКачество)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ВР_Финальная.Номенклатура КАК Номенклатура,
		               |	ВТ_ВР_Финальная.ВидРемонта КАК ВидРемонта,
		               |	ВТ_ВР_Финальная.Характеристика КАК Характеристика,
		               |	ВТ_ВР_Финальная.Количество КАК Количество,
		               |	ВТ_ВР_Финальная.ТиповойОР КАК ТиповойОР,
		               |	ВТ_ВР_Финальная.ИзТипового КАК ИзТипового,
		               |	ВТ_ВР_Финальная.Удален КАК Удален
		               |ИЗ
		               |	ВТ_ВР_Финальная КАК ВТ_ВР_Финальная";
					   
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
					   
		Запрос.УстановитьПараметр("ОбъектРемонта", Объект.Ссылка);
		Запрос.УстановитьПараметр("ТиповойОР", ?(ЗначениеЗаполнено(Объект.ТиповойОР),Объект.ТиповойОР, Неопределено));
		Запрос.УстановитьПараметр("Запчасти_ОР", ТабЗапчастейОбъектовРемонта.Выгрузить());
		Запрос.УстановитьПараметр("ВР_ОР", ТабЗатратПоВидамРемонта.Выгрузить());
		Запрос.УстановитьПараметр("ПустоеКачество", Перечисления.ГрадацииКачества.ПустаяСсылка());
		Запрос.УстановитьПараметр("ПустойТОР", Справочники.торо_ТиповыеОР.ПустаяСсылка());
		
		Результат = Запрос.ВыполнитьПакет();
		Запчасти = Результат[10].выгрузить();
		ВидРемонтов = Результат[11].выгрузить();
		
		Попытка
			
			Если МодифицированностьЗапчастейОР Тогда
				НаборЗаписейДействующие = РегистрыСведений.торо_Запчасти.СоздатьНаборЗаписей();
				НаборЗаписейДействующие.Отбор.ОбъектРемонта.Установить(ТекОбъект);
				НаборЗаписейУдаленные	= РегистрыСведений.торо_ЗапчастиУдаленные.СоздатьНаборЗаписей();
				НаборЗаписейУдаленные.Отбор.ОбъектРемонта.Установить(ТекОбъект);
			КонецЕсли;
			
			масОшибок = Новый Массив;
			Для Каждого СтрокаЗапчастей Из Запчасти Цикл
				
				Если СтрокаЗапчастей.Количество < СтрокаЗапчастей.КоличествоДляПроверки Тогда
					ШаблонОшибки = НСтр("es='La cantidad de los gastos normativos por la nomenclatura ""%1"" supera la cantidad de la nomenclatura. ¡La anotación era anulada!';ru='Количество нормативных затрат по номенклатуре ""%1"" превышает количество номенклатуры. Запись была отменена!';en='The amount of standard costs for item ""%1"" exceeds the number of items. Recording has been canceled!'");
					масОшибок.Добавить(СтрШаблон(ШаблонОшибки, СтрокаЗапчастей.Номенклатура));
				КонецЕсли;
				
				Если МодифицированностьЗапчастейОР Тогда
					Если НЕ ЗначениеЗаполнено(СтрокаЗапчастей.ТиповойОР) Тогда
						
						НС = НаборЗаписейДействующие.Добавить();
						ЗаполнитьЗначенияСвойств(НС,СтрокаЗапчастей);
						НС.ОбъектРемонта = ТекОбъект;
						НС.Приоритет = Истина;
						
					ИначеЕсли СтрокаЗапчастей.Удален Тогда
						
						НС = НаборЗаписейДействующие.Добавить();
						ЗаполнитьЗначенияСвойств(НС,СтрокаЗапчастей);
						НС.ОбъектРемонта = ТекОбъект;
						НС.Приоритет = Ложь;
						
						НС = НаборЗаписейУдаленные.Добавить();
						ЗаполнитьЗначенияСвойств(НС,СтрокаЗапчастей,"ТиповойОР,Номенклатура,Характеристика");
						НС.ОбъектРемонта = ТекОбъект;
						
					Иначе	
						
						НС = НаборЗаписейДействующие.Добавить();
						ЗаполнитьЗначенияСвойств(НС,СтрокаЗапчастей);
						НС.ОбъектРемонта = ТекОбъект;
						НС.Приоритет = ТабЗапчастейОбъектовРемонта.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, ТиповойОР",
						СтрокаЗапчастей.Номенклатура, СтрокаЗапчастей.Характеристика, Справочники.торо_ТиповыеОР.ПустаяСсылка())).Количество() = 0;
						
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			
			Для каждого ТекОшибка из масОшибок цикл
				ОбщегоНазначения.СообщитьПользователю(ТекОшибка,,,,Отказ);
			КонецЦикла;
			
			Если Отказ Тогда 
				Возврат; 
			КонецЕсли;
			
			Если МодифицированностьЗапчастейОР Тогда
				НаборЗаписейДействующие.Записать();
				НаборЗаписейУдаленные.Записать();
			КонецЕсли;
			
			МодифицированностьЗапчастейОР = Ложь;
		Исключение
			ТекстСообщения = НСтр("es='No consiguió anotar las partes de recambio: ';ru='Не удалось записать запчасти: ';en='Failed to write spare parts: '") + ОписаниеОшибки();
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Возврат;
		КонецПопытки;
		
	КонецЕсли;
	
	Если МодифицированностьНормативныхЗатратПоЗапчастям Тогда		
		
		Попытка
			
			НаборЗаписейДействующие = РегистрыСведений.торо_НормыЗапчастейНаОбъектыРемонта.СоздатьНаборЗаписей();
			НаборЗаписейДействующие.Отбор.ОбъектРемонта.Установить(ТекОбъект);
			НаборЗаписейУдаленные	= РегистрыСведений.торо_НормыЗапчастейНаОбъектыРемонтаУдаленные.СоздатьНаборЗаписей();
			НаборЗаписейУдаленные.Отбор.ОбъектРемонта.Установить(ТекОбъект);
			
			Для Каждого СтрокаЗапчастей Из ВидРемонтов Цикл
				
				Если НЕ ЗначениеЗаполнено(СтрокаЗапчастей.ТиповойОР) Тогда
					
					НС = НаборЗаписейДействующие.Добавить();
					ЗаполнитьЗначенияСвойств(НС,СтрокаЗапчастей);
					НС.ОбъектРемонта = ТекОбъект;
					НС.Приоритет = Истина;
					
				ИначеЕсли СтрокаЗапчастей.Удален Тогда
					
					НС = НаборЗаписейДействующие.Добавить();
					ЗаполнитьЗначенияСвойств(НС,СтрокаЗапчастей);
					НС.ОбъектРемонта = ТекОбъект;
					НС.Приоритет = Ложь;
					
					НС = НаборЗаписейУдаленные.Добавить();
					ЗаполнитьЗначенияСвойств(НС,СтрокаЗапчастей,"ТиповойОР,Номенклатура,ВидРемонта, Характеристика");
					НС.ОбъектРемонта = ТекОбъект;
					
				Иначе	
					
					НС = НаборЗаписейДействующие.Добавить();
					ЗаполнитьЗначенияСвойств(НС,СтрокаЗапчастей);
					НС.ОбъектРемонта = ТекОбъект;
					
					СтруктураПараметр = Новый Структура("Номенклатура,ВидРемонта,Характеристика");
					ЗаполнитьЗначенияСвойств(СтруктураПараметр,СтрокаЗапчастей);
					СтруктураПараметр.Вставить("ТиповойОР",Справочники.торо_ТиповыеОР.ПустаяСсылка());					
					
					НС.Приоритет = ТабЗатратПоВидамРемонта.НайтиСтроки(СтруктураПараметр).Количество() = 0;
					
				КонецЕсли;
				
			КонецЦикла;
			
			НаборЗаписейДействующие.Записать();
			НаборЗаписейУдаленные.Записать();
			
			МодифицированностьНормативныхЗатратПоЗапчастям = Ложь;
			
		Исключение
			ТекстСообщения = НСтр("es='No consiguió anotar las partes de recambio: ';ru='Не удалось записать запчасти: ';en='Failed to write spare parts: '") + ОписаниеОшибки();
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Возврат;
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция УстановитьОтборДляТЧТабЗатратПоВидамРемонта(ТекущаяНоменклатура, ТекущаяХарактеристика)
	
	Если Элементы.ТабЗапчастейОбъектовРемонтаПоказыватьУдаленныеЗапчасти.Пометка = Истина Тогда
		Струк = Новый Структура("Номенклатура, Характеристика", ТекущаяНоменклатура, ТекущаяХарактеристика);
	Иначе
		Струк = Новый Структура("Номенклатура, Характеристика, Удален", 
			ТекущаяНоменклатура, ТекущаяХарактеристика, Элементы.ТабЗапчастейОбъектовРемонтаПоказыватьУдаленныеЗапчасти.Пометка);
	КонецЕсли;
	СтруктураОтбора = Новый ФиксированнаяСтруктура(Струк);
	
	возврат СтруктураОтбора;
	
КонецФункции

&НаКлиенте
Процедура УдалитьСвязанныеСтрокиПоЗапчастям(Запчасть, Характеристика)
	
	СтрокиНормативов = ТабЗатратПоВидамРемонта.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, ИзТипового",
		Запчасть, Характеристика, Ложь));
	
	Для Каждого Стр Из СтрокиНормативов Цикл
		ТабЗатратПоВидамРемонта.Удалить(Стр);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере 
Процедура ДобавитьНоменклатуруИзПодбора(Адрес)
	
	Если НЕ ЭтоАдресВременногоХранилища(Адрес) Тогда
		Возврат;
	КонецЕсли;
	
	Тз = ПолучитьИзВременногоХранилища(Адрес);
	СтруктураДействий = Новый Структура;
	Для каждого текСтрока из Тз Цикл
		
		НайС = ТабЗапчастейОбъектовРемонта.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", текСтрока.Номенклатура, текСтрока.Характеристика));
		КоэфУпаковкиВыбр = ?(ЗначениеЗаполнено(текСтрока.Упаковка), текСтрока.Упаковка.Коэффициент, 1);

		Если НайС.Количество() = 0 Тогда
			нс = ТабЗапчастейОбъектовРемонта.Добавить();
			ЗаполнитьЗначенияСвойств(нс, текСтрока);
			нс.Количество = текСтрока.КоличествоУпаковок * КоэфУпаковкиВыбр;
			нс.ОбъектРемонта = Параметры.Ключ; 
		Иначе
			выбСтрока = НайС[0];
			выбСтрока.Количество = выбСтрока.Количество + текСтрока.КоличествоУпаковок * КоэфУпаковкиВыбр;
		КонецЕсли;
		
	КонецЦикла;
	
	МодифицированностьЗапчастейОР = Истина;
	МодифицированностьНормативныхЗатратПоЗапчастям = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОценкаРискМенеджмента

&НаСервере
Процедура ЗаполнитьДанныеОбИзмененииРМ(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если РезультатЗакрытия <> Неопределено Тогда
		//КолонкиТЧ = "НомерСтроки, Период, ВидРемонта, Сезон, ВероятностьВыходаИзСтроя, Ущерб";
		РезультатТаблица = Новый ТаблицаЗначений;
		РезультатТаблица.Колонки.Добавить("НомерСтроки");
		РезультатТаблица.Колонки.Добавить("Период");
		РезультатТаблица.Колонки.Добавить("ВидРемонта");
		РезультатТаблица.Колонки.Добавить("Сезон");
		РезультатТаблица.Колонки.Добавить("ВероятностьВыходаИзСтроя");
		РезультатТаблица.Колонки.Добавить("Ущерб");
		Для каждого Элемент Из РезультатЗакрытия Цикл
			НовСтрока = РезультатТаблица.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, Элемент);
		КонецЦикла; 
		Для каждого Строка Из ТаблицаОценокРМ Цикл
			НайденныеСтроки = РезультатТаблица.НайтиСтроки(Новый Структура("НомерСтроки", ТаблицаОценокРМ.Индекс(Строка)+1));
			Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				ЗаполнитьЗначенияСвойств(Строка, НайденнаяСтрока);
			КонецЦикла;
		КонецЦикла;
		Для каждого Строка Из РСНЗТаблицаОценокРМ Цикл
			НайденныеСтроки = РезультатТаблица.НайтиСтроки(Новый Структура("НомерСтроки", РСНЗТаблицаОценокРМ.Индекс(Строка)+1));
			Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				ЗаполнитьЗначенияСвойств(Строка, НайденнаяСтрока);
			КонецЦикла;
		КонецЦикла;		
		ТаблицаОценокРММодифицированность = Истина;
		Модифицированность = Модифицированность Или ТаблицаОценокРММодифицированность;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьОценкиРМ(ОтображатьИсторию = Истина)
	
	Если ОтображатьИсторию Тогда
		ТаблицаОценокРМ.Загрузить(РСНЗТаблицаОценокРМ.Выгрузить());
	Иначе
		
		СписокОтбора = Новый СписокЗначений;
		СписокОтбора.Добавить(Объект.Ссылка);
		СписокОтбора.Добавить(Объект.ТиповойОР);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	торо_РМРемонтов.ВидРемонта КАК ВидРемонта,
		               |	торо_РМРемонтов.ГруппаОбъектовРемонтов КАК ГруппаОбъектовРемонтов,
		               |	торо_РМРемонтов.Период КАК Период,
		               |	торо_РМРемонтов.Сезон КАК Сезон,
		               |	торо_РМРемонтов.ВероятностьВыходаИзСтроя КАК ВероятностьВыходаИзСтроя,
		               |	торо_РМРемонтов.Ущерб КАК Ущерб
		               |ПОМЕСТИТЬ РСНаборЗаписей
		               |ИЗ
		               |	&РСНаборЗаписей КАК торо_РМРемонтов
		               |ГДЕ
		               |	торо_РМРемонтов.Период <= &КонецПериода
		               |	И торо_РМРемонтов.Период >= &НачалоПериода
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	торо_РМРемонтов.ВидРемонта КАК ВидРемонта,
		               |	торо_РМРемонтов.ГруппаОбъектовРемонтов КАК ГруппаОбъектовРемонтов,
		               |	МАКСИМУМ(торо_РМРемонтов.Период) КАК Период,
		               |	торо_РМРемонтов.Сезон КАК Сезон
		               |ПОМЕСТИТЬ ДатыСреза
		               |ИЗ
		               |	РСНаборЗаписей КАК торо_РМРемонтов
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	торо_РМРемонтов.ГруппаОбъектовРемонтов,
		               |	торо_РМРемонтов.ВидРемонта,
		               |	торо_РМРемонтов.Сезон
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	РСНаборЗаписей.ГруппаОбъектовРемонтов КАК ГруппаОбъектовРемонтов,
		               |	РСНаборЗаписей.ВидРемонта КАК ВидРемонта,
		               |	РСНаборЗаписей.Сезон КАК Сезон,
		               |	РСНаборЗаписей.Период КАК Период,
		               |	РСНаборЗаписей.ВероятностьВыходаИзСтроя КАК ВероятностьВыходаИзСтроя,
		               |	РСНаборЗаписей.Ущерб КАК Ущерб,
		               |	ВЫБОР
		               |		КОГДА РСНаборЗаписей.ГруппаОбъектовРемонтов ССЫЛКА Справочник.торо_ТиповыеОР
		               |			ТОГДА ИСТИНА
		               |		ИНАЧЕ ЛОЖЬ
		               |	КОНЕЦ КАК ТиповойОР
		               |ИЗ
		               |	ДатыСреза КАК ДатыСреза
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РСНаборЗаписей КАК РСНаборЗаписей
		               |		ПО ДатыСреза.ГруппаОбъектовРемонтов = РСНаборЗаписей.ГруппаОбъектовРемонтов
		               |			И ДатыСреза.ВидРемонта = РСНаборЗаписей.ВидРемонта
		               |			И ДатыСреза.Сезон = РСНаборЗаписей.Сезон
		               |			И ДатыСреза.Период = РСНаборЗаписей.Период
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Период";
		
		Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ТекущаяДата()));
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ТекущаяДата()));
		Запрос.УстановитьПараметр("РСНаборЗаписей", РСНЗТаблицаОценокРМ.Выгрузить());
		
		Результат = Запрос.Выполнить();
		ТаблицаОценокРМ.Загрузить(Результат.Выгрузить());
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПрочитатьОценкиРМ(ОР, ТиповойОР)
	
	Запрос = Новый Запрос;		   
				   
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	торо_РМРемонтов.ВидРемонта КАК ВидРемонта,
	               |	торо_РМРемонтов.ГруппаОбъектовРемонтов КАК ГруппаОбъектовРемонтов,
	               |	торо_РМРемонтов.Период КАК Период,
	               |	торо_РМРемонтов.Сезон КАК Сезон,
	               |	торо_РМРемонтов.ВероятностьВыходаИзСтроя КАК ВероятностьВыходаИзСтроя,
	               |	торо_РМРемонтов.Ущерб КАК Ущерб,
	               |	ВЫБОР
	               |		КОГДА торо_РМРемонтов.ГруппаОбъектовРемонтов ССЫЛКА Справочник.торо_ТиповыеОР
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ТиповойОР
	               |ПОМЕСТИТЬ БезСортировки
	               |ИЗ
	               |	РегистрСведений.торо_РМРемонтов КАК торо_РМРемонтов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ТиповыеОР.НормативныеРемонты КАК торо_ТиповыеОРНормативныеРемонты
	               |		ПО торо_РМРемонтов.ГруппаОбъектовРемонтов = торо_ТиповыеОРНормативныеРемонты.Ссылка
	               |			И торо_РМРемонтов.ВидРемонта = торо_ТиповыеОРНормативныеРемонты.ВидРемонта
	               |ГДЕ
	               |	(торо_РМРемонтов.ГруппаОбъектовРемонтов = &ТиповойОР
	               |			ИЛИ торо_РМРемонтов.ГруппаОбъектовРемонтов = &ОР)
	               |	И ВЫБОР
	               |			КОГДА &ТиповойОР <> ЗНАЧЕНИЕ(Справочник.торо_ТиповыеОР.ПустаяСсылка)
	               |				ТОГДА торо_ТиповыеОРНормативныеРемонты.Статус = ЗНАЧЕНИЕ(Перечисление.торо_СтатусыНормативныхРемонтовИТехКарт.Действует)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &ТиповойОР <> ЗНАЧЕНИЕ(Справочник.торо_ТиповыеОР.ПустаяСсылка)
	               |				ТОГДА торо_ТиповыеОРНормативныеРемонты.Ссылка = &ТиповойОР
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	торо_РМРемонтов.ВидРемонта,
	               |	торо_РМРемонтов.ГруппаОбъектовРемонтов,
	               |	торо_РМРемонтов.Период,
	               |	торо_РМРемонтов.Сезон,
	               |	торо_РМРемонтов.ВероятностьВыходаИзСтроя,
	               |	торо_РМРемонтов.Ущерб,
	               |	ЛОЖЬ
	               |ИЗ
	               |	РегистрСведений.торо_РМРемонтов КАК торо_РМРемонтов
	               |ГДЕ
	               |	торо_РМРемонтов.ГруппаОбъектовРемонтов = &ОР
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	БезСортировки.ВидРемонта КАК ВидРемонта,
	               |	БезСортировки.ГруппаОбъектовРемонтов КАК ГруппаОбъектовРемонтов,
	               |	БезСортировки.Период КАК Период,
	               |	БезСортировки.Сезон КАК Сезон,
	               |	БезСортировки.ВероятностьВыходаИзСтроя КАК ВероятностьВыходаИзСтроя,
	               |	БезСортировки.Ущерб КАК Ущерб,
	               |	БезСортировки.ТиповойОР КАК ТиповойОР
	               |ИЗ
	               |	БезСортировки КАК БезСортировки
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период";
				   
	Запрос.УстановитьПараметр("ОР", ОР);
	Запрос.УстановитьПараметр("ТиповойОР", ТиповойОР);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	МассивСтруктур = Новый Массив;
	Пока Выборка.Следующий() Цикл
		
		СтруктураРМ = Новый Структура("ВидРемонта, ГруппаОбъектовРемонтов, Период, Сезон, ВероятностьВыходаИзСтроя, Ущерб, ТиповойОР");
		ЗаполнитьЗначенияСвойств(СтруктураРМ, Выборка);
		МассивСтруктур.Добавить(СтруктураРМ);
		
	КонецЦикла;
	
	Возврат МассивСтруктур;
	
КонецФункции

&НаСервере
Процедура ЗаписатьОценкиРМ(ТекОбъект, Отказ)
	
	Если ТаблицаОценокРММодифицированность Тогда
		
		Для каждого Строка из РСНЗТаблицаОценокРМ Цикл
			Если НЕ ЗначениеЗаполнено(Строка.ГруппаОбъектовРемонтов) Тогда
				Строка.ГруппаОбъектовРемонтов = ТекОбъект;
			КонецЕсли;
		КонецЦикла;
		
		Попытка
			
			ТаблицаЗначенийОценокРМ = РСНЗТаблицаОценокРМ.Выгрузить();
			МассивСтрокОценокРМ = ТаблицаЗначенийОценокРМ.НайтиСтроки(Новый Структура("ГруппаОбъектовРемонтов", ТекОбъект));
			ТаблицаБуфер = ТаблицаЗначенийОценокРМ.Скопировать(МассивСтрокОценокРМ);
			
			НаборНормативов = РегистрыСведений.торо_РМРемонтов.СоздатьНаборЗаписей();
			НаборНормативов.Отбор.ГруппаОбъектовРемонтов.Установить(ТекОбъект);
			НаборНормативов.Загрузить(ТаблицаБуфер);
			НаборНормативов.Записать();
			
			ТаблицаОценокРММодифицированность = Ложь;
			
		Исключение
			ТекстСообщения = НСтр("es='No consiguió anotar las normas de los trabajos de reparación: ';ru='Не удалось записать нормативы ремонтных работ: ';en='Failed to write repair standards: '") + ОписаниеОшибки();
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область КоэффициентыРемонтныхОсобенностей

&НаСервере
Процедура ОбновитьКоэффициентыРемонтныхОсобенностей()
	
	Перем МассивКоэффициентов;
	
	РассчитываемыеКоэффициенты.Очистить();
	УстанавливаемыеКоэффициенты.Очистить();
	
	МассивКоэффициентов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_ЗначенияКоэффициентовРемонтныхОсобенностейСрезПоследних.ВидКоэффициента КАК Ссылка,
	|	торо_ЗначенияКоэффициентовРемонтныхОсобенностейСрезПоследних.ЗначениеКоэффициента,
	|	торо_ВидыКоэффициентовРемонтныхОсобенностей.Рассчитываемый,
	|	торо_ВидыКоэффициентовРемонтныхОсобенностей.ЗависитОтНаработки,
	|	торо_ВидыКоэффициентовРемонтныхОсобенностей.СчитатьВозрастОтДатыИзготовления,
	|	торо_ВидыКоэффициентовРемонтныхОсобенностей.УчитыватьГрафикРаботыОборудования,
	|	торо_ВидыКоэффициентовРемонтныхОсобенностей.УчитыватьПростоиОборудования,
	|	торо_ВидыКоэффициентовРемонтныхОсобенностей.ПараметрНаработки
	|ИЗ
	|	РегистрСведений.торо_ЗначенияКоэффициентовРемонтныхОсобенностей.СрезПоследних(&ТекущаяДата, ОбъектРемонта = &ОбъектРемонта И Использование) КАК торо_ЗначенияКоэффициентовРемонтныхОсобенностейСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ВидыКоэффициентовРемонтныхОсобенностей КАК торо_ВидыКоэффициентовРемонтныхОсобенностей
	|		ПО торо_ЗначенияКоэффициентовРемонтныхОсобенностейСрезПоследних.ВидКоэффициента = торо_ВидыКоэффициентовРемонтныхОсобенностей.Ссылка
	|ГДЕ
	|	НЕ торо_ВидыКоэффициентовРемонтныхОсобенностей.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ОбъектРемонта", Объект.Ссылка);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Рассчитываемый Тогда
			Если Выборка.ЗависитОтНаработки Тогда
				
				НаработкаОР = Справочники.торо_ОбъектыРемонта.ВычислитьТекущееЗначениеНаработки(Объект.Ссылка, Выборка.ПараметрНаработки, Выборка.УчитыватьПростоиОборудования);
				Если НЕ НаработкаОР = Неопределено Тогда
					СтруктураКоэффициент = Справочники.торо_ОбъектыРемонта.ПолучитьРассчитываемыйКоэффициент(НаработкаОР, Выборка.Ссылка);
					Если НЕ СтруктураКоэффициент = Неопределено Тогда
						
						НС = РассчитываемыеКоэффициенты.Добавить();
						НС.ВидКоэффициента = Выборка.Ссылка;
						НС.ЗначениеКоэффициента = СтруктураКоэффициент.ЗначениеКоэффициента;
						НС.Коэффициент = СтруктураКоэффициент.Коэффициент;
						
						МассивКоэффициентов.Добавить(СтруктураКоэффициент.Коэффициент);
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Если Выборка.УчитыватьГрафикРаботыОборудования Тогда
					ВозрастОР = Справочники.торо_ОбъектыРемонта.ВычислитьВремяРаботыОборудованияСУчетомГрафика(Объект.Ссылка, Выборка.СчитатьВозрастОтДатыИзготовления);	
				Иначе
					Если Выборка.СчитатьВозрастОтДатыИзготовления Тогда
						ВозрастОР = Год(ТекущаяДата()) - Год(Объект.ДатаВыпуска) + 1;
					Иначе
						ВозрастОР = Год(ТекущаяДата()) - Год(Объект.ДатаВводаВЭксплуатацию) + 1;
					КонецЕсли;
				КонецЕсли;
				
				СтруктураКоэффициент = Справочники.торо_ОбъектыРемонта.ПолучитьРассчитываемыйКоэффициент(ВозрастОР, Выборка.Ссылка);
				Если НЕ СтруктураКоэффициент = Неопределено Тогда
					
					НС = РассчитываемыеКоэффициенты.Добавить();
					НС.ВидКоэффициента = Выборка.Ссылка;
					НС.ЗначениеКоэффициента = СтруктураКоэффициент.ЗначениеКоэффициента;
					НС.Коэффициент = СтруктураКоэффициент.Коэффициент;
					
					МассивКоэффициентов.Добавить(СтруктураКоэффициент.Коэффициент);
				КонецЕсли;
				
			КонецЕсли;
		Иначе
			НС = УстанавливаемыеКоэффициенты.Добавить();
			НС.ВидКоэффициента = Выборка.Ссылка;
			НС.ЗначениеКоэффициента = Выборка.ЗначениеКоэффициента;
			НС.Коэффициент = Выборка.ЗначениеКоэффициента.Коэффициент;
			
			МассивКоэффициентов.Добавить(НС.Коэффициент);
		КонецЕсли;
	КонецЦикла;
	
	ИтогКоэф = 1;
	Для каждого Элем Из МассивКоэффициентов Цикл
		
		ИтогКоэф = ИтогКоэф * Элем;
		
	КонецЦикла; 
	
	Если НЕ МассивКоэффициентов.Количество() = 0 Тогда
		ИтоговыйКоэффициент = ИтогКоэф;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОсновноеИЗависимоеОборудование

&НаКлиенте
Процедура ИнициализироватьОсновноеЗависимоеОборудование()
	
	ВкладкаОсновноеЗависимоеОткрывалась = Истина;
	
	Если НормативныеРемонты.Количество() = 0 Тогда 
		ЗаполнитьНормативныеРемонты();
	КонецЕсли;
	
	ЗаполнитьОсновныеИЗависимыеРемонты();
	
	ВыбраноОсновное = ОсновноеОборудование.ПолучитьЭлементы().Количество() <> 0 Или ЗависимоеОборудование.ПолучитьЭлементы().Количество() = 0; 
	ВыборОсновногоЗависимого = ?(ВыбраноОсновное, "Основное", "Зависимое");
	
	УстановитьВидимостьЭлементовФормыОсновноеЗависимое();
	ЗаполнитьОсновныеИЗависимыеРемонтыНаФорме();
	УстановитьКоличествоОсновногоЗависимогоОборудования();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОсновныеИЗависимыеРемонты()
	
	ОсновноеОборудование.ПолучитьЭлементы().Очистить();
	ЗависимоеОборудование.ПолучитьЭлементы().Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	торо_РемонтыОсновногоЗависимогоОборудования.ОсновнойОбъектРемонта КАК ОбъектРемонта,
	|	торо_РемонтыОсновногоЗависимогоОборудования.ВидРемонтаЗависимогоОбъекта КАК ВидРемонтаЭтогоОбъекта,
	|	торо_РемонтыОсновногоЗависимогоОборудования.ВидРемонтаОсновногоОбъекта КАК ВидРемонтаСвязанногоОбъекта,
	
	|ИЗ
	|	РегистрСведений.торо_РемонтыОсновногоЗависимогоОборудования КАК торо_РемонтыОсновногоЗависимогоОборудования
	|ГДЕ
	|	торо_РемонтыОсновногоЗависимогоОборудования.СвязанныйОбъектРемонта = &ОбъектРемонта";
	
	
	Запрос.УстановитьПараметр("ОбъектРемонта", Объект.Ссылка);

	ВыборкаПоОР = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ОбъектРемонта");
	Пока ВыборкаПоОР.Следующий() Цикл
		СтрокаОР = ОсновноеОборудование.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаОР, ВыборкаПоОР);
		
		ВыборкаПоВР = ВыборкаПоОР.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоВР.Следующий() Цикл
			СтрокаВР = СтрокаОР.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаВР, ВыборкаПоВР);
			
			ВыборкаДеталей = ВыборкаПоВР.Выбрать(ОбходРезультатаЗапроса.Прямой);
			Пока ВыборкаДеталей.Следующий() Цикл
				СтрокаДеталей = СтрокаВР.ПолучитьЭлементы().Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДеталей, ВыборкаДеталей);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	торо_РемонтыОсновногоЗависимогоОборудования.СвязанныйОбъектРемонта КАК ОбъектРемонта,
	|	торо_РемонтыОсновногоЗависимогоОборудования.ВидРемонтаОсновногоОбъекта КАК ВидРемонтаЭтогоОбъекта,
	|	торо_РемонтыОсновногоЗависимогоОборудования.ВидРемонтаЗависимогоОбъекта КАК ВидРемонтаСвязанногоОбъекта
	
	|ИЗ
	|	РегистрСведений.торо_РемонтыОсновногоЗависимогоОборудования КАК торо_РемонтыОсновногоЗависимогоОборудования
	|ГДЕ
	|	торо_РемонтыОсновногоЗависимогоОборудования.ОсновнойОбъектРемонта = &ОбъектРемонта";
	
	
	Запрос.УстановитьПараметр("ОбъектРемонта", Объект.Ссылка);

	ВыборкаПоОР = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ОбъектРемонта");
	Пока ВыборкаПоОР.Следующий() Цикл
		СтрокаОР = ЗависимоеОборудование.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаОР, ВыборкаПоОР);
		
		ВыборкаПоВР = ВыборкаПоОР.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоВР.Следующий() Цикл
			СтрокаВР = СтрокаОР.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаВР, ВыборкаПоВР);
			
			ВыборкаДеталей = ВыборкаПоВР.Выбрать(ОбходРезультатаЗапроса.Прямой);
			Пока ВыборкаДеталей.Следующий() Цикл
				СтрокаДеталей = СтрокаВР.ПолучитьЭлементы().Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДеталей, ВыборкаДеталей);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте  
Процедура УстановитьВидимостьЭлементовФормыОсновноеЗависимое()
	
	Если ВыбраноОсновное Тогда
		ЗаголовокТЧ = НСтр("es='Los tipos de la reparación del objeto básico';ru='Виды ремонта основного объекта';en='Types of repair of the main facility'");
		ЗаголовокКолонки = НСтр("es='El tipo de la reparación del objeto básico';ru='Вид ремонта основного объекта';en='Type of repair of the main facility'");
	Иначе
		ЗаголовокТЧ = НСтр("es='Los tipos de la reparación del objeto dependiente';ru='Виды ремонта зависимого объекта';en='Types of repair of a dependent facility'");
		ЗаголовокКолонки = НСтр("es='El tipo de la reparación del objeto dependiente';ru='Вид ремонта зависимого объекта';en='Type of repair of the dependent facility'");
	КонецЕсли; 
	
	Элементы.ВидыРемонтаОсновногоСвязанного.Заголовок = ЗаголовокТЧ;
	Элементы.ВидыРемонтаОсновногоСвязанногоВидРемонтаСвязанногоОбъекта.Заголовок = ЗаголовокКолонки;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОсновныеИЗависимыеРемонтыНаФорме()
	
	СписокОбъектовРемонта.Очистить();
	ВидыРемонтаЭтогоОбъекта.Очистить();
	ВидыРемонтаОсновногоСвязанного.Очистить();
	
	ДеревоДляОбхода = ?(ВыбраноОсновное, ОсновноеОборудование, ЗависимоеОборудование);
	
	Для каждого СтрокаОР из ДеревоДляОбхода.ПолучитьЭлементы() Цикл
		Строка = СписокОбъектовРемонта.Добавить();
		Строка.ОбъектРемонта = СтрокаОР.ОбъектРемонта;
		
		Для каждого СтрокаВР из СтрокаОР.ПолучитьЭлементы() Цикл
			Строка = ВидыРемонтаЭтогоОбъекта.Добавить();
			Строка.ВидРемонта = СтрокаВР.ВидРемонтаЭтогоОбъекта;
			Строка.ОбъектРемонта = СтрокаВР.ОбъектРемонта;
			
			Для каждого СтрокаДеталей из СтрокаВР.ПолучитьЭлементы() Цикл
				Строка = ВидыРемонтаОсновногоСвязанного.Добавить();
				ЗаполнитьЗначенияСвойств(Строка, СтрокаДеталей);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьКоличествоОсновногоЗависимогоОборудования()
	
	Основное = Элементы.ВыборОсновногоЗависимого.СписокВыбора.НайтиПоЗначению("Основное");
	Зависимое = Элементы.ВыборОсновногоЗависимого.СписокВыбора.НайтиПоЗначению("Зависимое");
	
	Если ВыбраноОсновное Тогда
		// >> [Деснол] [Ушаков А.Д.] [23.10.2019] 
		Основное.Представление 	= НСтр("en='Main equipment';es='El equipo principal (';ru='Основное оборудование ('") + СписокОбъектовРемонта.Количество()+ ")";
		Зависимое.Представление = НСтр("es='Dependiente del hardware (';ru='Зависимое оборудование (';en='Related products ('")  + ЗависимоеОборудование.ПолучитьЭлементы().Количество()+ ")";
	Иначе
		Зависимое.Представление = НСтр("es='Dependiente del hardware (';ru='Зависимое оборудование (';en='Related products ('")  + СписокОбъектовРемонта.Количество()+ ")";
		Основное.Представление 	= НСтр("en='Main equipment';es='El equipo principal (';ru='Основное оборудование ('") + ОсновноеОборудование.ПолучитьЭлементы().Количество()+ ")";
	//	Основное.Представление = "Основное оборудование (" + СписокОбъектовРемонта.Количество()+ ")";
	//	Зависимое.Представление = "Зависимое оборудование (" + ЗависимоеОборудование.ПолучитьЭлементы().Количество()+ ")";
	//Иначе
	//	Зависимое.Представление = "Зависимое оборудование (" + СписокОбъектовРемонта.Количество()+ ")";
	//	Основное.Представление = "Основное оборудование (" + ОсновноеОборудование.ПолучитьЭлементы().Количество()+ ")";
		// << [Деснол] [Ушаков А.Д.] [23.10.2019] 
	КонецЕсли;
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СохранитьДанныеИзЭлементовФормы(Форма)
		
	Если Форма.ВыбраноОсновное Тогда
		ДеревоДляРаботы = Форма.ОсновноеОборудование;
		ВтороеДерево = Форма.ЗависимоеОборудование;
	Иначе
		ДеревоДляРаботы = Форма.ЗависимоеОборудование;
		ВтороеДерево = Форма.ОсновноеОборудование;
	КонецЕсли; 
		
	Для каждого ВыборкаОР из Форма.СписокОбъектовРемонта Цикл
		СтрокаОР = ДеревоДляРаботы.ПолучитьЭлементы().Добавить();
		СтрокаОР.ОбъектРемонта = ВыборкаОР.ОбъектРемонта;
				
		СтрокиВидовРемонта = Форма.ВидыРемонтаЭтогоОбъекта.НайтиСтроки(Новый Структура("ОбъектРемонта", ВыборкаОР.ОбъектРемонта));
		Если СтрокиВидовРемонта.Количество() = 0 Тогда
			СтрокаВР = СтрокаОР.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаВР, СтрокаОР);
			
			СтрокаДеталей = СтрокаВР.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДеталей, СтрокаВР);
			
			НовСтр = Форма.ВидыРемонтаЭтогоОбъекта.Добавить();
			НовСтр.ОбъектРемонта = ВыборкаОР.ОбъектРемонта;
			
			НовСтр = Форма.ВидыРемонтаОсновногоСвязанного.Добавить();
			НовСтр.ОбъектРемонта = ВыборкаОР.ОбъектРемонта;
		Иначе
		
			Для каждого ВыборкаВР из СтрокиВидовРемонта Цикл
				СтрокаВР = СтрокаОР.ПолучитьЭлементы().Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаВР, СтрокаОР);
				СтрокаВР.ВидРемонтаЭтогоОбъекта = ВыборкаВР.ВидРемонта;
				
				СтрокиДеталей = Форма.ВидыРемонтаОсновногоСвязанного.НайтиСтроки(Новый Структура("ОбъектРемонта, ВидРемонтаЭтогоОбъекта",ВыборкаВР.ОбъектРемонта, ВыборкаВР.ВидРемонта));
				Если СтрокиДеталей.Количество() = 0 Тогда
					СтрокаДеталей = СтрокаВР.ПолучитьЭлементы().Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаДеталей, СтрокаВР);
					
					НовСтр = Форма.ВидыРемонтаОсновногоСвязанного.Добавить();
					НовСтр.ОбъектРемонта = ВыборкаВР.ОбъектРемонта;
					НовСтр.ВидРемонтаЭтогоОбъекта = ВыборкаВР.ВидРемонта;
				Иначе
					Для каждого ВыборкаДеталей из СтрокиДеталей Цикл
						СтрокаДеталей = СтрокаВР.ПолучитьЭлементы().Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаДеталей, СтрокаВР);
						СтрокаДеталей.ВидРемонтаСвязанногоОбъекта = ВыборкаДеталей.ВидРемонтаСвязанногоОбъекта;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		// Если мы добавили в одну из таблиц оборудования самого себя, 
		// то надо добавить себя также и во вторую таблицу, иначе при записи данные потеряются.
		// Только виды ремонта следует поменять местами.
		Если ВыборкаОР.ОбъектРемонта = Форма.Объект.Ссылка Тогда
			СтрокаОрДругая = Неопределено;
			Для каждого Строка из ВтороеДерево.ПолучитьЭлементы() Цикл
				Если Строка.ОбъектРемонта = ВыборкаОР.ОбъектРемонта Тогда
					СтрокаОрДругая = Строка;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если СтрокаОрДругая = Неопределено Тогда
				СтрокаОрДругая = ВтороеДерево.ПолучитьЭлементы().Добавить();
				СтрокаОрДругая.ОбъектРемонта = ВыборкаОР.ОбъектРемонта;
			КонецЕсли;
			
			СтрокаОрДругая.ПолучитьЭлементы().Очистить();
			
			СтрокиВР = Форма.ВидыРемонтаОсновногоСвязанного.НайтиСтроки(Новый Структура("ОбъектРемонта", ВыборкаОР.ОбъектРемонта));
			СоответсивиеВР = Новый Соответствие;
			Для каждого СтрокаВР из СтрокиВР Цикл
				ЗначениеСоответствия = СоответсивиеВР[СтрокаВР.ВидРемонтаСвязанногоОбъекта];
				Если ЗначениеСоответствия = Неопределено Тогда
					ЗначениеСоответствия = Новый Массив;
				КонецЕсли;
				
				ЗначениеСоответствия.Добавить(СтрокаВР.ВидРемонтаЭтогоОбъекта);
				
				СоответсивиеВР.Вставить(СтрокаВР.ВидРемонтаСвязанногоОбъекта, ЗначениеСоответствия);
			КонецЦикла;
			
			Для каждого КлючИЗначение из СоответсивиеВР Цикл
				СтрокаВР = СтрокаОрДругая.ПолучитьЭлементы().Добавить();
				СтрокаВР.ОбъектРемонта = ВыборкаОР.ОбъектРемонта;
				СтрокаВР.ВидРемонтаЭтогоОбъекта = КлючИЗначение.Ключ;
				
				Для каждого ВидРемонта из КлючИЗначение.Значение Цикл
					СтрокаДеталей = СтрокаВР.ПолучитьЭлементы().Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаДеталей, СтрокаВР);
					СтрокаДеталей.ВидРемонтаСвязанногоОбъекта = ВидРемонта;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОсновныеИЗависимыеПоИерархииВыбранаИерархия(ВыбраннаяИерархия, ДополнтельныеПараметры) Экспорт
	
	Если ВыбраннаяИерархия <> Неопределено Тогда
		ЗаполнитьОсновныеИЗависимыеПоИерархииНаСервере(ВыбраннаяИерархия);
		УстановитьКоличествоОсновногоЗависимогоОборудования();
		МодифицированностьОсновныхЗависимых = Истина;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОсновныеИЗависимыеПоИерархииНаСервере(СтруктураОР)
	
	Запрос = Новый Запрос;
	
	Если СтруктураОР.ИзменяетсяДокументами Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РасположениеОРВСтруктуреИерархии.%НужноеПоле% КАК Значение
		|ИЗ
		|	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(&Дата, СтруктураИерархии = &Иерархия) КАК РасположениеОРВСтруктуреИерархии
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|		ПО РасположениеОРВСтруктуреИерархии.%НужноеПоле% = торо_ОбъектыРемонта.Ссылка
		|			И НЕ торо_ОбъектыРемонта.ЭтоГруппа
		|ГДЕ
		|	НЕ РасположениеОРВСтруктуреИерархии.Удален
		|	И РасположениеОРВСтруктуреИерархии.%ОтборПоСсылке% = &Ссылка";
		
		Запрос.УстановитьПараметр("Дата", ТекущаяДата());
		Запрос.УстановитьПараметр("Иерархия", СтруктураОР);
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		
	Иначе
		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ИерархическиеСтруктурыОР.%НужноеПоле% КАК Значение
		|ИЗ
		|	РегистрСведений.торо_ИерархическиеСтруктурыОР КАК торо_ИерархическиеСтруктурыОР
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|		ПО торо_ИерархическиеСтруктурыОР.%НужноеПоле% = торо_ОбъектыРемонта.Ссылка
		|			И НЕ торо_ОбъектыРемонта.ЭтоГруппа
		|ГДЕ
		|	торо_ИерархическиеСтруктурыОР.СтруктураИерархии = &Иерархия
		|	И торо_ИерархическиеСтруктурыОР.%ОтборПоСсылке% = &Ссылка";
		
		Запрос.УстановитьПараметр("Иерархия", СтруктураОР);
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ОтборПоСсылке%", ?(ВыбраноОсновное, "ОбъектИерархии", "РодительИерархии"));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%НужноеПоле%", ?(НЕ ВыбраноОсновное, "ОбъектИерархии", "РодительИерархии"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если СписокОбъектовРемонта.НайтиСтроки(Новый Структура("ОбъектРемонта", Выборка.Значение)).Количество() = 0 Тогда
			СтрокаОР = СписокОбъектовРемонта.Добавить();
			СтрокаОР.ОбъектРемонта = Выборка.Значение;
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура("ОбъектРемонта", Выборка.Значение);
		НайденныеСтроки = ВидыРемонтаЭтогоОбъекта.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() = 0 Тогда
			СтрокаВР = ВидыРемонтаЭтогоОбъекта.Добавить();
			СтрокаВР.ОбъектРемонта = Выборка.Значение;
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура("ОбъектРемонта", Выборка.Значение);
		НайденныеСтроки = ВидыРемонтаОсновногоСвязанного.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() = 0 Тогда
			НС = ВидыРемонтаОсновногоСвязанного.Добавить();
			НС.ОбъектРемонта = Выборка.Значение;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьОсновноеЗависимоеОборудование(ТекОбъект, Отказ)
	
	Если МодифицированностьОсновныхЗависимых Тогда
		
		СохранитьДанныеИзЭлементовФормы(ЭтаФорма);
		
		ПроверитьЗацикливаниеОсновногоЗависимогоОборудованияНаСервере(Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		НаборЗаписейОсновного = РегистрыСведений.торо_РемонтыОсновногоЗависимогоОборудования.СоздатьНаборЗаписей();
		НаборЗаписейОсновного.Отбор.СвязанныйОбъектРемонта.Установить(Объект.Ссылка);
		НаборЗаписейОсновного.Прочитать();
		НаборЗаписейОсновного.Очистить();
		
		Для каждого СтрокаОР Из ОсновноеОборудование.ПолучитьЭлементы() Цикл
			Для каждого СтрокаВР Из СтрокаОР.ПолучитьЭлементы() Цикл
				Для каждого СтрокаДеталей из СтрокаВР.ПолучитьЭлементы() Цикл
					МенеджерЗаписи = НаборЗаписейОсновного.Добавить();
					
					МенеджерЗаписи.ОсновнойОбъектРемонта       = СтрокаДеталей.ОбъектРемонта;
					МенеджерЗаписи.СвязанныйОбъектРемонта      = Объект.Ссылка;
					МенеджерЗаписи.ВидРемонтаОсновногоОбъекта  = СтрокаДеталей.ВидРемонтаСвязанногоОбъекта;
					МенеджерЗаписи.ВидРемонтаЗависимогоОбъекта = СтрокаДеталей.ВидРемонтаЭтогоОбъекта;
					
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		
		Попытка
			НаборЗаписейОсновного.Записать(Истина);
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("es='La excepción';ru='Исключение';en='An exception'"), УровеньЖурналаРегистрации.Предупреждение, 
				Метаданные.Справочники.торо_ОбъектыРемонта,,ОписаниеОшибки());
		КонецПопытки; 
		
		НаборЗаписейЗависимого = РегистрыСведений.торо_РемонтыОсновногоЗависимогоОборудования.СоздатьНаборЗаписей();
		НаборЗаписейЗависимого.Отбор.ОсновнойОбъектРемонта.Установить(Объект.Ссылка);
		НаборЗаписейЗависимого.Прочитать();
		НаборЗаписейЗависимого.Очистить();
		
		Для каждого СтрокаОР Из ЗависимоеОборудование.ПолучитьЭлементы() Цикл
			Для каждого СтрокаВР Из СтрокаОР.ПолучитьЭлементы() Цикл
				Для каждого СтрокаДеталей из СтрокаВР.ПолучитьЭлементы() Цикл
					МенеджерЗаписи = НаборЗаписейЗависимого.Добавить();
					
					МенеджерЗаписи.ОсновнойОбъектРемонта       = Объект.Ссылка;
					МенеджерЗаписи.СвязанныйОбъектРемонта      = СтрокаДеталей.ОбъектРемонта;
					МенеджерЗаписи.ВидРемонтаОсновногоОбъекта  = СтрокаДеталей.ВидРемонтаЭтогоОбъекта;
					МенеджерЗаписи.ВидРемонтаЗависимогоОбъекта = СтрокаДеталей.ВидРемонтаСвязанногоОбъекта;
					
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		
		Попытка
			НаборЗаписейЗависимого.Записать(Истина);
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("es='La excepción';ru='Исключение';en='An exception'"), УровеньЖурналаРегистрации.Предупреждение, 
				Метаданные.Справочники.торо_ОбъектыРемонта,,ОписаниеОшибки());
		КонецПопытки; 	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборВТЧВидыРемонтаЭтогоОбъекта()
	
	ТекущиеДанные = Элементы.СписокОбъектовРемонта.ТекущиеДанные;
	ОбъектРемонта = ?(ТекущиеДанные = Неопределено, Неопределено, ТекущиеДанные.ОбъектРемонта);

	СтруктураДляОтбора = Новый Структура;
	СтруктураДляОтбора.Вставить("ОбъектРемонта", ОбъектРемонта);

	Элементы.ВидыРемонтаЭтогоОбъекта.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураДляОтбора);
	
	УстановитьОтборВТЧОсновныеЗависимыеРемонты();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборВТЧОсновныеЗависимыеРемонты()
	
	ТекущиеДанные = Элементы.ВидыРемонтаЭтогоОбъекта.ТекущиеДанные;
	ОбъектРемонта = ?(ТекущиеДанные = Неопределено, Неопределено, ТекущиеДанные.ОбъектРемонта);
	ВидРемонта = ?(ТекущиеДанные = Неопределено, Неопределено, ТекущиеДанные.ВидРемонта);
	
	СтруктураДляОтбора = Новый Структура;
	СтруктураДляОтбора.Вставить("ОбъектРемонта", ОбъектРемонта);
	СтруктураДляОтбора.Вставить("ВидРемонтаЭтогоОбъекта", ВидРемонта);
	
	Элементы.ВидыРемонтаОсновногоСвязанного.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураДляОтбора);
	
КонецПроцедуры

&НаКлиенте
Функция ЕстьОсновноеЗависимоеОборудованиеПоВидуРемонта(ВидРемонта)
	
	Если НЕ ЗначениеЗаполнено(ВидРемонта) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ВкладкаОсновноеЗависимоеОткрывалась 
		И ОсновноеОборудование.ПолучитьЭлементы().Количество() = 0 
		И ЗависимоеОборудование.ПолучитьЭлементы().Количество() = 0 Тогда
		ИнициализироватьОсновноеЗависимоеОборудование();
	Иначе
		СохранитьДанныеИзЭлементовФормы(ЭтаФорма);
		УстановитьКоличествоОсновногоЗависимогоОборудования();
	КонецЕсли;
	
	Для каждого СтрокаОР из ОсновноеОборудование.ПолучитьЭлементы() Цикл
		Для каждого СтрокаВР из СтрокаОР.ПолучитьЭлементы() Цикл
			Если СтрокаВР.ВидРемонтаЭтогоОбъекта = ВидРемонта Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Для каждого СтрокаОР из ЗависимоеОборудование.ПолучитьЭлементы() Цикл
		Для каждого СтрокаВР из СтрокаОР.ПолучитьЭлементы() Цикл
			Если СтрокаВР.ВидРемонтаЭтогоОбъекта = ВидРемонта Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура УдалитьОсновноеЗависимоеОборудованиеПоВидуРемонта(ВидРемонта)
	
	Если НЕ ЗначениеЗаполнено(ВидРемонта) Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьОсновноеЗависимоеОборудованиеИДереваПоВидуРемонта(ОсновноеОборудование, ВидРемонта);
	УдалитьОсновноеЗависимоеОборудованиеИДереваПоВидуРемонта(ЗависимоеОборудование, ВидРемонта);

	ЗаполнитьОсновныеИЗависимыеРемонтыНаФорме();
	УстановитьКоличествоОсновногоЗависимогоОборудования();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьОсновноеЗависимоеОборудованиеИДереваПоВидуРемонта(ДеревоДляРаботы, ВидРемонта)

	МассивДляУдаленияОР = Новый Массив;
	
	Для каждого СтрокаОР из ДеревоДляРаботы.ПолучитьЭлементы() Цикл
		МассивДляУдаленияВР = Новый Массив;
		Для каждого СтрокаВР из СтрокаОР.ПолучитьЭлементы() Цикл
			Если СтрокаВР.ВидРемонтаЭтогоОбъекта = ВидРемонта Тогда
				МассивДляУдаленияВР.Добавить(СтрокаВР);
				МодифицированностьОсновныхЗависимых = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если МассивДляУдаленияВР.Количество() > 0 Тогда
			Для каждого Строка из МассивДляУдаленияВР Цикл
				СтрокаОР.ПолучитьЭлементы().Удалить(Строка);
			КонецЦикла;
			
			Если СтрокаОР.ПолучитьЭлементы().Количество() = 0 Тогда
				МассивДляУдаленияОР.Добавить(СтрокаОР);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Строка из МассивДляУдаленияОР Цикл
		ДеревоДляРаботы.ПолучитьЭлементы().Удалить(Строка);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СписокОбъектовРемонтаОбъектРемонтаПриИзмененииИзменитьСвязанныеТЧ(ОбъектРемонтаСтарый, ОбъектРемонтаНовый)
	
	Если ОбъектРемонтаСтарый <> ОбъектРемонтаНовый Тогда
		НайденныеСтроки = ВидыРемонтаЭтогоОбъекта.НайтиСтроки(Новый Структура("ОбъектРемонта", ОбъектРемонтаСтарый));
		Для Каждого Строка Из НайденныеСтроки Цикл
			Строка.ОбъектРемонта = ОбъектРемонтаНовый;
		КонецЦикла;
		
		НайденныеСтроки = ВидыРемонтаОсновногоСвязанного.НайтиСтроки(Новый Структура("ОбъектРемонта", ОбъектРемонтаСтарый));
		Для Каждого Строка Из НайденныеСтроки Цикл
			Строка.ОбъектРемонта = ОбъектРемонтаНовый;
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВидыРемонтаЭтогоОбъектаПриИзмененииИзменитьСвязанныеТЧ(ВидРемонтаСтарый, ВидРемонтаНовый, ОбъектРемонта)
	
	Если ВидРемонтаНовый <> ВидРемонтаСтарый Тогда
		НайденныеСтроки = ВидыРемонтаОсновногоСвязанного.НайтиСтроки(Новый Структура("ВидРемонтаЭтогоОбъекта, ОбъектРемонта", ВидРемонтаСтарый, ОбъектРемонта));
		Для Каждого Строка Из НайденныеСтроки Цикл
			Строка.ВидРемонтаЭтогоОбъекта = ВидРемонтаНовый;
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗацикливаниеОсновногоЗависимогоОборудованияНаСервере(Отказ = Ложь)
	
	ПредставлениеПустогоВР = НСтр("es='<cualquier tipo de la reparación>';ru='<любой вид ремонта>';en='<любой вид ремонта>'");
	
	ТаблицаДляПроверки = ПолучитьТаблицуИзДереваДляПроверкиЗацикливания(ЗависимоеОборудование, Ложь);
	ШаблонСообщения = НСтр("es='Es descubierta la ciclación para el tipo de la reparación ""%1"" maquinarias básicas ""%2"" (¡el tipo de la reparación del objeto corriente ""%3"")!';ru='Обнаружено зацикливание для вида ремонта ""%1"" основного оборудования ""%2"" (вид ремонта текущего объекта ""%3"")!';en='A loop was found for the repair type ""%1"" of the main equipment ""%2"" (repair type for the current object ""%3"")!'");
	
	Для каждого СтрокаОР из ОсновноеОборудование.ПолучитьЭлементы() Цикл
		Для каждого СтрокаВР из СтрокаОР.ПолучитьЭлементы() Цикл
			Для каждого СтрокаДеталей из СтрокаВР.ПолучитьЭлементы() Цикл
				ЕстьЗацикливание = ПроверитьЗацикливаниеОстановочных(СтрокаДеталей.ВидРемонтаСвязанногоОбъекта, СтрокаДеталей.ВидРемонтаЭтогоОбъекта, СтрокаДеталей.ОбъектРемонта, Истина, ТаблицаДляПроверки);
				Если ЕстьЗацикливание Тогда
					ТекстСообщения = СтрШаблон(ШаблонСообщения, 
						?(ЗначениеЗаполнено(СтрокаДеталей.ВидРемонтаСвязанногоОбъекта), СтрокаДеталей.ВидРемонтаСвязанногоОбъекта, ПредставлениеПустогоВР), 
						СтрокаДеталей.ОбъектРемонта, 
						?(ЗначениеЗаполнено(СтрокаДеталей.ВидРемонтаЭтогоОбъекта), СтрокаДеталей.ВидРемонтаЭтогоОбъекта, ПредставлениеПустогоВР));
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ТаблицаДляПроверки = ПолучитьТаблицуИзДереваДляПроверкиЗацикливания(ОсновноеОборудование, Истина);
	ШаблонСообщения = НСтр("es='Es descubierta la ciclación para el tipo de la reparación ""%1"" maquinarias dependientes ""%2"" (¡el tipo de la reparación del objeto corriente ""%3"")!';ru='Обнаружено зацикливание для вида ремонта ""%1"" зависимого оборудования ""%2"" (вид ремонта текущего объекта ""%3"")!';en='A loop was found for repair type ""%1"" of dependent equipment ""%2"" (repair type for current object ""%3"")!'");
	
	Для каждого СтрокаОР из ЗависимоеОборудование.ПолучитьЭлементы() Цикл
		Для каждого СтрокаВР из СтрокаОР.ПолучитьЭлементы() Цикл
			Для каждого СтрокаДеталей из СтрокаВР.ПолучитьЭлементы() Цикл
				ЕстьЗацикливание = ПроверитьЗацикливаниеОстановочных(СтрокаДеталей.ВидРемонтаСвязанногоОбъекта, СтрокаДеталей.ВидРемонтаЭтогоОбъекта, СтрокаДеталей.ОбъектРемонта, Ложь, ТаблицаДляПроверки);
				Если ЕстьЗацикливание Тогда
					ТекстСообщения = СтрШаблон(ШаблонСообщения, 
						?(ЗначениеЗаполнено(СтрокаДеталей.ВидРемонтаСвязанногоОбъекта), СтрокаДеталей.ВидРемонтаСвязанногоОбъекта, ПредставлениеПустогоВР), 
						СтрокаДеталей.ОбъектРемонта, 
						?(ЗначениеЗаполнено(СтрокаДеталей.ВидРемонтаЭтогоОбъекта), СтрокаДеталей.ВидРемонтаЭтогоОбъекта, ПредставлениеПустогоВР));
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьЗацикливаниеОстановочных(ВыбранныйВР, ВР_ЭтогоОбъекта, ВыбранныйОР, ПроверкаДляОсновного = Истина, пТаблицаДляПроверки = Неопределено)
	
	Если пТаблицаДляПроверки <> Неопределено Тогда
		ТаблицаДляПроверки = пТаблицаДляПроверки;
	Иначе
		ТаблицаДляПроверки = ?(ПроверкаДляОсновного, 
									ПолучитьТаблицуИзДереваДляПроверкиЗацикливания(ЗависимоеОборудование, Ложь), 
									ПолучитьТаблицуИзДереваДляПроверкиЗацикливания(ОсновноеОборудование, Истина));
	КонецЕсли;
	
	Возврат Справочники.торо_ОбъектыРемонта.ПроверитьЗацикливаниеЗависимыхОстановочных(ВР_ЭтогоОбъекта, ВыбранныйВР, Объект.Ссылка, ВыбранныйОР, ПроверкаДляОсновного, пТаблицаДляПроверки);
		
КонецФункции

&НаСервере
Функция ПолучитьТаблицуИзДереваДляПроверкиЗацикливания(Дерево, ЭтоОсновное)
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ТаблицаРезультат.Колонки.Добавить("ОбъектРемонта", Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта"));
	ТаблицаРезультат.Колонки.Добавить("ВидРемонтаОсновногоОбъекта", Новый ОписаниеТипов("СправочникСсылка.торо_ВидыРемонтов"));
	ТаблицаРезультат.Колонки.Добавить("ВидРемонтаЗависимогоОбъекта", Новый ОписаниеТипов("СправочникСсылка.торо_ВидыРемонтов"));
	
	Для каждого СтрокаОР из Дерево.ПолучитьЭлементы() Цикл
		Для каждого СтрокаВР из СтрокаОР.ПолучитьЭлементы() Цикл
			Для каждого СтрокаДеталей из СтрокаВР.ПолучитьЭлементы() Цикл
				НоваяСтрока = ТаблицаРезультат.Добавить();
				НоваяСтрока.ОбъектРемонта = СтрокаДеталей.ОбъектРемонта;
				НоваяСтрока.ВидРемонтаОсновногоОбъекта = ?(ЭтоОсновное, СтрокаДеталей.ВидРемонтаСвязанногоОбъекта, СтрокаДеталей.ВидРемонтаЭтогоОбъекта);
				НоваяСтрока.ВидРемонтаЗависимогоОбъекта = ?(ЭтоОсновное, СтрокаДеталей.ВидРемонтаЭтогоОбъекта, СтрокаДеталей.ВидРемонтаСвязанногоОбъекта);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

	Возврат ТаблицаРезультат;	
	
КонецФункции

&НаКлиенте
Процедура УстановитьПараметрыВыбораВидаРемонтаосновногоСвязанного()
	
	СписокОтбора = Новый Массив;
	
	ТекДанные = Элементы.СписокОбъектовРемонта.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		СтруктураВозврата = ЗаполнитьНормативныеРемонтыНаСервере(ТекДанные.ОбъектРемонта);
		Для каждого Структура Из СтруктураВозврата Цикл
			Если НЕ Структура.Удален Тогда
				СписокОтбора.Добавить(Структура.ВидРемонта);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	МассивПараметровВыбора = Новый Массив;
	МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(СписокОтбора)));
	
	Элементы.ВидыРемонтаОсновногоСвязанногоВидРемонтаСвязанногоОбъекта.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ЖурналыДокументов

&НаСервере
Процедура УстановитьПараметрыЗапросовНаСервере()
	
	Кнопка = Элементы.ЗаявкиНаРемонтОтображатьТолькоПроведенныеЗаявки;
	ЗаявкиНаРемонт.Параметры.УстановитьЗначениеПараметра("ОтображатьТолькоПроведенные", Кнопка.Пометка);
	ЗаявкиНаРемонт.Параметры.УстановитьЗначениеПараметра("ОбъектРемонта", Объект.Ссылка);
	
	Кнопка = Элементы.ВыявленныеДефектыОтображатьТолькоПроведенныеДефекты;
	ВыявленныеДефекты.Параметры.УстановитьЗначениеПараметра("ОбъектРемонта", Объект.Ссылка);
	ВыявленныеДефекты.Параметры.УстановитьЗначениеПараметра("ОтображатьТолькоПроведенные", Кнопка.Пометка);
	
	Кнопка = Элементы.ВыполненныеРемонтыОтображатьТолькоПроведенныеАкты;
	ВыполненныеРемонты.Параметры.УстановитьЗначениеПараметра("ОтображатьТолькоПроведенные", Кнопка.Пометка);
	ВыполненныеРемонты.Параметры.УстановитьЗначениеПараметра("ОбъектРемонта", Объект.Ссылка);                             
	
	Кнопка = Элементы.ПредстоящиеРемонтыОтображатьТолькоПроведенныеППР;
	ПредстоящиеРемонты.Параметры.УстановитьЗначениеПараметра("ОтображатьТолькоПроведенные", Кнопка.Пометка);
	ПредстоящиеРемонты.Параметры.УстановитьЗначениеПараметра("ОбъектРемонта", Объект.Ссылка);
	ПредстоящиеРемонты.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ТекущаяДата());
	
	Кнопка = Элементы.ПредстоящиеРегМероприятияОтображатьТолькоПроведенныеРМ;
	ПредстоящиеРегМероприятия.Параметры.УстановитьЗначениеПараметра("ОтображатьТолькоПроведенные", Кнопка.Пометка);
	ПредстоящиеРегМероприятия.Параметры.УстановитьЗначениеПараметра("ОбъектРемонта", Объект.Ссылка);
	ПредстоящиеРегМероприятия.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ТекущаяДата());
	
	Кнопка = Элементы.НарядыОтображатьТолькоПроведенныеНаряды;
	НарядыНаВыполнениеРемонтныхРабот.Параметры.УстановитьЗначениеПараметра("ОтображатьТолькоПроведенные", Кнопка.Пометка);
	НарядыНаВыполнениеРемонтныхРабот.Параметры.УстановитьЗначениеПараметра("ОбъектРемонта", Объект.Ссылка);
	
	Кнопка = Элементы.АктыПриемкиОтображатьТолькоПроведенныеАкты;
	АктыПриемкиОборудования.Параметры.УстановитьЗначениеПараметра("ОтображатьТолькоПроведенные", Кнопка.Пометка);
	АктыПриемкиОборудования.Параметры.УстановитьЗначениеПараметра("ОбъектРемонта", Объект.Ссылка);
	
	Кнопка = Элементы.НарядыРМОтображатьТолькоПроведенные;
	НарядыНаРегМероприятия.Параметры.УстановитьЗначениеПараметра("ОтображатьТолькоПроведенные", Кнопка.Пометка);
	НарядыНаРегМероприятия.Параметры.УстановитьЗначениеПараметра("ОбъектРемонта", Объект.Ссылка);
	
	Кнопка = Элементы.ВыполненныеРМОтображатьТолькоПроведенные;
	ВыполненныеРегМероприятия.Параметры.УстановитьЗначениеПараметра("ОтображатьТолькоПроведенные", Кнопка.Пометка);
	ВыполненныеРегМероприятия.Параметры.УстановитьЗначениеПараметра("ОбъектРемонта", Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиДефектПослеВопросаОЗаписи(Результат, ДопПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		Если ЭтаФорма.Записать() Тогда
			ВвестиДефектЗавершение();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиДефектЗавершение()
	
	ЗначенияЗаполнения = Новый Структура();
	ЗначенияЗаполнения.Вставить("ОбъектРемонта", Объект.Ссылка);
		
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	ФормаДокумента = ОткрытьФорму("Документ.торо_ВыявленныеДефекты.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область Гарантии

&НаСервере
Процедура ПроверитьЗаполнениеГарантийОбъектовРемонта(Отказ)
	
	Если ГарантииОбъектаРемонта.Количество() > 0 Тогда
		СтруктураОтбора = Новый Структура("ОбъектРемонта", Объект.Ссылка);
		МассивСтрок = ГарантииОбъектаРемонта.НайтиСтроки(СтруктураОтбора);
		
		Для каждого Строка Из МассивСтрок Цикл
			
			СтрокаСОрганизациейГарантииЗаполнена = Истина;
			СтрокаСУсловиямиГарантииЗаполнена	 = Истина;
			
			Если СтрокаСУсловиямиГарантииЗаполнена И Не ЗначениеЗаполнено(Строка.УсловияГарантии) Тогда
				ТекстСообщения = НСтр("es='En la tabla de los plazos de la garantía del objeto no todos los campos en la columna <las Condiciones de la garantía> son rellenadas. La anotación no es cumplida';ru='В таблице сроков гарантии объекта не все поля в колонке <Условия гарантии> заполнены. Запись не выполнена';en='In the object warranty period table, not all fields in the <Warranty conditions> column are filled. Recording failed'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
				СтрокаСУсловиямиГарантииЗаполнена = Ложь;
			КонецЕсли;
			
			Если СтрокаСОрганизациейГарантииЗаполнена И Не ЗначениеЗаполнено(Строка.ГарантирующаяОрганизация) Тогда
				ТекстСообщения = НСтр("es='En la tabla de los plazos de la garantía del objeto no todos los campos en la columna <la organización que Garantiza> son rellenados. La anotación no es cumplida';ru='В таблице сроков гарантии объекта не все поля в колонке <Гарантирующая организация> заполнены. Запись не выполнена';en='In the object warranty period table, not all fields in the <Guarantee Organization> column are filled out. Recording failed'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
				СтрокаСОрганизациейГарантииЗаполнена = Ложь;
			КонецЕсли;
			
			Если Не СтрокаСОрганизациейГарантииЗаполнена 
				И НЕ СтрокаСУсловиямиГарантииЗаполнена Тогда
				Прервать;
			КонецЕсли; 
			
		КонецЦикла; 
	КонецЕсли;
	
	Если МодифицированностьГарантий Тогда
		Для Каждого Строка Из ГарантииОбъектаРемонта Цикл
			Строка.ДатаНачала = Строка.УсловияГарантии.ДатаНачалаГарантии;
			Строка.ДатаОкончания = Строка.УсловияГарантии.ДатаОкончанияГарантии;
		КонецЦикла;
		
		ТЗГарантий = ГарантииОбъектаРемонта.Выгрузить();
		
		Для Каждого Строка Из ТЗГарантий Цикл
			
			СтруктураОтбора = Новый Структура("ДатаНачала, ДатаОкончания", Строка.ДатаНачала, Строка.ДатаОкончания);
			НайденныеСтроки = ТЗГарантий.НайтиСтроки(СтруктураОтбора);
			
			Если ЗначениеЗаполнено(Строка.ДатаНачала) И ЗначениеЗаполнено(Строка.ДатаОкончания) 
				И Строка.ДатаНачала >= Строка.ДатаОкончания Тогда
				ШаблонСообщения = НСтр("es='¡La fecha del comienzo de la garantía %1 no puede ser más o la fecha igual de la terminación de la garantía %2!';ru='Дата начала гарантии %1 не может быть больше либо равной дате окончания гарантии %2!';en='Warranty start date%1 cannot be greater than or equal to the warranty end date%2!'");
				ТекстСообщения = СтрШаблон(ШаблонСообщения, Формат(Строка.ДатаНачала,"ДФ=dd.MM.yyyy"), Формат(Строка.ДатаОкончания,"ДФ=dd.MM.yyyy"));
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
				
			ИначеЕсли ЗначениеЗаполнено(Строка.ДатаНачала) И ЗначениеЗаполнено(Строка.ДатаОкончания) 
				И НайденныеСтроки.Количество() > 1 Тогда
				ШаблонСообщения = НСтр("es='¡El período de garantía %1 %2 coincide con otro período de garantía!';ru='Гарантийный период %1-%2 совпадает с другим гарантийным периодом!';en='The warranty period% 1-% 2 coincides with the other warranty period!'");
				ТекстСообщения = СтрШаблон(ШаблонСообщения, Формат(Строка.ДатаНачала,"ДФ=dd.MM.yyyy"), Формат(Строка.ДатаОкончания,"ДФ=dd.MM.yyyy"));
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
				
				Сч = НайденныеСтроки.ВГраница();
				Пока Сч > 0 Цикл
					ТЗГарантий.Удалить(НайденныеСтроки[Сч]);
					Сч = Сч - 1;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТабГарантий.ДатаНачала,
		|	ТабГарантий.ДатаОкончания
		|ПОМЕСТИТЬ ТабГарантий
		|ИЗ
		|	&ТабГарантий КАК ТабГарантий
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабГарантий1.ДатаНачала,
		|	ТабГарантий1.ДатаОкончания
		|ИЗ
		|	ТабГарантий КАК ТабГарантий1
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабГарантий КАК ТабГарантий2
		|		ПО (ТабГарантий1.ДатаНачала >= ТабГарантий2.ДатаНачала
		|					И ТабГарантий1.ДатаНачала <= ТабГарантий2.ДатаОкончания
		|				ИЛИ ТабГарантий1.ДатаОкончания >= ТабГарантий2.ДатаНачала
		|					И ТабГарантий1.ДатаОкончания <= ТабГарантий2.ДатаОкончания)
		|			И НЕ (ТабГарантий1.ДатаНачала = ТабГарантий2.ДатаНачала
		|			И ТабГарантий1.ДатаОкончания = ТабГарантий2.ДатаОкончания)";
		
		Запрос.УстановитьПараметр("ТабГарантий", ГарантииОбъектаРемонта.Выгрузить());
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ШаблонСообщения = НСтр("es='¡El período de garantía %1 %2 se cruza con otro período de garantía!';ru='Гарантийный период %1-%2 пересекается с другим гарантийным периодом!';en='The warranty period% 1-% 2 overlaps with another warranty period!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Формат(Выборка.ДатаНачала,"ДФ=dd.MM.yyyy"), Формат(Выборка.ДатаОкончания,"ДФ=dd.MM.yyyy"));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьГарантии(ТекОбъект, Отказ)
	
	Если МодифицированностьГарантий Тогда
		
		Для каждого Строка из ГарантииОбъектаРемонта Цикл
			Если НЕ ЗначениеЗаполнено(Строка.ОбъектРемонта) Тогда
				Строка.ОбъектРемонта = ТекОбъект;
			КонецЕсли;
		КонецЦикла;
		
		МассивСтрок = ГарантииОбъектаРемонта.НайтиСтроки(Новый Структура("ОбъектРемонта", ТекОбъект));
		
		НаборЗаписей = РегистрыСведений.торо_СрокиГарантииОбъектовРемонта.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ОбъектРемонта.Установить(ТекОбъект);
		Для каждого Строка Из МассивСтрок Цикл
			ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Строка);
		КонецЦикла;
		
		Попытка
			НаборЗаписей.Записать();
			МодифицированностьГарантий = Ложь;
		Исключение
			ТекстСообщения = НСтр("es='La anotación en el registro de las noticias <los Plazos de la garantía de los objetos de la reparación> no es cumplida.';ru='Запись в регистр сведений <Сроки гарантии объектов ремонта> не выполнена.';en='An entry in the register of information <Сроки гарантии объектов ремонта> was not performed.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецПопытки; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСнятияФлажкаГарантий(Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ГарантииОбъектаРемонта.Очистить();
		Элементы.СтраницаГарантийныеРемонты.Видимость = Ложь;
		МодифицированностьГарантий = Истина;
	Иначе
		ЕстьГарантияДляОбъекта = Истина;
	КонецЕсли; 	
КонецПроцедуры

#КонецОбласти

#Область ИсторияПеремещенияОборудования

&НаСервере
Процедура ПолучитьИсториюПеремещения()
	
	Запрос = Новый Запрос;
	
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.Период КАК Период,
			|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.Регистратор КАК Регистратор,
			|	0 КАК НомерСтроки,
			|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.ОбъектИерархии КАК ОбъектРемонта,
			|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.СтруктураИерархии КАК СтруктураИерархии,
			|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.РодительИерархии КАК РодительИерархии
			|ИЗ
			|	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии КАК торо_РасположениеОРВСтруктуреИерархииСрезПоследних
			|ГДЕ
			|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.ОбъектИерархии = &ОбъектИерархии
			|	И торо_РасположениеОРВСтруктуреИерархииСрезПоследних.СтруктураИерархии = &СтруктураИерархии
			|	И НЕ торо_РасположениеОРВСтруктуреИерархииСрезПоследних.Регистратор.Организация ЕСТЬ NULL";
	
 
	Запрос.УстановитьПараметр("ОбъектИерархии", Объект.Ссылка);
	Запрос.УстановитьПараметр("СтруктураИерархии", ВыборВидаИерархииИстория);

	ИсторияПеремещенияОборудования.Загрузить(Запрос.Выполнить().Выгрузить());
	парам = 0;
	Для Каждого ТекСтрока Из ИсторияПеремещенияОборудования Цикл
		парам = парам + 1;
		ТекСтрока.НомерСтроки = парам;
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#Область ДополнительныеРеквизиты

// СтандартныеПодсистемы.Свойства
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	СтеретьЗначенияУнаследованныхРеквизитовТиповогоОР();
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма);
	торо_УправлениеСвойствами.ПроставитьПризнакОбщегоСвойстваВТаблицеДопРеквизитов(ЭтаФорма, Неопределено);
	УнаследоватьДопРеквизитыИзТиповогоОР();
	ПривязатьОбработчикИзмененияДопРеквизитов();
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
      УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
      УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	
	ИндивидуальныйНабор = ПредопределенноеЗначение("Справочник.НаборыДополнительныхРеквизитовИСведений.Справочник_торо_ОбъектыРемонта_общие");
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПоказатьДополнительныеРеквизиты");
	
	ОткрытьФорму("Справочник.НаборыДополнительныхРеквизитовИСведений.ФормаСписка", ПараметрыФормы);
	
	ПараметрыПерехода = Новый Структура;
	ПараметрыПерехода.Вставить("Набор", ИндивидуальныйНабор);
	ПараметрыПерехода.Вставить("Свойство", Неопределено);
	ПараметрыПерехода.Вставить("ЭтоДополнительноеСведение", Ложь);
	
	Оповестить("Переход_НаборыДополнительныхРеквизитовИСведений", ПараметрыПерехода);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаСервере
Процедура УнаследоватьДопРеквизитыИзТиповогоОР()
	
	Если ПолучитьФункциональнуюОпциюФормы("ИспользоватьДополнительныеРеквизитыИСведения") <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ТиповойОР) Тогда
		СписокЗаполненныхСвойств = Новый массив;
		Для каждого СтрокаДопРеквизита из Объект.ДополнительныеРеквизиты Цикл
			Если ЗначениеЗаполнено(СтрокаДопРеквизита.Значение) Тогда
				СписокЗаполненныхСвойств.Добавить(СтрокаДопРеквизита.Свойство);
			КонецЕсли;
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = ПолучитьТекстЗапросаДляНаследованияДопРеквизитов();
		
		Запрос.УстановитьПараметр("ТиповойОР", Объект.ТиповойОР);
		Запрос.УстановитьПараметр("Свойства", СписокЗаполненныхСвойств);
		
		ВыборкаСвойств = Запрос.Выполнить().Выбрать();
		Пока ВыборкаСвойств.Следующий() Цикл
			Если НЕ ЗначениеЗаполнено(ВыборкаСвойств.Значение) Тогда
				Продолжить;
			Конецесли;
			
			СтрокаОписания = ЭтаФорма.Свойства_ОписаниеДополнительныхРеквизитов.НайтиСтроки(Новый Структура("Свойство", ВыборкаСвойств.Свойство));
			Если СтрокаОписания.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			СтрокаОписания = СтрокаОписания[0];
			
			НовСтр = УнаследованныеДопРеквизиты.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаСвойств);
			НовСтр.ИмяРеквизитаЗначение = СтрокаОписания.ИмяРеквизитаЗначение;
			
			Если ЭтаФорма.Свойства_ОтображатьЗначенияВТаблице Тогда
				СтрокиТаблицы = ЭтаФорма.Свойства_ЗначенияДополнительныхРеквизитов.НайтиСтроки(Новый Структура("Свойство", ВыборкаСвойств.Свойство));
				Для каждого ТекущиеДанные из СтрокиТаблицы Цикл 
					ТекущиеДанные.Значение = ВыборкаСвойств.Значение;
					ТекущиеДанные.ЭтоУнаследованный = Истина;
				КонецЦикла;
			Иначе
				ЭтаФорма[СтрокаОписания.ИмяРеквизитаЗначение] = ВыборкаСвойств.Значение;
				УстановитьОформлениеДопРеквизита(ЭтаФорма.Элементы[СтрокаОписания.ИмяРеквизитаЗначение], Истина);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СтеретьЗначенияУнаследованныхРеквизитовТиповогоОР()
	
	Если ПолучитьФункциональнуюОпциюФормы("ИспользоватьДополнительныеРеквизитыИСведения") <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтаФорма.Свойства_ОтображатьЗначенияВТаблице Тогда
		
		Для каждого ТекущиеДанные из ЭтаФорма.Свойства_ЗначенияДополнительныхРеквизитов Цикл
			Если ТекущиеДанные.ЭтоУнаследованный Тогда
				ТекущиеДанные.ЭтоУнаследованный = Ложь;
				ТекущиеДанные.Значение = Неопределено;
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		Для каждого СтрокаДопРеквизита из УнаследованныеДопРеквизиты Цикл
			Если ЭтаФорма[СтрокаДопРеквизита.ИмяРеквизитаЗначение] = СтрокаДопРеквизита.Значение Тогда
				ЭтаФорма[СтрокаДопРеквизита.ИмяРеквизитаЗначение] = Неопределено;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	УнаследованныеДопРеквизиты.Очистить();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстЗапросаДляНаследованияДопРеквизитов()
	
	Текст = "ВЫБРАТЬ
	|	торо_ТиповыеОРДополнительныеРеквизиты.Ссылка КАК Источник,
	|	торо_ТиповыеОРДополнительныеРеквизиты.Свойство,
	|	торо_ТиповыеОРДополнительныеРеквизиты.Значение
	|ИЗ
	|	Справочник.торо_ТиповыеОР.ДополнительныеРеквизиты КАК торо_ТиповыеОРДополнительныеРеквизиты
	|ГДЕ
	|	торо_ТиповыеОРДополнительныеРеквизиты.Ссылка = &ТиповойОР
	|	И НЕ торо_ТиповыеОРДополнительныеРеквизиты.Свойство В (&Свойства)";
	
	Возврат Текст;
	
КонецФункции

&НаСервере
Процедура ПривязатьОбработчикИзмененияДопРеквизитов()
	
	Если ПолучитьФункциональнуюОпциюФормы("ИспользоватьДополнительныеРеквизитыИСведения") <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтаФорма.Свойства_ИспользоватьСвойства Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтаФорма.Свойства_ОтображатьЗначенияВТаблице Тогда
		
		Элемент = Элементы.Свойства_ЗначенияДополнительныхРеквизитовЗначение;
		Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_ДополнительныйРеквизитПриИзменении");
		Элемент.УстановитьДействие("Очистка", "Подключаемый_ДополнительныйРеквизитОчистка");
		
	Иначе
		
		Для каждого ОписаниеДопРеквизита из ЭтаФорма.Свойства_ОписаниеДополнительныхРеквизитов Цикл
			Элемент = ЭтаФорма.Элементы[ОписаниеДопРеквизита.ИмяРеквизитаЗначение];
			Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_ДополнительныйРеквизитПриИзменении");
			Попытка
				Элемент.КнопкаОчистки = Истина;
				Элемент.УстановитьДействие("Очистка", "Подключаемый_ДополнительныйРеквизитОчистка");
			Исключение
			КонецПопытки;
		КонецЦикла; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УнаследоватьРеквизитЕслиВозможно(ИмяРеквизитаЗначение, Свойство, СтандартнаяОбработка, ИдентификаторСтроки = Неопределено)
	
	СтрокаСвоего = Объект.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", Свойство));
	Если СтрокаСвоего.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	СтрокаСвоего = СтрокаСвоего[0];
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаДляНаследованияДопРеквизитов();
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И НЕ торо_ТиповыеОРДополнительныеРеквизиты.Свойство В (&Свойства)", "И торо_ТиповыеОРДополнительныеРеквизиты.Свойство В (&Свойства)");
	
	Запрос.УстановитьПараметр("ТиповойОР", Объект.ТиповойОР);
	Запрос.УстановитьПараметр("Свойства", Свойство);

	ВыборкаСвойств = Запрос.Выполнить().Выбрать();
	Если ВыборкаСвойств.Следующий() Тогда
		Если ЗначениеЗаполнено(ВыборкаСвойств.Значение) Тогда
			Объект.ДополнительныеРеквизиты.Удалить(СтрокаСвоего);
			
			НовСтр = УнаследованныеДопРеквизиты.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаСвойств);
			НовСтр.ИмяРеквизитаЗначение = ИмяРеквизитаЗначение;
			
			Если ЭтаФорма.Свойства_ОтображатьЗначенияВТаблице Тогда
				ТекущиеДанные = ЭтаФорма.Свойства_ЗначенияДополнительныхРеквизитов.НайтиПоИдентификатору(ИдентификаторСтроки);
				ТекущиеДанные.Значение = ВыборкаСвойств.Значение;
				ТекущиеДанные.ЭтоУнаследованный = Истина;
			Иначе
				ЭтаФорма[ИмяРеквизитаЗначение] = ВыборкаСвойств.Значение;
				УстановитьОформлениеДопРеквизита(ЭтаФорма.Элементы[ИмяРеквизитаЗначение], Истина);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОформлениеДопРеквизита(Элемент, Унаследованный)
	
	Если Унаследованный Тогда
		ЦветТекста = WebЦвета.Синий; 
		ЦветЗаголовка = WebЦвета.Синий;
	Иначе
		ЦветТекста = ОбщегоНазначенияВызовСервера.ЦветСтиля("ЦветТекстаПоля");
		ЦветЗаголовка = ОбщегоНазначенияВызовСервера.ЦветСтиля("ЦветТекстаКнопки");
	КонецЕсли;
	
	Если ТипЗнч(Элемент) = Тип("ПолеФормы") Тогда
		
		Элемент.ЦветТекстаЗаголовка = ЦветЗаголовка;

		Попытка
			Элемент.ЦветТекста = ЦветТекста;
		Исключение
		КонецПопытки;
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ЗаполнитьДатыЭксплуатации()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА торо_СтатусыОбъектовРемонтаВУчете.СтатусОР = ЗНАЧЕНИЕ(Перечисление.торо_СтатусыОРВУчете.ПринятоКУчету)
	               |				ТОГДА торо_СтатусыОбъектовРемонтаВУчете.Период
	               |		КОНЕЦ) КАК ДатаПринятияКУчету,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА торо_СтатусыОбъектовРемонтаВУчете.СтатусОР = ЗНАЧЕНИЕ(Перечисление.торо_СтатусыОРВУчете.СнятоСУчета)
	               |				ТОГДА торо_СтатусыОбъектовРемонтаВУчете.Период
	               |		КОНЕЦ) КАК ДатаСнятияСУчета,
	               |	торо_СтатусыОбъектовРемонтаВУчете.ОбъектРемонта КАК ОбъектРемонта
	               |ПОМЕСТИТЬ ПоследниеДатыСтатусов
	               |ИЗ
	               |	РегистрСведений.торо_СтатусыОбъектовРемонтаВУчете КАК торо_СтатусыОбъектовРемонтаВУчете
	               |ГДЕ
	               |	торо_СтатусыОбъектовРемонтаВУчете.ОбъектРемонта = &ОбъектРемонта
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	торо_СтатусыОбъектовРемонтаВУчете.ОбъектРемонта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоследниеДатыСтатусов.ОбъектРемонта КАК ОбъектРемонта,
	               |	торо_СтатусыОбъектовРемонтаВУчете.Период КАК ДатаВводаВЭксплуатацию,
	               |	торо_СтатусыОбъектовРемонтаВУчете.Регистратор КАК РегистраторПринятияКУчету,
	               |	ВЫБОР
	               |		КОГДА НЕ ПоследниеДатыСтатусов.ДатаСнятияСУчета ЕСТЬ NULL 
	               |				И ПоследниеДатыСтатусов.ДатаПринятияКУчету < ПоследниеДатыСтатусов.ДатаСнятияСУчета
	               |			ТОГДА торо_СтатусыОбъектовРемонтаВУчете1.Период
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ДатаСнятияСУчета,
	               |	ВЫБОР
	               |		КОГДА НЕ ПоследниеДатыСтатусов.ДатаСнятияСУчета ЕСТЬ NULL 
	               |				И ПоследниеДатыСтатусов.ДатаПринятияКУчету < ПоследниеДатыСтатусов.ДатаСнятияСУчета
	               |			ТОГДА торо_СтатусыОбъектовРемонтаВУчете1.Регистратор
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Документ.торо_ВыбытиеОбъектаРемонта.ПустаяСсылка)
	               |	КОНЕЦ КАК РегистраторСнятияСУчета
	               |ИЗ
	               |	ПоследниеДатыСтатусов КАК ПоследниеДатыСтатусов
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_СтатусыОбъектовРемонтаВУчете КАК торо_СтатусыОбъектовРемонтаВУчете
	               |		ПО ПоследниеДатыСтатусов.ДатаПринятияКУчету = торо_СтатусыОбъектовРемонтаВУчете.Период
	               |			И ПоследниеДатыСтатусов.ОбъектРемонта = торо_СтатусыОбъектовРемонтаВУчете.ОбъектРемонта
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_СтатусыОбъектовРемонтаВУчете КАК торо_СтатусыОбъектовРемонтаВУчете1
	               |		ПО ПоследниеДатыСтатусов.ДатаСнятияСУчета = торо_СтатусыОбъектовРемонтаВУчете1.Период
	               |			И ПоследниеДатыСтатусов.ОбъектРемонта = торо_СтатусыОбъектовРемонтаВУчете1.ОбъектРемонта";
	
	Запрос.УстановитьПараметр("ОбъектРемонта", Объект.Ссылка);
	Запрос.УстановитьПараметр("ТекущаяДата",   ТекущаяДата());
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		ДатаВводаВЭксплуатацию     = Выборка.ДатаВводаВЭксплуатацию;
		РегистраторПринятияКУчету  = Выборка.РегистраторПринятияКУчету;
		ДатаСнятияСУчета           = Выборка.ДатаСнятияСУчета;
		РегистраторСнятияСУчета    = Выборка.РегистраторСнятияСУчета;
	Иначе
		ДатаВводаВЭксплуатацию     = Дата("00010101");
		РегистраторПринятияКУчету  = Документы.торо_ПринятиеОРКУчету.ПустаяСсылка();
		ДатаСнятияСУчета           = Дата("00010101");
		РегистраторСнятияСУчета    = Документы.торо_ВыбытиеОбъектаРемонта.ПустаяСсылка();
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПослеКопирования()
	
	Если Параметры.Свойство("СписокПараметровКопирования") Тогда
		Для каждого ЭлементСписка Из Параметры.СписокПараметровКопирования Цикл
			
			Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
				Записать();
			КонецЕсли;
			
			Если ЭлементСписка.Значение = "Контролируемые показатели" Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	торо_ИзмеряемыеПоказателиОбъектовРемонта.Показатель,
				|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ДопустимыйМинимум,
				|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ДопустимыйМаксимум,
				|	торо_ИзмеряемыеПоказателиОбъектовРемонта.КритическийМинимум,
				|	торо_ИзмеряемыеПоказателиОбъектовРемонта.КритическийМаксимум,
				|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ЗначенияКонтролируемыхПоказателейИзОР
				|ИЗ
				|	РегистрСведений.торо_ИзмеряемыеПоказателиОбъектовРемонта КАК торо_ИзмеряемыеПоказателиОбъектовРемонта
				|ГДЕ
				|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ОбъектРемонта = &ОбъектРемонта";
				
				Запрос.УстановитьПараметр("ОбъектРемонта", Параметры.ЗначениеКопирования);
				
				Результат = Запрос.Выполнить();
				Выборка = Результат.Выбрать();
				
				мСписокИзмеряемыхПоказателей = РегистрыСведений.торо_ИзмеряемыеПоказателиОбъектовРемонта.СоздатьНаборЗаписей();
				мСписокИзмеряемыхПоказателей.Отбор.ОбъектРемонта.Установить(Объект.Ссылка);
				
				Пока Выборка.Следующий() Цикл
					СтрокаНЗ = мСписокИзмеряемыхПоказателей.Добавить();
					СтрокаНЗ.ОбъектРемонта                         = Объект.Ссылка;
					СтрокаНЗ.Показатель                            = Выборка.Показатель;
					СтрокаНЗ.ДопустимыйМинимум                     = ?(ТипЗнч(Выборка.ДопустимыйМинимум) = Тип("Число"), Выборка.ДопустимыйМинимум, 0);
					СтрокаНЗ.ДопустимыйМаксимум                    = ?(ТипЗнч(Выборка.ДопустимыйМаксимум) = Тип("Число"), Выборка.ДопустимыйМаксимум, 0);
					СтрокаНЗ.КритическийМинимум                    = ?(ТипЗнч(Выборка.КритическийМинимум) = Тип("Число"), Выборка.КритическийМинимум, 0);
					СтрокаНЗ.КритическийМаксимум                   = ?(ТипЗнч(Выборка.КритическийМаксимум) = Тип("Число"), Выборка.КритическийМаксимум, 0);
					СтрокаНЗ.ЗначенияКонтролируемыхПоказателейИзОР = Выборка.ЗначенияКонтролируемыхПоказателейИзОР;
				КонецЦикла;
				
				мСписокИзмеряемыхПоказателей.Записать();
				
			ИначеЕсли ЭлементСписка.Значение = "Параметры наработки (только действующие значения)" Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	торо_ПараметрыНаработкиОбъектовРемонта.Показатель,
				|	торо_ПараметрыНаработкиОбъектовРемонта.ПлановаяНаработка,
				|	торо_ПараметрыНаработкиОбъектовРемонта.ПериодПлановойНаработки,
				|	торо_ПараметрыНаработкиОбъектовРемонта.КоэффициентИспользованияОборудования,
				|	торо_ПараметрыНаработкиОбъектовРемонта.ПродолжительностьПериодаПлановойНаработки,
				|	торо_ПараметрыНаработкиОбъектовРемонта.Основной,
				|	торо_ПараметрыНаработкиОбъектовРемонта.Период
				|ИЗ
				|	РегистрСведений.торо_ПараметрыНаработкиОбъектовРемонта.СрезПоследних(, ОбъектРемонта = &ОбъектРемонта) КАК торо_ПараметрыНаработкиОбъектовРемонта";
				
				Запрос.УстановитьПараметр("ОбъектРемонта", Параметры.ЗначениеКопирования);
				
				Результат = Запрос.Выполнить();
				Выборка = Результат.Выбрать();
				
				мСписокПараметровНаработки = РегистрыСведений.торо_ПараметрыНаработкиОбъектовРемонта.СоздатьНаборЗаписей();
				мСписокПараметровНаработки.Отбор.ОбъектРемонта.Установить(Объект.Ссылка);
				Пока Выборка.Следующий() Цикл
					СтрокаНЗ = мСписокПараметровНаработки.Добавить();
					СтрокаНЗ.ОбъектРемонта = Объект.Ссылка;
					СтрокаНЗ.ПериодПлановойНаработки = Выборка.ПериодПлановойНаработки;
					СтрокаНЗ.ПлановаяНаработка = Выборка.ПлановаяНаработка;
					СтрокаНЗ.Показатель = Выборка.Показатель;
					СтрокаНЗ.КоэффициентИспользованияОборудования = Выборка.КоэффициентИспользованияОборудования;
					СтрокаНЗ.ПродолжительностьПериодаПлановойНаработки = Выборка.ПродолжительностьПериодаПлановойНаработки;
					СтрокаНЗ.Период = Выборка.Период;
					СтрокаНЗ.Основной = Выборка.Основной;
				КонецЦикла;
				мСписокПараметровНаработки.Записать();
			ИначеЕсли ЭлементСписка.Значение = "Параметры наработки (история изменения)" Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	торо_ПараметрыНаработкиОбъектовРемонта.Показатель,
				|	торо_ПараметрыНаработкиОбъектовРемонта.ПлановаяНаработка,
				|	торо_ПараметрыНаработкиОбъектовРемонта.ПериодПлановойНаработки,
				|	торо_ПараметрыНаработкиОбъектовРемонта.КоэффициентИспользованияОборудования,
				|	торо_ПараметрыНаработкиОбъектовРемонта.ПродолжительностьПериодаПлановойНаработки,
				|	торо_ПараметрыНаработкиОбъектовРемонта.Основной,
				|	торо_ПараметрыНаработкиОбъектовРемонта.Период
				|ИЗ
				|	РегистрСведений.торо_ПараметрыНаработкиОбъектовРемонта КАК торо_ПараметрыНаработкиОбъектовРемонта
				|ГДЕ
				|	торо_ПараметрыНаработкиОбъектовРемонта.ОбъектРемонта = &ОбъектРемонта";
				
				Запрос.УстановитьПараметр("ОбъектРемонта", Параметры.ЗначениеКопирования);
				
				Результат = Запрос.Выполнить();
				Выборка = Результат.Выбрать();
				
				мСписокПараметровНаработки = РегистрыСведений.торо_ПараметрыНаработкиОбъектовРемонта.СоздатьНаборЗаписей();
				мСписокПараметровНаработки.Отбор.ОбъектРемонта.Установить(Объект.Ссылка);
				Пока Выборка.Следующий() Цикл
					СтрокаНЗ = мСписокПараметровНаработки.Добавить();
					СтрокаНЗ.ОбъектРемонта = Объект.Ссылка;
					СтрокаНЗ.ПериодПлановойНаработки=Выборка.ПериодПлановойНаработки;
					СтрокаНЗ.ПлановаяНаработка = Выборка.ПлановаяНаработка;
					СтрокаНЗ.Показатель=Выборка.Показатель;
					СтрокаНЗ.КоэффициентИспользованияОборудования = Выборка.КоэффициентИспользованияОборудования;
					СтрокаНЗ.ПродолжительностьПериодаПлановойНаработки = Выборка.ПродолжительностьПериодаПлановойНаработки;
					СтрокаНЗ.Период = Выборка.Период;
					СтрокаНЗ.Основной = Выборка.Основной;
				КонецЦикла;
				мСписокПараметровНаработки.Записать();
			ИначеЕсли ЭлементСписка.Значение = "Запчасти" Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	торо_Запчасти.ОбъектРемонта,
				|	торо_Запчасти.ТиповойОР,
				|	торо_Запчасти.Номенклатура,
				|	торо_Запчасти.Качество,
				|	торо_Запчасти.Характеристика,
				|	торо_Запчасти.Количество
				|ИЗ
				|	РегистрСведений.торо_Запчасти КАК торо_Запчасти
				|ГДЕ
				|	торо_Запчасти.ОбъектРемонта = &ОбъектРемонта
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	торо_ЗапчастиУдаленные.ОбъектРемонта,
				|	торо_ЗапчастиУдаленные.ТиповойОР,
				|	торо_ЗапчастиУдаленные.Номенклатура,
				|	торо_ЗапчастиУдаленные.Характеристика
				|ИЗ
				|	РегистрСведений.торо_ЗапчастиУдаленные КАК торо_ЗапчастиУдаленные
				|ГДЕ
				|	торо_ЗапчастиУдаленные.ОбъектРемонта = &ОбъектРемонта
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	торо_НормыЗапчастейНаОбъектыРемонта.ОбъектРемонта,
				|	торо_НормыЗапчастейНаОбъектыРемонта.Номенклатура,
				|	торо_НормыЗапчастейНаОбъектыРемонта.ВидРемонта,
				|	торо_НормыЗапчастейНаОбъектыРемонта.Количество,
				|	торо_НормыЗапчастейНаОбъектыРемонта.ТиповойОР,
				|	торо_НормыЗапчастейНаОбъектыРемонта.Характеристика
				|ИЗ
				|	РегистрСведений.торо_НормыЗапчастейНаОбъектыРемонта КАК торо_НормыЗапчастейНаОбъектыРемонта
				|ГДЕ
				|	торо_НормыЗапчастейНаОбъектыРемонта.ОбъектРемонта = &ОбъектРемонта
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	торо_НормыЗапчастейНаОбъектыРемонтаУдаленные.ОбъектРемонта,
				|	торо_НормыЗапчастейНаОбъектыРемонтаУдаленные.Номенклатура,
				|	торо_НормыЗапчастейНаОбъектыРемонтаУдаленные.ВидРемонта,
				|	торо_НормыЗапчастейНаОбъектыРемонтаУдаленные.ТиповойОР
				|ИЗ
				|	РегистрСведений.торо_НормыЗапчастейНаОбъектыРемонтаУдаленные КАК торо_НормыЗапчастейНаОбъектыРемонтаУдаленные
				|ГДЕ
				|	торо_НормыЗапчастейНаОбъектыРемонтаУдаленные.ОбъектРемонта = &ОбъектРемонта";
				
				Запрос.УстановитьПараметр("ОбъектРемонта", Параметры.ЗначениеКопирования);
				Результат = Запрос.ВыполнитьПакет();
				
				// записи в рс торо_Запчасти
				Выборка = Результат[0].Выбрать();
				
				мТабЗапчастейОбъектовРемонта = РегистрыСведений.торо_Запчасти.СоздатьНаборЗаписей();
				мТабЗапчастейОбъектовРемонта.Отбор.ОбъектРемонта.Установить(Объект.Ссылка);
				Пока Выборка.Следующий() Цикл
					СтрокаЗЧ = мТабЗапчастейОбъектовРемонта.Добавить();
					СтрокаЗЧ.ОбъектРемонта = Объект.Ссылка;
					
					СтрокаЗЧ.Номенклатура = Выборка.Номенклатура;
					СтрокаЗЧ.Количество = Выборка.Количество;
					СтрокаЗЧ.Качество = Выборка.Качество;
					СтрокаЗЧ.Характеристика = Выборка.Характеристика;
					СтрокаЗЧ.ТиповойОР = Выборка.ТиповойОР;
					
				КонецЦикла;
				мТабЗапчастейОбъектовРемонта.Записать();
				
				// записи в рс торо_ЗапчастиУдаленные
				Выборка = Результат[1].Выбрать();
				
				мТабЗапчастейОбъектовРемонтаУдаленные = РегистрыСведений.торо_ЗапчастиУдаленные.СоздатьНаборЗаписей();
				мТабЗапчастейОбъектовРемонтаУдаленные.Отбор.ОбъектРемонта.Установить(Объект.Ссылка);
				Пока Выборка.Следующий() Цикл
					СтрокаЗЧ = мТабЗапчастейОбъектовРемонтаУдаленные.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаЗЧ, выборка);
					СтрокаЗЧ.ОбъектРемонта = Объект.Ссылка;
				КонецЦикла;
				мТабЗапчастейОбъектовРемонтаУдаленные.Записать();
				
				// записи в рс торо_НормыЗапчастейНаОбъектыРемонта
				Выборка = Результат[2].Выбрать();
				
				мТабЗатратПоВидамРемонта = РегистрыСведений.торо_НормыЗапчастейНаОбъектыРемонта.СоздатьНаборЗаписей();
				мТабЗатратПоВидамРемонта.Отбор.ОбъектРемонта.Установить(Объект.Ссылка);
				
				Пока Выборка.Следующий() Цикл
					СтрокаЗатрат = мТабЗатратПоВидамРемонта.Добавить();
					СтрокаЗатрат.ОбъектРемонта = Объект.Ссылка;
					
					СтрокаЗатрат.Номенклатура = Выборка.Номенклатура;
					СтрокаЗатрат.Количество = Выборка.Количество;
					СтрокаЗатрат.ВидРемонта = Выборка.ВидРемонта;
					СтрокаЗатрат.ТиповойОР = Выборка.ТиповойОР;
					СтрокаЗатрат.Характеристика = Выборка.Характеристика;
					
				КонецЦикла;
				мТабЗатратПоВидамРемонта.Записать();
				
				// записи в рс торо_НормыЗапчастейНаОбъектыРемонтаУдаленные
				Выборка = Результат[3].Выбрать();
				
				мТабЗатратПоВидамРемонтаУдаленные = РегистрыСведений.торо_НормыЗапчастейНаОбъектыРемонтаУдаленные.СоздатьНаборЗаписей();
				мТабЗатратПоВидамРемонтаУдаленные.Отбор.ОбъектРемонта.Установить(Объект.Ссылка);
				
				Пока Выборка.Следующий() Цикл
					СтрокаЗатрат = мТабЗатратПоВидамРемонтаУдаленные.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаЗатрат, Выборка);
					СтрокаЗатрат.ОбъектРемонта = Объект.Ссылка;
				КонецЦикла;
				мТабЗатратПоВидамРемонтаУдаленные.Записать();
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступность(ПриСозданииФормыНаСервере = Ложь)
	
	Если ПриСозданииФормыНаСервере Тогда
		
		Если Объект.Изготовитель = ТекТиповойОР.Изготовитель Тогда
			Элементы.Изготовитель.ЦветТекста = Новый Цвет(128,128,128);
		КонецЕсли;
		
		Если Объект.Направление = ТекТиповойОР.Направление Тогда
			Элементы.Направление.ЦветТекста = Новый Цвет(128,128,128);
		КонецЕсли;
		
		// Отбор не удаленных строк
		ПараметрыОтбора = Новый ФиксированнаяСтруктура("Удален", Ложь);
		Элементы.СписокИзмеряемыхПоказателей.ОтборСтрок = ПараметрыОтбора;
		Элементы.НормативныеРемонты.ОтборСтрок = ПараметрыОтбора;
		Элементы.ТабЗапчастейОбъектовРемонта.ОтборСтрок = ПараметрыОтбора;
		
		ПоказыватьКонтрагента = Объект.ВнешнийОбъект;
		Элементы.СтраницаКонтрагента.Видимость = ПоказыватьКонтрагента;
		Элементы.СтарницаОрганизации.Видимость = НЕ ПоказыватьКонтрагента;
		
		// функциональные опции
		ФОУчетЗапчастей                 				= ПолучитьФункциональнуюОпцию("торо_УчетЗапчастей");
		ФОУчетКонтролируемыхПоказателей 				= ПолучитьФункциональнуюОпцию("торо_УчетКонтролируемыхПоказателей");
		ФОУчетНаработкиОборудования     				= ПолучитьФункциональнуюОпцию("торо_УчетНаработкиОборудования");
		ФОУчетСостоянияОборудования     				= ПолучитьФункциональнуюОпцию("торо_УчетСостоянияОборудования");
		ФОУчетПусковОборудования        				= ПолучитьФункциональнуюОпцию("торо_УчетПусковОборудования");
		ФОУчетЗамещающихРемонтов        				= ПолучитьФункциональнуюОпцию("торо_УчетЗамещающихРемонтов");
		ФОИспользоватьКоэффициентыРемонтныхОсобенностей = ПолучитьФункциональнуюОпцию("торо_ИспользоватьКоэффициентыРемОсобенностей");
		ФОИспользоватьПланированиеПоЖесткимРемЦиклам 	= ПолучитьФункциональнуюОпцию("торо_ИспользоватьПланированиеПоЖесткимРемЦиклам");
		ФОИспользоватьОценкиРМ							= ПолучитьФункциональнуюОпцию("торо_ИспользованиеОценокРМ");
		ФОИспользоватьОстановочные						= ПолучитьФункциональнуюОпцию("торо_ИспользоватьОстановочныеРемонты");
		
		Элементы.СтраницаЗапчасти.Видимость                          = ФОУчетЗапчастей;
		Элементы.СтраницаКонтролируемыеПоказатели.Видимость          = ФОУчетКонтролируемыхПоказателей;
		Элементы.СтраницаНаработка.Видимость                         = ФОУчетНаработкиОборудования;
		Элементы.СтраницаСостояниеОР.Видимость                       = ФОУчетСостоянияОборудования;
		Элементы.СтраницаКоличествоПусков.Видимость                  = ФОУчетПусковОборудования;
		Элементы.ГруппаЗамещаемые.Видимость                          = ФОУчетЗамещающихРемонтов;
		Элементы.СтраницаКоэффициентыРемонтныхОсобенностей.Видимость = ФОИспользоватьКоэффициентыРемонтныхОсобенностей;
		Элементы.СтраницаФиксированныеРемонтныеЦиклы.Видимость       = ФОИспользоватьПланированиеПоЖесткимРемЦиклам;
		Элементы.СтраницаОценкаРМ.Видимость 							 = ФОИспользоватьОценкиРМ;
		Элементы.ОсновноеИЗависимоеОборудование.Видимость 				 = ФОИспользоватьОстановочные;
		
	КонецЕсли;	
	
	// Гарантии++
	Элементы.СтраницаГарантийныеРемонты.Видимость = ЕстьГарантияДляОбъекта;
	СтруктураОтбора = Новый Структура("ОбъектРемонта", Объект.Ссылка);
	МассивСтрок = ГарантииОбъектаРемонта.НайтиСтроки(СтруктураОтбора);
	
	Если МассивСтрок.Количество() <> ГарантииОбъектаРемонта.Количество() Тогда // Значит имеются гарантии у одного из родителей ОР
		Элементы.ЕстьГарантияДляОбъекта.Доступность = Ложь;                    // и изменять значение флага нельзя.
	Иначе
		Элементы.ЕстьГарантияДляОбъекта.Доступность = Истина;
	КонецЕсли;
	// Гарантии--
	
	// ЖЦ Оборудования++
	УстановитьВидимостьДоступностьЖизненныйЦикл();
	// ЖЦ Оборудования--
	
	ДополнитьЗаголовокФормыСостояниемОР();
	
	Элементы.ФормаПоказатьСкрытьИзображение.Пометка = ОтображатьИзображение;	
	Элементы.ГруппаДанныеЭксплПравая.Видимость = Элементы.ФормаПоказатьСкрытьИзображение.Пометка;
	Элементы.ПоказатьПоложениеВИерархии.Доступность = ЗначениеЗаполнено(Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступностьЖизненныйЦикл()
	
	Если ФОИспользоватьДокументыЖЦОборудования Тогда
		
		Элементы.ГруппаСтатусОбъектаРемонта.Видимость = Истина;
		Элементы.ДатаВводаВЭксплуатацию1.Видимость    = Ложь;

		Элементы.АдресКартинки.Высота = 9;
		
		Элементы.ДатаВводаВЭксплуатацию.ТолькоПросмотр = Истина; // ТолькоПросмотрДатыВводаВЭксплуатацию;
		Элементы.ДатаСнятияСУчета.ТолькоПросмотр       = Истина; // ТолькоПросмотрДатыСнятияСучета;
		
		Если Объект.Ссылка = Справочники.торо_ОбъектыРемонта.ПустаяСсылка() Тогда
			Элементы.ВвестиОткрытьДокументПринятиеКУчету.Доступность = Ложь;
		КонецЕсли;
		
		
		Если ЗначениеЗаполнено(РегистраторПринятияКУчету) Тогда
			Элементы.ВвестиОткрытьДокументПринятиеКУчету.Заголовок = РегистраторПринятияКУчету;
			Элементы.ВвестиОткрытьДокументСнятияСУчета.Доступность = Истина;	
		Иначе
			Элементы.ВвестиОткрытьДокументПринятиеКУчету.Заголовок = НСтр("es='Introducir el documento ""la Aceptación del objeto de la reparación al recuento""';ru='Ввести документ ""Принятие объекта ремонта к учету""';en='Enter the document ""Acceptance of the repair object for accounting""'");
			Элементы.ВвестиОткрытьДокументСнятияСУчета.Доступность = Ложь;	
		КонецЕсли; 
		
		
		Если ЗначениеЗаполнено(РегистраторСнятияСУчета) Тогда
			Элементы.ВвестиОткрытьДокументСнятияСУчета.Заголовок   = РегистраторСнятияСУчета;
		Иначе
			Элементы.ВвестиОткрытьДокументСнятияСУчета.Заголовок   = НСтр("es='Introducir el documento ""la Salida del objeto de la reparación""';ru='Ввести документ ""Выбытие объекта ремонта""';en='Enter the document ""Retirement of the repair object""'");
		КонецЕсли;
		
		ПравоВводаДокументовПринятияКУчету = ПравоДоступа("Добавление", Метаданные.Документы.торо_ПринятиеОРКУчету);
		ПравоВводаДокументовСнятияСУчета = ПравоДоступа("Добавление", Метаданные.Документы.торо_ВыбытиеОбъектаРемонта);
		Если НЕ ЗначениеЗаполнено(РегистраторПринятияКУчету) Тогда
			Элементы.ВвестиОткрытьДокументПринятиеКУчету.Доступность = Элементы.ВвестиОткрытьДокументПринятиеКУчету.Доступность И ПравоВводаДокументовПринятияКУчету;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(РегистраторСнятияСУчета) Тогда
			Элементы.ВвестиОткрытьДокументСнятияСУчета.Доступность = Элементы.ВвестиОткрытьДокументСнятияСУчета.Доступность И ПравоВводаДокументовСнятияСУчета;
		КонецЕсли;
		
		Элементы.НеУчаствуетВПланировании.Доступность = ДоступностьФлагаПланирования;
			
		ТекСтатусВУчете = РегистрыСведений.торо_СтатусыОбъектовРемонтаВУчете.ПолучитьТекущийСтатусОР(Объект.Ссылка);
		
		Если Объект.Ссылка = Справочники.торо_ОбъектыРемонта.ПустаяСсылка() Тогда
			ЭтаФорма.Заголовок = НСтр("es='Los objetos de la reparación (la Creación)';ru='Объекты ремонта (Создание)';en='Repair objects (Creation)'");
		Иначе
			ЭтаФорма.Заголовок = Строка(Объект.Ссылка) + " [" + ТекСтатусВУчете + "]";
		КонецЕсли;
		
		Если ТекСтатусВУчете = Перечисления.торо_СтатусыОРВУчете.СнятоСУчета Тогда
			ЭтаФорма.ТолькоПросмотр                                = Истина;
			Элементы.ЗначенияКонтролируемыхПоказателей.Доступность = Ложь;
			Элементы.ТабВыработкиОбъектаРемонта.Доступность        = Ложь;
			Элементы.КомПанельГрафика.Доступность                  = Ложь;
			
			Элементы.ЕстьГарантияДляОбъекта.Доступность 		   = Ложь; 
			Элементы.СписокИзмеряемыхПоказателей.Доступность 	   = Ложь;
			Элементы.ПараметрыОповещенияПоСостояниямОР.Доступность = Ложь;
			Элементы.СписокПараметровНаработки.Доступность 		   = Ложь;
			Элементы.ТабЗапчастейОбъектовРемонта.Доступность 	   = Ложь;
			Элементы.ТаблицаОценокРМ.Доступность 				   = Ложь;
			Элементы.ВидыРемонтаЭтогоОбъекта.Доступность 		   = Ложь;
			Элементы.СписокОбъектовРемонта.Доступность 			   = Ложь;
			Элементы.ВидыРемонтаОсновногоСвязанного.Доступность    = Ложь;
			Элементы.ВыявленныеДефектыВвестиДефект.Доступность     = Ложь;
			Элементы.ГарантииОбъектаРемонта.Доступность            = Ложь;
			Элементы.ТабМаксимальныхЗначенийНаработки.КоманднаяПанель.Доступность = Ложь;
			Если ПолучитьФункциональнуюОпцию("ИспользоватьДополнительныеРеквизитыИСведения") Тогда
				Элементы.Свойства_ЗначенияДополнительныхРеквизитов.Доступность = Ложь;			
			КонецЕсли; 
			
		Иначе
			ЭтаФорма.ТолькоПросмотр                                = Ложь;
			Элементы.ЗначенияКонтролируемыхПоказателей.Доступность = Истина;
			Элементы.ТабВыработкиОбъектаРемонта.Доступность        = Истина;
			Элементы.КомПанельГрафика.Доступность                  = Истина;
			
			Элементы.СписокИзмеряемыхПоказателей.Доступность 	   = Истина;
			Элементы.ПараметрыОповещенияПоСостояниямОР.Доступность = Истина;
			Элементы.СписокПараметровНаработки.Доступность 		   = Истина;
			Элементы.ТабЗапчастейОбъектовРемонта.Доступность 	   = Истина;
			Элементы.ТаблицаОценокРМ.Доступность 				   = Истина;
			Элементы.ВидыРемонтаЭтогоОбъекта.Доступность 		   = Истина;
			Элементы.СписокОбъектовРемонта.Доступность 			   = Истина;
			Элементы.ВидыРемонтаОсновногоСвязанного.Доступность    = Истина;
			Элементы.ВыявленныеДефектыВвестиДефект.Доступность     = Истина;
			Элементы.ГарантииОбъектаРемонта.Доступность            = Истина;
			Элементы.ТабМаксимальныхЗначенийНаработки.КоманднаяПанель.Доступность = Истина;
			Если ПолучитьФункциональнуюОпцию("ИспользоватьДополнительныеРеквизитыИСведения") Тогда
				Элементы.Свойства_ЗначенияДополнительныхРеквизитов.Доступность = Истина;			
			КонецЕсли;			
		КонецЕсли;
		
	Иначе
		Элементы.АдресКартинки.Высота = 7;
		Элементы.ГруппаСтатусОбъектаРемонта.Видимость = Ложь;
		Элементы.ДатаВводаВЭксплуатацию1.Видимость    = Истина;
		
		Если Объект.Ссылка = Справочники.торо_ОбъектыРемонта.ПустаяСсылка() Тогда
			ЭтаФорма.Заголовок = НСтр("es='Los objetos de la reparación (la Creación)';ru='Объекты ремонта (Создание)';en='Repair objects (Creation)'");
		Иначе
			ЭтаФорма.Заголовок = Строка(Объект.Ссылка);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ДополнитьЗаголовокФормыСостояниемОР()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда

		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(торо_ТекущееСостояниеОРСрезПоследних.ВидЭксплуатации, ЗНАЧЕНИЕ(Справочник.торо_ВидыЭксплуатации.ПустаяСсылка)) КАК ВидЭксплуатации
		|ИЗ
		|	РегистрСведений.торо_ТекущееСостояниеОР.СрезПоследних(&ТекущаяДата, ОбъектРемонта = &ОбъектРемонта) КАК торо_ТекущееСостояниеОРСрезПоследних";
		Запрос.УстановитьПараметр("ОбъектРемонта",Объект.Ссылка);
		Запрос.УстановитьПараметр("ТекущаяДата",ОбщегоНазначения.ТекущаяДатаПользователя());
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.ВидЭксплуатации = Справочники.торо_ВидыЭксплуатации.ПустаяСсылка() Тогда
				ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + НСтр("ru = ' [Вид эксплуатации не установлен]'");
			Иначе
				ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + " [" + Выборка.ВидЭксплуатации + "]";
			КонецЕсли;
		КонецЕсли;

		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_Ремонты.ID КАК ID,
		|	торо_Ремонты.ОбъектРемонта КАК ОбъектРемонта,
		|	торо_Ремонты.Регистратор КАК Регистратор,
		|	1 КАК Приоритет
		|ИЗ
		|	РегистрСведений.торо_Ремонты КАК торо_Ремонты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗавершенныеРемонтныеРаботы КАК торо_ЗавершенныеРемонтныеРаботы
		|		ПО торо_Ремонты.ID = торо_ЗавершенныеРемонтныеРаботы.ID
		|ГДЕ
		|	торо_Ремонты.ОбъектРемонта = &ОбъектРемонта
		|	И торо_Ремонты.Регистратор ССЫЛКА Документ.торо_ВыявленныеДефекты
		|	И торо_ЗавершенныеРемонтныеРаботы.Регистратор ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_Ремонты.ID,
		|	торо_Ремонты.ОбъектРемонта,
		|	торо_Ремонты.Регистратор,
		|	2
		|ИЗ
		|	РегистрСведений.торо_Ремонты КАК торо_Ремонты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗавершенныеРемонтныеРаботы КАК торо_ЗавершенныеРемонтныеРаботы
		|		ПО торо_Ремонты.ID = торо_ЗавершенныеРемонтныеРаботы.ID
		|ГДЕ
		|	торо_Ремонты.ОбъектРемонта = &ОбъектРемонта
		|	И торо_Ремонты.Регистратор ССЫЛКА Документ.торо_НарядНаВыполнениеРемонтныхРабот
		|	И торо_ЗавершенныеРемонтныеРаботы.Регистратор ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет УБЫВ";
		
		Запрос.УстановитьПараметр("ОбъектРемонта", Объект.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.Приоритет = 1 Тогда
				ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + НСтр("ru = ' [Выявлен дефект]'");
			Иначе
				ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + НСтр("ru = ' [Выполняется ремонт]'");
			КонецЕсли;			
		Иначе
			ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + НСтр("ru = ' [Работает]'");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФлагПланированияИДоступность(СменаСтатуса = Ложь)
	ЗначениеПеречисления = Перечисления.торо_СтатусыОРВУчете.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(РегистраторПринятияКУчету)
		И Не ЗначениеЗаполнено(РегистраторСнятияСУчета) Тогда // Принят к учету
		
		ЗначениеПеречисления = Перечисления.торо_СтатусыОРВУчете.ПринятоКУчету;
		
	ИначеЕсли ЗначениеЗаполнено(РегистраторПринятияКУчету)
		И ЗначениеЗаполнено(РегистраторСнятияСУчета) Тогда // Снят с учета
		
		ЗначениеПеречисления = Перечисления.торо_СтатусыОРВУчете.СнятоСУчета;
		
	Иначе
		
		ЗначениеПеречисления = Перечисления.торо_СтатусыОРВУчете.НеПринятоКУчету;
		
	КонецЕсли;
	
	Структура = РегистрыСведений.торо_НастройкиДоступностиОбъектовРемонта.Получить(Новый Структура("СтатусОРВУчете",ЗначениеПеречисления));
	
	Если Не Структура = Неопределено Тогда
		ДоступностьФлагаПланирования = Структура.ДоступностьФлага;
		Если СменаСтатуса Тогда
			Объект.НеУчаствуетВПланировании = Структура.ЗначениеПоУмолчанию;
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборНеИспользуемыхСтрок(ПоказыватьУдаленные,ИмяТаблицаФормы)
	Если ПоказыватьУдаленные Тогда
		Элементы[ИмяТаблицаФормы].ОтборСтрок = Неопределено;
	Иначе
		ПараметрыОтбора = Новый ФиксированнаяСтруктура("Удален", Ложь);
		Элементы[ИмяТаблицаФормы].ОтборСтрок = ПараметрыОтбора;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначениеГрафикаРемРаботНаСервере()
	
	Возврат Константы.торо_ГрафикРемонтныхРабот.Получить();
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиРодителяИерархии(Иерархия, ОбъектРемонта)
	
	РодительИерархии = торо_РаботаСИерархией20.ПолучитьТекущегоРодителяВИерархии(ОбъектРемонта, Иерархия,,Истина,Истина);
	
	Возврат ?(ТипЗнч(РодительИерархии) <> Тип("СправочникСсылка.торо_ОбъектыРемонта"),
				Справочники.торо_ОбъектыРемонта.ПустаяСсылка(),
			  	РодительИерархии);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеДляКопирования(ОбъектРемонта)

	ДанныеДляКопирования = Новый Структура;
	ДанныеДляКопирования.Вставить("ИерархияДляВводаНовыхОР", Константы.торо_ИерархияДляВводаНовыхОР.Получить());
	ДанныеДляКопирования.Вставить("РодительИерархии", НайтиРодителяИерархии(ДанныеДляКопирования.ИерархияДляВводаНовыхОР, ОбъектРемонта));
	
	Возврат ДанныеДляКопирования;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьФОИспользоватьГарантииНаСервере()
	Возврат ПолучитьФункциональнуюОпцию("торо_ИспользоватьГарантии");
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаписатьНормативыОРПриИзмененииТиповогоОРНаСервере(ТиповойОР, ОбъектРемонта)
	торо_РаботаСНормативамиСервер.ЗаписатьНормативыОРПриИзмененииТиповогоОР(ТиповойОР, ОбъектРемонта);
КонецПроцедуры

&НаСервере
Функция ШтрихКодУникален()
	
	Если Не ЗначениеЗаполнено(Объект.ШтрихКод) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_ОбъектыРемонта.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	               |ГДЕ
	               |	торо_ОбъектыРемонта.Ссылка <> &Ссылка
	               |	И торо_ОбъектыРемонта.ШтрихКод = &ШтрихКод";
	
	Запрос.УстановитьПараметр("ШтрихКод", Объект.ШтрихКод);
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "торо_ОбъектыРемонта.Ссылка <> &Ссылка", "ИСТИНА");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Не Выборка.Следующий();
	
КонецФункции

&НаСервере
Функция ПроверитьСтатусНаСервере(ВидСоздаваемогоДокумента)
	
	Если Не ФОИспользоватьДокументыЖЦОборудования Тогда
		Возврат Истина;
	КонецЕсли; 	
	
	ТекущийСтатусОР = РегистрыСведений.торо_СтатусыОбъектовРемонтаВУчете.ПолучитьТекущийСтатусОР(Объект.Ссылка);
	
	ДоступныеЗначения = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	торо_НастройкиДоступностиОбъектовРемонта.СтатусОРВУчете
	|ИЗ
	|	РегистрСведений.торо_НастройкиДоступностиОбъектовРемонта КАК торо_НастройкиДоступностиОбъектовРемонта
	|ГДЕ
	|	торо_НастройкиДоступностиОбъектовРемонта.ДоступностьПриПодборе";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДоступныеЗначения.Добавить(Выборка.СтатусОРВУчете);
	КонецЦикла;
	
	Если ВидСоздаваемогоДокумента = "торо_УчетНаработкиОборудования"
		ИЛИ ВидСоздаваемогоДокумента = "торо_СостоянияОбъектовРемонта" Тогда
		
		Если ТекущийСтатусОР <> Перечисления.торо_СтатусыОРВУчете.НеПринятоКУчету
			И Не ДоступныеЗначения.НайтиПоЗначению(ТекущийСтатусОР) = Неопределено Тогда
			Возврат Истина;
		Иначе
			ШаблонСообщения = НСтр("es='En el estatus <%1> la creación del documento es inaccesible.';ru='В статусе <%1> создание документа недоступно.';en='In the status <% 1> document creation is not available.'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекущийСтатусОР);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат Ложь;
		КонецЕсли;
		
	ИначеЕсли ВидСоздаваемогоДокумента = "торо_УчетКонтролируемыхПоказателей" Тогда 
		
		Если Не ДоступныеЗначения.НайтиПоЗначению(ТекущийСтатусОР) = Неопределено Тогда
			Возврат Истина;
		Иначе
			ШаблонСообщения = НСтр("es='En el estatus <%1> la creación del documento es inaccesible.';ru='В статусе <%1> создание документа недоступно.';en='In the status <% 1> document creation is not available.'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекущийСтатусОР);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЕсли; 
	
КонецФункции

&НаКлиенте
Процедура СтратегияОбслуживанияНормативаПриИзменении(Элемент)
	МодифицированностьНормРемонтов = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ИсточникСтратегииПриИзменении(Элемент)
	МодифицированностьНормРемонтов = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
КонецПроцедуры

#КонецОбласти

