#Область ОбработчикиСобытийФормы

&НаСервере
Процедура гкс_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВремяНачалаОткрытияФормы") Тогда
		ВремяНачалаЗамера = Параметры.ВремяНачалаОткрытияФормы;		
	КонецЕсли;	
	
КонецПроцедуры


&НаСервере
Процедура Расш_гкс_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// гкс+ [Часовые пояса] Куст 09.04.2020
	гкс_ЧасовыеПоясаВызовСервера.ДобавитьНовыеЭлементы(ЭтаФорма, Элементы.Группа2,);
	//гкс_СдвигЧП
	// гкс- [Часовые пояса] Куст 09.04.2020
	//
	НовыеРеквизиты = Новый Массив();
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("гкс_ПустаяЗаявка",
		Новый ОписаниеТипов("ДокументСсылка.торо_ЗаявкаНаРемонт")));
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("гкс_Перенесен",
		Новый ОписаниеТипов("Булево"),"Объект.АварийныеРемонты"));
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("гкс_ДатаНачала",
		Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)),"Объект.АварийныеРемонты"));
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("гкс_ДатаОкончания",
		Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)),"Объект.АварийныеРемонты"));
	// гкс+ [02.23] Деснол 06.02.2023
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("гкс_Комментарий",
		Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(500)),, "Комментарий"));
	// гкс- [02.23] Деснол 06.02.2023
	ИзменитьРеквизиты(НовыеРеквизиты);
	//
	НЭлем = Элементы.Добавить("гкс_Перенесен",Тип("ПолеФормы"),Элементы.АварийныеРемонты);
	НЭлем.Вид = ВидПоляФормы.ПолеФлажка;
	НЭлем.ПутьКДанным = "Объект.АварийныеРемонты.гкс_Перенесен";
	НЭлем.Заголовок = НСтр("ru='Перенесен';en='Moved';es='Es llevado'");
	НЭлем.УстановитьДействие("ПриИзменении","гкс_ПеренесенПриИзменении"); 
	//
	НЭлем = Элементы.Добавить("гкс_ДатаНачала",Тип("ПолеФормы"),Элементы.АварийныеРемонты);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Объект.АварийныеРемонты.гкс_ДатаНачала";
	НЭлем.Заголовок = НСтр("ru='Новая дата начала';en='New start date';es='Una nueva fecha ha comenzado'");
	НЭлем.УстановитьДействие("ПриИзменении","гкс_ДатаПриИзменении");
	//
	НЭлем = Элементы.Добавить("гкс_ДатаОкончания",Тип("ПолеФормы"),Элементы.АварийныеРемонты);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Объект.АварийныеРемонты.гкс_ДатаОкончания";
	НЭлем.Заголовок = НСтр("ru='Новая дата окончания';en='New end date';es='Una nueva fecha de la terminación'");
	НЭлем.УстановитьДействие("ПриИзменении","гкс_ДатаПриИзменении"); 
	//
	Элементы.Переместить(Элементы["гкс_Перенесен"],Элементы.АварийныеРемонты,Элементы.АварийныеРемонтыРемонтВключенВОбщийПлан);
	Элементы.Переместить(Элементы["гкс_ДатаНачала"],Элементы.АварийныеРемонты,Элементы.АварийныеРемонтыРемонтВключенВОбщийПлан);
	Элементы.Переместить(Элементы["гкс_ДатаОкончания"],Элементы.АварийныеРемонты,Элементы.АварийныеРемонтыРемонтВключенВОбщийПлан);
	// гкс+ [Релиз16] Деснол
	Если Параметры.Свойство("ТекущаяСтраница") Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы[Параметры.ТекущаяСтраница];
	КонецЕсли;
	// гкс- [Релиз16]
	// гкс+ [02.23] Деснол 06.02.2023
	НЭлем = Элементы.Вставить("гкс_Комментарий", Тип("ПолеФормы"), Элементы.Группа2, Элементы.ФормаВыполнитьОбработку);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "гкс_Комментарий";
	НЭлем.МногострочныйРежим = Истина;
	НЭлем.АвтоМаксимальнаяШирина = Ложь;
	//
	Элементы.Декорация1.Видимость = Ложь;
	// гкс- [02.23] Деснол 06.02.2023
КонецПроцедуры

&НаКлиенте
Процедура гкс_ПриОткрытииПосле(Отказ)
	ЗавершитьЗамерОткрытияФормы(ВремяНачалаЗамера);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
&ИзменениеИКонтроль("ВыполнитьОбработкуНаСервере")
Функция Расш_гкс_ВыполнитьОбработкуНаСервере()

	ОбрабатываемыеСтроки.Загрузить(Объект.ЗакрываемыеРемонты.Выгрузить(Новый Структура("Обрабатывать", Истина)));

	НовыеДатыЗаполнены = Истина;
	Для Каждого Строка Из ОбрабатываемыеСтроки Цикл
		Если Строка.Перенесен И Не ЗначениеЗаполнено(Строка.НоваяДатаНачала) и Не ЗначениеЗаполнено(Строка.НоваяДатаОкончания) Тогда
			НовыеДатыЗаполнены = Ложь;
			НомерСтроки = ОбрабатываемыеСтроки.Индекс(Строка) + 1;
			ШаблонСообщения = НСтр("es='¡En la línea № %1 no es rellenado el nuevo período de la reparación!';ru='В строке № %1 не заполнен новый период ремонта!';en='In line No.%1 a new repair period is not filled!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		ИначеЕсли Строка.Перенесен И (Строка.НоваяДатаНачала > Строка.НоваяДатаОкончания 
			ИЛИ (Не ЗначениеЗаполнено(Строка.НоваяДатаНачала) И ЗначениеЗаполнено(Строка.НоваяДатаОкончания))) Тогда
			НовыеДатыЗаполнены = Ложь;
			НомерСтроки = ОбрабатываемыеСтроки.Индекс(Строка) + 1;
			ШаблонСообщения = НСтр("es='¡En la línea № %1 es incorrectamente rellenado el nuevo período de la reparación!';ru='В строке № %1 неверно заполнен новый период ремонта!';en='In line No.%1, the new repair period is incorrectly filled!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЦикла;

	Если не НовыеДатыЗаполнены Тогда
		Возврат Истина;
	КонецЕсли;

	ОбрабатываемыеАварийныеРемонты = Объект.АварийныеРемонты.Выгрузить(Новый Структура("Обрабатывать", Истина));
	Для Каждого Строка Из ОбрабатываемыеАварийныеРемонты Цикл
		#Вставка
		Если Строка.гкс_Перенесен = Истина И ЗначениеЗаполнено(Строка.Заявка) Тогда
			Продолжить;
		КонецЕсли;
		#КонецВставки
		НовСтрока = ОбрабатываемыеСтроки.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, Строка);
		НовСтрока.Перенесен = Ложь;
	КонецЦикла;

	Возврат Ложь;

КонецФункции

&НаКлиенте
Процедура гкс_ДатаПриИзменении(Элемент)
	ТекДанные = Элементы.АварийныеРемонты.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		Если ЗначениеЗаполнено(ТекДанные.Заявка) Тогда 
			ТекДанные.гкс_Перенесен = Истина;
		Иначе
			ТекДанные.гкс_Перенесен = Ложь;
			ТекДанные.гкс_ДатаНачала = Дата(1,1,1);
			ТекДанные.гкс_ДатаОкончания = Дата(1,1,1);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура гкс_ПеренесенПриИзменении(Элемент)
	ТекДанные = Элементы.АварийныеРемонты.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		Если ЗначениеЗаполнено(ТекДанные.Заявка) = Ложь Тогда 
			ТекДанные.гкс_Перенесен = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("СоздатьДокументЗакрытияЗаявокНаСервере")
Функция гкс_СоздатьДокументЗакрытияЗаявокНаСервере()

	ТаблицаЗакрываемыхРемонтов = ОбрабатываемыеСтроки.Выгрузить(Новый Структура("Отменен", Истина));
	ТаблицаПеренесенныхРемонтов = ОбрабатываемыеСтроки.Выгрузить(Новый Структура("Перенесен", Истина));
	Для Каждого СтрокаПеренесенных Из ТаблицаПеренесенныхРемонтов Цикл
		СтрокаЗакрываемых = ТаблицаЗакрываемыхРемонтов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаЗакрываемых,СтрокаПеренесенных);
	КонецЦикла;
	ТаблицаЗакрываемыхЗаявок = ОбрабатываемыеСтроки.Выгрузить(Новый Структура("ЗакрытьЗаявку", Истина), "Заявка, ID, ПричинаЗакрытияЗаявки");
	ТаблицаЗакрываемыхЗаявок.Колонки.ПричинаЗакрытияЗаявки.Имя = "ПричинаЗакрытия";
	ТаблицаЗакрываемыхЗаявок.Колонки.ID.Имя = "ИДРемонта";

	ДокументЗакрытиеЗаявокИРемонтов = Документы.торо_ЗакрытиеЗаявокИРемонтов.СоздатьДокумент();

	Если ЗначениеЗаполнено(Владелец) Тогда
		ДокументЗакрытиеЗаявокИРемонтов.ППРИнициатор = Владелец;
	КонецЕсли;

	ДокументЗакрытиеЗаявокИРемонтов.ЗакрываемыеЗаявки.Загрузить(ТаблицаЗакрываемыхЗаявок);
	ДокументЗакрытиеЗаявокИРемонтов.ЗакрываемыеРемонты.Загрузить(ТаблицаЗакрываемыхРемонтов);
	ДокументЗакрытиеЗаявокИРемонтов.ДатаАктуальности = Объект.ДатаАктуальности;
	ДокументЗакрытиеЗаявокИРемонтов.Дата = ТекущаяДата();
	#Вставка
	Если Не ЭтотОбъект["гкс_СдвигЧП"] = 0 Тогда 
		ДобавитьСекунд = (ЭтотОбъект["гкс_СдвигЧП"] * -3600);
		Для Каждого СтрокаТаблицы Из ДокументЗакрытиеЗаявокИРемонтов.ЗакрываемыеРемонты Цикл
			Если ЗначениеЗаполнено(СтрокаТаблицы.НоваяДатаНачала) Тогда 
				СтрокаТаблицы.НоваяДатаНачала = СтрокаТаблицы.НоваяДатаНачала + ДобавитьСекунд;
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрокаТаблицы.НоваяДатаОкончания) Тогда 
				СтрокаТаблицы.НоваяДатаОкончания = СтрокаТаблицы.НоваяДатаОкончания + ДобавитьСекунд;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	// гкс+ [02.23] Деснол 06.02.2023
	ДокументЗакрытиеЗаявокИРемонтов.гкс_Комментарий = ЭтотОбъект["гкс_Комментарий"];
	// гкс- [02.23] Деснол 06.02.2023
	#КонецВставки

	ДокументЗакрытиеЗаявокИРемонтов.Организация = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР", "ОсновнаяОрганизация", Истина);
	ДокументЗакрытиеЗаявокИРемонтов.Ответственный = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР", "ОсновнойОтветственный", Справочники.Пользователи.ПустаяСсылка());	

	ДокументЗакрытиеЗаявокИРемонтов.ДополнительныеСвойства.Вставить("ИзОбработки", Истина);
	Попытка

		ДокументЗакрытиеЗаявокИРемонтов.Записать(РежимЗаписиДокумента.Проведение);

		мУдаления = Новый Массив;
		Для каждого текСтрока из Объект.ЗакрываемыеРемонты Цикл
			Если текСтрока.Обрабатывать и (текСтрока.Отменен или текСтрока.Перенесен или текСтрока.ЗакрытьЗаявку) тогда
				мУдаления.Добавить(текСтрока);
			КонецЕсли;
		КонецЦикла;
		Для каждого текСтрока из мУдаления Цикл
			Объект.ЗакрываемыеРемонты.Удалить(текСтрока);
		КонецЦикла;

		мУдаления.Очистить();
		#Вставка
		ДвиженияПоРегиструАктуальныхДат();
		Для Каждого Строка Из Объект.АварийныеРемонты Цикл
			Если Строка.Обрабатывать = Истина И Строка.гкс_Перенесен = Истина И ЗначениеЗаполнено(Строка.Заявка) Тогда
				мУдаления.Добавить(Строка);
			КонецЕсли;
		КонецЦикла;
		#КонецВставки
		Для каждого текСтрока из Объект.АварийныеРемонты Цикл
			Если текСтрока.Обрабатывать и (текСтрока.Отменен или текСтрока.ЗакрытьЗаявку) тогда
				мУдаления.Добавить(текСтрока);
			КонецЕсли;
		КонецЦикла;
		Для каждого текСтрока из мУдаления Цикл
			Объект.АварийныеРемонты.Удалить(текСтрока);
		КонецЦикла;
		ЗаполнитьПлановыеРемонтыНаСервере();
		ЗаполнитьАварийныеРемонтыНаСервере();
		#Вставка
		// гкс+ [02.23] Деснол 06.02.2023
		ЭтотОбъект["гкс_Комментарий"] = "";
		// гкс- [02.23] Деснол 06.02.2023
		#КонецВставки
		Возврат Истина;

	Исключение
		ТекстСообщения = НСтр("es='¡No consiguió anotar el documento ""el Cierre de las demandas y las reparaciones""! ';ru='Не удалось записать документ ""Закрытие заявок и ремонтов""! ';en='Failed to write the document ""Closing applications and repairs""! '") + ОписаниеОшибки();
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецПопытки;

КонецФункции

&НаСервере
Процедура ДвиженияПоРегиструАктуальныхДат()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧ.ID КАК ID,
		// гкс+ [02.23] Деснол 06.02.2023
		|	ТЧ.Заявка КАК Заявка,
		// гкс- [02.23] Деснол 06.02.2023
		|	ТЧ.гкс_Перенесен КАК Перенесен,
		|	ТЧ.Отменен КАК Отменен,
		|	ТЧ.гкс_ДатаНачала КАК ДатаНачала,
		|	ТЧ.гкс_ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ Исходные
		|ИЗ
		|	&ТЧ КАК ТЧ
		|ГДЕ
		|	ТЧ.Обрабатывать = ИСТИНА
		|	И ТЧ.гкс_Перенесен = ИСТИНА
		|	И ТЧ.Отменен = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Исходные.ID КАК IDРемонта,
		// гкс+ [02.23] Деснол 06.02.2023
		|	Исходные.Заявка КАК Заявка,
		// гкс- [02.23] Деснол 06.02.2023
		|	Исходные.ДатаНачала КАК ДатаНачала,
		|	Исходные.ДатаОкончания КАК ДатаОкончания,
		|	торо_АктуальныеПлановыеДатыРемонтов.КрайняяДатаЗавершения КАК КрайняяДатаЗавершения,
		|	торо_АктуальныеПлановыеДатыРемонтов.ДокументНачалаЦепочки КАК ДокументНачалаЦепочки,
		|	ЕстьNULL(торо_АктуальныеПлановыеДатыРемонтов.ДокументОснование, торо_ПлановыеРемонтныеРаботыСрезПоследних.Регистратор) КАК ДокументОснование,
		|	торо_АктуальныеПлановыеДатыРемонтов.ОбъектРемонта КАК ОбъектРемонта
		|ИЗ
		|	Исходные КАК Исходные
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(
		|				,
		|				ID В
		|					(ВЫБРАТЬ
		|						ТЧ.ID
		|					ИЗ
		|						Исходные КАК ТЧ)) КАК торо_ПлановыеРемонтныеРаботыСрезПоследних
		|		ПО Исходные.ID = торо_ПлановыеРемонтныеРаботыСрезПоследних.ID
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК торо_АктуальныеПлановыеДатыРемонтов
		|		ПО (торо_АктуальныеПлановыеДатыРемонтов.IDРемонта = Исходные.ID)
		|ГДЕ
		|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Регистратор ЕСТЬ NULL";
	Запрос.УстановитьПараметр("ТЧ",Объект.АварийныеРемонты.Выгрузить(,"ID,Обрабатывать,гкс_Перенесен,Отменен,гкс_ДатаНачала,гкс_ДатаОкончания,Заявка"));
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	ДобавитьСекунд = (ЭтотОбъект["гкс_СдвигЧП"] * -3600);
	МассивПеренесенных = Новый Массив();
	Пока Выборка.Следующий() Цикл
		НЗ = РегистрыСведений.торо_АктуальныеПлановыеДатыРемонтов.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(НЗ, Выборка);
		Если ЗначениеЗаполнено(НЗ.ДатаНачала) Тогда 
			НЗ.ДатаНачала = НЗ.ДатаНачала + ДобавитьСекунд;
		КонецЕсли;
		Если ЗначениеЗаполнено(НЗ.ДатаОкончания) Тогда 
			НЗ.ДатаОкончания = НЗ.ДатаОкончания + ДобавитьСекунд;
		КонецЕсли;
		Если Выборка.КрайняяДатаЗавершения < Выборка.ДатаОкончания Тогда 
			НЗ.КрайняяДатаЗавершения = Выборка.ДатаОкончания;
		КонецЕсли;
		// гкс+ [02.23] Деснол 06.02.2023
		Если ЗначениеЗаполнено(Выборка.Заявка) Тогда 
			НЗ.ДокументОснование = Выборка.Заявка;
			МассивПеренесенных.Добавить(Выборка.Заявка);
		КонецЕсли;
		// гкс- [02.23] Деснол 06.02.2023
		// гкс+ [] Деснол 16.08.2022
		НЗ.гкс_ЭтоПереносРемонта = Истина;
		// гкс- [] Деснол 16.08.2022
		НЗ.Записать();
	КонецЦикла;
	//
	Если МассивПеренесенных.Количество() Тогда
		СобытиеСсылка = Константы.гкс_СобытиеПереносРемонтаЗаявки.Получить();
		Если ЗначениеЗаполнено(СобытиеСсылка) Тогда 
		// найти заявки по ремонтам и сформировать уведомления
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	РегистрСведенийторо_ЗаявкиПоРемонтам.IDРемонта КАК ИД,
		               |	МАКСИМУМ(РегистрСведенийторо_ЗаявкиПоРемонтам.Регистратор) КАК Ссылка
		               |ИЗ
		               |	РегистрСведений.торо_ЗаявкиПоРемонтам КАК РегистрСведенийторо_ЗаявкиПоРемонтам
		               |ГДЕ
		               |	РегистрСведенийторо_ЗаявкиПоРемонтам.IDРемонта В(&ИД)
		               |	И РегистрСведенийторо_ЗаявкиПоРемонтам.Регистратор ССЫЛКА Документ.торо_ЗаявкаНаРемонт
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РегистрСведенийторо_ЗаявкиПоРемонтам.IDРемонта";
		Запрос.УстановитьПараметр("ИД", МассивПеренесенных);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда 
			
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				МассивСвойств = Новый Массив();
				НайдСтр = Объект.АварийныеРемонты.НайтиСтроки(Новый Структура("ID", Выборка.ИД));
				Если НайдСтр.Количество() > 0 Тогда 
					МассивСвойств.Добавить(Новый Структура("Ключ,Значение", "НоваяДатаНачала", НайдСтр[0].НоваяДатаНачала + ДобавитьСекунд));
					МассивСвойств.Добавить(Новый Структура("Ключ,Значение", "НоваяДатаОкончания", НайдСтр[0].НоваяДатаОкончания + ДобавитьСекунд));
				КонецЕсли;
				торо_РаботаСУведомлениями.гкс_ЗаписатьУведомленияСрокаСогласования(Выборка.Ссылка, СобытиеСсылка, Новый Массив(), , МассивСвойств);
			КонецЦикла;
		КонецЕсли;
		//
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ВыполнитьОбработкуФрагмент")
Процедура Расш_гкс_ВыполнитьОбработкуФрагмент(Знач МассивНезаполненныхСтрок)
    
    Перем ДокументСоздан, Строка;
    
    Для Каждого Строка Из МассивНезаполненныхСтрок Цикл
        ОбрабатываемыеСтроки.Удалить(Строка);
    КонецЦикла;

	Если ОбрабатываемыеСтроки.Количество()=0 Тогда
		#Вставка
		Для Каждого Строка Из Объект.АварийныеРемонты Цикл
			Если Строка.Обрабатывать = Истина И Строка.гкс_Перенесен = Истина И ЗначениеЗаполнено(Строка.Заявка) Тогда
				ДвиженияПоРегиструАктуальныхДат();
				мУдаления = Новый Массив();
				Для Каждого Строка Из Объект.АварийныеРемонты Цикл
					Если Строка.Обрабатывать = Истина И Строка.гкс_Перенесен = Истина И ЗначениеЗаполнено(Строка.Заявка) Тогда
						мУдаления.Добавить(Строка);
					КонецЕсли;
				КонецЦикла;
				Для каждого текСтрока из мУдаления Цикл
					Объект.АварийныеРемонты.Удалить(текСтрока);
				КонецЦикла;
				Возврат;
			КонецЕсли;
		КонецЦикла;
		#КонецВставки
		ТекстСообщения = НСтр("es='Ni para una de las líneas escogidas no es indicado el tipo del tratamiento: ¡la anulación/traslado de la reparación o el cierre de la demanda! ¡El tratamiento no es cumplido!';ru='Ни для одной из выбранных строк не указан вид обработки: отмена/перенос ремонта или закрытие заявки! Обработка не выполнена!';en='No type of processing is indicated for any of the selected lines: cancellation / transfer of repairs or closing of an application! Processing failed!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;

	ДокументСоздан = СоздатьДокументЗакрытияЗаявокНаСервере();

	Если ДокументСоздан Тогда

		Если НЕ ЗначениеЗаполнено(Владелец) Тогда
			Оповестить("ВыполненПереносРемонтов", ЭтаФорма.КлючУникальности, ЭтаФорма);
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры


&НаКлиенте
&ИзменениеИКонтроль("ВыполнитьОбработку")
Процедура гкс_ВыполнитьОбработку(Команда)
	#Вставка
	// гкс+ [02.23] Деснол 06.02.2023
	ОчиститьСообщения();
	Если Не ЗначениеЗаполнено(ЭтотОбъект["гкс_Комментарий"]) Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Комментарий не заполнен";
		Сообщение.Поле = "гкс_Комментарий";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	// гкс- [02.23] Деснол 06.02.2023
	#КонецВставки

	отказ = ВыполнитьОбработкуНаСервере();

	ПричиныНеЗаполнены = Ложь;
	Для Каждого Строка Из ОбрабатываемыеСтроки Цикл
		Если ((Строка.Отменен ИЛИ Строка.Перенесен) И НЕ ЗначениеЗаполнено(Строка.ПричинаЗакрытия))
			ИЛИ (Строка.ЗакрытьЗаявку И НЕ ЗначениеЗаполнено(Строка.ПричинаЗакрытияЗаявки)) Тогда
			Если ЗначениеЗаполнено(Владелец) Тогда
				ПоказатьПредупреждение(Неопределено,НСтр("es='No para todas las reparaciones cerradas (los Presupuestos de la reparación (¡las Demandas por la reparación) es indicada la Causa del cierre! ¡El tratamiento no es cumplido!';ru='Не для всех закрываемых ремонтов (Смет ремонта(Заявок на ремонт) указана Причина закрытия! Обработка не выполнена!';en='Not for all repairs to be closed (Repair estimates (Repair requests), the reason for closing is indicated! Processing failed!'"));
			Иначе
				ТекстСообщения = НСтр("es='No para todas las reparaciones cerradas (los Presupuestos de la reparación (¡las Demandas por la reparación) es indicada la Causa del cierre! ¡El tratamiento no es cumplido!';ru='Не для всех закрываемых ремонтов (Смет ремонта(Заявок на ремонт) указана Причина закрытия! Обработка не выполнена!';en='Not for all repairs to be closed (Repair estimates (Repair requests), the reason for closing is indicated! Processing failed!'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;

			ПричиныНеЗаполнены = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Если отказ или ПричиныНеЗаполнены Тогда
		Возврат;
	КонецЕсли;

	МассивНезаполненныхСтрок = ОбрабатываемыеСтроки.НайтиСтроки(Новый Структура("Обрабатывать, Отменен, Перенесен, ЗакрытьЗаявку", Истина, Ложь, Ложь, Ложь));
	Если МассивНезаполненныхСтрок.Количество()>0 Тогда
		Ответ = Неопределено;

		ПоказатьВопрос(Новый ОписаниеОповещения("ВыполнитьОбработкуЗавершение", ЭтотОбъект, Новый Структура("МассивНезаполненныхСтрок", МассивНезаполненныхСтрок)), НСтр("es='No para todas las líneas tratadas es indicado el tipo del tratamiento de la reparación (es anulado o llevado) o la demanda. ¿Da lo mismo cumplir el tratamiento?';ru='Не для всех обрабатываемых строк указан вид обработки ремонта (отменен или перенесен) или заявки. Все равно выполнить обработку?';en='Not all processed lines indicate the type of repair processing (canceled or rescheduled) or application. Do the processing anyway?'"), РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;

	// Выполняем создание нового документа торо_ЗакрытиеЗаявокИРемонтов.
	ВыполнитьОбработкуФрагмент(МассивНезаполненныхСтрок);

	Оповестить("ЗакрытиеЗаявокИРемонтов", Неопределено);
КонецПроцедуры


&НаСервере
&ИзменениеИКонтроль("ЗаполнитьПлановыеРемонтыНаСервере")
Процедура гкс_ЗаполнитьПлановыеРемонтыНаСервере(ОтборРемонтов)
	#Вставка
	// Гкс+[TOIR20-607] Оселедько В.С. от 17.07.2025. Добавлено:{
	ВремяНачалаЗамераЗаполненияТЧ = ОценкаПроизводительности.НачатьЗамерВремени();
	// } Гкс-[TOIR20-607] Оселедько В.С. от 17.07.2025.
	#КонецВставки
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РемонтыЗаявок.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ РемонтыСАктамиНарядами
	|ИЗ
	|	РегистрСведений.торо_ЗаявкиПоРемонтам КАК РемонтыЗаявок
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_НарядыПоРемонтам КАК торо_НарядыПоРемонтам
	|		ПО РемонтыЗаявок.IDРемонта = торо_НарядыПоРемонтам.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктыПоРемонтам КАК торо_АктыПоРемонтам
	|		ПО РемонтыЗаявок.IDРемонта = торо_АктыПоРемонтам.IDРемонта
	|ГДЕ
	|	НЕ(торо_НарядыПоРемонтам.IDРемонта ЕСТЬ NULL
	|				И торо_АктыПоРемонтам.IDРемонта ЕСТЬ NULL)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_ЗаявкиПоРемонтам.IDРемонта КАК ID,
	|	РемонтыСАктамиНарядами.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ РемонтыЗаявокСАктамиНарядами
	|ИЗ
	|	РемонтыСАктамиНарядами КАК РемонтыСАктамиНарядами
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗаявкиПоРемонтам КАК торо_ЗаявкиПоРемонтам
	|		ПО РемонтыСАктамиНарядами.Регистратор = торо_ЗаявкиПоРемонтам.Регистратор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ID КАК ID,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Регистратор КАК Регистратор,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаНачалаРемонтныхРабот КАК ДатаНачалаРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаОкончанияРемонтныхРабот КАК ДатаОкончанияРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ОбъектРемонтныхРабот КАК ОбъектРемонта,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ВидРемонтныхРабот КАК ВидРемонта
	|ПОМЕСТИТЬ РемонтыПлановыеИДефекты
	|ИЗ
	|	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних КАК торо_ПлановыеРемонтныеРаботыСрезПоследних
	|ГДЕ
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаНачалаРемонтныхРабот <= &ДатаАктуальности
	|	И НЕ торо_ПлановыеРемонтныеРаботыСрезПоследних.Замещен
	|	И НЕ торо_ПлановыеРемонтныеРаботыСрезПоследних.Отменен
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РемонтыПлановыеИДефекты.ID КАК ID,
	|	РемонтыПлановыеИДефекты.Регистратор КАК Регистратор,
	|	РемонтыПлановыеИДефекты.ДатаНачалаРемонтныхРабот КАК ДатаНачалаРемонтныхРабот,
	|	РемонтыПлановыеИДефекты.ДатаОкончанияРемонтныхРабот КАК ДатаОкончанияРемонтныхРабот,
	|	РемонтыПлановыеИДефекты.ОбъектРемонта КАК ОбъектРемонта,
	|	РемонтыПлановыеИДефекты.ВидРемонта КАК ВидРемонта
	|ПОМЕСТИТЬ РемонтыПлановыеСПодчиненными
	|ИЗ
	|	РемонтыПлановыеИДефекты КАК РемонтыПлановыеИДефекты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_НарядыПоРемонтам КАК торо_НарядыПоРемонтам
	|		ПО РемонтыПлановыеИДефекты.ID = торо_НарядыПоРемонтам.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктыПоРемонтам КАК торо_АктыПоРемонтам
	|		ПО РемонтыПлановыеИДефекты.ID = торо_АктыПоРемонтам.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РемонтыЗаявокСАктамиНарядами КАК РемонтыЗаявокСАктамиНарядами
	|		ПО РемонтыПлановыеИДефекты.ID = РемонтыЗаявокСАктамиНарядами.ID
	|ГДЕ
	|	торо_НарядыПоРемонтам.IDРемонта ЕСТЬ NULL
	|	И торо_АктыПоРемонтам.IDРемонта ЕСТЬ NULL
	|	И РемонтыЗаявокСАктамиНарядами.ID ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	РемонтыПлановыеСПодчиненными.ID КАК ID,
	|	РемонтыПлановыеСПодчиненными.ОбъектРемонта КАК ОбъектРемонта,
	|	РемонтыПлановыеСПодчиненными.ВидРемонта КАК ВидРемонта,
	|	РемонтыПлановыеСПодчиненными.ДатаНачалаРемонтныхРабот КАК ДатаНачалаРемонтныхРабот,
	|	РемонтыПлановыеСПодчиненными.ДатаОкончанияРемонтныхРабот КАК ДатаОкончанияРемонтныхРабот,
	|	ВЫБОР
	|		КОГДА НЕ Заявки.Регистратор ЕСТЬ NULL
	|				И торо_ОтмененныеЗаявки.Заявка ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьЗаявка,
	|	Заявки.Регистратор КАК Смета,
	|	РемонтыПлановыеСПодчиненными.Регистратор КАК Регистратор,
	|	Константы.торо_ПричинаЗакрытияРемонтов КАК ПричинаЗакрытия,
	|	Константы.торо_ПричинаЗакрытияЗаявок КАК ПричинаЗакрытияЗаявки,
	|	Константы.торо_ОтменятьЗакрытиеЗаявок КАК Отменен,
	|	РемонтыПлановыеСПодчиненными.Регистратор КАК ДокументОснование,
	|	Заявки.МоментВремени КАК ДатаЗаявки,
	|	РемонтыПлановыеСПодчиненными.Регистратор.МоментВремени КАК ДатаДокументаОснования
	|ПОМЕСТИТЬ ТабСДублями
	|ИЗ
	|	РемонтыПлановыеСПодчиненными КАК РемонтыПлановыеСПодчиненными
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗаявкиПоРемонтам КАК Заявки
	|		ПО РемонтыПлановыеСПодчиненными.ID = Заявки.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОтмененныеЗаявки КАК торо_ОтмененныеЗаявки
	|		ПО (Заявки.Регистратор = торо_ОтмененныеЗаявки.Заявка)
	|			И РемонтыПлановыеСПодчиненными.ID = торо_ОтмененныеЗаявки.ИДРемонта,
	|	Константы КАК Константы
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID,
	|	Смета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТабСДублями.ID КАК ID,
	|	ТабСДублями.ОбъектРемонта КАК ОбъектРемонта,
	|	ТабСДублями.ВидРемонта КАК ВидРемонта,
	|	ТабСДублями.ЕстьЗаявка КАК ЕстьЗаявка,
	|	ТабСДублями.Регистратор КАК Регистратор,
	|	ТабСДублями.ПричинаЗакрытия КАК ПричинаЗакрытия,
	|	ТабСДублями.ПричинаЗакрытияЗаявки КАК ПричинаЗакрытияЗаявки,
	|	ТабСДублями.Отменен КАК Отменен,
	|	ТабСДублями.ДокументОснование КАК ДокументОснование,
	|	ВЫБОР
	|		КОГДА ТабСДублями.ЕстьЗаявка
	|				И ТабСДублями.ДатаЗаявки > ТабСДублями.ДатаДокументаОснования
	|			ТОГДА Заявки.ДатаНачалаРемонтныхРабот
	|		ИНАЧЕ ТабСДублями.ДатаНачалаРемонтныхРабот
	|	КОНЕЦ КАК ДатаНачала,
	|	ВЫБОР
	|		КОГДА ТабСДублями.ЕстьЗаявка
	|				И ТабСДублями.ДатаЗаявки > ТабСДублями.ДатаДокументаОснования
	|			ТОГДА Заявки.ДатаОкончанияРемонтныхРабот
	|		ИНАЧЕ ТабСДублями.ДатаОкончанияРемонтныхРабот
	|	КОНЕЦ КАК ДатаОкончания,
	|	ВЫБОР
	|		КОГДА ТабСДублями.ЕстьЗаявка
	|			ТОГДА ТабСДублями.Смета
	|		ИНАЧЕ &ПустаяСсылкаНаЗаявку
	|	КОНЕЦ КАК Заявка
	|ПОМЕСТИТЬ ПодготовленныеДанные
	|ИЗ
	|	ТабСДублями КАК ТабСДублями
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗаявкиПоРемонтам КАК Заявки
	|		ПО ТабСДублями.ID = Заявки.IDРемонта
	|			И ТабСДублями.Смета = Заявки.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ВыявленныеДефекты.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_РазрешенныеДокументы
	|ИЗ
	|	Документ.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефекты
	|ГДЕ
	|	торо_ВыявленныеДефекты.Ссылка В
	|			(ВЫБРАТЬ
	|				ПодготовленныеДанные.ДокументОснование КАК ДокументОснование
	|			ИЗ
	|				ПодготовленныеДанные КАК ПодготовленныеДанные)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ЗаявкаНаРемонт.Ссылка
	|ИЗ
	|	Документ.торо_ЗаявкаНаРемонт КАК торо_ЗаявкаНаРемонт
	|ГДЕ
	|	торо_ЗаявкаНаРемонт.Ссылка В
	|			(ВЫБРАТЬ
	|				ПодготовленныеДанные.ДокументОснование КАК ДокументОснование
	|			ИЗ
	|				ПодготовленныеДанные КАК ПодготовленныеДанные)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ПланГрафикРемонта.Ссылка
	|ИЗ
	|	Документ.торо_ПланГрафикРемонта КАК торо_ПланГрафикРемонта
	|ГДЕ
	|	торо_ПланГрафикРемонта.Ссылка В
	|			(ВЫБРАТЬ
	|				ПодготовленныеДанные.ДокументОснование КАК ДокументОснование
	|			ИЗ
	|				ПодготовленныеДанные КАК ПодготовленныеДанные)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ЗакрытиеЗаявокИРемонтов.Ссылка
	|ИЗ
	|	Документ.торо_ЗакрытиеЗаявокИРемонтов КАК торо_ЗакрытиеЗаявокИРемонтов
	|ГДЕ
	|	торо_ЗакрытиеЗаявокИРемонтов.Ссылка В
	|			(ВЫБРАТЬ
	|				ПодготовленныеДанные.ДокументОснование КАК ДокументОснование
	|			ИЗ
	|				ПодготовленныеДанные КАК ПодготовленныеДанные)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПодготовленныеДанные.ID КАК ID,
	|	ПодготовленныеДанные.ОбъектРемонта КАК ОбъектРемонта,
	|	ПодготовленныеДанные.ВидРемонта КАК ВидРемонта,
	|	ПодготовленныеДанные.ЕстьЗаявка КАК ЕстьЗаявка,
	|	ПодготовленныеДанные.Регистратор КАК Регистратор,
	|	ПодготовленныеДанные.ПричинаЗакрытия КАК ПричинаЗакрытия,
	|	ПодготовленныеДанные.ПричинаЗакрытияЗаявки КАК ПричинаЗакрытияЗаявки,
	|	ПодготовленныеДанные.Отменен КАК Отменен,
	|	ПодготовленныеДанные.ДокументОснование КАК ДокументОснование,
	|	ПодготовленныеДанные.Заявка КАК Заявка,
	|	ПодготовленныеДанные.ДатаНачала КАК ДатаНачала,
	|	ПодготовленныеДанные.ДатаОкончания КАК ДатаОкончания
	|ПОМЕСТИТЬ ДанныеСДублямиРемонтов
	|ИЗ
	|	ПодготовленныеДанные КАК ПодготовленныеДанные
	|ГДЕ
	|	ПодготовленныеДанные.ДокументОснование В
	|			(ВЫБРАТЬ
	|				ВТ_РазрешенныеДокументы.Ссылка КАК Ссылка
	|			ИЗ
	|				ВТ_РазрешенныеДокументы КАК ВТ_РазрешенныеДокументы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.ID КАК ID
	|ПОМЕСТИТЬ ДублиРемонтов
	|ИЗ
	|	ДанныеСДублямиРемонтов КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.ID
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ВТ.ID) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_СкользящийПланРаботСрезПоследних.ID_Ремонта КАК ID_Ремонта
	|ПОМЕСТИТЬ вт_РемонтыИзОбщегоПлана
	|ИЗ
	|	РегистрСведений.торо_СкользящийПланРабот.СрезПоследних(
	|			,
	|			ID_Ремонта В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ДанныеСДублямиРемонтов.ID КАК ID
	|				ИЗ
	|					ДанныеСДублямиРемонтов КАК ДанныеСДублямиРемонтов)) КАК торо_СкользящийПланРаботСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID_Ремонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.ID КАК ID,
	|	&&ОтборРемонтов КАК ПодходитПодОтбор,
	|	ВТ.ОбъектРемонта КАК ОбъектРемонта,
	|	ВТ.ВидРемонта КАК ВидРемонта,
	|	ВТ.ЕстьЗаявка КАК ЕстьЗаявка,
	|	ВТ.Регистратор КАК Регистратор,
	|	ВТ.ПричинаЗакрытия КАК ПричинаЗакрытия,
	|	ВТ.ПричинаЗакрытияЗаявки КАК ПричинаЗакрытияЗаявки,
	|	ВТ.Отменен КАК Отменен,
	|	ВТ.ДокументОснование КАК ДокументОснование,
	|	ВТ.Заявка КАК Заявка,
	|	ВТ.ДатаНачала КАК ДатаНачала,
	|	ВТ.ДатаОкончания КАК ДатаОкончания,
	|	ВЫБОР
	|		КОГДА вт_РемонтыИзОбщегоПлана.ID_Ремонта ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК РемонтВключенВОбщийПлан
	|ИЗ
	|	ДанныеСДублямиРемонтов КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДублиРемонтов КАК ДублиРемонтов
	|		ПО ВТ.ID = ДублиРемонтов.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_РемонтыИзОбщегоПлана КАК вт_РемонтыИзОбщегоПлана
	|		ПО ВТ.ID = вт_РемонтыИзОбщегоПлана.ID_Ремонта
	|ГДЕ
	|	(ВТ.ЕстьЗаявка
	|			ИЛИ ДублиРемонтов.ID ЕСТЬ NULL)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаНачала";
	#Вставка
	Запрос.Текст = ТекстЗапросаЗаполнитьПлановыеРемонтыНаСервере();
	Если ОтборРемонтов = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "РемонтыЗаявок.IDРемонта В (&ОтборРемонтов)", "ИСТИНА");
		// Гкс+[TOIR20-382] Лебедев Н.А. от 12.07.2023. Добавлено:{
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "торо_ПлановыеРемонтныеРаботы.ID В (&ОтборРемонтов)", "ИСТИНА");		
		// } Гкс-[TOIR20-382] Лебедев Н.А. от 12.07.2023.
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "торо_ПлановыеРемонтныеРаботыСрезПоследних.ID В (&ОтборРемонтов)", "ИСТИНА");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "РемонтыПлановыеИДефекты.ID В (&ОтборРемонтов)", "ИСТИНА");
	// Гкс+[TOIR20-382] Лебедев Н.А. от 12.07.2023. Добавлено:{	
		Если НЕ ЗначениеЗаполнено(ДатаНачалаРемонтныхРаботОтбор) Тогда  
			ДатаНачалаРемонтныхРаботОтбор = ТекущаяДатаСеанса() - 14 * 86400;
		КонецЕсли;
		Запрос.УстановитьПараметр("ДатаНачалаРемонтныхРаботОтбор", ДатаНачалаРемонтныхРаботОтбор);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,  "РемонтыЗаявок.ДатаНачалаРемонтныхРабот >= &ДатаНачалаРемонтныхРаботОтбор", "ИСТИНА");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,  "торо_ПлановыеРемонтныеРаботы.ДатаНачалаРемонтныхРабот >= &ДатаНачалаРемонтныхРаботОтбор", "ИСТИНА");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,  "ВТ.ДатаНачала >= &ДатаНачалаРемонтныхРаботОтбор", "ИСТИНА");
	// } Гкс-[TOIR20-382] Лебедев Н.А. от 12.07.2023.	
	КонецЕсли; 
	#КонецВставки

	Запрос.УстановитьПараметр("ДатаАктуальности", Объект.ДатаАктуальности);
	Запрос.УстановитьПараметр("ПустаяСсылкаНаЗаявку", Документы.торо_ЗаявкаНаРемонт.ПустаяСсылка());

	Если Не ОтборРемонтов = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&&ОтборРемонтов", "ВЫБОР 
		|		КОГДА ВТ.ID В (&ОтборРемонтов)
		|			ТОГДА ИСТИНА
		|        ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ");
		Запрос.УстановитьПараметр("ОтборРемонтов", ОтборРемонтов);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&&ОтборРемонтов", "ИСТИНА");
	КонецЕсли; 

	Результат = Запрос.Выполнить();

	Объект.ЗакрываемыеРемонты.Очистить();
	Объект.ЗакрываемыеРемонты.Загрузить(Результат.Выгрузить());
	#Вставка
	// Гкс+[TOIR20-607] Оселедько В.С. от 17.07.2025. Добавлено:{
	ИмяКлючевойОперации = "Обработка.торо_ЗакрытиеЗаявокИРемонтов.ЗаполнениеТабличнойЧастиЗакрываемыеРемонты";
	ОценкаПроизводительности.ЗакончитьЗамерВремени(ИмяКлючевойОперации, ВремяНачалаЗамераЗаполненияТЧ); 
	// } Гкс-[TOIR20-607] Оселедько В.С. от 17.07.2025.
	#КонецВставки
КонецПроцедуры      

&НаСервере
&ИзменениеИКонтроль("ЗаполнитьАварийныеРемонтыНаСервере")
Процедура гкс_ЗаполнитьАварийныеРемонтыНаСервере(ОтборРемонтов)
	#Вставка
	// Гкс+[TOIR20-607] Оселедько В.С. от 17.07.2025. Добавлено:{
	ВремяНачалаЗамераЗаполненияТЧ = ОценкаПроизводительности.НачатьЗамерВремени();
	// } Гкс-[TOIR20-607] Оселедько В.С. от 17.07.2025.
	#КонецВставки
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РемонтыЗаявок.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ РемонтыСАктамиНарядами
	|ИЗ
	|	РегистрСведений.торо_ЗаявкиПоРемонтам КАК РемонтыЗаявок
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_НарядыПоРемонтам КАК торо_НарядыПоРемонтам
	|		ПО РемонтыЗаявок.IDРемонта = торо_НарядыПоРемонтам.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктыПоРемонтам КАК торо_АктыПоРемонтам
	|		ПО РемонтыЗаявок.IDРемонта = торо_АктыПоРемонтам.IDРемонта
	|ГДЕ
	|	НЕ(торо_НарядыПоРемонтам.IDРемонта ЕСТЬ NULL
	|				И торо_АктыПоРемонтам.IDРемонта ЕСТЬ NULL)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_ЗаявкиПоРемонтам.IDРемонта КАК ID,
	|	РемонтыСАктамиНарядами.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ РемонтыЗаявокСАктамиНарядами
	|ИЗ
	|	РемонтыСАктамиНарядами КАК РемонтыСАктамиНарядами
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗаявкиПоРемонтам КАК торо_ЗаявкиПоРемонтам
	|		ПО РемонтыСАктамиНарядами.Регистратор = торо_ЗаявкиПоРемонтам.Регистратор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|"+"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ВыявленныеДефекты.ID КАК ID,
	|	торо_ВыявленныеДефекты.Регистратор КАК Регистратор,
	|	торо_ВыявленныеДефекты.Период КАК Период,
	|	торо_ВыявленныеДефекты.ОтказавшийЭлемент КАК ОбъектРемонта
	|ПОМЕСТИТЬ РемонтыПлановыеИДефекты
	|ИЗ
	|	РегистрСведений.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефекты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОтмененныеРемонты.СрезПоследних КАК торо_ОтмененныеРемонты
	|		ПО торо_ВыявленныеДефекты.ID = торо_ОтмененныеРемонты.ID
	|			И (торо_ОтмененныеРемонты.Отменен)
	|ГДЕ
	|	торо_ОтмененныеРемонты.ID ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	ДокВО.ID,
	|	ДокВО.Регистратор,
	|	ДокВО.Период,
	|	ДокВО.ОбъектРемонта
	|ИЗ
	|	РегистрСведений.торо_ВнешниеОснованияДляРабот.СрезПоследних(, Регистратор ССЫЛКА Документ.торо_ВнешнееОснованиеДляРабот) КАК ДокВО
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОтмененныеРемонты.СрезПоследних КАК торо_ОтмененныеРемонты
	|		ПО ДокВО.ID = торо_ОтмененныеРемонты.ID
	|			И (торо_ОтмененныеРемонты.Отменен)
	|ГДЕ
	|	торо_ОтмененныеРемонты.ID ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID"+"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	РемонтыПлановыеИДефекты.ID КАК ID,
	|	РемонтыПлановыеИДефекты.Регистратор КАК Регистратор,
	|	РемонтыПлановыеИДефекты.Период КАК Период,
	|	РемонтыПлановыеИДефекты.ОбъектРемонта КАК ОбъектРемонта
	|ПОМЕСТИТЬ РемонтыПлановыеСПодчиненными
	|ИЗ
	|	РемонтыПлановыеИДефекты КАК РемонтыПлановыеИДефекты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_НарядыПоРемонтам КАК торо_НарядыПоРемонтам
	|		ПО РемонтыПлановыеИДефекты.ID = торо_НарядыПоРемонтам.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктыПоРемонтам КАК торо_АктыПоРемонтам
	|		ПО РемонтыПлановыеИДефекты.ID = торо_АктыПоРемонтам.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РемонтыЗаявокСАктамиНарядами КАК РемонтыЗаявокСАктамиНарядами
	|		ПО РемонтыПлановыеИДефекты.ID = РемонтыЗаявокСАктамиНарядами.ID
	|ГДЕ
	|	торо_НарядыПоРемонтам.IDРемонта ЕСТЬ NULL
	|	И торо_АктыПоРемонтам.IDРемонта ЕСТЬ NULL
	|	И РемонтыЗаявокСАктамиНарядами.ID ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	РемонтыПлановыеСПодчиненными.ID КАК ID,
	|	РемонтыПлановыеСПодчиненными.ОбъектРемонта КАК ОбъектРемонта,
	|	Константы.торо_ВидРемонтаПриВводеНаОснованииВыявленныхДефектов КАК ВидРемонта,
	|	ВЫБОР
	|		КОГДА НЕ Заявки.Регистратор ЕСТЬ NULL
	|				И торо_ОтмененныеЗаявки.Заявка ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьЗаявка,
	|	РемонтыПлановыеСПодчиненными.Регистратор КАК Регистратор,
	|	Константы.торо_ОтменятьЗакрытиеЗаявок КАК Отменен,
	|	Константы.торо_ПричинаЗакрытияРемонтов КАК ПричинаЗакрытия,
	|	Константы.торо_ПричинаЗакрытияЗаявок КАК ПричинаЗакрытияЗаявки,
	|	РемонтыПлановыеСПодчиненными.Регистратор КАК ДокументОснование,
	|	РемонтыПлановыеСПодчиненными.Период КАК ДатаОбнаружения,
	|	Заявки.Регистратор КАК Заявка
	|ПОМЕСТИТЬ ПодготовленныеДанные
	|ИЗ
	|	РемонтыПлановыеСПодчиненными КАК РемонтыПлановыеСПодчиненными
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗаявкиПоРемонтам КАК Заявки
	|		ПО РемонтыПлановыеСПодчиненными.ID = Заявки.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОтмененныеЗаявки КАК торо_ОтмененныеЗаявки
	|		ПО (Заявки.Регистратор = торо_ОтмененныеЗаявки.Заявка)
	|			И РемонтыПлановыеСПодчиненными.ID = торо_ОтмененныеЗаявки.ИДРемонта,
	|	Константы КАК Константы
	|ГДЕ
	|	РемонтыПлановыеСПодчиненными.Период <= &ДатаАктуальности
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|"+"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ВыявленныеДефекты.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_РазрешенныеДокументы
	|ИЗ
	|	Документ.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефекты
	|ГДЕ
	|	торо_ВыявленныеДефекты.Ссылка В
	|			(ВЫБРАТЬ
	|				ПодготовленныеДанные.Регистратор КАК Регистратор
	|			ИЗ
	|				ПодготовленныеДанные КАК ПодготовленныеДанные)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ЗаявкаНаРемонт.Ссылка
	|ИЗ
	|	Документ.торо_ЗаявкаНаРемонт КАК торо_ЗаявкаНаРемонт
	|ГДЕ
	|	торо_ЗаявкаНаРемонт.Ссылка В
	|			(ВЫБРАТЬ
	|				ПодготовленныеДанные.Регистратор КАК Регистратор
	|			ИЗ
	|				ПодготовленныеДанные КАК ПодготовленныеДанные)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокВО.Ссылка
	|ИЗ
	|	Документ.торо_ВнешнееОснованиеДляРабот КАК ДокВО
	|ГДЕ
	|	ДокВО.Ссылка В
	|			(ВЫБРАТЬ
	|				ПодготовленныеДанные.Регистратор КАК Регистратор
	|			ИЗ
	|				ПодготовленныеДанные КАК ПодготовленныеДанные)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ПланГрафикРемонта.Ссылка
	|ИЗ
	|	Документ.торо_ПланГрафикРемонта КАК торо_ПланГрафикРемонта
	|ГДЕ
	|	торо_ПланГрафикРемонта.Ссылка В
	|			(ВЫБРАТЬ
	|				ПодготовленныеДанные.Регистратор КАК Регистратор
	|			ИЗ
	|				ПодготовленныеДанные КАК ПодготовленныеДанные)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка"+"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПодготовленныеДанные.ID КАК ID,
	|	ПодготовленныеДанные.ОбъектРемонта КАК ОбъектРемонта,
	|	ПодготовленныеДанные.ВидРемонта КАК ВидРемонта,
	|	ПодготовленныеДанные.ЕстьЗаявка КАК ЕстьЗаявка,
	|	ПодготовленныеДанные.Регистратор КАК Регистратор,
	|	ПодготовленныеДанные.Отменен КАК Отменен,
	|	ПодготовленныеДанные.ПричинаЗакрытия КАК ПричинаЗакрытия,
	|	ПодготовленныеДанные.ПричинаЗакрытияЗаявки КАК ПричинаЗакрытияЗаявки,
	|	ПодготовленныеДанные.ДокументОснование КАК ДокументОснование,
	|	ПодготовленныеДанные.ДатаОбнаружения КАК ДатаОбнаружения,
	|	ВЫБОР
	|		КОГДА ПодготовленныеДанные.ЕстьЗаявка
	|			ТОГДА ПодготовленныеДанные.Заявка
	|		ИНАЧЕ &ПустаяСсылкаНаЗаявку
	|	КОНЕЦ КАК Заявка
	|ПОМЕСТИТЬ ДанныеСДублямиРемонтов
	|ИЗ
	|	ПодготовленныеДанные КАК ПодготовленныеДанные
	|ГДЕ
	|	ПодготовленныеДанные.Регистратор В
	|			(ВЫБРАТЬ
	|				ВТ_РазрешенныеДокументы.Ссылка КАК Ссылка
	|			ИЗ
	|				ВТ_РазрешенныеДокументы КАК ВТ_РазрешенныеДокументы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_СкользящийПланРаботСрезПоследних.ID_Ремонта КАК ID_Ремонта
	|ПОМЕСТИТЬ вт_РемонтыИзОбщегоПлана
	|ИЗ
	|	РегистрСведений.торо_СкользящийПланРабот.СрезПоследних(
	|			,
	|			ID_Ремонта В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ДанныеСДублямиРемонтов.ID КАК ID
	|				ИЗ
	|					ДанныеСДублямиРемонтов КАК ДанныеСДублямиРемонтов)) КАК торо_СкользящийПланРаботСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID_Ремонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.ID КАК ID
	|ПОМЕСТИТЬ ДублиРемонтов
	|ИЗ
	|	ДанныеСДублямиРемонтов КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.ID
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ВТ.ID) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.ID КАК ID,
	|	ВТ.ОбъектРемонта КАК ОбъектРемонта,
	|	&&ОтборРемонтов КАК ПодходитПодОтбор,
	|	ВТ.ВидРемонта КАК ВидРемонта,
	|	ВТ.ЕстьЗаявка КАК ЕстьЗаявка,
	|	ВТ.Регистратор КАК Регистратор,
	|	ВТ.Отменен КАК Отменен,
	|	ВТ.ПричинаЗакрытия КАК ПричинаЗакрытия,
	|	ВТ.ПричинаЗакрытияЗаявки КАК ПричинаЗакрытияЗаявки,
	|	ВТ.ДокументОснование КАК ДокументОснование,
	|	ВТ.ДатаОбнаружения КАК ДатаОбнаружения,
	|	ВТ.Заявка КАК Заявка,
	|	ВЫБОР
	|		КОГДА вт_РемонтыИзОбщегоПлана.ID_Ремонта ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК РемонтВключенВОбщийПлан
	|ИЗ
	|	ДанныеСДублямиРемонтов КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДублиРемонтов КАК ДублиРемонтов
	|		ПО ВТ.ID = ДублиРемонтов.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_РемонтыИзОбщегоПлана КАК вт_РемонтыИзОбщегоПлана
	|		ПО ВТ.ID = вт_РемонтыИзОбщегоПлана.ID_Ремонта
	|ГДЕ
	|	(ВТ.ЕстьЗаявка
	|			ИЛИ ДублиРемонтов.ID ЕСТЬ NULL)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаОбнаружения";
	
	#Вставка
	Запрос.Текст = ТекстЗапросаЗаполнитьАварийныеРемонтыНаСервере();
	Если ОтборРемонтов = Неопределено Тогда
		// Гкс+[TOIR20-382] Лебедев Н.А. от 12.07.2023. Добавлено:{
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "РемонтыЗаявок.IDРемонта В(&ОтборРемонтов)", "ИСТИНА");
		// } Гкс-[TOIR20-382] Лебедев Н.А. от 12.07.2023.
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "РемонтыЗаявок.IDРемонта В (&ОтборРемонтов)", "ИСТИНА");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "торо_ВыявленныеДефекты.ID В (&ОтборРемонтов)", "ИСТИНА");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДокВО.ID В (&ОтборРемонтов)", "ИСТИНА");
	// Гкс+[TOIR20-382] Лебедев Н.А. от 12.07.2023. Добавлено:{	
		Если НЕ ЗначениеЗаполнено(ДатаНачалаРемонтныхРаботОтбор) Тогда  
			ДатаНачалаРемонтныхРаботОтбор = ТекущаяДатаСеанса() - 14 * 86400;
		КонецЕсли;
		Запрос.УстановитьПараметр("ДатаНачалаРемонтныхРаботОтбор", ДатаНачалаРемонтныхРаботОтбор);
	Иначе    
		Запрос.Текст = СтрЗаменить(Запрос.Текст,  "торо_ВыявленныеДефекты.ДатаНачалаРемонта >= &ДатаНачалаРемонтныхРаботОтбор", "ИСТИНА"); 
		Запрос.Текст = СтрЗаменить(Запрос.Текст,  "РемонтыЗаявок.ДатаНачалаРемонтныхРабот >= &ДатаНачалаРемонтныхРаботОтбор", "ИСТИНА");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,  "РемонтыПлановыеСПодчиненными.Период >= &ДатаНачалаРемонтныхРаботОтбор", "ИСТИНА");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,  "торо_ВыявленныеДефекты.Период >= &ДатаНачалаРемонтныхРаботОтбор", "ИСТИНА");
	// } Гкс-[TOIR20-382] Лебедев Н.А. от 12.07.2023.	
	КонецЕсли; 
	#КонецВставки
	Запрос.УстановитьПараметр("ДатаАктуальности", КонецДня(Объект.ДатаАктуальности));
	Запрос.УстановитьПараметр("ПустаяСсылкаНаЗаявку", Документы.торо_ЗаявкаНаРемонт.ПустаяСсылка());

	Если Не ОтборРемонтов = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&&ОтборРемонтов", "ВЫБОР 
		|		КОГДА ВТ.ID В (&ОтборРемонтов)
		|			ТОГДА ИСТИНА
		|        ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ");
		Запрос.УстановитьПараметр("ОтборРемонтов", ОтборРемонтов);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&&ОтборРемонтов", "ИСТИНА");
	КонецЕсли;

	Результат = Запрос.Выполнить();

	Объект.АварийныеРемонты.Очистить();
	Объект.АварийныеРемонты.Загрузить(Результат.Выгрузить());
	#Вставка
	// Гкс+[TOIR20-607] Оселедько В.С. от 17.07.2025. Добавлено:{
	ИмяКлючевойОперации = "Обработка.торо_ЗакрытиеЗаявокИРемонтов.ЗаполнениеТабличнойЧастиАварийныеРемонты";
	ОценкаПроизводительности.ЗакончитьЗамерВремени(ИмяКлючевойОперации, ВремяНачалаЗамераЗаполненияТЧ); 
	// } Гкс-[TOIR20-607] Оселедько В.С. от 17.07.2025.
	#КонецВставки
КонецПроцедуры

#Область ТекстыЗапросов

Функция ТекстЗапросаЗаполнитьАварийныеРемонтыНаСервере()
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РемонтыЗаявок.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ РемонтыСАктамиНарядами
	|ИЗ
	|	РегистрСведений.торо_ЗаявкиПоРемонтам КАК РемонтыЗаявок
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_НарядыПоРемонтам КАК торо_НарядыПоРемонтам
	|		ПО РемонтыЗаявок.IDРемонта = торо_НарядыПоРемонтам.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктыПоРемонтам КАК торо_АктыПоРемонтам
	|		ПО РемонтыЗаявок.IDРемонта = торо_АктыПоРемонтам.IDРемонта
	|ГДЕ             
	|	РемонтыЗаявок.IDРемонта В (&ОтборРемонтов)
	|	И НЕ(торо_НарядыПоРемонтам.IDРемонта ЕСТЬ NULL
	|				И торо_АктыПоРемонтам.IDРемонта ЕСТЬ NULL)
	// Гкс+[TOIR20-382] Лебедев Н.А. от 12.07.2023. Добавлено:{
	|	И РемонтыЗаявок.ДатаНачалаРемонтныхРабот >= &ДатаНачалаРемонтныхРаботОтбор 
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	// } Гкс-[TOIR20-382] Лебедев Н.А. от 12.07.2023.	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_ЗаявкиПоРемонтам.IDРемонта КАК ID,
	|	РемонтыСАктамиНарядами.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ РемонтыЗаявокСАктамиНарядами
	|ИЗ
	|	РемонтыСАктамиНарядами КАК РемонтыСАктамиНарядами
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗаявкиПоРемонтам КАК торо_ЗаявкиПоРемонтам
	|		ПО РемонтыСАктамиНарядами.Регистратор = торо_ЗаявкиПоРемонтам.Регистратор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
 	|;
	|
	// Гкс+[TOIR20-393] Лебедев Н.А. от 17.07.2023. Добавлено:{
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ 
	|	ДокВО.ID,
	|	ДокВО.Регистратор,
	|	МАКСИМУМ(ДокВО.Период),
	|	ДокВО.ОбъектРемонта
	|ПОМЕСТИТЬ ВТ_ВнешниеОснования
	|ИЗ
	|	РегистрСведений.торо_ВнешниеОснованияДляРабот КАК ДокВО
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОтмененныеРемонты.СрезПоследних КАК торо_ОтмененныеРемонты
	|		ПО ДокВО.ID = торо_ОтмененныеРемонты.ID
	|			И (торо_ОтмененныеРемонты.Отменен)
	|ГДЕ 
	|   ДокВО.ID В (&ОтборРемонтов)
	|	И торо_ОтмененныеРемонты.ID ЕСТЬ NULL
	| 	И ДокВО.Регистратор ССЫЛКА Документ.торо_ВнешнееОснованиеДляРабот
	|СГРУППИРОВАТЬ ПО
	|  ДокВО.ID,
	|  ДокВО.Регистратор,
	|  ДокВО.ОбъектРемонта
	|;
	|	
	// } Гкс-[TOIR20-393] Лебедев Н.А. от 17.07.2023.
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ВыявленныеДефекты.ID КАК ID,
	|	торо_ВыявленныеДефекты.Регистратор КАК Регистратор,
	|	торо_ВыявленныеДефекты.Период КАК Период,
	|	торо_ВыявленныеДефекты.ОтказавшийЭлемент КАК ОбъектРемонта
	|ПОМЕСТИТЬ РемонтыПлановыеИДефекты
	|ИЗ
	|	РегистрСведений.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефекты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОтмененныеРемонты.СрезПоследних КАК торо_ОтмененныеРемонты
	|		ПО торо_ВыявленныеДефекты.ID = торо_ОтмененныеРемонты.ID
	|			И (торо_ОтмененныеРемонты.Отменен)
	|ГДЕ         
	|   торо_ВыявленныеДефекты.ID В (&ОтборРемонтов)
	// Гкс+[TOIR20-382] Лебедев Н.А. от 12.07.2023. Добавлено:{
	|	И торо_ВыявленныеДефекты.Период >= &ДатаНачалаРемонтныхРаботОтбор
	// } Гкс-[TOIR20-382] Лебедев Н.А. от 12.07.2023.	
	|	И торо_ОтмененныеРемонты.ID ЕСТЬ NULL
	|
	// Гкс+[TOIR20-393] Лебедев Н.А. от 17.07.2023. Изменено:{
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ 
	//|	ДокВО.ID,
	//|	ДокВО.Регистратор,
	//|	ДокВО.Период,
	//|	ДокВО.ОбъектРемонта
	//|ИЗ
	//|	РегистрСведений.торо_ВнешниеОснованияДляРабот.СрезПоследних(,Регистратор ССЫЛКА Документ.торо_ВнешнееОснованиеДляРабот) КАК ДокВО
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОтмененныеРемонты.СрезПоследних КАК торо_ОтмененныеРемонты
	//|		ПО ДокВО.ID = торо_ОтмененныеРемонты.ID
	//|			И (торо_ОтмененныеРемонты.Отменен)
	//|ГДЕ 
	//|   ДокВО.ID В (&ОтборРемонтов)
	//|	И торо_ОтмененныеРемонты.ID ЕСТЬ NULL
	//|;
	//|
	// }На:{
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	ДокВО.ID,
	|	ДокВО.Регистратор,
	|	ДокВО.Период,
	|	ДокВО.ОбъектРемонта
	|ИЗ
	|	ВТ_ВнешниеОснования КАК ДокВО
	// } Гкс-[TOIR20-393] Лебедев Н.А. от 17.07.2023.
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	РемонтыПлановыеИДефекты.ID КАК ID,
	|	РемонтыПлановыеИДефекты.Регистратор КАК Регистратор,
	|	РемонтыПлановыеИДефекты.Период КАК Период,
	|	РемонтыПлановыеИДефекты.ОбъектРемонта КАК ОбъектРемонта
	|ПОМЕСТИТЬ РемонтыПлановыеСПодчиненными
	|ИЗ
	|	РемонтыПлановыеИДефекты КАК РемонтыПлановыеИДефекты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_НарядыПоРемонтам КАК торо_НарядыПоРемонтам
	|		ПО РемонтыПлановыеИДефекты.ID = торо_НарядыПоРемонтам.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктыПоРемонтам КАК торо_АктыПоРемонтам
	|		ПО РемонтыПлановыеИДефекты.ID = торо_АктыПоРемонтам.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РемонтыЗаявокСАктамиНарядами КАК РемонтыЗаявокСАктамиНарядами
	|		ПО РемонтыПлановыеИДефекты.ID = РемонтыЗаявокСАктамиНарядами.ID
	|ГДЕ
	|	торо_НарядыПоРемонтам.IDРемонта ЕСТЬ NULL
	|	И торо_АктыПоРемонтам.IDРемонта ЕСТЬ NULL
	|	И РемонтыЗаявокСАктамиНарядами.ID ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	РемонтыПлановыеСПодчиненными.ID КАК ID,
	|	РемонтыПлановыеСПодчиненными.ОбъектРемонта КАК ОбъектРемонта,
	|	Константы.торо_ВидРемонтаПриВводеНаОснованииВыявленныхДефектов КАК ВидРемонта,
	|	ВЫБОР
	|		КОГДА НЕ Заявки.Регистратор ЕСТЬ NULL
	|				И торо_ОтмененныеЗаявки.Заявка ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьЗаявка,
	|	РемонтыПлановыеСПодчиненными.Регистратор КАК Регистратор,
	|	Константы.торо_ОтменятьЗакрытиеЗаявок КАК Отменен,
	|	Константы.торо_ПричинаЗакрытияРемонтов КАК ПричинаЗакрытия,
	|	Константы.торо_ПричинаЗакрытияЗаявок КАК ПричинаЗакрытияЗаявки,
	|	РемонтыПлановыеСПодчиненными.Регистратор КАК ДокументОснование,
	|	РемонтыПлановыеСПодчиненными.Период КАК ДатаОбнаружения,
	|	Заявки.Регистратор КАК Заявка
	|ПОМЕСТИТЬ ПодготовленныеДанные
	|ИЗ
	|	РемонтыПлановыеСПодчиненными КАК РемонтыПлановыеСПодчиненными
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗаявкиПоРемонтам КАК Заявки
	|		ПО РемонтыПлановыеСПодчиненными.ID = Заявки.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОтмененныеЗаявки КАК торо_ОтмененныеЗаявки
	|		ПО (Заявки.Регистратор = торо_ОтмененныеЗаявки.Заявка)
	|			И РемонтыПлановыеСПодчиненными.ID = торо_ОтмененныеЗаявки.ИДРемонта,
	|	Константы КАК Константы
	|ГДЕ
	|	РемонтыПлановыеСПодчиненными.Период <= &ДатаАктуальности
	|	И РемонтыПлановыеСПодчиненными.Период >= &ДатаНачалаРемонтныхРаботОтбор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ВыявленныеДефекты.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_РазрешенныеДокументы
	|ИЗ
	|	Документ.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефекты
	|ГДЕ
	|	торо_ВыявленныеДефекты.Ссылка В
	|			(ВЫБРАТЬ
	|				ПодготовленныеДанные.Регистратор КАК Регистратор
	|			ИЗ
	|				ПодготовленныеДанные КАК ПодготовленныеДанные)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ЗаявкаНаРемонт.Ссылка
	|ИЗ
	|	Документ.торо_ЗаявкаНаРемонт КАК торо_ЗаявкаНаРемонт
	|ГДЕ
	|	торо_ЗаявкаНаРемонт.Ссылка В
	|			(ВЫБРАТЬ
	|				ПодготовленныеДанные.Регистратор КАК Регистратор
	|			ИЗ
	|				ПодготовленныеДанные КАК ПодготовленныеДанные)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокВО.Ссылка
	|ИЗ
	|	Документ.торо_ВнешнееОснованиеДляРабот КАК ДокВО
	|ГДЕ
	|	ДокВО.Ссылка В
	|			(ВЫБРАТЬ
	|				ПодготовленныеДанные.Регистратор КАК Регистратор
	|			ИЗ
	|				ПодготовленныеДанные КАК ПодготовленныеДанные)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ПланГрафикРемонта.Ссылка
	|ИЗ
	|	Документ.торо_ПланГрафикРемонта КАК торо_ПланГрафикРемонта
	|ГДЕ
	|	торо_ПланГрафикРемонта.Ссылка В
	|			(ВЫБРАТЬ
	|				ПодготовленныеДанные.Регистратор КАК Регистратор
	|			ИЗ
	|				ПодготовленныеДанные КАК ПодготовленныеДанные)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПодготовленныеДанные.ID КАК ID,
	|	ПодготовленныеДанные.ОбъектРемонта КАК ОбъектРемонта,
	|	ПодготовленныеДанные.ВидРемонта КАК ВидРемонта,
	|	ПодготовленныеДанные.ЕстьЗаявка КАК ЕстьЗаявка,
	|	ПодготовленныеДанные.Регистратор КАК Регистратор,
	|	ПодготовленныеДанные.Отменен КАК Отменен,
	|	ПодготовленныеДанные.ПричинаЗакрытия КАК ПричинаЗакрытия,
	|	ПодготовленныеДанные.ПричинаЗакрытияЗаявки КАК ПричинаЗакрытияЗаявки,
	|	ПодготовленныеДанные.ДокументОснование КАК ДокументОснование,
	|	ПодготовленныеДанные.ДатаОбнаружения КАК ДатаОбнаружения,
	|	ВЫБОР
	|		КОГДА ПодготовленныеДанные.ЕстьЗаявка
	|			ТОГДА ПодготовленныеДанные.Заявка
	|		ИНАЧЕ &ПустаяСсылкаНаЗаявку
	|	КОНЕЦ КАК Заявка
	|ПОМЕСТИТЬ ДанныеСДублямиРемонтов
	|ИЗ
	|	ПодготовленныеДанные КАК ПодготовленныеДанные
	|ГДЕ
	|	ПодготовленныеДанные.Регистратор В
	|			(ВЫБРАТЬ
	|				ВТ_РазрешенныеДокументы.Ссылка КАК Ссылка
	|			ИЗ
	|				ВТ_РазрешенныеДокументы КАК ВТ_РазрешенныеДокументы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_СкользящийПланРаботСрезПоследних.ID_Ремонта КАК ID_Ремонта
	|ПОМЕСТИТЬ вт_РемонтыИзОбщегоПлана
	|ИЗ
	|	РегистрСведений.торо_СкользящийПланРабот.СрезПоследних(
	|			,
	|			ID_Ремонта В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ДанныеСДублямиРемонтов.ID КАК ID
	|				ИЗ
	|					ДанныеСДублямиРемонтов КАК ДанныеСДублямиРемонтов)) КАК торо_СкользящийПланРаботСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID_Ремонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.ID КАК ID
	|ПОМЕСТИТЬ ДублиРемонтов
	|ИЗ
	|	ДанныеСДублямиРемонтов КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.ID
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ВТ.ID) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.ID КАК ID,
	|	ВТ.ОбъектРемонта КАК ОбъектРемонта,
	|	&&ОтборРемонтов КАК ПодходитПодОтбор,
	|	ВТ.ВидРемонта КАК ВидРемонта,
	|	ВТ.ЕстьЗаявка КАК ЕстьЗаявка,
	|	ВТ.Регистратор КАК Регистратор,
	|	ВТ.Отменен КАК Отменен,
	|	ВТ.ПричинаЗакрытия КАК ПричинаЗакрытия,
	|	ВТ.ПричинаЗакрытияЗаявки КАК ПричинаЗакрытияЗаявки,
	|	ВТ.ДокументОснование КАК ДокументОснование,
	|	ВТ.ДатаОбнаружения КАК ДатаОбнаружения,
	|	ВТ.Заявка КАК Заявка,
	|	ВЫБОР
	|		КОГДА вт_РемонтыИзОбщегоПлана.ID_Ремонта ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК РемонтВключенВОбщийПлан
	|ИЗ
	|	ДанныеСДублямиРемонтов КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДублиРемонтов КАК ДублиРемонтов
	|		ПО ВТ.ID = ДублиРемонтов.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_РемонтыИзОбщегоПлана КАК вт_РемонтыИзОбщегоПлана
	|		ПО ВТ.ID = вт_РемонтыИзОбщегоПлана.ID_Ремонта
	|ГДЕ
	|	(ВТ.ЕстьЗаявка
	|			ИЛИ ДублиРемонтов.ID ЕСТЬ NULL)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаОбнаружения";

	Возврат ТекстЗапроса;  
	
КонецФункции

Функция ТекстЗапросаЗаполнитьПлановыеРемонтыНаСервере()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РемонтыЗаявок.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ РемонтыСАктамиНарядами
	|ИЗ
	|	РегистрСведений.торо_ЗаявкиПоРемонтам КАК РемонтыЗаявок
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_НарядыПоРемонтам КАК торо_НарядыПоРемонтам
	|		ПО РемонтыЗаявок.IDРемонта = торо_НарядыПоРемонтам.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктыПоРемонтам КАК торо_АктыПоРемонтам
	|		ПО РемонтыЗаявок.IDРемонта = торо_АктыПоРемонтам.IDРемонта
	|ГДЕ   
	|   РемонтыЗаявок.IDРемонта В (&ОтборРемонтов)
	// Гкс+[TOIR20-382] Лебедев Н.А. от 12.07.2023. Добавлено:{
	|	И РемонтыЗаявок.ДатаНачалаРемонтныхРабот >= &ДатаНачалаРемонтныхРаботОтбор
	// } Гкс-[TOIR20-382] Лебедев Н.А. от 12.07.2023.
	|	И НЕ(торо_НарядыПоРемонтам.IDРемонта ЕСТЬ NULL
	|				И торо_АктыПоРемонтам.IDРемонта ЕСТЬ NULL)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_ЗаявкиПоРемонтам.IDРемонта КАК ID,
	|	РемонтыСАктамиНарядами.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ РемонтыЗаявокСАктамиНарядами
	|ИЗ
	|	РемонтыСАктамиНарядами КАК РемонтыСАктамиНарядами
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗаявкиПоРемонтам КАК торо_ЗаявкиПоРемонтам
	|		ПО РемонтыСАктамиНарядами.Регистратор = торо_ЗаявкиПоРемонтам.Регистратор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Гкс+[TOIR20-559] Вялых Д.А. от 20.03.2025. Добавлено и закомментировано:{
	//// Гкс+[TOIR20-382] Лебедев Н.А. от 12.07.2023. Изменено:{
	//// |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//// |	торо_ПлановыеРемонтныеРаботыСрезПоследних.ID КАК ID,
	//// |	торо_ПлановыеРемонтныеРаботыСрезПоследних.Регистратор КАК Регистратор,
	//// |	торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаНачалаРемонтныхРабот КАК ДатаНачалаРемонтныхРабот,
	//// |	торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаОкончанияРемонтныхРабот КАК ДатаОкончанияРемонтныхРабот,
	//// |	торо_ПлановыеРемонтныеРаботыСрезПоследних.ОбъектРемонтныхРабот КАК ОбъектРемонта,
	//// |	торо_ПлановыеРемонтныеРаботыСрезПоследних.ВидРемонтныхРабот КАК ВидРемонта
	//// |ПОМЕСТИТЬ РемонтыПлановыеИДефекты
	//// |ИЗ
	//// |	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних КАК торо_ПлановыеРемонтныеРаботыСрезПоследних
	//// |ГДЕ   
	//// |   торо_ПлановыеРемонтныеРаботыСрезПоследних.ID В (&ОтборРемонтов)
	//// |	И торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаНачалаРемонтныхРабот <= &ДатаАктуальности
	//// |	И НЕ торо_ПлановыеРемонтныеРаботыСрезПоследних.Замещен
	//// |	И НЕ торо_ПлановыеРемонтныеРаботыСрезПоследних.Отменен
	//// |
	//// |ИНДЕКСИРОВАТЬ ПО
	//// |	ID
	//// |;
	//// |	
	//// }На:{
	//|ВЫБРАТЬ
	//|	МАКСИМУМ(торо_ПлановыеРемонтныеРаботы.Период) КАК Период,
	//|	МАКСИМУМ(торо_ПлановыеРемонтныеРаботы.Регистратор) КАК Регистратор,
	//|	торо_ПлановыеРемонтныеРаботы.ID КАК ID,
	//|	торо_ПлановыеРемонтныеРаботы.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	//|	торо_ПлановыеРемонтныеРаботы.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	//|	торо_ПлановыеРемонтныеРаботы.Организация КАК Организация
	//|ПОМЕСТИТЬ ВТОтборПлановыеРемонты
	//|ИЗ
	//|	РегистрСведений.торо_ПлановыеРемонтныеРаботы КАК торо_ПлановыеРемонтныеРаботы
	//|ГДЕ    
	//|	торо_ПлановыеРемонтныеРаботы.ID В (&ОтборРемонтов) 
	//|	И торо_ПлановыеРемонтныеРаботы.ДатаНачалаРемонтныхРабот <= &ДатаАктуальности
	//|	И торо_ПлановыеРемонтныеРаботы.ДатаНачалаРемонтныхРабот >= &ДатаНачалаРемонтныхРаботОтбор 
	//|	И НЕ торо_ПлановыеРемонтныеРаботы.Замещен
	//|	И НЕ торо_ПлановыеРемонтныеРаботы.Отменен
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	торо_ПлановыеРемонтныеРаботы.ID,
	//|	торо_ПлановыеРемонтныеРаботы.ОбъектРемонтныхРабот,
	//|	торо_ПлановыеРемонтныеРаботы.ВидРемонтныхРабот,
	//|	торо_ПлановыеРемонтныеРаботы.Организация
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	Период,
	//|	Регистратор,
	//|	ID,
	//|	ОбъектРемонтныхРабот,
	//|	ВидРемонтныхРабот,
	//|	Организация
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТОтборПлановыеРемонты.Регистратор КАК Регистратор,
	//|	ВТОтборПлановыеРемонты.ID КАК ID,
	//|	ВТОтборПлановыеРемонты.ОбъектРемонтныхРабот КАК ОбъектРемонта,
	//|	ВТОтборПлановыеРемонты.ВидРемонтныхРабот КАК ВидРемонта,
	//|	ВТОтборПлановыеРемонты.Организация КАК Организация,
	//|	торо_ПлановыеРемонтныеРаботы.ДатаНачалаРемонтныхРабот КАК ДатаНачалаРемонтныхРабот,
	//|	торо_ПлановыеРемонтныеРаботы.ДатаОкончанияРемонтныхРабот КАК ДатаОкончанияРемонтныхРабот,
	//|	торо_ПлановыеРемонтныеРаботы.Отменен КАК Отменен,
	//|	торо_ПлановыеРемонтныеРаботы.Замещен КАК Замещен
	//|ПОМЕСТИТЬ РемонтыПлановыеИДефекты
	//|ИЗ
	//|	РегистрСведений.торо_ПлановыеРемонтныеРаботы КАК торо_ПлановыеРемонтныеРаботы
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборПлановыеРемонты КАК ВТОтборПлановыеРемонты
	//|		ПО (ВТОтборПлановыеРемонты.Регистратор = торо_ПлановыеРемонтныеРаботы.Регистратор
	//|				И ВТОтборПлановыеРемонты.Период = торо_ПлановыеРемонтныеРаботы.Период
	//|				И ВТОтборПлановыеРемонты.ID = торо_ПлановыеРемонтныеРаботы.ID
	//|				И ВТОтборПлановыеРемонты.ОбъектРемонтныхРабот = торо_ПлановыеРемонтныеРаботы.ОбъектРемонтныхРабот
	//|				И ВТОтборПлановыеРемонты.ВидРемонтныхРабот = торо_ПлановыеРемонтныеРаботы.ВидРемонтныхРабот
	//|				И ВТОтборПлановыеРемонты.Организация = торо_ПлановыеРемонтныеРаботы.Организация)
	//|;
	//|
	//// } Гкс-[TOIR20-382] Лебедев Н.А. от 12.07.2023.
	|ВЫБРАТЬ
	|	торо_ПлановыеРемонтныеРаботы.Период КАК Период,
	|	торо_ПлановыеРемонтныеРаботы.Регистратор КАК Регистратор,
	|	торо_ПлановыеРемонтныеРаботы.ID КАК ID,
	|	торо_ПлановыеРемонтныеРаботы.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботы.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботы.Организация КАК Организация,
	|	торо_ПлановыеРемонтныеРаботы.ДатаНачалаРемонтныхРабот КАК ДатаНачалаРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботы.ДатаОкончанияРемонтныхРабот КАК ДатаОкончанияРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботы.Отменен КАК Отменен,
	|	торо_ПлановыеРемонтныеРаботы.Замещен КАК Замещен	
	|	
	|ПОМЕСТИТЬ ВТОтборПлановыеРемонтыОбщее 
	|
	|ИЗ
	|	РегистрСведений.торо_ПлановыеРемонтныеРаботы КАК торо_ПлановыеРемонтныеРаботы
	|ГДЕ    
	|	ИСТИНА 
	|	И торо_ПлановыеРемонтныеРаботы.ДатаНачалаРемонтныхРабот <= &ДатаАктуальности
	|	И торо_ПлановыеРемонтныеРаботы.ДатаНачалаРемонтныхРабот >= &ДатаНачалаРемонтныхРаботОтбор 
	|	И НЕ торо_ПлановыеРемонтныеРаботы.Замещен
	|	И НЕ торо_ПлановыеРемонтныеРаботы.Отменен	
	|;
	|
	|ВЫБРАТЬ
	|	МАКСИМУМ(торо_ПлановыеРемонтныеРаботы.Период) КАК Период,
	|	МАКСИМУМ(торо_ПлановыеРемонтныеРаботы.Регистратор) КАК Регистратор,
	|	торо_ПлановыеРемонтныеРаботы.ID КАК ID,
	|	торо_ПлановыеРемонтныеРаботы.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботы.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботы.Организация КАК Организация	
	|	
	|ПОМЕСТИТЬ ВТМаксимумОтборПлановыеРемонты 
	|
	|ИЗ
	|	ВТОтборПлановыеРемонтыОбщее КАК торо_ПлановыеРемонтныеРаботы   
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_ПлановыеРемонтныеРаботы.ID,
	|	торо_ПлановыеРемонтныеРаботы.ОбъектРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботы.ВидРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботы.Организация	
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Регистратор,
	|	ID,
	|	ОбъектРемонтныхРабот,
	|	ВидРемонтныхРабот,
	|	Организация
	|; 
	|
	|
	|//////////////////////////////////////////////////////////////////////////////// 
	|
	|ВЫБРАТЬ
	|	ВТОтборПлановыеРемонты.Регистратор КАК Регистратор,
	|	ВТОтборПлановыеРемонты.ID КАК ID,
	|	ВТОтборПлановыеРемонты.ОбъектРемонтныхРабот КАК ОбъектРемонта,
	|	ВТОтборПлановыеРемонты.ВидРемонтныхРабот КАК ВидРемонта,
	|	ВТОтборПлановыеРемонты.Организация КАК Организация,
	|	торо_ПлановыеРемонтныеРаботы.ДатаНачалаРемонтныхРабот КАК ДатаНачалаРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботы.ДатаОкончанияРемонтныхРабот КАК ДатаОкончанияРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботы.Отменен КАК Отменен,
	|	торо_ПлановыеРемонтныеРаботы.Замещен КАК Замещен
	|ПОМЕСТИТЬ РемонтыПлановыеИДефекты
	|ИЗ
	|	ВТОтборПлановыеРемонтыОбщее КАК торо_ПлановыеРемонтныеРаботы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТМаксимумОтборПлановыеРемонты КАК ВТОтборПлановыеРемонты
	|		ПО (ВТОтборПлановыеРемонты.Регистратор = торо_ПлановыеРемонтныеРаботы.Регистратор
	|				И ВТОтборПлановыеРемонты.Период = торо_ПлановыеРемонтныеРаботы.Период
	|				И ВТОтборПлановыеРемонты.ID = торо_ПлановыеРемонтныеРаботы.ID
	|				И ВТОтборПлановыеРемонты.ОбъектРемонтныхРабот = торо_ПлановыеРемонтныеРаботы.ОбъектРемонтныхРабот
	|				И ВТОтборПлановыеРемонты.ВидРемонтныхРабот = торо_ПлановыеРемонтныеРаботы.ВидРемонтныхРабот
	|				И ВТОтборПлановыеРемонты.Организация = торо_ПлановыеРемонтныеРаботы.Организация)
	|;
	// } Гкс-[TOIR20-559] Вялых Д.А. от 20.03.2025.
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РемонтыПлановыеИДефекты.ID КАК ID,
	|	РемонтыПлановыеИДефекты.Регистратор КАК Регистратор,
	|	РемонтыПлановыеИДефекты.ДатаНачалаРемонтныхРабот КАК ДатаНачалаРемонтныхРабот,
	|	РемонтыПлановыеИДефекты.ДатаОкончанияРемонтныхРабот КАК ДатаОкончанияРемонтныхРабот,
	|	РемонтыПлановыеИДефекты.ОбъектРемонта КАК ОбъектРемонта,
	|	РемонтыПлановыеИДефекты.ВидРемонта КАК ВидРемонта
	|ПОМЕСТИТЬ РемонтыПлановыеСПодчиненными
	|ИЗ
	|	РемонтыПлановыеИДефекты КАК РемонтыПлановыеИДефекты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_НарядыПоРемонтам КАК торо_НарядыПоРемонтам
	|		ПО РемонтыПлановыеИДефекты.ID = торо_НарядыПоРемонтам.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктыПоРемонтам КАК торо_АктыПоРемонтам
	|		ПО РемонтыПлановыеИДефекты.ID = торо_АктыПоРемонтам.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РемонтыЗаявокСАктамиНарядами КАК РемонтыЗаявокСАктамиНарядами
	|		ПО РемонтыПлановыеИДефекты.ID = РемонтыЗаявокСАктамиНарядами.ID
	|ГДЕ     
	|   РемонтыПлановыеИДефекты.ID В (&ОтборРемонтов)
	|	И торо_НарядыПоРемонтам.IDРемонта ЕСТЬ NULL
	|	И торо_АктыПоРемонтам.IDРемонта ЕСТЬ NULL
	|	И РемонтыЗаявокСАктамиНарядами.ID ЕСТЬ NULL
	// Гкс+[TOIR20-559] Вялых Д.А. от 20.03.2025. Добавлено:{
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	// } Гкс-[TOIR20-559] Вялых Д.А. от 20.03.2025.
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	РемонтыПлановыеСПодчиненными.ID КАК ID,
	|	РемонтыПлановыеСПодчиненными.ОбъектРемонта КАК ОбъектРемонта,
	|	РемонтыПлановыеСПодчиненными.ВидРемонта КАК ВидРемонта,
	|	РемонтыПлановыеСПодчиненными.ДатаНачалаРемонтныхРабот КАК ДатаНачалаРемонтныхРабот,
	|	РемонтыПлановыеСПодчиненными.ДатаОкончанияРемонтныхРабот КАК ДатаОкончанияРемонтныхРабот,
	|	ВЫБОР
	|		КОГДА НЕ Заявки.Регистратор ЕСТЬ NULL
	|				И торо_ОтмененныеЗаявки.Заявка ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьЗаявка,
	|	Заявки.Регистратор КАК Смета,
	|	РемонтыПлановыеСПодчиненными.Регистратор КАК Регистратор,
	|	Константы.торо_ПричинаЗакрытияРемонтов КАК ПричинаЗакрытия,
	|	Константы.торо_ПричинаЗакрытияЗаявок КАК ПричинаЗакрытияЗаявки,
	|	Константы.торо_ОтменятьЗакрытиеЗаявок КАК Отменен,
	|	РемонтыПлановыеСПодчиненными.Регистратор КАК ДокументОснование,
	|	Заявки.МоментВремени КАК ДатаЗаявки,
	|	РемонтыПлановыеСПодчиненными.Регистратор.МоментВремени КАК ДатаДокументаОснования
	|ПОМЕСТИТЬ ТабСДублями
	|ИЗ
	|	РемонтыПлановыеСПодчиненными КАК РемонтыПлановыеСПодчиненными
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗаявкиПоРемонтам КАК Заявки
	|		ПО РемонтыПлановыеСПодчиненными.ID = Заявки.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОтмененныеЗаявки КАК торо_ОтмененныеЗаявки
	|		ПО (Заявки.Регистратор = торо_ОтмененныеЗаявки.Заявка)
	|			И РемонтыПлановыеСПодчиненными.ID = торо_ОтмененныеЗаявки.ИДРемонта,
	|	Константы КАК Константы
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID,
	|	Смета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТабСДублями.ID КАК ID,
	|	ТабСДублями.ОбъектРемонта КАК ОбъектРемонта,
	|	ТабСДублями.ВидРемонта КАК ВидРемонта,
	|	ТабСДублями.ЕстьЗаявка КАК ЕстьЗаявка,
	|	ТабСДублями.Регистратор КАК Регистратор,
	|	ТабСДублями.ПричинаЗакрытия КАК ПричинаЗакрытия,
	|	ТабСДублями.ПричинаЗакрытияЗаявки КАК ПричинаЗакрытияЗаявки,
	|	ТабСДублями.Отменен КАК Отменен,
	|	ТабСДублями.ДокументОснование КАК ДокументОснование,
	|	ВЫБОР
	|		КОГДА ТабСДублями.ЕстьЗаявка
	|				И ТабСДублями.ДатаЗаявки > ТабСДублями.ДатаДокументаОснования
	|			ТОГДА Заявки.ДатаНачалаРемонтныхРабот
	|		ИНАЧЕ ТабСДублями.ДатаНачалаРемонтныхРабот
	|	КОНЕЦ КАК ДатаНачала,
	|	ВЫБОР
	|		КОГДА ТабСДублями.ЕстьЗаявка
	|				И ТабСДублями.ДатаЗаявки > ТабСДублями.ДатаДокументаОснования
	|			ТОГДА Заявки.ДатаОкончанияРемонтныхРабот
	|		ИНАЧЕ ТабСДублями.ДатаОкончанияРемонтныхРабот
	|	КОНЕЦ КАК ДатаОкончания,
	|	ВЫБОР
	|		КОГДА ТабСДублями.ЕстьЗаявка
	|			ТОГДА ТабСДублями.Смета
	|		ИНАЧЕ &ПустаяСсылкаНаЗаявку
	|	КОНЕЦ КАК Заявка
	|ПОМЕСТИТЬ ПодготовленныеДанные
	|ИЗ
	|	ТабСДублями КАК ТабСДублями
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗаявкиПоРемонтам КАК Заявки
	|		ПО ТабСДублями.ID = Заявки.IDРемонта
	|			И ТабСДублями.Смета = Заявки.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Гкс+[TOIR20-559] Вялых Д.А. от 20.03.2025. Добавлено и закомментировано:{
	|
	|ВЫБРАТЬ
	|	ПодготовленныеДанные.ID КАК ID,
	|	ПодготовленныеДанные.ОбъектРемонта КАК ОбъектРемонта,
	|	ПодготовленныеДанные.ВидРемонта КАК ВидРемонта,
	|	ПодготовленныеДанные.ЕстьЗаявка КАК ЕстьЗаявка,
	|	ПодготовленныеДанные.Регистратор КАК Регистратор,
	|	ПодготовленныеДанные.ПричинаЗакрытия КАК ПричинаЗакрытия,
	|	ПодготовленныеДанные.ПричинаЗакрытияЗаявки КАК ПричинаЗакрытияЗаявки,
	|	ПодготовленныеДанные.Отменен КАК Отменен,
	|	ПодготовленныеДанные.ДокументОснование КАК ДокументОснование,
	|	ПодготовленныеДанные.Заявка КАК Заявка,
	|	ПодготовленныеДанные.ДатаНачала КАК ДатаНачала,
	|	ПодготовленныеДанные.ДатаОкончания КАК ДатаОкончания
	|	ПОМЕСТИТЬ ДанныеСДублямиРемонтов
	|ИЗ
	|	ПодготовленныеДанные КАК ПодготовленныеДанные 
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ПодготовленныеДанные.ДокументОснование) = ТИП(Документ.торо_ВыявленныеДефекты)
	|		
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПодготовленныеДанные.ID,
	|	ПодготовленныеДанные.ОбъектРемонта,
	|	ПодготовленныеДанные.ВидРемонта,
	|	ПодготовленныеДанные.ЕстьЗаявка,
	|	ПодготовленныеДанные.Регистратор,
	|	ПодготовленныеДанные.ПричинаЗакрытия,
	|	ПодготовленныеДанные.ПричинаЗакрытияЗаявки,
	|	ПодготовленныеДанные.Отменен,
	|	ПодготовленныеДанные.ДокументОснование,
	|	ПодготовленныеДанные.Заявка,
	|	ПодготовленныеДанные.ДатаНачала,
	|	ПодготовленныеДанные.ДатаОкончания
	|	
	|ИЗ
	|	ПодготовленныеДанные КАК ПодготовленныеДанные 
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ПодготовленныеДанные.ДокументОснование) = ТИП(Документ.торо_ЗаявкаНаРемонт) 
	|		
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПодготовленныеДанные.ID,
	|	ПодготовленныеДанные.ОбъектРемонта,
	|	ПодготовленныеДанные.ВидРемонта,
	|	ПодготовленныеДанные.ЕстьЗаявка,
	|	ПодготовленныеДанные.Регистратор,
	|	ПодготовленныеДанные.ПричинаЗакрытия,
	|	ПодготовленныеДанные.ПричинаЗакрытияЗаявки,
	|	ПодготовленныеДанные.Отменен,
	|	ПодготовленныеДанные.ДокументОснование,
	|	ПодготовленныеДанные.Заявка,
	|	ПодготовленныеДанные.ДатаНачала,
	|	ПодготовленныеДанные.ДатаОкончания
	|	
	|ИЗ
	|	ПодготовленныеДанные КАК ПодготовленныеДанные 
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ПодготовленныеДанные.ДокументОснование) = ТИП(Документ.торо_ПланГрафикРемонта)
	|		
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПодготовленныеДанные.ID,
	|	ПодготовленныеДанные.ОбъектРемонта,
	|	ПодготовленныеДанные.ВидРемонта,
	|	ПодготовленныеДанные.ЕстьЗаявка,
	|	ПодготовленныеДанные.Регистратор,
	|	ПодготовленныеДанные.ПричинаЗакрытия,
	|	ПодготовленныеДанные.ПричинаЗакрытияЗаявки,
	|	ПодготовленныеДанные.Отменен,
	|	ПодготовленныеДанные.ДокументОснование,
	|	ПодготовленныеДанные.Заявка,
	|	ПодготовленныеДанные.ДатаНачала,
	|	ПодготовленныеДанные.ДатаОкончания
	|	
	|ИЗ
	|	ПодготовленныеДанные КАК ПодготовленныеДанные 
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ПодготовленныеДанные.ДокументОснование) = ТИП(Документ.торо_ЗакрытиеЗаявокИРемонтов)				
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	торо_ВыявленныеДефекты.Ссылка КАК Ссылка
	//|ПОМЕСТИТЬ ВТ_РазрешенныеДокументы
	//|ИЗ
	//|	Документ.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефекты
	//|ГДЕ
	//|	торо_ВыявленныеДефекты.Ссылка В
	//|			(ВЫБРАТЬ
	//|				ПодготовленныеДанные.ДокументОснование КАК ДокументОснование
	//|			ИЗ
	//|				ПодготовленныеДанные КАК ПодготовленныеДанные)
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	торо_ЗаявкаНаРемонт.Ссылка
	//|ИЗ
	//|	Документ.торо_ЗаявкаНаРемонт КАК торо_ЗаявкаНаРемонт
	//|ГДЕ
	//|	торо_ЗаявкаНаРемонт.Ссылка В
	//|			(ВЫБРАТЬ
	//|				ПодготовленныеДанные.ДокументОснование КАК ДокументОснование
	//|			ИЗ
	//|				ПодготовленныеДанные КАК ПодготовленныеДанные)
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	торо_ПланГрафикРемонта.Ссылка
	//|ИЗ
	//|	Документ.торо_ПланГрафикРемонта КАК торо_ПланГрафикРемонта
	//|ГДЕ
	//|	торо_ПланГрафикРемонта.Ссылка В
	//|			(ВЫБРАТЬ
	//|				ПодготовленныеДанные.ДокументОснование КАК ДокументОснование
	//|			ИЗ
	//|				ПодготовленныеДанные КАК ПодготовленныеДанные)
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	торо_ЗакрытиеЗаявокИРемонтов.Ссылка
	//|ИЗ
	//|	Документ.торо_ЗакрытиеЗаявокИРемонтов КАК торо_ЗакрытиеЗаявокИРемонтов
	//|ГДЕ
	//|	торо_ЗакрытиеЗаявокИРемонтов.Ссылка В
	//|			(ВЫБРАТЬ
	//|				ПодготовленныеДанные.ДокументОснование КАК ДокументОснование
	//|			ИЗ
	//|				ПодготовленныеДанные КАК ПодготовленныеДанные)
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	Ссылка
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ПодготовленныеДанные.ID КАК ID,
	//|	ПодготовленныеДанные.ОбъектРемонта КАК ОбъектРемонта,
	//|	ПодготовленныеДанные.ВидРемонта КАК ВидРемонта,
	//|	ПодготовленныеДанные.ЕстьЗаявка КАК ЕстьЗаявка,
	//|	ПодготовленныеДанные.Регистратор КАК Регистратор,
	//|	ПодготовленныеДанные.ПричинаЗакрытия КАК ПричинаЗакрытия,
	//|	ПодготовленныеДанные.ПричинаЗакрытияЗаявки КАК ПричинаЗакрытияЗаявки,
	//|	ПодготовленныеДанные.Отменен КАК Отменен,
	//|	ПодготовленныеДанные.ДокументОснование КАК ДокументОснование,
	//|	ПодготовленныеДанные.Заявка КАК Заявка,
	//|	ПодготовленныеДанные.ДатаНачала КАК ДатаНачала,
	//|	ПодготовленныеДанные.ДатаОкончания КАК ДатаОкончания
	//|ПОМЕСТИТЬ ДанныеСДублямиРемонтов
	//|ИЗ
	//|	ПодготовленныеДанные КАК ПодготовленныеДанные
	//|ГДЕ
	//|	ПодготовленныеДанные.ДокументОснование В
	//|			(ВЫБРАТЬ
	//|				ВТ_РазрешенныеДокументы.Ссылка КАК Ссылка
	//|			ИЗ
	//|				ВТ_РазрешенныеДокументы КАК ВТ_РазрешенныеДокументы)
	// } Гкс-[TOIR20-559] Вялых Д.А. от 20.03.2025.
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.ID КАК ID
	|ПОМЕСТИТЬ ДублиРемонтов
	|ИЗ
	|	ДанныеСДублямиРемонтов КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.ID
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ВТ.ID) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_СкользящийПланРаботСрезПоследних.ID_Ремонта КАК ID_Ремонта
	|ПОМЕСТИТЬ вт_РемонтыИзОбщегоПлана
	|ИЗ
	|	РегистрСведений.торо_СкользящийПланРабот.СрезПоследних(
	|			,
	|			ID_Ремонта В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ДанныеСДублямиРемонтов.ID КАК ID
	|				ИЗ
	|					ДанныеСДублямиРемонтов КАК ДанныеСДублямиРемонтов)) КАК торо_СкользящийПланРаботСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID_Ремонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.ID КАК ID,
	|	&&ОтборРемонтов КАК ПодходитПодОтбор,
	|	ВТ.ОбъектРемонта КАК ОбъектРемонта,
	|	ВТ.ВидРемонта КАК ВидРемонта,
	|	ВТ.ЕстьЗаявка КАК ЕстьЗаявка,
	|	ВТ.Регистратор КАК Регистратор,
	|	ВТ.ПричинаЗакрытия КАК ПричинаЗакрытия,
	|	ВТ.ПричинаЗакрытияЗаявки КАК ПричинаЗакрытияЗаявки,
	|	ВТ.Отменен КАК Отменен,
	|	ВТ.ДокументОснование КАК ДокументОснование,
	|	ВТ.Заявка КАК Заявка,
	|	ВТ.ДатаНачала КАК ДатаНачала,
	|	ВТ.ДатаОкончания КАК ДатаОкончания,
	|	ВЫБОР
	|		КОГДА вт_РемонтыИзОбщегоПлана.ID_Ремонта ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК РемонтВключенВОбщийПлан
	|ИЗ
	|	ДанныеСДублямиРемонтов КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДублиРемонтов КАК ДублиРемонтов
	|		ПО ВТ.ID = ДублиРемонтов.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_РемонтыИзОбщегоПлана КАК вт_РемонтыИзОбщегоПлана
	|		ПО ВТ.ID = вт_РемонтыИзОбщегоПлана.ID_Ремонта
	|ГДЕ 
	|	(ВТ.ЕстьЗаявка
	// Гкс+[TOIR20-559] Вялых Д.А. от 20.03.2025. Добавлено и закомментировано:{
	//|			ИЛИ ДублиРемонтов.ID ЕСТЬ NULL)
	|			И НЕ ДублиРемонтов.ID ЕСТЬ NULL)
	// } Гкс-[TOIR20-559] Вялых Д.А. от 20.03.2025.
	
	// Гкс+[TOIR20-382] Лебедев Н.А. от 12.07.2023. Добавлено:{
	|	И ВТ.ДатаНачала <= &ДатаАктуальности
	|	И ВТ.ДатаНачала >= &ДатаНачалаРемонтныхРаботОтбор	
	// } Гкс-[TOIR20-382] Лебедев Н.А. от 12.07.2023.
	// Гкс+[TOIR20-559] Вялых Д.А. от 20.03.2025. Добавлено:{ 
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ.ID,
	|	ИСТИНА,
	|	ВТ.ОбъектРемонта,
	|	ВТ.ВидРемонта,
	|	ВТ.ЕстьЗаявка,
	|	ВТ.Регистратор,
	|	ВТ.ПричинаЗакрытия,
	|	ВТ.ПричинаЗакрытияЗаявки,
	|	ВТ.Отменен,
	|	ВТ.ДокументОснование,
	|	ВТ.Заявка,
	|	ВТ.ДатаНачала,
	|	ВТ.ДатаОкончания,
	|	ВЫБОР
	|		КОГДА вт_РемонтыИзОбщегоПлана.ID_Ремонта ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|ИЗ
	|	ДанныеСДублямиРемонтов КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДублиРемонтов КАК ДублиРемонтов
	|		ПО ВТ.ID = ДублиРемонтов.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_РемонтыИзОбщегоПлана КАК вт_РемонтыИзОбщегоПлана
	|		ПО ВТ.ID = вт_РемонтыИзОбщегоПлана.ID_Ремонта
	|ГДЕ
	|	(ДублиРемонтов.ID ЕСТЬ NULL)
	|	И ВТ.ДатаНачала <= &ДатаАктуальности
	|	И ВТ.ДатаНачала >= &ДатаНачалаРемонтныхРаботОтбор
	// } Гкс-[TOIR20-559] Вялых Д.А. от 20.03.2025.
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаНачала";	 
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗавершитьЗамерОткрытияФормы(ВремяНачалаЗамера)
	
    ОценкаПроизводительности.ЗакончитьЗамерВремени("Обработка.торо_ЗакрытиеЗаявокИРемонтов.ОткрытиеФормы", ВремяНачалаЗамера); 
	
КонецПроцедуры

// Гкс+[TOIR20-611] Оселедько В.С. от 28.07.2025. Добавлено:{
&НаСервере
Процедура гкс_СтраницыПриСменеСтраницыВместоНаСервере(ИмяТекущейСтраницы)
	
	Если ИмяТекущейСтраницы = "ГруппаАварийныеРемонты"
		И Объект.АварийныеРемонты.Количество() = 0 Тогда
		
		ЗаполнитьАварийныеРемонтыНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры // Гкс+[TOIR20-611]

// Гкс+[TOIR20-611] Оселедько В.С. от 28.07.2025. Добавлено:{
&НаКлиенте
Процедура гкс_СтраницыПриСменеСтраницыВместо(Элемент, ТекущаяСтраница)
	
	гкс_СтраницыПриСменеСтраницыВместоНаСервере(ТекущаяСтраница.Имя);
	
КонецПроцедуры // Гкс+[TOIR20-611]

&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура гкс_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("ДатаАктуальности") Тогда
		Объект.ДатаАктуальности = Параметры.ДатаАктуальности;
	Иначе
		Объект.ДатаАктуальности = ТекущаяДата();
	КонецЕсли; 

	Если Параметры.Свойство("Владелец") Тогда
		Владелец = Параметры.Владелец;
	КонецЕсли;

	Если Параметры.Свойство("ДоступностьКнопкиЗаполнить") Тогда
		Элементы.ЗакрываемыеРемонтыЗаполнитьПлановыеРемонты.Доступность = Параметры.ДоступностьКнопкиЗаполнить;
	КонецЕсли;

	Если Параметры.Свойство("ЗакрываемыеРемонты") Тогда

		Для каждого Стр Из Параметры.ЗакрываемыеРемонты Цикл

			НС = Объект.ЗакрываемыеРемонты.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Стр);

		КонецЦикла;

	Иначе

		Если Параметры.Свойство("ОтборРемонтов") Тогда
			ЗаполнитьПлановыеРемонтыНаСервере(Параметры.ОтборРемонтов.ID);
			ЗаполнитьАварийныеРемонтыНаСервере(Параметры.ОтборРемонтов.ID);

			Элементы.АварийныеРемонты.ОтборСтрок = Новый ФиксированнаяСтруктура("ПодходитПодОтбор", Истина);
			Элементы.ЗакрываемыеРемонты.ОтборСтрок = Новый ФиксированнаяСтруктура("ПодходитПодОтбор", Истина);
		Иначе
			ЗаполнитьПлановыеРемонтыНаСервере();
			#Удаление
			ЗаполнитьАварийныеРемонтыНаСервере();
			#КонецУдаления
		КонецЕсли;

	КонецЕсли;

	ФОИспользоватьППР = ПолучитьФункциональнуюОпцию("торо_ИспользоватьППР");
	ФОИспользоватьВД = ПолучитьФункциональнуюОпцию("торо_УчетВыявленныхДефектовОборудования");

	ПричинаЗакрытияЗаявок = Константы.торо_ПричинаЗакрытияЗаявок.Получить();

	Элементы.ГруппаЗакрываемыеРемонты.Видимость = ФОИспользоватьППР;
	Элементы.ГруппаАварийныеРемонты.Видимость = ФОИспользоватьВД;

КонецПроцедуры

#КонецОбласти

#КонецОбласти