
#Область ПрограммныйИнтерфейс

// Формирует дерево значений с колонками Наименование, Оператор, Сдвиг
//
// Возвращаемое значение:
//  ДеревоЗначений - дерево операторов.
//
Функция ПолучитьПустоеДеревоОператоров() Экспорт
	
	Дерево = Новый ДеревоЗначений();
	Дерево.Колонки.Добавить("Наименование");
	Дерево.Колонки.Добавить("Оператор");
	Дерево.Колонки.Добавить("Сдвиг", Новый ОписаниеТипов("Число"));
	
	Возврат Дерево;
	
КонецФункции

// Добавляет в дерево операторов группу операторов с переданным наименованием
//
// Параметры:
//  Дерево - ДеревоЗначений - дерево операторов с колонками Наименование, Оператор, Сдвиг.
//  Наименование - Строка - наименование группы дерева операторов.
//
// Возвращаемое значение:
//  СтрокаДереваЗначений - новая группа операторов.
//
Функция ДобавитьГруппуОператоров(Дерево, Наименование) Экспорт
	
	НоваяГруппа = Дерево.Строки.Добавить();
	НоваяГруппа.Наименование = Наименование;
	
	Возврат НоваяГруппа;
	
КонецФункции

// Добавляет в дерево операторов группу операторов с переданным наименованием.
//
// Параметры:
//  Дерево        - ДеревоЗначений - дерево операторов с колонками Наименование, Оператор, Сдвиг
//  Родитель      - СтрокаДереваЗначений - Группа операторов, в которую необходимо добавить оператор
//  Наименование  - Строка - наименование группы дерева операторов
//  Оператор      - Строка - Представление оператора на встроенном языке
//  Сдвиг         - Число - необходим для определения позиции курсора.
//
// Возвращаемое значение:
//  СтрокаДереваЗначений - новый оператор.
//
Функция ДобавитьОператор(Дерево, Наименование, Родитель = Неопределено, Оператор = Неопределено, Сдвиг = 0) Экспорт
	
	НоваяСтрока = ?(Родитель <> Неопределено, Родитель.Строки.Добавить(), Дерево.Строки.Добавить());
	НоваяСтрока.Наименование = Наименование;
	НоваяСтрока.Оператор = ?(ЗначениеЗаполнено(Оператор), Оператор, Наименование);
	НоваяСтрока.Сдвиг = Сдвиг;
	
	Возврат НоваяСтрока;
	
КонецФункции

// Формирует дерево со стандартными операторами "+", "-", "*", "/"
//
// Возвращаемое значение:
//  ДеревоЗначений - дерево операторов.
//
Функция ПолучитьСтандартноеДеревоОператоров() Экспорт
	
	Дерево = ПолучитьПустоеДеревоОператоров();
	ГруппаОператоров = ДобавитьГруппуОператоров(Дерево, "Операторы");
	ДобавитьОператор(Дерево, "+", ГруппаОператоров, " + ");
	ДобавитьОператор(Дерево, "-", ГруппаОператоров, " - ");
	ДобавитьОператор(Дерево, "*", ГруппаОператоров, " * ");
	ДобавитьОператор(Дерево, "/", ГруппаОператоров, " / ");
	
	Возврат Дерево;
	
КонецФункции

// Заполняет дерево операторов для конструктора формул.
//
// Параметры:
//  Параметры  - Структрура - содержит виды операторов, которые необходимо добавить в дерево.
//  УникальныйИдентификатор  - УникальныйИдентификатор - уникальный идентификатор формы, в которой выполняется действия, 
//                 необходим для корректного помещения во временное хранилище.
//
// Возвращаемое значение:
//  Строка - Адрес дерева во временном хранилище.
Функция ПостроитьДеревоОператоров(Параметры, УникальныйИдентификатор) Экспорт
	
	Дерево = торо_РаботаСФормулами.ПолучитьПустоеДеревоОператоров();
	
	Если Параметры.Свойство("СтандартныеОператоры") И Параметры.СтандартныеОператоры Тогда
		ДобавитьГруппуСтандартныхОператоров(Дерево);
	КонецЕсли;
	
	Если Параметры.Свойство("ЛогическиеОператоры") И Параметры.ЛогическиеОператоры Тогда
		ДобавитьГруппуЛогическихОператоров(Дерево);
	КонецЕсли;
	
	Если Параметры.Свойство("Функции") И Параметры.Функции Тогда
		ДобавитьГруппуФункции(Дерево);
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(Дерево, УникальныйИдентификатор);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьГруппуСтандартныхОператоров(Дерево)

	ГруппаОператоров = торо_РаботаСФормулами.ДобавитьГруппуОператоров(Дерево, НСтр("es='Los operadores';ru='Операторы';en='Operators'"));
	торо_РаботаСФормулами.ДобавитьОператор(Дерево, "+", ГруппаОператоров, " + ");
	торо_РаботаСФормулами.ДобавитьОператор(Дерево, "-", ГруппаОператоров, " - ");
	торо_РаботаСФормулами.ДобавитьОператор(Дерево, "*", ГруппаОператоров, " * ");
	торо_РаботаСФормулами.ДобавитьОператор(Дерево, "/", ГруппаОператоров, " / ");

КонецПроцедуры

Процедура ДобавитьГруппуЛогическихОператоров(Дерево)

	ГруппаОператоров = торо_РаботаСФормулами.ДобавитьГруппуОператоров(Дерево, НСтр("es='Los operadores lógicos y las constantes';ru='Логические операторы и константы';en='Logical operators and constants'"));
	торо_РаботаСФормулами.ДобавитьОператор(Дерево, "<",  ГруппаОператоров, " < ");
	торо_РаботаСФормулами.ДобавитьОператор(Дерево, ">",  ГруппаОператоров, " > ");
	торо_РаботаСФормулами.ДобавитьОператор(Дерево, "<=", ГруппаОператоров, " <= ");
	торо_РаботаСФормулами.ДобавитьОператор(Дерево, ">=", ГруппаОператоров, " >= ");
	торо_РаботаСФормулами.ДобавитьОператор(Дерево, "=",  ГруппаОператоров, " = ");
	торо_РаботаСФормулами.ДобавитьОператор(Дерево, "<>", ГруппаОператоров, " <> ");
	торо_РаботаСФормулами.ДобавитьОператор(Дерево, НСтр("es='Y';ru='И';en='AND'"),      ГруппаОператоров, " " + НСтр("es='Y';ru='И';en='AND'")      + " ");
	торо_РаботаСФормулами.ДобавитьОператор(Дерево, НСтр("es='O';ru='ИЛИ';en='OR'"),    ГруппаОператоров, " " + НСтр("es='O';ru='ИЛИ';en='OR'")    + " ");
	торо_РаботаСФормулами.ДобавитьОператор(Дерево, НСтр("es='NO';ru='НЕ';en='NOT'"),     ГруппаОператоров, " " + НСтр("es='NO';ru='НЕ';en='NOT'")     + " ");
	торо_РаботаСФормулами.ДобавитьОператор(Дерево, НСтр("es='LA VERDAD';ru='ИСТИНА';en='TRUE'"), ГруппаОператоров, " " + НСтр("es='LA VERDAD';ru='ИСТИНА';en='TRUE'") + " ");
	торо_РаботаСФормулами.ДобавитьОператор(Дерево, НСтр("es='LA MENTIRA';ru='ЛОЖЬ';en='FALSE'"),   ГруппаОператоров, " " + НСтр("es='LA MENTIRA';ru='ЛОЖЬ';en='FALSE'")   + " ");

КонецПроцедуры

Процедура ДобавитьГруппуФункции(Дерево)

	ГруппаОператоров = торо_РаботаСФормулами.ДобавитьГруппуОператоров(Дерево, НСтр("es='Las funciones';ru='Функции';en='Functions'"));
	торо_РаботаСФормулами.ДобавитьОператор(Дерево, НСтр("es='El máximo';ru='Максимум';en='Maximum'"),                  ГруппаОператоров, НСтр("es='Макс ()';ru='Макс(,)';en='Max(,)'"), 2);
	торо_РаботаСФормулами.ДобавитьОператор(Дерево, НСтр("es='El mínimo';ru='Минимум';en='Minimum'"),                   ГруппаОператоров, НСтр("es='De las minas ()';ru='Мин(,)';en='Min (,)'"),  2);
	торо_РаботаСФормулами.ДобавитьОператор(Дерево, НСтр("es='El redondeo';ru='Округление';en='Rounding'"),                ГруппаОператоров, НСтр("es='Окр ()';ru='Окр(,)';en='Rounding (,)'"),  2);
	торо_РаботаСФормулами.ДобавитьОператор(Дерево, НСтр("es='La parte entera';ru='Целая часть';en='Whole part'"),               ГруппаОператоров, НСтр("es='Es entero ()';ru='Цел()';en='Whole ()'"),   1);
	торо_РаботаСФормулами.ДобавитьОператор(Дерево, НСтр("es='La condición';ru='Условие';en='Condition'"),                   ГруппаОператоров, "?(,,)",              3);
	торо_РаботаСФормулами.ДобавитьОператор(Дерево, НСтр("es='El significado predestinado';ru='Предопределенное значение';en='Predefined value'"), ГруппаОператоров, НСтр("es='ПредопределенноеЗначение ()';ru='ПредопределенноеЗначение()';en='ПредопределенноеЗначение()'"));
	торо_РаботаСФормулами.ДобавитьОператор(Дерево, НСтр("es='El significado es rellenado';ru='Значение заполнено';en='The value is full'"),        ГруппаОператоров, НСтр("es='ЗначениеЗаполнено ()';ru='ЗначениеЗаполнено()';en='ЗначениеЗаполнено()'"));

КонецПроцедуры

#КонецОбласти
