
&ИзменениеИКонтроль("ПриСозданииСтандартнойФормы")
Процедура Расш_гкс_ПриСозданииСтандартнойФормы(Форма, Отказ, СтандартнаяОбработка)
	#Вставка
	Если торо_ОбщегоНазначенияПовтИсп.ЭтоЯзыкПоУмолчанию() Тогда
	#КонецВставки
	#Удаление
	Если ЭтоЯзыкПоУмолчанию() Тогда
	#КонецУдаления
		Возврат
	КонецЕсли;

	Если Форма.Параметры.Свойство("ВидФормы") 
		И (Форма.Параметры.ВидФормы = "ФормаСписка" 
		ИЛИ Форма.Параметры.ВидФормы = "ФормаВыбора") Тогда 

		МассивРеквизитов = Новый Массив;
		Список = Новый РеквизитФормы("Список", Новый ОписаниеТипов("ДинамическийСписок"),,, Истина);
		МассивРеквизитов.Добавить(Список);
		МассивРеквизитов.Добавить(Новый РеквизитФормы("торо_ПутьКСправке", Новый ОписаниеТипов("Строка")));
		Форма.ИзменитьРеквизиты(МассивРеквизитов);
		ПостроитьДинамическийСписокформы(Форма);

		Для Каждого СМ Из Форма.Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы Цикл
			Форма.Элементы.Переместить(СМ, Форма.Элементы.СписокКоманднаяПанель);
		КонецЦикла;
		Форма.Элементы.ФормаКоманднаяПанель.Видимость = Ложь;
		Форма.Заголовок = Метаданные[Форма.Параметры.ТипМетаданных][Форма.Параметры.ТипОбъектаИБ].Синоним;
		Форма.АвтоЗаголовок = Ложь;

		ДобавитьКнопкиНаФорму(Форма, Форма.Параметры.ТипМетаданных, Форма.Параметры.ВидФормы);

		Если Форма.Параметры.ТипМетаданных = "Справочники" Тогда 
			Форма["торо_ПутьКСправке"] = "Справочник." + Форма.Параметры.ТипОбъектаИБ;
		ИначеЕсли Форма.Параметры.ТипМетаданных = "Документы" Тогда 
			Форма["торо_ПутьКСправке"] = "Документ." + Форма.Параметры.ТипОбъектаИБ;
		КонецЕсли;

		Если Форма.Параметры.ВидФормы <> "ФормаСписка" Тогда
			Форма.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		КонецЕсли; 

	ИначеЕсли Форма.Параметры.Свойство("Ключ") Тогда 
		Форма.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		ОбъектФормы = Форма.Параметры.Ключ;
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(ТипЗнч(ОбъектФормы));
		ТипОбъекта = ПолучитьИмяБазовогоТипаПоТипуОбъекта(ТипЗнч(ОбъектФормы));

		МассивРеквизитов = Новый Массив;
		Объект = Новый РеквизитФормы("Объект", Новый ОписаниеТипов(МассивТипов),,, Истина);
		МассивРеквизитов.Добавить(Объект);
		МассивРеквизитов.Добавить(Новый РеквизитФормы("торо_ПутьКСправке", Новый ОписаниеТипов("Строка")));
		Форма.ИзменитьРеквизиты(МассивРеквизитов);

		Форма.ЗначениеВРеквизитФормы(ОбъектФормы, "Объект");
		Если Не ТипОбъекта = "РегистрыСведений" Тогда 
			Если Форма.Объект.Свойство("Номер") Тогда
				Номер = Форма.Элементы.Добавить("Номер", Тип("ПолеФормы"), Форма);
				Номер.Вид = ВидПоляФормы.ПолеВвода;
				Номер.ПутьКДанным = "Объект.Номер";
			КонецЕсли;

			Если Форма.Объект.Свойство("Код") Тогда
				Номер = Форма.Элементы.Добавить("Код", Тип("ПолеФормы"), Форма);
				Номер.Вид = ВидПоляФормы.ПолеВвода;
				Номер.РастягиватьПоГоризонтали = Ложь;
				Номер.ПутьКДанным = "Объект.Код";
			КонецЕсли;

			Если Форма.Объект.Свойство("Дата") Тогда
				Номер = Форма.Элементы.Добавить("Дата", Тип("ПолеФормы"), Форма);
				Номер.Вид = ВидПоляФормы.ПолеВвода;
				Номер.ПутьКДанным = "Объект.Дата";
			КонецЕсли; 

			Если Форма.Объект.Свойство("Наименование") Тогда
				Наименование = Форма.Элементы.Добавить("Наименование", Тип("ПолеФормы"), Форма);
				Наименование.Вид = ВидПоляФормы.ПолеВвода;
				Наименование.ПутьКДанным = "Объект.Наименование";
			КонецЕсли; 
		КонецЕсли;
		ДобавитьРеквизитыНаФорму(Форма, ОбъектФормы, ТипОбъекта);
		ДобавитьКнопкиНаФорму(Форма, ТипОбъекта);
		//
		Форма.Заголовок = Форма.Параметры.Ключ.Метаданные().Синоним;
		Если ТипОбъекта = "Справочники" Тогда 
			Форма["торо_ПутьКСправке"] = "Справочник." + Форма.Параметры.Ключ.Метаданные().Имя;
			Форма.Заголовок = ?(ЗначениеЗаполнено(Форма.Объект.Ссылка), Строка(Форма.Объект.Ссылка) 
			+ " (" + Форма.Заголовок + ")", Форма.Заголовок + " (" + НСтр("ru='Создание';en='Creature'") + ")");
		ИначеЕсли ТипОбъекта = "Документы" Тогда 
			Форма["торо_ПутьКСправке"] = "Документ." + Форма.Параметры.Ключ.Метаданные().Имя;
			Форма.Заголовок = ?(ЗначениеЗаполнено(Форма.Объект.Ссылка), Строка(Форма.Объект.Ссылка) + 
			" (" + Форма.Заголовок + ")", Форма.Заголовок + " (" + НСтр("ru='Создание';en='Creature'") + ")");
		ИначеЕсли ТипОбъекта = "РегистрыСведений" Тогда 
			Форма["торо_ПутьКСправке"] = "РегистрСведений." + Форма.Параметры.ТипОбъектаИБ;
		КонецЕсли;

		Форма.АвтоЗаголовок = Ложь;
	КонецЕсли;
КонецПроцедуры

&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура Расш_гкс_ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка)
	#Вставка
	Если торо_ОбщегоНазначенияПовтИсп.ЭтоЯзыкПоУмолчанию() Тогда
	#КонецВставки
	#Удаление
	Если ЭтоЯзыкПоУмолчанию() Тогда
	#КонецУдаления
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ЭтаФорма) = Тип("Булево") И Не ЭтаФорма Тогда
		Возврат;
	КонецЕсли;

	Если ЭтаФорма.Параметры.Свойство("ТипМетаданных") 
		И ЭтаФорма.Параметры.ТипМетаданных = "РегистрыСведений" Тогда 
		Возврат;
	КонецЕсли;
	Если ЭтаФорма.Параметры.Свойство("ВидФормы") 
		И (ЭтаФорма.Параметры.ВидФормы = "ФормаСписка" 
		ИЛИ ЭтаФорма.Параметры.ВидФормы = "ФормаВыбора") Тогда 
		Возврат;
	КонецЕсли;

	ДобавляемыеРеквизиты = Новый Массив;
	СоотвРеквизитов = Новый Соответствие;
	СтарыйНовый = Новый Соответствие;

	СтроковыеРеквизиты = Новый Массив;
	РеквизитыОбъекта = Этаформа.ПолучитьРеквизиты("Объект");
	Для каждого РеквизитОбъекта Из РеквизитыОбъекта Цикл
		Если РеквизитОбъекта.ТипЗначения.СодержитТип(Тип("Строка")) Тогда
			Если РеквизитОбъекта.Имя <> "Код" Тогда
				СтроковыеРеквизиты.Добавить(РеквизитОбъекта);
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 

	ЭлементыФормы = Новый Соответствие;
	Для каждого Элемент Из ЭтаФорма.Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ПолеФормы") Тогда
			ЭлементыФормы.Вставить(Элемент.ПутьКДанным, Элемент);
		КонецЕсли; 
	КонецЦикла;

	ЗаголовкиЭлементов = Новый Массив;
	Для каждого СтроковыйРеквизит Из СтроковыеРеквизиты Цикл
		ПутьКДанным = СтрШаблон("%1.%2", СтроковыйРеквизит.Путь, СтроковыйРеквизит.Имя);
		ЭлементРеквизита = ЭлементыФормы[ПутьКДанным];
		ИмяРеквизита = СтроковыйРеквизит.Имя;
		НовоеИмяРеквизита = СтрШаблон("замена_%1", ИмяРеквизита);

		Если ЭлементРеквизита <> Неопределено Тогда
			Строка = Новый Структура("Элемент,Заголовок,ИмяРеквизита,НовоеИмяРеквизита",
			ЭлементРеквизита, СтроковыйРеквизит.Заголовок, СтроковыйРеквизит.Имя, НовоеИмяРеквизита); 
			ЗаголовкиЭлементов.Добавить(Строка);
			СтарыйНовый.Вставить(НовоеИмяРеквизита, ИмяРеквизита);
		КонецЕсли; 
	КонецЦикла; 

	Для каждого Элемент Из ЗаголовкиЭлементов Цикл
		ИмяРеквизита = Элемент.НовоеИмяРеквизита;
		Заголовок = Элемент.Заголовок;
		НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизита, Новый ОписаниеТипов("Строка"), , Заголовок, Истина);
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	КонецЦикла;

	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	Язык = Справочники.торо_Языки.НайтиПоКоду(ТекущийЯзык().КодЯзыка);

	Для каждого Элемент Из ЗаголовкиЭлементов Цикл
		ИмяРеквизита = Элемент.НовоеИмяРеквизита;
		ЭлементФормы = Элемент.Элемент;

		НовыйЭлемент = ЭтаФорма.Элементы.Вставить(ИмяРеквизита, Тип("ПолеФормы"), ЭлементФормы.Родитель, ЭлементФормы);
		НовыйЭлемент.ПутьКДанным = ИмяРеквизита;
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;

		ЭлементФормы.Видимость = Ложь;

		ИсходныйРеквизит = СтарыйНовый[Элемент.НовоеИмяРеквизита];
		ЗначениеРеквизита = ПолучитьЗначениеРеквизитаОбъекта(ЭтаФорма.Объект.Ссылка, ИсходныйРеквизит, Язык);

		Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
			ЭтаФорма[ИмяРеквизита] = ЗначениеРеквизита;
		Иначе
			ЭтаФорма[ИмяРеквизита] = ЭтаФорма.Объект[Элемент.ИмяРеквизита];
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

&ИзменениеИКонтроль("МодифицироватьСписокДляПеревода")
Процедура Расш_гкс_МодифицироватьСписокДляПеревода(Список, МассивРеквизитов)
	Если Не СтрНайти(Список.ТекстЗапроса,"РегистрСведений.Переводы") = 0 
		ИЛИ (Не МассивРеквизитов = Неопределено И МассивРеквизитов.Количество() = 0) Тогда 
		Возврат;
	КонецЕсли;

	#Вставка
	Если торо_ОбщегоНазначенияПовтИсп.ЭтоЯзыкПоУмолчанию() Тогда
	#КонецВставки
	#Удаление
	Если ЭтоЯзыкПоУмолчанию() Тогда
	#КонецУдаления
		Возврат
	КонецЕсли;

	Если СтрНачинаетсяС(Список.ТекстЗапроса, "//Локализация") Тогда
		ИмяТаблицы = Список.ОсновнаяТаблица;
	Иначе
		ИмяТаблицы = "Таблица";
	КонецЕсли; 

	Если МассивРеквизитов = Неопределено Тогда 
		Если СтрНайти(ИмяТаблицы,"Справочник") > 0 Тогда 
			ТипМетаданных = "Справочники";
			МетаданныеРеквизиты = Новый Массив;
			МетаданныеРеквизитыСправочника = Метаданные.Справочники[СтрЗаменить(ИмяТаблицы, "Справочник.", "")].Реквизиты;

			Для каждого РеквизитСправочника Из МетаданныеРеквизитыСправочника Цикл
				МетаданныеРеквизиты.Добавить(РеквизитСправочника);
			КонецЦикла; 

			МетаданныеРеквизиты.Добавить(Метаданные.Справочники[СтрЗаменить(ИмяТаблицы,
			"Справочник.", "")].СтандартныеРеквизиты["Наименование"]);
			ИмяТаблицы = "ТЧ";
		ИначеЕсли СтрНайти(ИмяТаблицы, "Документ") > 0 Тогда 
			ТипМетаданных = "Документы";
			МетаданныеРеквизиты = Метаданные.Документы[СтрЗаменить(ИмяТаблицы, "Документ.", "")].Реквизиты;
			ИмяТаблицы = "ТЧ";		
		Иначе
			Возврат;
		КонецЕсли;

		МассивРеквизитов = Новый Массив();
		ИскомыйТип = Тип("Строка");
		Для Каждого Реквизит Из МетаданныеРеквизиты Цикл
			Если Реквизит.Тип.СодержитТип(ИскомыйТип) Тогда 
				МассивРеквизитов.Добавить(Реквизит.Имя);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	ЕстьСвязи = Ложь;
	Для Каждого СМ Из МассивРеквизитов Цикл
		НачалоПоиска = СтрНайти(Список.ТекстЗапроса, " КАК " + СМ, НаправлениеПоиска.СКонца);
		Если НачалоПоиска > 0 Тогда 
			КонецПоиска = СтрНайти(Список.ТекстЗапроса, "	", НаправлениеПоиска.СКонца, НачалоПоиска - 1) + 1;
			ТекстЗамены = Сред(Список.ТекстЗапроса, КонецПоиска, НачалоПоиска - КонецПоиска);
			Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, 
			ТекстЗамены, "ЕстьNull(ВЫРАЗИТЬ(ТЧ" + СМ + ".Текст КАК СТРОКА(1000))," + ТекстЗамены + ")");
			Список.ТекстЗапроса = Список.ТекстЗапроса + "
			|	Левое Соединение РегистрСведений.торо_Переводы КАК ТЧ" + СМ + "
			|	ПО " + ИмяТаблицы + ".Ссылка = ТЧ" + СМ + ".ID
			|	И (ТЧ" + СМ + ".Реквизит = """ + СМ + """)
			|	И (ТЧ" + СМ + ".Язык = &Язык)";
			ЕстьСвязи = Истина;
		КонецЕсли;
	КонецЦикла;
	Если ЕстьСвязи Тогда 
		Язык = Справочники.торо_Языки.НайтиПоКоду(ТекущийЯзык().КодЯзыка);
		Список.Параметры.УстановитьЗначениеПараметра("Язык", Язык);
	КонецЕсли;
КонецПроцедуры
