#Область ОбработчикиСобытийФормы

&НаСервере
Процедура Расш_гкс_ПриЧтенииНаСервереПосле(ТекущийОбъект)
	// гкс+ [Часовые пояса] Куст 14.04.2020
	СтруктураПроверки = Новый Структура("гкс_СдвигЧП", Неопределено);
	ЗаполнитьЗначенияСвойств(СтруктураПроверки, ЭтотОбъект);
	Если Не СтруктураПроверки.гкс_СдвигЧП = Неопределено Тогда 
		гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПКлиента(ЭтаФорма,, Объект);
	КонецЕсли;
	// гкс- [Часовые пояса] Куст 14.04.2020
КонецПроцедуры

&НаКлиенте
Процедура Расш_гкс_ПриОткрытииПосле(Отказ)
	ПриОткрытииНаСервере(ТекущаяДата());
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере(ДатаКлиента)
	Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда 
		Объект.Дата = ТекущаяДата();
	КонецЕсли;
	// гкс+ [Часовые пояса] Куст 14.04.2020
	гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПКлиента(ЭтаФорма,,,);
	// Заголовок формы++
	торо_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(Объект, ЭтаФорма, "");
	// Заголовок формы--
	// гкс- [Часовые пояса] Куст 14.04.2020
КонецПроцедуры

&НаСервере
Процедура Расш_гкс_ПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// гкс+ [Часовые пояса] Куст 15.04.2020
	гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПСервера(ЭтаФорма,, ТекущийОбъект);
	// гкс- [Часовые пояса] Куст 15.04.2020
КонецПроцедуры

&НаСервере
Процедура Расш_гкс_ПриЗаписиНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// гкс+ [Часовые пояса] Куст 15.04.2020
	гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПКлиента(ЭтаФорма,, ТекущийОбъект);
	// гкс- [Часовые пояса] Куст 15.04.2020
КонецПроцедуры

&НаСервере
&После("ОбновитьЗакрываемыеАктыНаСервере")
Процедура Расш_гкс_ОбновитьЗакрываемыеАктыНаСервере(ID = Неопределено)
		СтруктураПроверки = Новый Структура("гкс_СдвигЧП", Неопределено);
	ЗаполнитьЗначенияСвойств(СтруктураПроверки, ЭтотОбъект);
	Если Не СтруктураПроверки.гкс_СдвигЧП = Неопределено И Не ЭтотОбъект["гкс_СдвигЧП"] = 0 Тогда 
		Если ID = Неопределено Тогда 
			Для Каждого СтрокаТаблицы Из Объект.ЗакрываемыеАкты Цикл
				СтрокаТаблицы.ДатаНачала = СтрокаТаблицы.ДатаНачала + (ЭтотОбъект["гкс_СдвигЧП"] * 3600);
				СтрокаТаблицы.ДатаОкончания = СтрокаТаблицы.ДатаОкончания + (ЭтотОбъект["гкс_СдвигЧП"] * 3600);
			КонецЦикла;
		Иначе
			Для Каждого СтрокаТаблицы Из Объект.ЗакрываемыеАкты Цикл
				Если СтрокаТаблицы.ID = ID Тогда 
					СтрокаТаблицы.ДатаНачала = СтрокаТаблицы.ДатаНачала + (ЭтотОбъект["гкс_СдвигЧП"] * 3600);
					СтрокаТаблицы.ДатаОкончания = СтрокаТаблицы.ДатаОкончания + (ЭтотОбъект["гкс_СдвигЧП"] * 3600);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// гкс+ [разработка 2021] Куст 28.04.2021
&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура гкс_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	#Удаление
	Если Параметры.Свойство("Основание") Тогда
	#КонецУдаления
	#Вставка
	Если Параметры.Свойство("Основание")
		И ТипЗнч(Параметры.Основание) <> Тип("Соответствие")
		Тогда
	#КонецВставки
		торо_ЗаполнениеДокументов.ПроверитьВозможностьВводаНаОсновании(Параметры.Основание, Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	#Вставка
	гкс_ПроверитьВозможностьВвода(Отказ);
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	#КонецВставки

	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

	торо_СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка, Новый Структура("УстановитьСвойствоЭлементовФормыОтПрав", Истина));

	ЗаполнитьСписокАктов();

	// Заголовок формы++
	торо_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(Объект, ЭтаФорма, "");
	// Заголовок формы--

	// Согласование++
	ВидДокумента = Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_АктПриемкиОборудования;
	торо_РаботаССогласованиями.ПриСозданииНаСервере(ЭтаФорма, ВидДокумента);
	// Согласование --

	#Вставка
	// гкс+ [Часовые пояса] Куст 15.04.2020
	гкс_ЧасовыеПоясаВызовСервера.ДобавитьНовыеЭлементы(ЭтаФорма, Элементы.НомерДата,
		Новый Структура("гкс_РеквизитыДаты", "Дата,РемонтыОборудования.ДатаНачала,РемонтыОборудования.ДатаОкончания" +
		",ЗакрываемыеАкты.ДатаНачала,ЗакрываемыеАкты.ДатаОкончания"));
	// гкс- [Часовые пояса] Куст 15.04.2020
	// гкс+ [03.23] Деснол 13.03.2023
	Если Не РольДоступна("гкс_РедактированиеЗаявкиНаРемонт") Тогда 
		Элементы.Дата.ТолькоПросмотр = Истина;
	КонецЕсли;
	// гкс- [03.23] Деснол 13.03.2023
	#КонецВставки
КонецПроцедуры
// гкс- [разработка 2021] Куст 28.04.2021

// гкс+ [разработка 2021] Куст 28.04.2021
&НаСервере
Процедура гкс_ПроверитьВозможностьВвода(Отказ)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Возврат;
	КонецЕсли;
	//
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧ.ID КАК ИД
		|ПОМЕСТИТЬ НужныеРемонты
		|ИЗ
		|	&ТЧ1 КАК ТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокТЧ.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.торо_АктПриемкиОборудования.РемонтыОборудования КАК ДокТЧ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НужныеРемонты КАК НужныеРемонты
		|		ПО ДокТЧ.ID = НужныеРемонты.ИД
		|			И (ДокТЧ.Ссылка.ПометкаУдаления = ЛОЖЬ)
		|;
		|
		// гкс+ [] Деснол 28.09.2022
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокТЧ.Ссылка КАК Ссылка, 
		|	Минимум(ДокТЧ.Ссылка.гкс_РаботыВыполнены) КАК гкс_РаботыВыполнены,
		|	ДокТЧ.Ссылка.СпособСогласования КАК Способ
		|	,РегистрСведенийторо_ТекущиеСтатусыСогласованияДокументов.СтатусДокумента КАК Статус
		|Поместить ВТ_ТекущийСтатус
		|ИЗ
		|	НужныеРемонты КАК НужныеРемонты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК ДокТЧ
		|	Левое соединение РегистрСведений.торо_ТекущиеСтатусыСогласованияДокументов КАК РегистрСведенийторо_ТекущиеСтатусыСогласованияДокументов
		|	ПО РегистрСведенийторо_ТекущиеСтатусыСогласованияДокументов.СогласуемыйДокумент = ДокТЧ.Ссылка
		|		ПО НужныеРемонты.ИД = ДокТЧ.ID И ДокТЧ.Ссылка.ПометкаУдаления = Ложь
		|Сгруппировать по ДокТЧ.Ссылка,
		|	ДокТЧ.Ссылка.СпособСогласования
		|	,РегистрСведенийторо_ТекущиеСтатусыСогласованияДокументов.СтатусДокумента
		|;
		|Выбрать
		|ВТ.Ссылка КАК Ссылка,
		|ВТ.Статус КАК Статус,
		|ВТ.гкс_РаботыВыполнены КАК гкс_РаботыВыполнены,
		|ЕстьNULL(РегистрСведенийторо_НастройкиСтатусовСогласованияДокументов.СогласованиеЗавершено, Ложь) КАК СогласованиеЗавершено
		|ИЗ ВТ_ТекущийСтатус КАК ВТ
		|Левое соединение  РегистрСведений.торо_НастройкиСтатусовСогласованияДокументов КАК РегистрСведенийторо_НастройкиСтатусовСогласованияДокументов
		|	ПО РегистрСведенийторо_НастройкиСтатусовСогласованияДокументов.Статус = ВТ.Статус
		|	И РегистрСведенийторо_НастройкиСтатусовСогласованияДокументов.СпособСогласования = ВТ.Способ
		|
		|
		|";
		// гкс- [] Деснол 28.09.2022
	Запрос.УстановитьПараметр("ТЧ1", Объект.РемонтыОборудования.Выгрузить());
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Пакет1 = 1;
	// гкс+ [] Деснол 28.09.2022
	Пакет2 = Пакет1 + 2;
	// гкс- [] Деснол 28.09.2022
	Если РезультатЗапроса[Пакет1].Пустой() = Ложь Тогда 
		Выборка = РезультатЗапроса[Пакет1].Выбрать();
		Выборка.Следующий();
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("es='По ремонту уже есть акт приемки ';ru='По ремонту уже есть акт приемки ';
		|en='По ремонту уже есть акт приемки '") + Строка(Выборка.Ссылка);
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	//
	Если РезультатЗапроса[Пакет2].Пустой() Тогда 
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("es='По ремонту нет выполненных актов';
		|ru='По ремонту нет выполненных актов';en='По ремонту нет выполненных актов'");
		Сообщение.Сообщить();
		Возврат;
	Иначе
		Выборка = РезультатЗапроса[Пакет2].Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.гкс_РаботыВыполнены = Ложь Тогда 
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = НСтр("es='Не все акты по ремонту выполнены';
				|ru='Не все акты по ремонту выполнены';en='Не все акты по ремонту выполнены'");
				Сообщение.Сообщить();
				Отказ = Истина;
				Возврат;
			// гкс+ [] Деснол 24.08.2022
			Иначе
				Если Не ЗначениеЗаполнено(Выборка.Статус) 
					ИЛИ Не (Выборка.СогласованиеЗавершено ИЛИ Выборка.Статус = Справочники.торо_СтатусыСогласованияДокументовРемонтныхРабот.Согласован) Тогда 
					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = НСтр("ru='Не все акты по ремонту согласованы';
					|en='Repair equipment acceptance certificate exists'");
					Сообщение.Сообщить();
					Отказ = Истина;
					Возврат;
				КонецЕсли;
			// гкс- [] Деснол 24.08.202
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//
	Для Каждого СтрокаРемонта Из Объект.РемонтыОборудования Цикл
		ОбновитьЗакрываемыеАктыНаСервере(СтрокаРемонта.ID);
	КонецЦикла;
КонецПроцедуры
// гкс- [разработка 2021] Куст 28.04.2021


#КонецОбласти