#Область ОбработчикиСобытийФормы
// гкс+ [Релиз 1] Куст 17.03.2020
&НаСервере
Процедура ДобавитьНовыеЭлементы()
	НЭлем = Элементы.Добавить("дс_Ссылка", Тип("ПолеФормы"), Элементы.Список);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Список.Ссылка";
	НЭлем.Заголовок = НСтр("ru='Наименование';en='Name'");
	Элементы.Переместить(Элементы["дс_Ссылка"], Элементы.Список, Элементы.Наименование);
	Элементы.Наименование.Видимость = Ложь;
	
КонецПроцедуры
// гкс-[Релиз 1] Куст 17.03.2020

&НаСервере
Процедура Расш_гкс_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// гкс+ [Релиз 1] Куст 17.03.2020
	торо_ЛокализацияМодификацияФорм.ПеревестиДинамическийСписок(ЭтаФорма, Список, "Наименование,Комментарий,Изготовитель", Метаданные.Справочники.торо_ТиповыеОР);
	ДобавитьНовыеЭлементы();
	// гкс-[Релиз 1] Куст 17.03.2020
КонецПроцедуры

#КонецОбласти