#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Заполняет список команд печати.
//
// Параметры:
// КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Наряд на выполнение огневых работ
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_НарядНаВыполнениеРемонтныхРабот";
	КомандаПечати.Идентификатор = "НарядНаВыполнениеОгневыхРабот";
	КомандаПечати.Представление = НСтр("es='El vestido-permiso de la ejecución de los trabajos de fuego';ru='Наряд-допуск на выполнение огневых работ';en='Fire work admission order'");
	КомандаПечати.Обработчик = "торо_Печать.ЗапроситьУПользователяДополнительныеПараметрыПередПечатью";
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	
	// Наряд-допуск на производство работ на высоте
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_НарядНаВыполнениеРемонтныхРабот";
	КомандаПечати.Идентификатор = "НарядДопускНаПроизводствоРаботНаВысоте";
	КомандаПечати.Представление = НСтр("es='El vestido-permiso de la producción de los trabajos a la altura';ru='Наряд-допуск на производство работ на высоте';en='Work at heights admission order'");
	КомандаПечати.Обработчик = "торо_Печать.ЗапроситьУПользователяДополнительныеПараметрыПередПечатью";
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	
	// Наряд-допуск для работы в электроустановках
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_НарядНаВыполнениеРемонтныхРабот";
	КомандаПечати.Идентификатор = "НарядДопускДляРаботыВЭлектроустановках";
	КомандаПечати.Представление = НСтр("es='El vestido-permiso para el trabajo en las instalaciones eléctricas';ru='Наряд-допуск для работы в электроустановках';en='The admission order for work in electrical installations'");
	КомандаПечати.Обработчик = "торо_Печать.ЗапроситьУПользователяДополнительныеПараметрыПередПечатью";
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	
	// Наряд на производство работ повышенной опасности
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_НарядНаВыполнениеРемонтныхРабот";
	КомандаПечати.Идентификатор = "НарядНаПроизводствоРаботПовышеннойОпасности";
	КомандаПечати.Представление = НСтр("es='El vestido-permiso de la producción de los trabajos del peligro subido';ru='Наряд-допуск на производство работ повышенной опасности';en='Production of hazardous work admission order'");
	КомандаПечати.Обработчик = "торо_Печать.ЗапроситьУПользователяДополнительныеПараметрыПередПечатью";
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_НарядНаВыполнениеРемонтныхРабот";
	КомандаПечати.Идентификатор = "НарядНаРаботы_НеОпасные";
	КомандаПечати.Представление = НСтр("es='El vestido de los trabajos';ru='Наряд на работы';en='Work order'");
	КомандаПечати.Обработчик = "торо_Печать.ЗапроситьУПользователяДополнительныеПараметрыПередПечатью";
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	
	// Наряд-допуск на проведение газоопасных работ
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_НарядНаВыполнениеРемонтныхРабот";
	КомандаПечати.Идентификатор = "НарядДопускНаПроведениеГазоопасныхРабот";
	КомандаПечати.Представление = НСтр("es='El vestido-permiso de la realización газоопасных de los trabajos';ru='Наряд-допуск на проведение газоопасных работ';en='Hazardous work admission order'");
	КомандаПечати.Обработчик = "торо_Печать.ЗапроситьУПользователяДополнительныеПараметрыПередПечатью";
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_НарядНаВыполнениеРемонтныхРабот";
	КомандаПечати.Идентификатор = "НарядНаРаботы_сПоказателями";
	КомандаПечати.Представление = НСтр("es='El vestido de los trabajos (con la lista de los índices)';ru='Наряд на работы (со списком показателей)';en='Work order (with a list of indicators)'");
	КомандаПечати.Обработчик = "торо_Печать.ЗапроситьУПользователяДополнительныеПараметрыПередПечатью";
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_НарядНаВыполнениеРемонтныхРабот";
	КомандаПечати.Идентификатор = "НарядНаРаботы_ОднимДокументом";
	КомандаПечати.Представление = НСтр("es='El vestido de los trabajos (un documento)';ru='Наряд на работы (одним документом)';en='Work order (in one document)'");
	КомандаПечати.Обработчик = "торо_Печать.ЗапроситьУПользователяДополнительныеПараметрыПередПечатью";
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);

КонецПроцедуры

// Сформировать печатные формы объектов.
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую.
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать.
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати.
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы.
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "НарядНаВыполнениеОгневыхРабот") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"НарядНаВыполнениеОгневыхРабот", 
		"Наряд на выполнение огневых работ", 
		ПечатьНарядНаВыполнениеОгневыхРабот(МассивОбъектов, ПараметрыПечати),
		,
		"Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_НарядНаВыполнениеОгневыхРабот");
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "НарядДопускНаПроизводствоРаботНаВысоте") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"НарядДопускНаПроизводствоРаботНаВысоте", 
		"Наряд допуск на производство работ на высоте", 
		ПечатьНарядДопускНаПроизводствоРаботНаВысоте(МассивОбъектов,ПараметрыПечати),
		,
		"Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_НарядДопускНаПроизводствоРаботНаВысоте");
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "НарядДопускДляРаботыВЭлектроустановках") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"НарядДопускДляРаботыВЭлектроустановках", 
		"Наряд допуск для работы в электроустановках", 
		ПечатьНарядДопускДляРаботыВЭлектроустановках(МассивОбъектов,ПараметрыПечати),
		,
		"Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_НарядДопускДляРаботыВЭлектроустановках");		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "НарядНаПроизводствоРаботПовышеннойОпасности") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"НарядНаПроизводствоРаботПовышеннойОпасности", 
		"Наряд на производство работ повышенной опасности", 
		ПечатьНарядНаПроизводствоРаботПовышеннойОпасности(МассивОбъектов, ПараметрыПечати),
		,
		"Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_НарядНаПроизводствоРаботПовышеннойОпасности");		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "НарядНаРаботы_НеОпасные") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"НарядНаРаботы_НеОпасные", 
		"Наряд на производство работ", 
		НарядНаРаботы_НеОпасные(МассивОбъектов, ПараметрыПечати, "НарядНаРаботы_НеОпасные"),
		,
		"Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_НарядНаРаботы_НеОпасные");
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "НарядДопускНаПроведениеГазоопасныхРабот") Тогда 
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
		"НарядДопускНаПроведениеГазоопасныхРабот",
		"Наряд допуск на проведение газоопасных работ",
		ПечатьНарядДопускНаПроведениеГазоопасныхРабот(МассивОбъектов, ПараметрыПечати),
		,
		"Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_НарядДопускНаПроведениеГазоопасныхРабот");
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "НарядНаРаботы_сПоказателями") Тогда 
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
		"НарядНаРаботы_сПоказателями",
		"Наряд на производство работ (со списком показателей)",
		НарядНаРаботы_НеОпасные(МассивОбъектов, ПараметрыПечати, "НарядНаРаботы_сПоказателями"),
		,
		"Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_НарядНаРаботы_сПоказателями");
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "НарядНаРаботы_ОднимДокументом") Тогда 
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
		"НарядНаРаботы_ОднимДокументом",
		"Наряд на производство работ (одним документом)",
		НарядНаРаботы_ОднимДокументом(МассивОбъектов, ПараметрыПечати),
		,
		"Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_НарядНаРаботы_ОднимДокументом");
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиРаботы(МассивСтрок,тзСписокРабот,СтрокаТаблицыРабот,ТабДок,МассивID,Ном,Комментарии,КолВо)
	Для каждого СписокРабот Из МассивСтрок Цикл
		СтрокаТаблицыРабот.Параметры.Номер = Ном;
		СтрокаТаблицыРабот.Параметры.Работа = СписокРабот.Работа;
		Если КолВо = Истина Тогда
    		СтрокаТаблицыРабот.Параметры.Количество=СписокРабот.Количество; 
		КонецЕсли;	
		Если Комментарии = Истина Тогда
			СтрокаТаблицыРабот.Параметры.Комментарий = СписокРабот.Комментарий;
		КонецЕсли;
		ТабДок.Вывести(СтрокаТаблицыРабот);
		МассивID.Добавить(СписокРабот.ID);
		ВывестиРаботы(тзСписокРабот.НайтиСтроки(Новый Структура("Родитель_ID",СписокРабот.ID)),тзСписокРабот,СтрокаТаблицыРабот,ТабДок,МассивID,Ном + ".1",Комментарии,КолВо);
		Ном = Лев(Ном,СтрДлина(Ном)-1) + Строка(Число(Прав(Ном,1)) + 1);
	КонецЦикла;
КонецПроцедуры

Функция ПечатьНарядНаВыполнениеОгневыхРабот(МассивОбъектов, ПараметрыПечати)
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "торо_НарядНаВыполнениеРемонтныхРабот";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_НарядНаВыполнениеОгневыхРабот");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка КАК Ссылка,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Номер КАК Номер,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Дата КАК Дата,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Организация КАК Организация,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Подразделение КАК Подразделение,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Ответственный КАК Ответственный,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID КАК ID,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ДатаНачала КАК ДатаНачала,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ДатаОкончания КАК ДатаОкончания,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОпаснаяРабота КАК ОпаснаяРабота,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.МестоПроведенияРабот КАК МестоПроведенияРабот
	|ИЗ
	|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтыОборудования КАК торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования
	|ГДЕ
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка В(&Ссылка)
	|	И торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID В(&ID)
	|ИТОГИ
	|	МАКСИМУМ(Номер),
	|	МАКСИМУМ(Дата),
	|	МАКСИМУМ(Организация),
	|	МАКСИМУМ(Подразделение),
	|	МАКСИМУМ(Ответственный)
	|ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	Если ПараметрыПечати.Свойство("МассивID") Тогда
		Запрос.УстановитьПараметр("ID", ПараметрыПечати.МассивID);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID В(&ID)", "");
	КонецЕсли;
	
	ВыборкаДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
	ЭтоПервый = Истина;
	
	Пока ВыборкаДокументов.Следующий() Цикл
		
		ВыборкаРемонтов = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока ВыборкаРемонтов.Следующий() Цикл
			
			Если НЕ ЭтоПервый Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ЭтоПервый = Ложь;
			
			Шапка = Макет.ПолучитьОбласть("ШапкаДокумента");
			Шапка.Параметры.Организация = ВыборкаДокументов.Организация;
			Шапка.Параметры.ПодразделениеОрганизации = ВыборкаДокументов.Подразделение;
			ТабДок.Вывести(Шапка);
			
			ПерваяРемонтнаяРабота = Макет.ПолучитьОбласть("ПерваяРемонтнаяРабота");
			РемонтнаяРабота       = Макет.ПолучитьОбласть("РемонтнаяРабота");
			
			Отбор = Новый Структура;
			Отбор.Вставить("РемонтыОборудования_ID", ВыборкаРемонтов.ID);
			СтрокиТекущегоОтбора = ВыборкаДокументов.Ссылка.РемонтныеРаботы.НайтиСтроки(Отбор);
			
			ПерваяРабота = Истина;
			Для Каждого СтрокаОтбора Из СтрокиТекущегоОтбора Цикл
				Если ТипЗнч(СтрокаОтбора.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
					Если СтрокаОтбора.РемонтнаяРабота.НаименованиеДляПечати = "" Тогда
					    НаименованиеРаботы = СтрокаОтбора.РемонтнаяРабота.Наименование;
					Иначе
					    НаименованиеРаботы = СтрокаОтбора.РемонтнаяРабота.НаименованиеДляПечати;
					КонецЕсли; 
					
					Если ПерваяРабота Тогда 
						ПерваяРемонтнаяРабота.Параметры.РемонтнаяРабота = НаименованиеРаботы;
						ПерваяРабота = Ложь;
						ТабДок.Вывести(ПерваяРемонтнаяРабота);
					Иначе
						РемонтнаяРабота.Параметры.РемонтнаяРабота = НаименованиеРаботы;
						ТабДок.Вывести(РемонтнаяРабота);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;	
			
			ШапкаТаблицыИсполнители = Макет.ПолучитьОбласть("ШапкаТаблицыИсполнители");
			ТабДок.Вывести(ШапкаТаблицыИсполнители);       	
			
			СтрокаТаблицыИсполнители = Макет.ПолучитьОбласть("СтрокаТаблицыИсполнители");
			
			ТЗ = ВыборкаДокументов.Ссылка.Исполнители.Выгрузить(, "Сотрудник,Квалификация");
			ТЗ.Свернуть("Сотрудник,Квалификация");
			ПП = 0;
			
			Для Каждого Стр Из ТЗ Цикл
				ПП = ПП+1;
				СтрокаТаблицыИсполнители.Параметры.Заполнить(Стр);
				СтрокаТаблицыИсполнители.Параметры.ПП = ПП;
				ТабДок.Вывести(СтрокаТаблицыИсполнители);
			КонецЦикла;
			
			Пункт5_10 = Макет.ПолучитьОбласть("Пункт5_10");
			ДатаНачала = ВыборкаРемонтов.ДатаНачала;
			ДатаОкончания = ВыборкаРемонтов.ДатаОкончания;
			
			Пункт5_10.Параметры.ВремяНачало	 =	Формат(ДатаНачала,"ДФ=чч:мм");
			Пункт5_10.Параметры.ДатаНачало     =  Формат(ДатаНачала,"ДФ=dd.MM.yyyy");
			Пункт5_10.Параметры.ВремяОкончание =  Формат(ДатаОкончания ,"ДФ=чч:мм");
			Пункт5_10.Параметры.ДатаОкончание  =  Формат(ДатаОкончания,"ДФ=dd.MM.yyyy");
			
			ТабДок.Вывести(Пункт5_10);
			Пункт11_12 = Макет.ПолучитьОбласть("Пункт11_12");
			ТабДок.Вывести(Пункт11_12);
			
		КонецЦикла;
	КонецЦикла;
	
	ТабДок.ТолькоПросмотр = Истина;
	Возврат ТабДок;	
	
КонецФункции

Функция ПечатьНарядДопускНаПроизводствоРаботНаВысоте(МассивОбъектов, ПараметрыПечати)
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "торо_НарядНаВыполнениеРемонтныхРабот";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_НарядДопускНаПроизводствоРаботНаВысоте");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка КАК Ссылка,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Номер КАК Номер,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Дата КАК Дата,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Организация КАК Организация,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Подразделение КАК Подразделение,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Ответственный КАК Ответственный,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID КАК ID,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ДатаНачала КАК ДатаНачала,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ДатаОкончания КАК ДатаОкончания,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОпаснаяРабота КАК ОпаснаяРабота,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.МестоПроведенияРабот КАК МестоПроведенияРабот
	|ИЗ
	|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтыОборудования КАК торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования
	|ГДЕ
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка В(&Ссылка)
	|	И торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID В(&ID)
	|ИТОГИ
	|	МАКСИМУМ(Номер),
	|	МАКСИМУМ(Дата),
	|	МАКСИМУМ(Организация),
	|	МАКСИМУМ(Подразделение),
	|	МАКСИМУМ(Ответственный)
	|ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	Если ПараметрыПечати.Свойство("МассивID") Тогда
		Запрос.УстановитьПараметр("ID", ПараметрыПечати.МассивID);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID В(&ID)", "");
	КонецЕсли;
	
	ВыборкаДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
	ЭтоПервый = Истина;
	
	Пока ВыборкаДокументов.Следующий() Цикл
		
		ВыборкаРемонтов = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока ВыборкаРемонтов.Следующий() Цикл
			
			Если НЕ ЭтоПервый Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ЭтоПервый = Ложь;
			
			Шапка = Макет.ПолучитьОбласть("Шапка");
			
			Шапка.Параметры.Номер = ВыборкаДокументов.Номер;
			Шапка.Параметры.Дата = ВыборкаДокументов.Дата;
			Шапка.Параметры.Организация = ВыборкаДокументов.Организация;
			Шапка.Параметры.Подразделение = ВыборкаДокументов.Подразделение;
			
			СписокТО = "";
			
			Для Каждого РемРаб Из ВыборкаДокументов.Ссылка.РемонтныеРаботы Цикл
				Если РемРаб.РемонтыОборудования_ID = ВыборкаРемонтов.ID
					И ТипЗнч(РемРаб.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
					
					Если РемРаб.РемонтнаяРабота.НаименованиеДляПечати = "" Тогда
					    НаименованиеРаботы = РемРаб.РемонтнаяРабота.Наименование;
					Иначе
					    НаименованиеРаботы = РемРаб.РемонтнаяРабота.НаименованиеДляПечати;
					КонецЕсли;

					СписокТО = СписокТО + НаименованиеРаботы + ", ";
				КонецЕсли;
			КонецЦикла;
			
			Шапка.Параметры.ТехОперации = Лев(СписокТО, СтрДлина(СписокТО) - 2);
			
			ТабДок.Вывести(Шапка);	
			
			ТабСотрудники = Макет.ПолучитьОбласть("СтрокаЗаполнения");
			
			МассивИсполнителей = Новый Массив;
			
			Для Каждого Сотрудник Из ВыборкаДокументов.Ссылка.Исполнители Цикл
				Если Сотрудник.РемонтыОборудования_ID = ВыборкаРемонтов.ID
					И МассивИсполнителей.Найти(Сотрудник.Сотрудник) = Неопределено Тогда
					МассивИсполнителей.Добавить(Сотрудник.Сотрудник);
				КонецЕсли;
			КонецЦикла;
			
			Для Каждого Сотрудник Из МассивИсполнителей Цикл
				ТабСотрудники.Параметры.ФИО = Сотрудник;
				ТабДок.Вывести(ТабСотрудники);
			КонецЦикла;
			
			ТабЧасть0 = Макет.ПолучитьОбласть("Часть0");
			
			СписокРабот = "";
			
			Для Каждого РемРаб Из ВыборкаДокументов.Ссылка.РемонтныеРаботы Цикл
				Если РемРаб.РемонтыОборудования_ID = ВыборкаРемонтов.ID
					И ТипЗнч(РемРаб.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
					СписокРабот = СписокРабот + РемРаб.РемонтнаяРабота.СодержаниеРабот + ", ";
				КонецЕсли;
			КонецЦикла;
			
			ТабЧасть0.Параметры.СодержаниеРаботТО = Лев(СписокРабот, СтрДлина(СписокРабот) - 2);
			
			ДатаНач = ВыборкаРемонтов.ДатаНачала;
			ДатаКон = ВыборкаРемонтов.ДатаОкончания;
			
			ТабЧасть0.Параметры.НачЧас		= Строка(Час(ДатаНач));
			ТабЧасть0.Параметры.НачМин		= Строка(Минута(ДатаНач));
			ТабЧасть0.Параметры.НачДень		= Строка(День(ДатаНач));
			// >> [Деснол] [Ушаков А.Д.] [26.09.2019] 
			ТабЧасть0.Параметры.НачМесяц	= НазваниеМесяцаСтрокой_РодительныйПадеж(ДатаНач);
			//ТабЧасть0.Параметры.НачМесяц	= НазваниеМесяцаСтрокойПадежное(Месяц(ДатаНач), "Род");
			// << [Деснол] [Ушаков А.Д.] [26.09.2019] 
			ТабЧасть0.Параметры.НачГод		= Строка(Год(ДатаНач));
			
			ТабЧасть0.Параметры.КонЧас		= Строка(Час(ДатаКон));
			ТабЧасть0.Параметры.КонМин		= Строка(Минута(ДатаКон));
			ТабЧасть0.Параметры.КонДень		= Строка(День(ДатаКон));
			// >> [Деснол] [Ушаков А.Д.] [26.09.2019] 
			ТабЧасть0.Параметры.КонМесяц	= НазваниеМесяцаСтрокой_РодительныйПадеж(ДатаКон);
			//ТабЧасть0.Параметры.КонМесяц	= НазваниеМесяцаСтрокойПадежное(Месяц(ДатаКон), "Род");
			// << [Деснол] [Ушаков А.Д.] [26.09.2019] 
			ТабЧасть0.Параметры.КонГод		= Строка(Год(ДатаКон));
			
			ТабДок.Вывести(ТабЧасть0);
			
			Для Сч = 1 По 11 Цикл
				ТабЧасть = Макет.ПолучитьОбласть("Часть" + Сч);
				ТабДок.Вывести(ТабЧасть);
			КонецЦикла;
			
		КонецЦикла;
	КонецЦикла;
	
	ТабДок.ТолькоПросмотр = Истина;
	
	Возврат ТабДок;
	
КонецФункции

Функция ПечатьНарядДопускДляРаботыВЭлектроустановках(МассивОбъектов, ПараметрыПечати)
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "торо_НарядНаВыполнениеРемонтныхРабот";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_НарядДопускДляРаботыВЭлектроустановках");

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка КАК Ссылка,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Номер КАК Номер,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Дата КАК Дата,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Организация КАК Организация,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Подразделение КАК Подразделение,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Ответственный КАК Ответственный,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID КАК ID,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ДатаНачала КАК ДатаНачала,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ДатаОкончания КАК ДатаОкончания,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОпаснаяРабота КАК ОпаснаяРабота,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.МестоПроведенияРабот КАК МестоПроведенияРабот
	|ИЗ
	|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтыОборудования КАК торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования
	|ГДЕ
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка В(&Ссылка)
	|	И торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID В(&ID)
	|ИТОГИ
	|	МАКСИМУМ(Номер),
	|	МАКСИМУМ(Дата),
	|	МАКСИМУМ(Организация),
	|	МАКСИМУМ(Подразделение),
	|	МАКСИМУМ(Ответственный)
	|ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	Если ПараметрыПечати.Свойство("МассивID") Тогда
		Запрос.УстановитьПараметр("ID", ПараметрыПечати.МассивID);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID В(&ID)", "");
	КонецЕсли;
	
	ВыборкаДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
	ЭтоПервый = Истина;
	
	Пока ВыборкаДокументов.Следующий() Цикл
		
		ВыборкаРемонтов = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока ВыборкаРемонтов.Следующий() Цикл
			
			Если НЕ ЭтоПервый Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ЭтоПервый = Ложь;
			
			Шапка = Макет.ПолучитьОбласть("ШапкаДокумента");
			Шапка.Параметры.Организация = ВыборкаДокументов.Организация;
			Шапка.Параметры.ПодразделениеОрганизации = ВыборкаДокументов.Подразделение;
			Шапка.Параметры.Дата = Формат(ВыборкаДокументов.Дата,"ДФ=dd.MM.yyyy");
			Шапка.Параметры.Номер = ВыборкаДокументов.Номер;
			ТабДок.Вывести(Шапка);
			
			ТЗ = ВыборкаДокументов.Ссылка.Исполнители.Выгрузить(, "Сотрудник, Квалификация");
			ТЗ.Свернуть("Сотрудник, Квалификация");
			
			ПервыйЧленБригады = Макет.ПолучитьОбласть("ПервыйЧленБригады");
			ЧленБригады       = Макет.ПолучитьОбласть("ЧленБригады");
			
			ЭтоПервыйСотрудник = Истина;
			
			Для Каждого Стр Из ТЗ Цикл
				
				Если ЭтоПервыйСотрудник Тогда 
					ПервыйЧленБригады.Параметры.СоставБригады = Стр.Сотрудник.Наименование + " (" + Стр.Квалификация + ")";
					
					ЭтоПервыйСотрудник = Ложь;
					ТабДок.Вывести(ПервыйЧленБригады);
				Иначе 
					
					ЧленБригады.Параметры.СоставБригады = Стр.Сотрудник.Наименование + " (" + Стр.Квалификация + ")";
					ТабДок.Вывести(ЧленБригады);
				КонецЕсли;
				
			КонецЦикла;
			
			ПерваяРемонтнаяРабота = Макет.ПолучитьОбласть("ПерваяРемонтнаяРабота");
			РемонтнаяРабота       = Макет.ПолучитьОбласть("РемонтнаяРабота");
			
			Отбор = Новый Структура;
			Отбор.Вставить("РемонтыОборудования_ID", ВыборкаРемонтов.ID);
			СтрокиТекущегоОтбора = ВыборкаДокументов.Ссылка.РемонтныеРаботы.НайтиСтроки(Отбор);		
			
			ПерваяРабота = Истина;
			Для Каждого СтрокаОтбора Из СтрокиТекущегоОтбора Цикл
				Если ТипЗнч(СтрокаОтбора.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
					Если СтрокаОтбора.РемонтнаяРабота.НаименованиеДляПечати = "" Тогда
					    НаименованиеРаботы = СтрокаОтбора.РемонтнаяРабота.Наименование;
					Иначе
					    НаименованиеРаботы = СтрокаОтбора.РемонтнаяРабота.НаименованиеДляПечати;
					КонецЕсли;
					
					Если ПерваяРабота Тогда 
						ПерваяРемонтнаяРабота.Параметры.РемонтнаяРабота = НаименованиеРаботы;
						ПерваяРабота = Ложь;
						ТабДок.Вывести(ПерваяРемонтнаяРабота);
					Иначе
						РемонтнаяРабота.Параметры.РемонтнаяРабота = НаименованиеРаботы;
						ТабДок.Вывести(РемонтнаяРабота);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;	
			
			Часть0 = Макет.ПолучитьОбласть("Часть0");
			ДатаНачала = ВыборкаРемонтов.ДатаНачала;
			ДатаОкончания = ВыборкаРемонтов.ДатаОкончания;
			Часть0.Параметры.ВремяНачало	=  Формат(ДатаНачала,"ДЛФ=T");
			Часть0.Параметры.ДатаНачало     =  Формат(ДатаНачала,"ДФ=dd.MM.yyyy");
			Часть0.Параметры.ВремяОкончание =  Формат(ДатаОкончания ,"ДЛФ=T");
			Часть0.Параметры.ДатаОкончание  =  Формат(ДатаОкончания,"ДФ=dd.MM.yyyy");
			ТабДок.Вывести(Часть0);
			
			Часть1 = Макет.ПолучитьОбласть("Часть1");
			ТабДок.Вывести(Часть1);
			
			Часть2 = Макет.ПолучитьОбласть("Часть2");
			ТабДок.Вывести(Часть2);
			
			Часть3 = Макет.ПолучитьОбласть("Часть3");
			ТабДок.Вывести(Часть3);
			
		КонецЦикла;
	КонецЦикла;
	
	ТабДок.ТолькоПросмотр = Истина;
	Возврат ТабДок;
	
КонецФункции
	
Функция ПечатьНарядНаПроизводствоРаботПовышеннойОпасности(МассивОбъектов, ПараметрыПечати)
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "торо_НарядНаВыполнениеРемонтныхРабот";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_НарядНаПроизводствоРаботПовышеннойОпасности");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка КАК Ссылка,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Номер КАК Номер,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Дата КАК Дата,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Организация КАК Организация,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Подразделение КАК Подразделение,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Ответственный КАК Ответственный,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID КАК ID,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ДатаНачала КАК ДатаНачала,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ДатаОкончания КАК ДатаОкончания,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОпаснаяРабота КАК ОпаснаяРабота,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.МестоПроведенияРабот КАК МестоПроведенияРабот
	|ИЗ
	|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтыОборудования КАК торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования
	|ГДЕ
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка В(&Ссылка)
	|	И торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID В(&ID)
	|ИТОГИ
	|	МАКСИМУМ(Номер),
	|	МАКСИМУМ(Дата),
	|	МАКСИМУМ(Организация),
	|	МАКСИМУМ(Подразделение),
	|	МАКСИМУМ(Ответственный)
	|ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	Если ПараметрыПечати.Свойство("МассивID") Тогда
		Запрос.УстановитьПараметр("ID", ПараметрыПечати.МассивID);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID В(&ID)", "");
	КонецЕсли;
	
	ВыборкаДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
	ЭтоПервый = Истина;
	
	Пока ВыборкаДокументов.Следующий() Цикл
		
		ВыборкаРемонтов = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока ВыборкаРемонтов.Следующий() Цикл
			
			Если НЕ ЭтоПервый Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ЭтоПервый = Ложь;
			
			Шапка = Макет.ПолучитьОбласть("ШапкаДокумента");
			Шапка.Параметры.Организация = ВыборкаДокументов.Организация;
			Шапка.Параметры.ПодразделениеОрганизации = ВыборкаДокументов.Подразделение;
			
			Шапка.Параметры.Дата = Формат(ВыборкаДокументов.Дата,"ДФ=dd.MM.yyyy");
			Шапка.Параметры.Номер = ВыборкаДокументов.Номер;
			ТабДок.Вывести(Шапка);
			
			ПерваяРемонтнаяРабота = Макет.ПолучитьОбласть("ПерваяРемонтнаяРабота");
			РемонтнаяРабота       = Макет.ПолучитьОбласть("РемонтнаяРабота");
			
			Отбор = Новый Структура;
			Отбор.Вставить("РемонтыОборудования_ID", ВыборкаРемонтов.ID);
			СтрокиТекущегоОтбора = ВыборкаДокументов.Ссылка.РемонтныеРаботы.НайтиСтроки(Отбор);
			
			ПерваяРабота = Истина;
			Для Каждого СтрокаОтбора Из СтрокиТекущегоОтбора Цикл
				Если ТипЗнч(СтрокаОтбора.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
					Если СтрокаОтбора.РемонтнаяРабота.НаименованиеДляПечати = "" Тогда
					    НаименованиеРаботы = СтрокаОтбора.РемонтнаяРабота.Наименование;
					Иначе
					    НаименованиеРаботы = СтрокаОтбора.РемонтнаяРабота.НаименованиеДляПечати;
					КонецЕсли;
					
					Если ПерваяРабота Тогда 
						ПерваяРемонтнаяРабота.Параметры.РемонтнаяРабота = НаименованиеРаботы;
						ПерваяРабота = Ложь;
						ТабДок.Вывести(ПерваяРемонтнаяРабота);
					Иначе
						РемонтнаяРабота.Параметры.РемонтнаяРабота = НаименованиеРаботы;
						ТабДок.Вывести(РемонтнаяРабота);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;	
			
			Пункт3_4 = Макет.ПолучитьОбласть("Пункт3_4");
			
			ДатаНачала = ВыборкаРемонтов.ДатаНачала;
			ДатаОкончания = ВыборкаРемонтов.ДатаОкончания;
			
			Пункт3_4.Параметры.ЧасНачало	 =	Формат(ДатаНачала,"ДФ=HH");
			Пункт3_4.Параметры.МинутаНачало     =  Формат(ДатаНачала,"ДФ=мм");
			Пункт3_4.Параметры.ДатаНачало     =  Формат(ДатаНачала,"ДФ=dd.MM.yyyy");
			
			Пункт3_4.Параметры.ЧасОкончание	 =	Формат(ДатаОкончания,"ДФ=HH");
			Пункт3_4.Параметры.МинутаОкончание     =  Формат(ДатаОкончания,"ДФ=мм");
			Пункт3_4.Параметры.ДатаОкончание    =  Формат(ДатаОкончания,"ДФ=dd.MM.yyyy");
			
			ТабДок.Вывести(Пункт3_4);
			
			
			Пункт5_6 = Макет.ПолучитьОбласть("Пункт5_6");
			
			ТабДок.Вывести(Пункт5_6);
			
			СтрокаТаблицыИсполнители = Макет.ПолучитьОбласть("СтрокаТаблицыИсполнители");
			
			ТЗ = ВыборкаДокументов.Ссылка.Исполнители.Выгрузить(, "Сотрудник,Квалификация");
			ТЗ.Свернуть("Сотрудник,Квалификация");
			ПП = 0;
			
			Для Каждого Стр Из ТЗ Цикл
				ПП = ПП+1;
				СтрокаТаблицыИсполнители.Параметры.Заполнить(Стр);
				СтрокаТаблицыИсполнители.Параметры.ПП = ПП;
				ТабДок.Вывести(СтрокаТаблицыИсполнители);
			КонецЦикла;
			
			Пункт7_11 = Макет.ПолучитьОбласть("Пункт7_11");
			ТабДок.Вывести(Пункт7_11);
			
		КонецЦикла;
	КонецЦикла;
	
	ТабДок.ТолькоПросмотр = Истина;
	Возврат ТабДок;
	
КонецФункции

Функция НарядНаРаботы_НеОпасные(МассивОбъектов, ПараметрыПечати, ИмяПФ = "")
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "торо_НарядНаВыполнениеРемонтныхРабот";
	ТабДок.ТолькоПросмотр = Истина;
	
	Если ИмяПФ = "НарядНаРаботы_сПоказателями" Тогда 
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_НарядНаРаботы_сПоказателями");
	Иначе 
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_НарядНаРаботы_НеОпасные");
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка КАК Ссылка,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Номер КАК Номер,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Дата КАК Дата,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Организация КАК Организация,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Подразделение КАК Подразделение,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Ответственный КАК Ответственный,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID КАК ID,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОбъектРемонта.Наименование КАК Наименование,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОбъектРемонта.АдресМестонахождения КАК АдресМестонахождения,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ДатаНачала КАК ДатаНачала,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ДатаОкончания КАК ДатаОкончания,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОпаснаяРабота КАК ОпаснаяРабота,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.МестоПроведенияРабот КАК МестоПроведенияРабот,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ДокументИсточник КАК ДокументИсточник
	|ИЗ
	|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтыОборудования КАК торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования
	|ГДЕ
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка В(&Ссылка)
	|	И торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID В(&ID)
	|ИТОГИ
	|	МАКСИМУМ(Номер),
	|	МАКСИМУМ(Дата),
	|	МАКСИМУМ(Организация),
	|	МАКСИМУМ(Подразделение),
	|	МАКСИМУМ(Ответственный)
	|ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	Если ПараметрыПечати.Свойство("МассивID") Тогда
		Запрос.УстановитьПараметр("ID", ПараметрыПечати.МассивID);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID В(&ID)", "");
	КонецЕсли;
	
	ВыборкаДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
	ЭтоПервый = Истина;
	
	Пока ВыборкаДокументов.Следующий() Цикл
		
		ВыборкаРемонтов = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока ВыборкаРемонтов.Следующий() Цикл
			
			Если НЕ ЭтоПервый Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ЭтоПервый = Ложь;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВЫБОР
			|		КОГДА тчРемонтныеРаботы.РемонтнаяРабота ССЫЛКА Справочник.торо_ТехнологическиеОперации
			|			ТОГДА ВЫБОР
			|					КОГДА тчРемонтныеРаботы.РемонтнаяРабота.НаименованиеДляПечати = """"
			|						ТОГДА тчРемонтныеРаботы.РемонтнаяРабота.Наименование
			|					ИНАЧЕ тчРемонтныеРаботы.РемонтнаяРабота.НаименованиеДляПечати
			|				  КОНЕЦ
			|		ИНАЧЕ тчРемонтныеРаботы.РемонтнаяРабота.Наименование
			|	КОНЕЦ КАК РемонтнаяРаботаДляПечати,
			|	тчРемонтныеРаботы.РемонтнаяРабота КАК РемонтнаяРабота,
			|	ЕСТЬNULL(тчРемонтныеРаботы.РемонтнаяРабота.СодержаниеРабот, """") КАК СодержаниеРабот,
			|	тчРемонтныеРаботы.Родитель_ID КАК Родитель_ID,
			|	тчРемонтныеРаботы.ID КАК ID,
			|	торо_ТехнологическиеОперации.БазоваяЕдиницаИзмерения КАК ЕдИзм,
			|	тчРемонтныеРаботы.Количество КАК Количество
			|ИЗ
			|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтныеРаботы КАК тчРемонтныеРаботы
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ТехнологическиеОперации КАК торо_ТехнологическиеОперации
			|		ПО тчРемонтныеРаботы.РемонтнаяРабота = торо_ТехнологическиеОперации.Ссылка
			|ГДЕ
			|	тчРемонтныеРаботы.Ссылка = &Ссылка
			|	И тчРемонтныеРаботы.РемонтыОборудования_ID = &ID
			|
			|УПОРЯДОЧИТЬ ПО
			|	Родитель_ID
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Исполнители.Сотрудник КАК Сотрудник,
			|	Исполнители.Квалификация КАК Квалификация
			|ИЗ
			|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.Исполнители КАК Исполнители
			|ГДЕ
			|	Исполнители.Ссылка = &Ссылка
			|	И Исполнители.РемонтыОборудования_ID = &ID
			|
			|СГРУППИРОВАТЬ ПО
			|	Исполнители.Сотрудник,
			|	Исполнители.Квалификация";				   
			
			Запрос.УстановитьПараметр("Ссылка", ВыборкаДокументов.Ссылка);
			Запрос.УстановитьПараметр("Дата", ВыборкаДокументов.Дата);
			Запрос.УстановитьПараметр("ID", ВыборкаРемонтов.ID);
			РезЗапроса = Запрос.ВыполнитьПакет();
			
			тчРемРаботы = РезЗапроса[0].выгрузить();
			тчСотрудникиИКвалификация = РезЗапроса[1].выбрать();
			
			обШапка = Макет.ПолучитьОбласть("Шапка");
			
			обШапка.Параметры.Организация = ВыборкаДокументов.Организация;
			обШапка.Параметры.Подразделение = ВыборкаДокументов.Подразделение;
			
			обШапка.Параметры.ДатаОткрытия = Формат(ВыборкаДокументов.Дата,"ДФ=dd.MM.yyyy");
			обШапка.Параметры.Номер = ВыборкаДокументов.Номер;
			
			обШапка.Параметры.ДатаНачала = Формат(ВыборкаРемонтов.ДатаНачала,"ДФ=dd.MM.yyyy");
			обШапка.Параметры.ДатаОкончания = Формат(ВыборкаРемонтов.ДатаОкончания,"ДФ=dd.MM.yyyy");
			
			ПерваяСтрока = Истина;
			массивПроверки = Новый Массив;
			Пока тчСотрудникиИКвалификация.Следующий() Цикл
				Если перваяСтрока Тогда
					ПерваяСтрока = Ложь;
					обШапка.Параметры.СотрудникИКвалификация = Строка(тчСотрудникиИКвалификация.Сотрудник) + " (" + тчСотрудникиИКвалификация.Квалификация + ")";
					обШапка.Параметры.Сотрудник = тчСотрудникиИКвалификация.Сотрудник;
					ТабДок.Вывести(обШапка);
					Продолжить;
				КонецЕсли;
				
				обСотрудник = Макет.ПолучитьОбласть("Сотрудник");
				обСотрудник.Параметры.СотрудникИКвалификация = Строка(тчСотрудникиИКвалификация.Сотрудник) + " (" + тчСотрудникиИКвалификация.Квалификация + ")";
				обСотрудник.Параметры.Сотрудник = тчСотрудникиИКвалификация.Сотрудник;
				
				ПроверитьИВывести(ТабДок, обСотрудник);
				
			КонецЦикла;
			
			Если ПерваяСтрока Тогда
				ТабДок.Вывести(обШапка);
			КонецЕсли;
			
			ВывестиРемонты(Макет, ТабДок, тчРемРаботы, ВыборкаРемонтов, ИмяПФ);

			обОтветственный = Макет.ПолучитьОбласть("Ответственный");
			обОтветственный.Параметры.Сотрудник = ВыборкаДокументов.Ответственный;
			обОтветственный.Параметры.Дата = Формат(ТекущаяДата(),"ДФ='''""''dd''""'' MMMM yyyy ""г.""'");
			ПроверитьИВывести(ТабДок, обОтветственный);
			
			ПерваяСтрока = Истина;
			обИсполнительСЗаголовоком = Макет.ПолучитьОбласть("ИсполнительСЗаголовоком");
			
			тчСотрудникиИКвалификация.Сбросить();
			Пока тчСотрудникиИКвалификация.Следующий() Цикл
				Если ПерваяСтрока Тогда
					ПерваяСтрока = Ложь;
					обИсполнительСЗаголовоком.Параметры.Сотрудник = тчСотрудникиИКвалификация.Сотрудник;
					обИсполнительСЗаголовоком.Параметры.Дата = Формат(ТекущаяДата(),"ДФ='''""''dd''""'' MMMM yyyy ""г.""'");
					ПроверитьИВывести(ТабДок, обИсполнительСЗаголовоком);
					Продолжить;
				КонецЕсли;
				
				обИсполнитель = Макет.ПолучитьОбласть("Исполнитель");
				обИсполнитель.Параметры.Сотрудник = тчСотрудникиИКвалификация.Сотрудник;
				обИсполнитель.Параметры.дата = Формат(ТекущаяДата(),"ДФ='''""''dd''""'' MMMM yyyy ""г.""'");
				ПроверитьИВывести(ТабДок, обИсполнитель);
			КонецЦикла;
			
			Если ПерваяСтрока Тогда
				ПроверитьИВывести(ТабДок, обИсполнительСЗаголовоком);
			КонецЕсли;
						
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

Функция НарядНаРаботы_ОднимДокументом (МассивОбъектов, ПараметрыПечати)
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "торо_НарядНаВыполнениеРемонтныхРабот";
	ТабДок.ТолькоПросмотр = Истина;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_НарядНаРаботы_ОднимДокументом");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка КАК Ссылка,
	               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Номер КАК Номер,
	               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Дата КАК Дата,
	               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Организация КАК Организация,
	               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Подразделение КАК Подразделение,
	               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Ответственный КАК Ответственный,
	               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID КАК ID,
	               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта,
	               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОбъектРемонта.Наименование КАК Наименование,
	               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОбъектРемонта.АдресМестонахождения КАК АдресМестонахождения,
	               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ДатаНачала КАК ДатаНачала,
	               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ДатаОкончания КАК ДатаОкончания,
	               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОпаснаяРабота КАК ОпаснаяРабота,
	               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.МестоПроведенияРабот КАК МестоПроведенияРабот,
				   |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ДокументИсточник КАК ДокументИсточник
	               |ИЗ
	               |	Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтыОборудования КАК торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования
	               |ГДЕ
	               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка В(&Ссылка)
				   |	И торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID В(&ID)
	               |ИТОГИ
	               |	МАКСИМУМ(Номер),
	               |	МАКСИМУМ(Дата),
	               |	МАКСИМУМ(Организация),
	               |	МАКСИМУМ(Подразделение),
	               |	МАКСИМУМ(Ответственный)
	               |ПО
	               |	Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	Если ПараметрыПечати.Свойство("МассивID") Тогда
		Запрос.УстановитьПараметр("ID", ПараметрыПечати.МассивID);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID В(&ID)", "");
	КонецЕсли;
	
	ВыборкаДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
	
	Пока ВыборкаДокументов.Следующий() Цикл
		
		обШапка = Макет.ПолучитьОбласть("Шапка");
		
		обШапка.Параметры.Организация = ВыборкаДокументов.Организация;
		обШапка.Параметры.Подразделение = ВыборкаДокументов.Подразделение;
		
		обШапка.Параметры.ДатаОткрытия = Формат(ВыборкаДокументов.Дата,"ДФ=dd.MM.yyyy");
		обШапка.Параметры.Номер = ВыборкаДокументов.Номер;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	Исполнители.Сотрудник КАК Сотрудник,
		               |	Исполнители.Квалификация КАК Квалификация
		               |ИЗ
		               |	Документ.торо_НарядНаВыполнениеРемонтныхРабот.Исполнители КАК Исполнители
		               |ГДЕ
		               |	Исполнители.Ссылка = &Ссылка
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	Исполнители.Сотрудник,
		               |	Исполнители.Квалификация";
		
		Запрос.УстановитьПараметр("Ссылка", ВыборкаДокументов.Ссылка);
		Результат = Запрос.Выполнить();
		тчСотрудникиИКвалификация = Результат.Выбрать();
		
		ПерваяСтрока = Истина;
		Пока тчСотрудникиИКвалификация.Следующий() Цикл
			Если ПерваяСтрока Тогда
				ПерваяСтрока = Ложь;
				обШапка.Параметры.СотрудникИКвалификация = Строка(тчСотрудникиИКвалификация.Сотрудник) + " (" + тчСотрудникиИКвалификация.Квалификация + ")";
				обШапка.Параметры.Сотрудник = тчСотрудникиИКвалификация.Сотрудник;
				ТабДок.Вывести(обШапка);
				Продолжить;
			КонецЕсли;
			
			обСотрудник = Макет.ПолучитьОбласть("Сотрудник");
			обСотрудник.Параметры.СотрудникИКвалификация = Строка(тчСотрудникиИКвалификация.Сотрудник) + " (" + тчСотрудникиИКвалификация.Квалификация + ")";
			обСотрудник.Параметры.Сотрудник = тчСотрудникиИКвалификация.Сотрудник;
			
			ПроверитьИВывести(ТабДок, обСотрудник);
			
		КонецЦикла;
		
		Если ПерваяСтрока Тогда
			ТабДок.Вывести(обШапка);
		КонецЕсли;
		
		ВыборкаРемонтов = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока ВыборкаРемонтов.Следующий() Цикл
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
							|	ВЫБОР
							|		КОГДА тчРемонтныеРаботы.РемонтнаяРабота ССЫЛКА Справочник.торо_ТехнологическиеОперации
							|			ТОГДА ВЫБОР
							|					КОГДА тчРемонтныеРаботы.РемонтнаяРабота.НаименованиеДляПечати = """"
							|						ТОГДА тчРемонтныеРаботы.РемонтнаяРабота.Наименование
							|					ИНАЧЕ тчРемонтныеРаботы.РемонтнаяРабота.НаименованиеДляПечати
							|				  КОНЕЦ
							|		ИНАЧЕ тчРемонтныеРаботы.РемонтнаяРабота.Наименование
							|	КОНЕЦ КАК РемонтнаяРаботаДляПечати,
							|	тчРемонтныеРаботы.РемонтнаяРабота КАК РемонтнаяРабота,
							|	ЕСТЬNULL(тчРемонтныеРаботы.РемонтнаяРабота.СодержаниеРабот, """") КАК СодержаниеРабот,
							|	тчРемонтныеРаботы.Родитель_ID КАК Родитель_ID,
							|	тчРемонтныеРаботы.ID КАК ID,
							|	торо_ТехнологическиеОперации.БазоваяЕдиницаИзмерения КАК ЕдИзм,
							|	тчРемонтныеРаботы.Количество КАК Количество
							|ИЗ
							|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтныеРаботы КАК тчРемонтныеРаботы
							|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ТехнологическиеОперации КАК торо_ТехнологическиеОперации
							|		ПО тчРемонтныеРаботы.РемонтнаяРабота = торо_ТехнологическиеОперации.Ссылка
							|ГДЕ
							|	тчРемонтныеРаботы.Ссылка = &Ссылка
							|	И тчРемонтныеРаботы.РемонтыОборудования_ID = &ID
							|
							|УПОРЯДОЧИТЬ ПО
							|	Родитель_ID";				   
			
			Запрос.УстановитьПараметр("Ссылка", ВыборкаДокументов.Ссылка);
			Запрос.УстановитьПараметр("Дата", ВыборкаДокументов.Дата);
			Запрос.УстановитьПараметр("ID", ВыборкаРемонтов.ID);
			Результат = Запрос.Выполнить();
			
			тчРемРаботы = Результат.Выгрузить();
			
			ВывестиРемонты(Макет, ТабДок, тчРемРаботы, ВыборкаРемонтов, "НарядНаРаботы_ОднимДокументом");
			
		КонецЦикла;
		
		обОтветственный = Макет.ПолучитьОбласть("Ответственный");
		обОтветственный.Параметры.Сотрудник = ВыборкаДокументов.Ответственный;
		обОтветственный.Параметры.Дата = Формат(ТекущаяДата(),"ДФ='''""''dd''""'' MMMM yyyy ""г.""'");
		ПроверитьИВывести(ТабДок, обОтветственный);
		
		ПерваяСтрока = Истина;
		обИсполнительСЗаголовоком = Макет.ПолучитьОбласть("ИсполнительСЗаголовоком");
		
		тчСотрудникиИКвалификация.Сбросить();
		Пока тчСотрудникиИКвалификация.Следующий() Цикл
			Если ПерваяСтрока Тогда
				ПерваяСтрока = Ложь;
				обИсполнительСЗаголовоком.Параметры.Сотрудник = тчСотрудникиИКвалификация.Сотрудник;
				обИсполнительСЗаголовоком.Параметры.Дата = Формат(ТекущаяДата(),"ДФ='''""''dd''""'' MMMM yyyy ""г.""'");
				ПроверитьИВывести(ТабДок, обИсполнительСЗаголовоком);
				Продолжить;
			КонецЕсли;
			
			обИсполнитель = Макет.ПолучитьОбласть("Исполнитель");
			обИсполнитель.Параметры.Сотрудник = тчСотрудникиИКвалификация.Сотрудник;
			обИсполнитель.Параметры.дата = Формат(ТекущаяДата(),"ДФ='''""''dd''""'' MMMM yyyy ""г.""'");
			ПроверитьИВывести(ТабДок, обИсполнитель);
		КонецЦикла;
		
		Если ПерваяСтрока Тогда
			ПроверитьИВывести(ТабДок, обИсполнительСЗаголовоком);
		КонецЕсли;
		
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();

	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

Процедура ВывестиРемонты(Макет, ТабДок, тчРемРаботы, ВыборкаРемонтов, ИмяПФ = "")
	
	НайС = тчРемРаботы.НайтиСтроки(Новый Структура("Родитель_ID", ""));
	Дерево = Новый ДеревоЗначений;
	Дерево.Колонки.Добавить("РемонтнаяРабота");
	Дерево.Колонки.Добавить("РемонтыОборудования_ID");
	Дерево.Колонки.Добавить("ID");
	Дерево.Колонки.Добавить("Количество");
	
	НужноПолучитьНормыЗапчастей = Истина;
	
	// Затраты из сметы
	СтруктураЗатратИзСметы = Новый Структура("РемонтныеРаботыИзСметы, СтруктураТаблиц", Новый Массив, Новый Структура);
	Если ТипЗнч(ВыборкаРемонтов.ДокументИсточник) = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") Тогда
	    СтруктураЗатратИзСметы = ПолучитьНормыЗатратИзСметы(тчРемРаботы, ВыборкаРемонтов, ВыборкаРемонтов.ДокументИсточник);
		НужноПолучитьНормыЗапчастей = Ложь;
	КонецЕсли;
	
	РемонтныеРаботыИзСметы = СтруктураЗатратИзСметы.РемонтныеРаботыИзСметы;
	
	Для каждого текСтрока Из НайС Цикл
		Если Не РемонтныеРаботыИзСметы.Найти(текСтрока.ID) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		нс = Дерево.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(нс, текСтрока);
		СобратьДерево(нс, тчРемРаботы, РемонтныеРаботыИзСметы);
	КонецЦикла;
	
	// Затраты из нормативов
	стрЗатрат = торо_Ремонты.ПолучитьНормыЗатратИзВетвиДереваОпераций(Дерево,,, ВыборкаРемонтов.ДатаНачала, ВыборкаРемонтов.ДатаОкончания);
	
	тчМатЗатраты = Новый ТаблицаЗначений;
	тчМатЗатраты.Колонки.Добавить("Наименование");
	тчМатЗатраты.Колонки.Добавить("Характеристика");
	тчМатЗатраты.Колонки.Добавить("ЕдИзм");
	тчМатЗатраты.Колонки.Добавить("Количество");
	
	тчИнструменты = Новый ТаблицаЗначений;
	тчИнструменты.Колонки.Добавить("Наименование");
	тчИнструменты.Колонки.Добавить("ЕдИзм");
	тчИнструменты.Колонки.Добавить("Количество");
	
	Для каждого текСтрока Из СтрЗатрат Цикл
		МатЗатраты = текСтрока.СтруктураТаблиц.МатериальныеЗатраты;
		Инструменты = текСтрока.СтруктураТаблиц.ИнструментыИТехника;
		
		Для каждого текСтрокаТЧ Из МатЗатраты Цикл
			нс = тчМатЗатраты.Добавить();
			нс.Наименование = текСтрокаТЧ.Номенклатура;
			нс.Характеристика = текСтрокаТЧ.Характеристика; 
			нс.ЕдИзм = текСтрокаТЧ.Номенклатура.ЕдиницаИзмерения;
			нс.Количество = текСтрокаТЧ.Количество;
		КонецЦикла;
		
		Для каждого текСтрокаТЧ Из Инструменты Цикл
			нс = тчИнструменты.Добавить();
			нс.Наименование = текСтрокаТЧ.Инструмент;
			нс.ЕдИзм = текСтрокаТЧ.Инструмент.ЕдиницаИзмерения;
			нс.Количество = текСтрокаТЧ.Количество;
		КонецЦикла;
	КонецЦикла;
	
	Если СтруктураЗатратИзСметы.СтруктураТаблиц.Количество() > 0 Тогда
		МатериальныеЗатраты = СтруктураЗатратИзСметы.СтруктураТаблиц.МатериальныеЗатраты;
		Инструменты = СтруктураЗатратИзСметы.СтруктураТаблиц.ИнструментыИТехника;
		
		Для каждого СтрокаЗатрат Из МатериальныеЗатраты Цикл
			НоваяСтрокаЗатрат = тчМатЗатраты.Добавить();
			НоваяСтрокаЗатрат.Наименование = СтрокаЗатрат.Номенклатура;
			НоваяСтрокаЗатрат.Характеристика = СтрокаЗатрат.ХарактеристикаНоменклатуры; 
			НоваяСтрокаЗатрат.ЕдИзм = СтрокаЗатрат.ЕдиницаИзмерения;
			НоваяСтрокаЗатрат.Количество = СтрокаЗатрат.Количество;
		КонецЦикла;
		
		Для каждого СтрокаИнструментов Из Инструменты Цикл
			НоваяСтрокаИнструментов = тчИнструменты.Добавить();
			НоваяСтрокаИнструментов.Наименование = СтрокаИнструментов.Инструмент;
			НоваяСтрокаИнструментов.ЕдИзм = СтрокаИнструментов.ЕдиницаИзмерения;
			НоваяСтрокаИнструментов.Количество = СтрокаИнструментов.Количество;
		КонецЦикла;
	КонецЕсли;
	
	// Если наряд не на основании сметы, то запчасти нужно брать из ОР
	Если НужноПолучитьНормыЗапчастей Тогда
	    НормыЗапчастей = ПолучитьНормыЗапчастей(ВыборкаРемонтов.ОбъектРемонта, ВыборкаРемонтов.ВидРемонтныхРабот);
		Для каждого СтрокаЗапчасти Из НормыЗапчастей Цикл
		    НоваяСтрокаЗатрат = тчМатЗатраты.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаЗатрат, СтрокаЗапчасти);
		КонецЦикла; 
	КонецЕсли;
	
	тчМатЗатраты.Свернуть("Наименование, Характеристика, ЕдИзм", "Количество");
	тчИнструменты.Свернуть("Наименование, ЕдИзм", "Количество");
	
	обОписаниеОР = Макет.ПолучитьОбласть("ОписаниеОР");
	Если ИмяПФ = "НарядНаРаботы_ОднимДокументом" Тогда 
		обОписаниеОР.Параметры.ДатаНачала = Формат(ВыборкаРемонтов.ДатаНачала,"ДФ=dd.MM.yyyy");
		обОписаниеОР.Параметры.ДатаОкончания = Формат(ВыборкаРемонтов.ДатаОкончания,"ДФ=dd.MM.yyyy");
	КонецЕсли;
	обОписаниеОР.Параметры.ОР = торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(ВыборкаРемонтов.ОбъектРемонта);
	обОписаниеОР.Параметры.Местонахождение = ВыборкаРемонтов.АдресМестонахождения;
	обОписаниеОР.Параметры.Описание = ВыборкаРемонтов.ВидРемонтныхРабот;
	ПроверитьИВывести(ТабДок, обОписаниеОР);
	
	обШапкаТЧСостав = Макет.ПолучитьОбласть("ШапкаТЧСостав");
	ПроверитьИВывести(ТабДок, обШапкаТЧСостав);
	
	СтрокиВКорне = тчРемРаботы.НайтиСтроки(Новый структура("Родитель_ID", ""));
	ВывестиРекурсивно(Макет, тчРемРаботы, СтрокиВКорне, ТабДок, "СтрокаТЧСостав", "");
	
	
	ИспользоватьХарактеристики = Константы.торо_ИспользоватьХарактеристикиНоменклатуры.Получить();
	Если ИспользоватьХарактеристики Тогда 
		обШапкаТЧМатериалы = Макет.ПолучитьОбласть("ШапкаТЧМатериалыФО");
		обСтрокаТЧМатериалы = Макет.ПолучитьОбласть("СтрокаТЧМатериалыФО");
	Иначе 
		обШапкаТЧМатериалы = Макет.ПолучитьОбласть("ШапкаТЧМатериалы");
		обСтрокаТЧМатериалы = Макет.ПолучитьОбласть("СтрокаТЧМатериалы");
	КонецЕсли;
	ПроверитьИВывести(ТабДок, обШапкаТЧМатериалы);
	
	номерПП = 1;
	Для каждого текСтрока из тчМатЗатраты Цикл
		обСтрокаТЧМатериалы.Параметры.Ном = НомерПП;
		обСтрокаТЧМатериалы.Параметры.Наименование = текСтрока.Наименование;
		Если ИспользоватьХарактеристики Тогда
			обСтрокаТЧМатериалы.Параметры.Характеристика = текСтрока.Характеристика;
		КонецЕсли; 
		обСтрокаТЧМатериалы.Параметры.ЕдИзм = текСтрока.ЕдИзм;
		обСтрокаТЧМатериалы.Параметры.Количество = текСтрока.Количество;
		
		НомерПП = НомерПП + 1;
		ПроверитьИВывести(ТабДок, обСтрокаТЧМатериалы);
	КонецЦикла;
	
	обШапкаТЧИнструменты = Макет.ПолучитьОбласть("ШапкаТЧИнструменты");
	ПроверитьИВывести(ТабДок, обШапкаТЧИнструменты);
	
	НомерПП = 1;
	Для каждого ТекСтрока Из тчИнструменты Цикл 
		обСтрокаТЧИнструменты = Макет.ПолучитьОбласть("СтрокаТЧИнструменты");
		обСтрокаТЧИнструменты.Параметры.Ном = НомерПП;
		обСтрокаТЧИнструменты.Параметры.Наименование = ТекСтрока.Наименование;
		обСтрокаТЧИнструменты.Параметры.ЕдИзм = ТекСтрока.ЕдИзм;
		обСтрокаТЧИнструменты.Параметры.Количество = ТекСтрока.Количество;
		
		НомерПП = НомерПП + 1;
		ПроверитьИВывести(ТабДок, обСтрокаТЧИнструменты);
	КонецЦикла;
	
	КонтрПоказатели = ПланыВидовХарактеристик.торо_ИзмеряемыеПоказателиОбъектовРемонта.ПолучитьСтруктуруИзмеряемыхПоказателейОбъектовРемонта(ВыборкаРемонтов.ОбъектРемонта);
	Если ИмяПФ = "НарядНаРаботы_сПоказателями" И КонтрПоказатели.Количество() > 0 Тогда 
		обШапкаТЧПоказатели = Макет.ПолучитьОбласть("ШапкаТЧПоказатели");
		ПроверитьИВывести(ТабДок, обШапкаТЧПоказатели);
		
		НомерПП = 1;
		Для каждого Строка Из КонтрПоказатели Цикл 
			Если НЕ Строка.Удален Тогда 
				обСтрокаТЧПоказатели = Макет.ПолучитьОбласть("СтрокаТЧПокзатели");
				обСтрокаТЧПоказатели.Параметры.Ном = НомерПП;
				обСтрокаТЧПоказатели.Параметры.Показатель = Строка.Показатель;
				
				НомерПП = НомерПП + 1;
				ПроверитьИВывести(ТабДок, обСтрокаТЧПоказатели);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиРекурсивно(Макет, ТЧ, Мас, ТабДок, ИмяОбластиВМакете, НомерРодителя)
	
	НомерСтроки = 1;
	Для каждого текСтрока из Мас Цикл
		НомерСтрокой = НомерРодителя + Строка(НомерСтроки);
		
		обСтрокаТЧСостав = Макет.ПолучитьОбласть(ИмяОбластиВМакете);
		обСтрокаТЧСостав.Параметры.Ном = НомерСтрокой;
		обСтрокаТЧСостав.Параметры.Наименование = текСтрока.РемонтнаяРаботаДляПечати;
		обСтрокаТЧСостав.Параметры.СодержаниеРабот = текСтрока.СодержаниеРабот;
		обСтрокаТЧСостав.Параметры.Количество = текСтрока.Количество;
		обСтрокаТЧСостав.Параметры.ЕдИзм = текСтрока.ЕдИзм;
		ПроверитьИВывести(ТабДок, обСтрокаТЧСостав);
		
		подСтроки = тч.НайтиСтроки(Новый структура("Родитель_ID", текСтрока.ID));
		ВывестиРекурсивно(Макет, тч, подСтроки, ТабДок, ИмяОбластиВМакете, НомерСтрокой + ".");
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьИВывести(ТабДок, ТекБлок)
	
	Если НЕ ТабДок.ПроверитьВывод(ТекБлок) Тогда
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	
	ТабДок.Вывести(ТекБлок);	
	
КонецПроцедуры

Процедура СобратьДерево(Корень, Выгрузка, РемонтныеРаботыИзСметы)
	
	НайС = Выгрузка.НайтиСтроки(Новый Структура("Родитель_ID", Корень.ID));
	Для каждого текСтрока из НайС Цикл
		Если Не РемонтныеРаботыИзСметы.Найти(текСтрока.ID) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		нс = Корень.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(нс, текСтрока);
		СобратьДерево(нс, Выгрузка, РемонтныеРаботыИзСметы);
	КонецЦикла;
	
КонецПроцедуры	

Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	Настройки.ПриПолученииСлужебныхРеквизитов = Истина;
	
КонецПроцедуры

Процедура ПриПолученииСлужебныхРеквизитов(Реквизиты) Экспорт
	
	Реквизиты.Добавить("СтатусДокумента");
	Реквизиты.Добавить("ИсторияСтатусов.*");
	Реквизиты.Добавить("Согласующие.*");
		
КонецПроцедуры

Функция ПолучитьНормыЗатратИзСметы(РемонтныеРаботы, ВыборкаРемонтов, ДокументИсточник)
	МассивНайденныхРабот = Новый Массив;
	
	СтруктураТаблиц = Новый Структура("МатериальныеЗатраты, ИнструментыИТехника");
	
	СтруктураТаблиц.ИнструментыИТехника = Новый ТаблицаЗначений;
	СтруктураТаблиц.ИнструментыИТехника.Колонки.Добавить("Инструмент");
	СтруктураТаблиц.ИнструментыИТехника.Колонки.Добавить("ЕдиницаИзмерения");
	СтруктураТаблиц.ИнструментыИТехника.Колонки.Добавить("Количество");
	
	РемонтныеРаботыЗаявки = ДокументИсточник.РемонтныеРаботы;
	Инструменты = ДокументИсточник.Инструменты;
	
	Для каждого РемонтнаяРабота Из РемонтныеРаботы Цикл
		СтруктураПоиска = Новый Структура("ID, РемонтыОборудования_ID", РемонтнаяРабота.ID, ВыборкаРемонтов.ID);
		НайденныеРаботы = РемонтныеРаботыЗаявки.НайтиСтроки(СтруктураПоиска);
		Если НайденныеРаботы.Количество() = 0 Или Не ТипЗнч(РемонтнаяРабота.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
		    Продолжить
		КонецЕсли;
		
		МассивНайденныхРабот.Добавить(РемонтнаяРабота.ID);
		
		ИнструментыРаботы = Инструменты.Выгрузить(СтруктураПоиска);
		Для каждого СтрокаИнструмента Из ИнструментыРаботы Цикл
			НоваяСтрокаИнструментов = СтруктураТаблиц.ИнструментыИТехника.Добавить();
		    ЗаполнитьЗначенияСвойств(НоваяСтрокаИнструментов, СтрокаИнструмента);
			НоваяСтрокаИнструментов.ЕдиницаИзмерения = НоваяСтрокаИнструментов.Инструмент.ЕдиницаИзмерения;
		КонецЦикла;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РемонтныеРаботы.ID КАК ID,
		|	РемонтныеРаботы.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_РемонтныеРаботы
		|ИЗ
		|	&РемонтныеРаботы КАК РемонтныеРаботы
		|ГДЕ
		|	РемонтныеРаботы.ID В(&СписокОпераций)
		|	И РемонтныеРаботы.РемонтнаяРабота ССЫЛКА Справочник.торо_ТехнологическиеОперации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.ID КАК ID,
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_РемонтныеРаботыЗаявки
		|ИЗ
		|	Документ.торо_ЗаявкаНаРемонт.РемонтныеРаботы КАК торо_ЗаявкаНаРемонтРемонтныеРаботы
		|ГДЕ
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.Ссылка = &Регистратор
		|	И торо_ЗаявкаНаРемонтРемонтныеРаботы.ID В(&СписокОпераций)
		|	И торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтыОборудования_ID = &IDРемонта
		|	И торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтнаяРабота ССЫЛКА Справочник.торо_ТехнологическиеОперации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.Номенклатура КАК Номенклатура,
		|	торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	СУММА(торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.Количество) КАК Количество,
		|	торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.ID КАК ID
		|ПОМЕСТИТЬ ВТ_МатериальныеЗатраты
		|ИЗ
		|	РегистрНакопления.торо_ПлановыеМатериальныеЗатратыРемонтныхРабот КАК торо_ПлановыеМатериальныеЗатратыРемонтныхРабот
		|ГДЕ
		|	торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.Регистратор = &Регистратор
		|	И торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.РемонтыОборудования_ID = &IDРемонта
		|	И торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.ID В(&СписокОпераций)
		|	И торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.РемонтнаяРабота ССЫЛКА Справочник.торо_ТехнологическиеОперации
		|
		|СГРУППИРОВАТЬ ПО
		|	торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.Номенклатура,
		|	торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.ХарактеристикаНоменклатуры,
		|	торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.Номенклатура.ЕдиницаИзмерения,
		|	торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_МатериальныеЗатраты.Номенклатура КАК Номенклатура,
		|	ВТ_МатериальныеЗатраты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_МатериальныеЗатраты.Количество / ВТ_РемонтныеРаботыЗаявки.Количество * ВТ_РемонтныеРаботы.Количество КАК Количество,
		|	ВТ_МатериальныеЗатраты.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	ВТ_МатериальныеЗатраты КАК ВТ_МатериальныеЗатраты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РемонтныеРаботыЗаявки КАК ВТ_РемонтныеРаботыЗаявки
		|		ПО ВТ_МатериальныеЗатраты.ID = ВТ_РемонтныеРаботыЗаявки.ID
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РемонтныеРаботы КАК ВТ_РемонтныеРаботы
		|		ПО ВТ_МатериальныеЗатраты.ID = ВТ_РемонтныеРаботы.ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ПлановыеЗатратыЗапчастей.Номенклатура КАК Номенклатура,
		|	торо_ПлановыеЗатратыЗапчастей.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	СУММА(торо_ПлановыеЗатратыЗапчастей.Количество) КАК Количество,
		|	торо_ПлановыеЗатратыЗапчастей.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	РегистрНакопления.торо_ПлановыеЗатратыЗапчастей КАК торо_ПлановыеЗатратыЗапчастей
		|ГДЕ
		|	торо_ПлановыеЗатратыЗапчастей.Регистратор = &Регистратор
		|	И торо_ПлановыеЗатратыЗапчастей.РемонтыОборудования_ID = &IDРемонта
		|
		|СГРУППИРОВАТЬ ПО
		|	торо_ПлановыеЗатратыЗапчастей.Номенклатура,
		|	торо_ПлановыеЗатратыЗапчастей.ХарактеристикаНоменклатуры,
		|	торо_ПлановыеЗатратыЗапчастей.Номенклатура.ЕдиницаИзмерения";
	
	Запрос.УстановитьПараметр("Регистратор", ДокументИсточник);
	Запрос.УстановитьПараметр("IDРемонта", ВыборкаРемонтов.ID);
	Запрос.УстановитьПараметр("СписокОпераций", МассивНайденныхРабот);
	Запрос.УстановитьПараметр("РемонтныеРаботы", РемонтныеРаботы);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	СтруктураТаблиц.МатериальныеЗатраты = РезультатЗапроса[3].Выгрузить();
	Запчасти = РезультатЗапроса[4].Выгрузить();
	
	Для каждого СтрокаЗапчасти Из Запчасти Цикл
		ЗаполнитьЗначенияСвойств(СтруктураТаблиц.МатериальныеЗатраты.Добавить(), СтрокаЗапчасти);
	КонецЦикла;
	
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("РемонтныеРаботыИзСметы", МассивНайденныхРабот);
	СтруктураРезультата.Вставить("СтруктураТаблиц", СтруктураТаблиц);
	
	Возврат СтруктураРезультата;
КонецФункции

Функция ПолучитьНормыЗапчастей(ОбъектРемонта, ВидРемонтныхРабот)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_НормыЗапчастейНаОбъектыРемонта.Номенклатура КАК Наименование,
	               |	торо_НормыЗапчастейНаОбъектыРемонта.Количество КАК Количество,
	               |	торо_НормыЗапчастейНаОбъектыРемонта.Характеристика КАК Характеристика,
	               |	торо_НормыЗапчастейНаОбъектыРемонта.Номенклатура.ЕдиницаИзмерения КАК ЕдИзм
	               |ИЗ
	               |	РегистрСведений.торо_НормыЗапчастейНаОбъектыРемонта КАК торо_НормыЗапчастейНаОбъектыРемонта
	               |ГДЕ
	               |	торо_НормыЗапчастейНаОбъектыРемонта.ОбъектРемонта = &ОбъектРемонта
	               |	И торо_НормыЗапчастейНаОбъектыРемонта.ВидРемонта = &ВидРемонта";
	
	Запрос.УстановитьПараметр("ОбъектРемонта", ОбъектРемонта);
	Запрос.УстановитьПараметр("ВидРемонта", ВидРемонтныхРабот);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
 

// Формирование названия месяца с учетом падежа (именительный и родительный).
//
// Параметры:
// 	НомерМесяца - номер месяца в году.
//		Падеж - указание паджа, в котором нужно сформировать название месяца
//				("Имен" - именительный, по-умолчанию; "Род" - родительный).
//
// Возвращаемое значение:
// 		Строка, название месяца с учетом падежа.
//
Функция НазваниеМесяцаСтрокойПадежное(Знач НомерМесяца, Знач Падеж="Имен")
    если Падеж="Род" тогда
     если НомерМесяца=1 тогда
    	Возврат "января"
     иначеЕсли НомерМесяца=2 тогда
    	Возврат "февраля"
     иначеЕсли НомерМесяца=3 тогда
    	Возврат "марта"
     иначеЕсли НомерМесяца=4 тогда
    	Возврат "апреля"
     иначеЕсли НомерМесяца=5 тогда
    	Возврат "мая"
     иначеЕсли НомерМесяца=6 тогда
    	Возврат "июня"
     иначеЕсли НомерМесяца=7 тогда
    	Возврат "июля"
     иначеЕсли НомерМесяца=8 тогда
    	Возврат "августа"
     иначеЕсли НомерМесяца=9 тогда
    	Возврат "сентября"
     иначеЕсли НомерМесяца=10 тогда
    	Возврат "октября"
     иначеЕсли НомерМесяца=11 тогда
    	Возврат "ноября"
      иначеЕсли НомерМесяца=12 тогда
    	Возврат "декабря"	
      конецЕсли;
   конецЕсли;
   если Падеж="Имен" тогда
     если НомерМесяца=1 тогда
    	Возврат "январь"
     иначеЕсли НомерМесяца=2 тогда
    	Возврат "февраль"
     иначеЕсли НомерМесяца=3 тогда
    	Возврат "март"
     иначеЕсли НомерМесяца=4 тогда
    	Возврат "апрель"
     иначеЕсли НомерМесяца=5 тогда
    	Возврат "май"
     иначеЕсли НомерМесяца=6 тогда
    	Возврат "июнь"
     иначеЕсли НомерМесяца=7 тогда
    	Возврат "июль"
     иначеЕсли НомерМесяца=8 тогда
    	Возврат "август"
     иначеЕсли НомерМесяца=9 тогда
    	Возврат "сентябрь"
     иначеЕсли НомерМесяца=10 тогда
    	Возврат "октябрь"
     иначеЕсли НомерМесяца=11 тогда
    	Возврат "ноябрь"
      иначеЕсли НомерМесяца=12 тогда
    	Возврат "декабрь"	
      конецЕсли;
   конецЕсли;
   
КонецФункции

Функция ПечатьНарядДопускНаПроведениеГазоопасныхРабот(МассивОбъектов, ПараметрыПечати)

	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "торо_НарядНаВыполнениеРемонтныхРабот";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_НарядДопускНаПроведениеГазоопасныхРабот");
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                |	торо_НарядНаВыполнениеРемонтныхРаботИсполнители.Сотрудник КАК Сотрудник,
	                |	торо_НарядНаВыполнениеРемонтныхРаботИсполнители.Квалификация КАК Квалификация,
	                |	МИНИМУМ(торо_НарядНаВыполнениеРемонтныхРаботИсполнители.ДатаНачала) КАК ДатаНачала,
	                |	МАКСИМУМ(торо_НарядНаВыполнениеРемонтныхРаботИсполнители.ДатаОкончания) КАК ДатаОкончания,
	                |	торо_НарядНаВыполнениеРемонтныхРаботИсполнители.РемонтыОборудования_ID КАК РемонтыОборудования_ID
	                |ПОМЕСТИТЬ Исполнители
	                |ИЗ
	                |	Документ.торо_НарядНаВыполнениеРемонтныхРабот.Исполнители КАК торо_НарядНаВыполнениеРемонтныхРаботИсполнители
	                |ГДЕ
	                |	торо_НарядНаВыполнениеРемонтныхРаботИсполнители.Ссылка В(&Ссылка)
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	торо_НарядНаВыполнениеРемонтныхРаботИсполнители.Сотрудник,
	                |	торо_НарядНаВыполнениеРемонтныхРаботИсполнители.Квалификация,
	                |	торо_НарядНаВыполнениеРемонтныхРаботИсполнители.РемонтыОборудования_ID
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка КАК Ссылка,
	                |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Номер КАК Номер,
	                |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Дата КАК Дата,
	                |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Организация КАК Организация,
	                |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Подразделение КАК Подразделение,
	                |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Ответственный КАК Ответственный,
	                |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID КАК ID,
	                |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта,
	                |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	                |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОпаснаяРабота КАК ОпаснаяРабота,
	                |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.МестоПроведенияРабот КАК МестоПроведенияРабот,
	                |	Исполнители.Сотрудник КАК Сотрудник,
	                |	Исполнители.Квалификация КАК Квалификация,
	                |	Исполнители.ДатаНачала КАК ДатаНачала,
	                |	Исполнители.ДатаОкончания КАК ДатаОкончания
	                |ИЗ
	                |	Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтыОборудования КАК торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Исполнители КАК Исполнители
	                |		ПО торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID = Исполнители.РемонтыОборудования_ID
	                |ГДЕ
	                |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка В(&Ссылка)
	                |	И торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID В(&ID)
	                |ИТОГИ
	                |	МАКСИМУМ(Номер),
	                |	МАКСИМУМ(Дата),
	                |	МАКСИМУМ(Организация),
	                |	МАКСИМУМ(Подразделение),
	                |	МАКСИМУМ(Ответственный)
	                |ПО
	                |	Ссылка,
	                |	ID";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	Если ПараметрыПечати.Свойство("МассивID") Тогда
		Запрос.УстановитьПараметр("ID", ПараметрыПечати.МассивID);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID В(&ID)", "");
	КонецЕсли;
	
	ВыборкаДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
	ЭтоПервый = Истина;
	
	Пока ВыборкаДокументов.Следующий() Цикл
		
		ВыборкаРемонтов = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ID");
		Пока ВыборкаРемонтов.Следующий() Цикл
			
			Если НЕ ЭтоПервый Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ЭтоПервый = Ложь;
			
			Шапка = Макет.ПолучитьОбласть("ШапкаДокумента");
			Шапка.Параметры.Номер = ВыборкаДокументов.Номер;
			Шапка.Параметры.Дата = Формат(ВыборкаДокументов.Дата,"ДФ=dd.MM.yyyy");
			ТабДок.Вывести(Шапка);
			
			ПерваяРемонтнаяРабота = Макет.ПолучитьОбласть("ПерваяРемонтнаяРабота");
			РемонтнаяРабота       = Макет.ПолучитьОбласть("РемонтнаяРабота");
			
			Отбор = Новый Структура;
			Отбор.Вставить("РемонтыОборудования_ID", ВыборкаРемонтов.ID);
			СтрокиТекущегоОтбора = ВыборкаДокументов.Ссылка.РемонтныеРаботы.НайтиСтроки(Отбор);
			
			ПерваяРабота = Истина;
			Для Каждого СтрокаОтбора Из СтрокиТекущегоОтбора Цикл
				Если ТипЗнч(СтрокаОтбора.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
					Если СтрокаОтбора.РемонтнаяРабота.НаименованиеДляПечати = "" Тогда
					    НаименованиеРаботы = СтрокаОтбора.РемонтнаяРабота.Наименование;
					Иначе
					    НаименованиеРаботы = СтрокаОтбора.РемонтнаяРабота.НаименованиеДляПечати;
					КонецЕсли;
					
					Если ПерваяРабота Тогда 
						ПерваяРемонтнаяРабота.Параметры.РемонтнаяРабота = НаименованиеРаботы;
						ПерваяРабота = Ложь;
						ТабДок.Вывести(ПерваяРемонтнаяРабота);
					Иначе
						РемонтнаяРабота.Параметры.РемонтнаяРабота = НаименованиеРаботы;
						ТабДок.Вывести(РемонтнаяРабота);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			Пункт4_10 = Макет.ПолучитьОбласть("Пункт4_10");
			ТабДок.Вывести(Пункт4_10);
			ШапкаТаблицыИсполнители = Макет.ПолучитьОбласть("ШапкаТаблицыИсполнители");
			ТабДок.Вывести(ШапкаТаблицыИсполнители);
			
			ПП = 0;
			ВыборкаРемонта = ВыборкаРемонтов.Выбрать(ОбходРезультатаЗапроса.Прямой); 
			Пока ВыборкаРемонта.Следующий() Цикл 
				
				СтрокаТаблицыИсполнители = Макет.ПолучитьОбласть("СтрокаТаблицыИсполнители");
				ПП = ПП+1;
				СтрокаТаблицыИсполнители.Параметры.Заполнить(ВыборкаРемонта);
				СтрокаТаблицыИсполнители.Параметры.ПП = ПП;
				//Если ВыборкаРемонта.ДатаНачала <> Дата (1,1,1) Тогда 
				//	СтрокаТаблицыИсполнители.Параметры.ДатаВремя = Строка(ВыборкаРемонта.ДатаНачала);
				//КонецЕсли;
				ТабДок.Вывести(СтрокаТаблицыИсполнители);
				КонецЦикла;
			
			Пункт12_16 = Макет.ПолучитьОбласть("Пункт12_16");
			ТабДок.Вывести(Пункт12_16);
			
		КонецЦикла;
	КонецЦикла;
	
	ТабДок.ТолькоПросмотр = Истина;
	Возврат ТабДок;
	
КонецФункции

// >> [Деснол] [Ушаков А.Д.] [26.09.2019]
Функция НазваниеМесяцаСтрокой_РодительныйПадеж(Знач Дата)
	НазваниеМесяца = Сред(Формат(Дата, "ДФ=ddMMMM"),3);
	Возврат НазваниеМесяца;
КонецФункции
// << [Деснол] [Ушаков А.Д.] [26.09.2019] 
#КонецОбласти

#КонецЕсли