#Область ОбработчикиСобытийФормы

&НаСервере
Процедура гкс_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// гкс+ [Часовые пояса] Куст 
	Сдвиг = Час(ТекущаяДатаСеанса()) - Час(ТекущаяДата());
	ТекстыЗамены = Новый Массив();
	ТекстыЗамены.Добавить(Новый Структура("До, После", "Документторо_НарядНаВыполнениеРемонтныхРабот.Дата,",
		"ДобавитьКДате(Документторо_НарядНаВыполнениеРемонтныхРабот.Дата, Час, " + Сдвиг + ") КАК Дата,"));
	Список.ТекстЗапроса = гкс_ЧасовыеПоясаВызовСервера.ИзменитьТекстЗапросаФормыСписка(
		Список.ТекстЗапроса, ТекстыЗамены);
	// гкс+ [2021] Куст
	гкс_ДобавитьГруппуКомандПечатиБАТ();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	
// гкс+ [2021] Куст 
&НаСервере
Процедура гкс_ДобавитьГруппуКомандПечатиБАТ()
	НоваяГруппа = Элементы.Добавить("гкс_БАТПечать", Тип("ГруппаФормы"), Элементы.ПодменюПечатьОбычное);
	НоваяГруппа.Вид = ВидГруппыФормы.Подменю;
	НоваяГруппа.Заголовок = "БАТ";
	//
	Для Каждого ЭлементСписка ИЗ Элементы.ПодменюПечатьОбычное.ПодчиненныеЭлементы Цикл
		Если Не СтрНайти(ЭлементСписка.Имя, "БАТ") = 0 Тогда 
			Элементы.Переместить(ЭлементСписка, НоваяГруппа);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти