
&ИзменениеИКонтроль("ПроверкаСпискаНачисленийКадровогоДокумента")
Процедура гкс_ПроверкаСпискаНачисленийКадровогоДокумента(Объект, Начисления, ИмяТаблицыНачислений, Отказ)

	#Удаление
	Если НЕ Пользователи.РолиДоступны("ДобавлениеИзменениеДанныхДляНачисленияЗарплатыРасширенная,ЧтениеДанныхДляНачисленияЗарплатыРасширенная") Тогда
		Возврат;
	КонецЕсли;
	#КонецУдаления

	Запрос = Новый Запрос();

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Начисления.Начисление КАК Начисление,
	|	Начисления.НомерСтроки
	|ПОМЕСТИТЬ ВТНачисленияДокумента
	|ИЗ
	|	&Начисления КАК Начисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Начисления.Наименование,
	|	НачисленияДокумента.НомерСтроки,
	|	Начисления.Ссылка,
	|	ОбозначенияВТабелеУчетаРабочегоВремени.Ссылка КАК ОбозначениеВТабелеУчетаРабочегоВремени
	|ПОМЕСТИТЬ ВТНачисленияСЗачетомВремени
	|ИЗ
	|	ВТНачисленияДокумента КАК НачисленияДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления КАК Начисления
	|		ПО (Начисления.Ссылка = НачисленияДокумента.Начисление)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыИспользованияРабочегоВремени КАК ОбозначенияВТабелеУчетаРабочегоВремени
	|		ПО (ОбозначенияВТабелеУчетаРабочегоВремени.Ссылка = Начисления.ОбозначениеВТабелеУчетаРабочегоВремени)
	|ГДЕ
	|	Начисления.ЗачетНормыВремени
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТНачисленияСЗачетомВремени.Наименование,
	|	ВТНачисленияСЗачетомВремени.НомерСтроки
	|ИЗ
	|	ВТНачисленияСЗачетомВремени КАК ВТНачисленияСЗачетомВремени
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисленияСЗачетомВремени КАК ВТНачисленияСЗачетомВремениПров
	|		ПО ВТНачисленияСЗачетомВремени.Ссылка <> ВТНачисленияСЗачетомВремениПров.Ссылка
	|			И ВТНачисленияСЗачетомВремени.ОбозначениеВТабелеУчетаРабочегоВремени = ВТНачисленияСЗачетомВремениПров.ОбозначениеВТабелеУчетаРабочегоВремени
	|ГДЕ
	|	НЕ ВТНачисленияСЗачетомВремениПров.НомерСтроки ЕСТЬ NULL 
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТНачисленияСЗачетомВремени.НомерСтроки,
	|	ВТНачисленияСЗачетомВремени.Наименование";
	Запрос.УстановитьПараметр("Начисления", Начисления);
	Результат = Запрос.Выполнить();

	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ШаблонСообщения = НСтр("es='Son introducidos algunos recargos que excluyen mútuamente (%1)';ru='Введено несколько взаимоисключающих начислений (%1)';en='Several mutually exclusive charges were introduced (%1)'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, Выборка.Наименование);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Объект, ИмяТаблицыНачислений + "[" + Формат(Выборка.НомерСтроки - 1, "ЧГ=0") + "].Начисление",,Отказ);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
