
&ИзменениеИКонтроль("Свойства")
Функция гкс_Свойства(СсылкаНаНастройку)
	
	#Вставка
	// Гкс+[TOIR20-381] Лебедев Н.А. от 03.07.2023. Добавлено:{
	УстановитьПривилегированныйРежим(Истина);
	// Гкс-[TOIR20-381] Лебедев Н.А. от 03.07.2023. 
	#КонецВставки
	Свойства = Новый Соответствие;

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПолучитьСвойства();
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаНастройку); 

	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		Свойства.Вставить(Выборка.Ключ, Выборка.Значение); 
	КонецЦикла;

	Возврат Свойства;

КонецФункции
