
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ОтборВД = Истина;
	Объект.ОтборВО = Истина;
	Объект.ОтборППР = Истина;
	
	НастройкиВосстановлены = ВосстановитьНастройки();
	
	Если НЕ ЗначениеЗаполнено(Объект.ВариантОтображения) Тогда
		Объект.ВариантОтображения = "БезЗаявок";
	КонецЕсли;
	
	ФОИспользоватьППР = ПолучитьФункциональнуюОпцию("торо_ИспользоватьППР");
	ФОИспользоватьВнешниеОснования = ПолучитьФункциональнуюОпцию("торо_ИспользоватьВнешниеОснованияДляРабот");
	ФОИспользоватьДефекты = ПолучитьФункциональнуюОпцию("торо_УчетВыявленныхДефектовОборудования");
	
	ПредыдущийОтборКонтрагент = Объект.ОтборКонтрагент;
	
	УстановитьПараметрыДинамическогоСписка();
	УстановитьПараметрыВыбораДоговора();
	УстановитьПараметрыВыбораБригады();
	
	// >> [Деснол] [Ушаков А.Д.] [03.10.2019]
	дс_ЛокализоватьЗаголовкиКолонокРемонтов();
	// << [Деснол] [Ушаков А.Д.] [03.10.2019] 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОтборСпискаПоВариантуОтображения();
	УстановитьОтборыСписка();
	УправлениеФормой();
	СформироватьЗаголовокСвернутойГруппы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если НЕ ЗавершениеРаботы Тогда
		СохранитьНастройки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "СозданДокументЧерезРМТехСпец" Тогда
		Элементы.Ремонты.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьДокументИсточник(Команда)
	
	ТекущиеДанные = Элементы.Ремонты.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ПоказатьЗначение(, ТекущиеДанные.Документ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРМДиспетчера(Команда)
	
	ОткрытьФорму("Обработка.торо_РабочееМестоДиспетчера.Форма");
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиЗаявку(Команда)
	
	ВыполнитьВводДокументаНаОсновании("торо_ЗаявкаНаРемонт", "заявку");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВариантОтображенияПриИзменении(Элемент)
	
	УстановитьОтборСпискаПоВариантуОтображения();
	УстановитьОтборыСписка();
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура РемонтыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "РемонтыЗаявка" Тогда
		ОткрытьЗаявку();
	Иначе
		ОткрытьДокументИсточник(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПодразделениеИспользованиеПриИзменении(Элемент)
	
	Если Объект.ОтборПодразделениеИспользование Тогда
		Объект.ОтборКонтрагентИспользование = Ложь;
		Объект.ОтборДоговорИспользование = Ложь;
	КонецЕсли;
	
	УстановитьОтборыСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборБригадаИспользованиеПриИзменении(Элемент)
	
	Если Объект.ОтборБригадаИспользование Тогда
		Объект.ОтборКонтрагентИспользование = Ложь;
		Объект.ОтборДоговорИспользование = Ложь;
	КонецЕсли;
	
	УстановитьОтборыСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборКонтрагентИспользованиеПриИзменении(Элемент)
	
	Если Объект.ОтборКонтрагентИспользование Тогда
		Объект.ОтборПодразделениеИспользование = Ложь;
		Объект.ОтборБригадаИспользование = Ложь;
	КонецЕсли;
	
	УстановитьОтборыСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборДоговорИспользованиеПриИзменении(Элемент)
	
	Если Объект.ОтборДоговорИспользование Тогда
		Объект.ОтборПодразделениеИспользование = Ложь;
		Объект.ОтборБригадаИспользование = Ложь;
	КонецЕсли;
	
	УстановитьОтборыСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПодразделениеПриИзменении(Элемент)
	УстановитьПараметрыВыбораБригады();	
	УстановитьОтборыСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборБригадаПриИзменении(Элемент)
	
	УстановитьОтборыСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборКонтрагентПриИзменении(Элемент)
	
	Если (ЗначениеЗаполнено(ПредыдущийОтборКонтрагент) И НЕ ЗначениеЗаполнено(Объект.ОтборКонтрагент))
		ИЛИ (НЕ ЗначениеЗаполнено(ПредыдущийОтборКонтрагент) И ЗначениеЗаполнено(Объект.ОтборКонтрагент)) Тогда
		УстановитьПараметрыВыбораДоговора();
	КонецЕсли;
	
	УстановитьОтборыСписка();
	
	ПредыдущийОтборКонтрагент = Объект.ОтборКонтрагент;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборДоговорПриИзменении(Элемент)
	
	УстановитьОтборыСписка();

КонецПроцедуры

&НаКлиенте
Процедура ОтборСтатусИспользованиеПриИзменении(Элемент)
	
	УстановитьОтборыСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтатусПриИзменении(Элемент)
	
	УстановитьОтборыСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборППРПриИзменении(Элемент)
	СформироватьЗаголовокСвернутойГруппы();
	УстановитьОтборыСписка();
КонецПроцедуры

&НаКлиенте
Процедура ОтборВОПриИзменении(Элемент)
	СформироватьЗаголовокСвернутойГруппы();
	УстановитьОтборыСписка();
КонецПроцедуры

&НаКлиенте
Процедура ОтборВДПриИзменении(Элемент)
	СформироватьЗаголовокСвернутойГруппы();
	УстановитьОтборыСписка();
КонецПроцедуры

&НаКлиенте
Процедура ОтборНачалоПериодаПриИзменении(Элемент)
	Если Объект.ОтборНачалоПериода > Объект.ОтборКонецПериода Тогда
		ТекстСообщения = НСтр("es='Se prohíbe introducir la fecha ha comenzado más de fechas de la terminación.';ru='Запрещено вводить дату начала больше даты окончания.';en='It is prohibited to enter a start date greater than the end date.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	УстановитьОтборыСписка();
КонецПроцедуры

&НаКлиенте
Процедура ОтборКонецПериодаПриИзменении(Элемент)
	Если Объект.ОтборНачалоПериода > Объект.ОтборКонецПериода Тогда
		ТекстСообщения = НСтр("es='Se prohíbe introducir la fecha ha comenzado más de fechas de la terminación.';ru='Запрещено вводить дату начала больше даты окончания.';en='It is prohibited to enter a start date greater than the end date.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;	
	УстановитьОтборыСписка();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПериодИспользованиеПриИзменении(Элемент)
	УстановитьОтборыСписка();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВосстановитьНастройки()
	
	ЗначениеНастроек = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("Обработка.торо_АдресацияЗаявок", "");
	
	Если ТипЗнч(ЗначениеНастроек) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Объект, ЗначениеНастроек);
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СохранитьНастройки()
	
	СохраненнаяНастройка = Новый Структура;
	СохраненнаяНастройка.Вставить("ВариантОтображения", Объект.ВариантОтображения);
	СохраненнаяНастройка.Вставить("ОтборПодразделение", Объект.ОтборПодразделение);
	СохраненнаяНастройка.Вставить("ОтборПодразделениеИспользование", Объект.ОтборПодразделениеИспользование);
	СохраненнаяНастройка.Вставить("ОтборБригада", Объект.ОтборБригада);
	СохраненнаяНастройка.Вставить("ОтборБригадаИспользование", Объект.ОтборБригадаИспользование);
	СохраненнаяНастройка.Вставить("ОтборКонтрагент", Объект.ОтборКонтрагент);
	СохраненнаяНастройка.Вставить("ОтборКонтрагентИспользование", Объект.ОтборКонтрагентИспользование);
	СохраненнаяНастройка.Вставить("ОтборДоговор", Объект.ОтборДоговор);
	СохраненнаяНастройка.Вставить("ОтборДоговорИспользование", Объект.ОтборДоговорИспользование);
	СохраненнаяНастройка.Вставить("ОтборСтатус", Объект.ОтборСтатус);
	СохраненнаяНастройка.Вставить("ОтборСтатусИспользование", Объект.ОтборСтатусИспользование);
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("Обработка.торо_АдресацияЗаявок", "", СохраненнаяНастройка);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыДинамическогоСписка()
	
	Ремонты.Параметры.УстановитьЗначениеПараметра("торо_ВидРемонтаВД", Константы.торо_ВидРемонтаПриВводеНаОснованииВыявленныхДефектов.Получить());
	Ремонты.Параметры.УстановитьЗначениеПараметра("торо_ВидРемонтаВО", Константы.торо_ВидРемонтаПриВводеНаОснованииВнешнихОснований.Получить());
	Ремонты.Параметры.УстановитьЗначениеПараметра("ФОИспользоватьВнешниеОснования", ФОИспользоватьВнешниеОснования);
	Ремонты.Параметры.УстановитьЗначениеПараметра("ФОИспользоватьДефекты", ФОИспользоватьДефекты);
	Ремонты.Параметры.УстановитьЗначениеПараметра("ФОИспользоватьППР", ФОИспользоватьППР);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборСпискаПоВариантуОтображения()

	Если Объект.ВариантОтображения = "БезЗаявок" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ремонты, "ВведенаЗаявка", Ложь,,,Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	ИначеЕсли Объект.ВариантОтображения = "СЗаявками" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ремонты, "ВведенаЗаявка", Истина,,,Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);		
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ремонты, "ВведенаЗаявка", Ложь,,,Ложь, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте 
Процедура УстановитьОтборыСписка()
	
	СписокДокументовОснований = Новый Массив();
	Если Объект.ОтборППР Тогда
		СписокДокументовОснований.Добавить("торо_ПланГрафикРемонта");	
	КонецЕсли; 
	Если Объект.ОтборВО Тогда
		СписокДокументовОснований.Добавить("торо_ВнешнееОснованиеДляРабот");	
	КонецЕсли; 
	Если Объект.ОтборВД Тогда
		СписокДокументовОснований.Добавить("торо_ВыявленныеДефекты");	
	КонецЕсли; 

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ремонты, "ТипДокумента", СписокДокументовОснований, 
		ВидСравненияКомпоновкиДанных.ВСписке,, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ремонты, "ДатаНачала", Объект.ОтборНачалоПериода,
		ВидСравненияКомпоновкиДанных.БольшеИлиРавно,,Объект.ОтборПериодИспользование, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ремонты, "ДатаОкончания", Объект.ОтборКонецПериода,
		ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,,Объект.ОтборПериодИспользование, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);	
	Если Объект.ВариантОтображения = "БезЗаявок" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ремонты, "СтатусРемонта", Объект.ОтборСтатус,,,Ложь, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);	
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ремонты, "СтатусРемонта", Объект.ОтборСтатус,,,Объект.ОтборСтатусИспользование, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);	
	КонецЕсли; 
			
	Если (Объект.ОтборПодразделениеИспользование ИЛИ Объект.ОтборБригадаИспользование) И Объект.ВариантОтображения <> "БезЗаявок" Тогда
		
		ПустыеИсполнители = Новый Массив;
		ПустыеИсполнители.Добавить(Неопределено);
		ПустыеИсполнители.Добавить(ПредопределенноеЗначение("Справочник.СтруктураПредприятия.ПустаяСсылка"));
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ремонты, "Хозспособ", Истина,,,Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		
		Если ЗначениеЗаполнено(Объект.ОтборПодразделение) Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ремонты, "Исполнитель", 
					Объект.ОтборПодразделение, ВидСравненияКомпоновкиДанных.Равно,,
					Объект.ОтборПодразделениеИспользование, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ремонты, "Исполнитель", 
					ПустыеИсполнители, ВидСравненияКомпоновкиДанных.ВСписке,,
					Объект.ОтборПодразделениеИспользование, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		КонецЕсли;
		
		ПустыеБригады = Новый Массив;
		ПустыеБригады.Добавить(Неопределено);
		ПустыеБригады.Добавить(ПредопределенноеЗначение("Справочник.торо_РемонтныеБригады.ПустаяСсылка"));

		Если ЗначениеЗаполнено(Объект.ОтборБригада) Тогда
		   ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ремонты, "УточнениеИсполнителя", 
					Объект.ОтборБригада,ВидСравненияКомпоновкиДанных.Равно,,
					Объект.ОтборБригадаИспользование, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		Иначе
		   ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ремонты, "УточнениеИсполнителя", 
					ПустыеБригады,ВидСравненияКомпоновкиДанных.ВСписке,,
					Объект.ОтборБригадаИспользование, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		КонецЕсли;
		
		
	ИначеЕсли (Объект.ОтборКонтрагентИспользование ИЛИ Объект.ОтборДоговорИспользование) И Объект.ВариантОтображения <> "БезЗаявок" Тогда
		
		ПустыеИсполнители = Новый Массив;
		ПустыеИсполнители.Добавить(Неопределено);
		ПустыеИсполнители.Добавить(ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка"));
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ремонты, "Хозспособ", Ложь,,,Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		
		Если ЗначениеЗаполнено(Объект.ОтборКонтрагент) Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ремонты, "Исполнитель", 
					Объект.ОтборКонтрагент, ВидСравненияКомпоновкиДанных.Равно,,
					Объект.ОтборКонтрагентИспользование, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ремонты, "Исполнитель", 
					ПустыеИсполнители, ВидСравненияКомпоновкиДанных.ВСписке,,
					Объект.ОтборКонтрагентИспользование, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		КонецЕсли;
		
		ПустыеДоговора = Новый Массив;
		ПустыеДоговора.Добавить(Неопределено);
		ПустыеДоговора.Добавить(ПредопределенноеЗначение("Справочник.ДоговорыКонтрагентов.ПустаяСсылка"));
		
		Если ЗначениеЗаполнено(Объект.ОтборДоговор) Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ремонты, "УточнениеИсполнителя", 
					Объект.ОтборДоговор,ВидСравненияКомпоновкиДанных.Равно,,
					Объект.ОтборДоговорИспользование, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);		
		Иначе	
		    ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ремонты, "УточнениеИсполнителя", 
					ПустыеДоговора,ВидСравненияКомпоновкиДанных.ВСписке,,
					Объект.ОтборДоговорИспользование, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		КонецЕсли; 		
		
					
	Иначе
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ремонты, "Хозспособ", Ложь,,,Ложь, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ремонты, "Исполнитель",	Неопределено,ВидСравненияКомпоновкиДанных.Равно,,Ложь, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ремонты, "УточнениеИсполнителя",	Неопределено,,,Ложь, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормой()

	Элементы.РемонтыВведенаЗаявка.Видимость = (Объект.ВариантОтображения <> "БезЗаявок");
	Элементы.РемонтыЗаявка.Видимость = (Объект.ВариантОтображения <> "БезЗаявок");
	
	Элементы.ГруппаОтборПодразделениеБригада.Видимость = (Объект.ВариантОтображения <> "БезЗаявок");
	Элементы.ГруппаОтборКонтрагентДоговор.Видимость = (Объект.ВариантОтображения <> "БезЗаявок");
	Элементы.ГруппаОтборСтатус.Видимость = (Объект.ВариантОтображения <> "БезЗаявок");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗаявку()
	
	ТекущиеДанные = Элементы.Ремонты.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(ТекущиеДанные.Заявка) Тогда
		ПоказатьЗначение(, ТекущиеДанные.Заявка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораДоговора()
	
	Если ЗначениеЗаполнено(Объект.ОтборДоговор) И Объект.ОтборДоговор.Контрагент <> Объект.ОтборКонтрагент Тогда
		Объект.ОтборДоговор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();		
	КонецЕсли; 
	
	МассивСвязей = Новый Массив;
	
	Если ЗначениеЗаполнено(Объект.ОтборКонтрагент) Тогда
		МассивСвязей.Добавить(Новый СвязьПараметраВыбора("Отбор.Контрагент", "Объект.ОтборКонтрагент", РежимИзмененияСвязанногоЗначения.Очищать));
	КонецЕсли;
	
	Элементы.ОтборДоговор.СвязиПараметровВыбора = Новый ФиксированныйМассив(МассивСвязей);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораБригады()
	
	Если ЗначениеЗаполнено(Объект.ОтборБригада) И Объект.ОтборБригада.Подразделение <> Объект.ОтборПодразделение Тогда
		Объект.ОтборБригада = Справочники.торо_РемонтныеБригады.ПустаяСсылка();		
	КонецЕсли; 
	
	МассивСвязей = Новый Массив;
	
	Если ЗначениеЗаполнено(Объект.ОтборПодразделение) Тогда
		МассивСвязей.Добавить(Новый СвязьПараметраВыбора("Отбор.Подразделение", "Объект.ОтборПодразделение", РежимИзмененияСвязанногоЗначения.Очищать));
	КонецЕсли;
	
	Элементы.ОтборБригада.СвязиПараметровВыбора = Новый ФиксированныйМассив(МассивСвязей);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВводДокументаНаОсновании(ТипВводимогоДокумента, ПредставлениеДокументаВВинПадеже)

	МассивДанныхСтрок = ПолучитьМассивВыделенныхСтрокРемонтов(Элементы.Ремонты);
	Если МассивДанныхСтрок.Количество() = 0 Тогда
		ТекстСообщения = НСтр("es='¡Escojan la reparación!';ru='Выберите ремонт!';en='Choose a repair!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТаблицуВводаНаОсновании();
	
	МассивРемонтовППР = Новый Массив;
	Для каждого Строка Из МассивДанныхСтрок Цикл
		Если ТипЗнч(Строка.Документ) = Тип("ДокументСсылка.торо_ПланГрафикРемонта") Тогда
			МассивРемонтовППР.Добавить(Строка.ID_Ремонта);
		КонецЕсли;
	КонецЦикла;
	
	СоответствиеКорректировокППР = Новый Соответствие;
	Если МассивРемонтовППР.Количество() > 0 Тогда
		ЗаполнитьСоответствиеКорректировокППР(МассивРемонтовППР, СоответствиеКорректировокППР);
	КонецЕсли;
	
	СоответствиеРемонтовИОснований = Новый Соответствие;
	
	// Добавление возможных оснований.
	Для каждого Строка Из МассивДанныхСтрок Цикл
		Если ПроверитьВводНаОсновании(Строка.ТипДокумента, ТипВводимогоДокумента) Тогда
			КорректировкаППР = СоответствиеКорректировокППР.Получить(Строка.ID_Ремонта);
			Если КорректировкаППР = Неопределено Тогда
				ВставитьЗначениеВСписокВСоответствии(СоответствиеРемонтовИОснований, Строка.ID_Ремонта, Строка.Документ);
			Иначе
				ВставитьЗначениеВСписокВСоответствии(СоответствиеРемонтовИОснований, Строка.ID_Ремонта, КорректировкаППР);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
	Если НЕ ДляВсехРемонтовЕстьОснование(МассивДанныхСтрок, СоответствиеРемонтовИОснований, ПредставлениеДокументаВВинПадеже) Тогда
		Возврат;
	КонецЕсли;

	Если СоответствиеРемонтовИОснований.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВызватьОбработчикОповещения",ЭтаФорма, Новый Структура("ИмяСобытия, Источник", "СозданДокументЧерезРМТехСпец", Тип("ДокументСсылка."+ТипВводимогоДокумента)));
	
	СоответствиеИДДокументам = Новый Соответствие;
	Для каждого КлючИЗначение Из СоответствиеРемонтовИОснований Цикл
		Если КлючИЗначение.Значение.Количество() > 0 Тогда
			СоответствиеИДДокументам.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение[0]);
		КонецЕсли;
	КонецЦикла; 
	
	СоздатьДокументИОткрытьФорму("Документ."+ТипВводимогоДокумента+".ФормаОбъекта", СоответствиеИДДокументам, ОписаниеОповещения);
	
КонецПроцедуры
	
&НаКлиенте
Функция ПолучитьМассивВыделенныхСтрокРемонтов(ЭлементыРемонты)
	
	МассивВыделенныхСтрок = Новый Массив;	
	
	Для Каждого НомСтроки Из ЭлементыРемонты.ВыделенныеСтроки Цикл
		Строка = ЭлементыРемонты.ДанныеСтроки(НомСтроки);
		Если НЕ Строка = Неопределено Тогда 
			МассивВыделенныхСтрок.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;	
	
	Возврат МассивВыделенныхСтрок;
		
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуВводаНаОсновании()
	
	ТабНастроек = торо_ЗаполнениеДокументовПовторноеИспользование.ПолучитьТаблицуВводаНаОсновании();
	ВводНаОсновании.Загрузить(ТабНастроек);
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьВводНаОсновании(ДокументОснование, ДокументВводимый)
	
	МассивСтрок = ВводНаОсновании.НайтиСтроки(Новый Структура("ДокументОснование, ДокументВводимый", ДокументОснование, ДокументВводимый));
	
	Если МассивСтрок.Количество() > 0 Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;	
	КонецЕсли;
	
КонецФункции

&НаКлиентеНасервереБезКонтекста
Процедура ВставитьЗначениеВСписокВСоответствии(Соответствие, Ключ, Значение)
	
	ТекущееЗначение = Соответствие[Ключ];
	Если ТекущееЗначение = Неопределено Тогда
		ТекущееЗначение = Новый Массив;
	КонецЕсли;
	
	ТекущееЗначение.Добавить(Значение);
	
	Соответствие.Вставить(Ключ, ТекущееЗначение);	
	
КонецПроцедуры

&НаКлиенте
Функция ДляВсехРемонтовЕстьОснование(МассивДанныхСтрок, СоответствиеРемонтовИОснований, ПредставлениеДокументаДляПользователя)
	
	// Проверим, по всем ли ремонтам нашлось хотя бы одно основание.
	МассивДокументовБезОснований = Новый Массив;
	Для каждого Строка Из МассивДанныхСтрок Цикл
		МассивОснований = СоответствиеРемонтовИОснований[Строка.ID_Ремонта];
		Если МассивОснований = Неопределено И МассивДокументовБезОснований.Найти(Строка.Документ) = Неопределено Тогда
			МассивДокументовБезОснований.Добавить(Строка.Документ);                                
		КонецЕсли;
	КонецЦикла; 
	
	Если МассивДокументовБезОснований.Количество() > 0 Тогда
		Если МассивДанныхСтрок.Количество() = 1 Тогда
			ШаблонСообщения = НСтр("es='Настроки de la introducción a la razón prohíben introducir %1 en razon del documento escogido. "
"El ajuste y la administración-> el Ajuste de los parámetros del subsistema ТОиР-> Intrerfeys y la introducción de los documentos-> el Ajuste de la introducción a la razón.';ru='Настроки ввода на основании запрещают ввести %1 на основании выбранного документа."
"Настройка и администрирование -> Настройка параметров подсистемы ТОиР -> Интрерфейс и ввод документов -> Настройка ввода на основании.';en='Based on input settings prohibit entering%1 based on the selected document."
"Setting up and administration -> Setting the parameters of the MRO subsystem -> Interface and document input -> Setting input based on.'");
		ИначеЕсли МассивДанныхСтрок.Количество() > 1 Тогда
			ШаблонСообщения = НСтр("es='Настроки de la introducción a la razón prohíben introducir %1 en razon de algunos documentos escogidos. "
"El ajuste y la administración-> el Ajuste de los parámetros del subsistema ТОиР-> Intrerfeys y la introducción de los documentos-> el Ajuste de la introducción a la razón.';ru='Настроки ввода на основании запрещают ввести %1 на основании некоторых выбранных документов."
"Настройка и администрирование -> Настройка параметров подсистемы ТОиР -> Интрерфейс и ввод документов -> Настройка ввода на основании.';en='Based on input settings prohibit entering%1 based on some selected documents."
"Setting up and administration -> Setting the parameters of the MRO subsystem -> Interface and document input -> Setting input based on.'");
		КонецЕсли;
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ПредставлениеДокументаДляПользователя);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура СоздатьДокументИОткрытьФорму(ИмяФормы, СоответствиеИДДокументам, ОписаниеОповещения = Неопределено)

	ОткрытьФорму(ИмяФормы, Новый Структура("Основание",СоответствиеИДДокументам),ЭтаФорма,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВызватьОбработчикОповещения(Результат, ДопПараметры) Экспорт
	
	ОбработкаОповещения(ДопПараметры.ИмяСобытия, Неопределено, ДопПараметры.Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗаголовокСвернутойГруппы()
	
	// >> [Деснол] [Ушаков А.Д.] [26.09.2019] 
	ЗаголовокСвернутойГруппы = НСтр("es='Mostrar información sobre';ru='Выводить информацию по ';en='Display information on '");
	// << [Деснол] [Ушаков А.Д.] [26.09.2019] 
	
	ПерваяЗапись = Истина;
	Если Объект.ОтборППР Тогда
		// >> [Деснол] [Ушаков А.Д.] [26.09.2019] 
		ЗаголовокСвернутойГруппы = ЗаголовокСвернутойГруппы + НСтр("es='horarios de reparación';ru='план графикам ремонта';en='plan-schedule repair'");
		// << [Деснол] [Ушаков А.Д.] [26.09.2019] 
		ПерваяЗапись = Ложь;
	КонецЕсли;
	
	Если Объект.ОтборВО Тогда
		Если не ПерваяЗапись тогда
			ЗаголовокСвернутойГруппы = ЗаголовокСвернутойГруппы + ", ";
		КонецЕсли;
		//
		// >> [Деснол] [Ушаков А.Д.] [26.09.2019] 
		ЗаголовокСвернутойГруппы = ЗаголовокСвернутойГруппы + НСтр("es='motivos externos';ru='внешним основаниям';en='external grounds'");
		// << [Деснол] [Ушаков А.Д.] [26.09.2019] 
		ПерваяЗапись = Ложь;
	КонецЕсли;
	
	Если Объект.ОтборВД Тогда
		Если не ПерваяЗапись тогда
			ЗаголовокСвернутойГруппы = ЗаголовокСвернутойГруппы + ", ";
		КонецЕсли;
		// >> [Деснол] [Ушаков А.Д.] [26.09.2019] 
		ЗаголовокСвернутойГруппы = ЗаголовокСвернутойГруппы + НСтр("es='defectos detectados';ru='выявленным дефектам';en='revealed defect'");
		// << [Деснол] [Ушаков А.Д.] [26.09.2019] 
		ПерваяЗапись = Ложь;
	КонецЕсли;
	
	Элементы.ГруппаОтборыОснования.ЗаголовокСвернутогоОтображения = ЗаголовокСвернутойГруппы;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьСоответствиеКорректировокППР(МассивРемонтовППР, СоответствиеКорректировокППР)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ID КАК ID,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Регистратор КАК Документ
	|ИЗ
	|	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(
	|			,
	|			ID В (&МассивID)
	|				И Регистратор ССЫЛКА Документ.торо_ПланГрафикРемонта) КАК торо_ПлановыеРемонтныеРаботыСрезПоследних";
	
	Запрос.УстановитьПараметр("МассивID", МассивРемонтовППР);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СоответствиеКорректировокППР.Вставить(Выборка.ID, Выборка.Документ);
	КонецЦикла;
	
КонецПроцедуры

// >> [Деснол] [Ушаков А.Д.] [03.10.2019] 
&НаСервере
Процедура дс_ЛокализоватьЗаголовкиКолонокРемонтов()
	ЗаголовкиКолонок = Новый Соответствие;
	
	ЗаголовкиКолонок.Вставить("РемонтыВидРемонта", 		НСтр("es='El tipo de la reparación';ru='Вид ремонта';en='Type of repair'"));
	ЗаголовкиКолонок.Вставить("РемонтыДатаНачала", 		НСтр("es='Fecha de inicio';ru='Дата начала';en='Start date'"));
	ЗаголовкиКолонок.Вставить("РемонтыСтатусРемонта", 	НСтр("es='Estado de reparación';ru='Статус ремонта';en='Repair status'"));
	ЗаголовкиКолонок.Вставить("РемонтыИсполнитель", 	НСтр("es='Fecha de inicio';ru='Дата начала';en='Start date'"));
	ЗаголовкиКолонок.Вставить("РемонтыОписание", 		НСтр("es='La descripción';ru='Описание';en='Description'"));
	
	Для каждого ЗаголовокКолонки Из ЗаголовкиКолонок Цикл
		Элементы[ЗаголовокКолонки.Ключ].Заголовок = ЗаголовокКолонки.Значение;
	КонецЦикла; 
КонецПроцедуры
// << [Деснол] [Ушаков А.Д.] [03.10.2019] 

#КонецОбласти
