#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает квалификацию по организации, подразделению и должности,
//
// Параметры:
//	- Организация - СправочникСсылка.Организации - Организация.
//	- Подразделение - СправочникСсылка.СтруктураПредприятия - Подразделение.
//	- Должность - СправочникСсылка.Должности - Должность.
//
// Возвращаемое значение:
// СправочникСсылка.торо_КвалификацииРемонтногоПерсонала
//
Функция КвалификацияДолжности(Организация, Подразделение, Должность) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса_КвалификацияДолжности();
			
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Должность", Должность);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();

	Возврат ВыборкаДетальныеЗаписи.Квалификация;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапроса_КвалификацияДолжности() 
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Квалификации.Квалификация КАК Квалификация
		|ИЗ
		|	РегистрСведений.гкс_СоответствияДолжностейИКвалификаций.СрезПоследних(
		|			,
		|			Организация = &Организация
		|				И Подразделение = &Подразделение
		|				И Должность = &Должность) КАК Квалификации";
	
	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти

#КонецЕсли