#Область ОписаниеПеременных

&НаКлиенте
Перем СтароеЗначениеРемонтыДатаНачала;
&НаКлиенте
Перем СтароеЗначениеРемонтыДатаОкончания; 
&НаКлиенте
Перем СтароеЗначениеОрганизация;


#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура гкс_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)   
	
	ДобавитьИзменитьРеквизитыФормы(); 
	ДобавитьИзменитьЭлементыФормы(); 
	УстановитьВидимостьДоступностьЭлементовФормы();
	ДобавитьИзменитьУсловноеОформлениеЭлемнетовФормы();
	// Гкс+[TOIR20-669] Оселедько В.С. от 31.07.2025. Добавлено:{
	Если Параметры.Свойство("ВремяНачалаОткрытияФормы") Тогда
		ЭтотОбъект.гкс_ВремяНачалаЗамера = Параметры.ВремяНачалаОткрытияФормы;		
	КонецЕсли;
	// Гкс+[TOIR20-669] Оселедько В.С.
	// гкс+ [Релиз 1] Куст 17.03.2020
	дс_ЛокализоватьЗаголовкиКолонок();
	дс_ЛокализоватьСписокРемонтов();
	// гкс- [Релиз 1] Куст 17.03.2020
	// гкс+ [Часовые пояса] Куст 14.04.2020
	Сдвиг = Час(ТекущаяДатаСеанса()) - Час(ТекущаяДата());
	ТекстыЗамены = Новый Массив();
	ТекстыЗамены.Добавить(Новый Структура("До, После", "торо_АктуальныеПлановыеДатыРемонтов.ДатаОкончания",
		" ДобавитьКДате(торо_АктуальныеПлановЫеДатыРемонтов.ДатаОкончания, Час, " + Сдвиг + ")"));
	ТекстыЗамены.Добавить(Новый Структура("До, После", "ИНАЧЕ торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала",
		" Иначе ДобавитьКДате(торо_АктуальнЫеПлановыеДатыРемонтов.ДатаНачала, Час, " + Сдвиг + ")"));
	ТекстыЗамены.Добавить(Новый Структура("До, После", "торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала,",
		" ДобавитьКДате(торо_АктуальныеПлановЫеДатыРемонтов.ДатаНачала, Час, " + Сдвиг + "),"));
	ТекстыЗамены.Добавить(Новый Структура("До, После", "И торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала",
		" И ДобавитьКДате(торо_АктуальныеПлановЫеДатыРемонтов.ДатаНачала, Час, " + Сдвиг + ")"));
	ТекстыЗамены.Добавить(Новый Структура("До, После", "ТОГДА торо_ВыявленныеДефекты.Период",
		" Тогда ДобавитьКДате(торо_ВыявленнЫеДефекты.Период, Час, " + Сдвиг + ")"));
	ТекстыЗамены.Добавить(Новый Структура("До, После", "торо_ПланГрафикППР.Период,",
		" ДобавитьКДате(торо_ПланГрафИкППР.Период, Час, " + Сдвиг + "),"));
	ТекстыЗамены.Добавить(Новый Структура("До, После", "торо_ВыявленныеДефекты.Период,",
		" ДобавитьКДате(торо_ВыявленныеДефектЫ.Период, Час, " + Сдвиг + "),"));
	ТекстыЗамены.Добавить(Новый Структура("До, После", "торо_ПредписанияСрезПоследних.Период КАК Период,",
		" ДобавитьКДате(торо_ПредписанияСрезПоследнИх.Период, Час, " + Сдвиг + ") КАК Период,"));
	Ремонты.ТекстЗапроса = гкс_ЧасовыеПоясаВызовСервера.ИзменитьТекстЗапросаФормыСписка(
		Ремонты.ТекстЗапроса, ТекстыЗамены);
	// гкс- [Часовые пояса] Куст 14.04.2020   
		
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПриОткрытии")
Процедура гкс_ПриОткрытии(Отказ)
	
	УстановитьПараметрыДинамическогоСписка();
	
	#Удаление
	Если НЕ ЗначениеЗаполнено(сзСтатусОР) Тогда
		сзСтатусОР.Добавить("Зарегистрирован (выявленный дефект)", "Зарегистрирован (выявленный дефект)");
		сзСтатусОР.Добавить("Запланировано устранение (выявленный дефект)", "Запланировано устранение (выявленный дефект)");
		сзСтатусОР.Добавить("Устраняется (выявленный дефект)", "Устраняется (выявленный дефект)");
		сзСтатусОР.Добавить("Устранен (выявленный дефект)", "Устранен (выявленный дефект)");

		сзСтатусОР.Добавить("Зарегистрирован (внешнее основание)", "Зарегистрирован (внешнее основание)");
		сзСтатусОР.Добавить("Запланировано устранение (внешнее основание)", "Запланировано устранение (внешнее основание)");
		сзСтатусОР.Добавить("Устраняется (внешнее основание)", "Устраняется (внешнее основание)");
		сзСтатусОР.Добавить("Устранен (внешнее основание)", "Устранен (внешнее основание)");

		сзСтатусОР.Добавить("Введен ППР (план-график ППР)", "Введен ППР (план-график ППР)");
		сзСтатусОР.Добавить("Запланировано выполнение (план-график ППР)", "Запланировано выполнение (план-график ППР)");
		сзСтатусОР.Добавить("Выполняется (план-график ППР)", "Выполняется (план-график ППР)");
		сзСтатусОР.Добавить("Выполнен (план-график ППР)", "Выполнен (план-график ППР)");
	КонецЕсли;

	ЗаполнитьСписокВыбораОтбораПоСтатусуДокумента();

	флОстановочныеПриИзменении(Элементы.флОстановочные);
	ИспользоватьОтборПоСтатусуПриИзменении(Элементы.ИспользоватьОтборПоСтатусу);
	ИспользоватьОтборПоСтатусуДокументаПриИзменении(Элементы.ИспользоватьОтборПоСтатусуДокумента);

	Элементы.ФормаОткрытьЗакрытиеЗаявокИРемонтов.Доступность = Ложь;
	#КонецУдаления
	#Вставка     
	СтароеЗначениеРемонтыДатаНачала = ЭтотОбъект["гкс_ПериодОтборДатРемонта"].ДатаНачала;
	СтароеЗначениеРемонтыДатаОкончания = ЭтотОбъект["гкс_ПериодОтборДатРемонта"].ДатаОкончания;  
	СтароеЗначениеОрганизация = Объект.Организация;
	#КонецВставки


КонецПроцедуры

#КонецОбласти                   

#Область ОбработчикиСобытийЭлементовШапкиФормы 

&НаКлиенте
&ИзменениеИКонтроль("ОрганизацияПриИзменении")
Процедура гкс_ОрганизацияПриИзменении(Элемент)
	
	#Вставка                                  
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда 
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Отбор по организации обязательно должен быть заполнен'"));
		Объект.Организация = СтароеЗначениеОрганизация;
		
		Возврат;
		
	КонецЕсли;
	
	#КонецВставки
	УстановитьПараметрыДинамическогоСпискаКлиент();
	#Вставка     
	СтароеЗначениеОрганизация = Объект.Организация;
	#КонецВставки

КонецПроцедуры

#Область ПодключаемыеОбработчики

&НаКлиенте
Процедура гкс_ПериодОтборДатРемонтаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ЭтотОбъект["гкс_ПериодОтборДатРемонта"].ДатаНачала)
		ИЛИ ЗначениеЗаполнено(ЭтотОбъект["гкс_ПериодОтборДатРемонта"].ДатаОкончания) Тогда
			
		Ремонты.Параметры.УстановитьЗначениеПараметра("ДатаНачалаРемонта" , 
			ЭтотОбъект["гкс_ПериодОтборДатРемонта"].ДатаНачала);
		Ремонты.Параметры.УстановитьЗначениеПараметра("ДатаОкончанияРемонта" , 
			ЭтотОбъект["гкс_ПериодОтборДатРемонта"].ДатаОкончания);
		
	Иначе
			
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Период отбора ремонтов должен быть обязательно заполнен'"));
		
		ЭтотОбъект["гкс_ПериодОтборДатРемонта"].ДатаНачала = СтароеЗначениеРемонтыДатаНачала;
		ЭтотОбъект["гкс_ПериодОтборДатРемонта"].ДатаОкончания = СтароеЗначениеРемонтыДатаОкончания; 

		Возврат;
		
	КонецЕсли;
	
	СтароеЗначениеРемонтыДатаНачала = ЭтотОбъект["гкс_ПериодОтборДатРемонта"].ДатаНачала;
	СтароеЗначениеРемонтыДатаОкончания = ЭтотОбъект["гкс_ПериодОтборДатРемонта"].ДатаОкончания; 
	
КонецПроцедуры   

&НаКлиенте
Процедура гкс_ОтборПВПриИзменении(Элемент)
	УстановитьПараметрыДинамическогоСпискаКлиент();
КонецПроцедуры

&НаКлиенте
Процедура гкс_ОтборПВПриИзменении2(Элемент)
	Если ЭтотОбъект["гкс_ИспользоватьОтборПодразделениеВладелец"] = Истина Тогда 
		УстановитьПараметрыДинамическогоСпискаКлиент();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемыйгкс_ЗавершенныеПриИзменении(Элемент)
	
	Ремонты.Параметры.УстановитьЗначениеПараметра("Завершенные", Объект.Завершенные);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти   

#Область СлужебныеПроцедурыИФункции

#Область ЭлементыФормы   

&НаСервере
Процедура УстановитьВидимостьДоступностьЭлементовФормы()
	
	Элементы.ФормаОткрытьЗакрытиеЗаявокИРемонтов.Доступность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьИзменитьУсловноеОформлениеЭлемнетовФормы()
	
	Элементы.Организация.ЦветФона = WebЦвета.Желтый;
	
	гкс_УстановитьУсловноеОформлениеНаПриоритетОР();
		
КонецПроцедуры

&НаСервере
Процедура ДобавитьИзменитьЭлементыФормы()

	НЭлем = Элементы.Добавить("гкс_СимптомДефекта", Тип("ПолеФормы"), Элементы.Ремонты);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Ремонты.гкс_СимптомДефекта";
	НЭлем.Заголовок = НСтр("ru='Симптом дефекта';en='Симптом дефекта'");
	
	НЭлем = Элементы.Добавить("дс_ДефектОписание", Тип("ПолеФормы"), Элементы.Ремонты);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Ремонты.ДефектОписание";
	НЭлем.Заголовок = НСтр("ru='Описание дефекта';en='A description of the defect'");
		
	НЭлем = Элементы.Добавить("гкс_СрочностьВоздействия", Тип("ПолеФормы"), Элементы.Ремонты);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Ремонты.гкс_СрочностьВоздействия";
	НЭлем.Заголовок = НСтр("ru='Срочность воздействия';
							|en='Urgency of impact';
							|es='Urgencia de impacto'");

	НЭлем = Элементы.Добавить("Ремонтыгкс_РаботыВыполнены", Тип("ПолеФормы"), Элементы.Ремонты);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Ремонты.гкс_РаботыВыполнены";
	НЭлем.Заголовок = НСтр("ru='А';
							|en='A';
							|es='A'");
	НЭлем.Подсказка = НСтр("ru='Требуется оформить акт приемки';
							|en='A equipment acceptance certificate is required';
							|es='A'");
	
	НГруп = Элементы.Добавить("гкс_ГруппаОтборПВ", Тип("ГруппаФормы"), Элементы.Группа2);
	НГруп.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НГруп.группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НГруп.ОтображатьЗаголовок = Ложь;
	
	Элементы.Переместить(Элементы["гкс_ГруппаОтборПВ"], Элементы.Группа2, Элементы.ГруппаСтатусОР);
	
	НЭлем = Элементы.Добавить("гкс_ИспользоватьОтборПодразделениеВладелец", Тип("ПолеФормы"), Элементы["гкс_ГруппаОтборПВ"]);
	НЭлем.Вид = ВидПоляФормы.ПолеФлажка;
	НЭлем.ПутьКДанным = "гкс_ИспользоватьОтборПодразделениеВладелец";
	НЭлем.УстановитьДействие("ПриИзменении", "гкс_ОтборПВПриИзменении");
	НЭлем.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	НЭлем.Заголовок = НСтр("ru='Подразделение владелец';
	|en='Owner Subdivision'");
	
	НЭлем = Элементы.Добавить("гкс_ОтборПодразделениеВладелец", Тип("ПолеФормы"), Элементы["гкс_ГруппаОтборПВ"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "гкс_ОтборПодразделениеВладелец";
	НЭлем.УстановитьДействие("ПриИзменении", "гкс_ОтборПВПриИзменении2");
	НЭлем.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	
	НоваяГруппаФормы = Элементы.Добавить("гкс_ГруппаОрганизацияПодразделениеВладелец", Тип("ГруппаФормы"), Элементы.Группа2);
	НоваяГруппаФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппаФормы.группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	НоваяГруппаФормы.ОтображатьЗаголовок = Ложь;
	
	Элементы.Переместить(Элементы.Организация, НоваяГруппаФормы); 
	Элементы.Переместить(Элементы["гкс_ГруппаОтборПВ"], НоваяГруппаФормы);
	
	НоваяГруппаФормы = Элементы.Добавить("гкс_ГруппаСтатусРемонтаДокумента", Тип("ГруппаФормы"), Элементы.Группа2);
	НоваяГруппаФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппаФормы.группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	НоваяГруппаФормы.ОтображатьЗаголовок = Ложь;
	
	Элементы.Переместить(Элементы.ГруппаСтатусОР, НоваяГруппаФормы); 
	Элементы.Переместить(Элементы.ГруппаСтатусДокумента, НоваяГруппаФормы);
	
	НоваяГруппаВладелец = Элементы.Добавить("гкс_ГруппаПодразделениеСрочностьВоздействия", Тип("ГруппаФормы"), Элементы.Группа2);
	НоваяГруппаВладелец.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппаВладелец.группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	НоваяГруппаВладелец.ОтображатьЗаголовок = Ложь;
	
	Элементы.Переместить(Элементы.ГруппаПодразделение, НоваяГруппаВладелец); 
	Элементы.ИспользоватьОтборПоИсполнителю.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
	НоваяГруппаФормы = Элементы.Добавить("гкс_ГруппаОтборСрочностьВоздействия", Тип("ГруппаФормы"), НоваяГруппаВладелец);
	НоваяГруппаФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппаФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НоваяГруппаФормы.Отображение = ОтображениеОбычнойГруппы.СильноеВыделение;
	НоваяГруппаФормы.Объединенная	= Истина;
	НоваяГруппаФормы.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
	НоваяГруппаФормы.ОтображатьЗаголовок = Ложь;
	
	НЭлем = Элементы.Добавить("гкс_ИспользоватьОтборСрочностьВоздействия", Тип("ПолеФормы"), НоваяГруппаФормы);
	НЭлем.Вид = ВидПоляФормы.ПолеФлажка;
	НЭлем.ПутьКДанным = "гкс_ИспользоватьОтборСрочностьВоздействия";
	НЭлем.УстановитьДействие("ПриИзменении", "гкс_ИспользоватьОтборСрочностьВоздействияПриИзменении");
	НЭлем.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	НЭлем.Заголовок = НСтр("ru='Срочность воздействия';
							|en='Urgency of impact';
							|es='Urgencia de impacto'");
	
	НЭлем = Элементы.Добавить("гкс_ОтборСрочностьВоздействия", Тип("ПолеФормы"), НоваяГруппаФормы);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "гкс_ОтборСрочностьВоздействия";
	НЭлем.УстановитьДействие("ПриИзменении", "гкс_ОтборСрочностьВоздействияПриИзменении");
	НЭлем.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;

	НЭлем = Элементы.Добавить("гкс_РаботыВыполнены", Тип("ПолеФормы"), Элементы.АктыНаРемонт);
	НЭлем.Вид = ВидПоляФормы.ПолеФлажка;
	НЭлем.ПутьКДанным = "АктыНаРемонт.гкс_РаботыВыполнены";
	
	НЭлем = Элементы.Добавить("гкс_Статус", Тип("ПолеФормы"), Элементы.АктыНаРемонт);
	НЭлем.Вид = ВидПоляФормы.ПолеФлажка;
	НЭлем.ПутьКДанным = "АктыНаРемонт.гкс_Статус";
	НЭлем.Заголовок = "Статус согласования";
	
	НоваяГруппаФормы = Элементы.Добавить("гкс_ГруппаАктПриемки", Тип("ГруппаФормы"), Элементы.ГруппаАктыПоРемонту);
	НоваяГруппаФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппаФормы.ОтображатьЗаголовок = Ложь;
	
	НоваяКомандаФормы = Команды.Добавить("гкс_СоздатьАктПриемки");
	НоваяКомандаФормы.Действие = "гкс_СоздатьАктПриемки";
	НоваяКомандаФормы.Заголовок = НСтр("ru='Добавить акт приемки';
							|en='Add equipment acceptance certificate';
							|es='Agregar el acta de la recepción de la maquinaria'");
	
	НоваяКомандаФормы = Команды.Добавить("гкс_ТекущийАкт");
	НоваяКомандаФормы.Действие = "гкс_ТекущийАкт";
	
	НоваяКнопкаФормы = Элементы.Добавить("гкс_СоздатьАктПриемкиКнопка", Тип("КнопкаФормы"), Элементы.гкс_ГруппаАктПриемки);
	НоваяКнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НоваяКнопкаФормы.ИмяКоманды = "гкс_СоздатьАктПриемки";
	
	НовыйЭлементФормы = Элементы.Добавить("гкс_ТекущийАктКнопка", Тип("КнопкаФормы"), Элементы.гкс_ГруппаАктПриемки);
	НовыйЭлементФормы.Вид = ВидКнопкиФормы.Гиперссылка;
	НовыйЭлементФормы.ИмяКоманды = "гкс_ТекущийАкт";
	НовыйЭлементФормы.Заголовок = "Нет акта";
	
	НовыйЭлементФормы = Элементы.Добавить("гкс_Завершенные", Тип("ПолеФормы"), Элементы.ГруппаОстановочные); 
	НовыйЭлементФормы.ПутьКДанным = "Объект.Завершенные"; 
	НовыйЭлементФормы.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлементФормы.Заголовок = "Завершенные";
	НовыйЭлементФормы.ЦветФона = WebЦвета.Желтый;   
	НовыйЭлементФормы.УстановитьДействие("ПриИзменении", "Подключаемыйгкс_ЗавершенныеПриИзменении");

	НовыйЭлементФормы = Элементы.Добавить("гкс_ПериодОтборДатРемонтаДатаНачала", Тип("ПолеФормы"), Элементы.ГруппаОстановочные); 
	НовыйЭлементФормы.ПутьКДанным = "гкс_ПериодОтборДатРемонта.ДатаНачала"; 
	НовыйЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлементФормы.Заголовок = "Ремонты с";
	НовыйЭлементФормы.ЦветФона = WebЦвета.Желтый; 
	НовыйЭлементФормы.УстановитьДействие("ПриИзменении", "гкс_ПериодОтборДатРемонтаПриИзменении");  
	
	НовыйЭлементФормы = Элементы.Добавить("гкс_ПериодОтборДатРемонтаДатаОкончания", Тип("ПолеФормы"), Элементы.ГруппаОстановочные); 
	НовыйЭлементФормы.ПутьКДанным = "гкс_ПериодОтборДатРемонта.ДатаОкончания"; 
	НовыйЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлементФормы.Заголовок = "по";
	НовыйЭлементФормы.ЦветФона = WebЦвета.Желтый;   
	НовыйЭлементФормы.УстановитьДействие("ПриИзменении", "гкс_ПериодОтборДатРемонтаПриИзменении");     
		
КонецПроцедуры

#КонецОбласти

#Область ИнициализацияРеквизитовФормы

&НаСервере
Процедура ДобавитьИзменитьРеквизитыФормы()  
	
	ДобавитьНовыеРеквизиты();
	ИнициализироватьНовыйРеквизиты();
	ИнициализироватьСписокСтатусовОбъектовРемонта();
	ПодменитьЗапросИНастроитьДинамическийСписокРемонты(); 
	
	// гкс+ [10.23] Деснол 05.08.2024
	//|	ВТОтборИД.ПодрПлановыхДат КАК ПодрПлановыхДат,
	НЭлем = Элементы.Добавить("ПодрПлановыхДат", Тип("ПолеФормы"), Элементы.Ремонты);
	НЭлем.Заголовок = "Подразделение документа плановых дат";
	НЭлем.ПутьКДанным = "Ремонты.ПодрПлановыхДат";
	НЭлем.ТолькоПросмотр = Истина;
	// гкс- [10.23] Деснол 05.08.2024
КонецПроцедуры                       

Процедура ИнициализироватьНовыйРеквизиты()

	ЭтотОбъект["гкс_ПериодОтборДатРемонта"].ДатаНачала = НачалоМесяца(ТекущаяДатаСеанса());
    ЭтотОбъект["гкс_ПериодОтборДатРемонта"].ДатаОкончания = КонецМесяца(ТекущаяДатаСеанса());

КонецПроцедуры

&НаСервере
Процедура ИнициализироватьСписокСтатусовОбъектовРемонта()
	
	сзСтатусОР.Добавить("Зарегистрирован (выявленный дефект)", "Зарегистрирован (выявленный дефект)");
	сзСтатусОР.Добавить("Запланировано устранение (выявленный дефект)", "Запланировано устранение (выявленный дефект)");
	сзСтатусОР.Добавить("Устраняется (выявленный дефект)", "Устраняется (выявленный дефект)");
	сзСтатусОР.Добавить("Устранен (выявленный дефект)", "Устранен (выявленный дефект)");
	
	сзСтатусОР.Добавить("Зарегистрирован (внешнее основание)", "Зарегистрирован (внешнее основание)");
	сзСтатусОР.Добавить("Запланировано устранение (внешнее основание)", "Запланировано устранение (внешнее основание)");
	сзСтатусОР.Добавить("Устраняется (внешнее основание)", "Устраняется (внешнее основание)");
	сзСтатусОР.Добавить("Устранен (внешнее основание)", "Устранен (внешнее основание)");
	
	сзСтатусОР.Добавить("Введен ППР (план-график ППР)", "Введен ППР (план-график ППР)");
	сзСтатусОР.Добавить("Запланировано выполнение (план-график ППР)", "Запланировано выполнение (план-график ППР)");
	сзСтатусОР.Добавить("Выполняется (план-график ППР)", "Выполняется (план-график ППР)");
	сзСтатусОР.Добавить("Выполнен (план-график ППР)", "Выполнен (план-график ППР)");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьНовыеРеквизиты()
	
	МассивРеквизитов = Новый Массив();
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ОтборПодразделениеВладелец", Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ИспользоватьОтборПодразделениеВладелец", Новый ОписаниеТипов("Булево")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ОтборСрочностьВоздействия", Новый ОписаниеТипов("ПеречислениеСсылка.гкс_СрочностьВоздействия")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ИспользоватьОтборСрочностьВоздействия", Новый ОписаниеТипов("Булево")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ТекущийАктПриемки", Новый ОписаниеТипов("ДокументСсылка.торо_АктПриемкиОборудования")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ТекущийИД", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(36))));
	
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ПериодОтборДатРемонта", Новый ОписаниеТипов("СтандартныйПериод")));
	// Гкс+[TOIR20-669] Оселедько В.С. от 31.07.2025. Добавлено:{
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ВремяНачалаЗамера", Новый ОписаниеТипов("Число",,,,Новый КвалификаторыЧисла(15))));
	// Гкс+[TOIR20-669]
	ИзменитьРеквизиты(МассивРеквизитов);
	
КонецПроцедуры

&НаСервере
Процедура ПодменитьЗапросИНастроитьДинамическийСписокРемонты()
	
	Ремонты.ТекстЗапроса = ТекстПодменитьЗапросИНастроитьДинамическийСписокРемонты();  
	
	ПараметрыРемонтов = Ремонты.Параметры;
	
	// Возможна просадка по производитеьности - отбор фиксированный по организации не снимать при открытии
	ПараметрыРемонтов.УстановитьЗначениеПараметра("ПоВсемОрганизациям" , Ложь);
	
	ПараметрыРемонтов.УстановитьЗначениеПараметра("гкс_ИспользоватьСрочностьВоздействия" , Ложь);
	ПараметрыРемонтов.УстановитьЗначениеПараметра("гкс_СрочностьВоздействия" , Неопределено);

	ПараметрыРемонтов.УстановитьЗначениеПараметра("ДатаНачалаРемонта" , ЭтотОбъект["гкс_ПериодОтборДатРемонта"].ДатаНачала);
	ПараметрыРемонтов.УстановитьЗначениеПараметра("ДатаОкончанияРемонта" , ЭтотОбъект["гкс_ПериодОтборДатРемонта"].ДатаОкончания);
	ПараметрыРемонтов.УстановитьЗначениеПараметра("гкс_ИспользоватьПодразделениеВладелец" , Ложь);
	ПараметрыРемонтов.УстановитьЗначениеПараметра("гкс_ПодразделениеВладелец" , Неопределено);
	
	УстановитьОтборыПоКолонкеСтатусОР(); 
	
	Если ФОИспользоватьСтатусыДокументов Тогда
		Элементы.ОтборПоСтатусуДокумента.Доступность = ИспользоватьОтборПоСтатусуДокумента;
		ОбщегоНазначенияКлиентСервер
		     .УстановитьЭлементОтбора(Ремонты.Отбор, 
			                          "СтатусДокумента", 
			                          ОтборПоСтатусуДокумента,
									  Неопределено,
									  Неопределено,
									  ИспользоватьОтборПоСтатусуДокумента);
	КонецЕсли;   
	
	ОтборПоОстановочномуНаСервере();
	
КонецПроцедуры 

&НаСервере
Процедура ОтборПоОстановочномуНаСервере()

	Если Ремонты.Отбор.Элементы.Количество() > ИндексОтбораПоОстановочным Тогда
		Ремонты.Отбор.Элементы.Удалить(ИндексОтбораПоОстановочным);
	КонецЕсли;

	Если Не флОстановочные Тогда
		ДокументОстановочного = Неопределено;
	КонецЕсли;
	
	Элементы.ДокументОстановочного.Доступность = флОстановочные;
	Если флОстановочные Тогда
		ЭлементОтбора = Ремонты.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("IDОсновного");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
		ЭлементОтбора.Использование = Истина;
		ИндексОтбораПоОстановочным = Ремонты.Отбор.Элементы.Индекс(ЭлементОтбора);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти     

#Область ТекстыЗапросов

&НаСервере
Функция ТекстПодменитьЗапросИНастроитьДинамическийСписокРемонты()	
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтборИДПоДатеНачала.IDРемонта КАК IDРемонта,
	|	ОтборИДПоДатеНачала.ДатаНачала КАК ДатаНачала,
	|	ОтборИДПоДатеНачала.ДатаОкончания КАК ДатаОкончания,
	|	ОтборИДПоДатеНачала.ДокументНачалаЦепочки КАК ДокументНачалаЦепочки,
	|	ОтборИДПоДатеНачала.ОбъектРемонта КАК ОбъектРемонта,
	|	ОтборИДПоДатеНачала.ДокументОснование КАК ДокументОснование
	|ПОМЕСТИТЬ ВТОтборИД_0
	|ИЗ
	|	РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК ОтборИДПоДатеНачала
	|ГДЕ
	|	ОтборИДПоДатеНачала.ДатаНачала МЕЖДУ &ДатаНачалаРемонта И &ДатаОкончанияРемонта
	|	И НЕ ОтборИДПоДатеНачала.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтборИДПоДатеОкончания.IDРемонта,
	|	ОтборИДПоДатеОкончания.ДатаНачала,
	|	ОтборИДПоДатеОкончания.ДатаОкончания,
	|	ОтборИДПоДатеОкончания.ДокументНачалаЦепочки,
	|	ОтборИДПоДатеОкончания.ОбъектРемонта,
	|	ОтборИДПоДатеОкончания.ДокументОснование
	|ИЗ
	|	РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК ОтборИДПоДатеОкончания
	|ГДЕ
	|	ОтборИДПоДатеОкончания.ДатаОкончания МЕЖДУ &ДатаНачалаРемонта И &ДатаОкончанияРемонта
	|	И ОтборИДПоДатеОкончания.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта
	| " + " ; ";
	#Область ДокументыПлановыхДат
	ТекстЗапроса = ТекстЗапроса + " Выбрать
	|	ТЧ.IDРемонта КАК IDРемонта,
	|	ТЧ.ДатаНачала КАК ДатаНачала,
	|	ТЧ.ДатаОкончания КАК ДатаОкончания,
	|	ТЧ.ДокументНачалаЦепочки КАК ДокументНачалаЦепочки,
	|	ТЧ.ОбъектРемонта КАК ОбъектРемонта,
	|	ТЧ.ДокументОснование КАК ДокументОснование,
	|	Док.Подразделение КАК ПодрПлановыхДат
	|ПОМЕСТИТЬ ВТОтборИД
	|ИЗ
	|	ВТОтборИД_0 КАК ТЧ 
	|	внутреннее соединение Документ.торо_ВнешнееОснованиеДляРабот КАК Док
	|	ПО Док.Ссылка = ТЧ.ДокументОснование
	|
	|Объединить
	|
	|Выбрать
	|	ТЧ.IDРемонта КАК IDРемонта,
	|	ТЧ.ДатаНачала КАК ДатаНачала,
	|	ТЧ.ДатаОкончания КАК ДатаОкончания,
	|	ТЧ.ДокументНачалаЦепочки КАК ДокументНачалаЦепочки,
	|	ТЧ.ОбъектРемонта КАК ОбъектРемонта,
	|	ТЧ.ДокументОснование КАК ДокументОснование,
	|	Док.Подразделение КАК ПодрПлановыхДат
	|ИЗ
	|	ВТОтборИД_0 КАК ТЧ 
	|	внутреннее соединение Документ.торо_ЗаявкаНаРемонт КАК Док
	|	ПО Док.Ссылка = ТЧ.ДокументОснование
	|
	|Объединить
	|
	|Выбрать
	|	ТЧ.IDРемонта КАК IDРемонта,
	|	ТЧ.ДатаНачала КАК ДатаНачала,
	|	ТЧ.ДатаОкончания КАК ДатаОкончания,
	|	ТЧ.ДокументНачалаЦепочки КАК ДокументНачалаЦепочки,
	|	ТЧ.ОбъектРемонта КАК ОбъектРемонта,
	|	ТЧ.ДокументОснование КАК ДокументОснование,
	|	Док.Подразделение КАК ПодрПлановыхДат
	|ИЗ
	|	ВТОтборИД_0 КАК ТЧ 
	|	внутреннее соединение Документ.торо_ПланГрафикРемонта КАК Док
	|	ПО Док.Ссылка = ТЧ.ДокументОснование
	|
	|Объединить
	|
	|Выбрать
	|	ТЧ.IDРемонта КАК IDРемонта,
	|	ТЧ.ДатаНачала КАК ДатаНачала,
	|	ТЧ.ДатаОкончания КАК ДатаОкончания,
	|	ТЧ.ДокументНачалаЦепочки КАК ДокументНачалаЦепочки,
	|	ТЧ.ОбъектРемонта КАК ОбъектРемонта,
	|	ТЧ.ДокументОснование КАК ДокументОснование,
	|	NULL КАК ПодрПлановыхДат
	|ИЗ
	|	ВТОтборИД_0 КАК ТЧ 
	|	внутреннее соединение Документ.торо_ЗакрытиеЗаявокИРемонтов КАК Док
	|	ПО Док.Ссылка = ТЧ.ДокументОснование
	|
	|Объединить
	|
	|Выбрать
	|	ТЧ.IDРемонта КАК IDРемонта,
	|	ТЧ.ДатаНачала КАК ДатаНачала,
	|	ТЧ.ДатаОкончания КАК ДатаОкончания,
	|	ТЧ.ДокументНачалаЦепочки КАК ДокументНачалаЦепочки,
	|	ТЧ.ОбъектРемонта КАК ОбъектРемонта,
	|	ТЧ.ДокументОснование КАК ДокументОснование,
	|	Док.Подразделение КАК ПодрПлановыхДат
	|ИЗ
	|	ВТОтборИД_0 КАК ТЧ 
	|	внутреннее соединение Документ.торо_ГрафикРегламентныхМероприятийТОиР КАК Док
	|	ПО Док.Ссылка = ТЧ.ДокументОснование
	|
	|Объединить
	|
	|Выбрать
	|	ТЧ.IDРемонта КАК IDРемонта,
	|	ТЧ.ДатаНачала КАК ДатаНачала,
	|	ТЧ.ДатаОкончания КАК ДатаОкончания,
	|	ТЧ.ДокументНачалаЦепочки КАК ДокументНачалаЦепочки,
	|	ТЧ.ОбъектРемонта КАК ОбъектРемонта,
	|	ТЧ.ДокументОснование КАК ДокументОснование,
	|	Док.Подразделение КАК ПодрПлановыхДат
	|ИЗ
	|	ВТОтборИД_0 КАК ТЧ 
	|	внутреннее соединение Документ.торо_ВыявленныеДефекты КАК Док
	|	ПО Док.Ссылка = ТЧ.ДокументОснование
	|
	|Объединить
	|
	|Выбрать
	|	ТЧ.IDРемонта КАК IDРемонта,
	|	ТЧ.ДатаНачала КАК ДатаНачала,
	|	ТЧ.ДатаОкончания КАК ДатаОкончания,
	|	ТЧ.ДокументНачалаЦепочки КАК ДокументНачалаЦепочки,
	|	ТЧ.ОбъектРемонта КАК ОбъектРемонта,
	|	ТЧ.ДокументОснование КАК ДокументОснование,
	|	Док.Подразделение КАК ПодрПлановыхДат
	|ИЗ
	|	ВТОтборИД_0 КАК ТЧ 
	|	внутреннее соединение Документ.торо_ОстановочныеРемонты КАК Док
	|	ПО Док.Ссылка = ТЧ.ДокументОснование
	|
	|Объединить
	|
	|Выбрать
	|	ТЧ.IDРемонта КАК IDРемонта,
	|	ТЧ.ДатаНачала КАК ДатаНачала,
	|	ТЧ.ДатаОкончания КАК ДатаОкончания,
	|	ТЧ.ДокументНачалаЦепочки КАК ДокументНачалаЦепочки,
	|	ТЧ.ОбъектРемонта КАК ОбъектРемонта,
	|	ТЧ.ДокументОснование КАК ДокументОснование,
	|	Док.Подразделение КАК ПодрПлановыхДат
	|ИЗ
	|	ВТОтборИД_0 КАК ТЧ 
	|	внутреннее соединение Документ.торо_ПланРаботПодразделения КАК Док
	|	ПО Док.Ссылка = ТЧ.ДокументОснование
	|
	| " + " ; ";
	#КонецОбласти
	ТекстЗапроса = ТекстЗапроса + "
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТОтборИД.IDРемонта КАК IDРемонта,
	|	ВТОтборИД.ДокументНачалаЦепочки КАК ДокументНачалаЦепочки
	|ПОМЕСТИТЬ ВТОтборИДИДокументовНачалаЦепочки
	|ИЗ
	|	ВТОтборИД КАК ВТОтборИД
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументНачалаЦепочки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_АктыПоРемонтам.IDРемонта КАК IDРемонта
	|ПОМЕСТИТЬ ВТАктыПоРемонтамСрез
	|ИЗ
	|	РегистрСведений.торо_АктыПоРемонтам КАК торо_АктыПоРемонтам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборИД КАК ВТОтборИД
	|		ПО торо_АктыПоРемонтам.IDРемонта = ВТОтборИД.IDРемонта
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_АктыПоРемонтам.IDРемонта
	|;
	|Выбрать
	|	торо_ВнешниеОснованияДляРабот.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_ВнешниеОснованияДляРабот.ID КАК ID,
	|	торо_ВнешниеОснованияДляРабот.Период КАК Период,
	|	торо_ВнешниеОснованияДляРабот.Регистратор КАК Регистратор,
	|	торо_ВнешниеОснованияДляРабот.Организация КАК Организация,
	|	торо_ВнешниеОснованияДляРабот.Подразделение КАК Подразделение,
	|	торо_ВнешниеОснованияДляРабот.Описание КАК Описание
	|Поместить ВТ_РегВО
	|ИЗ
	|	РегистрСведений.торо_ВнешниеОснованияДляРабот КАК торо_ВнешниеОснованияДляРабот
	|ГДЕ
	|	&ФОИспользоватьВнешниеОснования
	|	И торо_ВнешниеОснованияДляРабот.Подразделение В(&Исполнитель)
	|	И ВЫБОР
	|			КОГДА НЕ &ПоВсемОрганизациям
	|				ТОГДА торо_ВнешниеОснованияДляРабот.Организация = &Организация
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И торо_ВнешниеОснованияДляРабот.Регистратор Ссылка Документ.торо_ВнешнееОснованиеДляРабот
	|	И (НЕ &гкс_ИспользоватьПодразделениеВладелец
	|			ИЛИ торо_ВнешниеОснованияДляРабот.ОбъектРемонта.Подразделение = &гкс_ПодразделениеВладелец)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	торо_ВнешниеОснованияДляРабот.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_ВнешниеОснованияДляРабот.ID КАК ID,
	|	МАКСИМУМ(торо_ВнешниеОснованияДляРабот.Период) КАК Период,
	|	МАКСИМУМ(торо_ВнешниеОснованияДляРабот.Регистратор) КАК Регистратор
	|ПОМЕСТИТЬ ВТОтборВнешниеОснованияМаксимум
	|ИЗ
	|	ВТ_РегВО КАК торо_ВнешниеОснованияДляРабот
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборИД КАК ВТОтборИД
	|		ПО торо_ВнешниеОснованияДляРабот.ID = ВТОтборИД.IDРемонта
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_ВнешниеОснованияДляРабот.ОбъектРемонта,
	|	торо_ВнешниеОснованияДляРабот.ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТОтборВнешниеОснованияМаксимум.ОбъектРемонта КАК ОбъектРемонта,
	|	ВТОтборВнешниеОснованияМаксимум.ID КАК ID,
	|	ВТОтборВнешниеОснованияМаксимум.Период КАК Период,
	|	торо_ВнешниеОснованияДляРабот.Описание КАК Описание,
	|	торо_ВнешниеОснованияДляРабот.Организация КАК Организация,
	|	торо_ВнешниеОснованияДляРабот.Подразделение КАК Подразделение,
	|	торо_ВнешниеОснованияДляРабот.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТСрезВнешниеОснованияДляРабот_0
	|ИЗ
	|	ВТОтборВнешниеОснованияМаксимум КАК ВТОтборВнешниеОснованияМаксимум
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РегВО КАК торо_ВнешниеОснованияДляРабот
	|		ПО ВТОтборВнешниеОснованияМаксимум.ОбъектРемонта = торо_ВнешниеОснованияДляРабот.ОбъектРемонта
	|			И ВТОтборВнешниеОснованияМаксимум.ID = торо_ВнешниеОснованияДляРабот.ID
	|			И (ВТОтборВнешниеОснованияМаксимум.Период = торо_ВнешниеОснованияДляРабот.Период)
	|			И (ВТОтборВнешниеОснованияМаксимум.Регистратор = торо_ВнешниеОснованияДляРабот.Регистратор)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID,
	|	ОбъектРемонта
	|;
	|ВЫБРАТЬ
	|	ВТ_ВО.ОбъектРемонта КАК ОбъектРемонта,
	|	ВТ_ВО.ID КАК ID,
	|	ВТ_ВО.Период КАК Период,
	|	ВТ_ВО.Описание КАК Описание,
	|	ВТ_ВО.Организация КАК Организация,
	|	ВТ_ВО.Подразделение КАК Подразделение,
	|	ВТ_ВО.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТСрезВнешниеОснованияДляРабот
	|ИЗ ВТСрезВнешниеОснованияДляРабот_0 КАК ВТ_ВО
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОтмененныеРемонты.СрезПоследних КАК торо_ОтмененныеРемонтыСрезПоследних
	|		ПО ВТ_ВО.ID = торо_ОтмененныеРемонтыСрезПоследних.ID
	|Где
	|	торо_ОтмененныеРемонтыСрезПоследних.Регистратор ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID,
	|	ОбъектРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_ПлановыеРемонтныеРаботы.ID КАК ID,
	|	торо_ПлановыеРемонтныеРаботы.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботы.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботы.Организация КАК Организация,
	|	МАКСИМУМ(торо_ПлановыеРемонтныеРаботы.Период) КАК Период,
	|	МАКСИМУМ(торо_ПлановыеРемонтныеРаботы.Регистратор) КАК Регистратор
	|ПОМЕСТИТЬ ВТОтборППРМаксимум
	|ИЗ
	|	РегистрСведений.торо_ПлановыеРемонтныеРаботы КАК торо_ПлановыеРемонтныеРаботы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборИД КАК ВТОтборИД
	|		ПО торо_ПлановыеРемонтныеРаботы.ID = ВТОтборИД.IDРемонта
	|ГДЕ
	|	торо_ПлановыеРемонтныеРаботы.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_ПлановыеРемонтныеРаботы.ID,
	|	торо_ПлановыеРемонтныеРаботы.ОбъектРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботы.ВидРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботы.Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТОтборППРМаксимум.ID КАК ID,
	|	ВТОтборППРМаксимум.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	|	ВТОтборППРМаксимум.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	ВТОтборППРМаксимум.Организация КАК Организация,
	|	ВТОтборППРМаксимум.Период КАК Период,
	|	торо_ПлановыеРемонтныеРаботы.ДатаНачалаРемонтныхРабот КАК ДатаНачалаРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботы.ДатаОкончанияРемонтныхРабот КАК ДатаОкончанияРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботы.Исполнитель КАК Исполнитель,
	|	торо_ПлановыеРемонтныеРаботы.СпособВыполнения КАК СпособВыполнения,
	|	торо_ПлановыеРемонтныеРаботы.Отменен КАК Отменен,
	|	торо_ПлановыеРемонтныеРаботы.ID_базы_расчета КАК ID_базы_расчета,
	|	торо_ПлановыеРемонтныеРаботы.Замещен КАК Замещен,
	|	торо_ПлановыеРемонтныеРаботы.ID_замещающего КАК ID_замещающего,
	|	торо_ПлановыеРемонтныеРаботы.ДатаНачалаРасчетная КАК ДатаНачалаРасчетная,
	|	торо_ПлановыеРемонтныеРаботы.СтоимостьРемонта КАК СтоимостьРемонта,
	|	торо_ПлановыеРемонтныеРаботы.Подразделение КАК Подразделение,
	|	торо_ПлановыеРемонтныеРаботы.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТСрезППР
	|ИЗ
	|	ВТОтборППРМаксимум КАК ВТОтборППРМаксимум
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ПлановыеРемонтныеРаботы КАК торо_ПлановыеРемонтныеРаботы
	|		ПО ВТОтборППРМаксимум.ID = торо_ПлановыеРемонтныеРаботы.ID
	|			И ВТОтборППРМаксимум.ОбъектРемонтныхРабот = торо_ПлановыеРемонтныеРаботы.ОбъектРемонтныхРабот
	|			И ВТОтборППРМаксимум.ВидРемонтныхРабот = торо_ПлановыеРемонтныеРаботы.ВидРемонтныхРабот
	|			И ВТОтборППРМаксимум.Организация = торо_ПлановыеРемонтныеРаботы.Организация
	|			И ВТОтборППРМаксимум.Период = торо_ПлановыеРемонтныеРаботы.Период
	|			И ВТОтборППРМаксимум.Регистратор = торо_ПлановыеРемонтныеРаботы.Регистратор
	|ГДЕ
	|	&ФОИспользоватьППР
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID,
	|	ОбъектРемонтныхРабот,
	|	ВидРемонтныхРабот,
	|	Организация,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ВыявленныеДефекты.Период КАК Период,
	|	торо_ВыявленныеДефекты.Регистратор КАК Регистратор,
	|	торо_ВыявленныеДефекты.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_ВыявленныеДефекты.ОтказавшийЭлемент КАК ОтказавшийЭлемент,
	|	торо_ВыявленныеДефекты.ID КАК ID,
	|	торо_ВыявленныеДефекты.Организация КАК Организация,
	|	торо_ВыявленныеДефекты.Подразделение КАК Подразделение,
	|	торо_ВыявленныеДефекты.КритичностьДефекта КАК КритичностьДефекта,
	|	торо_ВыявленныеДефекты.ПодразделениеИсполнитель КАК ПодразделениеИсполнитель,
	|	торо_ВыявленныеДефекты.ДефектОписание КАК ДефектОписание,
	|	торо_ВыявленныеДефекты.гкс_СимптомДефекта КАК гкс_СимптомДефекта
	|ПОМЕСТИТЬ ВТОтборДеффектов
	|ИЗ
	|	РегистрСведений.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефекты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборИД КАК ВТОтборИД
	|		ПО торо_ВыявленныеДефекты.ID = ВТОтборИД.IDРемонта
	|ГДЕ
	|	&ФОИспользоватьДефекты
	|	И торо_ВыявленныеДефекты.Организация = &Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID,
	|	ОбъектРемонта,
	|	ОтказавшийЭлемент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_НарядыПоРемонтам.IDРемонта КАК IDРемонта
	|ПОМЕСТИТЬ ВТОтборНарядовМаксимумСрез
	|ИЗ
	|	РегистрСведений.торо_НарядыПоРемонтам КАК торо_НарядыПоРемонтам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборИД КАК ВТОтборИД
	|		ПО торо_НарядыПоРемонтам.IDРемонта = ВТОтборИД.IDРемонта
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОбследованноеОборудование.ID КАК ID,
	|	ОбследованноеОборудование.Ссылка КАК Ссылка,
	|	ОбследованноеОборудование.Исполнитель КАК Исполнитель
	|ПОМЕСТИТЬ ВТОбследованноеОборудование
	|ИЗ
	|	Документ.торо_ВнешнееОснованиеДляРабот.ОбследованноеОборудование КАК ОбследованноеОборудование
	|		Внутреннее СОЕДИНЕНИЕ ВТСрезВнешниеОснованияДляРабот КАК ВТСрезВнешниеОснованияДляРабот
	|		ПО (ВТСрезВнешниеОснованияДляРабот.ID = ОбследованноеОборудование.ID)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID,
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(торо_СтатусыДокументовВнешнихОснованийУстановленные.Период) КАК Период,
	|	МАКСИМУМ(торо_СтатусыДокументовВнешнихОснованийУстановленные.Регистратор) КАК Регистратор,
	|	торо_СтатусыДокументовВнешнихОснованийУстановленные.ИзменяемыйДокумент КАК ИзменяемыйДокумент
	|ПОМЕСТИТЬ ВТСтатусыВОМаксимум
	|ИЗ
	|	РегистрСведений.торо_СтатусыДокументовВнешнихОснованийУстановленные КАК торо_СтатусыДокументовВнешнихОснованийУстановленные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбследованноеОборудование КАК ВТОбследованноеОборудование
	|		ПО (ВТОбследованноеОборудование.Ссылка = торо_СтатусыДокументовВнешнихОснованийУстановленные.ИзменяемыйДокумент)
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_СтатусыДокументовВнешнихОснованийУстановленные.ИзменяемыйДокумент
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Регистратор,
	|	ИзменяемыйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСтатусыВОМаксимум.Период КАК Период,
	|	ВТСтатусыВОМаксимум.Регистратор КАК Регистратор,
	|	ВТСтатусыВОМаксимум.ИзменяемыйДокумент КАК ИзменяемыйДокумент,
	|	торо_СтатусыДокументовВнешнихОснованийУстановленные.СтатусДокумента КАК СтатусДокумента
	|ПОМЕСТИТЬ ВТСтатусыДокументовВО
	|ИЗ
	|	ВТСтатусыВОМаксимум КАК ВТСтатусыВОМаксимум
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_СтатусыДокументовВнешнихОснованийУстановленные КАК торо_СтатусыДокументовВнешнихОснованийУстановленные
	|		ПО ВТСтатусыВОМаксимум.ИзменяемыйДокумент = торо_СтатусыДокументовВнешнихОснованийУстановленные.ИзменяемыйДокумент
	|			И ВТСтатусыВОМаксимум.Регистратор = торо_СтатусыДокументовВнешнихОснованийУстановленные.Регистратор
	|			И ВТСтатусыВОМаксимум.Период = торо_СтатусыДокументовВнешнихОснованийУстановленные.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИзменяемыйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТОтборИДИДокументовНачалаЦепочки.IDРемонта КАК IDРемонта,
	|	ВТОтборИДИДокументовНачалаЦепочки.ДокументНачалаЦепочки КАК ДокументНачалаЦепочки,
	|	МАКСИМУМ(ЕСТЬNULL(торо_ТекущиеСтатусыСогласованияДокументов.СтатусДокумента, ЗНАЧЕНИЕ(Справочник.торо_СтатусыСогласованияДокументовРемонтныхРабот.ПустаяСсылка))) КАК СтатусДокумента
	|ПОМЕСТИТЬ ВТОтборИДИДокументовНачалаЦепочкиИСтатусы
	|ИЗ
	|	ВТОтборИДИДокументовНачалаЦепочки КАК ВТОтборИДИДокументовНачалаЦепочки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ТекущиеСтатусыСогласованияДокументов КАК торо_ТекущиеСтатусыСогласованияДокументов
	|		ПО ВТОтборИДИДокументовНачалаЦепочки.ДокументНачалаЦепочки = торо_ТекущиеСтатусыСогласованияДокументов.СогласуемыйДокумент
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТОтборИДИДокументовНачалаЦепочки.IDРемонта,
	|	ВТОтборИДИДокументовНачалаЦепочки.ДокументНачалаЦепочки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта
	|;
	|Выбрать Различные
	|	торо_ОстановочныеРемонтыСрезПоследних.IDОсновного КАК IDОсновного,
	|	торо_ОстановочныеРемонтыСрезПоследних.IDЗависимого КАК IDЗависимого
	|Поместить ВТ_ВО_Остановочные
	|ИЗ РегистрСведений.торо_ОстановочныеРемонты.СрезПоследних(, IDЗависимого В (Выбрать ТЧ.ID 
	|	ИЗ ВТСрезВнешниеОснованияДляРабот КАК ТЧ
	|	)) КАК торо_ОстановочныеРемонтыСрезПоследних
	|Где (НЕ торо_ОстановочныеРемонтыСрезПоследних.Отвязан)
	|;
	|Выбрать Различные
	|	Рег.ОбъектРемонта КАК ОбъектРемонта,
	|	Рег.ВидЭксплуатации КАК ВидЭксплуатации
	|Поместить ВТ_ВО_СрезСостояний
	|	ИЗ РегистрСведений.торо_ТекущееСостояниеОР.СрезПоследних(&ТекДата,  ОбъектРемонта В (Выбрать ТЧ.ОбъектРемонта 
	|	ИЗ ВТСрезВнешниеОснованияДляРабот КАК ТЧ
	|	)) КАК Рег
	|;
	|Выбрать различные
	|Рег.ОбъектРемонта КАК ОбъектРемонта,
	|Рег.ID КАК ID
	|Поместить ВТ_ВО_Завершенные
	|ИЗ РегистрСведений.торо_ЗавершенныеРемонтныеРаботы.СрезПоследних(, ID В (Выбрать ТЧ.ID 
	|	ИЗ ВТСрезВнешниеОснованияДляРабот КАК ТЧ
	|	)) КАК Рег
	|;
	|Выбрать различные
	|Рег.ОбъектРемонта КАК ОбъектРемонта,
	|Рег.ID КАК ID
	|Поместить ВТ_ППР_Завершенные
	|ИЗ РегистрСведений.торо_ЗавершенныеРемонтныеРаботы.СрезПоследних(, ID В (Выбрать ТЧ.ID 
	|	ИЗ ВТСрезППР КАК ТЧ
	|	)) КАК Рег
	|;
	|Выбрать
	|Рег.IDОсновного КАК IDОсновного,
	|Рег.IDЗависимого КАК IDЗависимого,
	|Рег.Отвязан КАК Отвязан,
	|Рег.ДатаНачалаРемонта КАК ДатаНачалаРемонта,
	|Рег.ДатаОкончанияРемонта КАК ДатаОкончанияРемонта
	|Поместить ВТ_ОстППР
	|ИЗ РегистрСведений.торо_ОстановочныеРемонты.СрезПоследних(, IDЗависимого В (Выбрать ТЧ.ID 
	|	ИЗ ВТСрезППР КАК ТЧ
	|	)) КАК Рег
	|;
	|ВЫБРАТЬ
	|	торо_ОтмененныеЗаявки.Заявка КАК Заявка
	|Поместить ВТ_ОтмЗаявки
	|ИЗ
	|	РегистрСведений.торо_ОтмененныеЗаявки КАК торо_ОтмененныеЗаявки
	|;
	|Выбрать
	|	торо_Заявка.IDРемонта КАК IDРемонта,
	|	торо_Заявка.Регистратор КАК Регистратор,
	|	торо_Заявка.Исполнитель КАК Исполнитель,
	|	торо_Заявка.УточнениеИсполнителя КАК УточнениеИсполнителя
	|Поместить ВТ_СрезЗаявокВО_0
	|ИЗ РегистрСведений.торо_ЗаявкиПоРемонтам.СрезПоследних(, IDРемонта В (Выбрать ТЧ.ID 
	|	ИЗ ВТСрезВнешниеОснованияДляРабот КАК ТЧ
	|	)) КАК торо_Заявка
	|Где (НЕ торо_Заявка.Регистратор В
	|					(ВЫБРАТЬ
	|						торо_ОтмененныеЗаявки.Заявка
	|					ИЗ
	|						ВТ_ОтмЗаявки КАК торо_ОтмененныеЗаявки))
	|
	|;
	|Выбрать
	|	торо_РемонтыЗаявка.ВидРемонта КАК ВидРемонта,
	|	ТЧ.IDРемонта КАК IDРемонта,
	|	ТЧ.Регистратор КАК Регистратор,
	|	ТЧ.Исполнитель КАК Исполнитель,
	|	ТЧ.УточнениеИсполнителя КАК УточнениеИсполнителя
	|Поместить ВТ_СрезЗаявокВО
	|ИЗ	ВТ_СрезЗаявокВО_0 КАК ТЧ		
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_Ремонты КАК торо_РемонтыЗаявка
	|	ПО ТЧ.IDРемонта = торо_РемонтыЗаявка.ID
	|		И ТЧ.Регистратор = торо_РемонтыЗаявка.Регистратор
	|
	|; 
	|
	|Выбрать
	|	торо_Заявка.IDРемонта КАК IDРемонта,
	|	торо_Заявка.Регистратор КАК Регистратор,
	|	торо_Заявка.Исполнитель КАК Исполнитель,
	|	торо_Заявка.УточнениеИсполнителя КАК УточнениеИсполнителя
	|Поместить ВТ_СрезЗаявокППР_0
	|ИЗ РегистрСведений.торо_ЗаявкиПоРемонтам.СрезПоследних(, IDРемонта В (Выбрать ТЧ.ID 
	|	ИЗ ВТСрезППР КАК ТЧ
	|	)) КАК торо_Заявка
	|Где (НЕ торо_Заявка.Регистратор В
	|					(ВЫБРАТЬ
	|						торо_ОтмененныеЗаявки.Заявка
	|					ИЗ
	|						ВТ_ОтмЗаявки КАК торо_ОтмененныеЗаявки))
	|
	|;
	|Выбрать
	|	торо_РемонтыЗаявка.ВидРемонта КАК ВидРемонта,
	|	ТЧ.IDРемонта КАК IDРемонта,
	|	ТЧ.Регистратор КАК Регистратор,
	|	ТЧ.Исполнитель КАК Исполнитель,
	|	ТЧ.УточнениеИсполнителя КАК УточнениеИсполнителя
	|Поместить ВТ_СрезЗаявокППР
	|ИЗ	ВТ_СрезЗаявокППР_0 КАК ТЧ		
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_Ремонты КАК торо_РемонтыЗаявка
	|	ПО ТЧ.IDРемонта = торо_РемонтыЗаявка.ID
	|		И ТЧ.Регистратор = торо_РемонтыЗаявка.Регистратор
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТОтборИД.ДокументНачалаЦепочки КАК Документ,
	|	""торо_ВнешнееОснованиеДляРабот"" КАК ТипДокумента,
	|	ВТОтборИД.ДокументОснование КАК ДокументПлановыхДат,
	|	ВТОтборИД.ПодрПлановыхДат КАК ПодрПлановыхДат,
	|	ЛОЖЬ КАК Перенесенный,
	|	ВТСрезВнешниеОснованияДляРабот.ОбъектРемонта КАК ОбъектРемонта,
	|	ЕСТЬNULL(торо_Заявка.ВидРемонта, &торо_ВидРемонтаВО) КАК ВидРемонта,
	|	ВЫБОР
	|		КОГДА ВТОтборИД.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВТОтборИД.ДатаОкончания
	|		ИНАЧЕ ВТОтборИД.ДатаНачала
	|	КОНЕЦ КАК ПланируемаяДатаНачалаРемонта,
	|	ВТОтборИД.ДатаОкончания КАК ПланируемаяДатаОкончанияРемонта,
	|	ЕСТЬNULL(торо_Заявка.Исполнитель, ВТОбследованноеОборудование.Исполнитель) КАК Исполнитель,
	|	ВТСрезВнешниеОснованияДляРабот.Организация КАК Организация,
	|	NULL КАК КритичностьДефекта,
	|	ВЫБОР
	|		КОГДА НЕ ЗакрытыеЗаявки.ID ЕСТЬ NULL
	|			ТОГДА ""Устранен (внешнее основание)""
	|		КОГДА НЕ(торо_НарядыПоРемонтам.IDРемонта ЕСТЬ NULL
	|					И ВТАктыПоРемонтамСрез.IDРемонта ЕСТЬ NULL)
	|			ТОГДА ""Устраняется (внешнее основание)""
	|		КОГДА НЕ торо_Заявка.IDРемонта ЕСТЬ NULL
	|				И &ИспользоватьСметы
	|			ТОГДА ""Запланировано устранение (внешнее основание)""
	|		ИНАЧЕ ""Зарегистрирован (внешнее основание)""
	|	КОНЕЦ КАК СтатусОР,
	|	ВТСрезВнешниеОснованияДляРабот.ID КАК ID_Ремонта,
	|	ВТСрезВнешниеОснованияДляРабот.Подразделение КАК Подразделение,
	|	ВЫБОР
	|		КОГДА торо_Заявка.Регистратор ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВведенаЗаявка,
	|	торо_ОбъектыРемонта.гкс_КатегорияРиска КАК ПриоритетОР,
	|	ВЫБОР
	|		КОГДА торо_ТекущееСостояниеОРСрезПоследних.ВидЭксплуатации = ЗНАЧЕНИЕ(Справочник.торо_ВидыЭксплуатации.ПустаяСсылка)
	|			ТОГДА ""Не установлено""
	|		ИНАЧЕ торо_ТекущееСостояниеОРСрезПоследних.ВидЭксплуатации
	|	КОНЕЦ КАК СостояниеОР,
	|	ВЫБОР
	|		КОГДА ЗакрытыеЗаявки.ID ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Завершенные,
	|	торо_Ремонты.ГарантийныйРемонт КАК ГарантийныйРемонт,
	|	ЕСТЬNULL(ВТСтатусыДокументовВО.СтатусДокумента, ЗНАЧЕНИЕ(Перечисление.торо_СтатусыДокументов.ПустаяССылка)) КАК СтатусДокумента,
	|	торо_ОстановочныеРемонтыСрезПоследних.IDОсновного КАК IDОсновного,
	|	ЕСТЬNULL(торо_Заявка.УточнениеИсполнителя, НЕОПРЕДЕЛЕНО) КАК Бригада,
	|	ВЫБОР
	|		КОГДА торо_Заявка.Исполнитель ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Хозспособ)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(торо_Заявка.Исполнитель) = ТИП(Справочник.Контрагенты)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный)
	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Хозспособ)
	|			КОНЕЦ
	|	КОНЕЦ КАК СпособВыполнения,
	|	NULL КАК гкс_СимптомДефекта,
	|	ВЫРАЗИТЬ(ВТСрезВнешниеОснованияДляРабот.Описание КАК СТРОКА(300)) КАК ДефектОписание,
	|	ВТОтборИДИДокументовНачалаЦепочкиИСтатусы.СтатусДокумента КАК СтатусСогласования,
	|	ЗНАЧЕНИЕ(Перечисление.гкс_СрочностьВоздействия.ПустаяСсылка) КАК гкс_СрочностьВоздействия,
	|	ВТСрезВнешниеОснованияДляРабот.Период КАК Период
	|ПОМЕСТИТЬ ВесьРезультат
	|{ВЫБРАТЬ
	|	Документ.*,
	|	ТипДокумента,
	|	ДокументПлановыхДат.* КАК ДокументПлановыхДат,
	|	ПодрПлановыхДат КАК ПодрПлановыхДат,
	|	Перенесенный,
	|	ОбъектРемонта.*,
	|	ВидРемонта,
	|	ПланируемаяДатаНачалаРемонта,
	|	ПланируемаяДатаОкончанияРемонта,
	|	Организация.*,
	|	КритичностьДефекта,
	|	СтатусОР,
	|	ID_Ремонта,
	|	Подразделение.*,
	|	Исполнитель.*,
	|	ВведенаЗаявка,
	|	ПриоритетОР.*,
	|	СостояниеОР.*,
	|	Завершенные,
	|	ГарантийныйРемонт,
	|	СтатусДокумента,
	|	IDОсновного,
	|	Бригада.*,
	|	гкс_СимптомДефекта,
	|	ДефектОписание,
	|	СтатусСогласования,
	|	гкс_СрочностьВоздействия,
	|	СпособВыполнения.*}
	|ИЗ
	|	ВТСрезВнешниеОснованияДляРабот КАК ВТСрезВнешниеОснованияДляРабот
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОбследованноеОборудование КАК ВТОбследованноеОборудование
	|		ПО ВТСрезВнешниеОснованияДляРабот.ID = ВТОбследованноеОборудование.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтборНарядовМаксимумСрез КАК торо_НарядыПоРемонтам
	|		ПО ВТСрезВнешниеОснованияДляРабот.ID = торо_НарядыПоРемонтам.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СрезЗаявокВО КАК торо_Заявка
	|		ПО ВТСрезВнешниеОснованияДляРабот.ID = торо_Заявка.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВО_СрезСостояний КАК торо_ТекущееСостояниеОРСрезПоследних
	|		ПО ВТСрезВнешниеОснованияДляРабот.ОбъектРемонта = торо_ТекущееСостояниеОРСрезПоследних.ОбъектРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВО_Завершенные КАК ЗакрытыеЗаявки
	|		ПО ВТСрезВнешниеОснованияДляРабот.ОбъектРемонта = ЗакрытыеЗаявки.ОбъектРемонта
	|			И ВТСрезВнешниеОснованияДляРабот.ID = ЗакрытыеЗаявки.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_Ремонты КАК торо_Ремонты
	|		ПО ВТСрезВнешниеОснованияДляРабот.ID = торо_Ремонты.ID
	|			И (ВТОбследованноеОборудование.Ссылка = торо_Ремонты.Регистратор)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусыДокументовВО КАК ВТСтатусыДокументовВО
	|		ПО (ВТОбследованноеОборудование.Ссылка = ВТСтатусыДокументовВО.ИзменяемыйДокумент)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	|		ПО ВТСрезВнешниеОснованияДляРабот.ОбъектРемонта = торо_ОбъектыРемонта.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВО_Остановочные КАК торо_ОстановочныеРемонтыСрезПоследних
	|		ПО ВТСрезВнешниеОснованияДляРабот.ID = торо_ОстановочныеРемонтыСрезПоследних.IDЗависимого
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборИД КАК ВТОтборИД
	|		ПО ВТСрезВнешниеОснованияДляРабот.ID = ВТОтборИД.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТАктыПоРемонтамСрез КАК ВТАктыПоРемонтамСрез
	|		ПО ВТСрезВнешниеОснованияДляРабот.ID = ВТАктыПоРемонтамСрез.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтборИДИДокументовНачалаЦепочкиИСтатусы КАК ВТОтборИДИДокументовНачалаЦепочкиИСтатусы
	|		ПО ВТСрезВнешниеОснованияДляРабот.ID = ВТОтборИДИДокументовНачалаЦепочкиИСтатусы.IDРемонта
	|ГДЕ
	| (НЕ &гкс_ИспользоватьПодразделениеВладелец = ИСТИНА
	|			ИЛИ ВТСрезВнешниеОснованияДляРабот.ОбъектРемонта.Подразделение = &гкс_ПодразделениеВладелец)
	|	И ВЫБОР
	|			КОГДА ВТОтборИД.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ВТОтборИД.ДатаОкончания
	|			ИНАЧЕ ВТОтборИД.ДатаНачала
	|		КОНЕЦ <= &ПлановыйПериод
	|	И НЕ ВТОбследованноеОборудование.Ссылка.Организация ЕСТЬ NULL
	|	И ВЫБОР
	|			КОГДА НЕ &Завершенные
	|				ТОГДА ЗакрытыеЗаявки.ID ЕСТЬ NULL
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА НЕ &ПоВсемПодразделениям
	|				ТОГДА ВТСрезВнешниеОснованияДляРабот.Подразделение В (&Исполнитель)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ                          
	|	И ВЫБОР
	|			КОГДА &гкс_ИспользоватьСрочностьВоздействия
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.гкс_СрочностьВоздействия.ПустаяСсылка) = &гкс_СрочностьВоздействия
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|{ГДЕ
	|	ВТОтборИД.ДокументНачалаЦепочки.* КАК Документ,
	|	(""Внешнее основание для работ"") КАК ТипДокумента,
	|	(ЛОЖЬ) КАК Перенесенный,
	|	ВТСрезВнешниеОснованияДляРабот.ОбъектРемонта.*,
	|	(ЕСТЬNULL(торо_Заявка.ВидРемонта, &торо_ВидРемонтаВО)) КАК ВидРемонта,
	|	(ВЫБОР
	|			КОГДА ВТОтборИД.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ВТОтборИД.ДатаОкончания
	|		КОНЕЦ) КАК ПланируемаяДатаНачалаРемонта,
	|	ВТОтборИД.ДатаОкончания КАК ПланируемаяДатаОкончанияРемонта,
	|	(ЕСТЬNULL(торо_Заявка.Исполнитель, ВТОбследованноеОборудование.Исполнитель)).* КАК Исполнитель,
	|	ВТСрезВнешниеОснованияДляРабот.Организация.*,
	|	ВТСрезВнешниеОснованияДляРабот.ID КАК ID_Ремонта,
	|	ВТСрезВнешниеОснованияДляРабот.Подразделение.*,
	|	(ВЫБОР
	|			КОГДА торо_Заявка.Регистратор ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК ВведенаЗаявка,
	|	торо_ОбъектыРемонта.гкс_КатегорияРиска.* КАК ПриоритетОР,
	|	(ВЫБОР
	|			КОГДА торо_ТекущееСостояниеОРСрезПоследних.ВидЭксплуатации = ЗНАЧЕНИЕ(Справочник.торо_ВидыЭксплуатации.ПустаяСсылка)
	|				ТОГДА ""Не установлено""
	|			ИНАЧЕ торо_ТекущееСостояниеОРСрезПоследних.ВидЭксплуатации
	|		КОНЕЦ).* КАК СостояниеОР,
	|	(ВЫБОР
	|			КОГДА ЗакрытыеЗаявки.ID ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК Завершенные,
	|	торо_Ремонты.ГарантийныйРемонт,
	|	(ЕСТЬNULL(ВТСтатусыДокументовВО.СтатусДокумента, ЗНАЧЕНИЕ(Перечисление.торо_СтатусыДокументов.ПустаяССылка))).* КАК СтатусДокумента,
	|	торо_ОстановочныеРемонтыСрезПоследних.IDОсновного,
	|	(ЕСТЬNULL(торо_Заявка.УточнениеИсполнителя, НЕОПРЕДЕЛЕНО)).* КАК Бригада,
	|	(ВЫБОР
	|			КОГДА торо_Заявка.Исполнитель ЕСТЬ NULL
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Хозспособ)
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(торо_Заявка.Исполнитель) = ТИП(Справочник.Контрагенты)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Хозспособ)
	|				КОНЕЦ
	|		КОНЕЦ).* КАК СпособВыполнения}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТОтборИД.ДокументНачалаЦепочки,
	|	""торо_ПланГрафикРемонта"",
	|	ВТОтборИД.ДокументОснование,
	|	ВТОтборИД.ПодрПлановыхДат КАК ПодрПлановыхДат,
	|	ТИПЗНАЧЕНИЯ(ВТСрезППР.Регистратор) = ТИП(Документ.торо_ЗакрытиеЗаявокИРемонтов),
	|	ВТСрезППР.ОбъектРемонтныхРабот,
	|	ВТСрезППР.ВидРемонтныхРабот,
	|	ВТОтборИД.ДатаНачала,
	|	ВТОтборИД.ДатаОкончания,
	|	ЕСТЬNULL(торо_ЗаявкаНаРемонт.Исполнитель, ВТСрезППР.Исполнитель),
	|	ВТСрезППР.Организация,
	|	NULL,
	|	ВЫБОР
	|		КОГДА НЕ ЗакрытыеЗаявки.ID ЕСТЬ NULL
	|			ТОГДА ""Выполнен (план-график ППР)""
	|		КОГДА НЕ(торо_НарядыПоРемонтам.IDРемонта ЕСТЬ NULL
	|					И ВТАктыПоРемонтамСрез.IDРемонта ЕСТЬ NULL)
	|			ТОГДА ""Выполняется (план-график ППР)""
	|		КОГДА НЕ торо_ЗаявкаНаРемонт.IDРемонта ЕСТЬ NULL
	|				И &ИспользоватьСметы
	|			ТОГДА ""Запланировано выполнение (план-график ППР)""
	|		ИНАЧЕ ""Введен ППР (план-график ППР)""
	|	КОНЕЦ,
	|	ВТСрезППР.ID,
	|	ВТСрезППР.Подразделение,
	|	ВЫБОР
	|		КОГДА торо_ЗаявкаНаРемонт.Регистратор ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	торо_ОбъектыРемонта.гкс_КатегорияРиска,
	|	ВЫБОР
	|		КОГДА торо_ТекущееСостояниеОРСрезПоследних.ВидЭксплуатации = ЗНАЧЕНИЕ(Справочник.торо_ВидыЭксплуатации.ПустаяСсылка)
	|			ТОГДА ""Не установлено""
	|		ИНАЧЕ торо_ТекущееСостояниеОРСрезПоследних.ВидЭксплуатации
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЗакрытыеЗаявки.ID ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ЛОЖЬ,
	|	""Статус не определен"",
	|	торо_ОстановочныеРемонтыСрезПоследних.IDОсновного,
	|	ЕСТЬNULL(торо_ЗаявкаНаРемонт.УточнениеИсполнителя, НЕОПРЕДЕЛЕНО),
	|	ВЫБОР
	|		КОГДА торо_ЗаявкаНаРемонт.Исполнитель ЕСТЬ NULL
	|			ТОГДА ВТСрезППР.СпособВыполнения
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(торо_ЗаявкаНаРемонт.Исполнитель) = ТИП(Справочник.Контрагенты)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный)
	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Хозспособ)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	NULL,
	|	NULL,
	|	РегистрСведенийторо_ТекущиеСтатусыСогласованияДокументов.СтатусДокумента,
	|	ЗНАЧЕНИЕ(Перечисление.гкс_СрочностьВоздействия.ПустаяСсылка),
	|	ВТСрезППР.Период
	|ИЗ
	|	ВТСрезППР КАК ВТСрезППР
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ППР_Завершенные КАК ЗакрытыеЗаявки
	|		ПО ВТСрезППР.ID = ЗакрытыеЗаявки.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СрезЗаявокППР КАК торо_ЗаявкаНаРемонт
	|		ПО ВТСрезППР.ID = торо_ЗаявкаНаРемонт.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтборНарядовМаксимумСрез КАК торо_НарядыПоРемонтам
	|		ПО ВТСрезППР.ID = торо_НарядыПоРемонтам.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ТекущееСостояниеОР.СрезПоследних(&ТекДата, ) КАК торо_ТекущееСостояниеОРСрезПоследних
	|		ПО ВТСрезППР.ОбъектРемонтныхРабот = торо_ТекущееСостояниеОРСрезПоследних.ОбъектРемонта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	|		ПО ВТСрезППР.ОбъектРемонтныхРабот = торо_ОбъектыРемонта.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстППР КАК торо_ОстановочныеРемонтыСрезПоследних
	|		ПО ВТСрезППР.ID = торо_ОстановочныеРемонтыСрезПоследних.IDЗависимого
	|			И (НЕ торо_ОстановочныеРемонтыСрезПоследних.Отвязан)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборИД КАК ВТОтборИД
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ТекущиеСтатусыСогласованияДокументов КАК РегистрСведенийторо_ТекущиеСтатусыСогласованияДокументов
	|			ПО (РегистрСведенийторо_ТекущиеСтатусыСогласованияДокументов.СогласуемыйДокумент = ВТОтборИД.ДокументНачалаЦепочки)
	|		ПО ВТСрезППР.ID = ВТОтборИД.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТАктыПоРемонтамСрез КАК ВТАктыПоРемонтамСрез
	|		ПО ВТСрезППР.ID = ВТАктыПоРемонтамСрез.IDРемонта
	|ГДЕ
	|	ВЫБОР
	|			КОГДА НЕ &ПоВсемОрганизациям
	|				ТОГДА ВТСрезППР.Организация = &Организация
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И (НЕ &гкс_ИспользоватьПодразделениеВладелец = ИСТИНА
	|			ИЛИ ВТСрезППР.ОбъектРемонтныхРабот.Подразделение = &гкс_ПодразделениеВладелец)
	|	И ВЫБОР
	|			КОГДА НЕ &ПоВсемПодразделениям
	|				ТОГДА ВТСрезППР.Подразделение В (&Исполнитель)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И НЕ ВТСрезППР.Отменен
	|	И НЕ ВТСрезППР.Замещен
	|	И ВТОтборИД.ДатаНачала <= &ПлановыйПериод
	|	И ВЫБОР
	|			КОГДА НЕ &Завершенные
	|				ТОГДА ЗакрытыеЗаявки.ID ЕСТЬ NULL
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &гкс_ИспользоватьСрочностьВоздействия
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.гкс_СрочностьВоздействия.ПустаяСсылка) = &гкс_СрочностьВоздействия
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|{ГДЕ
	|	ВТОтборИД.ДокументНачалаЦепочки.* КАК Документ,
	|	(""План-график ППР"") КАК ТипДокумента,
	|	ВТСрезППР.ОбъектРемонтныхРабот.* КАК ОбъектРемонта,
	|	ВТСрезППР.ВидРемонтныхРабот.* КАК ВидРемонта,
	|	ВТОтборИД.ДатаНачала КАК ПланируемаяДатаНачалаРемонта,
	|	ВТОтборИД.ДатаОкончания КАК ПланируемаяДатаОкончанияРемонта,
	|	(ЕСТЬNULL(торо_ЗаявкаНаРемонт.Исполнитель, ВТСрезППР.Исполнитель)).* КАК Исполнитель,
	|	ВТСрезППР.Организация.*,
	|	(ВЫБОР
	|			КОГДА НЕ ЗакрытыеЗаявки.ID ЕСТЬ NULL
	|				ТОГДА ""Выполнен (план-график ППР)""
	|			КОГДА НЕ торо_НарядыПоРемонтам.IDРемонта ЕСТЬ NULL
	|				ТОГДА ""Выполняется (план-график ППР)""
	|			КОГДА НЕ торо_ЗаявкаНаРемонт.IDРемонта ЕСТЬ NULL
	|					И &ИспользоватьСметы
	|				ТОГДА ""Запланировано выполнение (план-график ППР)""
	|			ИНАЧЕ ""Введен ППР (план-график ППР)""
	|		КОНЕЦ) КАК СтатусОР,
	|	ВТСрезППР.ID КАК ID_Ремонта,
	|	ВТСрезППР.Подразделение.*,
	|	(ВЫБОР
	|			КОГДА торо_ЗаявкаНаРемонт.Регистратор ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК ВведенаЗаявка,
	|	торо_ОбъектыРемонта.гкс_КатегорияРиска.* КАК ПриоритетОР,
	|	(ВЫБОР
	|			КОГДА торо_ТекущееСостояниеОРСрезПоследних.ВидЭксплуатации = ЗНАЧЕНИЕ(Справочник.торо_ВидыЭксплуатации.ПустаяСсылка)
	|				ТОГДА ""Не установлено""
	|			ИНАЧЕ торо_ТекущееСостояниеОРСрезПоследних.ВидЭксплуатации
	|		КОНЕЦ).* КАК СостояниеОР,
	|	(ВЫБОР
	|			КОГДА ЗакрытыеЗаявки.ID ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК Завершенные,
	|	(ЛОЖЬ) КАК ГарантийныйРемонт,
	|	(""Статус не определен"") КАК СтатусДокумента,
	|	торо_ОстановочныеРемонтыСрезПоследних.IDОсновного,
	|	(ЕСТЬNULL(торо_ЗаявкаНаРемонт.УточнениеИсполнителя, НЕОПРЕДЕЛЕНО)).* КАК Бригада,
	|	(ВЫБОР
	|			КОГДА торо_ЗаявкаНаРемонт.Исполнитель ЕСТЬ NULL
	|				ТОГДА ВТСрезППР.СпособВыполнения
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(торо_ЗаявкаНаРемонт.Исполнитель) = ТИП(Справочник.Контрагенты)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Хозспособ)
	|				КОНЕЦ
	|		КОНЕЦ).* КАК СпособВыполнения,
	|	ВТОтборИД.ДокументОснование.* КАК ДокументПлановыхДат}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТОтборИД.ДокументНачалаЦепочки,
	|	""торо_ВыявленныеДефекты"",
	|	ВТОтборИД.ДокументОснование,
	|	ВТОтборИД.ПодрПлановыхДат КАК ПодрПлановыхДат,
	|	ЛОЖЬ,
	|	ВТОтборДеффектов.ОтказавшийЭлемент,
	|	ЕСТЬNULL(торо_РемонтыЗаявка.ВидРемонта, &торо_ВидРемонтаВД),
	|	ВЫБОР
	|		КОГДА ВТОтборИД.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВТОтборДеффектов.Период
	|		ИНАЧЕ ВТОтборИД.ДатаНачала
	|	КОНЕЦ,
	|	ВТОтборИД.ДатаОкончания,
	|	ЕСТЬNULL(торо_Заявка.Исполнитель, ВТОтборДеффектов.ПодразделениеИсполнитель),
	|	ВТОтборДеффектов.Организация,
	|	ВТОтборДеффектов.КритичностьДефекта,
	|	ВЫБОР
	|		КОГДА НЕ ЗакрытыеЗаявки.ID ЕСТЬ NULL
	|			ТОГДА ""Устранен (выявленный дефект)""
	|		КОГДА НЕ(торо_НарядыПоРемонтам.IDРемонта ЕСТЬ NULL
	|					И ВТАктыПоРемонтамСрез.IDРемонта ЕСТЬ NULL)
	|			ТОГДА ""Устраняется (выявленный дефект)""
	|		КОГДА НЕ торо_Заявка.IDРемонта ЕСТЬ NULL
	|				И &ИспользоватьСметы
	|			ТОГДА ""Запланировано устранение (выявленный дефект)""
	|		ИНАЧЕ ""Зарегистрирован (выявленный дефект)""
	|	КОНЕЦ,
	|	ВТОтборДеффектов.ID,
	|	ВТОтборДеффектов.Подразделение,
	|	ВЫБОР
	|		КОГДА торо_Заявка.Регистратор ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	торо_ОбъектыРемонта.гкс_КатегорияРиска,
	|	ВЫБОР
	|		КОГДА торо_ТекущееСостояниеОРСрезПоследних.ВидЭксплуатации = ЗНАЧЕНИЕ(Справочник.торо_ВидыЭксплуатации.ПустаяСсылка)
	|			ТОГДА ""Не установлено""
	|		ИНАЧЕ торо_ТекущееСостояниеОРСрезПоследних.ВидЭксплуатации
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЗакрытыеЗаявки.ID ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		КОГДА ЕСТЬNULL(торо_СтатусыДокументовВыявленныхДефектовСрезПоследних.СтатусДокумента, ЗНАЧЕНИЕ(Перечисление.торо_СтатусыДокументов.ПустаяССылка)) = ЗНАЧЕНИЕ(Перечисление.торо_СтатусыДокументов.гкс_ВыполненНеобходимАктПриемки)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	торо_Ремонты.ГарантийныйРемонт,
	|	ЕСТЬNULL(торо_СтатусыДокументовВыявленныхДефектовСрезПоследних.СтатусДокумента, ЗНАЧЕНИЕ(Перечисление.торо_СтатусыДокументов.ПустаяССылка)),
	|	торо_ОстановочныеРемонтыСрезПоследних.IDОсновного,
	|	ЕСТЬNULL(торо_Заявка.УточнениеИсполнителя, НЕОПРЕДЕЛЕНО),
	|	ВЫБОР
	|		КОГДА торо_Заявка.Исполнитель ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Хозспособ)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(торо_Заявка.Исполнитель) = ТИП(Справочник.Контрагенты)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный)
	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Хозспособ)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВТОтборДеффектов.гкс_СимптомДефекта,
	|	ВТОтборДеффектов.ДефектОписание,
	|	РегистрСведенийторо_ТекущиеСтатусыСогласованияДокументов.СтатусДокумента,
	|	NULL,
	|	ВТОтборДеффектов.Период
	|ИЗ
	|	ВТОтборДеффектов КАК ВТОтборДеффектов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОтмененныеРемонты.СрезПоследних КАК торо_ОтмененныеРемонтыСрезПоследних
	|		ПО ВТОтборДеффектов.ID = торо_ОтмененныеРемонтыСрезПоследних.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтборНарядовМаксимумСрез КАК торо_НарядыПоРемонтам
	|		ПО ВТОтборДеффектов.ID = торо_НарядыПоРемонтам.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗаявкиПоРемонтам.СрезПоследних(, ) КАК торо_Заявка
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_Ремонты КАК торо_РемонтыЗаявка
	|			ПО торо_Заявка.IDРемонта = торо_РемонтыЗаявка.ID
	|				И торо_Заявка.Регистратор = торо_РемонтыЗаявка.Регистратор
	|		ПО ВТОтборДеффектов.ID = торо_Заявка.IDРемонта
	|			И (НЕ торо_Заявка.Регистратор В
	|					(ВЫБРАТЬ
	|						торо_ОтмененныеЗаявки.Заявка
	|					ИЗ
	|						РегистрСведений.торо_ОтмененныеЗаявки КАК торо_ОтмененныеЗаявки))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ТекущееСостояниеОР.СрезПоследних(&ТекДата, ) КАК торо_ТекущееСостояниеОРСрезПоследних
	|		ПО ВТОтборДеффектов.ОтказавшийЭлемент = торо_ТекущееСостояниеОРСрезПоследних.ОбъектРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗавершенныеРемонтныеРаботы КАК ЗакрытыеЗаявки
	|		ПО ВТОтборДеффектов.ОтказавшийЭлемент = ЗакрытыеЗаявки.ОбъектРемонта
	|			И ВТОтборДеффектов.ID = ЗакрытыеЗаявки.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_Ремонты КАК торо_Ремонты
	|		ПО ВТОтборДеффектов.ID = торо_Ремонты.ID
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	|		ПО ВТОтборДеффектов.ОтказавшийЭлемент = торо_ОбъектыРемонта.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОстановочныеРемонты.СрезПоследних КАК торо_ОстановочныеРемонтыСрезПоследних
	|		ПО ВТОтборДеффектов.ID = торо_ОстановочныеРемонтыСрезПоследних.IDЗависимого
	|			И (НЕ торо_ОстановочныеРемонтыСрезПоследних.Отвязан)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборИД КАК ВТОтборИД
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ТекущиеСтатусыСогласованияДокументов КАК РегистрСведенийторо_ТекущиеСтатусыСогласованияДокументов
	|			ПО (РегистрСведенийторо_ТекущиеСтатусыСогласованияДокументов.СогласуемыйДокумент = ВТОтборИД.ДокументНачалаЦепочки)
	|		ПО ВТОтборДеффектов.ID = ВТОтборИД.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_СтатусыДокументовВыявленныхДефектовУстановленные.СрезПоследних(&ТекДата, &ИспользоватьСтатусыДокументов) КАК торо_СтатусыДокументовВыявленныхДефектовСрезПоследних
	|		ПО ВТОтборДеффектов.Регистратор = торо_СтатусыДокументовВыявленныхДефектовСрезПоследних.ИзменяемыйДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТАктыПоРемонтамСрез КАК ВТАктыПоРемонтамСрез
	|		ПО ВТОтборДеффектов.ID = ВТАктыПоРемонтамСрез.IDРемонта
	|ГДЕ
	|	НЕ ВТОтборДеффектов.Регистратор.Организация ЕСТЬ NULL
	|	И ВЫБОР
	|			КОГДА НЕ &Завершенные
	|				ТОГДА ЗакрытыеЗаявки.ID ЕСТЬ NULL
	|						ИЛИ ЕСТЬNULL(торо_СтатусыДокументовВыявленныхДефектовСрезПоследних.СтатусДокумента, ЗНАЧЕНИЕ(Перечисление.торо_СтатусыДокументов.ПустаяССылка)) = ЗНАЧЕНИЕ(Перечисление.торо_СтатусыДокументов.гкс_ВыполненНеобходимАктПриемки)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА НЕ &ПоВсемПодразделениям
	|				ТОГДА ВТОтборДеффектов.Подразделение В (&Исполнитель)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И торо_ОтмененныеРемонтыСрезПоследних.Регистратор ЕСТЬ NULL
	|	И ВЫБОР
	|			КОГДА &гкс_ИспользоватьСрочностьВоздействия
	|				ТОГДА ВТОтборДеффектов.Регистратор.гкс_СрочностьВоздействия = &гкс_СрочностьВоздействия
	|						ИЛИ &гкс_СрочностьВоздействия = ЗНАЧЕНИЕ(Перечисление.гкс_СрочностьВоздействия.ПустаяСсылка)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|{ГДЕ
	|	ВТОтборИД.ДокументНачалаЦепочки.* КАК Документ,
	|	(""Выявленные дефекты"") КАК ТипДокумента,
	|	(ЛОЖЬ) КАК Перенесенный,
	|	ВТОтборДеффектов.ОтказавшийЭлемент.* КАК ОбъектРемонта,
	|	(ЕСТЬNULL(торо_РемонтыЗаявка.ВидРемонта, &торо_ВидРемонтаВД)) КАК ВидРемонта,
	|	(ВЫБОР
	|			КОГДА ВТОтборИД.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ВТОтборДеффектов.Период
	|			ИНАЧЕ ВТОтборИД.ДатаНачала
	|		КОНЕЦ) КАК ПланируемаяДатаНачалаРемонта,
	|	ВТОтборИД.ДатаОкончания КАК ПланируемаяДатаОкончанияРемонта,
	|	(ЕСТЬNULL(торо_Заявка.Исполнитель, ВТОтборДеффектов.ПодразделениеИсполнитель)).* КАК Исполнитель,
	|	ВТОтборДеффектов.Организация.*,
	|	ВТОтборДеффектов.КритичностьДефекта.*,
	|	(ВЫБОР
	|			КОГДА НЕ ЗакрытыеЗаявки.ID ЕСТЬ NULL
	|				ТОГДА ""Устранен (выявленный дефект)""
	|			КОГДА НЕ торо_НарядыПоРемонтам.IDРемонта ЕСТЬ NULL
	|				ТОГДА ""Устраняется (выявленный дефект)""
	|			КОГДА НЕ торо_Заявка.IDРемонта ЕСТЬ NULL
	|					И &ИспользоватьСметы
	|				ТОГДА ""Запланировано устранение (выявленный дефект)""
	|			ИНАЧЕ ""Зарегистрирован (выявленный дефект)""
	|		КОНЕЦ) КАК СтатусОР,
	|	ВТОтборДеффектов.ID КАК ID_Ремонта,
	|	ВТОтборДеффектов.Подразделение.*,
	|	(ВЫБОР
	|			КОГДА торо_Заявка.Регистратор ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК ВведенаЗаявка,
	|	торо_ОбъектыРемонта.гкс_КатегорияРиска.* КАК ПриоритетОР,
	|	(ВЫБОР
	|			КОГДА торо_ТекущееСостояниеОРСрезПоследних.ВидЭксплуатации = ЗНАЧЕНИЕ(Справочник.торо_ВидыЭксплуатации.ПустаяСсылка)
	|				ТОГДА ""Не установлено""
	|			ИНАЧЕ торо_ТекущееСостояниеОРСрезПоследних.ВидЭксплуатации
	|		КОНЕЦ).* КАК СостояниеОР,
	|	(ВЫБОР
	|			КОГДА ЗакрытыеЗаявки.ID ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК Завершенные,
	|	торо_Ремонты.ГарантийныйРемонт,
	|	(ЕСТЬNULL(торо_СтатусыДокументовВыявленныхДефектовСрезПоследних.СтатусДокумента, ЗНАЧЕНИЕ(Перечисление.торо_СтатусыДокументов.ПустаяССылка))).* КАК СтатусДокумента,
	|	торо_ОстановочныеРемонтыСрезПоследних.IDОсновного,
	|	(ЕСТЬNULL(торо_Заявка.УточнениеИсполнителя, НЕОПРЕДЕЛЕНО)).* КАК Бригада,
	|	(ВЫБОР
	|			КОГДА торо_Заявка.Исполнитель ЕСТЬ NULL
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Хозспособ)
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(торо_Заявка.Исполнитель) = ТИП(Справочник.Контрагенты)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Хозспособ)
	|				КОНЕЦ
	|		КОНЕЦ).* КАК СпособВыполнения,
	|	ВТОтборИД.ДокументОснование.* КАК ДокументПлановыхДат}
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧ.ID_Ремонта КАК ИД,
	|	МИНИМУМ(ДокТЧ.Ссылка.гкс_РаботыВыполнены) КАК гкс_РаботыВыполнены
	|ПОМЕСТИТЬ ЗавершенныеАкты
	|ИЗ
	|	ВесьРезультат КАК ТЧ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК ДокТЧ
	|		ПО (ДокТЧ.ID = ТЧ.ID_Ремонта)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЧ.ID_Ремонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧ.ID_Ремонта КАК ID_Ремонта,
	|	ТЧ.Документ КАК Документ,
	|	ТЧ.ТипДокумента КАК ТипДокумента,
	|	ТЧ.ДокументПлановыхДат КАК ДокументПлановыхДат,
	|	ТЧ.ПодрПлановыхДат КАК ПодрПлановыхДат,
	|	ТЧ.Перенесенный КАК Перенесенный,
	|	ТЧ.ОбъектРемонта КАК ОбъектРемонта,
	|	ТЧ.ВидРемонта КАК ВидРемонта,
	|	ТЧ.ПланируемаяДатаНачалаРемонта КАК ПланируемаяДатаНачалаРемонта,
	|	ТЧ.ПланируемаяДатаОкончанияРемонта КАК ПланируемаяДатаОкончанияРемонта,
	|	ТЧ.Исполнитель КАК Исполнитель,
	|	ТЧ.Организация КАК Организация,
	|	ТЧ.КритичностьДефекта КАК КритичностьДефекта,
	|	ТЧ.СтатусОР КАК СтатусОР,
	|	ТЧ.Подразделение КАК Подразделение,
	|	ТЧ.ВведенаЗаявка КАК ВведенаЗаявка,
	|	ТЧ.ПриоритетОР КАК ПриоритетОР,
	|	ТЧ.СостояниеОР КАК СостояниеОР,
	|	ТЧ.Завершенные КАК Завершенные,
	|	ТЧ.ГарантийныйРемонт КАК ГарантийныйРемонт,
	|	ТЧ.СтатусДокумента КАК СтатусДокумента,
	|	ТЧ.IDОсновного КАК IDОсновного,
	|	ТЧ.Бригада КАК Бригада,
	|	ТЧ.СпособВыполнения КАК СпособВыполнения,
	|	ТЧ.гкс_СимптомДефекта КАК гкс_СимптомДефекта,
	|	ТЧ.ДефектОписание КАК ДефектОписание,
	|	ТЧ.гкс_СрочностьВоздействия КАК гкс_СрочностьВоздействия,
	|	ЕСТЬNULL(ЗавершенныеАкты.гкс_РаботыВыполнены, ЛОЖЬ) КАК гкс_РаботыВыполнены
	|{ВЫБРАТЬ
	|	ID_Ремонта,
	|	Документ,
	|	ТипДокумента,
	|	ДокументПлановыхДат,
	|	ПодрПлановыхДат,
	|	Перенесенный,
	|	ОбъектРемонта,
	|	ВидРемонта,
	|	ПланируемаяДатаНачалаРемонта,
	|	ПланируемаяДатаОкончанияРемонта,
	|	Исполнитель,
	|	Организация,
	|	КритичностьДефекта,
	|	СтатусОР,
	|	Подразделение,
	|	ВведенаЗаявка,
	|	ПриоритетОР,
	|	СостояниеОР,
	|	Завершенные,
	|	ГарантийныйРемонт,
	|	СтатусДокумента,
	|	IDОсновного,
	|	Бригада,
	|	СпособВыполнения,
	|	гкс_СимптомДефекта,
	|	ДефектОписание,
	|	гкс_СрочностьВоздействия,
	|	гкс_РаботыВыполнены}
	|ИЗ
	|	ВесьРезультат КАК ТЧ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_НастройкиСтатусовСогласованияДокументов КАК РегистрСведенийторо_НастройкиСтатусовСогласованияДокументов
	|		ПО (РегистрСведенийторо_НастройкиСтатусовСогласованияДокументов.СпособСогласования = ТЧ.Документ.СпособСогласования)
	|			И (РегистрСведенийторо_НастройкиСтатусовСогласованияДокументов.Статус = ТЧ.СтатусСогласования)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗавершенныеАкты КАК ЗавершенныеАкты
	|		ПО (ЗавершенныеАкты.ИД = ТЧ.ID_Ремонта)
	|ГДЕ
	|	(РегистрСведенийторо_НастройкиСтатусовСогласованияДокументов.Статус ЕСТЬ NULL
	|			ИЛИ РегистрСведенийторо_НастройкиСтатусовСогласованияДокументов.НеИспользоватьВПодборах = ЛОЖЬ)
	|{ГДЕ
	|	ТЧ.ДокументПлановыхДат.*}";
	
	Если НЕ Объект.ИспользоватьОтборПоПодразделению Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
		                    "торо_ВнешниеОснованияДляРабот.Подразделение В(&Исполнитель)",
		                    "ИСТИНА");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

&НаСервере
Процедура гкс_УстановитьУсловноеОформлениеНаПриоритетОР()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_КатегорииРиска.Ссылка КАК КатегорииРиска,
	|	торо_КатегорииРиска.Представление КАК Представление,
	|	торо_КатегорииРиска.Цвет КАК Цвет
	|ИЗ
	|	Справочник.торо_КатегорииРиска КАК торо_КатегорииРиска";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ЭлементУсловногоОформления = Ремонты.УсловноеОформление.Элементы.Добавить();
		ЭлементУсловногоОформления.Представление = ""+Выборка.Представление;
		
		ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПриоритетОР"); 
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
		ЭлементОтбора.ПравоеЗначение = Выборка.КатегорииРиска;
		
		ЦветФона = Выборка.Цвет.Получить();
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФона);
		  
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить(); 
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ПриоритетОР");
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура дс_ЛокализоватьЗаголовкиКолонок()
	ЗаголовкиКолонок = Новый Соответствие;
	
	ЗаголовкиКолонок.Вставить("РемонтыДокументПлановыхДат", 				
	НСтр("es='Documento de fechas del plan';ru='Документ плановых дат';en='Planning dates document'"));
	ЗаголовкиКолонок.Вставить("РемонтыВидРемонта", 							
	НСтр("es='El tipo de la reparación';ru='Вид ремонта';en='Type of repair'"));
	ЗаголовкиКолонок.Вставить("РемонтыСостояниеОР", 						
	НСтр("en='EI status';es='El estado ОР';ru='Состояние ОР'"));
	ЗаголовкиКолонок.Вставить("РемонтыПриоритетОР", 						
	НСтр("es='EI priority';ru='Приоритет ОР';en='EI priority'"));
	ЗаголовкиКолонок.Вставить("РемонтыСтатусДокумента", 					
	НСтр("es='El estatus del documento';ru='Статус документа';en='Document status'"));
	ЗаголовкиКолонок.Вставить("ЗаявкиНаРемонтДокументЗаявка", 				
	НСтр("es='Solicitud de documento';ru='Документ заявка';en='Document application'"));
	ЗаголовкиКолонок.Вставить("НарядыНаРемонтДокументНаряд", 				
	НСтр("es='Conjunto de documentos';ru='Документ наряд';en='Document outfit'"));
	ЗаголовкиКолонок.Вставить("АктыНаРемонтДокументАкт", 					
	НСтр("es='Acta de documento';ru='Документ акт';en='Document act'"));
	ЗаголовкиКолонок.Вставить("МероприятияПланируемаяДатаОкончанияРемонта", 
	НСтр("es='Fecha de finalización planificada';ru='Планируемая дата окончания ремонта';"
		+ "en='Planned completion date of repair'"));
	ЗаголовкиКолонок.Вставить("МероприятияДокументПлановыхДат", 			
	НСтр("es='Documento de fechas del plan';ru='Документ плановых дат';en='Planning dates document'"));
	ЗаголовкиКолонок.Вставить("МероприятияОбъектРемонта", 					
	НСтр("es='El objeto de la reparación';ru='Объект ремонта';en='Equipment Item'"));
	ЗаголовкиКолонок.Вставить("МероприятияВидРемонта", 						
	НСтр("es='El tipo de la reparación';ru='Вид ремонта';en='Type of repair'"));
	ЗаголовкиКолонок.Вставить("МероприятияИсполнитель", 					
	НСтр("es='El ejecutor';ru='Исполнитель';en='Executor'"));
	ЗаголовкиКолонок.Вставить("НарядыНаМероприятияДокументНаряд", 			
	НСтр("es='Conjunto de documentos';ru='Документ наряд';en='Document outfit'"));
	ЗаголовкиКолонок.Вставить("АктыПоМероприятиюДокументАкт", 				
	НСтр("es='Acta de documento';ru='Документ акт';en='Document act'"));
	
	Для каждого ЗаголовокКолонки Из ЗаголовкиКолонок Цикл
		Элементы[ЗаголовокКолонки.Ключ].Заголовок = ЗаголовокКолонки.Значение;
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура дс_ЛокализоватьСписокРемонтов()
	ТекстЗапроса = Ремонты.ТекстЗапроса;
	
	Переводы = Новый Соответствие;

	Переводы.Вставить("УстраненВнешнееОснование", НСтр("es='Eliminado (externa de la base)';
		|ru='Устранен (внешнее основание)';en='Eliminated (external base)'"));
	Переводы.Вставить("СтатусНеОпределен", НСтр("es='El estado no definido';ru='Статус не определен';
		|en='Status is not defined'"));
	Переводы.Вставить("УстраняетсяВнешнееОснование", НСтр("es='Resuelve el problema (externa de la base)';
		|ru='Устраняется (внешнее основание)';en='Eliminated (external base)'"));
	Переводы.Вставить("ЗарегистрированВнешнееОснование", НСтр("es='Registrado (externa de la base)';
		|ru='Зарегистрирован (внешнее основание)';en='Registered (external base)'"));
	Переводы.Вставить("ЗапланированоУстранениеВнешнееОснование", НСтр("es='Está prevista la solución de 
		|(externa de la base)';ru='Запланировано устранение (внешнее основание)';
		|en='The planned elimination of (outer base)'"));
	Переводы.Вставить("ВыполненПланГрафикППР", НСтр("es='Ejecutado (el horario de la parada)';
		|ru='Выполнен (план-график ППР)';en='Done (plan-schedule PPM)'"));
	Переводы.Вставить("ВнешнееОснованиеДляРабот", НСтр("es='Externa de base para los trabajos de';
		|ru='Внешнее основание для работ';en='External base for work'"));
	Переводы.Вставить("УстраненВыявленныйДефект", НСтр("es='Eliminado (detectado el defecto)';
		|ru='Устранен (выявленный дефект)';en='Eliminated (revealed defect)'"));
	Переводы.Вставить("НеУстановлено", НСтр("es='No se establece';ru='Не установлено';en='Not installed'"));
	Переводы.Вставить("ВыполняетсяПланГрафикППР", НСтр("es='Se ejecuta (el horario de la parada)';
		|ru='Выполняется (план-график ППР)';en='Hold true (plan-schedule PPM)'"));
	Переводы.Вставить("ЗапланированоВыполнениеПланГрафикППР", НСтр("es='Está prevista la ejecución (el horario de 
		|la parada)';ru='Запланировано выполнение (план-график ППР)';en='Scheduled execution (plan-schedule PPM)'"));
	Переводы.Вставить("ВведенППРПланГрафикППР", НСтр("es='Introducido parada (el horario de la parada)';
		|ru='Введен ППР (план-график ППР)';en='Introduced PPM (plan-schedule PPM)'"));
	Переводы.Вставить("ПланГрафикППР", НСтр("es='El horario de la parada';ru='План-график ППР';en='Schedule PPM'"));
	Переводы.Вставить("УстраняетсяВыявленныйДефект", НСтр("es='Resuelve el problema (descripción defecto)';
		|ru='Устраняется (выявленный дефект)';en='Eliminated (revealed defect)'"));
	Переводы.Вставить("ЗапланированоУстранениеВыявленныйДефект", НСтр("es='Está prevista la solución de 
		|(detectado el defecto)';ru='Запланировано устранение (выявленный дефект)';
		|en='The planned elimination of (detected defect)'"));
	Переводы.Вставить("ЗарегистрированВыявленныйДефект", НСтр("es='Registrado (detectado el defecto)';
		|ru='Зарегистрирован (выявленный дефект)';en='Registered (detected defect)'"));
	Переводы.Вставить("ВыявленныеДефекты", НСтр("es='Los defectos identificados';
		|ru='Выявленные дефекты';en='Defects Identified'"));

	СтрокиЗаменты = Новый Соответствие;

	СтрокиЗаменты.Вставить("""Устранен (внешнее основание)""", "&УстраненВнешнееОснование");
	СтрокиЗаменты.Вставить("""Статус не определен""", "&СтатусНеОпределен");
	СтрокиЗаменты.Вставить("""Устраняется (внешнее основание)""", "&УстраняетсяВнешнееОснование");
	СтрокиЗаменты.Вставить("""Зарегистрирован (внешнее основание)""", "&ЗарегистрированВнешнееОснование");
	СтрокиЗаменты.Вставить("""Запланировано устранение (внешнее основание)""",
		"&ЗапланированоУстранениеВнешнееОснование");
	СтрокиЗаменты.Вставить("""Выполнен (план-график ППР)""", "&ВыполненПланГрафикППР");
	СтрокиЗаменты.Вставить("""Внешнее основание для работ""", "&ВнешнееОснованиеДляРабот");
	СтрокиЗаменты.Вставить("""Устранен (выявленный дефект)""", "&УстраненВыявленныйДефект");
	СтрокиЗаменты.Вставить("""Не установлено""", "&НеУстановлено");
	СтрокиЗаменты.Вставить("""Выполняется (план-график ППР)""", "&ВыполняетсяПланГрафикППР");
	СтрокиЗаменты.Вставить("""Запланировано выполнение (план-график ППР)""", "&ЗапланированоВыполнениеПланГрафикППР");
	СтрокиЗаменты.Вставить("""Введен ППР (план-график ППР)""", "&ВведенППРПланГрафикППР");
	СтрокиЗаменты.Вставить("""План-график ППР""", "&ПланГрафикППР");
	СтрокиЗаменты.Вставить("""Устраняется (выявленный дефект)""", "&УстраняетсяВыявленныйДефект");
	СтрокиЗаменты.Вставить("""Запланировано устранение (выявленный дефект)""",
		"&ЗапланированоУстранениеВыявленныйДефект");
	СтрокиЗаменты.Вставить("""Зарегистрирован (выявленный дефект)""", "&ЗарегистрированВыявленныйДефект");
	СтрокиЗаменты.Вставить("""Выявленные дефекты""", "&ВыявленныеДефекты");

	Для каждого КодЗамены Из СтрокиЗаменты Цикл
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, КодЗамены.Ключ, КодЗамены.Значение);
	КонецЦикла;
	
	Ремонты.ТекстЗапроса = ТекстЗапроса;
	
	Для каждого Перевод Из Переводы Цикл
		Ремонты.Параметры.УстановитьЗначениеПараметра(Перевод.Ключ, Перевод.Значение);
	КонецЦикла; 
	
КонецПроцедуры
// гкс- [Релиз 1] Куст 17.03.2020

// гкс+ [разработка 2021] Куст 28.04.2021
&НаСервере
Процедура гкс_ОбновитьТекущийАктПриемки(ИД)
	Элементы["гкс_СоздатьАктПриемкиКнопка"].Видимость = Истина;
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ДокТЧ.Ссылка КАК Ссылка,
			|	ДокТЧ.Ссылка.Проведен КАК Проведен
			|ИЗ
			|	Документ.торо_АктПриемкиОборудования.РемонтыОборудования КАК ДокТЧ
			|ГДЕ
			|	ДокТЧ.ID = &ИД
			|	И ДокТЧ.Ссылка.ПометкаУдаления = ЛОЖЬ
			|
			|УПОРЯДОЧИТЬ ПО
			|	Проведен УБЫВ";
		
		Запрос.УстановитьПараметр("ИД", ИД);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() = Ложь Тогда 
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			ЭтотОбъект["гкс_ТекущийАктПриемки"] = Выборка.Ссылка;
			Элементы["гкс_ТекущийАктКнопка"].Заголовок = Строка(Выборка.Ссылка);
			Элементы["гкс_СоздатьАктПриемкиКнопка"].Видимость = Ложь;
		КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура гкс_СоздатьАктПриемки(Команда)
	Если ЗначениеЗаполнено(ЭтотОбъект["гкс_ТекущийАктПриемки"]) Тогда 
		ПоказатьЗначение(, ЭтотОбъект["гкс_ТекущийАктПриемки"]);
		Возврат;
	КонецЕсли;
	//
	ВыполнитьВводДокументаНаОсновании("торо_АктПриемкиОборудования", НСтр("ru='акт приемки';
							|en='equipment acceptance certificate';
							|es='el acta de la recepción de la maquinaria'"));
КонецПроцедуры

&НаКлиенте
Процедура гкс_ТекущийАкт(Команда)
	ПоказатьЗначение(, ЭтотОбъект["гкс_ТекущийАктПриемки"]);
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("РемонтыПриАктивизацииСтроки")
Процедура гкс_РемонтыПриАктивизацииСтроки(Элемент)

	Если ФлагПереходаСтраницы Тогда

		ВосстановлениеТекущихСтрок();
		ФлагПереходаСтраницы = Ложь;

	КонецЕсли;

	#Удаление
	ТекДанные = Элементы.Ремонты.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда
		Элементы.ФормаОткрытьЗакрытиеЗаявокИРемонтов.Доступность = Не ВыбраныТолькоВО(); 
	КонецЕсли; 
	#КонецУдаления
	#Вставка
	Элементы.ФормаОткрытьЗакрытиеЗаявокИРемонтов.Доступность = Истина; 
	// гкс+ [разработка 2021] Куст 28.04.2021
	ТекДанные = Элементы.Ремонты.ТекущиеДанные;
	Если Не ТекДанные = Неопределено
		И Не ТекДанные.ID_Ремонта = ЭтотОбъект["гкс_ТекущийИД"] Тогда 
		ЭтотОбъект["гкс_ТекущийИД"] = ТекДанные.ID_Ремонта;
		ЭтотОбъект["гкс_ТекущийАктПриемки"] = Неопределено;
		Элементы["гкс_ТекущийАктКнопка"].Заголовок = "Нет акта";
		ПодключитьОбработчикОжидания("гкс_РемонтыПриАктивизацииСтрокиЧерезСекунду", 0.2, Истина);
	КонецЕсли;
	// гкс- [разработка 2021] Куст 28.04.2021
	#КонецВставки

	УстановитьФильтрПоРемонту();

КонецПроцедуры

&НаКлиенте
Процедура гкс_РемонтыПриАктивизацииСтрокиЧерезСекунду()
	ТекДанные = Элементы.Ремонты.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		гкс_ОбновитьТекущийАктПриемки(ТекДанные.ID_Ремонта);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ЗаполнитьСписокВыбораОтбораПоСтатусуДокумента")
Процедура гкс_ЗаполнитьСписокВыбораОтбораПоСтатусуДокумента()

	СписокЗначений = Элементы.ОтборПоСтатусуДокумента.СписокВыбора;
	#Удаление
	СписокЗначений.Добавить("Статус не определен");
	#КонецУдаления
	#Вставка
	СписокЗначений.Добавить(НСтр("es='Estado indefinido';ru='Статус не определен';en='Status is not defined'"));
	#КонецВставки
	СписокЗначений.Добавить(ПредопределенноеЗначение("Перечисление.торо_СтатусыДокументов.Зарегистрирован"));
	СписокЗначений.Добавить(ПредопределенноеЗначение("Перечисление.торо_СтатусыДокументов.ЗапланированоУстранение"));
	СписокЗначений.Добавить(ПредопределенноеЗначение("Перечисление.торо_СтатусыДокументов.Устраняется"));
	СписокЗначений.Добавить(ПредопределенноеЗначение("Перечисление.торо_СтатусыДокументов.Устранен"));
	СписокЗначений.Добавить(ПредопределенноеЗначение("Перечисление.торо_СтатусыДокументов.Отклонен"));

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ОбязательныеПроверкиПередВводомНаОсновании")
Функция гкс_ОбязательныеПроверкиПередВводомНаОсновании(ЭлементФормыТаблица, МассивДанныхСтрок)

	ТекДанные = ЭлементФормыТаблица.ТекущиеДанные;

	Если ТекДанные = Неопределено Тогда
		#Удаление
		ТекстСообщения = НСтр("ru = 'Выберите ремонт!'");
		#КонецУдаления
		#Вставка
		ТекстСообщения = НСтр("es='¡Escojan la reparación!';ru='Выберите ремонт!';en='Choose a repair!'");
		#КонецВставки
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецЕсли;

	МассивВыделенныхСтрок = ПолучитьМассивВыделенныхСтрокРемонтов(ЭлементФормыТаблица);

	ОбработатьОстановочныеРемонтыИЗакрытия(МассивВыделенныхСтрок);

	КолЗавершенных = 0;

	Для Каждого Строка Из МассивВыделенныхСтрок Цикл

		Если ЗначениеЗаполнено(Строка.Завершенные) Тогда
			Если ТипЗнч(Строка.Завершенные) = Тип("Строка")или Строка.Завершенные  Тогда
				КолЗавершенных = КолЗавершенных + 1;
			Иначе
				Структура = Новый Структура("ОбъектРемонта, ВидРемонта, ПланируемаяДатаНачалаРемонта, ID_Ремонта, Документ, ТипДокумента"
				, Строка.ОбъектРемонта
				, Строка.ВидРемонта
				, Строка.ПланируемаяДатаНачалаРемонта
				, Строка.ID_Ремонта
				, Строка.Документ
				, Строка.ТипДокумента);
				МассивДанныхСтрок.Добавить(Структура);
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;

	Если КолЗавершенных > 0 Тогда
		#Удаление
		ТекстСообщения = НСтр("ru = 'В списке выбранных ремонтов есть завершенные!'");
		#КонецУдаления
		#Вставка
		ТекстСообщения = НСтр("es='¡En la lista de las reparaciones escogidas es acabado!';ru='В списке выбранных "
		+"ремонтов есть завершенные!';en='In the list of selected repairs are completed!'");
		#КонецВставки
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;

КонецФункции

&НаКлиенте
&ИзменениеИКонтроль("ДляВсехРемонтовЕстьОснование")
Функция гкс_ДляВсехРемонтовЕстьОснование(МассивДанныхСтрок, СоответствиеРемонтовИОснований, ПредставлениеДокументаДляПользователя)

	// Проверим, по всем ли ремонтам нашлось хотя бы одно основание.
	МассивДокументовБезОснований = Новый Массив;
	Для каждого Строка Из МассивДанныхСтрок Цикл
		МассивОснований = СоответствиеРемонтовИОснований[Строка.ID_Ремонта];
		Если МассивОснований = Неопределено И МассивДокументовБезОснований.Найти(Строка.Документ) = Неопределено Тогда
			МассивДокументовБезОснований.Добавить(Строка.Документ);                                
		КонецЕсли;
	КонецЦикла; 

	Если МассивДокументовБезОснований.Количество() > 0 Тогда
		Если МассивДанныхСтрок.Количество() = 1 Тогда
			#Удаление
			ШаблонСообщения = НСтр("ru = 'Настроки ввода на основании запрещают ввести %1 на основании выбранного документа.
			|Настройка и администрирование -> Настройка параметров подсистемы ТОиР -> Интрерфейс и ввод документов -> Настройка ввода на основании.'");
			#КонецУдаления
			#Вставка
			ШаблонСообщения = НСтр("es='Настроки de la introducción a la razón prohíben introducir %1 en razon del "
			+"documento escogido. 
			|El ajuste y la administración-> el Ajuste de los parámetros del subsistema ТОиР-> Intrerfeys y la introducción de "
			+"los documentos-> el Ajuste de la introducción a la razón.';ru='Настроки ввода на основании запрещают ввести %1 на "
			+"основании выбранного документа.
			|Настройка и администрирование -> Настройка параметров подсистемы ТОиР -> Интрерфейс и ввод документов -> Настройка "
			+"ввода на основании.';en='Based on input settings prohibit entering%1 based on the selected document.
			|Setting up and administration -> Setting the parameters of the MRO subsystem -> Interface and document input -> "
			+"Setting input based on.'");
			#КонецВставки
		ИначеЕсли МассивДанныхСтрок.Количество() > 1 Тогда
			#Удаление
			ШаблонСообщения = НСтр("ru = 'Настроки ввода на основании запрещают ввести %1 на основании некоторых выбранных документов.
			|Настройка и администрирование -> Настройка параметров подсистемы ТОиР -> Интрерфейс и ввод документов -> Настройка ввода на основании.'");
			#КонецУдаления
			#Вставка
			ШаблонСообщения = НСтр("es='Настроки de la introducción a la razón prohíben introducir %1 en razon de "
			+"algunos documentos escogidos. 
			|El ajuste y la administración-> el Ajuste de los parámetros del subsistema ТОиР-> Intrerfeys y la introducción de "
			+"los documentos-> el Ajuste de la introducción a la razón.';ru='Настроки ввода на основании запрещают ввести %1 на "
			+"основании некоторых выбранных документов.
			|Настройка и администрирование -> Настройка параметров подсистемы ТОиР -> Интрерфейс и ввод документов -> Настройка "
			+"ввода на основании.';en='Based on input settings prohibit entering%1 based on some selected documents.
			|Setting up and administration -> Setting the parameters of the MRO subsystem -> Interface and document input -> "
			+"Setting input based on.'");
			#КонецВставки
		КонецЕсли;
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ПредставлениеДокументаДляПользователя);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;

КонецФункции

&НаКлиенте
Процедура гкс_ИспользоватьОтборСрочностьВоздействияПриИзменении(Элемент)
	УстановитьПараметрыДинамическогоСпискаКлиент();
КонецПроцедуры // гкс- [8220] Тарасов 19.10.2020

&НаКлиенте
Процедура гкс_ОтборСрочностьВоздействияПриИзменении(Элемент)
	Если ЭтотОбъект["гкс_ИспользоватьОтборСрочностьВоздействия"] = Истина Тогда 
		УстановитьПараметрыДинамическогоСпискаКлиент();
	КонецЕсли;
КонецПроцедуры // гкс- [8220] Тарасов 19.10.2020

&НаСервере
&ИзменениеИКонтроль("УстановитьЗапросИПараметрыДинСпискаАктов")
Процедура гкс_УстановитьЗапросИПараметрыДинСпискаАктов()

	Если Не ИспользоватьУправлениеРемонтами Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ID КАК ID_Ремонта,
	|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка КАК ДокументАкт,
	|	ВЫБОР
	|		КОГДА торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка.Проведен
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Картинка
	#Вставка
	|	,торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка.гкс_РаботыВыполнены КАК гкс_РаботыВыполнены
	|	,торо_ТекущиеСтатусыСогласованияДокументов.СтатусДокумента КАК гкс_Статус
	#КонецВставки
	|ИЗ
	|	Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК торо_АктОВыполненииЭтапаРаботРемонтыОборудования
	#Вставка
	// гкс+ [11.22] Деснол 03.11.2022
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ТекущиеСтатусыСогласованияДокументов КАК торо_ТекущиеСтатусыСогласованияДокументов
	|	ПО торо_ТекущиеСтатусыСогласованияДокументов.СогласуемыйДокумент = торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка
	// гкс- [11.22] Деснол 03.11.2022
	#КонецВставки
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ПоказыватьНепроведенные
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка.Проведен
	|		КОНЕЦ
	|	И НЕ торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка.ПометкаУдаления";

	АктыНаРемонт.ТекстЗапроса = Запрос.Текст;
	АктыНаРемонт.Параметры.УстановитьЗначениеПараметра("ПоказыватьНепроведенные", Объект.НеПроведенные);

	Элементы.АктыНаРемонт.АвтоОбновление = Объект.АвтоматическоеОбновление;
	Элементы.АктыНаРемонт.ПериодАвтоОбновления = Объект.ПериодОбновления;

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("УстановитьУсловноеОформление")
Процедура гкс_УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	Если РежимВыделенияСтрок = "По критичности" Тогда
		Для каждого Стр Из ТаблицаКритичности Цикл

			ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();

			ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле         = Новый ПолеКомпоновкиДанных("Ремонты");

			ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Ремонты.КритичностьДефекта");
			ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = Стр.Критичность;
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Стр.Цвет);

		КонецЦикла;

	ИначеЕсли РежимВыделенияСтрок = "По приоритету объекта ремонта" Тогда

		Для каждого Стр Из ТаблицаПриоритетностиОР Цикл

			ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();

			ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле         = Новый ПолеКомпоновкиДанных("Ремонты");

			ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Ремонты.ПриоритетОР");
			ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = Стр.Приоритет;
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Стр.Цвет);

		КонецЦикла;

	ИначеЕсли РежимВыделенияСтрок = "По наработке объекта ремонта" Тогда

		Для каждого Стр Из ТаблицаНаработки Цикл

			ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();

			ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле         = Новый ПолеКомпоновкиДанных("Ремонты");

			ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Ремонты.Отклонение");
			ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = Стр.Наработка;

			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Стр.Цвет);

		КонецЦикла;

	КонецЕсли;
	#Вставка
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();

	ОформляемоеПоле  = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле         = Новый ПолеКомпоновкиДанных("Ремонты");

	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Ремонты.гкс_РаботыВыполнены");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;

	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(100,255,100));
	#КонецВставки

	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();

	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле         = Новый ПолеКомпоновкиДанных("Ремонты");

	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Ремонты.Завершенные");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;

	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(201,226,255));

	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();

	ОформляемоеПоле  = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле         = Новый ПолеКомпоновкиДанных("Мероприятия");

	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Мероприятия.Завершенные");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;

	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(201,226,255));

	// функциональные опции
	Элементы.СтраницаРемонты.Видимость                 = ИспользоватьУправлениеРемонтами;
	Элементы.СтраницаРегламентныеМероприятия.Видимость = ФОИспользоватьРегламентныеМероприятия;
	Элементы.ГруппаНарядыНаМероприятия.Видимость = ФОИспользоватьНарядыНаРегламентныеМероприятия;
	Элементы.РемонтыВведенаЗаявка.Видимость            = ИспользоватьУправлениеРемонтами И ФОИспользоватьСметы;
	Элементы.ГруппаЗаявкиНаРемонт.Видимость            = ИспользоватьУправлениеРемонтами И ФОИспользоватьСметы;
	Элементы.ГруппаНарядыНаРемонт.Видимость            = ИспользоватьУправлениеРемонтами И ФОИспользоватьНаряды;
	Элементы.ГруппаСтатусДокумента.Видимость = ФОИспользоватьСтатусыДокументов И (Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаРемонты);
	Элементы.РемонтыСтатусДокумента.Видимость = ФОИспользоватьСтатусыДокументов;

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ВыполнитьВводДокументаНаОсновании")
Процедура гкс_ВыполнитьВводДокументаНаОсновании(ТипВводимогоДокумента, ПредставлениеДокументаВВинПадеже)

	Если ТипВводимогоДокумента = "торо_НарядНаРегламентноеМероприятие"
		ИЛИ ТипВводимогоДокумента = "торо_АктОВыполненииРегламентногоМероприятия" Тогда
		ЭлементФормыТаблица = Элементы.Мероприятия;
	Иначе
		ЭлементФормыТаблица = Элементы.Ремонты;
	КонецЕсли;

	МассивДанныхСтрок = Новый Массив;
	Если НЕ ОбязательныеПроверкиПередВводомНаОсновании(ЭлементФормыТаблица, МассивДанныхСтрок) Тогда
		Возврат;
	КонецЕсли;

	ЗаполнитьТаблицуВводаНаОсновании();

	МассивРемонтовППР = Новый Массив;
	Для каждого Строка Из МассивДанныхСтрок Цикл
		Если ТипЗнч(Строка.Документ) = Тип("ДокументСсылка.торо_ПланГрафикРемонта")
			ИЛИ ТипЗнч(Строка.Документ) = Тип("ДокументСсылка.торо_ГрафикРегламентныхМероприятийТОиР") Тогда
			МассивРемонтовППР.Добавить(Строка.ID_Ремонта);
		КонецЕсли;
	КонецЦикла;

	СоответствиеКорректировокППР = Новый Соответствие;
	Если МассивРемонтовППР.Количество() > 0 Тогда
		ЗаполнитьСоответствиеКорректировокППР(МассивРемонтовППР, СоответствиеКорректировокППР);
	КонецЕсли;

	СоответствиеРемонтовИОснований = Новый Соответствие;

	// Добавление возможных оснований.
	Для каждого Строка Из МассивДанныхСтрок Цикл
		Если ПроверитьВводНаОсновании(Строка.ТипДокумента, ТипВводимогоДокумента) Тогда
			КорректировкаППР = СоответствиеКорректировокППР.Получить(Строка.ID_Ремонта);
			Если КорректировкаППР = Неопределено Тогда
				ВставитьЗначениеВСписокВСоответствии(СоответствиеРемонтовИОснований, Строка.ID_Ремонта, Строка.Документ);
			Иначе
				ВставитьЗначениеВСписокВСоответствии(СоответствиеРемонтовИОснований, Строка.ID_Ремонта, КорректировкаППР);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 

	Если ПроверитьВводНаОсновании("торо_ЗаявкаНаРемонт", ТипВводимогоДокумента) И ФОИспользоватьСметы Тогда

		ТаблицаЗаявок = ПолучитьСвязанныеДокументыПОID(МассивДанныхСтрок, "ЗаявкиНаРемонт", Истина);
		Для каждого Строка из ТаблицаЗаявок Цикл
			ВставитьЗначениеВСписокВСоответствии(СоответствиеРемонтовИОснований, Строка.ID, Строка.Документ);
		КонецЦикла;

	КонецЕсли;

	Если ПроверитьВводНаОсновании("торо_НарядНаВыполнениеРемонтныхРабот", ТипВводимогоДокумента) И ФОИспользоватьНаряды Тогда

		ТаблицаНарядов = ПолучитьСвязанныеДокументыПОID(МассивДанныхСтрок, "НарядыНаРемонт", Истина);
		Для каждого Строка из ТаблицаНарядов Цикл
			ВставитьЗначениеВСписокВСоответствии(СоответствиеРемонтовИОснований, Строка.ID, Строка.Документ);
		КонецЦикла;

	КонецЕсли;

	Если ПроверитьВводНаОсновании("торо_НарядНаРегламентноеМероприятие", ТипВводимогоДокумента) И ФОИспользоватьНарядыНаРегламентныеМероприятия Тогда

		ТаблицаНарядов = ПолучитьСвязанныеДокументыПОID(МассивДанныхСтрок, "НарядыНаМероприятия", Истина);
		Для каждого Строка из ТаблицаНарядов Цикл
			ВставитьЗначениеВСписокВСоответствии(СоответствиеРемонтовИОснований, Строка.ID, Строка.Документ);
		КонецЦикла;

	КонецЕсли;

	Если НЕ ДляВсехРемонтовЕстьОснование(МассивДанныхСтрок, СоответствиеРемонтовИОснований, ПредставлениеДокументаВВинПадеже) Тогда
		Возврат;
	КонецЕсли;

	Если СоответствиеРемонтовИОснований.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	// Проверим, нужно ли открывать форму выбора основания.
	ОткрыватьФормуВыбораОснования = Ложь;
	Для каждого КлючИЗначение из СоответствиеРемонтовИОснований Цикл
		Если КлючИЗначение.Значение.Количество() > 1 Тогда
			ОткрыватьФормуВыбораОснования = Истина;
		КонецЕсли;
	КонецЦикла;
	#Вставка
	Если ТипВводимогоДокумента = "" Тогда 
		ОткрыватьФормуВыбораОснования = Ложь;
		Для Каждого КлючИЗначение Из СоответствиеРемонтовИОснований Цикл
			Если КлючИЗначение.Значение.Количество() > 1 Тогда 
				Для Каждого СтрокаМассива Из КлючИЗначение.Значение Цикл
					Если ТипЗнч(СтрокаМассива) = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") Тогда 
						ТемпМассив = Новый Массив();
						ТемпМассив.Добавить(СтрокаМассива);
						СоответствиеРемонтовИОснований.Вставить(КлючИЗначение.Ключ, ТемпМассив);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	#КонецВставки

	Если ОткрыватьФормуВыбораОснования Тогда

		Оповещение = Новый ОписаниеОповещения("ВыборОснованийДляДокумента",ЭтаФорма,Новый Структура("СоздаваемыйДокумент", ТипВводимогоДокумента));

		СтруктураДанныхДляВыбораОснований = Новый Структура;
		СтруктураДанныхДляВыбораОснований.Вставить("СоответствиеРемонтовИОснований" , СоответствиеРемонтовИОснований);
		СтруктураДанныхДляВыбораОснований.Вставить("МассивВыделенныхСтрок" , МассивДанныхСтрок);

		ОткрытьФорму("Обработка.торо_РабочееМестоТехническогоСпециалиста.Форма.ФормаВыбораОснования",СтруктураДанныхДляВыбораОснований,ЭтаФорма,,ВариантОткрытияОкна.ОтдельноеОкно,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	Иначе

		ОписаниеОповещения = Новый ОписаниеОповещения("ВызватьОбработчикОповещения",ЭтаФорма,Новый Структура("ИмяСобытия, Источник", "СозданДокументЧерезРМТехСпец", Тип("ДокументСсылка."+ТипВводимогоДокумента)));

		СоответствиеИДДокументам = Новый Соответствие;
		Для каждого КлючИЗначение Из СоответствиеРемонтовИОснований Цикл
			Если КлючИЗначение.Значение.Количество() > 0 Тогда
				СоответствиеИДДокументам.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение[0]);
			КонецЕсли;
		КонецЦикла; 

		СоздатьДокументИОткрытьФорму("Документ."+ТипВводимогоДокумента+".ФормаОбъекта", СоответствиеИДДокументам, ОписаниеОповещения);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ДокументОстановочногоПриИзменении")
Процедура гкс_ДокументОстановочногоПриИзменении(Элемент)

	Ремонты.Отбор.Элементы.Удалить(ИндексОтбораПоОстановочным);
	Если ЗначениеЗаполнено(ДокументОстановочного) Тогда
		#Удаление
		IDОсновногоРемонта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОстановочного, "IDОсновногоРемонта");
		#КонецУдаления

		ЭлементОтбора = Ремонты.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("IDОсновного");
		#Удаление
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = IDОсновногоРемонта;
		#КонецУдаления
		#Вставка
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение = гкс_ПолучитьИДОстановочного(ДокументОстановочного);
		#КонецВставки
		ЭлементОтбора.Использование = Истина;
		ИндексОтбораПоОстановочным = Ремонты.Отбор.Элементы.Индекс(ЭлементОтбора);
	Иначе
		ЭлементОтбора = Ремонты.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("IDОсновного");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
		ЭлементОтбора.Использование = Истина;
		ИндексОтбораПоОстановочным = Ремонты.Отбор.Элементы.Индекс(ЭлементОтбора);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция гкс_ПолучитьИДОстановочного(ДокСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Док.гкс_Сводный КАК Сводный,
		|	Док.IDОсновногоРемонта КАК ИД
		|ИЗ
		|	Документ.торо_ОстановочныеРемонты КАК Док
		|ГДЕ
		|	Док.Ссылка = &ДокСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДокТЧ.ID КАК ИД
		|ИЗ
		|	Документ.торо_ОстановочныеРемонты.СвязанныеРемонты КАК ДокТЧ
		|ГДЕ
		|	ДокТЧ.Ссылка = &ДокСсылка";
	
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Пакет1 = 0;
	Пакет2 = Пакет1 + 1;
	ВыборкаДок = РезультатЗапроса[Пакет1].Выбрать();
	ТемпМассив = Новый Массив();
	Если ВыборкаДок.Следующий() Тогда 
		Если ВыборкаДок.Сводный Тогда 
			Выборка = РезультатЗапроса[Пакет2].Выбрать();
			Пока Выборка.Следующий() Цикл
				ТемпМассив.Добавить(Выборка.ИД);
			КонецЦикла;
		Иначе
			ТемпМассив.Добавить(ВыборкаДок.ИД);
		КонецЕсли;
	КонецЕсли;
	Возврат ТемпМассив;
КонецФункции

&НаКлиенте
&ИзменениеИКонтроль("ОбновитьРемонты")
Процедура гкс_ОбновитьРемонты(Команда)

	УстановитьПараметрыДинамическогоСпискаКлиент();

	#Вставка
	гкс_РемонтыПриАктивизацииСтрокиЧерезСекунду();
	#КонецВставки
КонецПроцедуры

// Гкс+[TOIR20-669] Оселедько В.С. от 31.07.2025. Добавлено:{
&НаСервереБезКонтекста
Процедура гкс_ЗавершитьЗамерОткрытияФормы(ВремяНачалаЗамера)
	
    ОценкаПроизводительности.ЗакончитьЗамерВремени("Обработка.торо_РабочееМестоТехническогоСпециалиста.ОткрытиеФормы", ВремяНачалаЗамера); 
	
КонецПроцедуры // Гкс+[TOIR20-669] 

&НаКлиенте
Процедура гкс_ПриОткрытииПосле(Отказ)
	// Гкс+[TOIR20-669] Оселедько В.С. от 31.07.2025. Добавлено:{
	гкс_ЗавершитьЗамерОткрытияФормы(ЭтотОбъект.гкс_ВремяНачалаЗамера);	
	// Гкс+[TOIR20-669]
КонецПроцедуры

#КонецОбласти