
#Область ОбработчикиСобытийФормы

&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура гкс_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.Свойства
	Контекст = Новый Структура();
	Контекст.Вставить("Объект",                     Объект);
	Контекст.Вставить("ИмяЭлементаДляРазмещения",   "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, Контекст);
	// Конец СтандартныеПодсистемы.Свойства

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

	Если Не Объект.Ссылка.Пустая() Тогда
		Серии = Объект.ВидНоменклатуры.НастройкаИспользованияСерий;
	Иначе		
		Если Параметры.Свойство("Родитель") Тогда
			Объект.Родитель = Параметры.Родитель;
		КонецЕсли;
		Если Параметры.Свойство("ВидНоменклатуры") И Параметры.ВидНоменклатуры <> Неопределено Тогда
			Объект.ВидНоменклатуры = Параметры.ВидНоменклатуры;
			Объект.ТипНоменклатуры = Параметры.ВидНоменклатуры.ТипНоменклатуры;
			Объект.ИспользованиеХарактеристик = Параметры.ВидНоменклатуры.ИспользованиеХарактеристик;
			Серии = Параметры.ВидНоменклатуры.НастройкаИспользованияСерий;
		КонецЕсли
	КонецЕсли;

	Элементы.Серии.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатуры");

	#Вставка
	гкс_ДобавитьИзменитьЭлементыФормы();
	#КонецВставки	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура гкс_ДобавитьИзменитьЭлементыФормы()
	
	Элемент = Элементы.Добавить("гкс_ВидНормализации", Тип("ПолеФормы"), Элементы.НаименованиеПолноеГруппа);
	Элемент.ПутьКДанным = "Объект.гкс_ВидНормализации";
	Элемент.Заголовок = НСтр("ru='Вид нормализации'");	
	Элемент.Вид = ВидПоляФормы.ПолеВвода; // } Гкс-[ERP-2020]    	
	
КонецПроцедуры

#КонецОбласти
