#Область ОбработчикиСобытийФормы

&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура гкс_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Список значений фиксирован, в ходе работы изменяются только пометки
	СписокВыбранныхВидовОборудования.Очистить();
	СписокВыбранныхВидовОборудования.Добавить("ОсновноеОборудование"   , "Основное оборудование"   , Истина);
	СписокВыбранныхВидовОборудования.Добавить("ЗависимоеОборудование"  , "Зависимое оборудование"  , Истина);
	СписокВыбранныхВидовОборудования.Добавить("ПодчиненноеОборудование", "Подчиненное оборудование", Истина);
	#Вставка
	// Гкс+[TOIR20-187] Селимов от 16.12.2020. Добавлено:{
	СписокВыбранныхВидовОборудования.Добавить("ЗависимоеОборудованиеТех"  , "Зависимое оборудование (Тех)"  , Истина);
	СписокВыбранныхВидовОборудования.Добавить("ПодчиненноеОборудованиеТех", "Подчиненное оборудование (Тех)", Истина);
	// } Гкс-[TOIR20-187] 
	// гкс+ [разработка 2021] Куст 30.04.2021
	гкс_ДобавитьНовыеЭлементы();
	Если Параметры.Свойство("гкс_Сводный") Тогда 
		ЭтотОбъект["гкс_Сводный"] = Параметры.гкс_Сводный;
	КонецЕсли;
	гкс_ОбновитьЭлементы();
	// гкс- [разработка 2021] Куст 30.04.2021
	#КонецВставки

	Если Параметры.Свойство("Заголовок", Заголовок) Тогда
		АвтоЗаголовок = Ложь;
	КонецЕсли; 

	Параметры.Свойство("IDОсновногоРемонта"   , IDОсновногоРемонта);
	Параметры.Свойство("ОР"                   , ОбъектРемонта);
	Параметры.Свойство("ВР"                   , ВидРемонта);
	Параметры.Свойство("ДокументИсточник"     , ДокументИсточник);
	Параметры.Свойство("ДатаНачалаРемонта"    , ДатаНачалаРемонта);
	Параметры.Свойство("ДатаОкончанияРемонта" , ДатаОкончанияРемонта);

	ОтборДатаНачала    = ДатаНачалаРемонта;
	ОтборДатаОкончания = ДатаОкончанияРемонта;

	ТекСтруктураИерархии = Константы.торо_ИерархияДляВводаНовыхОР.Получить();

	ОбновитьРемонтыНаСервере();
	#Вставка
	// Гкс+[TOIR20-187] Селимов от 16.12.2020. Добавлено:{
	ДобавитьЭлементыФормы(); // } Гкс-[TOIR20-187]
	#КонецВставки
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИмяТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

// гкс+ [] Деснол 16.09.2022
&НаКлиенте
Процедура гкс_НайтиСтрокуДалее(Команда)
	ТекДанные = Элементы.Ремонты.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		НачальныйНомер = 0;
	Иначе
		НачальныйНомер = ТекДанные.НомерСтроки;
	КонецЕсли;
	НайденныйИд = Неопределено;
	Для Каждого СтрокаТЧ из Ремонты Цикл
		Если СтрокаТЧ.НомерСтроки <= НачальныйНомер Тогда 
			Продолжить;
		КонецЕсли;
		Если гкс_НайденоВСтрокеТЧ(СтрокаТЧ) Тогда
			НайденныйИд = СтрокаТЧ.ПолучитьИдентификатор();
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если НайденныйИд = Неопределено Тогда 
		Для Каждого СтрокаТЧ из Ремонты Цикл
			Если СтрокаТЧ.НомерСтроки > НачальныйНомер Тогда 
				Прервать;
			КонецЕсли;
			Если гкс_НайденоВСтрокеТЧ(СтрокаТЧ) Тогда
				НайденныйИд = СтрокаТЧ.ПолучитьИдентификатор();
				Прервать;
			КонецЕсли;                                                
		КонецЦикла;
	КонецЕсли;
	
	Если НайденныйИд = Неопределено Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "поиск не дал результатов";
		Сообщение.Сообщить();
	Иначе
		Элементы.Ремонты.ТекущаяСтрока = НайденныйИд;
	КонецЕсли;
КонецПроцедуры // гкс- [] Деснол 16.09.2022

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Гкс+[TOIR20-187] Селимов от 16.12.2020. Добавлено:{
&НаСервере
Процедура ДобавитьЭлементыФормы()
	
	Элементы.ОсновноеОборудование.Заголовок = "Основное оборудование (ост)";
	Элементы.ЗависимоеОборудование.Заголовок = "Зависимое оборудование (ост)";
	
	// КОМАНДЫ
	НоваяКоманда = ЭтаФорма.Команды.Добавить("ОсновноеОборудованиеТех");
	НоваяКоманда.Действие = "гкс_ОтборВидОборудования";
	НоваяКоманда.Заголовок = "Основное оборудование (Тех)";
	НовыйЭлемент = Элементы.Добавить("ОсновноеОборудованиеТех", Тип("КнопкаФормы"), 
										Элементы.Группа5);
	НовыйЭлемент.ИмяКоманды = "ОсновноеОборудованиеТех";
	Элементы["ОсновноеОборудованиеТех"].Пометка = Истина;
	
	НоваяКоманда = ЭтаФорма.Команды.Добавить("ЗависимоеОборудованиеТех");
	НоваяКоманда.Действие = "гкс_ОтборВидОборудования";
	НоваяКоманда.Заголовок = "Зависимое оборудование (Тех)";
	НовыйЭлемент = Элементы.Добавить("ЗависимоеОборудованиеТех", Тип("КнопкаФормы"), 
										Элементы.Группа5);
	НовыйЭлемент.ИмяКоманды = "ЗависимоеОборудованиеТех";
	Элементы["ЗависимоеОборудованиеТех"].Пометка = Истина;
	
	// гкс+ [] Деснол 16.09.2022
	#Область ПоляПоиска
	МассРеквизитов = Новый Массив();
	МассРеквизитов.Добавить(Новый РеквизитФормы("гкс_СтрокаПоиска", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(150))));
	ИзменитьРеквизиты(МассРеквизитов);
	//
	НоваяГруппа = Элементы.Вставить("гкс_ГруппаПоиск", Тип("ГруппаФормы"), Элементы.Отборы, Элементы.ГруппаОтборПоВидамОборудования);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.отображатьЗаголовок = Ложь;
	//
	НовыйЭлемент = Элементы.Добавить("гкс_СтрокаПоиска", Тип("ПолеФормы"), Элементы["гкс_ГруппаПоиск"]);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "гкс_СтрокаПоиска";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	//
	НКом = Команды.Добавить("гкс_НайтиСтрокуДалее");
	НКом.Действие = "гкс_НайтиСтрокуДалее";
	НКом.Заголовок = "Найти далее";
	//
	НКноп = Элементы.Добавить("гкс_НайтиСтрокуДалееКнопка", Тип("КнопкаФормы"), Элементы["гкс_ГруппаПоиск"]);
	НКноп.ИмяКоманды = "гкс_НайтиСтрокуДалее";
	НКноп.вид = ВидКнопкиФормы.ОбычнаяКнопка;
	#КонецОбласти
	// гкс- [] Деснол 16.09.2022
КонецПроцедуры   // } Гкс-[TOIR20-187]


// гкс+ [] Деснол 16.09.2022
&НаКлиенте
Функция гкс_НайденоВСтрокеТЧ(СтрокаТЧ)
	СтрокаСтроки = Строка(СтрокаТЧ.ДокументОснование) + Строка(СтрокаТЧ.ОбъектРемонта) + Строка(СтрокаТЧ.ВидРемонтныхРабот)
	+ Строка(СтрокаТЧ.Исполнитель) + Строка(СтрокаТЧ.СпособВыполнения);
	
	Если СтрНайти(СтрокаСтроки, ЭтотОбъект["гкс_СтрокаПоиска"]) > 0 Тогда 
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции // гкс- [] Деснол 16.09.2022

&НаСервере
&ИзменениеИКонтроль("ОбновитьРемонтыНаСервере")
Процедура гкс_ОбновитьРемонтыНаСервере()
	#Вставка
	// гкс+ [разработка 2021] Куст 30.04.2021
	Если ЭтотОбъект["гкс_Сводный"] Тогда 
		гкс_ОбновитьРемонтыДляСводногоНаСервере();
		Возврат;
	КонецЕсли;
	// гкс- [разработка 2021] Куст 30.04.2021
	#КонецВставки

	Запрос = Новый Запрос;

	# Область ТекстЗапроса
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_РемонтыОсновногоЗависимогоОборудования.СвязанныйОбъектРемонта КАК СвязанныйОбъектРемонта,
	|	торо_РемонтыОсновногоЗависимогоОборудования.ВидРемонтаЗависимогоОбъекта КАК ВидРемонтаЗависимогоОбъекта,
	|	ИСТИНА КАК Зависимый
	|ПОМЕСТИТЬ ЗависимыеОбъектыРемонта
	|ИЗ
	|	РегистрСведений.торо_РемонтыОсновногоЗависимогоОборудования КАК торо_РемонтыОсновногоЗависимогоОборудования
	|ГДЕ
	#Удаление
	|	&ЗависимоеОборудование
	#КонецУдаления
	#Вставка
	// Гкс+[TOIR20-187] Селимов от 16.12.2020. Добавлено:{
	|	(&ЗависимоеОборудование ИЛИ &ЗависимоеОборудованиеТех)
	|	И торо_РемонтыОсновногоЗависимогоОборудования.гкс_Остановочная = &ЗависимоеОборудование
	|	И торо_РемонтыОсновногоЗависимогоОборудования.гкс_Технологическая = &ЗависимоеОборудованиеТех
	// } Гкс-[TOIR20-187]
	#КонецВставки
	|	И торо_РемонтыОсновногоЗависимогоОборудования.ОсновнойОбъектРемонта = &ОсновнойОбъектРемонта
	|	И (торо_РемонтыОсновногоЗависимогоОборудования.ВидРемонтаОсновногоОбъекта = &ВидРемонта
	|			ИЛИ торо_РемонтыОсновногоЗависимогоОборудования.ВидРемонтаОсновногоОбъекта = ЗНАЧЕНИЕ(Справочник.торо_ВидыРемонтов.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗависимыеОбъектыРемонта.СвязанныйОбъектРемонта КАК СвязанныйОбъектРемонта,
	|	ЗависимыеОбъектыРемонта.ВидРемонтаЗависимогоОбъекта КАК ВидРемонтаЗависимогоОбъекта,
	|	ИСТИНА КАК Зависимый
	|ПОМЕСТИТЬ ЗависимыеПодчиненныеОбъектыРемонта
	|ИЗ
	|	ЗависимыеОбъектыРемонта КАК ЗависимыеОбъектыРемонта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ОбъектыРемонта.Ссылка,
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ
	|ИЗ
	|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	|ГДЕ
	#Удаление
	|	&ПодчиненноеОборудование
	#КонецУдаления
	#Вставка
	// Гкс+[TOIR20-187] Селимов от 16.12.2020. Добавлено:{
	|	(&ПодчиненноеОборудование ИЛИ &ПодчиненноеОборудованиеТех)
	// } Гкс-[TOIR20-187]
	#КонецВставки
	|	И торо_ОбъектыРемонта.Ссылка В(&МассивПодчиненных)
	|	И НЕ торо_ОбъектыРемонта.Ссылка В
	|				(ВЫБРАТЬ
	|					ЗависимыеОбъектыРемонта.СвязанныйОбъектРемонта КАК СвязанныйОбъектРемонта
	|				ИЗ
	|					ЗависимыеОбъектыРемонта КАК ЗависимыеОбъектыРемонта)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗависимыеПодчиненныеОбъектыРемонта.СвязанныйОбъектРемонта КАК СвязанныйОбъектРемонта,
	|	МАКСИМУМ(ЗависимыеПодчиненныеОбъектыРемонта.Зависимый) КАК Зависимый
	|ПОМЕСТИТЬ ОбъектыЗависимые
	|ИЗ
	|	ЗависимыеПодчиненныеОбъектыРемонта КАК ЗависимыеПодчиненныеОбъектыРемонта
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗависимыеПодчиненныеОбъектыРемонта.СвязанныйОбъектРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗависимыеПодчиненныеОбъектыРемонта.СвязанныйОбъектРемонта КАК СвязанныйОбъектРемонта,
	|	ЗависимыеПодчиненныеОбъектыРемонта.ВидРемонтаЗависимогоОбъекта КАК ВидРемонтаЗависимогоОбъекта,
	|	ЗависимыеПодчиненныеОбъектыРемонта.Зависимый КАК Зависимый,
	|	ВЫБОР
	|		КОГДА ОбъектыЗависимые.Зависимый
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Подчиненный,
	|	ЛОЖЬ КАК Основной
	|ПОМЕСТИТЬ ВсеОбъектыРемонтаДляПолученияРемонтов
	|ИЗ
	|	ЗависимыеПодчиненныеОбъектыРемонта КАК ЗависимыеПодчиненныеОбъектыРемонта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъектыЗависимые КАК ОбъектыЗависимые
	|		ПО ЗависимыеПодчиненныеОбъектыРемонта.СвязанныйОбъектРемонта = ОбъектыЗависимые.СвязанныйОбъектРемонта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ОсновнойОбъектРемонта,
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ИСТИНА
	|ГДЕ
	|	&ОсновноеОборудование
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СвязанныйОбъектРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_РемонтыСрезПоследних.ID КАК ID,
	|	торо_РемонтыСрезПоследних.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_РемонтыСрезПоследних.ВидРемонта КАК ВидРемонта,
	|	торо_РемонтыСрезПоследних.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВсеРемонты
	|ИЗ
	|	РегистрСведений.торо_Ремонты.СрезПоследних(
	|			,
	|			ТИПЗНАЧЕНИЯ(Регистратор) = ТИП(Документ.торо_ЗаявкаНаРемонт)
	|				И ОбъектРемонта В
	|					(ВЫБРАТЬ
	|						ВсеОбъектыРемонтаДляПолученияРемонтов.СвязанныйОбъектРемонта КАК СвязанныйОбъектРемонта
	|					ИЗ
	|						ВсеОбъектыРемонтаДляПолученияРемонтов КАК ВсеОбъектыРемонтаДляПолученияРемонтов)) КАК торо_РемонтыСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ID КАК ID,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Регистратор КАК Регистратор,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.СпособВыполнения КАК СпособВыполнения,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Исполнитель КАК Исполнитель
	|ПОМЕСТИТЬ ПлановыеРемонты
	|ИЗ
	|	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(
	|			,
	|			(ТИПЗНАЧЕНИЯ(Регистратор) = ТИП(Документ.торо_ПланГрафикРемонта)
	|				ИЛИ ТИПЗНАЧЕНИЯ(Регистратор) = ТИП(Документ.торо_ЗакрытиеЗаявокИРемонтов))
	|				И ОбъектРемонтныхРабот В
	|					(ВЫБРАТЬ
	|						ВсеОбъектыРемонтаДляПолученияРемонтов.СвязанныйОбъектРемонта КАК СвязанныйОбъектРемонта
	|					ИЗ
	|						ВсеОбъектыРемонтаДляПолученияРемонтов КАК ВсеОбъектыРемонтаДляПолученияРемонтов)) КАК торо_ПлановыеРемонтныеРаботыСрезПоследних
	|ГДЕ
	|	НЕ торо_ПлановыеРемонтныеРаботыСрезПоследних.Отменен
	|	И НЕ торо_ПлановыеРемонтныеРаботыСрезПоследних.Замещен
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеРемонты.ID КАК ID,
	|	ВсеРемонты.ОбъектРемонта КАК ОбъектРемонта,
	|	ВсеРемонты.ВидРемонта КАК ВидРемонта,
	|	ВсеРемонты.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ РемонтыЗаявокБезОтмененных
	|ИЗ
	|	ВсеРемонты КАК ВсеРемонты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОтмененныеЗаявки КАК торо_ОтмененныеЗаявки
	|		ПО ВсеРемонты.Регистратор = торо_ОтмененныеЗаявки.Заявка
	|			И ВсеРемонты.ID = торо_ОтмененныеЗаявки.ИДРемонта
	|ГДЕ
	|	торо_ОтмененныеЗаявки.Заявка ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	#Вставка
	|Выбрать
	|	РемонтыЗаявокБезОтмененных.ID КАК ИД,
	|	РемонтыЗаявокБезОтмененных.Регистратор КАК Регистратор,
	|	ИсполнителиПоРемонтам.НомерСтроки КАК НомерСтроки,
	|	ИсполнителиПоРемонтам.Исполнитель КАК Исполнитель
	|Поместить ВсеИсполнителиЗаявок
	|ИЗ
	|	РемонтыЗаявокБезОтмененных КАК РемонтыЗаявокБезОтмененных
	|	Внутреннее соединение Документ.торо_ЗаявкаНаРемонт.ИсполнителиПоРемонтам КАК ИсполнителиПоРемонтам
	|	ПО ИсполнителиПоРемонтам.Ссылка = РемонтыЗаявокБезОтмененных.Регистратор
	|	И ИсполнителиПоРемонтам.РемонтыОборудования_ID = РемонтыЗаявокБезОтмененных.ID
	|;
	|Выбрать
	|	ВсеИсполнителиЗаявок.ИД КАК ИД,
	|	ВсеИсполнителиЗаявок.Регистратор КАК Регистратор,
	|	Минимум(ВсеИсполнителиЗаявок.НомерСтроки) КАК НомерСтроки
	|Поместить ИсполнителиЗаявокПриоритет
	|ИЗ
	|	ВсеИсполнителиЗаявок КАК ВсеИсполнителиЗаявок
	|ВсеИсполнителиЗаявок.ИД,
	|ВсеИсполнителиЗаявок.Регистратор
	|;
	|Выбрать
	|	ИсполнителиЗаявокПриоритет.ИД КАК ИД,
	|	ИсполнителиЗаявокПриоритет.Регистратор КАК Регистратор,
	|	ИсполнителиЗаявокПриоритет.НомерСтроки КАК НомерСтроки,
	|	ВсеИсполнителиЗаявок.Исполнитель КАК Исполнитель,
	|	выбор когда ВсеИсполнителиЗаявок.Исполнитель Ссылка Справочник.Контрагенты
	|	тогда Значение(Перечисление.СпособыСтроительства.Подрядный)
	|	иначе Значение(Перечисление.СпособыСтроительства.Хозспособ)
	|	конец КАК СпособВыполнения
	|Поместить ВТ_ИсполнителиЗаявок
	|ИЗ
	|	ИсполнителиЗаявокПриоритет КАК ИсполнителиЗаявокПриоритет
	|	Внутреннее соединение ВсеИсполнителиЗаявок КАК ВсеИсполнителиЗаявок
	|	ПО ИсполнителиЗаявокПриоритет.Регистратор = ВсеИсполнителиЗаявок.Регистратор
	|	И ИсполнителиЗаявокПриоритет.ИД = ВсеИсполнителиЗаявок.ИД
	|	И ИсполнителиЗаявокПриоритет.НомерСтроки = ВсеИсполнителиЗаявок.НомерСтроки
	#КонецВставки
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПлановыеРемонты.ID КАК ID,
	|	ПлановыеРемонты.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	|	ПлановыеРемонты.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	ПлановыеРемонты.Регистратор КАК Регистратор,
	|	ПлановыеРемонты.СпособВыполнения КАК СпособВыполнения,
	|	ПлановыеРемонты.Исполнитель КАК Исполнитель
	|ПОМЕСТИТЬ ВсеРемонтыПоУсловиям
	|ИЗ
	|	ПлановыеРемонты КАК ПлановыеРемонты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РемонтыЗаявокБезОтмененных КАК РемонтыЗаявокБезОтмененных
	|		ПО ПлановыеРемонты.ID = РемонтыЗаявокБезОтмененных.ID
	|ГДЕ
	|	РемонтыЗаявокБезОтмененных.ID ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РемонтыЗаявокБезОтмененных.ID,
	|	РемонтыЗаявокБезОтмененных.ОбъектРемонта,
	|	РемонтыЗаявокБезОтмененных.ВидРемонта,
	|	РемонтыЗаявокБезОтмененных.Регистратор,
	#Вставка
	|	ВТ_ИсполнителиЗаявок.СпособВыполнения,
	|	ВТ_ИсполнителиЗаявок.Исполнитель
	#КонецВставки
	#Удаление
	|	NULL,
	|	NULL
	#КонецУдаления
	|ИЗ
	|	РемонтыЗаявокБезОтмененных КАК РемонтыЗаявокБезОтмененных
	#Вставка
	|	Левое соединение ВТ_ИсполнителиЗаявок КАК ВТ_ИсполнителиЗаявок
	|	ПО ВТ_ИсполнителиЗаявок.ИД = РемонтыЗаявокБезОтмененных.ID
	|	РемонтыЗаявокБезОтмененных.Регистратор = ВТ_ИсполнителиЗаявок.Регистратор
	#КонецВставки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ЗавершенныеРемонтныеРаботыСрезПоследних.ID КАК ID
	|ПОМЕСТИТЬ ВсеОтмененныеИЗавершенные
	|ИЗ
	|	РегистрСведений.торо_ЗавершенныеРемонтныеРаботы.СрезПоследних(
	|			,
	|			ID В
	|				(ВЫБРАТЬ
	|					ВсеРемонтыПоУсловиям.ID КАК ID
	|				ИЗ
	|					ВсеРемонтыПоУсловиям КАК ВсеРемонтыПоУсловиям)) КАК торо_ЗавершенныеРемонтныеРаботыСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ОтмененныеРемонтыСрезПоследних.ID
	|ИЗ
	|	РегистрСведений.торо_ОтмененныеРемонты.СрезПоследних(
	|			,
	|			ID В
	|				(ВЫБРАТЬ
	|					ВсеРемонтыПоУсловиям.ID КАК ID
	|				ИЗ
	|					ВсеРемонтыПоУсловиям КАК ВсеРемонтыПоУсловиям)) КАК торо_ОтмененныеРемонтыСрезПоследних
	|ГДЕ
	|	НЕ торо_ОтмененныеРемонтыСрезПоследних.Отменен
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеРемонтыПоУсловиям.ID КАК ID,
	|	ВсеРемонтыПоУсловиям.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	|	ВсеРемонтыПоУсловиям.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	ВсеРемонтыПоУсловиям.Регистратор КАК Регистратор,
	|	ВсеРемонтыПоУсловиям.СпособВыполнения КАК СпособВыполнения,
	|	ВсеРемонтыПоУсловиям.Исполнитель КАК Исполнитель
	|ПОМЕСТИТЬ ВсеНезавершенные
	|ИЗ
	|	ВсеРемонтыПоУсловиям КАК ВсеРемонтыПоУсловиям
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВсеОтмененныеИЗавершенные КАК ВсеОтмененныеИЗавершенные
	|		ПО ВсеРемонтыПоУсловиям.ID = ВсеОтмененныеИЗавершенные.ID
	|ГДЕ
	|	ВсеОтмененныеИЗавершенные.ID ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ОстановочныеРемонтыСрезПоследних.IDОсновного КАК IDОсновного,
	|	торо_ОстановочныеРемонтыСрезПоследних.IDЗависимого КАК IDЗависимого
	|ПОМЕСТИТЬ ВсеВключенныеВОстановочные
	|ИЗ
	|	РегистрСведений.торо_ОстановочныеРемонты.СрезПоследних(
	|			,
	|			(IDЗависимого В
	|					(ВЫБРАТЬ
	|						ВсеНезавершенные.ID КАК ID
	|					ИЗ
	|						ВсеНезавершенные КАК ВсеНезавершенные)
	|				ИЛИ IDОсновного В
	|					(ВЫБРАТЬ
	|						ВсеНезавершенные.ID КАК ID
	|					ИЗ
	|						ВсеНезавершенные КАК ВсеНезавершенные))
	|				И НЕ Регистратор = &Регистратор) КАК торо_ОстановочныеРемонтыСрезПоследних
	|ГДЕ
	|	НЕ торо_ОстановочныеРемонтыСрезПоследних.Отвязан
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDОсновного,
	|	IDЗависимого
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеНезавершенные.ID КАК ID,
	|	ВсеНезавершенные.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	|	ВсеНезавершенные.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	ЕСТЬNULL(торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаНачалаРемонтныхРабот,
	|	ЕСТЬNULL(торо_АктуальныеПлановыеДатыРемонтов.ДатаОкончания, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОкончанияРемонтныхРабот,
	|	ВсеНезавершенные.Регистратор КАК Регистратор,
	|	ВсеНезавершенные.СпособВыполнения КАК СпособВыполнения,
	|	ВсеНезавершенные.Исполнитель КАК Исполнитель
	|ПОМЕСТИТЬ ИтоговаяТаблицаДоОтборовПоЗависимымИДатам
	|ИЗ
	|	ВсеНезавершенные КАК ВсеНезавершенные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВсеВключенныеВОстановочные КАК ВсеВключенныеВОстановочные
	|		ПО ВсеНезавершенные.ID = ВсеВключенныеВОстановочные.IDОсновного
	|			И ВсеНезавершенные.ID = ВсеВключенныеВОстановочные.IDЗависимого
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК торо_АктуальныеПлановыеДатыРемонтов
	|		ПО ВсеНезавершенные.ID = торо_АктуальныеПлановыеДатыРемонтов.IDРемонта
	|ГДЕ
	|	ВсеВключенныеВОстановочные.IDОсновного ЕСТЬ NULL
	|	И ВсеВключенныеВОстановочные.IDЗависимого ЕСТЬ NULL
	|	И (НЕ &ОтбиратьПоДатеНачала
	|			ИЛИ ЕСТЬNULL(торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала, ДАТАВРЕМЯ(1, 1, 1)) >= &ОтборДатаНачала)
	|	И (НЕ &ОтбиратьПоДатеОкончания
	|			ИЛИ ЕСТЬNULL(торо_АктуальныеПлановыеДатыРемонтов.ДатаОкончания, ДАТАВРЕМЯ(1, 1, 1)) <= &ОтборДатаОкончания)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектРемонтныхРабот
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ВыявленныеДефектыСрезПоследних.ID КАК ID,
	|	торо_ВыявленныеДефектыСрезПоследних.КритичностьДефекта КАК КритичностьДефекта
	|ПОМЕСТИТЬ ВТ_Критичности
	|ИЗ
	|	РегистрСведений.торо_ВыявленныеДефекты.СрезПоследних(
	|			,
	|			ID В
	|				(ВЫБРАТЬ
	|					ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.ID КАК ID
	|				ИЗ
	|					ИтоговаяТаблицаДоОтборовПоЗависимымИДатам КАК ИтоговаяТаблицаДоОтборовПоЗависимымИДатам)) КАК торо_ВыявленныеДефектыСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	#Вставка
	|;
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РемонтыОборудования.ID КАК ID,
	|	РемонтыОборудования.КритичностьДефекта КАК КритичностьДефекта
	|ПОМЕСТИТЬ ВТ_Критичности2
	|ИЗ
	|	Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК РемонтыОборудования
	|Где РемонтыОборудования.Ссылка.Проведен 
	|	И РемонтыОборудования.ID В
	|				(ВЫБРАТЬ
	|					ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.ID КАК ID
	|				ИЗ
	|					ИтоговаяТаблицаДоОтборовПоЗависимымИДатам КАК ИтоговаяТаблицаДоОтборовПоЗависимымИДатам)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	#КонецВставки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.ID КАК ID,
	|	ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.ОбъектРемонтныхРабот КАК ОбъектРемонта,
	|	ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.ДатаНачалаРемонтныхРабот КАК ДатаНачала,
	|	ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.ДатаОкончанияРемонтныхРабот КАК ДатаОкончания,
	|	ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.Регистратор КАК ДокументОснование,
	|	ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.СпособВыполнения КАК СпособВыполнения,
	|	ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.Исполнитель КАК Исполнитель,
	|	ВсеОбъектыРемонтаДляПолученияРемонтов.Зависимый КАК Зависимый,
	|	ВсеОбъектыРемонтаДляПолученияРемонтов.Подчиненный КАК Подчиненный,
	|	ВсеОбъектыРемонтаДляПолученияРемонтов.Основной КАК О,
	#Удаление
	|	ЕСТЬNULL(ВТ_Критичности.КритичностьДефекта, ЗНАЧЕНИЕ(Справочник.торо_КритичностьДефекта.ПустаяСсылка)) КАК КритичностьДефекта
	#КонецУдаления
	#Вставка
	|	ЕСТЬNULL(ВТ_Критичности.КритичностьДефекта2,
	|		ЕСТЬNULL(ВТ_Критичности.КритичностьДефекта, 
	|			ЗНАЧЕНИЕ(Справочник.торо_КритичностьДефекта.ПустаяСсылка))) КАК КритичностьДефекта
	#КонецВставки
	|ИЗ
	|	ИтоговаяТаблицаДоОтборовПоЗависимымИДатам КАК ИтоговаяТаблицаДоОтборовПоЗависимымИДатам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВсеОбъектыРемонтаДляПолученияРемонтов КАК ВсеОбъектыРемонтаДляПолученияРемонтов
	|		ПО ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.ОбъектРемонтныхРабот = ВсеОбъектыРемонтаДляПолученияРемонтов.СвязанныйОбъектРемонта
	|			И (НЕ ВсеОбъектыРемонтаДляПолученияРемонтов.Зависимый
	|				ИЛИ (НЕ &ОтборПоВидуРемонтаДляЗависимых
	|					ИЛИ ВсеОбъектыРемонтаДляПолученияРемонтов.Зависимый
	|						И (ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.ВидРемонтныхРабот = ВсеОбъектыРемонтаДляПолученияРемонтов.ВидРемонтаЗависимогоОбъекта
	|							ИЛИ ВсеОбъектыРемонтаДляПолученияРемонтов.ВидРемонтаЗависимогоОбъекта = ЗНАЧЕНИЕ(Справочник.торо_ВидыРемонтов.ПустаяСсылка))))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Критичности КАК ВТ_Критичности
	|		ПО ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.ID = ВТ_Критичности.ID
	#Вставка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Критичности2 КАК ВТ_Критичности2
	|		ПО ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.ID = ВТ_Критичности.ID
	#КонецВставки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаНачала,
	|	ДатаОкончания";
	# КонецОбласти

	Запрос.УстановитьПараметр("IDОсновногоРемонта", IDОсновногоРемонта);

	МассивПодчиненных = Новый Массив;
	ЗначениеПодчиненные = СписокВыбранныхВидовОборудования.НайтиПоЗначению("ПодчиненноеОборудование");

	Если НЕ ЗначениеПодчиненные = Неопределено 
		И ЗначениеПодчиненные.Пометка Тогда

		ИерархияДляПолученияПодчиненных = ТекСтруктураИерархии;

		Если Не ЗначениеЗаполнено(ИерархияДляПолученияПодчиненных) Тогда
			ИерархияДляПолученияПодчиненных = Константы.торо_ИерархияДляВводаНовыхОР.Получить();
		КонецЕсли; 

		МассивПодчиненных = торо_РаботаСИерархией20.ПолучитьМассивПодчиненныхОбъектов(ОбъектРемонта, ИерархияДляПолученияПодчиненных, Объект.Дата);

	КонецЕсли; 

	Запрос.УстановитьПараметр("МассивПодчиненных", МассивПодчиненных);
	Запрос.УстановитьПараметр("ОтборПоВидуРемонтаДляЗависимых", ИСТИНА);
	Запрос.УстановитьПараметр("ВидРемонта", ВидРемонта);
	Запрос.УстановитьПараметр("ОсновнойОбъектРемонта", ОбъектРемонта);
	Запрос.УстановитьПараметр("Регистратор", ДокументИсточник);

	Запрос.УстановитьПараметр("ОтбиратьПоДатеНачала", ЗначениеЗаполнено(ОтборДатаНачала));
	Запрос.УстановитьПараметр("ОтборДатаНачала", ОтборДатаНачала);
	Запрос.УстановитьПараметр("ОтбиратьПоДатеОкончания", ЗначениеЗаполнено(ОтборДатаОкончания));
	Запрос.УстановитьПараметр("ОтборДатаОкончания", ОтборДатаОкончания);

	Для каждого ЭлементСписка Из СписокВыбранныхВидовОборудования Цикл
		Запрос.УстановитьПараметр(ЭлементСписка.Значение, ЭлементСписка.Пометка);
	КонецЦикла; 	

	РезультатЗапроса = Запрос.Выполнить();
	Ремонты.Загрузить(РезультатЗапроса.Выгрузить());

КонецПроцедуры

// гкс+ [разработка 2021] Куст 30.04.2021
&НаСервере
Процедура гкс_ДобавитьНовыеЭлементы()
	МассРеквизитов = Новый Массив();
	МассРеквизитов.Добавить(Новый РеквизитФормы("гкс_Сводный", Новый ОписаниеТипов("Булево")));
	МассРеквизитов.Добавить(Новый РеквизитФормы("гкс_РодительОР", Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта")));
	МассРеквизитов.Добавить(Новый РеквизитФормы("гкс_ОргВладОР", Новый ОписаниеТипов("СписокЗначений")));
	МассРеквизитов.Добавить(Новый РеквизитФормы("гкс_ПодрВладОР", Новый ОписаниеТипов("СписокЗначений")));
	МассРеквизитов.Добавить(Новый РеквизитФормы("гкс_Орг", Новый ОписаниеТипов("СписокЗначений")));
	МассРеквизитов.Добавить(Новый РеквизитФормы("гкс_Подр", Новый ОписаниеТипов("СписокЗначений")));
	МассРеквизитов.Добавить(Новый РеквизитФормы("гкс_ПодрИсп_", Новый ОписаниеТипов("СписокЗначений")));
	МассРеквизитов.Добавить(Новый РеквизитФормы("гкс_ВидРемонта", Новый ОписаниеТипов("СписокЗначений")));
	МассРеквизитов.Добавить(Новый РеквизитФормы("гкс_Направление", Новый ОписаниеТипов("СписокЗначений")));
	// гкс+ [разработка 2021] Куст 08.07.2021
	МассРеквизитов.Добавить(Новый РеквизитФормы("гкс_СтатусСогласования", Новый ОписаниеТипов("СписокЗначений")));
	МассРеквизитов.Добавить(Новый РеквизитФормы("гкс_СтатусСогласованияИсп", Новый ОписаниеТипов("Булево")));
	МассРеквизитов.Добавить(Новый РеквизитФормы("Статус", 
		Новый ОписаниеТипов("СправочникСсылка.торо_СтатусыСогласованияДокументовРемонтныхРабот"), "Ремонты"));
	МассРеквизитов.Добавить(Новый РеквизитФормы("ОписаниеРемонта", Новый ОписаниеТипов("Строка"), "Ремонты"));
	МассРеквизитов.Добавить(Новый РеквизитФормы("НомерСтроки", Новый ОписаниеТипов("Число"), "Ремонты"));
	// гкс- [разработка 2021] Куст 08.07.2021
	МассРеквизитов.Добавить(Новый РеквизитФормы("гкс_РодительОРИсп", Новый ОписаниеТипов("Булево")));
	МассРеквизитов.Добавить(Новый РеквизитФормы("гкс_ОргВладОРИсп", Новый ОписаниеТипов("Булево")));
	МассРеквизитов.Добавить(Новый РеквизитФормы("гкс_ПодрВладОРИсп", Новый ОписаниеТипов("Булево")));
	МассРеквизитов.Добавить(Новый РеквизитФормы("гкс_ОргИсп", Новый ОписаниеТипов("Булево")));
	МассРеквизитов.Добавить(Новый РеквизитФормы("гкс_ПодрИсп", Новый ОписаниеТипов("Булево")));
	МассРеквизитов.Добавить(Новый РеквизитФормы("гкс_ПодрИсп_Исп", Новый ОписаниеТипов("Булево")));
	МассРеквизитов.Добавить(Новый РеквизитФормы("гкс_ВидРемонтаИсп", Новый ОписаниеТипов("Булево")));
	МассРеквизитов.Добавить(Новый РеквизитФормы("гкс_НаправлениеИсп", Новый ОписаниеТипов("Булево")));
	// гкс+ [] Деснол 12.09.2022
	МассРеквизитов.Добавить(Новый РеквизитФормы("гкс_ОтветИсп", Новый ОписаниеТипов("Булево"), , "Ответственный"));
	МассРеквизитов.Добавить(Новый РеквизитФормы("гкс_ОтборОтветственный", Новый ОписаниеТипов("СправочникСсылка.Пользователи")));
	// гкс- [] Деснол 12.09.2022
		// гкс+ [разработка 2021] Куст 07.07.2021
	МассРеквизитов.Добавить(Новый РеквизитФормы("гкс_ИспОтборНуженОстанов", Новый ОписаниеТипов("Булево"),, "Необходимость остановки")); 
	МассРеквизитов.Добавить(Новый РеквизитФормы("гкс_ОтборНуженОстанов", Новый ОписаниеТипов("Булево"))); 
	// гкс- [разработка 2021] Куст 07.07.2021
	ИзменитьРеквизиты(МассРеквизитов);
	//
	ЭтотОбъект["гкс_ОргВладОР"].ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Организации");
	ЭтотОбъект["гкс_ПодрВладОР"].ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия");
	ЭтотОбъект["гкс_Орг"].ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Организации");
	ЭтотОбъект["гкс_Подр"].ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия");
	ЭтотОбъект["гкс_ПодрИсп_"].ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия");
	ЭтотОбъект["гкс_ВидРемонта"].ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.торо_ВидыРемонтов");
	ЭтотОбъект["гкс_Направление"].ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.торо_НаправленияОбъектовРемонтныхРабот");
	// гкс+ [разработка 2021] Куст 08.07.2021
	ЭтотОбъект["гкс_СтатусСогласования"].ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.торо_СтатусыСогласованияДокументовРемонтныхРабот");
	// гкс- [разработка 2021] Куст 08.07.2021
	//
	НоваяГруппаЭлементовФормы = Элементы.Вставить("гкс_Отборы", Тип("ГруппаФормы"), Элементы.Отборы, Элементы.ГруппаОтборПоПериоду);
	НоваяГруппаЭлементовФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппаЭлементовФормы.ОтображатьЗаголовок = Ложь;
	НоваяГруппаЭлементовФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	//
	НоваяГруппаЭлементовФормы = Элементы.Добавить("гкс_ОтборыЛево", Тип("ГруппаФормы"), Элементы["гкс_Отборы"]);
	НоваяГруппаЭлементовФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппаЭлементовФормы.ОтображатьЗаголовок = Ложь;
	НоваяГруппаЭлементовФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	//
	НоваяГруппаЭлементовФормы = Элементы.Добавить("гкс_ОтборыПраво", Тип("ГруппаФормы"), Элементы["гкс_Отборы"]);
	НоваяГруппаЭлементовФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппаЭлементовФормы.ОтображатьЗаголовок = Ложь;
	НоваяГруппаЭлементовФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	//
	ТемпМасс = Новый Массив();
	ТемпМасс.Добавить(Новый Структура("Имя,Синоним", "гкс_РодительОР",
	НСтр("es='';ru='Группа/ФМ/ОР';en='Group/FP/OR'")));
	ТемпМасс.Добавить(Новый Структура("Имя,Синоним", "гкс_ОргВладОР",
	НСтр("es='';ru='Организация владелец ОР';en='Organization owner OR'")));
	ТемпМасс.Добавить(Новый Структура("Имя,Синоним", "гкс_ПодрВладОР",
	НСтр("es='';ru='Подразделение владелец ОР';en='Subdivision owner OR'")));
	ТемпМасс.Добавить(Новый Структура("Имя,Синоним", "гкс_Орг",
	НСтр("es='';ru='Организация';en='Organization'")));
	ТемпМасс.Добавить(Новый Структура("Имя,Синоним", "гкс_Подр",
	НСтр("es='';ru='Подразделение';en='Subdivision'")));
	ТемпМасс.Добавить(Новый Структура("Имя,Синоним", "гкс_ПодрИсп_",
	НСтр("es='';ru='Подразделение исполнитель';en='Unit performer'")));
	ТемпМасс.Добавить(Новый Структура("Имя,Синоним", "гкс_ВидРемонта",
	НСтр("es='';ru='Вид ремонта';en='Type of repair'")));
	ТемпМасс.Добавить(Новый Структура("Имя,Синоним", "гкс_Направление",
	НСтр("es='';ru='Направление';en='Direction'")));
	// гкс+ [разработка 2021] Куст 08.07.2021
	ТемпМасс.Добавить(Новый Структура("Имя,Синоним", "гкс_СтатусСогласования",
	НСтр("es='';ru='Статус согласования';en='Reconciliation status'")));
	// гкс- [разработка 2021] Куст 08.07.2021
	ЭтоГруппаЛево = Истина;
	Для Каждого СтрокаМассива Из ТемпМасс Цикл
		Если ЭтоГруппаЛево Тогда 
			ГруппаОтбор = Элементы["гкс_ОтборыЛево"];
		Иначе
			ГруппаОтбор = Элементы["гкс_ОтборыПраво"];
		КонецЕсли;
		ЭтоГруппаЛево = Не ЭтоГруппаЛево;
		//
		НоваяГруппаЭлементовФормы = Элементы.Добавить("гкс_Отбор" + СтрокаМассива.Имя, Тип("ГруппаФормы"), ГруппаОтбор);
		НоваяГруппаЭлементовФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппаЭлементовФормы.ОтображатьЗаголовок = Ложь;
		НоваяГруппаЭлементовФормы.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
		//
		НовыйФлагФормы = Элементы.Добавить(СтрокаМассива.Имя + "_Флаг", Тип("ПолеФормы"), НоваяГруппаЭлементовФормы);
		НовыйФлагФормы.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйФлагФормы.ПутьКДанным = СтрокаМассива.Имя + "Исп";
		НовыйФлагФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
		НовыйФлагФормы.Заголовок = СтрокаМассива.Синоним;
		//
		НовыйФлагФормы = Элементы.Добавить(СтрокаМассива.Имя, Тип("ПолеФормы"), НоваяГруппаЭлементовФормы);
		НовыйФлагФормы.Вид = ВидПоляФормы.ПолеВвода;
		НовыйФлагФормы.ПутьКДанным = СтрокаМассива.Имя;
		НовыйФлагФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЦикла;
	// гкс+ [разработка 2021] Куст 07.07.2021
	//
	НоваяГруппа = Элементы.Добавить("гкс_ГруппаОтборНуженОстанов", Тип("ГруппаФормы"), Элементы["гкс_ОтборыПраво"]);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.ОтображатьЗаголовок = Ложь;
	НоваяГруппа.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Лево;
	НоваяГруппа.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
	//
	НовыйЭлемент = Элементы.Добавить("гкс_ИспОтборНуженОстанов", Тип("ПолеФормы"), Элементы["гкс_ГруппаОтборНуженОстанов"]);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "гкс_ИспОтборНуженОстанов";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "гкс_ИспОтборНуженОстановПриИзменении");
	//
	НовыйЭлемент = Элементы.Добавить("гкс_ОтборНуженОстанов", Тип("ПолеФормы"), Элементы["гкс_ГруппаОтборНуженОстанов"]);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "гкс_ОтборНуженОстанов";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	// гкс- [разработка 2021] Куст 07.07.2021
	// гкс+ [] Деснол 12.09.2022
	НоваяГруппа = Элементы.Добавить("гкс_ГруппаОтборОтветственный", Тип("ГруппаФормы"), Элементы["гкс_ОтборыЛево"]);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.ОтображатьЗаголовок = Ложь;
	НоваяГруппа.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Лево;
	НоваяГруппа.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
	//
	НовыйЭлемент = Элементы.Добавить("гкс_ИспОтборОтветственный", Тип("ПолеФормы"), Элементы["гкс_ГруппаОтборОтветственный"]);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "гкс_ОтветИсп";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	//
	НовыйЭлемент = Элементы.Добавить("гкс_ОтборОтветственный", Тип("ПолеФормы"), Элементы["гкс_ГруппаОтборОтветственный"]);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "гкс_ОтборОтветственный";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	// гкс- [] Деснол 12.09.2022
	// гкс+ [разработка 2021] Куст 08.07.2021
	НовыйЭлемент = Элементы.Вставить("Ремонты_НомерСтроки", Тип("ПолеФормы"),Элементы.Ремонты, Элементы.РемонтыО);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Ремонты.НомерСтроки";
	НовыйЭлемент.Заголовок = "№";
	НовыйЭлемент.Ширина = 3;
	НовыйЭлемент.ТолькоПросмотр = Истина;
	//
	НовыйЭлемент = Элементы.Вставить("Ремонты_ОписаниеРемонта", Тип("ПолеФормы"), Элементы.Ремонты, Элементы.РемонтыДатаНачала);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Ремонты.ОписаниеРемонта";
	НовыйЭлемент.Заголовок = НСтр("es='La descripción de la reparación';ru='Описание ремонта';en='Repair description'");
	НовыйЭлемент.ТолькоПросмотр = Истина;
	//
	НовыйЭлемент = Элементы.Вставить("Ремонты_Статус", Тип("ПолеФормы"), Элементы.Ремонты, Элементы.РемонтыДатаНачала);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Ремонты.Статус";
	НовыйЭлемент.Заголовок = НСтр("es='status';ru='Статус';en='status'");
	НовыйЭлемент.ТолькоПросмотр = Истина;
	//
	Элементы.РемонтыИсполнитель.ТолькоПросмотр = Истина;
	Элементы.РемонтыКритичностьДефекта.ТолькоПросмотр = Истина;
	Элементы.РемонтыСпособВыполнения.ТолькоПросмотр = Истина;
	// гкс- [разработка 2021] Куст 08.07.2021
КонецПроцедуры
// гкс- [разработка 2021] Куст 30.04.2021

// гкс+ [разработка 2021] Куст 30.04.2021
&НаСервере
Процедура гкс_ОбновитьЭлементы()
	Если ЭтотОбъект["гкс_Сводный"] Тогда 
		Элементы["гкс_Отборы"].Видимость = Истина;
		Элементы.Группа5.Видимость = Ложь;
		Элементы.РемонтыО.Видимость = Ложь;
		Элементы.РемонтыП.Видимость = Ложь;
		Элементы.РемонтыЗ.Видимость = Ложь;
	Иначе
		Элементы["гкс_Отборы"].Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры
// гкс- [разработка 2021] Куст 30.04.2021

// гкс+ [разработка 2021] Куст 30.04.2021
&НаСервере
Процедура гкс_ОбновитьРемонтыДляСводногоНаСервере()
	МассивОР = Новый Массив();
#Область ПоискИерархииОР
	Если ЭтотОбъект["гкс_РодительОРИсп"] Тогда
		МассРодитель = Новый Массив();
		МассРодитель.Добавить(ЭтотОбъект["гкс_РодительОР"]);
		Запрос = Новый Запрос();
		Запрос.МенеджерВременныхТаблиц = новый МенеджерВременныхТаблиц();
		ТекИерархия = Константы.торо_ИерархияДляВводаНовыхОР.Получить();
		Если ТекИерархия.ИзменяетсяДокументами Тогда 
			Запрос.Текст = "ВЫБРАТЬ
			               |	ТЧ.ОбъектИерархии КАК ОР,
			               |	ТЧ.РодительИерархии КАК Родитель
			               |ПОМЕСТИТЬ ВсяИерархия
			               |ИЗ
			               |	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(,
						   |СтруктураИерархии = &СтруктураИерархии) КАК ТЧ
			               |ГДЕ
			               |	ТЧ.Удален = Ложь" + " ; ";
		Иначе
			Запрос.Текст = "ВЫБРАТЬ
			               |	ТЧ.ОбъектИерархии КАК ОР,
			               |	ТЧ.РодительИерархии КАК Родитель
			               |ПОМЕСТИТЬ ВсяИерархия
			               |ИЗ
			               |	РегистрСведений.торо_ИерархическиеСтруктурыОР КАК ТЧ
			               |ГДЕ
			               |	ТЧ.СтруктураИерархии = &СтруктураИерархии" + " ; ";
		КонецЕсли;
		Запрос.УстановитьПараметр("СтруктураИерархии", ТекИерархия);
		Пока МассРодитель.Количество() Цикл
		Запрос.Текст = Запрос.Текст 
		+ "ВЫБРАТЬ
		  |	ТЧ.ОР КАК ОР
		  |ПОМЕСТИТЬ Уровень0
		  |ИЗ
		  |	ВсяИерархия КАК ТЧ
		  |ГДЕ
		  |	ТЧ.Родитель В(&Родитель)
		  |;
		  |
		  |////////////////////////////////////////////////////////////////////////////////
		  |ВЫБРАТЬ
		  |	ТЧ.ОР КАК ОР
		  |ПОМЕСТИТЬ Уровень1
		  |ИЗ
		  |	ВсяИерархия КАК ТЧ
		  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Уровень0 КАК ТЧ1
		  |		ПО ТЧ.Родитель = ТЧ1.ОР
		  |;
		  |
		  |////////////////////////////////////////////////////////////////////////////////
		  |ВЫБРАТЬ
		  |	ТЧ.ОР КАК ОР
		  |ПОМЕСТИТЬ Уровень2
		  |ИЗ
		  |	ВсяИерархия КАК ТЧ
		  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Уровень1 КАК ТЧ1
		  |		ПО ТЧ.Родитель = ТЧ1.ОР
		  |;
		  |
		  |////////////////////////////////////////////////////////////////////////////////
		  |ВЫБРАТЬ
		  |	ТЧ.ОР КАК ОР
		  |ПОМЕСТИТЬ Уровень3
		  |ИЗ
		  |	ВсяИерархия КАК ТЧ
		  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Уровень2 КАК ТЧ1
		  |		ПО ТЧ.Родитель = ТЧ1.ОР
		  |;
		  |
		  |////////////////////////////////////////////////////////////////////////////////
		  |ВЫБРАТЬ
		  |	Уровень0.ОР КАК ОР,
		  |	ЛОЖЬ КАК Последний
		  |ИЗ
		  |	Уровень0 КАК Уровень0
		  |
		  |ОБЪЕДИНИТЬ ВСЕ
		  |
		  |ВЫБРАТЬ
		  |	Уровень0.ОР,
		  |	ЛОЖЬ
		  |ИЗ
		  |	Уровень1 КАК Уровень0
		  |
		  |ОБЪЕДИНИТЬ ВСЕ
		  |
		  |ВЫБРАТЬ
		  |	Уровень0.ОР,
		  |	ЛОЖЬ
		  |ИЗ
		  |	Уровень2 КАК Уровень0
		  |
		  |ОБЪЕДИНИТЬ ВСЕ
		  |
		  |ВЫБРАТЬ
		  |	Уровень0.ОР,
		  |	ИСТИНА
		  |ИЗ
		  |	Уровень3 КАК Уровень0
		  |;
		  |
		  |////////////////////////////////////////////////////////////////////////////////
		  |УНИЧТОЖИТЬ Уровень0;
		  |УНИЧТОЖИТЬ Уровень1;
		  |УНИЧТОЖИТЬ Уровень2;
		  |УНИЧТОЖИТЬ Уровень3";
		
		Запрос.УстановитьПараметр("Родитель", МассРодитель);
		РезультатЗапроса = Запрос.Выполнить();
		МассРодитель = Новый Массив();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивОР.Добавить(Выборка.ОР);
			Если Выборка.Последний Тогда 
				МассРодитель.Добавить(Выборка.ОР);
			КонецЕсли;
		КонецЦикла;
		Запрос.Текст = "";
		КонецЦикла;
	КонецЕсли;
#КонецОбласти
	//
	Запрос = Новый Запрос;
	# Область ТекстЗапроса
	Запрос.Текст = 
	"ВЫБРАТЬ Различные
	|	РегистрСведенийторо_РемонтыСрезПоследних.ID КАК ID,
	|	РегистрСведенийторо_РемонтыСрезПоследних.ОбъектРемонта КАК ОбъектРемонта,
	|	РегистрСведенийторо_РемонтыСрезПоследних.ВидРемонта КАК ВидРемонта,
	|	РегистрСведенийторо_РемонтыСрезПоследних.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВсеРемонты
	|ИЗ
	|	РегистрСведений.торо_Ремонты.СрезПоследних(
	|			,
	|			ТИПЗНАЧЕНИЯ(Регистратор) = ТИП(Документ.торо_ЗаявкаНаРемонт)
	// гкс+ [] Деснол 12.09.2022
	|				И &ОтборРемонты1 И &ОтборРемонты6) КАК РегистрСведенийторо_РемонтыСрезПоследних
	// гкс- [] Деснол 12.09.2022
	|	ГДЕ &ОтборРемонты3
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|выбрать
	|ДокТЧ.Исполнитель КАК Исполнитель,
	|ДокТЧ.НомерСтроки КАК НомерСтроки,
	|ТЧ.ID КАК ИД,
	|ТЧ.Регистратор КАК Регистратор
	|Поместить ВсеИсполнители
	|ИЗ ВсеРемонты КАК ТЧ
	|	Внутреннее соединение Документ.торо_ЗаявкаНаРемонт.ИсполнителиПоРемонтам КАК ДокТЧ
	|	ПО ДокТЧ.Ссылка = ТЧ.Регистратор И ДокТЧ.РемонтыОборудования_ID = ТЧ.ID
	|;
	|//////////////////
	|выбрать
	|ТЧ.ИД КАК ИД,
	|ТЧ.Регистратор КАК Регистратор,
	|Минимум(ТЧ.НомерСтроки) КАК НомерСтроки
	|Поместить ПервыеСтрокиИсполнителей
	|ИЗ ВсеИсполнители КАК ТЧ
	|Сгруппировать по
	|ТЧ.ИД,
	|ТЧ.Регистратор
	|;
	|/////////////////////
	|выбрать
	|ТЧ.ИД КАК ИД,
	|ТЧ.Регистратор КАК Регистратор,
	|ТЧ.Исполнитель КАК Исполнитель
	|Поместить ТЧ_Исполнители
	|ИЗ ВсеИсполнители КАК ТЧ
	|	внутреннее соединение ПервыеСтрокиИсполнителей КАК ТЧ2
	|	ПО ТЧ.ИД = ТЧ2.ИД И ТЧ.НомерСтроки = ТЧ2.НомерСтроки И ТЧ.Регистратор = ТЧ2.Регистратор
	|	ГДЕ &ОтборРемонты4
	|;
	|УНИЧТОЖИТЬ ВсеИсполнители;
	|УНИЧТОЖИТЬ ПервыеСтрокиИсполнителей;
	|
	|
	|
	|
	|
	|
	|
	|
	|
	|
	|
	|
	|
	|
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Рег.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	|	Рег.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	Рег.ID КАК ID,
	|	Рег.Регистратор КАК Регистратор,
	|	Рег.СпособВыполнения КАК СпособВыполнения,
	|	Рег.Исполнитель КАК Исполнитель
	|ПОМЕСТИТЬ ПлановыеРемонты
	|ИЗ
	|	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(
	|			,
	|			(ТИПЗНАЧЕНИЯ(Регистратор) = ТИП(Документ.торо_ПланГрафикРемонта)
	|				ИЛИ ТИПЗНАЧЕНИЯ(Регистратор) = ТИП(Документ.торо_ЗакрытиеЗаявокИРемонтов))
	// гкс+ [] Деснол 12.09.2022
	|				И &ОтборРемонты2 И &ОтборРемонты6) КАК Рег
	// гкс- [] Деснол 12.09.2022
	|ГДЕ
	|	НЕ Рег.Отменен
	|	И НЕ Рег.Замещен
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеРемонты.ID КАК ID,
	|	ВсеРемонты.ОбъектРемонта КАК ОбъектРемонта,
	|	ВсеРемонты.ВидРемонта КАК ВидРемонта,
	|	ВсеРемонты.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ РемонтыЗаявокБезОтмененных
	|ИЗ
	|	ВсеРемонты КАК ВсеРемонты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОтмененныеЗаявки КАК торо_ОтмененныеЗаявки
	|		ПО ВсеРемонты.Регистратор = торо_ОтмененныеЗаявки.Заявка
	|			И ВсеРемонты.ID = торо_ОтмененныеЗаявки.ИДРемонта
	|ГДЕ
	|	торо_ОтмененныеЗаявки.Заявка ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПлановыеРемонты.ID КАК ID,
	|	ПлановыеРемонты.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	|	ПлановыеРемонты.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	ПлановыеРемонты.Регистратор КАК Регистратор,
	|	ПлановыеРемонты.СпособВыполнения КАК СпособВыполнения,
	|	ПлановыеРемонты.Исполнитель КАК Исполнитель
	|ПОМЕСТИТЬ ВсеРемонтыПоУсловиям
	|ИЗ
	|	ПлановыеРемонты КАК ПлановыеРемонты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РемонтыЗаявокБезОтмененных КАК РемонтыЗаявокБезОтмененных
	|		ПО ПлановыеРемонты.ID = РемонтыЗаявокБезОтмененных.ID
	|ГДЕ
	|	РемонтыЗаявокБезОтмененных.ID ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РемонтыЗаявокБезОтмененных.ID,
	|	РемонтыЗаявокБезОтмененных.ОбъектРемонта,
	|	РемонтыЗаявокБезОтмененных.ВидРемонта,
	|	РемонтыЗаявокБезОтмененных.Регистратор,
	|	Выбор когда не ТЧ.Исполнитель есть NULL И ТЧ.Исполнитель Ссылка Справочник.Контрагенты
	|	Тогда Значение(Перечисление.СпособыСтроительства.Подрядный)
	|	Иначе Значение(Перечисление.СпособыСтроительства.ХозСпособ) Конец,
	|	ТЧ.Исполнитель
	|ИЗ
	|	РемонтыЗаявокБезОтмененных КАК РемонтыЗаявокБезОтмененных
	|	Левое соединение ТЧ_Исполнители КАК ТЧ
	|	ПО ТЧ.ИД = РемонтыЗаявокБезОтмененных.ID И РемонтыЗаявокБезОтмененных.Регистратор = ТЧ.Регистратор
	|	ГДЕ &ОтборРемонты5 И &ОтборОстанов0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ЗавершенныеРемонтныеРаботыСрезПоследних.ID КАК ID
	|ПОМЕСТИТЬ ВсеОтмененныеИЗавершенные
	|ИЗ
	|	РегистрСведений.торо_ЗавершенныеРемонтныеРаботы.СрезПоследних(
	|			,
	|			ID В
	|				(ВЫБРАТЬ
	|					ВсеРемонтыПоУсловиям.ID КАК ID
	|				ИЗ
	|					ВсеРемонтыПоУсловиям КАК ВсеРемонтыПоУсловиям)) КАК торо_ЗавершенныеРемонтныеРаботыСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ОтмененныеРемонтыСрезПоследних.ID
	|ИЗ
	|	РегистрСведений.торо_ОтмененныеРемонты.СрезПоследних(
	|			,
	|			ID В
	|				(ВЫБРАТЬ
	|					ВсеРемонтыПоУсловиям.ID КАК ID
	|				ИЗ
	|					ВсеРемонтыПоУсловиям КАК ВсеРемонтыПоУсловиям)) КАК торо_ОтмененныеРемонтыСрезПоследних
	|ГДЕ
	|	НЕ торо_ОтмененныеРемонтыСрезПоследних.Отменен
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеРемонтыПоУсловиям.ID КАК ID,
	|	ВсеРемонтыПоУсловиям.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	|	ВсеРемонтыПоУсловиям.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	ВсеРемонтыПоУсловиям.Регистратор КАК Регистратор,
	|	ВсеРемонтыПоУсловиям.СпособВыполнения КАК СпособВыполнения,
	|	ВсеРемонтыПоУсловиям.Исполнитель КАК Исполнитель
	|ПОМЕСТИТЬ ВсеНезавершенные
	|ИЗ
	|	ВсеРемонтыПоУсловиям КАК ВсеРемонтыПоУсловиям
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВсеОтмененныеИЗавершенные КАК ВсеОтмененныеИЗавершенные
	|		ПО ВсеРемонтыПоУсловиям.ID = ВсеОтмененныеИЗавершенные.ID
	|ГДЕ
	|	ВсеОтмененныеИЗавершенные.ID ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ОстановочныеРемонтыСрезПоследних.IDОсновного КАК IDОсновного,
	|	торо_ОстановочныеРемонтыСрезПоследних.IDЗависимого КАК IDЗависимого
	|ПОМЕСТИТЬ ВсеВключенныеВОстановочные
	|ИЗ
	|	РегистрСведений.торо_ОстановочныеРемонты.СрезПоследних(
	|			,
	|			(IDЗависимого В
	|					(ВЫБРАТЬ
	|						ВсеНезавершенные.ID КАК ID
	|					ИЗ
	|						ВсеНезавершенные КАК ВсеНезавершенные)
	|				)
	|				И НЕ Регистратор = &Регистратор) КАК торо_ОстановочныеРемонтыСрезПоследних
	|ГДЕ
	|	НЕ торо_ОстановочныеРемонтыСрезПоследних.Отвязан
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDОсновного,
	|	IDЗависимого
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеНезавершенные.ID КАК ID,
	|	ВсеНезавершенные.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	|	ВсеНезавершенные.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	ЕСТЬNULL(торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаНачалаРемонтныхРабот,
	|	ЕСТЬNULL(торо_АктуальныеПлановыеДатыРемонтов.ДатаОкончания, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОкончанияРемонтныхРабот,
	|	ВсеНезавершенные.Регистратор КАК Регистратор,
	|	ВсеНезавершенные.СпособВыполнения КАК СпособВыполнения,
	|	ВсеНезавершенные.Исполнитель КАК Исполнитель
	|ПОМЕСТИТЬ ИтоговаяТаблицаДоОтборовПоЗависимымИДатам
	|ИЗ
	|	ВсеНезавершенные КАК ВсеНезавершенные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВсеВключенныеВОстановочные КАК ВсеВключенныеВОстановочные
	|		ПО ВсеНезавершенные.ID = ВсеВключенныеВОстановочные.IDОсновного
	|			И ВсеНезавершенные.ID = ВсеВключенныеВОстановочные.IDЗависимого
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК торо_АктуальныеПлановыеДатыРемонтов
	|		ПО ВсеНезавершенные.ID = торо_АктуальныеПлановыеДатыРемонтов.IDРемонта
	|ГДЕ
	|	ВсеВключенныеВОстановочные.IDОсновного ЕСТЬ NULL
	|	И ВсеВключенныеВОстановочные.IDЗависимого ЕСТЬ NULL
	|	И ( ЕСТЬNULL(торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала, ДАТАВРЕМЯ(1, 1, 1)) >= &ОтборДатаНачала)
	|	И ( ЕСТЬNULL(торо_АктуальныеПлановыеДатыРемонтов.ДатаОкончания, ДАТАВРЕМЯ(1, 1, 1)) <= &ОтборДатаОкончания)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектРемонтныхРабот
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ВыявленныеДефектыСрезПоследних.ID КАК ID,
	|	торо_ВыявленныеДефектыСрезПоследних.КритичностьДефекта КАК КритичностьДефекта
	|ПОМЕСТИТЬ ВТ_Критичности
	|ИЗ
	|	РегистрСведений.торо_ВыявленныеДефекты.СрезПоследних(
	|			,
	|			ID В
	|				(ВЫБРАТЬ
	|					ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.ID КАК ID
	|				ИЗ
	|					ИтоговаяТаблицаДоОтборовПоЗависимымИДатам КАК ИтоговаяТаблицаДоОтборовПоЗависимымИДатам)) КАК торо_ВыявленныеДефектыСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РемонтыОборудования.ID КАК ID,
	|	РемонтыОборудования.КритичностьДефекта КАК КритичностьДефекта,
	|	РемонтыОборудования.ОписаниеРемонта КАК ОписаниеРемонта,
	|	РемонтыОборудования.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Критичности2
	|ИЗ
	|	Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК РемонтыОборудования
	|Где РемонтыОборудования.Ссылка.Проведен 
	|	И РемонтыОборудования.ID В
	|				(ВЫБРАТЬ
	|					ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.ID КАК ID
	|				ИЗ
	|					ИтоговаяТаблицаДоОтборовПоЗависимымИДатам КАК ИтоговаяТаблицаДоОтборовПоЗависимымИДатам)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|Выбрать
	|ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.Регистратор КАК Регистратор,
	|торо_ТекущиеСтатусыСогласованияДокументов.СтатусДокумента КАК Статус
	|Поместить ВТ_Статусы
	|Из ИтоговаяТаблицаДоОтборовПоЗависимымИДатам КАК ИтоговаяТаблицаДоОтборовПоЗависимымИДатам
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ТекущиеСтатусыСогласованияДокументов КАК торо_ТекущиеСтатусыСогласованияДокументов
	|		ПО торо_ТекущиеСтатусыСогласованияДокументов.СогласуемыйДокумент = ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.Регистратор
	|Где &Статус
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.ID КАК ID,
	|	ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.ОбъектРемонтныхРабот КАК ОбъектРемонта,
	|	ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	ДобавитьКДате(ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.ДатаНачалаРемонтныхРабот, Час, &Сдвиг) КАК ДатаНачала,
	|	ДобавитьКДате(ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.ДатаОкончанияРемонтныхРабот, Час, &Сдвиг) КАК ДатаОкончания,
	|	ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.Регистратор КАК ДокументОснование,
	|	ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.СпособВыполнения КАК СпособВыполнения,
	|	ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.Исполнитель КАК Исполнитель,
	|	Ложь КАК Зависимый,
	|	Ложь КАК Подчиненный,
	|	Истина КАК О,
	|	ЕСТЬNULL(ВТ_Критичности2.КритичностьДефекта,
	|		ЕСТЬNULL(ВТ_Критичности.КритичностьДефекта, 
	|			ЗНАЧЕНИЕ(Справочник.торо_КритичностьДефекта.ПустаяСсылка))) КАК КритичностьДефекта,
	|	ВТ_Критичности2.ОписаниеРемонта КАК ОписаниеРемонта,
	|	ВТ_Статусы.Статус КАК Статус
	|ИЗ
	|	ИтоговаяТаблицаДоОтборовПоЗависимымИДатам КАК ИтоговаяТаблицаДоОтборовПоЗависимымИДатам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Критичности КАК ВТ_Критичности
	|		ПО ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.ID = ВТ_Критичности.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Критичности2 КАК ВТ_Критичности2
	|		ПО ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.ID = ВТ_Критичности2.ID
	|		И ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.Регистратор = ВТ_Критичности2.Ссылка
	|		Внутреннее соединение ВТ_Статусы КАК ВТ_Статусы
	|		ПО ВТ_Статусы.Регистратор = ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.Регистратор
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаНачала,
	|	ДатаОкончания";
	# КонецОбласти

	ТекстОтбора1 = Новый Массив();
	ТекстОтбора2 = Новый Массив();
	Если ЭтотОбъект["гкс_ОргИсп"] Тогда 
		ТекстОтбора1.Добавить("Регистратор.Организация В (&Орг)");
		ТекстОтбора2.Добавить("Регистратор.Организация В (&Орг)");
	КонецЕсли;
	Если ЭтотОбъект["гкс_ПодрИсп"] Тогда 
		ТекстОтбора1.Добавить("Регистратор.Подразделение В (&Подр)");
		ТекстОтбора2.Добавить("Регистратор.Подразделение В (&Подр)");
	КонецЕсли;   
	Если ЭтотОбъект["гкс_ПодрИсп_Исп"] Тогда 
		Если ЭтотОбъект["гкс_ПодрИсп_"].Количество() Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборРемонты5", "ИСТИНА");
			ТекстОтбора2.Добавить("Исполнитель В (&ПодрИсп)");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ГДЕ &ОтборРемонты4", "ГДЕ ТЧ.Исполнитель В (&ПодрИсп) ");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ГДЕ &ОтборРемонты3", 
			"Внутреннее соединение РегистрСведений.торо_ЗаявкиПоРемонтам КАК Рег2
			|	ПО Рег2.Регистратор = РегистрСведенийторо_РемонтыСрезПоследних.Регистратор И Рег2.Исполнитель В (&ПодрИсп)");
		Иначе
			ТекстОтбора2.Добавить("Исполнитель В (&ПодрИсп)");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ГДЕ &ОтборРемонты4", " ");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборРемонты5", "(ТЧ.Исполнитель есть NULL 
			|ИЛИ ТЧ.Исполнитель В (&ПодрИсп))");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ГДЕ &ОтборРемонты3", 
			"Внутреннее соединение РегистрСведений.торо_ЗаявкиПоРемонтам КАК Рег2
			|	ПО Рег2.Регистратор = РегистрСведенийторо_РемонтыСрезПоследних.Регистратор И (Рег2.Исполнитель В (&ПодрИсп)
			|	ИЛИ Не(Рег2.Исполнитель Ссылка Справочник.Контрагенты 
			|	И Рег2.Исполнитель Ссылка Справочник.СтруктураПредприятия))");
		КонецЕсли;
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборРемонты5", "ИСТИНА");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ГДЕ &ОтборРемонты4", " ");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ГДЕ &ОтборРемонты3", " ");
	КонецЕсли;  
	Если ЭтотОбъект["гкс_РодительОРИсп"] Тогда 
		ТекстОтбора1.Добавить("ОбъектРемонта В (&МассивОР)");
		ТекстОтбора2.Добавить("ОбъектРемонтныхРабот В (&МассивОР)");
	КонецЕсли;
	Если ЭтотОбъект["гкс_ОргВладОРИсп"] Тогда 
		ТекстОтбора1.Добавить("ОбъектРемонта.Организация В (&ОргВладОР)");
		ТекстОтбора2.Добавить("ОбъектРемонтныхРабот.Организация В (&ОргВладОР)");
	КонецЕсли;
	Если ЭтотОбъект["гкс_ПодрВладОРИсп"] Тогда 
		ТекстОтбора1.Добавить("ОбъектРемонта.Подразделение В (&ПодрВладОР)");
		ТекстОтбора2.Добавить("ОбъектРемонтныхРабот.Подразделение В (&ПодрВладОР)");
	КонецЕсли;
	Если ЭтотОбъект["гкс_ВидРемонтаИсп"] Тогда 
		ТекстОтбора1.Добавить("ВидРемонта В (&ВидРемонта)");
		ТекстОтбора2.Добавить("ВидРемонтныхРабот В (&ВидРемонта)");
	КонецЕсли;
	Если ЭтотОбъект["гкс_НаправлениеИсп"] Тогда 
		ТекстОтбора1.Добавить("ОбъектРемонта.Направление В (&Направление)");
		ТекстОтбора2.Добавить("ОбъектРемонтныхРабот.Направление В (&Направление)");
	КонецЕсли;
	Если ТекстОтбора1.Количество() Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборРемонты1", СтрСоединить(ТекстОтбора1, " И "));
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборРемонты1", "Истина");
	КонецЕсли;
	Если ТекстОтбора2.Количество() Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборРемонты2", СтрСоединить(ТекстОтбора2, " И "));
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборРемонты2", "Истина");
	КонецЕсли;
	// гкс+ [] Деснол 12.09.2022
	Если ЭтотОбъект["гкс_ОтветИсп"] Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборРемонты6", "Регистратор.Ответственный В (&Ответственный)");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборРемонты6", "Истина");
	КонецЕсли;
	// гкс- [] Деснол 12.09.2022
	// гкс+ [разработка 2021] Куст 08.07.2021
	Если ЭтотОбъект["гкс_ИспОтборНуженОстанов"] Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &ОтборОстанов0",
			"И РемонтыЗаявокБезОтмененных.Регистратор.гкс_НуженОстанов = """ 
			+ ?(ЭтотОбъект["гкс_ОтборНуженОстанов"], "ДА", "НЕТ") + """");
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &ОтборОстанов0", "");
	КонецЕсли;
	Если ЭтотОбъект["гкс_СтатусСогласованияИсп"] Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Статус", " торо_ТекущиеСтатусыСогласованияДокументов.СтатусДокумента
		|	В (&Статус)");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Статус", " Истина ");
	КонецЕсли;
	// гкс- [разработка 2021] Куст 08.07.2021
	Сдвиг = Час(ТекущаяДатаСеанса()) - Час(ТекущаяДата());
	Запрос.УстановитьПараметр("Сдвиг", Сдвиг);
	
	Запрос.УстановитьПараметр("МассивОР", МассивОР);
	Если ЭтотОбъект["гкс_ОргВладОР"].Количество() Тогда 
		Запрос.УстановитьПараметр("ОргВладОР", ЭтотОбъект["гкс_ОргВладОР"]);
	Иначе
		Запрос.УстановитьПараметр("ОргВладОР", Справочники.Организации.ПустаяСсылка());
	КонецЕсли;
	Если ЭтотОбъект["гкс_ПодрВладОР"].Количество() Тогда 
		Запрос.УстановитьПараметр("ПодрВладОР", ЭтотОбъект["гкс_ПодрВладОР"]);
	Иначе
		Запрос.УстановитьПараметр("ПодрВладОР", Справочники.СтруктураПредприятия.ПустаяСсылка());
	КонецЕсли;
	Если ЭтотОбъект["гкс_Орг"].Количество() Тогда 
		Запрос.УстановитьПараметр("Орг", ЭтотОбъект["гкс_Орг"]);
	Иначе
		Запрос.УстановитьПараметр("Орг", Справочники.Организации.ПустаяСсылка());
	КонецЕсли;
	Если ЭтотОбъект["гкс_Подр"].Количество() Тогда 
		Запрос.УстановитьПараметр("Подр", ЭтотОбъект["гкс_Подр"]);
	Иначе
		Запрос.УстановитьПараметр("Подр", Справочники.СтруктураПредприятия.ПустаяСсылка());
	КонецЕсли;
	Если ЭтотОбъект["гкс_ПодрИсп_"].Количество() Тогда 
		Запрос.УстановитьПараметр("ПодрИсп", ЭтотОбъект["гкс_ПодрИсп_"]);
	Иначе
		МассивПустыхСсылок = Новый Массив();
		МассивПустыхСсылок.Добавить(Справочники.СтруктураПредприятия.ПустаяСсылка());
		МассивПустыхСсылок.Добавить(Справочники.Контрагенты.ПустаяСсылка());
		Запрос.УстановитьПараметр("ПодрИсп", МассивПустыхСсылок);
	КонецЕсли;
	Запрос.УстановитьПараметр("ВидРемонта", ЭтотОбъект["гкс_ВидРемонта"]);
	Если ЭтотОбъект["гкс_Направление"].Количество() Тогда 
		Запрос.УстановитьПараметр("Направление", ЭтотОбъект["гкс_Направление"]);
	Иначе
		Запрос.УстановитьПараметр("Направление", Справочники.торо_НаправленияОбъектовРемонтныхРабот.ПустаяСсылка());
	КонецЕсли;
	Если ЭтотОбъект["гкс_СтатусСогласования"].Количество() Тогда 
		Запрос.УстановитьПараметр("Статус", ЭтотОбъект["гкс_СтатусСогласования"]);
	Иначе
		Запрос.УстановитьПараметр("Статус", Справочники.торо_СтатусыСогласованияДокументовРемонтныхРабот.ПустаяСсылка());
	КонецЕсли;
	// гкс+ [] Деснол 12.09.2022
	Если ЭтотОбъект["гкс_ОтветИсп"] Тогда 
		Запрос.УстановитьПараметр("Ответственный", ЭтотОбъект["гкс_ОтборОтветственный"]);
	Иначе
		Запрос.УстановитьПараметр("Ответственный", Справочники.Пользователи.ПустаяСсылка());
	КонецЕсли;
	// гкс- [] Деснол 12.09.2022
	
	
	Запрос.УстановитьПараметр("Регистратор", ДокументИсточник);
	ЧислоСекундВОдномЧасе = 3600;
	МаксимальныйГодДоступныйВПлатформе1С = 3999;
	

	Если ЗначениеЗаполнено(ОтборДатаНачала) Тогда 
		Запрос.УстановитьПараметр("ОтборДатаНачала", ОтборДатаНачала - (Сдвиг * ЧислоСекундВОдномЧасе));
	Иначе
		Запрос.УстановитьПараметр("ОтборДатаНачала", ОтборДатаНачала);
	КонецЕсли;
	//
	Если ЗначениеЗаполнено(ОтборДатаОкончания) Тогда 
		Запрос.УстановитьПараметр("ОтборДатаОкончания", ОтборДатаОкончания - (Сдвиг * ЧислоСекундВОдномЧасе));
	Иначе
		Запрос.УстановитьПараметр("ОтборДатаОкончания", Дата(МаксимальныйГодДоступныйВПлатформе1С, 1, 1));
	КонецЕсли;

	РезультатЗапроса = Запрос.Выполнить();
	Ремонты.Загрузить(РезультатЗапроса.Выгрузить());
	// гкс+ [разработка 2021] Куст 08.07.2021
	НомерПП = 1;
	Для Каждого СТ Из Ремонты Цикл
		Ст.НомерСтроки = НомерПП;
		НомерПП = НомерПП + 1;
	КонецЦикла;
	// гкс- [разработка 2021] Куст 08.07.2021
КонецПроцедуры
// гкс- [разработка 2021] Куст 30.04.2021

// гкс+ [разработка 2021] Куст 07.07.2021
&НаКлиенте
Процедура гкс_ИспОтборНуженОстановПриИзменении(Элемент)
	Если ЭтотОбъект["гкс_ИспОтборНуженОстанов"] Тогда 
		ЭтотОбъект["гкс_ОтборНуженОстанов"] = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПОЛУЧИТЬСТРУКТУРУ_СТРОКАРЕМОНТОВОБОРУДОВАНИЯ")
Функция гкс_ПОЛУЧИТЬСТРУКТУРУ_СТРОКАРЕМОНТОВОБОРУДОВАНИЯ()
	Возврат Новый Структура("ID,
	|ВидРемонтныхРабот,
	|ДатаНачала,
	|ДатаОкончания,
	|Завершен,
	|ОбъектРемонта,
	|ОбъектРемонтаВладелец,
	|ИнвНомер,
	|ТехНомер,
	|ЗаводскойНомер,
	|ОписаниеРемонта,
	|СпособВыполнения,
	|Исполнитель,
	|КритичностьДефекта, 
	|Подчиненный, 
	#Вставка
	|Статус, 
	|ОписаниеРемонта, 
	#КОнецВставки
	|Зависимый");
КонецФункции

&НаКлиенте
&ИзменениеИКонтроль("РемонтыВыбор")
Процедура гкс_РемонтыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ТекущиеДанные = Элементы.Ремонты.ТекущиеДанные;

	Если Не ТекущиеДанные = Неопределено Тогда
		#Вставка
		Если Поле.Имя = Элементы.РемонтыДокументРегистратор.Имя Тогда 
			ПоказатьЗначение(,ТекущиеДанные.ДокументОснование);
			Возврат;
		КонецЕсли;
		#КонецВставки
		СтрокаРемонтовОборудования = ПОЛУЧИТЬСТРУКТУРУ_СТРОКАРЕМОНТОВОБОРУДОВАНИЯ();
		ЗаполнитьЗначенияСвойств(СтрокаРемонтовОборудования, ТекущиеДанные);
		ОповеститьОВыборе(Новый Структура("СтрокаРемонтовОборудования, ДокументОснование", СтрокаРемонтовОборудования, ТекущиеДанные.ДокументОснование));
	КонецЕсли; 

КонецПроцедуры
// гкс- [разработка 2021] Куст 07.07.2021
#КонецОбласти

