#Область ОбработчикиСобытийФормы
&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура гкс_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("Основание") 
		И ТипЗнч(Параметры.Основание) <> Тип("Структура") 
		И ТипЗнч(Параметры.Основание) <> Тип("Соответствие") Тогда
		торо_ЗаполнениеДокументов.ПроверитьВозможностьВводаНаОсновании(Параметры.Основание, Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли;

	Если Параметры.Свойство("Основание") И Параметры.Свойство("ВыделенныеСтроки") Тогда
		ДокОснованиеППР = Параметры.Основание;
		МассивIDИзППР.ЗагрузитьЗначения(Параметры.ВыделенныеСтроки);
	КонецЕсли;

	Если Параметры.Свойство("ID") Тогда

		Строки = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", Параметры.ID));
		Если Строки.Количество() Тогда
			Элементы.РемонтыОборудования.ТекущаяСтрока = Строки[0].ПолучитьИдентификатор();
		КонецЕсли;

	КонецЕсли;

	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства

	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

	УстановитьУсловноеОформление();

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// ФункциональныеОпции
	ФОИспользоватьГарантии      = ПолучитьФункциональнуюОпцию("торо_ИспользоватьГарантии");
	ФОЗапретитьРемонтГарантийногоОборудованияХозспособом = ПолучитьФункциональнуюОпцию("торо_ЗапретитьРемонтГарантийногоОборудованияХозспособом");
	ФОИспользоватьОстановочные	= ПолучитьФункциональнуюОпцию("торо_ИспользоватьОстановочныеРемонты");

	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда

		Если ФОИспользоватьГарантии Тогда
			Для каждого ТекСтрока из Объект.РемонтыОборудования Цикл
				ТекСтрока.ГарантийныйРемонт = торо_ГарантийноеОбслуживание.ПолучитьЗначениеФлагаГарантийныйРемонтДляОбъектаРемонта(
				ТекСтрока.ОбъектРемонта, ТекСтрока.ДатаНачала, ТекСтрока.ДатаОкончания);
			КонецЦикла;
		КонецЕсли;		
	КонецЕсли;

	ЗаполнитьДеревоРемонтныхРаботНаСервере();

	// Заголовок формы++
	торо_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(Объект, ЭтаФорма, "");
	// Заголовок формы--

	// Согласование++
	ВидДокумента = Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_НарядНаВыполнениеРемонтныхРабот;
	торо_РаботаССогласованиями.ПриСозданииНаСервере(ЭтаФорма, ВидДокумента);
	// Согласование --

	Для Каждого СтрокаРемонта Из Объект.РемонтыОборудования Цикл
		Если СтрокаРемонта.ДокументИсточник <> Неопределено Тогда
			СтрокаРемонта.ТипДокументаОснования = СтрокаРемонта.ДокументИсточник.Метаданные().Имя;
		КонецЕсли;	
	КонецЦикла;

	ПравоРедактирование = ПравоДоступа("Редактирование", Метаданные.Документы.торо_НарядНаВыполнениеРемонтныхРабот);

	Если ФОИспользоватьОстановочные Тогда
		ОбновитьОстановочные();
	КонецЕсли;
	ОбновитьЗависимыеЛоты();
	ОбновитьДоступностьДляРедактирования();

	// Ограничение ввода на основании
	торо_СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка, Новый Структура("ОграничитьВводНаОсновании, УстановитьСвойствоЭлементовФормыОтПрав",Истина, Истина));

	УправлениеВидимостью(ЭтотОбъект);

	ПараметрыВыбораМассив = Новый Массив;
	ПараметрыВыбораМассив.Добавить(Новый ПараметрВыбора("ДополнительныеПараметры.ОтображениеСписком", Истина));
	Элементы.ДеревоРемонтныхРаботИсполнитель.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораМассив);

	// >> [Деснол] [Ушаков А.Д.] [03.10.2019]
	дс_ЛокализоватьУсловноеОформление();
	// << [Деснол] [Ушаков А.Д.] [03.10.2019] 
	#Вставка
	// гкс+ [Релиз16] Деснол
	торо_ЗаполнениеДокументов.гкс_ПроверитьВозможностьВводаОтСтатуса(Объект, Отказ);
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	// гкс- [Релиз16]
	
	// гкс+ [Часовые пояса] Куст
	гкс_ЧасовыеПоясаВызовСервера.ДобавитьНовыеЭлементы(ЭтаФорма, Элементы.ДатаИНомер,
		Новый Структура("гкс_РеквизитыДаты", 
		"Дата,РемонтыОборудования.ДатаНачала,РемонтыОборудования.ДатаОкончания"
		+ ",Исполнители.ДатаНачала,Исполнители.ДатаОкончания"
		+ ",ИсполнителиПоРемонтам.ДатаНачала,ИсполнителиПоРемонтам.ДатаОкончания"
		));	// гкс- [Часовые пояса]
	
	ДобавитьНовыеЭлементы();
	Для каждого Строка Из Объект.Исполнители Цикл
		Строка.гкс_ВремяРаботыТекст = Расш_гкс_СформироватьПродолжительность(Строка.гкс_ВремяРаботы);
	КонецЦикла;
	// гкс+ [КатегорияРиска] Куст
	гкс_ОбщегоНазначенияСервер.ДобавитьКатегориюРискаВТЧ(
		ЭтаФорма, "РемонтыОборудования", "РемонтыОборудованияВидРемонтныхРабот");

	// гкс+ [Релиз 1] Куст 
	Элементы.СпособСогласования.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
	Если Не ЗначениеЗаполнено(Объект.Ссылка) И Объект.ДокументыОснования.Количество() Тогда 
		МассивСмет = Новый Массив();
		Для Каждого СТ Из Объект.ДокументыОснования Цикл
			Если ТипЗнч(СТ.ДокументОснование) = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") Тогда 
				МассивСмет.Добавить(СТ.ДокументОснование);
			КонецЕсли;
		КонецЦикла;
		Если МассивСмет.Количество() Тогда 
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	Док.Ссылка КАК Ссылка
				|ИЗ
				|	Документ.торо_ЗаявкаНаРемонт КАК Док
				|ГДЕ
				|	Док.гкс_РаботаПовышеннойОпасности = ""Да""
				|	И Док.Ссылка В(&МассивСмет)";
			
			Запрос.УстановитьПараметр("МассивСмет", МассивСмет);
			
			РезультатЗапроса = Запрос.Выполнить();
	 		Объект.гкс_ОформитьНарядДопуск = Не РезультатЗапроса.Пустой();
		КонецЕсли;
	КонецЕсли;
	гкс_ОбновитьНомерНарядДопуска();
	гкс_ДобавитьГруппуКомандПечатиБАТ(); 
	// гкс+ [Релиз17] Деснол
	Если Параметры.Ключ.Пустая() Тогда 
		гкс_УдалитьИспользованныеТО();
	КонецЕсли;
	// гкс- [Релиз17]
	#КонецВставки
КонецПроцедуры

&НаСервере
Процедура Расш_гкс_ПриЧтенииНаСервереПосле(ТекущийОбъект)
	// гкс+ [Часовые пояса] Куст 14.04.2020
	СтруктураПроверки = Новый Структура("гкс_СдвигЧП", Неопределено);
	ЗаполнитьЗначенияСвойств(СтруктураПроверки, ЭтотОбъект);
	Если Не СтруктураПроверки.гкс_СдвигЧП = Неопределено Тогда 
		гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПКлиента(ЭтаФорма,, Объект);
	КонецЕсли;
	// гкс- [Часовые пояса] Куст 14.04.2020
	// гкс+ [Категории риска] Куст 22.10.2020
	гкс_ОбщегоНазначенияСервер.ДобавитьУОКатегорииРиска(ЭтаФорма);
	// гкс- [Категории риска] Куст 22.10.2020
	// гкс+ [Релиз 1] Куст 31.03.2021
	гкс_ОбновитьНомерНарядДопуска();
	// гкс- [Релиз 1] Куст 31.03.2021
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере(ДатаКлиента)
	Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда 
		Объект.Дата = ТекущаяДата();
	КонецЕсли;
	// гкс+ [Часовые пояса] Куст 14.04.2020
	гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПКлиента(ЭтаФорма,,,);
	// Заголовок формы++
	торо_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(Объект, ЭтаФорма, "");
	// Заголовок формы--
	// гкс- [Часовые пояса] Куст 14.04.2020
КонецПроцедуры

&НаКлиенте
Процедура гкс_ПриОткрытииПосле(Отказ)
	ПриОткрытииНаСервере(ТекущаяДата());
	Для каждого Строка Из Объект.Исполнители Цикл
		Строка.гкс_ВремяРаботыТекст = Расш_гкс_СформироватьПродолжительность(Строка.гкс_ВремяРаботы);
	КонецЦикла;
	// гкс+ [Релиз16] Деснол
	Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда 
		гкс_ВыбратьИсполнителя();
	КонецЕсли;
	// гкс- [Релиз16]
КонецПроцедуры

&НаСервере
Процедура Расш_гкс_ПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// гкс+ [разработка 2021] Куст 09.07.2021
	Для Каждого СтрокаТаблицы ИЗ ТекущийОбъект.РемонтныеРаботы Цикл
		Если ТипЗнч(СтрокаТаблицы.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда 
			СтрокаТаблицы.гкс_ПовКоэф = Неопределено;
		ИначеЕсли ЗначениеЗаполнено(СтрокаТаблицы.гкс_ПовКоэф) = Ложь Тогда 
			СтрокаТаблицы.гкс_ПовКоэф = Справочники.гкс_ПКоэффициентыРабот.ПоУмолчанию;
		КонецЕсли;
	КонецЦикла;
	// гкс- [разработка 2021] Куст 09.07.2021
	// гкс+ [Часовые пояса] Куст 14.04.2020
	гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПСервера(ЭтаФорма,, ТекущийОбъект);
	// гкс- [Часовые пояса] Куст 14.04.2020
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПередЗаписью")
Процедура гкс_ПередЗаписью(Отказ, ПараметрыЗаписи)

	#Вставка
	// гкс+ [Перед записью] Куст 27.10.2020
	МассивСтруктур = новый Массив();
	МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "Организация", НСтр("ru='Организация';en='Organization'")));
	МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "Подразделение", НСтр("ru='Подразделение';en='Subdivision'")));
	МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "Ответственный", НСтр("ru='Ответственный';en='Responsible'")));
	Для Каждого СтрокаМассива Из МассивСтруктур Цикл
		Если Не ЗначениеЗаполнено(Объект[СтрокаМассива.Имя]) Тогда 
			Сообщение = Новый СообщениеПользователю();
			ШаблонСообщения = НСтр("ru='Поле ""%1"" не заполнено';en='Field %1 is empty'");
			Сообщение.Текст = СтрШаблон(ШаблонСообщения, СтрокаМассива.Текст);
			Сообщение.Поле = "Объект." + СтрокаМассива.Имя;
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	//
	Отображать = Истина;
	Если Объект.ИсполнителиПоРемонтам.Количество() Тогда 
		Если ТипЗнч(Объект.ИсполнителиПоРемонтам[0].Исполнитель) = Тип("СправочникСсылка.Контрагенты") Тогда 
			Отображать = Ложь;
		КонецЕсли;
	КонецЕсли;
	Если Объект.Исполнители.Количество() = 0 Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='В документе не указан исполнитель ремонтных работ';
			|en='The document does not specify the contractor for the repair work'");
		Сообщение.Сообщить();
		Отказ = Истина;
	Иначе
		МассивСтруктур = новый Массив();
		Если Отображать Тогда 
			МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "Сотрудник",
			НСтр("ru='Сотрудник';en='Employee'")));
		Иначе
			МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "гкс_Количество",
			НСтр("ru='Количество';en='Count'")));
		КонецЕсли;
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "Квалификация", 
			НСтр("ru='Квалификация';en='Qualification'")));
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "ДатаНачала",
			НСтр("ru='Дата начала';en='Start date'")));
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "ДатаОкончания", 
			НСтр("ru='Дата окончания';en='End date'")));
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст,Имя2", "гкс_ВремяРаботы", 
			НСтр("ru='Время работы';en='Working hours'"), "гкс_ВремяРаботыТекст"));
		Для Каждого СтрокаМассива Из МассивСтруктур Цикл
			НомерПП = 0;
			Для Каждого СтрокаТаблицы Из Объект.Исполнители Цикл
				Если Не ЗначениеЗаполнено(СтрокаТаблицы[СтрокаМассива.Имя]) Тогда 
					Сообщение = Новый СообщениеПользователю();
					ШаблонСообщения = НСтр("ru='Поле ""%1"" не заполнено';en='Field %1 is empty'");
					Сообщение.Текст = СтрШаблон(ШаблонСообщения, СтрокаМассива.Текст);
					Сообщение.Поле = "Объект.Исполнители[" + НомерПП + "]." 
					+ ?(СтрокаМассива.Свойство("Имя2"), СтрокаМассива.Имя2, СтрокаМассива.Имя);
					Сообщение.Сообщить();
					Отказ = Истина;
				КонецЕсли;
				НомерПП = НомерПП + 1;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	//
	Если Объект.ИсполнителиПоРемонтам.Количество() = 0 Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='В документе не указан исполнитель ремонта';
			|en='The document does not specify the repair contractor'");
		Сообщение.Сообщить();
		Отказ = Истина;
	Иначе
		МассивСтруктур = новый Массив();
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "Исполнитель", 
			НСтр("ru='Исполнитель';en='Executor'")));
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "ДатаНачала",
			НСтр("ru='Дата начала';en='Start date'")));
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "ДатаОкончания", 
			НСтр("ru='Дата окончания';en='End date'")));
		Для Каждого СтрокаМассива Из МассивСтруктур Цикл
			НомерПП = 0;
			Для Каждого СтрокаТаблицы Из Объект.ИсполнителиПоРемонтам Цикл
				Если Не ЗначениеЗаполнено(СтрокаТаблицы[СтрокаМассива.Имя]) Тогда 
					Сообщение = Новый СообщениеПользователю();
					ШаблонСообщения = НСтр("ru='Поле ""%1"" не заполнено';en='Field %1 is empty'");
					Сообщение.Текст = СтрШаблон(ШаблонСообщения, СтрокаМассива.Текст);
					Сообщение.Поле = "Объект.ИсполнителиПоРемонтам[" + НомерПП + "]." + СтрокаМассива.Имя;
					Сообщение.Сообщить();
					Отказ = Истина;
				КонецЕсли;
				НомерПП = НомерПП + 1;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	//
	Если Объект.РемонтыОборудования.Количество() = 0 Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='В документе не указан ОР';en='The document does not specify an OR'");
		Сообщение.Сообщить();
		Отказ = Истина;
	Иначе
		МассивСтруктур = новый Массив();
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "ОбъектРемонта",
			НСтр("ru='Объект ремонта';en='Object of repair'")));
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "ВидРемонтныхРабот", 
			НСтр("ru='Вид ремонтных работ';en='Type of repair work'")));
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "ДатаНачала",
			НСтр("ru='Дата начала';en='Start date'")));
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "ДатаОкончания",
			НСтр("ru='Дата окончания';en='End date'")));
		Для Каждого СтрокаМассива Из МассивСтруктур Цикл
			НомерПП = 0;
			Для Каждого СтрокаТаблицы Из Объект.РемонтыОборудования Цикл
				Если Не ЗначениеЗаполнено(СтрокаТаблицы[СтрокаМассива.Имя]) Тогда 
					Сообщение = Новый СообщениеПользователю();
					ШаблонСообщения = НСтр("ru='Поле ""%1"" не заполнено';en='Field %1 is empty'");
					Сообщение.Текст = СтрШаблон(ШаблонСообщения, СтрокаМассива.Текст);
					Сообщение.Поле = "Объект.РемонтыОборудования[" + НомерПП + "]." + СтрокаМассива.Имя;
					Сообщение.Сообщить();
					Отказ = Истина;
				КонецЕсли;
				НомерПП = НомерПП + 1;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	//
	Если Объект.РемонтныеРаботы.Количество() = 0 Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='В документе не указана ремонтная работа';en='The document does not specify repairs'");
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	// гкс- [Перед записью] Куст 27.10.2020
	#КонецВставки
КонецПроцедуры

&НаСервере
Процедура Расш_гкс_ПриЗаписиНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// гкс+ [Часовые пояса] Куст 14.04.2020
	гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПКлиента(ЭтаФорма,, ТекущийОбъект);
	// гкс- [Часовые пояса] Куст 14.04.2020
КонецПроцедуры

// гкс+ [Категории риска] Куст
&НаКлиенте
Процедура Расш_гкс_ПослеЗаписиПосле(ПараметрыЗаписи)
	ОбновитьЗаливкуЗаголовка();
КонецПроцедуры

// гкс+ [Релиз16] Деснол
&НаКлиенте
&ИзменениеИКонтроль("ОбработкаВыбора")
Процедура гкс_ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)

	РемонтУжеДобавлен = Ложь;
	ЭтоРемонтнаяРабота = Ложь;
	МассивИДДобавленныхРемонтов = Новый Массив;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") И ВыбранноеЗначение.Количество() > 0 Тогда 
		Для каждого ЭлементМассива Из ВыбранноеЗначение Цикл
			Если ТипЗнч(ЭлементМассива) = Тип("Структура") И ЭлементМассива.Свойство("СтрокаРемонтовОборудования") Тогда 
				НайденныеРемонты = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", ЭлементМассива.СтрокаРемонтовОборудования.ID));
				Если НайденныеРемонты.Количество() > 0 Тогда
					РемонтУжеДобавлен = Истина;
					МассивИДДобавленныхРемонтов.Добавить(ЭлементМассива.СтрокаРемонтовОборудования.ID);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;

		Если РемонтУжеДобавлен Тогда 
			Вопрос = НСтр("es='Algunos de las reparaciones escogidas son añadidos ya. Los trabajos de reparación vinculados serán limpiados y añadidos de nuevo. ¿Continuar?';ru='Некоторые из выбранных ремонтов уже добавлены. Связанные ремонтные работы будут очищены и добавлены заново. Продолжить?';en='Some of the selected repairs have already been added. Associated repairs will be cleaned and re-added. Continue?'");
		КонецЕсли;
	КонецЕсли;

	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") И ВыбранноеЗначение.Свойство("СтрокаРемонтовОборудования") 
		И ВыбранноеЗначение.Количество() > 0 Тогда
		ЭтоРемонтнаяРабота = ВыбранноеЗначение.ЭтоРемонтнаяРабота;
		НайденныеРемонты = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", ВыбранноеЗначение.СтрокаРемонтовОборудования.ID));
		Если НайденныеРемонты.Количество() > 0 Тогда
			РемонтУжеДобавлен = Истина;
			МассивИДДобавленныхРемонтов.Добавить(ВыбранноеЗначение.СтрокаРемонтовОборудования.ID);
		КонецЕсли;

		Если РемонтУжеДобавлен Тогда 
			Вопрос = НСтр("es='Esta reparación es añadida ya. Los trabajos de reparación vinculados serán limpiados y añadidos de nuevo. ¿Continuar?';ru='Этот ремонт уже добавлен. Связанные ремонтные работы будут очищены и добавлены заново. Продолжить?';en='This repair has already been added. Associated repairs will be cleaned and re-added. Continue?'");
		КонецЕсли;
	КонецЕсли;

	Если РемонтУжеДобавлен И НЕ ЭтоРемонтнаяРабота Тогда
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ВыбранноеЗначение", ВыбранноеЗначение);
		СтруктураПараметров.Вставить("МассивИДДобавленныхРемонтов", МассивИДДобавленныхРемонтов);
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаВыбораПослеВопроса", ЭтотОбъект, СтруктураПараметров),
		Вопрос, РежимДиалогаВопрос.ДаНет);
	Иначе
		ОбработкаВыбораЗавершение(ВыбранноеЗначение);
	КонецЕсли;

	#Вставка
	гкс_ВыбратьИсполнителя();
	#КонецВставки
КонецПроцедуры
// гкс- [Релиз16]

&НаКлиенте
Процедура Расш_гкс_ИсполнителиВремяРаботыТекстНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Исполнители.ТекущиеДанные;
	
	Если Не ТекущиеДанные = Неопределено Тогда
		
		торо_ЗаполнениеДокументовКлиент.ОткрытьФормуПодбораПродолжительности(ТекущиеДанные.гкс_ВремяРаботы,Элемент,Объект.Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш_гкс_ИсполнителиВремяРаботыТекстОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Исполнители.ТекущиеДанные;
	
	Если Не ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные.гкс_ВремяРаботыТекст = Расш_гкс_СформироватьПродолжительность(ВыбранноеЗначение);
		ТекущиеДанные.гкс_ВремяРаботы      = ВыбранноеЗначение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция Расш_гкс_СформироватьПродолжительность(ПродолжительностьВСекундах)
	
	Если ПродолжительностьВСекундах = 0 Тогда
		
		Возврат "Ввести продолжительность";
		
	Иначе
		
		Часы    = Цел(ПродолжительностьВСекундах / 3600);
		Минуты  = Цел((ПродолжительностьВСекундах - 3600 * Часы) / 60);
		Секунды = ПродолжительностьВСекундах - 3600 * Часы - Минуты * 60;
		
		Возврат "" + Часы + " ч. " + Минуты + " мин. " + Секунды + " с.";
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура Расш_гкс_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	Для каждого Строка Из Объект.Исполнители Цикл
		Строка.гкс_ВремяРаботыТекст = Расш_гкс_СформироватьПродолжительность(Строка.гкс_ВремяРаботы);
	КонецЦикла;
	// гкс+ [Категории риска] Куст 22.10.2020
	гкс_ОбщегоНазначенияСервер.ДобавитьУОКатегорииРиска(ЭтаФорма);
	// гкс- [Категории риска] Куст 22.10.2020
	// гкс+ [Релиз 1] Куст 31.03.2021
	Если ЗначениеЗаполнено(ТекущийОбъект.Ссылка) Тогда 
		Если ЭтотОбъект["гкс_НарядДопускНомерИзменен"] Тогда 
			ТекГод = НачалоГода(ТекущийОбъект.Дата);
			НаборЗаписей = РегистрыСведений.гкс_НомераНарядДопусков.СоздатьнаборЗаписей();
			НаборЗаписей.Отбор.Документ.Установить(ТекущийОбъект.Ссылка);
			НоваяСтрока = НаборЗаписей.Добавить();
			НоваяСтрока.Номер = ЭтотОбъект["гкс_НарядДопускНомер"];
			НоваяСтрока.НомерТекст = Формат(НоваяСтрока.Номер, "ЧГ=0");
			Пока СтрДлина(НоваяСтрока.НомерТекст) < 11 Цикл
				НоваяСтрока.НомерТекст = "0" + НоваяСтрока.НомерТекст;
			КонецЦикла;
			НоваяСтрока.Год = ТекГод;
			НоваяСтрока.Подразделение = ТекущийОбъект.Подразделение;
			НоваяСтрока.Документ = ТекущийОбъект.Ссылка;
			НаборЗаписей.Записать();
			ЭтотОбъект["гкс_НарядДопускНомерИзменен"] = Ложь;
		Иначе
			гкс_ОбновитьНомерНарядДопуска();
		КонецЕсли;
	КонецЕсли;
	// гкс- [Релиз 1] Куст 31.03.2021
КонецПроцедуры

// гкс+ [Категории риска] Куст
&НаКлиенте
&После("РемонтыОборудованияПриАктивизацииСтроки")
Процедура Расш_гкс_РемонтыОборудованияПриАктивизацииСтроки(Элемент)
	ОбновитьЗаливкуЗаголовка();
КонецПроцедуры
// гкс- [Категории риска] Куст 22.10.2020

&НаСервере
&ИзменениеИКонтроль("ОтредактироватьУсловноеОформление")
Процедура Расш_гкс_ОтредактироватьУсловноеОформление(ИдСтроки, ИДРемонта)

	ЭлементОформления1 = Неопределено;
	ЭлементОформления2 = Неопределено;
	Для каждого ТекУо из УсловноеОформление.Элементы Цикл
		Если ТекУо.Представление = "ВидимостьИсполнителей1" Тогда
			ЭлементОформления1 = ТекУо;
			#Вставка
			НовоеПолеЭлементаУсловногоОформления = ЭлементОформления1.Поля.Элементы.Добавить(); 
			НовоеПолеЭлементаУсловногоОформления.Поле = Новый ПолеКомпоновкиДанных("Исполнителигкс_ВремяРаботыТекст");
			НовоеПолеЭлементаУсловногоОформления.Использование = Истина;
			НовоеПолеЭлементаУсловногоОформления = ЭлементОформления1.Поля.Элементы.Добавить(); 
			НовоеПолеЭлементаУсловногоОформления.Поле = Новый ПолеКомпоновкиДанных("гкс_СотрудникКонтрагента");
			НовоеПолеЭлементаУсловногоОформления.Использование = Истина;
			#КонецВставки
		КонецЕсли;

		Если ТекУо.Представление = "ВидимостьИсполнителей2" Тогда
			ЭлементОформления2 = ТекУо;
			#Вставка
			НовоеПолеЭлементаУсловногоОформления = ЭлементОформления2.Поля.Элементы.Добавить();
			НовоеПолеЭлементаУсловногоОформления.Поле = Новый ПолеКомпоновкиДанных("Исполнителигкс_ВремяРаботыТекст");
			НовоеПолеЭлементаУсловногоОформления.Использование = Истина;
			НовоеПолеЭлементаУсловногоОформления = ЭлементОформления2.Поля.Элементы.Добавить(); 
			НовоеПолеЭлементаУсловногоОформления.Поле = Новый ПолеКомпоновкиДанных("гкс_СотрудникКонтрагента");
			НовоеПолеЭлементаУсловногоОформления.Использование = Истина;
			#КонецВставки
		КонецЕсли;

	КонецЦикла;

	ТекСтрокаДереваРемонтов = ДеревоРемонтныхРабот.НайтиПоИдентификатору(ИдСтроки);

	масСтрок = Новый Массив;
	торо_РаботаССогласованиямиКлиентСервер.ЗаполнитьМассивИзДерева(масСтрок, ТекСтрокаДереваРемонтов.ПолучитьЭлементы());

	сзИД = Новый СписокЗначений;
	Для каждого текСтрока из масСтрок Цикл
		сзИД.Добавить(текСтрока.ID);
	КонецЦикла;
	сзИД.Добавить(ТекСтрокаДереваРемонтов.ID);

	Если ЭлементОформления1 <> Неопределено Тогда
		ЭлементОформления1.Использование = Истина;
		ЭлементОформления1.Отбор.Элементы[0].ПравоеЗначение = сзИД;
	КонецЕсли;

	Если ЭлементОформления2 <> Неопределено Тогда
		ЭлементОформления2.Использование = ЗначениеЗаполнено(ИДРемонта);
		ЭлементОформления2.Отбор.Элементы[0].ПравоеЗначение = ИДРемонта;
	КонецЕсли;

	Если ЗначениеЗаполнено(ТекСтрокаДереваРемонтов.ID) И ЗначениеЗаполнено(ИДРемонта) Тогда 
		МассивСтрок = Объект.Исполнители.НайтиСтроки(Новый Структура("ID, РемонтыОборудования_ID", ТекСтрокаДереваРемонтов.ID, ИДРемонта));
		Если МассивСтрок.Количество() > 0 Тогда 
			Элементы.Исполнители.ТекущаяСтрока = МассивСтрок[0].ПолучитьИдентификатор();
		КонецЕсли; 
	ИначеЕсли ЗначениеЗаполнено(ИДРемонта) Тогда  
		МассивСтрок = Объект.Исполнители.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", ИДРемонта));
		Если МассивСтрок.Количество() > 0 Тогда 
			Элементы.Исполнители.ТекущаяСтрока = МассивСтрок[0].ПолучитьИдентификатор();
		КонецЕсли; 
	КонецЕсли;
	#Вставка
	// гкс+ [КатегорияРиска] Куст 19.10.2020
	гкс_ОбщегоНазначенияСервер.ДобавитьУОКатегорииРиска(ЭтаФорма);
	// гкс- [КатегорияРиска] Куст 19.10.2020
	// гкс+ [Релиз 1] Куст 22.04.2021
	гкс_ОбщегоНазначенияСервер.гкс_ДобавитьУсловноеОформлениеДереваРР(ЭтаФорма);
	// гкс- [Релиз 1] Куст 22.04.2021
	#КонецВставки

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("УстановкаИсполнителей")
Процедура Расш_гкс_УстановкаИсполнителей(ВыбранноеЗначение)
	РемОборудования = ВыбранноеЗначение.СтрокаРемонтовОборудования.ID;
	НайденныеСтрокиРемонта = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", РемОборудования ));	
	НайденныеСтрокиТрудозатрат = Объект.Исполнители.НайтиСтроки( Новый Структура("РемонтыОборудования_ID", РемОборудования ));
	Если НайденныеСтрокиРемонта.Количество() <> 0 Тогда
		НомерСтроки = НайденныеСтрокиРемонта[0].ПолучитьИдентификатор();
		ЗаполнитьИсполнителейПоНормамНаСервере(Неопределено, НомерСтроки);
		#Вставка
		Если ТипЗнч(ВыбранноеЗначение.ДокументОснование) = Тип("ДокументСсылка.торо_ПланГрафикРемонта") ИЛИ 
			ТипЗнч(ВыбранноеЗначение.ДокументОснование) = Тип("ДокументСсылка.торо_ВыявленныеДефекты") ИЛИ 
			ТипЗнч(ВыбранноеЗначение.ДокументОснование) = Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот") Тогда
			ЗаполнитьИсполнителейПоНормамНаСервере(Неопределено, НомерСтроки);
		КонецЕсли;
		#КонецВставки
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура Расш_гкс_ОбработкаВыбораПосле(ВыбранноеЗначение, ИсточникВыбора)
	
	Для каждого Строка Из Объект.Исполнители Цикл
		Строка.гкс_ВремяРаботыТекст = Расш_гкс_СформироватьПродолжительность(Строка.гкс_ВремяРаботы);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПолучитьМассивСтруктурИсполнителей")
Функция Расш_гкс_ПолучитьМассивСтруктурИсполнителей()
	Массив = Новый Массив;

	Для каждого СтрокаРемонтовОборудования Из Объект.РемонтыОборудования Цикл

		МассивСтрокРемонныхРабот = Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", СтрокаРемонтовОборудования.ID));

		Для каждого СтрокаРемонтныхРабот Из МассивСтрокРемонныхРабот Цикл

			МассивИсполнителей = Объект.Исполнители.НайтиСтроки(Новый Структура("РемонтыОборудования_ID, ID", СтрокаРемонтовОборудования.ID, СтрокаРемонтныхРабот.ID));

			Для каждого СтрокаИсполнителя Из МассивИсполнителей Цикл

				СтруктураСтроки = Новый Структура();
				СтруктураСтроки.Вставить("РемонтыОборудования_ID", СтрокаРемонтовОборудования.ID);
				СтруктураСтроки.Вставить("ID"                    , СтрокаРемонтныхРабот.ID);
				СтруктураСтроки.Вставить("Родитель_ID"           , СтрокаРемонтныхРабот.Родитель_ID);
				СтруктураСтроки.Вставить("РемонтнаяРабота"       , СтрокаРемонтныхРабот.РемонтнаяРабота);
				СтруктураСтроки.Вставить("ОбъектРемонта"         , СтрокаРемонтовОборудования.ОбъектРемонта);
				СтруктураСтроки.Вставить("ВидРемонта"            , СтрокаРемонтовОборудования.ВидРемонтныхРабот);
				СтруктураСтроки.Вставить("ДатаНачалаРемонта"     , СтрокаРемонтовОборудования.ДатаНачала);
				СтруктураСтроки.Вставить("ДатаОкончанияРемонта"  , СтрокаРемонтовОборудования.ДатаОкончания);
				СтруктураСтроки.Вставить("Квалификация"          , СтрокаИсполнителя.Квалификация);
				СтруктураСтроки.Вставить("ДатаНачала"            , СтрокаИсполнителя.ДатаНачала);
				СтруктураСтроки.Вставить("ДатаОкончания"         , СтрокаИсполнителя.ДатаОкончания);
				//СтруктураСтроки.Вставить("ВремяРаботы"           , СтрокаИсполнителя.ВремяРаботы);
				//СтруктураСтроки.Вставить("СуммаКНачислению"      , СтрокаИсполнителя.СуммаКНачислению);
				#Вставка
				СтруктураСтроки.Вставить("ВремяРаботы"           , СтрокаИсполнителя.гкс_ВремяРаботы);
				
				#КонецВставки
				СтруктураСтроки.Вставить("Сотрудник"             , СтрокаИсполнителя.Сотрудник);

				Массив.Добавить(СтруктураСтроки);

			КонецЦикла;

			Если Не ТипЗнч(СтрокаРемонтныхРабот.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт")
				И Не МассивИсполнителей.Количество() > 0 Тогда //нужно отразить хотя бы тех операции.

				СтруктураСтроки = Новый Структура();
				СтруктураСтроки.Вставить("РемонтыОборудования_ID", СтрокаРемонтовОборудования.ID);
				СтруктураСтроки.Вставить("ID"                    , СтрокаРемонтныхРабот.ID);
				СтруктураСтроки.Вставить("Родитель_ID"           , СтрокаРемонтныхРабот.Родитель_ID);
				СтруктураСтроки.Вставить("РемонтнаяРабота"       , СтрокаРемонтныхРабот.РемонтнаяРабота);
				СтруктураСтроки.Вставить("ОбъектРемонта"         , СтрокаРемонтовОборудования.ОбъектРемонта);
				СтруктураСтроки.Вставить("ВидРемонта"            , СтрокаРемонтовОборудования.ВидРемонтныхРабот);
				СтруктураСтроки.Вставить("ДатаНачалаРемонта"     , СтрокаРемонтовОборудования.ДатаНачала);
				СтруктураСтроки.Вставить("ДатаОкончанияРемонта"  , СтрокаРемонтовОборудования.ДатаОкончания);

				СтруктураСтроки.Вставить("Квалификация");
				СтруктураСтроки.Вставить("ДатаНачала");
				СтруктураСтроки.Вставить("ДатаОкончания");
				СтруктураСтроки.Вставить("ВремяРаботы");
				СтруктураСтроки.Вставить("СуммаКНачислению");
				СтруктураСтроки.Вставить("Сотрудник");

				Массив.Добавить(СтруктураСтроки);

			КонецЕсли; 

		КонецЦикла; 
	КонецЦикла; 

	Возврат Массив;

КонецФункции

&НаКлиенте
&ИзменениеИКонтроль("ОбработкаАвтоматическогоЗаполненияИсполнителей")
Процедура Расш_гкс_ОбработкаАвтоматическогоЗаполненияИсполнителей(Результат, ДопПараметры)

	Если Не Результат = Неопределено И ТипЗнч(Результат) = Тип("Массив") Тогда
		Объект.Исполнители.Очистить();
		Для каждого СтрокаМассива Из Результат Цикл
			НС = Объект.Исполнители.Добавить();
			ЗаполнитьЗначенияСвойств(НС, СтрокаМассива);
			#Вставка
			НС.гкс_ВремяРаботы = СтрокаМассива.ВремяРаботы;
			НС.гкс_ВремяРаботыТекст = Расш_гкс_СформироватьПродолжительность(СтрокаМассива.ВремяРаботы);
			#КонецВставки
		КонецЦикла; 
	КонецЕсли; 

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ЗаполнитьИсполнителей")
Процедура Расш_гкс_ЗаполнитьИсполнителей(Адрес)

	Если Адрес = Неопределено Тогда возврат; КонецЕсли;

	тз = ПолучитьИзВременногоХранилища(Адрес);

	стрОтбора = Новый Структура("РемонтыОборудования_ID, ID");

	Для каждого текСтрока из Тз Цикл
		ЗаполнитьЗначенияСвойств(стрОтбора, текСтрока);
		НайС = Объект.Исполнители.НайтиСтроки(стрОтбора);

		Для каждого ТезЗапись из НайС Цикл
			Объект.Исполнители.Удалить(ТезЗапись);
			Модифицированность = Истина;
		КонецЦикла;
	КонецЦикла;

	Для каждого текСтрока из Тз Цикл
		нс = Объект.Исполнители.Добавить();
		ЗаполнитьЗначенияСвойств(нс, текСтрока);
		#Вставка
		НС.гкс_ВремяРаботы = текСтрока.ВремяРаботы;
		НС.гкс_ВремяРаботыТекст = Расш_гкс_СформироватьПродолжительность(текСтрока.ВремяРаботы);
		#КонецВставки
	КонецЦикла;	

КонецПроцедуры

&НаСервере
Функция гкс_ПолучитьСпособСогласования(Орг, ОР)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ОбъектыРемонта.Подразделение КАК Подразделение
		|ИЗ
		|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|ГДЕ
		|	торо_ОбъектыРемонта.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ОР);
	РезультатЗапроса = Запрос.Выполнить();
	// гкс+ [разработка 2021] Куст 05.05.2021
	Если РезультатЗапроса.Пустой() 
		ИЛИ торо_РаботаССогласованиями.гкс_ПоДокументуЕстьИстория(Объект.Ссылка) Тогда 
		// гкс- [разработка 2021] Куст 05.05.2021
		Возврат Неопределено;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
		
	ПодрИсп = Справочники.СтруктураПредприятия.ПустаяСсылка();
	Для Каждого СтрокаТаблицы Из Объект.ИсполнителиПоРемонтам Цикл
		Если ТипЗнч(СтрокаТаблицы.Исполнитель) = Тип("СправочникСсылка.СтруктураПредприятия") Тогда 
			ПодрИсп = СтрокаТаблицы.Исполнитель;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат торо_РаботаССогласованиями.гкс_ПолучитьСпособСогласованияПоУмолчанию(
		Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_НарядНаВыполнениеРемонтныхРабот,
		Орг, Выборка.Подразделение, ПодрИсп);
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
&ИзменениеИКонтроль("СпособСогласованияПриИзменении")
Процедура Расш_гкс_СпособСогласованияПриИзменении(Элемент)
	Если фПослеОчистки = Ложь Тогда
		ОбновитьДеревоСогласующих(Истина);
		#Удаление
		торо_РаботаССогласованиямиКлиентСервер.ДобавитьСтрокуВИсториюСтатусов(ЭтаФорма, СтатусДокументаРегистр,, Истина);
		#КонецУдаления
		#Вставка
		торо_РаботаССогласованиямиКлиентСервер.ДобавитьСтрокуВИсториюСтатусов(ЭтаФорма, СтатусДокументаРегистр,,);
		#КонецВставки
	Иначе
		фПослеОчистки = Ложь;
	КонецЕсли;

	УправлениеВидимостью(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура гкс_СпособВыполненияДеревоПриИзменении(Элемент)
	ТекСтрока = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	
	ID = ТекСтрока.ID;
	МассивСтрТЧ = Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("ID", ID));
	
	Если МассивСтрТЧ.Количество() Тогда
		СтрТЧ = МассивСтрТЧ[0];
		СтрТЧ.гкс_СпособВыполнения = ТекСтрока.гкс_СпособВыполнения;
	Иначе
		ТекСтрока.гкс_СпособВыполнения = Неопределено;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ВкладкаМероприятия

&НаКлиенте
Процедура гкс_МПОБВоВремяОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Не ВыбранноеЗначение = Неопределено Тогда 
		Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда 
			Для Каждого СтрокаМассива Из ВыбранноеЗначение Цикл
				НоваяСтрока = Объект.гкс_МПОБВоВремя.Добавить();
				НоваяСтрока.Мероприятие = ПолучитьТекстМероприятия(СтрокаМассива);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура дс_МПОБДоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Не ВыбранноеЗначение = Неопределено Тогда 
		Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда 
			Для Каждого СтрокаМассива Из ВыбранноеЗначение Цикл
				НоваяСтрока = Объект.гкс_МПОБДо.Добавить();
				НоваяСтрока.Мероприятие = ПолучитьТекстМероприятия(СтрокаМассива);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекстМероприятия(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Спр.Описание КАК Описание
		|ИЗ
		|	Справочник.гкс_МероприятияПоОбеспечениюБезопасности КАК Спр
		|ГДЕ
		|	Спр.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Описание;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура гкс_МЛевоПодбор(Команда)
	ПараметрыФормыВыбора = Новый Структура();
	ПараметрыФормыВыбора.Вставить("РежимВыбора",        Истина);
	ПараметрыФормыВыбора.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыФормыВыбора.Вставить("МножественныйВыбор", Истина);
	ОткрытьФорму("Справочник.гкс_МероприятияПоОбеспечениюБезопасности.ФормаВыбора", ПараметрыФормыВыбора, Элементы["гкс_МПОБДо"]);
КонецПроцедуры

&НаКлиенте
Процедура гкс_МПравоПодбор(Команда)
	ПараметрыФормыВыбора = Новый Структура();
	ПараметрыФормыВыбора.Вставить("РежимВыбора",        Истина);
	ПараметрыФормыВыбора.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыФормыВыбора.Вставить("МножественныйВыбор", Истина);
	ОткрытьФорму("Справочник.гкс_МероприятияПоОбеспечениюБезопасности.ФормаВыбора", ПараметрыФормыВыбора, Элементы["гкс_МПОБВоВремя"]);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура дс_ОтправитьНаСогласование(Команда)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Параметры1 = Новый Структура("дс_Выполнить", Истина);
		Параметры2 = Новый Структура();
		
		гкс_ОбщегоНазначенияСервер.ОтправитьНаСогласованиеНаСервере(Параметры1, Параметры2);
		Если Параметры1.дс_Выполнить Тогда 
			Параметры2.Вставить("Форма", ЭтаФорма);
			торо_РаботаССогласованиямиКлиент.ВыбратьСтатусЗавершение(Параметры1, Параметры2);
			дс_ИзменитьВидимостьКнопкиОтправкиНаСогласование();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ДобавитьТехКарту")
Процедура Расш_гкс_ДобавитьТехКарту(Команда)

	ТекущиеДанные = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("es='¡Indiquen la disposición de la reparación!';ru='Укажите расположение ремонта!';en='Specify  the location of the repair!'"), 10); 
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ТекущиеДанные.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("es='¡La reparación no es posible incluir en la composición de la operación tecnológica!';ru='Ремонт нельзя включать в состав технологической операции!';en='Repair can not be included in the technological operation!'"), 10); 
		Возврат;
	КонецЕсли;

	#Удаление
	ФормаВыбора = ПолучитьФорму("Справочник.торо_ИдентификаторыТехКарт.ФормаВыбора", Новый Структура("ОтборПоСтатусам, МножественныйВыбор", ПредопределенноеЗначение("Перечисление.торо_СтатусыНормативныхРемонтовИТехКарт.Действует"), Истина), Элементы.ДеревоРемонтныхРабот);
	#КонецУдаления
	#Вставка
	ПараметрыФормы = Новый Структура("ОтборПоСтатусам, МножественныйВыбор",
		ПредопределенноеЗначение("Перечисление.торо_СтатусыНормативныхРемонтовИТехКарт.Действует"), Истина);
	ТекРемонт = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если Не ТекРемонт = Неопределено Тогда 
		ПараметрыФормы.Вставить("ОтборПоТОРИзОР", ТекРемонт.ОбъектРемонта);
	КонецЕсли;
	ФормаВыбора = ПолучитьФорму("Справочник.торо_ИдентификаторыТехКарт.ФормаВыбора", ПараметрыФормы,
		Элементы.ДеревоРемонтныхРабот);
	#КонецВставки
	ФормаВыбора.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура гкс_УстановитьПКоэф(Команда)
	ТекДанные = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если не ТекДанные = Неопределено Тогда 
		МассивПередачи = Новый Массив();
		Для Каждого СтрокаТаблицы Из Объект.РемонтныеРаботы Цикл
			Если ТекДанные.ID = СтрокаТаблицы.РемонтыОборудования_ID Тогда 
				МассивПередачи.Добавить(Новый Структура("ИД,гкс_ПовКоэф,РемонтнаяРабота"
					, СтрокаТаблицы.ID, СтрокаТаблицы.гкс_ПовКоэф, СтрокаТаблицы.РемонтнаяРабота));
			КонецЕсли;
		КонецЦикла;
		ОписаниеОп = Новый ОписаниеОповещения("гкс_УстановитьПКоэфОбработкаВыбора",
			ЭтотОбъект, Новый Структура("ИдРемонта", ТекДанные.ID) );
			ОткрытьФорму("Справочник.гкс_ПКоэффициентыРабот.Форма.ПодборПКоэфВСписок", Новый Структура("Строки", МассивПередачи), ЭтотОбъект,,,, 
				ОписаниеОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

// гкс+ [12.22] Деснол 12.12.2022
&НаКлиенте
Процедура ЗаполнитьДатыРаботПоРемонту(Команда)
	ТекДанныеРемонта = Элементы.РемонтыОборудования.ТекущиеДанные;
	
	Если Не ТекДанныеРемонта = Неопределено Тогда
		ИмяПоляДляОтбора = "РемонтыОборудования_ID";
		
		Если Элементы.СтраницыИсполнителей.ТекущаяСтраница = Элементы.СтраницаПодрядчики Тогда
			ИмяТЧ = "ИсполнителиПоРемонтам";
			ИмяТЧДляПользователя = "Исполнители по ремонтам";
		Иначе
		    ИмяТЧ = "Исполнители";
			ИмяТЧДляПользователя = "Трудовые затраты";
		КонецЕсли; 

		ДополнительныеПараметры = Новый Структура("ИмяТЧ, ИмяПоляДляОтбора, ИмяТЧДляПользователя", ИмяТЧ, ИмяПоляДляОтбора, ИмяТЧДляПользователя) ;
		Если ЕстьЗаполненныеДатыУИсполнителейРемонта(ИмяТЧ, ИмяПоляДляОтбора, ТекДанныеРемонта.ID) Тогда
		    ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьДатыРаботПоРемонтуЗавершение", ЭтотОбъект, ДополнительныеПараметры), НСтр("es='Las fechas son rellenadas ya. ¿Перезаполнить de ellos?';ru='Даты уже заполнены. Перезаполнить их?';en='Dates are already filled. Refill them?'"), РежимДиалогаВопрос.ДаНет);
		Иначе
		    ЗаполнитьДатыРаботПоРемонтуЗавершение(КодВозвратаДиалога.Да, ДополнительныеПараметры);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры // гкс- [12.22] Деснол 12.12.2022

// гкс+ [12.22] Деснол 12.12.2022
&НаКлиенте
Процедура ЗаполнитьВремяРаботыПоНормативам(Команда)
	ЗаполнитьВремяРаботыПоНормативамНаСервере();
КонецПроцедуры // гкс- [12.22] Деснол 12.12.2022

// гкс+ [12.22] Деснол 12.12.2022
&НаКлиенте
Процедура ЗаполнитьВремяРаботыПоДлительностиСУчетомГрафика(Команда)
	ЗаполнитьВремяРаботыПоДлительностиСУчетомГрафикаНаСервере();
КонецПроцедуры // гкс- [12.22] Деснол 12.12.2022


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// гкс+ [12.22] Деснол 12.12.2022
&НаКлиенте
Функция ЕстьЗаполненныеДатыУИсполнителейРемонта(ИмяТЧ, ИмяПоляДляОтбора, ID)
	ОтборСтрок = Объект[ИмяТЧ].НайтиСтроки(Новый Структура(ИмяПоляДляОтбора, ID));
	Для каждого Исполнитель Из ОтборСтрок Цикл
	    Если Не Исполнитель.ДатаНачала = Дата("00010101") ИЛИ Не Исполнитель.ДатаОкончания = Дата("00010101") Тогда
		    Возврат Истина;
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат Ложь;
КонецФункции
 

&НаКлиенте
Процедура ЗаполнитьДатыРаботПоРемонтуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	ТекДанныеРемонта = Элементы.РемонтыОборудования.ТекущиеДанные; 
	ИмяТЧ = ДополнительныеПараметры.ИмяТЧ;
	ИмяПоляДляОтбора = ДополнительныеПараметры.ИмяПоляДляОтбора;
	ИмяТЧДляПользователя = ДополнительныеПараметры.ИмяТЧДляПользователя;
	
	ОтборСтрок = Объект[ИмяТЧ].НайтиСтроки(Новый Структура(ИмяПоляДляОтбора, ТекДанныеРемонта.ID));
	Если ОтборСтрок.Количество() = 0 Тогда
	    Возврат;
	КонецЕсли; 
	
	СообщениеПользователю = "В табличной части """ + ИмяТЧДляПользователя + """ в строке ";
	
	Для каждого Исполнитель Из ОтборСтрок Цикл
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			ДатаНачалаДляЗаполнения = ТекДанныеРемонта.ДатаНачала;
			ДатаОкончанияДляЗаполнения = ТекДанныеРемонта.ДатаОкончания;
		Иначе
			ДатаНачалаДляЗаполнения = ?(Исполнитель.ДатаНачала = Дата("00010101"), ТекДанныеРемонта.ДатаНачала, Исполнитель.ДатаНачала);
			ДатаОкончанияДляЗаполнения = ?(Исполнитель.ДатаОкончания = Дата("00010101"), ТекДанныеРемонта.ДатаОкончания, Исполнитель.ДатаОкончания);
		КонецЕсли; 
		
		Если ДатаНачалаДляЗаполнения > ДатаОкончанияДляЗаполнения Тогда
			Если Исполнитель.ДатаНачала = Дата("00010101") Тогда
				ТекстСообщения = НСтр("ru = '" + СообщениеПользователю + Исполнитель.НомерСтроки + " не заполнена дата начала (дата окончания не должна быть меньше даты начала)'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			КонецЕсли; 
			Если Исполнитель.ДатаОкончания = Дата("00010101") Тогда
				ТекстСообщения = НСтр("ru = '" + СообщениеПользователю + Исполнитель.НомерСтроки + " не заполнена дата окончания (дата окончания не должна быть меньше даты начала)'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			КонецЕсли; 
		    Продолжить;
		КонецЕсли; 
		
		Исполнитель.ДатаНачала = ДатаНачалаДляЗаполнения;
		Исполнитель.ДатаОкончания = ДатаОкончанияДляЗаполнения;
		Если Элементы.СтраницыИсполнителей.ТекущаяСтраница = Элементы.СтраницаХозспособ Тогда
		    Исполнитель.гкс_ВремяРаботы = Исполнитель.ДатаОкончания - Исполнитель.ДатаНачала;
			Исполнитель.гкс_ВремяРаботыТекст = СформироватьПродолжительность(Исполнитель.гкс_ВремяРаботы);
		КонецЕсли;
	КонецЦикла; 
КонецПроцедуры
// гкс- [12.22] Деснол 12.12.2022

// гкс+ [12.22] Деснол 12.12.2022
&НаСервере
Процедура ЗаполнитьВремяРаботыПоНормативамНаСервере()
	
	торо_Ремонты.ЗаполнитьвремяРаботыПоНормативам(ЭтаФорма, "Исполнители");
	
	Для каждого Строка Из Объект.Исполнители Цикл
		Строка.гкс_ВремяРаботы = Строка.ВремяРаботы;
		Строка.гкс_ВремяРаботыТекст = СформироватьПродолжительность(Строка.гкс_ВремяРаботы);
	КонецЦикла;
	
КонецПроцедуры // гкс- [12.22] Деснол 12.12.2022                       

// гкс+ [12.22] Деснол 12.12.2022
&НаСервере
Процедура ЗаполнитьВремяРаботыПоДлительностиСУчетомГрафикаНаСервере()
	
	ТаблицаСотрудников = Объект.Исполнители.Выгрузить(,"Сотрудник, ДатаНачала, ДатаОкончания");	

	ТабВремениРаботыСотрудников = РассчитатьРабочееВремяСотрудникаПоТаблице(ТаблицаСотрудников);	
	
	Для каждого Строка Из Объект.Исполнители Цикл
		
		МассивРабВремениСотрудников = ТабВремениРаботыСотрудников.НайтиСтроки(Новый Структура("Сотрудник, ДатаНачала, ДатаОкончания", Строка.Сотрудник, Строка.ДатаНачала, Строка.ДатаОкончания));
		ВремяПоГрафику = ?(МассивРабВремениСотрудников.Количество(), МассивРабВремениСотрудников[0], Неопределено);

		Если ВремяПоГрафику <> Неопределено Тогда
			Строка.гкс_ВремяРаботы = ВремяПоГрафику.гкс_ВремяРаботы;
		Иначе
			Строка.гкс_ВремяРаботы = 0;
		КонецЕсли;

		Строка.гкс_ВремяРаботыТекст = СформироватьПродолжительность(Строка.гкс_ВремяРаботы);
		
	КонецЦикла;
	
КонецПроцедуры // гкс- [12.22] Деснол 12.12.2022

// гкс+ [12.22] Деснол 12.12.2022
&НаСервереБезКонтекста
Функция РассчитатьРабочееВремяСотрудникаПоТаблице(ТаблицаПериодов)
	
	Если ТаблицаПериодов.Количество() = 0 Тогда
		ТаблицаПериодов.Колонки.Добавить("ВремяРаботы", Новый ОписаниеТипов("Число"));
		Возврат ТаблицаПериодов;
	КонецЕсли;
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	ЗапросГрафиков = Новый Запрос;
	ЗапросГрафиков.МенеджерВременныхТаблиц = МенеджерВТ;
	ЗапросГрафиков.Текст = 
	"ВЫБРАТЬ
	|	ВТ_ИсходныеДанные.Сотрудник,
	|	ВТ_ИсходныеДанные.ДатаНачала,
	|	ВТ_ИсходныеДанные.ДатаОкончания
	|ПОМЕСТИТЬ ВТ_ИсходныеДанные
	|ИЗ
	|	&ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикРаботыСотрудников.Период КАК Период,
	|	ГрафикРаботыСотрудников.Сотрудник КАК Сотрудник,
	|	ГрафикРаботыСотрудников.ГрафикРаботы,
	|	ГрафикРаботыСотрудников.ДействуетДо
	|ПОМЕСТИТЬ ВТ_ГрафикиРаботыСотрудников
	|ИЗ
	|	РегистрСведений.ГрафикРаботыСотрудников КАК ГрафикРаботыСотрудников
	|ГДЕ
	|	ГрафикРаботыСотрудников.Сотрудник В
	|			(ВЫБРАТЬ
	|				ВТ_ИсходныеДанные.Сотрудник
	|			ИЗ
	|				ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИсходныеДанные.Сотрудник КАК Сотрудник,
	|	МАКСИМУМ(ВТ_ГрафикиРаботыСотрудников.Период) КАК ПериодГрафика,
	|	ВТ_ИсходныеДанные.ДатаНачала,
	|	ВТ_ИсходныеДанные.ДатаОкончания
	|ПОМЕСТИТЬ ВТ_ПериодыГрафиковНаНачалоРемонта
	|ИЗ
	|	ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ГрафикиРаботыСотрудников КАК ВТ_ГрафикиРаботыСотрудников
	|		ПО ВТ_ИсходныеДанные.Сотрудник = ВТ_ГрафикиРаботыСотрудников.Сотрудник
	|			И ВТ_ИсходныеДанные.ДатаНачала >= ВТ_ГрафикиРаботыСотрудников.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ИсходныеДанные.Сотрудник,
	|	ВТ_ИсходныеДанные.ДатаНачала,
	|	ВТ_ИсходныеДанные.ДатаОкончания
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	ПериодГрафика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПериодыГрафиковНаНачалоРемонта.Сотрудник,
	|	ВТ_ПериодыГрафиковНаНачалоРемонта.ДатаНачала,
	|	ВТ_ПериодыГрафиковНаНачалоРемонта.ДатаОкончания,
	|	ВТ_ГрафикиРаботыСотрудников.ГрафикРаботы КАК ГрафикРаботы,
	|	ВТ_ПериодыГрафиковНаНачалоРемонта.ДатаНачала КАК НачалоИнтервала,
	|	ВЫБОР
	|		КОГДА ВТ_ГрафикиРаботыСотрудников.ДействуетДо = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ ВТ_ГрафикиРаботыСотрудников.ДействуетДо > ВТ_ПериодыГрафиковНаНачалоРемонта.ДатаОкончания
	|			ТОГДА ВТ_ПериодыГрафиковНаНачалоРемонта.ДатаОкончания
	|		ИНАЧЕ ВТ_ГрафикиРаботыСотрудников.ДействуетДо
	|	КОНЕЦ КАК КонецИнтервала
	|ПОМЕСТИТЬ ВТ_ПериодыДействияГрафиков
	|ИЗ
	|	ВТ_ПериодыГрафиковНаНачалоРемонта КАК ВТ_ПериодыГрафиковНаНачалоРемонта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ГрафикиРаботыСотрудников КАК ВТ_ГрафикиРаботыСотрудников
	|		ПО ВТ_ПериодыГрафиковНаНачалоРемонта.Сотрудник = ВТ_ГрафикиРаботыСотрудников.Сотрудник
	|			И ВТ_ПериодыГрафиковНаНачалоРемонта.ПериодГрафика = ВТ_ГрафикиРаботыСотрудников.Период
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ИсходныеДанные.Сотрудник,
	|	ВТ_ИсходныеДанные.ДатаНачала,
	|	ВТ_ИсходныеДанные.ДатаОкончания,
	|	ВТ_ГрафикиРаботыСотрудников.ГрафикРаботы,
	|	ВТ_ГрафикиРаботыСотрудников.Период,
	|	ВЫБОР
	|		КОГДА ВТ_ГрафикиРаботыСотрудников.ДействуетДо = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ ВТ_ГрафикиРаботыСотрудников.ДействуетДо > ВТ_ИсходныеДанные.ДатаОкончания
	|			ТОГДА ВТ_ИсходныеДанные.ДатаОкончания
	|		ИНАЧЕ ВТ_ГрафикиРаботыСотрудников.ДействуетДо
	|	КОНЕЦ
	|ИЗ
	|	ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ГрафикиРаботыСотрудников КАК ВТ_ГрафикиРаботыСотрудников
	|		ПО ВТ_ИсходныеДанные.Сотрудник = ВТ_ГрафикиРаботыСотрудников.Сотрудник
	|			И (ВТ_ГрафикиРаботыСотрудников.Период > ВТ_ИсходныеДанные.ДатаНачала)
	|			И (ВТ_ГрафикиРаботыСотрудников.Период < ВТ_ИсходныеДанные.ДатаОкончания)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ГрафикРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПериодыДействияГрафиков.Сотрудник,
	|	ВТ_ПериодыДействияГрафиков.ДатаНачала,
	|	ВТ_ПериодыДействияГрафиков.ДатаОкончания,
	|	ВТ_ПериодыДействияГрафиков.ГрафикРаботы,
	|	ВТ_ПериодыДействияГрафиков.НачалоИнтервала,
	|	ВТ_ПериодыДействияГрафиков.КонецИнтервала
	|ИЗ
	|	ВТ_ПериодыДействияГрафиков КАК ВТ_ПериодыДействияГрафиков";
	
	ЗапросГрафиков.УстановитьПараметр("ВТ_ИсходныеДанные", ТаблицаПериодов);
	
	ТабГрафиков = ЗапросГрафиков.Выполнить().Выгрузить();
	МассивГрафиков = ТабГрафиков.ВыгрузитьКолонку("ГрафикРаботы");
	
	МинДата = ТаблицаПериодов[0].ДатаНачала;
	МаксДата = ТаблицаПериодов[0].ДатаОкончания;
	
	Для каждого Строка из ТаблицаПериодов Цикл
		Если Строка.ДатаНачала < МинДата Или Не ЗначениеЗаполнено(МинДата) Тогда
			МинДата = Строка.ДатаНачала;
		КонецЕсли;
		Если Строка.ДатаОкончания > МаксДата Тогда
			МаксДата = Строка.ДатаОкончания;
		КонецЕсли;
	КонецЦикла;
	
	МинДата = НачалоДня(МинДата);
    МаксДата = КонецДня(МаксДата);
	
	КалендарныеГрафики.СоздатьВТРасписанияРаботыНаПериод(МенеджерВТ, МассивГрафиков, МинДата, МаксДата);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВТ_ПериодыДействияГрафиков.Сотрудник,
	|	ВТ_ПериодыДействияГрафиков.ДатаНачала,
	|	ВТ_ПериодыДействияГрафиков.ДатаОкончания,
	|	ВТ_ПериодыДействияГрафиков.ГрафикРаботы,
	|	ВТ_ПериодыДействияГрафиков.НачалоИнтервала,
	|	ВТ_ПериодыДействияГрафиков.КонецИнтервала,
	|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ВТ_ПериодыДействияГрафиков.НачалоИнтервала, ДЕНЬ), ВТ_ПериодыДействияГрафиков.НачалоИнтервала, СЕКУНДА) КАК НачалоИнтервалаСек,
	|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ВТ_ПериодыДействияГрафиков.КонецИнтервала, ДЕНЬ), ВТ_ПериодыДействияГрафиков.КонецИнтервала, СЕКУНДА) КАК КонецИнтервалаСек,
	|	ВТРасписанияРаботы.ДатаГрафика,
	|	РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), ВТРасписанияРаботы.ВремяНачала, СЕКУНДА) КАК ВремяНачалаСек,
	|	РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), ВТРасписанияРаботы.ВремяОкончания, СЕКУНДА) КАК ВремяОкончанияСек
	|ПОМЕСТИТЬ ВТ_ПериодыДействияГрафиковПоДням
	|ИЗ
	|	ВТ_ПериодыДействияГрафиков КАК ВТ_ПериодыДействияГрафиков
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРасписанияРаботы КАК ВТРасписанияРаботы
	|		ПО ВТ_ПериодыДействияГрафиков.ГрафикРаботы = ВТРасписанияРаботы.ГрафикРаботы
	|			И (ВТРасписанияРаботы.ДатаГрафика МЕЖДУ НАЧАЛОПЕРИОДА(ВТ_ПериодыДействияГрафиков.НачалоИнтервала, ДЕНЬ) И КОНЕЦПЕРИОДА(ВТ_ПериодыДействияГрафиков.КонецИнтервала, ДЕНЬ))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПериодыДействияГрафиковПоДням.Сотрудник,
	|	ВТ_ПериодыДействияГрафиковПоДням.ДатаНачала,
	|	ВТ_ПериодыДействияГрафиковПоДням.ДатаОкончания,
	|	ВТ_ПериодыДействияГрафиковПоДням.ГрафикРаботы,
	|	ВТ_ПериодыДействияГрафиковПоДням.НачалоИнтервала,
	|	ВТ_ПериодыДействияГрафиковПоДням.КонецИнтервала,
	|	ВТ_ПериодыДействияГрафиковПоДням.ДатаГрафика,
	|	ВЫБОР
	|		КОГДА ВТ_ПериодыДействияГрафиковПоДням.ДатаГрафика = НАЧАЛОПЕРИОДА(ВТ_ПериодыДействияГрафиковПоДням.НачалоИнтервала, ДЕНЬ)
	|				И ВТ_ПериодыДействияГрафиковПоДням.НачалоИнтервалаСек > ВТ_ПериодыДействияГрафиковПоДням.ВремяНачалаСек
	|			ТОГДА ВТ_ПериодыДействияГрафиковПоДням.НачалоИнтервалаСек
	|		КОГДА ВТ_ПериодыДействияГрафиковПоДням.ДатаГрафика = НАЧАЛОПЕРИОДА(ВТ_ПериодыДействияГрафиковПоДням.КонецИнтервала, ДЕНЬ)
	|			И ВТ_ПериодыДействияГрафиковПоДням.КонецИнтервалаСек < ВТ_ПериодыДействияГрафиковПоДням.ВремяНачалаСек
	|			ТОГДА ВТ_ПериодыДействияГрафиковПоДням.КонецИнтервалаСек
	|		ИНАЧЕ ВТ_ПериодыДействияГрафиковПоДням.ВремяНачалаСек
	|	КОНЕЦ КАК ВремяНачалаСек,
	|	ВЫБОР
	|		КОГДА ВТ_ПериодыДействияГрафиковПоДням.ДатаГрафика = НАЧАЛОПЕРИОДА(ВТ_ПериодыДействияГрафиковПоДням.КонецИнтервала, ДЕНЬ)
	|				И ВТ_ПериодыДействияГрафиковПоДням.КонецИнтервалаСек < ВТ_ПериодыДействияГрафиковПоДням.ВремяОкончанияСек
	|			ТОГДА ВТ_ПериодыДействияГрафиковПоДням.КонецИнтервалаСек
	|		КОГДА ВТ_ПериодыДействияГрафиковПоДням.ДатаГрафика = НАЧАЛОПЕРИОДА(ВТ_ПериодыДействияГрафиковПоДням.НачалоИнтервала, ДЕНЬ)
	|				И ВТ_ПериодыДействияГрафиковПоДням.НачалоИнтервалаСек > ВТ_ПериодыДействияГрафиковПоДням.ВремяОкончанияСек
	|			ТОГДА ВТ_ПериодыДействияГрафиковПоДням.НачалоИнтервалаСек
	|		ИНАЧЕ ВТ_ПериодыДействияГрафиковПоДням.ВремяОкончанияСек
	|	КОНЕЦ КАК ВремяОкончанияСек
	|ПОМЕСТИТЬ ВТ_ПериодыДействияГрафиковПоДням2
	|ИЗ
	|	ВТ_ПериодыДействияГрафиковПоДням КАК ВТ_ПериодыДействияГрафиковПоДням
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПериодыДействияГрафиковПоДням2.Сотрудник,
	|	ВТ_ПериодыДействияГрафиковПоДням2.ДатаНачала,
	|	ВТ_ПериодыДействияГрафиковПоДням2.ДатаОкончания,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_ПериодыДействияГрафиковПоДням2.ВремяОкончанияСек = 86399
	|				ТОГДА 86400
	|			ИНАЧЕ ВТ_ПериодыДействияГрафиковПоДням2.ВремяОкончанияСек
	|		КОНЕЦ - ВТ_ПериодыДействияГрафиковПоДням2.ВремяНачалаСек) КАК ВремяРаботы
	|ИЗ
	|	ВТ_ПериодыДействияГрафиковПоДням2 КАК ВТ_ПериодыДействияГрафиковПоДням2
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПериодыДействияГрафиковПоДням2.Сотрудник,
	|	ВТ_ПериодыДействияГрафиковПоДням2.ДатаНачала,
	|	ВТ_ПериодыДействияГрафиковПоДням2.ДатаОкончания";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции // гкс- [12.22] Деснол 12.12.2022

// гкс+ [12.22] Деснол 12.12.2022
&НаКлиентеНаСервереБезКонтекста
Функция СформироватьПродолжительность(ПродолжительностьВСекундах)
	
	Если ПродолжительностьВСекундах = 0 Тогда
		
		Возврат "Ввести продолжительность";
		
	Иначе
		
		Часы    = Цел(ПродолжительностьВСекундах / 3600);
		Минуты  = Цел((ПродолжительностьВСекундах - 3600 * Часы) / 60);
		Секунды = ПродолжительностьВСекундах - 3600 * Часы - Минуты * 60;
		
		Возврат "" + Часы + " ч. " + Минуты + " мин. " + Секунды + " с.";
		
	КонецЕсли;
	
КонецФункции // гкс- [12.22] Деснол 12.12.2022

// гкс+ [Релиз16] Деснол
&НаКлиенте
Процедура гкс_ВыбратьИсполнителя()
	МассРемонты = Новый Массив();
	МассИсполнители = Новый Массив();
	Для Каждого СтрокаТаблицы Из Объект.РемонтыОборудования Цикл
		ВременныйМассив = Новый Массив();
		Для Каждого СтрокаИсполнитель Из Объект.ИсполнителиПоРемонтам Цикл
			Если СтрокаИсполнитель.РемонтыОборудования_ID = СтрокаТаблицы.ID Тогда
				ВременныйМассив.Добавить(Новый Структура("ИД_Ремонта,Исполнитель",
				СтрокаИсполнитель.РемонтыОборудования_ID, СтрокаИсполнитель.Исполнитель));
			КонецЕсли;
		КонецЦикла;
		Если ВременныйМассив.Количество() > 1 Тогда
			Для Каждого СтрокаМассива Из ВременныйМассив Цикл
				МассИсполнители.Добавить(СтрокаМассива);
			КонецЦикла;
			МассРемонты.Добавить(Новый Структура("ИД_Ремонта,ОР,ВР",
			СтрокаТаблицы.ID, СтрокаТаблицы.ОбъектРемонта, СтрокаТаблицы.ВидРемонтныхРабот));
		КонецЕсли;
	КонецЦикла;
	Если МассРемонты.Количество() Тогда 
		ОписаниеОповещенияПослеВыбора = Новый ОписаниеОповещения("гкс_ПослеВыбораИсполнителяОбработать",
			ЭтотОбъект, МассРемонты);
		ОткрытьФорму("Документ.торо_НарядНаВыполнениеРемонтныхРабот.Форма.гкс_ФормаВыбораИсполнителя",
			Новый Структура("Ремонты,Исполнители", МассРемонты, МассИсполнители), ЭтотОбъект, , , , 
			ОписаниеОповещенияПослеВыбора,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура  гкс_ПослеВыбораИсполнителяОбработать(Результат, ДопПараметры)Экспорт
	Если Результат = Неопределено Тогда 
		МассивТЧ = Новый Массив();
		МассивТЧ.Добавить("РемонтныеРаботы");
		МассивТЧ.Добавить("ИсполнителиПоРемонтам");
		МассивТЧ.Добавить("Исполнители");
		Для Каждого СтрокаРемонта Из ДопПараметры Цикл
			Для Каждого ИмяТЧ Из МассивТЧ Цикл
				МассУдаления = Новый Массив();
				Для Каждого СтрокаТЧ Из Объект[ИмяТЧ] Цикл
					Если СтрокаТЧ.РемонтыОборудования_ID = СтрокаРемонта.ИД_Ремонта Тогда
						МассУдаления.Добавить(СтрокаТЧ);
					КонецЕсли;
				КонецЦикла;
				Для Каждого СтрУдаления Из МассУдаления Цикл
					Объект[ИмяТЧ].Удалить(СтрУдаления);
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		МассУдаления = Новый Массив();
		Для Каждого СтрокаТЧ Из Объект.РемонтыОборудования Цикл
			Если СтрокаТЧ.ID = СтрокаРемонта.ИД_Ремонта Тогда
				МассУдаления.Добавить(СтрокаТЧ);
			КонецЕсли;
		КонецЦикла;
		Для Каждого СтрУдаления Из МассУдаления Цикл
			Объект.РемонтыОборудования.Удалить(СтрУдаления);
		КонецЦикла;
	Иначе
		гкс_УдалитьИсполнителейНаСервере(Результат);
	КонецЕсли;
	РемонтыОборудованияПриАктивизацииСтроки(Неопределено);
	гкс_ИсполнителиПоРемонтамИсполнительПриИзмененииПосле(Неопределено);
КонецПроцедуры
// гкс- [Релиз16]

// гкс+ [Релиз16] Деснол
&НаСервере
Процедура гкс_УдалитьИсполнителейНаСервере(Результат)
	Для Каждого СтрокаРемонта Из Результат Цикл
		МассУдаления = Новый Массив();
		Для Каждого СтрокаТЧ Из Объект.ИсполнителиПоРемонтам Цикл
			Если СтрокаТЧ.РемонтыОборудования_ID = СтрокаРемонта.ИД_Ремонта
				И Не СтрокаТЧ.Исполнитель = СтрокаРемонта.Исполнитель Тогда
				МассУдаления.Добавить(СтрокаТЧ);
			КонецЕсли;
		КонецЦикла;
		Для Каждого СтрУдаления Из МассУдаления Цикл
			Объект.ИсполнителиПоРемонтам.Удалить(СтрУдаления);
		КонецЦикла;
		//
		ИДУдаления = Новый Массив();
		МассУдаления = Новый Массив();
		Для Каждого СтрокаТЧ Из Объект.РемонтныеРаботы Цикл
			Если СтрокаТЧ.РемонтыОборудования_ID = СтрокаРемонта.ИД_Ремонта
				И Не СтрокаТЧ.Исполнитель = СтрокаРемонта.Исполнитель
				И ЗначениеЗаполнено(СтрокаТЧ.Исполнитель)
				И ТипЗнч(СтрокаТЧ.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации")
				Тогда
				МассУдаления.Добавить(СтрокаТЧ);
				ИДУдаления.Добавить(СтрокаТЧ.ID);
			КонецЕсли;
		КонецЦикла;
		Для Каждого СтрокаТЧ Из Объект.РемонтныеРаботы Цикл
			Если СтрокаТЧ.РемонтыОборудования_ID = СтрокаРемонта.ИД_Ремонта
				И Не СтрокаТЧ.Исполнитель = СтрокаРемонта.Исполнитель
				И ТипЗнч(СтрокаТЧ.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт")
				Тогда
				НеУдаляем = Ложь;
				Для Каждого СтрокаТО Из Объект.РемонтныеРаботы Цикл
					Если СтрокаТО.Родитель_ID = СтрокаТЧ.ID 
						И СтрокаТО.РемонтыОборудования_ID = СтрокаРемонта.ИД_Ремонта
						И МассУдаления.Найти(СтрокаТО) = Неопределено Тогда 
						НеУдаляем = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если Не НеУдаляем Тогда 
					МассУдаления.Добавить(СтрокаТЧ);
					ИДУдаления.Добавить(СтрокаТЧ.ID);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Для Каждого СтрУдаления Из МассУдаления Цикл
			Объект.РемонтныеРаботы.Удалить(СтрУдаления);
		КонецЦикла;
		//
		МассУдаления = Новый Массив();
		Для Каждого СтрокаТЧ Из Объект.Исполнители Цикл
			Если СтрокаТЧ.РемонтыОборудования_ID = СтрокаРемонта.ИД_Ремонта
				И Не ИДУдаления.Найти(СтрокаТЧ.ID) = Неопределено Тогда
				МассУдаления.Добавить(СтрокаТЧ);
			КонецЕсли;
		КонецЦикла;
		Для Каждого СтрУдаления Из МассУдаления Цикл
			Объект.Исполнители.Удалить(СтрУдаления);
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура гкс_УдалитьИспользованныеТО()
	ИДРемонта = Новый Массив();
	Для Каждого СтрокаТаблицы ИЗ Объект.РемонтыОборудования Цикл
		ИДРемонта.Добавить(СтрокаТаблицы.ID);
	КонецЦикла;
	//
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.ID КАК ID,
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.Родитель_ID КАК Родитель_ID,
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.РемонтнаяРабота КАК РемонтнаяРабота
		|ИЗ
		|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтныеРаботы КАК торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы
		|ГДЕ
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.РемонтыОборудования_ID В (&ИДРемонта)
		|	И торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.Ссылка.Проведен = Истина
		|ИТОГИ ПО
		|	РемонтыОборудования_ID";
	
	Запрос.УстановитьПараметр("ИДРемонта", ИДРемонта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаРемонт = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаРемонт.Следующий() Цикл
		ИДУдаления = Новый Массив();
		МассУдаления = Новый Массив();
		Выборка = ВыборкаРемонт.Выбрать();
		Для Каждого СтрокаТаблицы Из Объект.РемонтныеРаботы Цикл
			Если СтрокаТаблицы.РемонтыОборудования_ID = ВыборкаРемонт.РемонтыОборудования_ID 
				И ТипЗнч(СтрокаТаблицы.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации")
				Тогда 
				Выборка.Сбросить();
				Если Выборка.НайтиСледующий(Новый Структура("Родитель_ID,ID,РемонтнаяРабота", 
					СтрокаТаблицы.Родитель_ID, СтрокаТаблицы.ID, СтрокаТаблицы.РемонтнаяРабота)) Тогда 
					МассУдаления.Добавить(СтрокаТаблицы);
					ИДУдаления.Добавить(СтрокаТаблицы.ID);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Для Каждого СтрокаТЧ Из Объект.РемонтныеРаботы Цикл
			Если СтрокаТЧ.РемонтыОборудования_ID = ВыборкаРемонт.РемонтыОборудования_ID
				И ТипЗнч(СтрокаТЧ.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт")
				Тогда
				НеУдаляем = Ложь;
				Для Каждого СтрокаТО Из Объект.РемонтныеРаботы Цикл
					Если СтрокаТО.Родитель_ID = СтрокаТЧ.ID 
						И СтрокаТО.РемонтыОборудования_ID = ВыборкаРемонт.РемонтыОборудования_ID
						И МассУдаления.Найти(СтрокаТО) = Неопределено Тогда 
						НеУдаляем = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если Не НеУдаляем Тогда 
					МассУдаления.Добавить(СтрокаТЧ);
					ИДУдаления.Добавить(СтрокаТЧ.ID);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого СтрУдаления Из МассУдаления Цикл
			Объект.РемонтныеРаботы.Удалить(СтрУдаления);
		КонецЦикла;
		//
		МассУдаления = Новый Массив();
		Для Каждого СтрокаТЧ Из Объект.Исполнители Цикл
			Если СтрокаТЧ.РемонтыОборудования_ID = ВыборкаРемонт.РемонтыОборудования_ID
				И Не ИДУдаления.Найти(СтрокаТЧ.ID) = Неопределено Тогда
				МассУдаления.Добавить(СтрокаТЧ);
			КонецЕсли;
		КонецЦикла;
		Для Каждого СтрУдаления Из МассУдаления Цикл
			Объект.Исполнители.Удалить(СтрУдаления);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры
// гкс- [Релиз16]

// гкс+ [Категории риска] Куст
&НаКлиенте
Процедура ОбновитьЗаливкуЗаголовка()
	ТекДанные = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если НЕ ТекДанные = Неопределено И ТекДанные.гкс_ЦветКР > 0 Тогда 
		Элементы["гкс_КатегорияРиска"].ЦветФонаЗаголовка = ТекДанные.гкс_КатегорияРискаЦвет;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьНовыеЭлементы()
	СтоСимволов = 100;
	ДвадцатьЧетыреСимвола = 24;
	// гкс+ [Перед записью] Куст 
	// гкс+ [Релиз19] Деснол
	Если Не (РольДоступна("ПолныеПрава") 
		ИЛИ РольДоступна("гкс_РедактированиеЗаявкиНаРемонт")
		ИЛИ РольДоступна("Администрирование")) Тогда 
	// гкс- [Релиз19]
		Элементы.Ответственный.ТолькоПросмотр = Истина;
	КонецЕсли;
	Элементы.ДеревоРемонтныхРаботДобавитьТехОперацию.Видимость = Ложь;
	Элементы.ДеревоРемонтныхРаботПодборОпераций.Видимость = Ложь; // гкс- [Перед записью] 
	МассивРеквизитов = Новый Массив();	
	// гкс+ [разработка 2021] Куст 08.07.2021
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ПовКоэф", 
		Новый ОписаниеТипов("СправочникСсылка.гкс_ПКоэффициентыРабот"), "ДеревоРемонтныхРабот",
		НСтр("ru='Пов.коэф.';en='koef.';es=''")));
	// гкс- [разработка 2021] Куст 08.07.2021
	// гкс+ [Релиз 1] Куст 
	МассивРеквизитов.Добавить(Новый РеквизитФормы(
		"гкс_НарядДопускНомер", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(11)), ,
		НСтр("ru='Номер наряда-допуска';en='Number admission order'")));
	МассивРеквизитов.Добавить(
		Новый РеквизитФормы("гкс_НарядДопускНомерИзменен", Новый ОписаниеТипов("Булево"), , )); // гкс- [Релиз 1] 
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_Примечание", Новый ОписаниеТипов("Строка", , , , 
		Новый КвалификаторыСтроки(СтоСимволов)), "ДеревоРемонтныхРабот"));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_Огневая", Новый ОписаниеТипов("Булево", , , , 
		Новый КвалификаторыСтроки(СтоСимволов)), "ДеревоРемонтныхРабот"));
	// гкс+ [12.22] Деснол 12.12.2022
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ВремяРаботы", Новый ОписаниеТипов("Число", , , 
		Новый КвалификаторыЧисла(11, 4)), "Объект.Исполнители"));
		// гкс- [12.22] Деснол 12.12.2022
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ВремяРаботыТекст", Новый ОписаниеТипов("Строка", , , , 
		Новый КвалификаторыСтроки(ДвадцатьЧетыреСимвола)), "Объект.Исполнители"));
	ТемпМассив = Новый Массив();
	ТемпМассив.Добавить(Тип("СправочникСсылка.Контрагенты"));
	ТемпМассив.Добавить(Тип("СправочникСсылка.СтруктураПредприятия"));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ИсполнительДо", Новый ОписаниеТипов(ТемпМассив)));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_СтатусЧерновик",
		Новый ОписаниеТипов("СправочникСсылка.торо_СтатусыСогласованияДокументовРемонтныхРабот")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_СпособВыполнения", 
		Новый ОписаниеТипов("ПеречислениеСсылка.СпособыСтроительства"), "ДеревоРемонтныхРабот",
		НСтр("ru='Способ выполнения';en='Execution method';es='El modo de la ejecución'")));
	ИзменитьРеквизиты(МассивРеквизитов); 
	// гкс+ [03.23] Деснол 13.03.2023
	Если Не РольДоступна("гкс_РедактированиеЗаявкиНаРемонт") Тогда 
		Элементы.Дата.ТолькоПросмотр = Истина;
	КонецЕсли;
	// гкс- [03.23] Деснол 13.03.2023
	ЭтаФорма["гкс_СтатусЧерновик"] = справочники.торо_СтатусыСогласованияДокументовРемонтныхРабот.Черновик;
	//
	НЭлем = Элементы.Добавить("РемонтныеРаботыгкс_Примечание", Тип("ПолеФормы"), Элементы.ДеревоРемонтныхРабот);
	НЭлем.ПутьКДанным = "ДеревоРемонтныхРабот.гкс_Примечание";
	НЭлем.Заголовок = НСтр("ru='Примечание';en='Note'");
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ТолькоПросмотр = Истина;
	Элементы.Переместить(Элементы["РемонтныеРаботыгкс_Примечание"], Элементы.ДеревоРемонтныхРабот,
			Элементы.ДеревоРемонтныхРаботКоличество);
	// гкс+ [2021] Куст 
	НЭлем = Элементы.Добавить("РемонтныеРаботыгкс_Огневая", Тип("ПолеФормы"), Элементы.ДеревоРемонтныхРабот);
	НЭлем.ПутьКДанным = "ДеревоРемонтныхРабот.гкс_Огневая";
	НЭлем.Заголовок = НСтр("ru='Огневая';en='Fire'");
	НЭлем.Вид = ВидПоляФормы.ПолеФлажка;
	Элементы.Переместить(Элементы["РемонтныеРаботыгкс_Огневая"], Элементы.ДеревоРемонтныхРабот,
			Элементы.ДеревоРемонтныхРаботКоличество); // гкс- [2021]
	//
	НЭлем = Элементы.Добавить("Исполнителигкс_ВремяРаботы", Тип("ПолеФормы"), Элементы.Исполнители);
	НЭлем.ПутьКДанным = "Объект.Исполнители.гкс_ВремяРаботы";
	НЭлем.Заголовок = НСтр("ru='Время работы';en='Working hours'");
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.Видимость = Ложь;
	НЭлем.Доступность = Ложь;
	//
	НЭлем = Элементы.Добавить("Исполнителигкс_ВремяРаботыТекст", Тип("ПолеФормы"), Элементы.Исполнители);
	НЭлем.ПутьКДанным = "Объект.Исполнители.гкс_ВремяРаботыТекст";
	НЭлем.Заголовок = НСтр("ru='Время работы';en='Working hours'");
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.КнопкаВыбора = Истина;
	НЭлем.РедактированиеТекста = Ложь;
	//НЭлем.Видимость = Ложь;
	НЭлем.УстановитьДействие("НачалоВыбора", "Расш_гкс_ИсполнителиВремяРаботыТекстНачалоВыбора");
	НЭлем.УстановитьДействие("ОбработкаВыбора", "Расш_гкс_ИсполнителиВремяРаботыТекстОбработкаВыбора");
	//
	НКом = Команды.Добавить("дс_ОтправитьНаСогласование");
	НКом.Действие = "дс_ОтправитьНаСогласование";
	НКом.Заголовок = НСтр("ru='Отправить на согласование';en='Send for approval'");
	//
	НКноп = Элементы.Добавить("дс_ОтправитьНаСогласование",Тип("КнопкаФормы"),Элементы.ФормаКоманднаяПанель);
	НКноп.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НКноп.ИмяКоманды = "дс_ОтправитьНаСогласование";
	Элементы.Переместить(Элементы["дс_ОтправитьНаСогласование"],Элементы.ФормаКоманднаяПанель,Элементы.ФормаПроведение);
	дс_ИзменитьВидимостьКнопкиОтправкиНаСогласование();
	//
	НЭлем = Элементы.Добавить("Исполнителигкс_Количество", Тип("ПолеФормы"), Элементы.Исполнители);
	НЭлем.ПутьКДанным = "Объект.Исполнители.гкс_Количество";
	НЭлем.Заголовок = НСтр("ru='Количество';en='Count'");
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.Видимость = Ложь;
	//
	// гкс+ [разработка 2021] Куст 08.07.2021
	НовыйЭлемент = Элементы.Вставить("гкс_СотрудникКонтрагента", Тип("ПолеФормы"), Элементы.Исполнители, Элементы.ИсполнителиСотрудник);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Исполнители.гкс_СотрудникКонтрагента";
	НовыйЭлемент.Видимость = Ложь;
	// гкс- [разработка 2021] Куст 08.07.2021
	//
	Элементы.ИсполнителиПоРемонтам.ИзменятьПорядокСтрок = Ложь;
	Элементы.ИсполнителиПоРемонтамПереместить.Видимость = Ложь;
	МодифицироватьИсполнителей();
	//
	// гкс+ [Релиз 1] Куст 10.12.2020
	НЭлем = Элементы.Добавить("гкс_СтраницаМероприятия", Тип("ГруппаФормы"), Элементы.Страницы);
	НЭлем.Вид = ВидГруппыФормы.Страница;
	НЭлем.Заголовок = НСтр("ru='Мероприятия по обеспечению безопасности'");
	//
	НЭлем = Элементы.Добавить("гкс_МОбщая", Тип("ГруппаФормы"), Элементы["гкс_СтраницаМероприятия"]);
	НЭлем.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НЭлем.ОтображатьЗаголовок = Ложь;
	//
	НЭлем = Элементы.Добавить("гкс_МЛево", Тип("ГруппаФормы"), Элементы["гкс_МОбщая"]);
	НЭлем.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НЭлем.группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	НЭлем.Заголовок = НСтр("ru='До начала работ'");
	//
	НЭлем = Элементы.Добавить("гкс_МПраво", Тип("ГруппаФормы"), Элементы["гкс_МОбщая"]);
	НЭлем.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НЭлем.группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	НЭлем.Заголовок = НСтр("ru='Во время работ'");
	//
	НЭлем = Элементы.Добавить("гкс_МПОБДо", Тип("ТаблицаФормы"), Элементы["гкс_МЛево"]);
	НЭлем.ПутьКДанным = "Объект.гкс_МПОБДо";
	НЭлем.УстановитьДействие("ОбработкаВыбора", "дс_МПОБДоОбработкаВыбора");
	//
	НЭлем = Элементы.Добавить("гкс_МПОБДоМероприятие", Тип("ПолеФормы"), Элементы["гкс_МПОБДо"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Объект.гкс_МПОБДо.Мероприятие";
	НЭлем.МногострочныйРежим = Истина;
	//
	НЭлем = Элементы.Добавить("гкс_МПОБВоВремя", Тип("ТаблицаФормы"), Элементы["гкс_МПраво"]);
	НЭлем.ПутьКДанным = "Объект.гкс_МПОБВоВремя";
	НЭлем.УстановитьДействие("ОбработкаВыбора", "гкс_МПОБВоВремяОбработкаВыбора");
	//
	НЭлем = Элементы.Добавить("гкс_МПОБВоВремяМероприятие", Тип("ПолеФормы"), Элементы["гкс_МПОБВоВремя"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Объект.гкс_МПОБВоВремя.Мероприятие";
	НЭлем.МногострочныйРежим = Истина;
	//
	НЭлем = Элементы.Добавить("гкс_ОсобыеУсловия", Тип("ПолеФормы"), Элементы["гкс_СтраницаМероприятия"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Объект.гкс_ОсобыеУсловия";
	НЭлем.АвтоМаксимальнаяШирина = Ложь;
	НЭлем.МногострочныйРежим = Истина;
	//
	НЭлем = Элементы.Добавить("гкс_РежимРаботы", Тип("ПолеФормы"), Элементы["гкс_СтраницаМероприятия"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Объект.гкс_РежимРаботы";
	//
	НКом = Команды.Добавить("гкс_МЛевоПодбор");
	НКом.Действие = "гкс_МЛевоПодбор";
	НКом.Заголовок = НСтр("ru='Подбор';en='Selection';es='La selección'");
	//
	НКноп = Элементы.Добавить("гкс_МЛевоПодборКнопка", Тип("КнопкаФормы"), Элементы["гкс_МПОБДо"].КоманднаяПанель);
	НКноп.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НКноп.ИмяКоманды = "гкс_МЛевоПодбор";
	//
	НКом = Команды.Добавить("гкс_МПравоПодбор");
	НКом.Действие = "гкс_МПравоПодбор";
	НКом.Заголовок = НСтр("ru='Подбор';en='Selection';es='La selección'");
	//
	НКноп = Элементы.Добавить("гкс_МПравоПодборКнопка", Тип("КнопкаФормы"), Элементы["гкс_МПОБВоВремя"].КоманднаяПанель);
	НКноп.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НКноп.ИмяКоманды = "гкс_МПравоПодбор";
	// гкс- [Релиз 1] Куст 10.12.2020
	//
	// гкс+ [Релиз 1] Куст 31.03.2021
	НЭлем = Элементы.Добавить("гкс_ГруппаНомерНарядДопуска", Тип("ГруппаФормы"), Элементы.ДатаИНомер);
	НЭлем.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НЭлем.ОтображатьЗаголовок = Ложь;
	//
	НЭлем = Элементы.Добавить("гкс_ОформитьНарядДопуск", Тип("ПолеФормы"), Элементы["гкс_ГруппаНомерНарядДопуска"]);
	НЭлем.Вид = ВидПоляФормы.ПолеФлажка;
	НЭлем.ПутьКДанным = "Объект.гкс_ОформитьНарядДопуск";
	//
	НЭлем = Элементы.Добавить("гкс_НарядДопускНомер", Тип("ПолеФормы"), Элементы["гкс_ГруппаНомерНарядДопуска"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "гкс_НарядДопускНомер";
	НЭлем.Доступность = РольДоступна("гкс_ИзменениеНомераНарядЗадания");
	НЭлем.УстановитьДействие("ПриИзменении", "гкс_НарядДопускНомерИзменен");
	// гкс- [Релиз 1] Куст 31.03.2021
	// гкс+ [Релиз 1] Куст 21.04.2021
	НЭлем = Элементы.Вставить("ДеревоРемонтныхРаботгкс_СпособВыполнения", Тип("ПолеФормы"), 
		Элементы["ДеревоРемонтныхРабот"], Элементы.ДеревоРемонтныхРаботИсполнитель);
	НЭлем.вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДАнным = "ДеревоРемонтныхРабот.гкс_СпособВыполнения";
	НЭлем.УстановитьДействие("ПриИзменении", "гкс_СпособВыполненияДеревоПриИзменении");
	// гкс- [Релиз 1] Куст 21.04.2021
	// гкс+ [разработка 2021] Куст 08.07.2021
	НоваяГруппа = Элементы.Вставить("гкс_ГруппаДеревоРР", Тип("ГруппаФормы"), Элементы.Группа1, Элементы.ДеревоРемонтныхРабот);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.ОтображатьЗаголовок = Ложь;
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	//
	Элементы.Переместить(Элементы.ДеревоРемонтныхРабот,Элементы["гкс_ГруппаДеревоРР"],);
	//
	НовыйЭлемент = Элементы.Добавить("гкс_ПовКоэф", Тип("ПолеФормы"),Элементы["гкс_ГруппаДеревоРР"]);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ДеревоРемонтныхРабот.гкс_ПовКоэф.Описание";
	НовыйЭлемент.ТолькоПРосмотр = Истина;
	НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
	НовыйЭлемент.МногострочныйРежим = Истина;
	//
	НовыйЭлемент = Элементы.Вставить("Деревогкс_ПовКоэф", Тип("ПолеФормы"),
Элементы.ДеревоРемонтныхРабот, Элементы["ДеревоРемонтныхРаботгкс_СпособВыполнения"]);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ДеревоРемонтныхРабот.гкс_ПовКоэф.Коэффициент";
	НовыйЭлемент.ТолькоПРосмотр = Истина;
	НовыйЭлемент.Заголовок = "Пов.коэф.";
//
	НоваяКоманда = Команды.Добавить("гкс_УстановитьПКоэф");
	НоваяКоманда.Действие = "гкс_УстановитьПКоэф";
	НоваяКоманда.Заголовок = "Установить повышающий коэффициент";
	//
	НоваяКнопка = Элементы.Добавить("гкс_УстановитьПКоэфКнопка", Тип("КнопкаФормы"), Элементы.ДеревоРемонтныхРаботКоманднаяПанель);
	НоваяКнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НоваяКнопка.ИмяКоманды = "гкс_УстановитьПКоэф";
	//
	Элементы.ДеревоРемонтныхРабот.УстановитьДействие("Выбор", "гкс_РемонтныеРаботыВыбор");
	//
	// гкс- [разработка 2021] Куст 08.07.2021
	// гкс+ [11.22] Деснол 03.11.2022
	НовыйЭлемент = Элементы.Вставить("гкс_ОРТехНомер", Тип("ПолеФормы"), Элементы["РемонтыОборудования"], Элементы.РемонтыОборудованияВидРемонтныхРабот);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.РемонтыОборудования.ОбъектРемонта.ТехНомер";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	// гкс- [11.22] Деснол 03.11.2022
	// гкс+ [12.22] Деснол 12.12.2022
	НоваяГруппа = Элементы.Вставить("гкс_ГруппаДатыРабот", Тип("ГруппаФормы"), Элементы.ИсполнителиПоРемонтамКоманднаяПанель);
	НоваяГруппа.Вид = ВидГруппыФормы.Подменю;
	НоваяГруппа.Заголовок = "Заполнить";
	//
	НоваяГруппа = Элементы.Вставить("гкс_ГруппаДатыРабот1", Тип("ГруппаФормы"), Элементы["гкс_ГруппаДатыРабот"]);
	НоваяГруппа.Вид = ВидГруппыФормы.Подменю;
	НоваяГруппа.Заголовок = "Заполнить даты работ";
	//
	НоваяКоманда = Команды.Добавить("ЗаполнитьДатыРаботПоРемонту");
	НоваяКоманда.Действие = "ЗаполнитьДатыРаботПоРемонту";
	НоваяКоманда.Заголовок = "По ремонту";
	//
	НоваяКнопка = Элементы.Добавить("ЗаполнитьДатыРаботПоРемонту_Кнопка", Тип("КнопкаФормы"), Элементы["гкс_ГруппаДатыРабот1"]);
	НоваяКнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НоваяКнопка.ИмяКоманды = "ЗаполнитьДатыРаботПоРемонту";
	//
	НоваяГруппа = Элементы.Вставить("гкс_ГруппаДатыРабот2", Тип("ГруппаФормы"), Элементы.ИсполнителиКоманднаяПанель);
	НоваяГруппа.Вид = ВидГруппыФормы.Подменю;
	НоваяГруппа.Заголовок = "Заполнить";
	//
	Элементы.Переместить(Элементы.ИсполнителиЗаполнитьИсполнителей, Элементы["гкс_ГруппаДатыРабот2"]);
	//
	НоваяГруппа = Элементы.Вставить("гкс_ГруппаДатыРабот3", Тип("ГруппаФормы"), Элементы["гкс_ГруппаДатыРабот2"]);
	НоваяГруппа.Вид = ВидГруппыФормы.Подменю;
	НоваяГруппа.Заголовок = "Заполнить даты работ";
	//
	НоваяКнопка = Элементы.Добавить("ЗаполнитьДатыРаботПоРемонту2_Кнопка", Тип("КнопкаФормы"), Элементы["гкс_ГруппаДатыРабот3"]);
	НоваяКнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НоваяКнопка.ИмяКоманды = "ЗаполнитьДатыРаботПоРемонту";
	//
	НоваяГруппа = Элементы.Вставить("гкс_ГруппаДатыРабот4", Тип("ГруппаФормы"), Элементы["гкс_ГруппаДатыРабот2"]);
	НоваяГруппа.Вид = ВидГруппыФормы.Подменю;
	НоваяГруппа.Заголовок = "Заполнить время работы";
	//
	НоваяКоманда = Команды.Добавить("ЗаполнитьВремяРаботыПоНормативам");
	НоваяКоманда.Действие = "ЗаполнитьВремяРаботыПоНормативам";
	НоваяКоманда.Заголовок = "По нормативам";
	//
	НоваяКнопка = Элементы.Добавить("ЗаполнитьВремяРаботыПоНормативам_Кнопка", Тип("КнопкаФормы"), Элементы["гкс_ГруппаДатыРабот4"]);
	НоваяКнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НоваяКнопка.ИмяКоманды = "ЗаполнитьВремяРаботыПоНормативам";
	//
	НоваяКоманда = Команды.Добавить("ЗаполнитьВремяРаботыПоДлительностиСУчетомГрафика");
	НоваяКоманда.Действие = "ЗаполнитьВремяРаботыПоДлительностиСУчетомГрафика";
	НоваяКоманда.Заголовок = "По длительности ремонтных работ с учетом графика работы сотрудника";
	//
	НоваяКнопка = Элементы.Добавить("ЗаполнитьВремяРаботыПоДлительностиСУчетомГрафика_Кнопка", Тип("КнопкаФормы"), Элементы["гкс_ГруппаДатыРабот4"]);
	НоваяКнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НоваяКнопка.ИмяКоманды = "ЗаполнитьВремяРаботыПоДлительностиСУчетомГрафика";
	// гкс- [12.22] Деснол 12.12.2022
КонецПроцедуры

// гкс+ [Релиз 1] Куст
&НаКлиенте
Процедура гкс_НарядДопускНомерИзменен(Элемент)
	ЭтотОбъект["гкс_НарядДопускНомерИзменен"] = Истина;
КонецПроцедуры

// гкс+ [Релиз 1] Куст
&НаСервере
Процедура гкс_ОбновитьНомерНарядДопуска()
	ТемпСтрукт = Новый Структура("гкс_НарядДопускНомер", Неопределено);
	ЗаполнитьЗначенияСвойств(ТемпСтрукт, ЭтотОбъект);
	Если ЗначениеЗаполнено(Объект.Ссылка) И Не ТемпСтрукт.гкс_НарядДопускНомер = Неопределено Тогда 
		НЗ = РегистрыСведений.гкс_НомераНарядДопусков.СоздатьнаборЗаписей();
		НЗ.Отбор.Документ.Установить(Объект.Ссылка);
		НЗ.Прочитать();
		Если НЗ.Количество() Тогда 
			ЭтотОбъект["гкс_НарядДопускНомер"] = НЗ[0].Номер;
		Иначе
			ЭтотОбъект["гкс_НарядДопускНомер"] = 0;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СредиИсполнителейЕстьКонтрагент()
	Для Каждого СТ Из Объект.ИсполнителиПоРемонтам Цикл
		Если ТипЗнч(СТ.Исполнитель) = Тип("СправочникСсылка.Контрагенты") Тогда 
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

&НаСервере
&ИзменениеИКонтроль("ПередЗаписьюНаСервере")
Процедура Расш_гкс_ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

	// Согласование++
	торо_РаботаССогласованиями.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	// Согласование--

	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение
		И ФОИспользоватьГарантии Тогда
		торо_ГарантийноеОбслуживание.СформироватьПредупрежденияОРекламационныхАктах(Объект, "РемонтыОборудования");
	КонецЕсли;

	#Вставка
	Если СредиИсполнителейЕстьКонтрагент() = Ложь Тогда 
	#КонецВставки
	Если торо_ОбщегоНазначения.ПроверитьВремяРаботыСотрудников(Объект, "Исполнители") Тогда 
		Отказ = Истина;
	КонецЕсли; 
	#Вставка
	КонецЕсли;
	// гкс+ [Релиз 1] Куст 31.03.2021
	Если ЭтотОбъект["гкс_НарядДопускНомерИзменен"] Тогда 
		Если ЗначениеЗаполнено(Объект.Дата) Тогда 
			ТекГод = НачалоГода(Объект.Дата);
		Иначе
			ТекГод = НачалоГода(ТекущаяДата());
		КонецЕсли;
		Запрос = Новый Запрос();
		Запрос.Текст = "Выбрать ТЧ.Документ КАК Документ ИЗ РегистрСведений.гкс_НомераНарядДопусков КАК ТЧ 
		|	Где ТЧ.Номер = &Номер И Не ТЧ.Документ = &Ссылка
		|	И ТЧ.Подразделение = &Подр И ТЧ.Год = &Год";
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		Запрос.УстановитьПараметр("Подр", Объект.Подразделение);
		Запрос.УстановитьПараметр("Год", ТекГод);
		Запрос.УстановитьПараметр("Номер", ЭтотОбъект["гкс_НарядДопускНомер"]);
		РезультатЗапроса = Запрос.Выполнить();	
		Если не РезультатЗапроса.Пустой() Тогда 
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	// гкс- [Релиз 1] Куст 31.03.2021
	#КонецВставки

КонецПроцедуры

&НаКлиенте
Процедура гкс_ОрганизацияПриИзмененииПосле(Элемент)
	// гкс+ [2021] Куст
	Если ЗначениеЗаполнено(Объект.СпособСогласования) Тогда 
		Возврат;
	КонецЕсли; // гкс- [2021] 
	Если ЭтотОбъект["мИспользоватьСогласованиеДокументов"] И Элементы["СпособСогласования"].ТолькоПросмотр
		И Не СтатусДокументаРегистр = ЭтаФорма["гкс_СтатусЧерновик"] Тогда 
		Возврат;
	КонецЕсли;
	//
	Если Объект.РемонтыОборудования.Количество() > 0 Тогда 
		Способ = гкс_ПолучитьСпособСогласования(Объект.Организация, Объект.РемонтыОборудования[0].ОбъектРемонта);
		Если Не Объект.СпособСогласования = Способ И Не Способ = Неопределено Тогда 
			Объект.СпособСогласования = Способ;
			СпособСогласованияПриИзменении(Неопределено);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
&После("РемонтыОборудованияПриОкончанииРедактирования")
Процедура Расш_гкс_РемонтыОборудованияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	гкс_ОрганизацияПриИзмененииПосле(Неопределено);
КонецПроцедуры

&НаКлиенте
&После("ИсполнителиПоРемонтамПриОкончанииРедактирования")
Процедура Расш_гкс_ИсполнителиПоРемонтамПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	гкс_ОрганизацияПриИзмененииПосле(Неопределено);
КонецПроцедуры


&НаСервере
Процедура дс_ИзменитьВидимостьКнопкиОтправкиНаСогласование()
	гкс_ОбщегоНазначенияСервер.ИзменитьВидимостьКнопкиОтправкиНаСогласование(Элементы["дс_ОтправитьНаСогласование"],СтатусДокументаРегистр);
КонецПроцедуры

// связка между типами исполнителей
&НаСервере
Процедура ОбновитьОтображениеИсполнителей()
	Отображать = Истина;
	Если Объект.ИсполнителиПоРемонтам.Количество() Тогда 
		Если ТипЗнч(Объект.ИсполнителиПоРемонтам[0].Исполнитель) = Тип("СправочникСсылка.Контрагенты") Тогда 
			Отображать = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ИсполнителиСотрудник.Видимость = Отображать;
	Элементы["Исполнителигкс_Количество"].Видимость = Не Отображать;
	// гкс+ [разработка 2021] Куст 08.07.2021
	Элементы["гкс_СотрудникКонтрагента"].Видимость = Не Отображать;
	// гкс- [разработка 2021] Куст 08.07.2021
	
КонецПроцедуры

&НаКлиенте 
Процедура ЗадатьВопросПередИзменениемИсполнителя(СтруктураОпОп)
	ОпОп = Новый ОписаниеОповещения("ЗадатьВопросПередИзменениемИсполнителяПослеВопроса", ЭтотОбъект, СтруктураОпОп);
	ПоказатьВопрос(ОпОп, НСтр("ru='Данные о сотрудниках на закладке «По операциям» будут удалены. Продолжить?';
	|en='Employee data on the By operations tab will be deleted. Proceed?'"), РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаСервере
Процедура МодифицироватьИсполнителей()
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТруТЧ.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		|	ТруТЧ.ID КАК ID,
		|	ТруТЧ.Сотрудник КАК Сотрудник,
		|	ТруТЧ.Квалификация КАК Квалификация,
		|	ТруТЧ.гкс_СотрудникКонтрагента КАК гкс_СотрудникКонтрагента,
		|	ВЫБОР
		|		КОГДА ТруТЧ.гкс_Количество < 1
		|			ТОГДА 1
		|		ИНАЧЕ ТруТЧ.гкс_Количество
		|	КОНЕЦ КАК гкс_Количество,
		|	ТруТЧ.гкс_ВремяРаботы КАК гкс_ВремяРаботы
		|ПОМЕСТИТЬ ИсхТру
		|ИЗ
		|	&ТЧ1 КАК ТруТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РемТЧ.ДатаНачала КАК ДатаНачала,
		|	РемТЧ.ДатаОкончания КАК ДатаОкончания,
		|	РемТЧ.ID КАК ID
		|ПОМЕСТИТЬ ИсхРем
		|ИЗ
		|	&ТЧ2 КАК РемТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсхТру.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		|	ИсхТру.ID КАК ID,
		|	ИсхТру.Сотрудник КАК Сотрудник,
		|	ИсхТру.Квалификация КАК Квалификация,
		|	ИсхТру.гкс_Количество КАК гкс_Количество,
		|	ИсхТру.гкс_СотрудникКонтрагента КАК гкс_СотрудникКонтрагента,
		|	ИсхТру.гкс_ВремяРаботы КАК гкс_ВремяРаботы,
		|	ИсхРем.ДатаНачала КАК ДатаНачала,
		|	ИсхРем.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	ИсхТру КАК ИсхТру
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсхРем КАК ИсхРем
		|		ПО ИсхТру.РемонтыОборудования_ID = ИсхРем.ID
		|ИТОГИ ПО
		|	РемонтыОборудования_ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсхТру.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		|	ИсхТру.ID КАК ID,
		|	ИсхТру.Квалификация КАК Квалификация,
		|	ИсхТру.гкс_СотрудникКонтрагента КАК гкс_СотрудникКонтрагента,
		|	СУММА(ИсхТру.гкс_Количество) КАК гкс_Количество,
		|	МАКСИМУМ(ИсхТру.гкс_ВремяРаботы) КАК гкс_ВремяРаботы,
		|	ИсхРем.ДатаНачала КАК ДатаНачала,
		|	ИсхРем.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	ИсхТру КАК ИсхТру
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсхРем КАК ИсхРем
		|		ПО ИсхТру.РемонтыОборудования_ID = ИсхРем.ID
		|
		|СГРУППИРОВАТЬ ПО
		|	ИсхТру.РемонтыОборудования_ID,
		|	ИсхТру.ID,
		|	ИсхТру.гкс_СотрудникКонтрагента,
		|	ИсхТру.Квалификация,
		|	ИсхРем.ДатаНачала,
		|	ИсхРем.ДатаОкончания
		|ИТОГИ ПО
		|	РемонтыОборудования_ID";
	
	Запрос.УстановитьПараметр("ТЧ1", Объект.Исполнители.Выгрузить());
	Запрос.УстановитьПараметр("ТЧ2", Объект.РемонтыОборудования.Выгрузить());
	
	ПакетОдин = 2;
	ПакетДва = ПакетОдин + 1;
	РезультатЗапроса = Запрос.ВыполнитьПакет();		
	Выборка1 = РезультатЗапроса[ПакетОдин].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Выборка2 = РезультатЗапроса[ПакетДва].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Объект.Исполнители.Очистить();
	Для Каждого СтрокаТаблицы Из Объект.РемонтыОборудования Цикл
		ТипИсполнителей = 1;
		Для Каждого СтрИсп Из Объект.ИсполнителиПоРемонтам Цикл
			Если СтрИсп.РемонтыОборудования_ID = СтрокаТаблицы.ID Тогда
				Если ТипЗнч(Объект.ИсполнителиПоРемонтам[0].Исполнитель) = Тип("СправочникСсылка.Контрагенты") Тогда 
					ТипИсполнителей = 2;
				КонецЕсли;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ТипИсполнителей = 1 Тогда 
			Выборка1.Сбросить();
			Если Выборка1.НайтиСледующий(Новый Структура("РемонтыОборудования_ID",СтрокаТаблицы.ID)) Тогда 
				Выборка = Выборка1.Выбрать();
				Пока Выборка.Следующий() Цикл
					НужноКолво = Макс(1, Выборка.гкс_Количество);
					Сч = 0;
					Пока Сч < НужноКолво Цикл
						НоваяСтрока = Объект.Исполнители.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
						НоваяСтрока.гкс_Количество = 1;
						НоваяСтрока.гкс_ВремяРаботыТекст = Расш_гкс_СформироватьПродолжительность(НоваяСтрока.гкс_ВремяРаботы);
						Сч = Сч + 1;
					КонецЦикла;
				КонецЦикла;
			КонецЕсли;
		Иначе
			Если Выборка2.НайтиСледующий(Новый Структура("РемонтыОборудования_ID",СтрокаТаблицы.ID)) Тогда 
				Выборка = Выборка2.Выбрать();
				Пока Выборка.Следующий() Цикл
					НоваяСтрока = Объект.Исполнители.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
					НоваяСтрока.гкс_ВремяРаботыТекст = Расш_гкс_СформироватьПродолжительность(НоваяСтрока.гкс_ВремяРаботы);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	//
	ОбновитьОтображениеИсполнителей();
КонецПроцедуры

&НаКлиенте 
Процедура ЗадатьВопросПередИзменениемИсполнителяПослеВопроса(Результат, ДопПараметры)Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда 
		Если ДопПараметры.Свойство("Удаление") Тогда 
			Отказ = ложь;
			ИсполнителиПоРемонтамПередУдалением(Элементы.ИсполнителиПоРемонтам, Отказ);
			Если НЕ Отказ Тогда 
				Объект.ИсполнителиПоРемонтам.Удалить(0);
			КонецЕсли;
		КонецЕсли;
		МодифицироватьИсполнителей();
	Иначе
		Если ДопПараметры.Свойство("Удаление") = Ложь Тогда 
			Объект.ИсполнителиПоРемонтам[0].Исполнитель = ЭтотОбъект["гкс_ИсполнительДо"];
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура гкс_ИсполнителиПоРемонтамПередНачаломИзмененияПосле(Элемент, Отказ)
	Если Объект.ИсполнителиПоРемонтам.Количество() Тогда 
		ЭтотОбъект["гкс_ИсполнительДо"] = Объект.ИсполнителиПоРемонтам[0].Исполнитель;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура гкс_ИсполнителиПоРемонтамПередУдалениемПеред(Элемент, Отказ)
	ТекДанные = Элементы.ИсполнителиПоРемонтам.ТекущиеДанные;
	Если Не ТекДанные = Неопределено И ТекДанные.Исполнитель = Объект.ИсполнителиПоРемонтам[0].Исполнитель Тогда 
		ТекТип = ТипЗнч(Объект.ИсполнителиПоРемонтам[0].Исполнитель);
		Если Объект.ИсполнителиПоРемонтам.Количество() > 1 Тогда 
			Если ТекТип = ТипЗнч(Объект.ИсполнителиПоРемонтам[1].Исполнитель) Тогда 
				Возврат;
			КонецЕсли;
		ИначеЕсли ТекТип = Тип("СправочникСсылка.СтруктураПредприятия") Тогда 
			Возврат
		КонецЕсли;
		Если ТекТип = Тип("СправочникСсылка.СтруктураПредприятия") Тогда 
			Отказ = Истина;
			СтруктураОпОп = Новый Структура("Удаление", Истина);
			ЗадатьВопросПередИзменениемИсполнителя(СтруктураОпОп);
		Иначе
			ИсполнителиПоРемонтамПередУдалением(Элементы.ИсполнителиПоРемонтам, Отказ);
			Если НЕ Отказ Тогда 
				Объект.ИсполнителиПоРемонтам.Удалить(0);
			КонецЕсли;
			МодифицироватьИсполнителей();
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура гкс_ИсполнителиПоРемонтамИсполнительПриИзмененииПосле(Элемент)
	ТекДанные = Элементы.ИсполнителиПоРемонтам.ТекущиеДанные;
	Если Не ТекДанные = Неопределено И ЗначениеЗаполнено(ТекДанные.Исполнитель) И ТекДанные.Исполнитель = Объект.ИсполнителиПоРемонтам[0].Исполнитель Тогда 
		ТекТип = ТипЗнч(Объект.ИсполнителиПоРемонтам[0].Исполнитель);
		Если ТекТип = ТипЗнч(ЭтотОбъект["гкс_ИсполнительДо"]) Тогда 
			Возврат
		КонецЕсли;
		Если ТекТип = Тип("СправочникСсылка.Контрагенты") Тогда 
			СтруктураОпОп = Новый Структура();
			ЗадатьВопросПередИзменениемИсполнителя(СтруктураОпОп);
		Иначе
			МодифицироватьИсполнителей();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ДеревоРемонтныхРаботОбработкаВыбора")
Процедура гкс_ДеревоРемонтныхРаботОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	ТекСтрокаДерева = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;

	Если ТекСтрокаДерева = Неопределено Тогда
		СтрокаРодитель = Новый Структура("ID, РемонтыОборудования_ID, Родитель_ID", "", "", "");
		ИДВыбраннойСтроки = "";
	Иначе
		СтрокаРодитель = ТекСтрокаДерева;
		ИДВыбраннойСтроки = ТекСтрокаДерева.ID;
	КонецЕсли;


	ТекРемонт = Элементы.РемонтыОборудования.ТекущиеДанные;

	Если ТекРемонт <> Неопределено Тогда
		РемонтыОборудования_ID = ТекРемонт.ID;
	Иначе
		РемонтыОборудования_ID = "";
	КонецЕсли;

	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") И ВыбранноеЗначение.Количество()>0 И ТипЗнч(ВыбранноеЗначение[0]) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда
		#Вставка
		// гкс+ [Подбор ТехКарт] Куст 14.10.2020
		Массивпроверки = Новый Массив();
		Массивпроверки.Добавить(ВыбранноеЗначение[0]);
		Если ПроверитьТКНаСервере(Массивпроверки).Количество() Тогда 
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru='Запрещено выбирать шаблоны техкарт';
			|en='It is forbidden to choose patterns standard maintenance plans'");
			Сообщение.Сообщить();
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
		// гкс- [Подбор ТехКарт] Куст 14.10.2020
		#КонецВставки
		ТекущийРемонт = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
		Пока ТекущийРемонт <> Неопределено И ТипЗнч(ТекущийРемонт.РемонтнаяРабота) <> Тип("Строка") Цикл
			Если ТекущийРемонт.РемонтнаяРабота = ВыбранноеЗначение[0] Тогда
				ШаблонСообщения = НСтр("es='El significado escogido ""%1"" no puede ser incluido en la composición.';ru='Выбранное значение ""%1"" не может быть включено в состав самого себя.';en='The selected value ""%1"" cannot be included in itself.'");
				ТекстСообщения = СтрШаблон(ШаблонСообщения, ВыбранноеЗначение[0]);
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
				Возврат;
			КонецЕсли; 
			ТекущийРемонт = ТекущийРемонт.ПолучитьРодителя();	
		КонецЦикла; 
	КонецЕсли;

	Если  ТекРемонт <> Неопределено Тогда
		ТекущиеДанные = Новый Структура("ТекущийРемонт_ID, СтрокаРодитель_ID, СтрокаРодительРемонтыОборудования_ID, СтрокаРодительРодитель_ID, ДатаНачалаРемонта", РемонтыОборудования_ID, СтрокаРодитель.ID, СтрокаРодитель.РемонтыОборудования_ID, СтрокаРодитель.Родитель_ID, ТекРемонт.ДатаНачала);
	Иначе
		ТекущиеДанные = Новый Структура("ТекущийРемонт_ID, СтрокаРодитель_ID, СтрокаРодительРемонтыОборудования_ID, СтрокаРодительРодитель_ID, ДатаНачалаРемонта", РемонтыОборудования_ID, СтрокаРодитель.ID, СтрокаРодитель.РемонтыОборудования_ID, СтрокаРодитель.Родитель_ID, Дата(1,1,1,0,0,0));
	КонецЕсли; 

	СтруктураПараметры = Новый Структура;

	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		МассивСтруктурВозврата = ДеревоРемонтныхРаботОбработкаВыбораНаСервереДляМассива(ВыбранноеЗначение, ТекущиеДанные, СтруктураПараметры);
		Если ФОИспользоватьОстановочные Тогда
			ОбновитьОстановочные();
		КонецЕсли;
	Иначе
		СтруктураВозврата = ДеревоРемонтныхРаботОбработкаВыбораНаСервере(ВыбранноеЗначение, ТекущиеДанные, СтруктураПараметры);
		МассивСтруктурВозврата = Новый Массив;
		МассивСтруктурВозврата.Добавить(СтруктураВозврата);
		Если ФОИспользоватьОстановочные Тогда
			ОбновитьОстановочные();
		КонецЕсли; 
	КонецЕсли;

	Для Каждого ЭлементМассива Из МассивСтруктурВозврата Цикл
		Если ТипЗнч(ЭлементМассива) = Тип("Строка") Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(ЭлементМассива);
		КонецЕсли;
	КонецЦикла;	

	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		Массивстрок = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", ВыбранноеЗначение.СтрокаРемонтовОборудования.ID));
		Если МассивСтрок.Количество() Тогда
			Идентиф = МассивСтрок[0].ПолучитьИдентификатор();
			Элементы.РемонтыОборудования.ТекущаяСтрока = Идентиф;
		КонецЕсли;
	КонецЕсли;
	ОбновитьЗависимыеЛоты();
	Модифицированность = Истина;

	Если Элементы.РемонтыОборудования.ТекущаяСтрока = Неопределено Тогда
		Если Объект.РемонтыОборудования.Количество() > 0 Тогда
			Элементы.РемонтыОборудования.ТекущаяСтрока = Объект.РемонтыОборудования[0].ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;

	РемонтыОборудованияПриАктивизацииСтроки(Элементы.РемонтыОборудования); 

КонецПроцедуры

// гкс+ [2021] Куст
&НаСервере
Процедура гкс_ДобавитьГруппуКомандПечатиБАТ()
	// гкс+ [Релиз16] Деснол
	Попытка
		ГруппаПечать = Элементы.ПодменюПечатьОбычное;
	Исключение
		ГруппаПечать = Элементы.ФормаПечать;
	КонецПопытки;
	НоваяГруппа = Элементы.Добавить("гкс_БАТПечать", Тип("ГруппаФормы"), ГруппаПечать);
	НоваяГруппа.Вид = ВидГруппыФормы.Подменю;
	НоваяГруппа.Заголовок = "БАТ";
	//
	Для Каждого ЭлементСписка ИЗ ГруппаПечать.ПодчиненныеЭлементы Цикл
	// гкс- [Релиз16]
		Если Не СтрНайти(ЭлементСписка.Имя, "БАТ") = 0 Тогда 
			Элементы.Переместить(ЭлементСписка, НоваяГруппа);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// гкс+ [Подбор ТехКарт] Куст 
&НаСервереБезКонтекста
Функция ПроверитьТКНаСервере(МассивТК)
	МассивВозврата = Новый Массив();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Проверяемые.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.торо_ИдентификаторыТехКарт КАК Проверяемые
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ИдентификаторыТехКарт КАК торо_ИдентификаторыТехКарт
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ИдентификаторыТехКарт КАК Родитель1
		|			ПО торо_ИдентификаторыТехКарт.Родитель = Родитель1.Ссылка
		|		ПО Проверяемые.Родитель = торо_ИдентификаторыТехКарт.Ссылка
		|ГДЕ
		|	Проверяемые.Ссылка В(&Родитель)
		|	И Родитель1.Родитель = ЗНАЧЕНИЕ(Справочник.торо_ИдентификаторыТехКарт.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Родитель", МассивТК);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() = Ложь Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивВозврата.Добавить(Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивВозврата;
КонецФункции


// гкс+ [Подбор ТехКарт] Куст 
&НаКлиенте
&ИзменениеИКонтроль("СпособСогласованияНачалоВыбора")
Процедура Расш_гкс_СпособСогласованияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если СогласующиеРегистр.Количество() > 0 Тогда

		СтандартнаяОбработка = Ложь;
		ПоказатьВопрос(Новый ОписаниеОповещения("СпособСогласованияНачалоВыбораЗавершение",ЭтотОбъект,Новый Структура("Элемент", Элемент)),
		НСтр("es='¡Los datos de los estatus establecidos del documento serán limpiados! ¿Continuar?';ru='Данные по установленным статусам документа будут очищены! Продолжить?';en='Data on the established statuses of the document will be cleared! Continue?'"), РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	#Вставка
	// гкс+ [Релиз 1] Куст 22.03.2021
	СтандартнаяОбработка = Ложь;
	ДопПараметры = Новый Структура("Отбор", Новый Структура("ПометкаУдаления", Ложь));
	ОткрытьФорму("Справочник.торо_СпособыСогласованияДокументов.ФормаВыбора",ДопПараметры,
	Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	// гкс- [Релиз 1] Куст 22.03.2021
	#КонецВставки

КонецПроцедуры

// гкс+ [Подбор ТехКарт] Куст 
&НаКлиенте
&ИзменениеИКонтроль("СпособСогласованияНачалоВыбораЗавершение")
Процедура Расш_гкс_СпособСогласованияНачалоВыбораЗавершение(РезультатВопроса, ДополнительныеПараметры)

	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		СогласующиеРегистр.Очистить();
		Если мХранитьИсториюСогласованияВДокументах Тогда
			Объект.Согласующие.Очистить();
		КонецЕсли;
		#Вставка
		// гкс+ [Релиз 1] Куст 22.03.2021
		ДопПараметры = Новый Структура("Отбор", Новый Структура("ПометкаУдаления", Ложь));
		ОткрытьФорму("Справочник.торо_СпособыСогласованияДокументов.ФормаВыбора",ДопПараметры,
		ДополнительныеПараметры.Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		// гкс- [Релиз 1] Куст 22.03.2021
		#КонецВставки
		#Удаление
		ОткрытьФорму("Справочник.торо_СпособыСогласованияДокументов.ФормаВыбора",,ДополнительныеПараметры.Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		#КонецУдаления
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура гкс_УстановитьПКоэфОбработкаВыбора(Результат, ДопПараметры)Экспорт
	Если Не Результат = Неопределено Тогда 
		Для Каждого СтрокаМассива Из Результат Цикл
			Для Каждого СтрокаТаблицы Из Объект.РемонтныеРаботы Цикл
				Если ДопПараметры.ИдРемонта = СтрокаТаблицы.РемонтыОборудования_ID
					И СтрокаМассива.ИД = СтрокаТаблицы.ID Тогда 
					СтрокаТаблицы.гкс_ПовКоэф = СтрокаМассива.гкс_ПовКоэф;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		//
		РемонтыОборудованияПриАктивизацииСтроки(Элементы.РемонтыОборудования);
	КонецЕсли;
КонецПроцедуры
// гкс- [Подбор ТехКарт] Куст 14.10.2020

&НаКлиенте
Процедура гкс_РемонтныеРаботыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "Деревогкс_ПовКоэф" Тогда 
		ТекДанные = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
		Если Не ТекДанные = Неопределено 
		И гкс_ЭтоТО(ТекДанные.РемонтнаяРабота) Тогда 
		ОписаниеОп = Новый ОписаниеОповещения("УстановитьВыбраннымПослеВыбора", ЭтотОбъект);
		ОткрытьФорму("Справочник.гкс_ПКоэффициентыРабот.ФормаВыбора",, ЭтотОбъект,,,, 
				ОписаниеОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция гкс_ЭтоТО(Ссылка)
	Возврат ТипЗнч(Ссылка) = Тип("СправочникСсылка.торо_ТехнологическиеОперации");
КонецФункции

&НаКлиенте
Процедура УстановитьВыбраннымПослеВыбора(Результат, ДопПараметры)Экспорт
	Если ЗначениеЗаполнено(Результат) Тогда 
	ТекДанные = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		НайдСтроки = Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("ID,РемонтыОборудования_ID"
			, ТекДанные.ID, ТекДанные.РемонтыОборудования_ID));
		Если НайдСтроки.Количество() Тогда 
			Модифицированность = Истина;
			ТекДанные.гкс_ПовКоэф = Результат;
			Для Каждого СТрокаМассива Из НайдСтроки Цикл
				СТрокаМассива.гкс_ПовКоэф = Результат;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ДеревоРемонтныхРаботИсполнительПриИзменении")
Процедура гкс_ДеревоРемонтныхРаботИсполнительПриИзменении(Элемент)

	ТекущиеДанные = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.ДоговорБригада = Неопределено;
		УстановитьПараметрыВыбораДоговораБригады_ДляРемонтныхРабот(ТекущиеДанные.Исполнитель, ТекущиеДанные.РемонтыОборудования_ID);
		#Вставка
		Если ЗначениеЗаполнено(ТекущиеДанные.Исполнитель) Тогда 
			Ветвь = ТекущиеДанные.ПолучитьЭлементы();
			Для Каждого СтрокаДерева Из Ветвь Цикл
				СтрокаДерева.Исполнитель = ТекущиеДанные.Исполнитель;
				Ветвь2 = СтрокаДерева.ПолучитьЭлементы();
				Для Каждого СтрокаДерева2 Из Ветвь2 Цикл
					СтрокаДерева2.Исполнитель = ТекущиеДанные.Исполнитель;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		#КонецВставки
	КонецЕсли;

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("УстановитьУсловноеОформление")
Процедура гкс_УстановитьУсловноеОформление()

	// Доступость вида ремонта для редактирования.
	// Доступен если ЭтоПервыйДокументВЦепочке ИЛИ (ЭтоПоследнийДокументВЦепочке И (Докуммент-основание = ВО или ВД)).

	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РемонтыОборудованияВидРемонтныхРабот.Имя);

	ГруппаНЕ = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаНЕ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаНе;

	ГруппаЭлементов = ГруппаНЕ.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементов.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	//
	ОтборЭлемента = ГруппаЭлементов.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЭтоПервыйДокументВЦепочке");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	//// ИЛИ (	
	ГруппаЭлементовВложенная = ГруппаЭлементов.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовВложенная.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ОтборЭлемента = ГруппаЭлементовВложенная.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.РемонтыОборудования.ТипДокументаОснования");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "торо_ВнешнееОснованиеДляРабот";
	///( И	
	ОтборЭлемента = ГруппаЭлементовВложенная.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЭтоПоследнийДокументВЦепочке");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	//) ИЛИ

	ГруппаЭлементовВложенная = ГруппаЭлементов.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовВложенная.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ОтборЭлемента = ГруппаЭлементовВложенная.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.РемонтыОборудования.ТипДокументаОснования");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "торо_ВыявленныеДефекты";
	///( И	
	ОтборЭлемента = ГруппаЭлементовВложенная.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЭтоПоследнийДокументВЦепочке");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	//


	// ТолькоПросмотр корня дерева ремонтных работ 
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоРемонтныхРаботРемонтнаяРабота.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоРемонтныхРабот.РемонтнаяРабота");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	// >> [Деснол] [Ушаков А.Д.] [03.10.2019] 
	ОтборЭлемента.ПравоеЗначение = дс_ПолучитьПредставлениеКорневойРемонтнойРаботы();
	//ОтборЭлемента.ПравоеЗначение = "Ремонтные работы";
	// << [Деснол] [Ушаков А.Д.] [03.10.2019] 

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	//
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоРемонтныхРаботИсполнитель.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоРемонтныхРаботДоговорБригада.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоРемонтныхРабот.ЭтоТехКарта");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Представление = "ДоступностьИсполнителяДляТехОперации";
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр",Истина);
	#Удаление
	Элемент.Использование = Истина;
	#КонецУдаления
	#Вставка
	// гкс+ [Релиз16] Деснол
	Элемент.Использование = Ложь;
	Для Каждого СтрокаТаблицы1 Из УсловноеОформление.Элементы Цикл
		Если СтрокаТаблицы1.Представление = "ВидимостьИсполнителей1" 
			ИЛИ СтрокаТаблицы1.Представление = "ВидимостьИсполнителей2" Тогда 
			НоваяСтрока = СтрокаТаблицы1.Поля.Элементы.Добавить();
			НоваяСтрока.Использование = Истина;
			НоваяСтрока.Поле = Новый ПолеКомпоновкиДанных("Исполнителигкс_Количество");
		КонецЕсли;
	КонецЦикла;
	// гкс- [Релиз16]
	#КонецВставки

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("УстановитьПараметрыВыбораИсполнителя_ДляРемонтныхРабот")
Процедура гкс_УстановитьПараметрыВыбораИсполнителя_ДляРемонтныхРабот(РемонтыОборудования_ID)

	СтруктураПоиска = Новый Структура("РемонтыОборудования_ID", РемонтыОборудования_ID);
	#Вставка
	// гкс+ [Релиз16] Деснол
	Если ЗначениеЗаполнено(РемонтыОборудования_ID) = Ложь Тогда 
		ТекДанные = Элементы.РемонтыОборудования.ТекущиеДанные;
		Если Не ТекДанные = Неопределено Тогда 
			СтруктураПоиска = Новый Структура("РемонтыОборудования_ID", ТекДанные.ID);
		КонецЕсли;
	КонецЕсли;
	// гкс- [Релиз16]
	#КонецВставки
	СтрокиИсполнителей = Объект.ИсполнителиПоРемонтам.НайтиСтроки(СтруктураПоиска);

	ОтборПоСсылке = Новый Массив;
	Для каждого Строка из СтрокиИсполнителей Цикл
		ОтборПоСсылке.Добавить(Строка.Исполнитель);
	КонецЦикла;

	ПараметрыВыбораМассив = Новый Массив;
	ПараметрыВыбораМассив.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(ОтборПоСсылке)));
	ПараметрыВыбораМассив.Добавить(Новый ПараметрВыбора("РежимОтображенияСписка", "Список"));
	Элементы.ДеревоРемонтныхРаботИсполнитель.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораМассив);

КонецПроцедуры




#КонецОбласти