
#Область ОбработчикиСобытий

&Перед("ОбработкаПолученияФормы")
Процедура гкс_ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "Форма" Тогда
		
		ВремяНачала = ОценкаПроизводительности.НачатьЗамерВремени();
		Параметры.Вставить("ВремяНачалаОткрытияФормы", ВремяНачала);
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма = Метаданные.Обработки.торо_ЗакрытиеЗаявокИРемонтов.ОсновнаяФорма.Имя;		
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти