
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Язык = торо_Локализация.ТекущийЯзыкИБ();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(торо_Переводы.Текст, гкс_ТехническиеМеста.НаименованиеПолное) КАК Текст,
		|	гкс_ТехническиеМеста.НаименованиеПолное КАК Текст2
		|ИЗ
		|	Справочник.гкс_ТехническиеМеста КАК гкс_ТехническиеМеста
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_Переводы КАК торо_Переводы
		|		ПО гкс_ТехническиеМеста.Ссылка = торо_Переводы.ID
		|			И (торо_Переводы.Язык = &Язык)
		|			И (торо_Переводы.Реквизит = ""НаименованиеПолное"")
		|ГДЕ
		|	гкс_ТехническиеМеста.Ссылка = &Ссылка";	
	Запрос.УстановитьПараметр("Ссылка", Данные.Ссылка);
	Запрос.УстановитьПараметр("Язык", Язык);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() = Ложь Тогда 
	    Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Представление = Выборка.Текст2;
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

Процедура ОбновитьНаименование(МассивТК)Экспорт
	Для Каждого СМ Из МассивТК Цикл
		Объект = СМ.ПолучитьОбъект();
		
		Объект.НаименованиеПолное = "";
		Если ЗначениеЗаполнено(Объект.МестоПлощадка) Тогда 
			Объект.НаименованиеПолное = Объект.МестоПлощадка;
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.ЗаводПодразделение) Тогда 
			Объект.НаименованиеПолное = ?(ЗначениеЗаполнено(Объект.НаименованиеПолное),Объект.НаименованиеПолное,"") + ", " + Объект.ЗаводПодразделение;
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.Участок) Тогда 
			Объект.НаименованиеПолное = ?(ЗначениеЗаполнено(Объект.НаименованиеПолное),Объект.НаименованиеПолное,"") + ", " + Объект.Участок;
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.Эстакада) Тогда 
			Объект.НаименованиеПолное = ?(ЗначениеЗаполнено(Объект.НаименованиеПолное),Объект.НаименованиеПолное,"") + ", эстакада "+Объект.Эстакада;
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.Секция) Тогда 
			Объект.НаименованиеПолное = ?(ЗначениеЗаполнено(Объект.НаименованиеПолное),Объект.НаименованиеПолное,"") + ", опора "+Объект.Секция;
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.Здание) Тогда 
			Объект.НаименованиеПолное = ?(ЗначениеЗаполнено(Объект.НаименованиеПолное),Объект.НаименованиеПолное,"") + ", здание "+Объект.Здание;
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.Этаж) Тогда 
			Объект.НаименованиеПолное = ?(ЗначениеЗаполнено(Объект.НаименованиеПолное),Объект.НаименованиеПолное,"") + ", этаж "+Объект.Этаж;
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.Отметка) Тогда 
			Объект.НаименованиеПолное = ?(ЗначениеЗаполнено(Объект.НаименованиеПолное),Объект.НаименованиеПолное,"") + ", отметка "
			+ Формат(Объект.Отметка, "ЧДЦ=3");
		Иначе
			Объект.НаименованиеПолное = ?(ЗначениеЗаполнено(Объект.НаименованиеПолное),Объект.НаименованиеПолное,"") + ", отметка 0,000";
		КонецЕсли;
		
		Объект.Записать();
	КонецЦикла;
КонецПроцедуры