#Область ПрограммныйИнтерфейс

// Функция - возвращает структуру значений реквизитов вида плана, переданного в параметре.
//
// Параметры:
//  ВидПлана - СправочникСсылка.торо_ВидыСкользящихПланов - Вид плана, для которого необходимо 
//															получить структуру значений реквизитов.
//
// Возвращаемое значение:
//		Структура - стркутура реквизитов справочника.
//
Функция ПолучитьДанныеПоВидуПлана(ВидПлана) Экспорт
	
	Запрос = Новый Запрос;
	# Область ТекстЗапроса
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	торо_ВидыСкользящихПлановВидыРемонтов.ВидРемонта КАК ВидРемонта
	               |ИЗ
	               |	Справочник.торо_ВидыСкользящихПланов.ВидыРемонтов КАК торо_ВидыСкользящихПлановВидыРемонтов
	               |ГДЕ
	               |	торо_ВидыСкользящихПлановВидыРемонтов.Ссылка = &ВидПлана
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	торо_ВидыСкользящихПланов.ПериодичностьПланирования КАК Периодичность,
	               |	торо_ВидыСкользящихПланов.ЧислоОтображаемыхПериодов КАК КоличествоПериодов,
	               |	торо_ВидыСкользящихПланов.ТочностьПланирования КАК Детализация,
	               |	торо_ВидыСкользящихПланов.ВидИсполнителяРабот КАК ВидИсполнителяРабот
	               |ИЗ
	               |	Справочник.торо_ВидыСкользящихПланов КАК торо_ВидыСкользящихПланов
	               |ГДЕ
	               |	торо_ВидыСкользящихПланов.Ссылка = &ВидПлана";
	# КонецОбласти
	Запрос.УстановитьПараметр("ВидПлана", ВидПлана);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Массив = РезультатЗапроса[0].Выгрузить().ВыгрузитьКолонку("ВидРемонта");
	
	СтруктураВозврата = Новый Структура("Периодичность, КоличествоПериодов, Детализация, ВидИсполнителяРабот");
	
    Если Не РезультатЗапроса[1].Пустой() Тогда
		Выборка = РезультатЗапроса[1].Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);
	КонецЕсли; 
	
	СтруктураВозврата.Вставить("МассивРемонтов", Массив);
	
	Возврат СтруктураВозврата;	
	
КонецФункции
   	
#КонецОбласти

 
  