
&Вместо("ВыбратьСтатусЗавершение")
Процедура гкс_ВыбратьСтатусЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры)
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;
	Объект = Форма.Объект;
	
	ВыбранныйСтатус = ВыбранныйЭлемент.ВыбранныйСтатус;

	ДанныеСтатуса = торо_РаботаССогласованиями.ПолучитьДанныеПоСтатусуДокумента(Объект.СпособСогласования, ВыбранныйСтатус);
	Если (ДанныеСтатуса.ЗапретитьРедактирование ИЛИ ДанныеСтатуса.ПроводитьДокумент) И НЕ Форма.ПроверитьЗаполнение() Тогда
		ТекстСообщения = "";
		Если ДанныеСтатуса.ЗапретитьРедактирование Тогда
			ТекстСообщения = НСтр("es='Durante la comprobación del relleno del documento son encontradas las faltas. El tránsito en el estatus con la prohibición de la redacción es imposible.';ru='При проверке заполнения документа найдены ошибки. Переход в статус с запретом редактирования невозможен.';en='Errors were found while checking the document filling. The transition to the status with the prohibition of editing is not possible.'");
		Иначе
			ТекстСообщения = НСтр("es='Durante la comprobación del relleno del documento son encontradas las faltas. El tránsito en el estatus con el permiso de la realización es imposible.';ru='При проверке заполнения документа найдены ошибки. Переход в статус с разрешением проведения невозможен.';en='Errors were found while checking the document filling. Transition to the status with permission to conduct is not possible.'");
		КонецЕсли;
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ПроставитьГалочкиЗаТекущегоПользователя(ВыбранныйЭлемент, ДополнительныеПараметры);
	торо_РаботаССогласованиямиКлиентСервер.ЗаписатьДеревоСогласования(Форма);
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("Документ", Объект.Ссылка);
	ПараметрыОповещения.Вставить("ВыбранныйСтатус", ВыбранныйСтатус);
	Если ВыбранныйЭлемент.Свойство("УстановитьПринудительно")
		И ВыбранныйЭлемент.УстановитьПринудительно = Истина Тогда 
		ПараметрыОповещения.Вставить("УстановитьПринудительно", Истина);
	КонецЕсли;
		
	Оповестить("УтверждениеСтатусаСогласования", ПараметрыОповещения);
КонецПроцедуры

&ИзменениеИКонтроль("ВыбратьСтатус")
Процедура гкс_ВыбратьСтатус(РезультатВопроса, ДополнительныеПараметры)

	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;	
	КонецЕсли;

	СписокСледующихСтатусов = ДополнительныеПараметры.СписокСледующихСтатусов;
	Форма = ДополнительныеПараметры.Форма;

	Если СписокСледующихСтатусов.Количество() > 0 Тогда
		ВыделенныйСтатус = Неопределено;
		ТекущиеДанныеДерева = Форма.Элементы.ДеревоСогласования.ТекущиеДанные;
		Если ТекущиеДанныеДерева <> Неопределено Тогда
			ВыделенныйСтатус = ТекущиеДанныеДерева.СтатусДокумента;
		КонецЕсли;

		ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьСтатусЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ПараметрыФормы = Новый Структура("СписокСледующихСтатусов, ВыделенныйСтатус", СписокСледующихСтатусов, ВыделенныйСтатус);
		#Вставка
		Если ДополнительныеПараметры.Свойство("СтатусыСКомментарием") Тогда 
			ПараметрыФормы.Вставить("СтатусыСКомментарием", ДополнительныеПараметры.СтатусыСКомментарием);
		КонецЕсли;
		#КонецВставки
		ОткрытьФорму("ОбщаяФорма.торо_ФормаВыбораСтатусаСогласования", ПараметрыФормы, Форма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;

КонецПроцедуры

&ИзменениеИКонтроль("УстановитьСтатус")
Процедура гкс_УстановитьСтатус(Форма)

	Объект = Форма.Объект;
	Если Форма.мХранитьИсториюСогласованияВДокументах И Не торо_ОбщегоНазначенияКлиентПовтИсп.ЕстьПраво("Редактирование", "Документы", Сред(Форма.ИмяФормы, 10, Найти(Форма.ИмяФормы, ".Фор") - 10)) Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("es='¡Es insuficientemente derecho para la redacción del documento!';ru='Недостаточно прав для редактирования документа!';en='Not enough rights to edit the document!'"));
	Иначе
		Если Объект.Ссылка.пустая() ИЛИ Форма.Модифицированность Тогда
			ПоказатьВопрос(Новый ОписаниеОповещения("ОбработатьВопрос_ЗаписатьДокумент", ЭтотОбъект, Новый Структура("Форма", Форма)), НСтр("es='¡Ante la ejecución del procedimiento de la coordinación es necesario anotar el documento! ¿Anotar?';ru='Перед выполнением процедуры согласования необходимо записать документ! Записать?';en='Before performing the approval procedure, you must write down a document! To record?'"), РежимДиалогаВопрос.ДаНет, 60); 
		Иначе
			Если Форма.Объект.ПометкаУдаления Тогда
				ПоказатьПредупреждение(Неопределено, НСтр("es='¡El documento es marcado a la desaparición! ¡La coordinación de los documentos, marcados a la desaparición, es prohíbida!';ru='Документ помечен на удаление! Согласование помеченных на удаление документов запрещено!';en='Document marked for deletion! Coordination of documents marked for deletion is prohibited!'"));
				Возврат;	
			КонецЕсли;

			ТекущийПользователь = Пользователи.ТекущийПользователь();
			СписокСледующихСтатусов = торо_РаботаССогласованиями.ПолучитьСписокСледующихСтатусовДокумента(Объект.СпособСогласования, Форма.СтатусДокументаРегистр);
			#Удаление
			ПоказатьВопрос(Новый ОписаниеОповещения("ВыбратьСтатус", ЭтотОбъект, Новый Структура("СписокСледующихСтатусов, ТекущийПользователь, Форма", СписокСледующихСтатусов, ТекущийПользователь, Форма)), НСтр("es='¿Afirmar el estatus?';ru='Утвердить статус?';en='Approve status?'"), РежимДиалогаВопрос.ДаНет);
			#КонецУдаления
			#Вставка
			СтатусыСКомментарием = торо_РаботаССогласованиями.гкс_ПолучитьСтатусыСКомментарием(Объект.СпособСогласования, Форма.СтатусДокументаРегистр);
			ПоказатьВопрос(Новый ОписаниеОповещения("ВыбратьСтатус", ЭтотОбъект,
				Новый Структура("СписокСледующихСтатусов, ТекущийПользователь, Форма, СтатусыСКомментарием",
				СписокСледующихСтатусов, ТекущийПользователь, Форма, СтатусыСКомментарием)),
				НСтр("es='¿Afirmar el estatus?';ru='Утвердить статус?';en='Approve status?'"), РежимДиалогаВопрос.ДаНет);
			#КонецВставки
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&ИзменениеИКонтроль("ОбработатьВопрос_ЗаписатьДокумент")
Процедура гкс_ОбработатьВопрос_ЗаписатьДокумент(РезультатВопроса, ДополнительныеПараметры)

	Форма = ДополнительныеПараметры.Форма;
	Объект = Форма.Объект;

	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Попытка
			Форма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
		Исключение
			ТекстСообщения = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации(НСтр("es='La excepción';ru='Исключение';en='An exception'"), "Предупреждение", ОписаниеОшибки());
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецПопытки; 

		ТекущийПользователь = торо_РаботаСУведомлениями.ПолучитьТекущегоПользователя();
		СписокСледующихСтатусов = торо_РаботаССогласованиями.ПолучитьСписокСледующихСтатусовДокумента(Объект.СпособСогласования, Форма.СтатусДокументаРегистр);
		#Удаление
		ПоказатьВопрос(Новый ОписаниеОповещения("ВыбратьСтатус", ЭтотОбъект, Новый Структура("СписокСледующихСтатусов, ТекущийПользователь, Форма", СписокСледующихСтатусов, ТекущийПользователь, Форма)), НСтр("es='¿Afirmar el estatus?';ru='Утвердить статус?';en='Approve status?'"), РежимДиалогаВопрос.ДаНет);
		#КонецУдаления
		#Вставка
		СтатусыСКомментарием = торо_РаботаССогласованиями.гкс_ПолучитьСтатусыСКомментарием(Объект.СпособСогласования, Форма.СтатусДокументаРегистр);
		ПоказатьВопрос(Новый ОписаниеОповещения("ВыбратьСтатус", ЭтотОбъект,
			Новый Структура("СписокСледующихСтатусов, ТекущийПользователь, Форма, СтатусыСКомментарием",
			СписокСледующихСтатусов, ТекущийПользователь, Форма, СтатусыСКомментарием)),
			НСтр("es='¿Afirmar el estatus?';ru='Утвердить статус?';en='Approve status?'"), РежимДиалогаВопрос.ДаНет);
		#КонецВставки
	КонецЕсли;

КонецПроцедуры
