#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СтруктураИерархии") И ЗначениеЗаполнено(Параметры.СтруктураИерархии) Тогда
		ТекСтруктураИерархии = Параметры.СтруктураИерархии;
	Иначе
		ТекСтруктураИерархии = Константы.торо_ИерархияДляВводаНовыхОР.Получить();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЭтоНовыйЭлемент = Истина;
		РодительИерархии = Параметры.РодительИерархии;
		Родитель = РодительИерархии;
	Иначе	
		Родитель = торо_РаботаСИерархией20.ПолучитьТекущегоРодителяВИерархии(Объект.Ссылка, ТекСтруктураИерархии,,Истина,Истина);
	КонецЕсли;
	
	Элементы.ФормаПечать.Видимость = Ложь;
	
	// >> [Деснол] [Ушаков А.Д.] [09.10.2019]
	дс_ПриСозданииНаСервере();
	// << [Деснол] [Ушаков А.Д.] [09.10.2019] 
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Попытка
			
			СсылкаНаОбъект = торо_ОбщегоНазначения.ПолучитьСсылкуНаОбъект(ТекущийОбъект);
			торо_РаботаСИерархией20.ВключитьНовыйОбъектРемонтаВИерархию(СсылкаНаОбъект, ТекСтруктураИерархии, РодительИерархии, Отказ, ТекущийОбъект.ОбменДанными.Загрузка);
			
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("es='La excepción';ru='Исключение';en='An exception'"), УровеньЖурналаРегистрации.Предупреждение, 
				Метаданные.Справочники.торо_ОбъектыРемонта,,ОписаниеОшибки());
			Отказ = Истина;
		КонецПопытки;
		
	КонецЕсли;
	
	// >> [Деснол] [Ушаков А.Д.] [09.10.2019]
	дс_ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	// << [Деснол] [Ушаков А.Д.] [09.10.2019] 
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Для обновления данных в дереве ОР.
	СтруктураРеквизитов = Новый Структура("Ссылка, ПометкаУдаления, Наименование", 
							Объект.Ссылка, Объект.ПометкаУдаления, Объект.Наименование);
							
	Если ЭтоНовыйЭлемент Тогда
		СтруктураРеквизитов.Вставить("ЭтоНовый", ЭтоНовыйЭлемент);						
		СтруктураРеквизитов.Вставить("СтруктураИерархии", ТекСтруктураИерархии);
		СтруктураРеквизитов.Вставить("РодительИерархии", РодительИерархии);
	КонецЕсли;
		
	Оповестить("ЗаписанОбъектРемонта", СтруктураРеквизитов, ЭтаФорма);
	
КонецПроцедуры

// >> [Деснол] [Ушаков А.Д.] [10.10.2019] 
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	торо_ЛокализацияСобытияФорм.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
КонецПроцедуры
// << [Деснол] [Ушаков А.Д.] [10.10.2019] 

#КонецОбласти

// >> [Деснол] [Ушаков А.Д.] [09.10.2019] 
#Область Локализация

&НаКлиенте
Процедура дс_НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	торо_ЛокализацияКлиент.НачалоВыбора(ЭтаФорма, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура дс_ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	торо_ЛокализацияКлиент.ОбработкаВыбора(ЭтаФорма, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура дс_ПриСозданииНаСервере()
	СтроковыеРеквизиты = "Наименование,Комментарий";
	торо_ЛокализацияСобытияФорм.ПриСоздании(ЭтаФорма, СтроковыеРеквизиты);
КонецПроцедуры 

&НаСервере
Процедура дс_ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи)
	торо_ЛокализацияСобытияФорм.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
КонецПроцедуры 

#КонецОбласти 
// << [Деснол] [Ушаков А.Д.] [09.10.2019] 

