///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий подсистем конфигурации.

// См. ОбщегоНазначенияПереопределяемый.ПриДобавленииПереименованийОбъектовМетаданных.
Процедура ПриДобавленииПереименованийОбъектовМетаданных(Итог) Экспорт
	
	Библиотека = "СтандартныеПодсистемы";
	
	ОбщегоНазначения.ДобавитьПереименование(Итог,
		"2.2.1.12",
		"Подсистема.НастройкаИАдминистрирование",
		"Подсистема.Администрирование",
		Библиотека);
	
КонецПроцедуры

// Определяет разделы, в которых доступна панель отчетов.
//   Подробнее - см. описание процедуры ИспользуемыеРазделы
//   общего модуля ВариантыОтчетов.
//
Процедура ПриОпределенииРазделовСВариантамиОтчетов(Разделы) Экспорт
	
  Разделы.Добавить(Метаданные.Подсистемы.торо_НастройкаИАдминистрирование, НСтр("es='Los informes del administrador';ru='Отчеты администратора';en='Admin reports'"));
    
КонецПроцедуры

// См. ДополнительныеОтчетыИОбработкиПереопределяемый.ОпределитьРазделыСДополнительнымиОтчетами.
Процедура ПриОпределенииРазделовСДополнительнымиОтчетами(Разделы) Экспорт
	
	Разделы.Добавить(Метаданные.Подсистемы.торо_УчетОборудованияИНормативов);
	Разделы.Добавить(Метаданные.Подсистемы.торо_МТО);
	Разделы.Добавить(Метаданные.Подсистемы.торо_НастройкаИАдминистрирование);
	Разделы.Добавить(Метаданные.Подсистемы.торо_НормативноСправочнаяИнформация);
	Разделы.Добавить(Метаданные.Подсистемы.торо_ПланированиеТОиР);
	Разделы.Добавить(Метаданные.Подсистемы.торо_УчетПоказателейЭксплуатации);
	Разделы.Добавить(Метаданные.Подсистемы.торо_УправлениеНарядамиИРаботами);
	Разделы.Добавить(ДополнительныеОтчетыИОбработкиКлиентСервер.ИмяНачальнойСтраницы());
	
КонецПроцедуры

// См. ДополнительныеОтчетыИОбработкиПереопределяемый.ОпределитьРазделыСДополнительнымиОбработками.
Процедура ПриОпределенииРазделовСДополнительнымиОбработками(Разделы) Экспорт
	
	Разделы.Добавить(Метаданные.Подсистемы.торо_УчетОборудованияИНормативов);
	Разделы.Добавить(Метаданные.Подсистемы.торо_МТО);
	Разделы.Добавить(Метаданные.Подсистемы.торо_НастройкаИАдминистрирование);
	Разделы.Добавить(Метаданные.Подсистемы.торо_НормативноСправочнаяИнформация);
	Разделы.Добавить(Метаданные.Подсистемы.торо_ПланированиеТОиР);
	Разделы.Добавить(Метаданные.Подсистемы.торо_УчетПоказателейЭксплуатации);
	Разделы.Добавить(Метаданные.Подсистемы.торо_УправлениеНарядамиИРаботами);
	Разделы.Добавить(ДополнительныеОтчетыИОбработкиКлиентСервер.ИмяНачальнойСтраницы());
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
