#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция - Проверить зацикливание зависимых остановочных.
//
// Параметры:
//  ВР	 - СправочникСсылка.торо_ВидыРемонта - Вид ремонта проверяемый на зацикливание. 
//  ВыбранныйВР	 - СправочникСсылка.торо_ВидыРемонта - Выбранный вид ремонта. 
//  ОР	 - СправочникСсылка.торо_ОбъектыРемонта - Объект ремонта проверяемый на зацикливание.
//  ВыбранныйОР	 - СправочникСсылка.торо_ОбъектыРемонта - Выбранный объект ремонта.
//  Основной - Булево - признак, что выбирается основной или связанный ОР.
//  ТабДляПроверки - ТаблицаЗначений - таблица для проверки зацикливания.
// Возвращаемое значение:
//  Булево - Истина - происходит зацикливание, Ложь - зацикливания не происходит.
Функция ПроверитьЗацикливаниеЗависимыхОстановочных(ВР, ВыбранныйВР, ОР, ВыбранныйОР, Основной, ТабДляПроверки) Экспорт 	
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	&ОбъектРемонта КАК %ВыбираемыйОР%,
	|	&ВидРемонта КАК %ВыбираемыйВР%";
	
	Если Основной Тогда
		ВыбираемыйОР 	= "ОсновнойОбъектРемонта";
		ВыбираемыйВР 	= "ВидРемонтаОсновногоОбъекта";
		
	Иначе
		ВыбираемыйОР 	= "СвязанныйОбъектРемонта";
		ВыбираемыйВР 	= "ВидРемонтаЗависимогоОбъекта";
		
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ВыбираемыйОР%", ВыбираемыйОР);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ВыбираемыйВР%", ВыбираемыйВР);
		
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ОбъектРемонта", ВыбранныйОР);
	Запрос.УстановитьПараметр("ВидРемонта", ВыбранныйВР);
	
	Зависимые = Запрос.Выполнить().Выгрузить();
	
	Если Зависимые.НайтиСтроки(Новый Структура(ВыбираемыйОР + ", " + ВыбираемыйВР, ОР, ВР)).Количество() > 0
		ИЛИ Зависимые.НайтиСтроки(Новый Структура(ВыбираемыйОР + ", " + ВыбираемыйВР, ОР, Справочники.торо_ВидыРемонтов.ПустаяСсылка())).Количество() > 0
		ИЛИ ТабДляПроверки.НайтиСтроки(Новый Структура("ОбъектРемонта, " + ВыбираемыйВР, ВыбранныйОР, ВР)).Количество() > 0
		ИЛИ ТабДляПроверки.НайтиСтроки(Новый Структура("ОбъектРемонта, " + ВыбираемыйВР, ВыбранныйОР, Справочники.торо_ВидыРемонтов.ПустаяСсылка())).Количество() > 0 Тогда
		Возврат Истина;
	Иначе
		Возврат ПроверитьЗацикливаниеЗависимыхОстановочныхРек(Зависимые, ОР, ВР, Основной, ТабДляПроверки);
	КонецЕсли;
	
КонецФункции

// Вычисляет текущее значение наработки объекта ремонта.
//
// Параметры:
//  Ссылка								 - СправочникСсылка.торо_ОбъектыРемонта - объект ремонта.
//  ПараметрНаработки				 - СправочникСсылка.ПараметрыВыработкиОС - показатель наработки.
//  УчитыватьПростоиОборудования	 - Булево - флаг учета простоев.
// 
// Возвращаемое значение:
//  Число, Неопределено - значение наработки или Неопределено.
//
Функция ВычислитьТекущееЗначениеНаработки(Ссылка, ПараметрНаработки, УчитыватьПростоиОборудования) Экспорт
	ТекДата = ТекущаяДата();
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВт;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_НаработкаОбъектовРемонта.ОбъектРемонта,
	|	торо_НаработкаОбъектовРемонта.Показатель,
	|	торо_НаработкаОбъектовРемонта.Наработка,
	|	ВЫБОР
	|		КОГДА торо_НаработкаОбъектовРемонта.ДатаНач = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА торо_НаработкаОбъектовРемонта.ОбъектРемонта.ДатаВводаВЭксплуатацию
	|		ИНАЧЕ торо_НаработкаОбъектовРемонта.ДатаНач
	|	КОНЕЦ КАК ФактДатаНач,
	|	торо_НаработкаОбъектовРемонта.ДатаКон КАК ФактДатаКон,
	|	&ДатаСреза КАК ДатаКон,
	|	торо_НаработкаОбъектовРемонта.ОбъектРемонта.ПлановыйГрафикРаботы КАК ГрафикРемонтныхРабот,
	|	торо_НаработкаОбъектовРемонта.ОбъектРемонта.ДатавводаВЭксплуатацию КАК ДатаНач
	|ПОМЕСТИТЬ ТабНаработки
	|ИЗ
	|	РегистрНакопления.торо_НаработкаОбъектовРемонта КАК торо_НаработкаОбъектовРемонта
	|ГДЕ
	|	торо_НаработкаОбъектовРемонта.ОбъектРемонта = &ОбъектРемонта
	|	И торо_НаработкаОбъектовРемонта.Показатель = &Показатель
	|	И торо_НаработкаОбъектовРемонта.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТабНаработки.ОбъектРемонта КАК Объект,
	|	ТабНаработки.Показатель,
	|	МАКСИМУМ(ТабНаработки.ФактДатаКон) КАК ДатаРаботыС,
	|	&ДатаСреза КАК ДатаРаботыПо,
	|	ТабНаработки.ГрафикРемонтныхРабот
	|ИЗ
	|	ТабНаработки КАК ТабНаработки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТабНаработки.ОбъектРемонта,
	|	ТабНаработки.Показатель,
	|	ТабНаработки.ГрафикРемонтныхРабот";
	
	Запрос.УстановитьПараметр("ДатаСреза", ТекДата);
	Запрос.УстановитьПараметр("ОбъектРемонта", Ссылка);
	Запрос.УстановитьПараметр("Показатель", ПараметрНаработки);
	
	Результат = Запрос.Выполнить();
	
	ТаблЗнач = Результат.Выгрузить();
	
	ТаблицаДанных = торо_РаботаСНаработкой.ПолучитьИнтервалыРасчетаПлановойНаработки(ТаблЗнач, ТекущаяДата(), УчитыватьПростоиОборудования); 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТабСНаработкой.ОбъектРемонта,
	|	ТабСНаработкой.Показатель,
	|	ТабСНаработкой.ДатаРаботыС,
	|	ТабСНаработкой.ДатаРаботыПо,
	|	ТабСНаработкой.ДатаНачала,
	|	ТабСНаработкой.ДатаОкончания,
	|	ТабСНаработкой.ПериодПлановойНаработки,
	|	ТабСНаработкой.ПродолжительностьПериодаПлановойНаработки,
	|	ТабСНаработкой.КоэффициентИспользованияОборудования,
	|	ТабСНаработкой.ПлановаяНаработка,
	|	ТабСНаработкой.ФактическаяНаработка
	|ПОМЕСТИТЬ ТабСНаработкой
	|ИЗ
	|	&ТабСНаработкой КАК ТабСНаработкой
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабСНаработкой.ОбъектРемонта,
	|	ТабСНаработкой.Показатель,
	|	ТабСНаработкой.ДатаРаботыС,
	|	ТабСНаработкой.ДатаРаботыПо,
	|	ТабСНаработкой.ДатаНачала,
	|	ТабСНаработкой.ДатаОкончания,
	|	ТабСНаработкой.ПериодПлановойНаработки,
	|	ТабСНаработкой.ПродолжительностьПериодаПлановойНаработки,
	|	ТабСНаработкой.КоэффициентИспользованияОборудования,
	|	ТабСНаработкой.ПлановаяНаработка,
	|	ТабСНаработкой.ФактическаяНаработка,
	|	Итог.ГрафикРемонтныхРабот КАК ПлановыйГрафикРаботы
	|ИЗ
	|	ТабСНаработкой КАК ТабСНаработкой
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабНаработки КАК Итог
	|		ПО ТабСНаработкой.ОбъектРемонта = Итог.ОбъектРемонта
	|			И ТабСНаработкой.Показатель = Итог.Показатель";
	
	Запрос.УстановитьПараметр("ТабСНаработкой", ТаблицаДанных);
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	ВариантыПериодов = ТаблицаДанных.Скопировать(,"ПериодПлановойНаработки");
	ВариантыПериодов.Свернуть("ПериодПлановойНаработки",);
	Для Каждого Период Из ВариантыПериодов Цикл
		ТаблицаСПериодом = ТаблицаДанных.Скопировать(Новый Структура("ПериодПлановойНаработки",Период.ПериодПлановойНаработки));
		ТаблицаСНаработкой = торо_РаботаСНаработкой.РасчитатьВремяРаботыОР(ТаблицаСПериодом,Период.ПериодПлановойНаработки);
		Для Каждого ЗаписьСНаработкой Из ТаблицаСНаработкой Цикл
			МассивСтрок = ТаблицаДанных.НайтиСтроки(Новый Структура("ОбъектРемонта,ДатаНачала,ДатаОкончания,Показатель",
			ЗаписьСНаработкой.ОбъектРемонта,ЗаписьСНаработкой.ДатаНачала,ЗаписьСНаработкой.ДатаОкончания,ЗаписьСНаработкой.Показатель));
			
			
			Для Каждого Строка Из МассивСтрок Цикл
				Строка.ФактическаяНаработка = Строка.ФактическаяНаработка 
				+ ЗаписьСНаработкой.Секунды / ?(Строка.ПродолжительностьПериодаПлановойНаработки = 0,1,Строка.ПродолжительностьПериодаПлановойНаработки) 
				* Строка.КоэффициентИспользованияОборудования * Строка.ПлановаяНаработка;									
			КонецЦикла;
			
		КонецЦикла;
	КонецЦикла;
	
	ТаблДанных = ТаблицаДанных.Скопировать(,"ОбъектРемонта, Показатель, ДатаРаботыС, ДатаРаботыПо, ПлановыйГрафикРаботы, ФактическаяНаработка"); 
	ТаблДанных.Свернуть("ОбъектРемонта, Показатель, ДатаРаботыС, ДатаРаботыПо, ПлановыйГрафикРаботы","ФактическаяНаработка");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПериодыФактичНаработки.ОбъектРемонта,
	|	ПериодыФактичНаработки.Показатель,
	|	ПериодыФактичНаработки.Наработка * 3600 КАК Наработка,
	|	ВЫБОР
	|		КОГДА ПериодыФактичНаработки.ДатаКон <= ПериодыФактичНаработки.ФактДатаКон
	|				И ПериодыФактичНаработки.ДатаНач >= ПериодыФактичНаработки.ФактДатаНач
	|			ТОГДА РАЗНОСТЬДАТ(ПериодыФактичНаработки.ДатаНач, ПериодыФактичНаработки.ДатаКон, СЕКУНДА)
	|		КОГДА ПериодыФактичНаработки.ДатаКон >= ПериодыФактичНаработки.ФактДатаКон
	|				И ПериодыФактичНаработки.ДатаНач <= ПериодыФактичНаработки.ФактДатаНач
	|			ТОГДА РАЗНОСТЬДАТ(ПериодыФактичНаработки.ФактДатаНач, ПериодыФактичНаработки.ФактДатаКон, СЕКУНДА)
	|		КОГДА ПериодыФактичНаработки.ДатаКон >= ПериодыФактичНаработки.ФактДатаКон
	|				И ПериодыФактичНаработки.ДатаНач >= ПериодыФактичНаработки.ФактДатаНач
	|			ТОГДА РАЗНОСТЬДАТ(ПериодыФактичНаработки.ДатаНач, ПериодыФактичНаработки.ФактДатаКон, СЕКУНДА)
	|		КОГДА ПериодыФактичНаработки.ДатаКон <= ПериодыФактичНаработки.ФактДатаКон
	|				И ПериодыФактичНаработки.ДатаНач <= ПериодыФактичНаработки.ФактДатаНач
	|			ТОГДА РАЗНОСТЬДАТ(ПериодыФактичНаработки.ФактДатаНач, ПериодыФактичНаработки.ДатаКон, СЕКУНДА)
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК Секунды,
	|	РАЗНОСТЬДАТ(ПериодыФактичНаработки.ФактДатаНач, ПериодыФактичНаработки.ФактДатаКон, СЕКУНДА) КАК СекундыКонецНачало,
	|	ПериодыФактичНаработки.ДатаНач
	|ПОМЕСТИТЬ ТабСекунды
	|ИЗ
	|	ТабНаработки КАК ПериодыФактичНаработки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабСекунды.ОбъектРемонта,
	|	ТабСекунды.Показатель,
	|	ВЫБОР
	|		КОГДА НЕ ТабСекунды.Секунды ЕСТЬ NULL 
	|			ТОГДА ТабСекунды.Наработка * ТабСекунды.Секунды / ТабСекунды.СекундыКонецНачало / 3600
	|		ИНАЧЕ ТабСекунды.Наработка / 3600
	|	КОНЕЦ КАК ФактНаработка,
	|	ТабСекунды.ДатаНач
	|ПОМЕСТИТЬ ФактическаяНаработка
	|ИЗ
	|	ТабСекунды КАК ТабСекунды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабПланНаработки.ОбъектРемонта,
	|	ТабПланНаработки.Показатель,
	|	ТабПланНаработки.ДатаРаботыС,
	|	ТабПланНаработки.ДатаРаботыПо,
	|	ТабПланНаработки.ФактическаяНаработка
	|ПОМЕСТИТЬ ПлановаяНаработка
	|ИЗ
	|	&ТабПланНаработки КАК ТабПланНаработки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФактическаяНаработка.ОбъектРемонта,
	|	ФактическаяНаработка.Показатель,
	|	ФактическаяНаработка.ФактНаработка,
	|	ФактическаяНаработка.ДатаНач
	|ПОМЕСТИТЬ ОбъединениеФактПлан
	|ИЗ
	|	ФактическаяНаработка КАК ФактическаяНаработка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПланНаработкаСВидами.ОбъектРемонта,
	|	ПланНаработкаСВидами.Показатель,
	|	ПланНаработкаСВидами.ФактическаяНаработка,
	|	ПланНаработкаСВидами.ДатаРаботыС КАК ДатаОкончания
	|ИЗ
	|	ПлановаяНаработка КАК ПланНаработкаСВидами
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъединениеФактПлан.ОбъектРемонта КАК ОбъектРемонта,
	|	ОбъединениеФактПлан.Показатель,
	|	СУММА(ОбъединениеФактПлан.ФактНаработка) КАК Наработка
	|ИЗ
	|	ОбъединениеФактПлан КАК ОбъединениеФактПлан
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбъединениеФактПлан.ОбъектРемонта,
	|	ОбъединениеФактПлан.Показатель";
	
	Запрос.УстановитьПараметр("ТабПланНаработки", ТаблДанных);
	Запрос.УстановитьПараметр("ДатаСреза",ТекДата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МенеджерВТ.Закрыть();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Наработка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	ФорматнаяСтрока = торо_РаботаСПользовательскимПредставлениемПовтИсп.ПолучитьФорматнуюСтроку("Справочники.торо_ОбъектыРемонта");
	Если ФорматнаяСтрока = Неопределено Тогда
		Возврат;
	Иначе
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	СписокПолей = торо_РаботаСПользовательскимПредставлением.ПолучитьСписокПолей(ФорматнаяСтрока);
	
	Для Каждого Поле Из СписокПолей Цикл
		
		Поля.Добавить(Поле);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	ФорматнаяСтрока = торо_РаботаСПользовательскимПредставлениемПовтИсп.ПолучитьФорматнуюСтроку("Справочники.торо_ОбъектыРемонта");
	Если ФорматнаяСтрока = Неопределено Тогда
		Возврат;
	Иначе
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	Представление = торо_РаботаСПользовательскимПредставлением.ПолучитьПредставлениеПоФорматнойСтроке(ФорматнаяСтрока,Данные);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьРассчитываемыйКоэффициент(ВозрастОборудования, Владелец) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_ЗначенияКоэффициентовРемонтныхОсобенностей.Ссылка,
	|	торо_ЗначенияКоэффициентовРемонтныхОсобенностей.Коэффициент,
	|	торо_ЗначенияКоэффициентовРемонтныхОсобенностей.ВозрастОборудования КАК ВозрастОборудования
	|ИЗ
	|	Справочник.торо_ЗначенияКоэффициентовРемонтныхОсобенностей КАК торо_ЗначенияКоэффициентовРемонтныхОсобенностей
	|ГДЕ
	|	торо_ЗначенияКоэффициентовРемонтныхОсобенностей.Владелец = &Владелец
	|	И торо_ЗначенияКоэффициентовРемонтныхОсобенностей.ВозрастОборудования >= &ВозрастОборудования
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВозрастОборудования";
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("ВозрастОборудования", ВозрастОборудования);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Новый Структура("ЗначениеКоэффициента, Коэффициент",Выборка.Ссылка, Выборка.Коэффициент);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ВычислитьВремяРаботыОборудованияСУчетомГрафика(Ссылка, СчитатьВозрастОтДатыИзготовления) Экспорт
	
	Перем МинГод;
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	МассивГрафиков = Новый Массив;
	МассивГрафиков.Добавить(Ссылка.ПлановыйГрафикРаботы);
	Если СчитатьВозрастОтДатыИзготовления Тогда
		НачГод = Год(Ссылка.ДатаВыпуска);
	Иначе
		НачГод = Год(Ссылка.ДатаВводаВЭксплуатацию);
	КонецЕсли;
	
	КалендарныеГрафики.СоздатьВТРасписанияРаботыНаПериод(МенеджерВТ, МассивГрафиков, НачГод, ТекущаяДата());
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГОД(ВТРасписанияРаботы.ДатаГрафика) КАК ГодРаботы,
	|	СУММА(РАЗНОСТЬДАТ(ВТРасписанияРаботы.ВремяНачала, ВТРасписанияРаботы.ВремяОкончания, СЕКУНДА)) КАК ОсновноеЗначение,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТРасписанияРаботы.ДатаГрафика) КАК КоличествоРабочихДней
	|ПОМЕСТИТЬ ВТРасписанияРаботыИзм
	|ИЗ
	|	ВТРасписанияРаботы КАК ВТРасписанияРаботы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТРасписанияРаботы.ГрафикРаботы,
	|	ГОД(ВТРасписанияРаботы.ДатаГрафика)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРасписанияРаботыИзм.ГодРаботы,
	|	ВТРасписанияРаботыИзм.ОсновноеЗначение,
	|	ВТРасписанияРаботыИзм.КоличествоРабочихДней
	|ИЗ
	|	ВТРасписанияРаботыИзм КАК ВТРасписанияРаботыИзм
	|ГДЕ
	|	ВТРасписанияРаботыИзм.ОсновноеЗначение > 0";
	
	
	ТабРезультат = Запрос.Выполнить().Выгрузить();
	
	КолРабДней = 0;
	
	Для каждого СтрокаТаб Из ТабРезультат Цикл
		
		КолРабДней = КолРабДней + СтрокаТаб.КоличествоРабочихДней;
		
	КонецЦикла;
	
	Если ТабРезультат.Количество() > 0 Тогда
		МинГод = ТабРезультат[0].ГодРаботы;
	КонецЕсли;
	
	Если МинГод = Неопределено Тогда
		ВозрастОборудования = Год(ТекущаяДата()) - Год(НачГод) + 1;
	Иначе
		ВозрастОборудования = МинГод - НачГод + КолРабДней / 365;
	КонецЕсли;
	
	Возврат ВозрастОборудования;
	
КонецФункции

// Заполняет список команд печати.
//
// Параметры:
// КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Паспорт объекта ремонта
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Справочник.торо_ОбъектыРемонта";
	КомандаПечати.Идентификатор = "ПаспортОР";
	КомандаПечати.Представление = НСтр("ru = 'Паспорт объекта ремонта'");
	КомандаПечати.Обработчик = "торо_Печать.ЗапроситьДопПараметрыПечатиОР";
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	
КонецПроцедуры

// Формирует печатные формы
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной
//                                                            параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной
//                                            параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПаспортОР") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"ПаспортОР", 
		"Паспорт объекта ремонта", 
		ПечатьПаспортаОР(МассивОбъектов, ПараметрыПечати));
	КонецЕсли;
	
КонецПроцедуры

// Функция - заполняет список реквизитов, которые можно использовать при формировании форматной строки в конструкторе.
//
// Параметры:
//  СписокРеквизитов - СписокЗначений - пустой список значений для заполнения.
Процедура ЗаполнитьСписокРеквизитовДляФорматнойСтроки(СписокРеквизитов) Экспорт
	
	СписокРеквизитов.Добавить("Наименование",			"Наименование");
	СписокРеквизитов.Добавить("Код",					"Код");
	СписокРеквизитов.Добавить("АдресМестонахождения",	"Адрес местонахождения");
	СписокРеквизитов.Добавить("ДатаВводаВЭксплуатацию",	"Дата ввода в эксплуатацию");
	СписокРеквизитов.Добавить("ДатаВыпуска",			"Дата выпуска (постройки)");
	СписокРеквизитов.Добавить("ЗаводскойНомер",			"Заводской №");
	СписокРеквизитов.Добавить("Изготовитель",			"Изготовитель");
	СписокРеквизитов.Добавить("ИнвентарныйНомер",		"Инвентарный №");
	СписокРеквизитов.Добавить("Контрагент",				"Контрагент");	
	СписокРеквизитов.Добавить("Направление",			"Направление");
	СписокРеквизитов.Добавить("КодПоОКОФ",				"Код по ОКОФ");
	СписокРеквизитов.Добавить("НомерПаспорта",			"Номер паспорта (регистрационный)");
	СписокРеквизитов.Добавить("Организация",			"Организация");
	СписокРеквизитов.Добавить("ПлановыйГрафикРаботы",	"Плановый график работы");
	СписокРеквизитов.Добавить("Подразделение",			"Подразделение");
	СписокРеквизитов.Добавить("Приоритет",				"Приоритет");
	СписокРеквизитов.Добавить("ТекСтатусВУчете",		"Текущий статус в учете");
	СписокРеквизитов.Добавить("ТехНомер",				"Технологический №");
	СписокРеквизитов.Добавить("ТиповойОР",				"Типовой ОР");
	СписокРеквизитов.Добавить("Комментарий",			"Комментарий");
	
КонецПроцедуры

Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	Настройки.ПриПолученииСлужебныхРеквизитов = Истина;
	
КонецПроцедуры

Процедура ПриПолученииСлужебныхРеквизитов(Реквизиты) Экспорт
	
	Реквизиты.Добавить("НаборСвойств");
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ФОИспользоватьДокументыЖЦОборудования = ПолучитьФункциональнуюОпцию("торо_ИспользоватьДокументыПринятияИСписанияОборудования");
	
	Если ФОИспользоватьДокументыЖЦОборудования Тогда
		
		Если Параметры.Отбор.Свойство("Документ") И ЗначениеЗаполнено(Параметры.Отбор.Документ) Тогда
			
			Документ = Параметры.Отбор.Документ;
			
			ИсключитьНепринятые = (Документ = "Состояния объектов ремонта"
						ИЛИ Документ = "Учет наработки оборудования"
						ИЛИ Документ = "Ввод начальных данных");
						
			МассивДоступныхСтатусов = торо_СтатусыОРВУчете.СписокСтатусовДляПодбора(ИсключитьНепринятые);
			
			Если Документ = "Выявленные дефекты_ОтказавшийЭлемент" Тогда
				
				СтруктураИерархии = Параметры.Отбор.ТекСтруктураИерархии;
				ОбъектРемонта     = Параметры.Отбор.ОбъектРемонта;
				
				Запрос = Новый Запрос;
				Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
				
				СтруктураПараметровИерархии = Новый Структура("ТекСтруктураИерархии, ИзменяетсяДокументами", СтруктураИерархии, СтруктураИерархии.ИзменяетсяДокументами);
				торо_РаботаСИерархией20.СоздатьВременнуюТаблицуИерархии(Запрос.МенеджерВременныхТаблиц, СтруктураПараметровИерархии, "ОбъектИерархии");
				
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	СписокОбъектовРемонта.ОбъектИерархии,
				|	СписокОбъектовРемонта.РодительИерархии,
				|	ВЫБОР
				|		КОГДА НЕ СписокОбъектовРемонта.ОбъектИерархии.ЭтоГруппа
				|			ТОГДА ЕСТЬNULL(торо_СтатусыОбъектовРемонтаВУчете.СтатусОР, ЗНАЧЕНИЕ(Перечисление.торо_СтатусыОРВУчете.НеПринятоКУчету))
				|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.торо_СтатусыОРВУчете.ПустаяСсылка)
				|	КОНЕЦ КАК СтатусВУчете
				|ИЗ
				|	ВТ_Иерархия КАК СписокОбъектовРемонта
				|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			торо_СтатусыОбъектовРемонтаВУчете.ОбъектРемонта КАК ОбъектРемонта,
				|			МАКСИМУМ(торо_СтатусыОбъектовРемонтаВУчете.Период) КАК Период
				|		ИЗ
				|			РегистрСведений.торо_СтатусыОбъектовРемонтаВУчете КАК торо_СтатусыОбъектовРемонтаВУчете
				|		ГДЕ
				|			торо_СтатусыОбъектовРемонтаВУчете.ОбъектРемонта В
				|					(ВЫБРАТЬ
				|						СписокОбъектовРемонта.ОбъектИерархии КАК ОбъектРемонта
				|					ИЗ
				|						ВТ_Иерархия КАК СписокОбъектовРемонта)
				|		
				|		СГРУППИРОВАТЬ ПО
				|			торо_СтатусыОбъектовРемонтаВУчете.ОбъектРемонта) КАК ВложенныйЗапрос
				|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_СтатусыОбъектовРемонтаВУчете КАК торо_СтатусыОбъектовРемонтаВУчете
				|			ПО ВложенныйЗапрос.ОбъектРемонта = торо_СтатусыОбъектовРемонтаВУчете.ОбъектРемонта
				|				И ВложенныйЗапрос.Период = торо_СтатусыОбъектовРемонтаВУчете.Период
				|		ПО СписокОбъектовРемонта.ОбъектИерархии = ВложенныйЗапрос.ОбъектРемонта";
				
				Запрос.УстановитьПараметр("СтруктураИерархии", СтруктураИерархии);
				
				ТаблицаИерархии = Запрос.Выполнить().Выгрузить();
				ТаблицаИерархии.Индексы.Добавить("РодительИерархии");
				
				ДанныеВыбора = Новый СписокЗначений;
				ДобавитьЗначениеВДанныеВыбора(ДанныеВыбора, ОбъектРемонта);
				
				ЗаполнитьДанныеВыбора(ОбъектРемонта, ДанныеВыбора, ТаблицаИерархии, МассивДоступныхСтатусов, Параметры.СтрокаПоиска,ФОИспользоватьДокументыЖЦОборудования);
				
				СтандартнаяОбработка = Ложь;
				
			Иначе	
				
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	торо_ОбъектыРемонта.Ссылка КАК Ссылка,
				|	торо_ОбъектыРемонта.Код КАК Код
				|ПОМЕСТИТЬ ОбъектыРемонта
				|ИЗ
				|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
				|ГДЕ
				|	торо_ОбъектыРемонта.Наименование ПОДОБНО &Наименование
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	МАКСИМУМ(торо_СтатусыОбъектовРемонтаВУчете.Период) КАК Период,
				|	ОбъектыРемонта.Ссылка КАК Ссылка
				|ПОМЕСТИТЬ ПоследниеДатыСтатусовПоОбъектамРемонта
				|ИЗ
				|	ОбъектыРемонта КАК ОбъектыРемонта
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_СтатусыОбъектовРемонтаВУчете КАК торо_СтатусыОбъектовРемонтаВУчете
				|		ПО ОбъектыРемонта.Ссылка = торо_СтатусыОбъектовРемонтаВУчете.ОбъектРемонта
				|
				|СГРУППИРОВАТЬ ПО
				|	ОбъектыРемонта.Ссылка
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ОбъектыРемонта.Ссылка,
				|	ОбъектыРемонта.Код
				|ИЗ
				|	ОбъектыРемонта КАК ОбъектыРемонта
				|		ЛЕВОЕ СОЕДИНЕНИЕ ПоследниеДатыСтатусовПоОбъектамРемонта КАК ПоследниеДатыСтатусовПоОбъектамРемонта
				|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_СтатусыОбъектовРемонтаВУчете КАК торо_СтатусыОбъектовРемонтаВУчете
				|			ПО ПоследниеДатыСтатусовПоОбъектамРемонта.Период = торо_СтатусыОбъектовРемонтаВУчете.Период
				|				И ПоследниеДатыСтатусовПоОбъектамРемонта.Ссылка = торо_СтатусыОбъектовРемонтаВУчете.ОбъектРемонта
				|		ПО ОбъектыРемонта.Ссылка = ПоследниеДатыСтатусовПоОбъектамРемонта.Ссылка
				|ГДЕ
				|	ЕСТЬNULL(торо_СтатусыОбъектовРемонтаВУчете.СтатусОР, ЗНАЧЕНИЕ(Перечисление.торо_СтатусыОРВучете.НеПринятоКУчету)) В (&СтатусОР)";
				Запрос.УстановитьПараметр("Наименование", "%"+Параметры.СтрокаПоиска+"%");
				Запрос.УстановитьПараметр("СтатусОР", МассивДоступныхСтатусов);
				Результат = Запрос.Выполнить();
				Выборка = Результат.Выбрать();
				
				ДанныеВыбора = Новый СписокЗначений;
				
				Пока Выборка.Следующий() Цикл
					
					ДанныеВыбора.Добавить(Выборка.Ссылка,Строка(Выборка.Ссылка) + " (" + Строка(Выборка.Код) + ")");
					
				КонецЦикла; 				
				СтандартнаяОбработка = Ложь;
				
			КонецЕсли; 
			
		КонецЕсли;
		
	Иначе
		Если Параметры.Отбор.Свойство("Документ") И ЗначениеЗаполнено(Параметры.Отбор.Документ) Тогда
			
			Документ = Параметры.Отбор.Документ;
			
			Если Документ = "Выявленные дефекты_ОтказавшийЭлемент" Тогда
				
				СтруктураИерархии = Параметры.Отбор.ТекСтруктураИерархии;
				ОбъектРемонта     = Параметры.Отбор.ОбъектРемонта;
				
				ТаблицаИерархии = торо_РаботаСИерархией20.ПолучитьТаблицуИерархии(СтруктураИерархии);
				ТаблицаИерархии.Индексы.Добавить("РодительИерархии");
				
				ДанныеВыбора = Новый СписокЗначений;
				ДобавитьЗначениеВДанныеВыбора(ДанныеВыбора, ОбъектРемонта);
				
				ЗаполнитьДанныеВыбора(ОбъектРемонта, ДанныеВыбора, ТаблицаИерархии, Новый Массив, Параметры.СтрокаПоиска,ФОИспользоватьДокументыЖЦОборудования);
				
				СтандартнаяОбработка = Ложь;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеВыбора(ОбъектРемонта, ДанныеВыбора, ТаблицаИерархии, МассивДоступныхСтатусов, ПодстрокаПоиска,ФОИспользоватьДокументыЖЦОборудования)
	
	ПараметрыПоиска = Новый Структура("РодительИерархии", ОбъектРемонта);
	МассивСтрок = ТаблицаИерархии.НайтиСтроки(ПараметрыПоиска);
	
	Если МассивСтрок.Количество() > 0 Тогда
		Для каждого Элемент Из МассивСтрок Цикл
			Если Не Элемент.ОбъектИерархии.ЭтоГруппа
				И Найти(НРег(Строка(Элемент.ОбъектИерархии)), НРег(ПодстрокаПоиска)) > 0 
				И (Не ФОИспользоватьДокументыЖЦОборудования ИЛИ Не МассивДоступныхСтатусов.Найти(Элемент.СтатусВУчете) = Неопределено) Тогда
				ДобавитьЗначениеВДанныеВыбора(ДанныеВыбора, Элемент.ОбъектИерархии);
			КонецЕсли; 
			ЗаполнитьДанныеВыбора(Элемент.ОбъектИерархии,ДанныеВыбора,ТаблицаИерархии,МассивДоступныхСтатусов,ПодстрокаПоиска,ФОИспользоватьДокументыЖЦОборудования);
		КонецЦикла; 
	КонецЕсли; 
	
КонецПроцедуры

Процедура ДобавитьЗначениеВДанныеВыбора(ДанныеВыбора, ОбъектРемонта)
	
	ДанныеВыбора.Добавить(ОбъектРемонта, Строка(ОбъектРемонта) + " (" + Строка(ОбъектРемонта.Код) + ")");
	
КонецПроцедуры

Функция ПроверитьЗацикливаниеЗависимыхОстановочныхРек(Основные, ОР, ВР, Основной, ТабДляПроверки)
	
	Если Основные.Количество() > 0 Тогда
		Запрос = Новый Запрос;
		ТекстЗапроса = "ВЫБРАТЬ
		|	торо_РемонтыОсновногоЗависимогоОборудования.%ВыбираемыйОР% КАК %ОтборПоОР%,
		|	торо_РемонтыОсновногоЗависимогоОборудования.%ВыбираемыйВР% КАК %ОтборПоВР%
		|ПОМЕСТИТЬ Основные
		|ИЗ
		|	&Основные КАК торо_РемонтыОсновногоЗависимогоОборудования
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_РемонтыОсновногоЗависимогоОборудования.%ВыбираемыйОР%,
		|	торо_РемонтыОсновногоЗависимогоОборудования.%ВыбираемыйВР%
		|ИЗ
		|	Основные КАК Основные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_РемонтыОсновногоЗависимогоОборудования КАК торо_РемонтыОсновногоЗависимогоОборудования
		|		ПО Основные.%ОтборПоОР% = торо_РемонтыОсновногоЗависимогоОборудования.%ОтборПоОР%
		|			И Основные.%ОтборПоВР% = торо_РемонтыОсновногоЗависимогоОборудования.%ОтборПоВР%
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_РемонтыОсновногоЗависимогоОборудования.%ВыбираемыйОР%,
		|	торо_РемонтыОсновногоЗависимогоОборудования.%ВыбираемыйВР%
		|ИЗ
		|	Основные КАК Основные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_РемонтыОсновногоЗависимогоОборудования КАК торо_РемонтыОсновногоЗависимогоОборудования
		|		ПО Основные.%ОтборПоОР% = торо_РемонтыОсновногоЗависимогоОборудования.%ОтборПоОР%
		|			И (торо_РемонтыОсновногоЗависимогоОборудования.%ОтборПоВР% = ЗНАЧЕНИЕ(Справочник.торо_ВидыРемонтов.ПустаяСсылка)
		|				ИЛИ Основные.%ОтборПоВР% = ЗНАЧЕНИЕ(Справочник.торо_ВидыРемонтов.ПустаяСсылка))";
		Запрос.УстановитьПараметр("Основные", Основные);
		
		Если Основной Тогда
			ВыбираемыйОР 	= "ОсновнойОбъектРемонта";
			ВыбираемыйВР 	= "ВидРемонтаОсновногоОбъекта";
			ОтборПоОР		= "СвязанныйОбъектРемонта";
			ОтборПоВР		= "ВидРемонтаЗависимогоОбъекта";
		Иначе
			ВыбираемыйОР 	= "СвязанныйОбъектРемонта";
			ВыбираемыйВР 	= "ВидРемонтаЗависимогоОбъекта";
			ОтборПоОР		= "ОсновнойОбъектРемонта";
			ОтборПоВР		= "ВидРемонтаОсновногоОбъекта";
		КонецЕсли;
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ВыбираемыйОР%", ВыбираемыйОР);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ВыбираемыйВР%", ВыбираемыйВР);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ОтборПоОР%", ОтборПоОР);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ОтборПоВР%", ОтборПоВР);
		
		Запрос.Текст = ТекстЗапроса;
		Зависимые = Запрос.Выполнить().Выгрузить();
		
		Если Зависимые.НайтиСтроки(Новый Структура(ВыбираемыйОР + ", " + ВыбираемыйВР, ОР, ВР)).Количество() > 0
			ИЛИ Зависимые.НайтиСтроки(Новый Структура(ВыбираемыйОР + ", " + ВыбираемыйВР, ОР, Справочники.торо_ВидыРемонтов.ПустаяСсылка())).Количество() > 0
			ИЛИ ТабДляПроверки.НайтиСтроки(Новый Структура("ОбъектРемонта, " + ВыбираемыйВР, ОР, ВР)).Количество() > 0 
			ИЛИ ТабДляПроверки.НайтиСтроки(Новый Структура("ОбъектРемонта, " + ВыбираемыйВР, ОР, Справочники.торо_ВидыРемонтов.ПустаяСсылка())).Количество() > 0 Тогда
			Возврат Истина;
		Иначе
			Если Зависимые.Количество() = 0 Тогда
				Возврат Ложь;
			КонецЕсли;
			
			// Устранение возможного бесконечного зацикливания, если объект ремонта выбран сам себе зависимым или главным.
			СтруктураПоиска = Новый Структура(ВыбираемыйОР + ", " + ВыбираемыйВР);
			Для Каждого Строка из Основные Цикл
				ЗаполнитьЗначенияСвойств(СтруктураПоиска, Строка);
				НайденныеСтроки = Зависимые.НайтиСтроки(СтруктураПоиска);
				Для каждого НайденнаяСтрока из НайденныеСтроки Цикл
					Зависимые.Удалить(НайденнаяСтрока);
				КонецЦикла;
			КонецЦикла;

			Возврат ПроверитьЗацикливаниеЗависимыхОстановочныхРек(Зависимые, ОР, ВР, Основной, ТабДляПроверки);
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#Область Печать

Функция ПечатьПаспортаОР(МассивОбъектов, ПараметрыПечати)
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.торо_ОбъектыРемонта.ПФ_MXL_ПаспортОР");
	ПечатаемыеРазделы = ПараметрыПечати.ПечатаемыеРазделы;
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	
	ЗаголовокИОсновныеДанные = ПолучитьВыборкуДляПечатиПаспортаОР(МассивОбъектов, ПараметрыПечати.ТекСтруктураИерархии);
	
	ЭтоПервый = Истина;
	
	Пока ЗаголовокИОсновныеДанные.Следующий() Цикл
		
		Если НЕ ЭтоПервый Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ЭтоПервый = Ложь;
		
		ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("Заголовок"),  ТабДок, ЗаголовокИОсновныеДанные);
		
		// Флаг основные
		Если ПечатаемыеРазделы.Свойство("ФлагОсновные") И ПечатаемыеРазделы.ФлагОсновные = Истина Тогда
			ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ГлОсновные"), ТабДок);
			ДатаСнятия = ПолучитьДатуСнятияСУчета(МассивОбъектов);
			ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ОбщиеБлок1"), Табдок, ЗаголовокИОсновныеДанные, ДатаСнятия);
			
			Если Константы.торо_ИспользоватьДокументыПринятияИСписанияОборудования.Получить() Тогда 
				ТабДок.Область("СнятиеСУчета").Видимость = Истина;
			Иначе
				ТабДок.Область("СнятиеСУчета").Видимость = Ложь;
			КонецЕсли;	
							
			Если ЗаголовокИОсновныеДанные.ВнешнийОбъект Тогда
				ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ОбщиеБлок3"), Табдок, ЗаголовокИОсновныеДанные);
			Иначе
				ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ОбщиеБлок2"), Табдок, ЗаголовокИОсновныеДанные);
			КонецЕсли; 
			
			ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ОбщиеБлок4"), Табдок, ЗаголовокИОсновныеДанные);
		КонецЕсли;
		
		// Характеристики
		Если ПечатаемыеРазделы.Свойство("ФлагХарактеристики") И ПечатаемыеРазделы.ФлагХарактеристики = Истина И ПолучитьФункциональнуюОпцию("ИспользоватьДополнительныеРеквизитыИСведения") Тогда
			
			ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ГлСвойства"), ТабДок);
			
			Результат = УправлениеСвойствами.ЗначенияСвойств(ЗаголовокИОсновныеДанные.Ссылка);	
			
			// заполнить недублирующиеся свойства из типового ор
			Если ЗначениеЗаполнено(ЗаголовокИОсновныеДанные.ТиповойОР) Тогда
				СписокЗаполненныхСвойств = Новый массив;
				Для каждого СтрокаДопРеквизита из ЗаголовокИОсновныеДанные.Ссылка.ДополнительныеРеквизиты Цикл
					Если ЗначениеЗаполнено(СтрокаДопРеквизита.Значение) Тогда
						СписокЗаполненныхСвойств.Добавить(СтрокаДопРеквизита.Свойство);
					КонецЕсли;
				КонецЦикла;
				
				Запрос = Новый Запрос;
				Запрос.Текст = 	"ВЫБРАТЬ
				|	торо_ТиповыеОРДополнительныеРеквизиты.Ссылка КАК Источник,
				|	торо_ТиповыеОРДополнительныеРеквизиты.Свойство,
				|	торо_ТиповыеОРДополнительныеРеквизиты.Значение
				|ИЗ
				|	Справочник.торо_ТиповыеОР.ДополнительныеРеквизиты КАК торо_ТиповыеОРДополнительныеРеквизиты
				|ГДЕ
				|	торо_ТиповыеОРДополнительныеРеквизиты.Ссылка = &ТиповойОР
				|	И НЕ торо_ТиповыеОРДополнительныеРеквизиты.Свойство В (&Свойства)";
				
				Запрос.УстановитьПараметр("ТиповойОР", ЗаголовокИОсновныеДанные.ТиповойОР);
				Запрос.УстановитьПараметр("Свойства", СписокЗаполненныхСвойств);
				
				ВыборкаСвойств = Запрос.Выполнить().Выбрать();
				Пока ВыборкаСвойств.Следующий() Цикл
					Если НЕ ЗначениеЗаполнено(ВыборкаСвойств.Значение) Тогда
						Продолжить;
					Конецесли;
					
					НовСтр = Результат.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаСвойств);
				КонецЦикла;
			КонецЕсли;
			
			Если Результат.Количество() <> 0 Тогда
				ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ЗаголовокСвойства"),ТабДок);
				Область = Макет.ПолучитьОбласть("ТаблСвойства");
				
				Для каждого Характеристика Из Результат Цикл
					ЗаполнитьИВывестиОбласть(Область, ТабДок, Характеристика);
				КонецЦикла;
			КонецЕсли; 
			
		КонецЕсли;
		
		///////////////////////////////////////////////////////////////////////////
		// Флаг Показатели 
		Если ПечатаемыеРазделы.Свойство("ФлагКонтролируемыеПоказатели") И ПечатаемыеРазделы.ФлагКонтролируемыеПоказатели = Истина Тогда
			ПечатьПаспортаОР_КонтролируемыеПоказатели(ТабДок, Макет, ЗаголовокИОсновныеДанные);
		КонецЕсли;                                                                    
		
		///////////////////////////////////////////////////////////////////////////
		// Флаг Наработка
		Если ПечатаемыеРазделы.Свойство("ФлагНаработка") И ПечатаемыеРазделы.ФлагНаработка = Истина Тогда	
			ПечатьПаспортаОР_Наработка(ТабДок, Макет, ЗаголовокИОсновныеДанные);
		КонецЕсли;
		
		///////////////////////////////////////////////////////////////////////////
		// Флаг Ремонты
		Если ПечатаемыеРазделы.Свойство("ФлагРемонты") И ПечатаемыеРазделы.ФлагРемонты = Истина Тогда
			ПечатьПаспортаОР_Ремонты(ТабДок, Макет, ЗаголовокИОсновныеДанные);
		КонецЕсли;	
		
		///////////////////////////////////////////////////////////////////////////
		// Флаг Нормативные ремонты
		Если ПечатаемыеРазделы.Свойство("ФлагНормативныеРемонты") И ПечатаемыеРазделы.ФлагНормативныеРемонты = Истина  Тогда
			ПечатьПаспортаОР_НормативныеРемонты(ТабДок, Макет, ЗаголовокИОсновныеДанные);
		КонецЕсли;

		///////////////////////////////////////////////////////////////////////////
		// Флаг Состав техкарт
		Если ПечатаемыеРазделы.Свойство("ФлагТехкарты") И ПечатаемыеРазделы.ФлагТехкарты = Истина  Тогда
			ПечатьПаспортаОР_СоставТехКарт(ТабДок, Макет, ЗаголовокИОсновныеДанные);
		КонецЕсли;
		
		//////////////////////////////////////////////////////////////////////////////
		// Флаг Регламентные мероприятия
		Если ПолучитьФункциональнуюОпцию("торо_ИспользоватьРегламентныеМероприятия") Тогда
			Если ПечатаемыеРазделы.Свойство("ФлагРегМероприятия") И ПечатаемыеРазделы.ФлагРегМероприятия = Истина Тогда 
				ПечатьПаспортаОР_Мероприятия(ТабДок, Макет, ЗаголовокИОсновныеДанные);
			КонецЕсли;
		КонецЕсли;
				
		///////////////////////////////////////////////////////////////////////////
		// Флаг ФлагКоэффициентыРемонтныхОсобенностей
		Если ПечатаемыеРазделы.Свойство("ФлагКоэффициентыРемонтныхОсобенностей") И ПечатаемыеРазделы.ФлагКоэффициентыРемонтныхОсобенностей = Истина  Тогда
			ПечатьПаспортаОР_КоэффициентыРемонтныхОсобенностей(ТабДок, Макет, ЗаголовокИОсновныеДанные);
		КонецЕсли;
		
		///////////////////////////////////////////////////////////////////////////
		// Флаг Дополнительно
		Если ПечатаемыеРазделы.Свойство("ФлагДополнительно") И ПечатаемыеРазделы.ФлагДополнительно = Истина  Тогда
			
			Дополнительно = Макет.ПолучитьОбласть("Дополнительно");	
			Дополнительно.Параметры.Приоритет                  = ЗаголовокИОсновныеДанные.Приоритет;
			Дополнительно.Параметры.РемонтноеПодразделение     = ЗаголовокИОсновныеДанные.ПодразделениеИсполнитель;
			Дополнительно.Параметры.КонтрагентИсполнительРемонта = ЗаголовокИОсновныеДанные.КонтрагентИсполнительРемонта;
			Дополнительно.Параметры.НеУчаствуетВПланировании   = ЗаголовокИОсновныеДанные.НеУчаствуетВПланировании;
			Дополнительно.Параметры.ВестиУчетСерийныхЗапчастей = ЗаголовокИОсновныеДанные.ВестиУчетСерийныхЗапчастей;
			
			ТабДок.Вывести(Дополнительно);
		КонецЕсли;
		
		///////////////////////////////////////////////////////////////////////////
		// Флаг ПрикрепленныеФайлы
		Если ПечатаемыеРазделы.Свойство("ФлагПрикрепленныеФайлы") И ПечатаемыеРазделы.ФлагПрикрепленныеФайлы = Истина Тогда
			
			ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ГлФайлы"), ТабДок);
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ОбъектРемонта", ЗаголовокИОсновныеДанные.Ссылка);
			Запрос.Текст = "ВЫБРАТЬ
			|	торо_ОбъектыРемонтаПрисоединенныеФайлы.Наименование,
			|	торо_ОбъектыРемонтаПрисоединенныеФайлы.Описание
			|ИЗ
			|	Справочник.торо_ОбъектыРемонтаПрисоединенныеФайлы КАК торо_ОбъектыРемонтаПрисоединенныеФайлы
			|ГДЕ
			|	торо_ОбъектыРемонтаПрисоединенныеФайлы.ВладелецФайла = &ОбъектРемонта";
			
			Результат = Запрос.Выполнить();
			
			Если Не Результат.Пустой() Тогда
				ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ЗаголовокФайлы"),ТабДок);
				Файл = Результат.Выбрать();
				Область = Макет.ПолучитьОбласть("ТаблФайлы");
				
				Пока Файл.Следующий() Цикл
					ЗаполнитьИВывестиОбласть(Область, ТабДок, Файл);
				КонецЦикла;
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТабДок.ТолькоПросмотр = Истина;
	Возврат ТабДок;	
	
КонецФункции // ПечатьПаспортаОР(МассивОбъектов, ПараметрыПечати)

Функция ПолучитьВыборкуДляПечатиПаспортаОР(МассивОбъектов, СтруктураИерархии)
	
	Запрос = Новый Запрос;
	Если СтруктураИерархии.СтроитсяАвтоматически Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ОбъектыРемонта.Ссылка,
		|	торо_ОбъектыРемонта.Код,
		|	торо_ОбъектыРемонта.Наименование,
		|	торо_ОбъектыРемонта.Направление,
		|	торо_ОбъектыРемонта.ТиповойОР,
		|	торо_ОбъектыРемонта.ИнвентарныйНомер,
		|	торо_ОбъектыРемонта.ДатаВводаВЭксплуатацию,
		|	торо_ОбъектыРемонта.СрокПолезногоИспользования,
		|	торо_ОбъектыРемонта.ПлановыйГрафикРаботы,
		|	торо_ОбъектыРемонта.Организация,
		|	торо_ОбъектыРемонта.Подразделение,
		|	торо_ОбъектыРемонта.ВнешнийОбъект,
		|	торо_ОбъектыРемонта.Контрагент,
		|	торо_ОбъектыРемонта.Комментарий,
		|	торо_ОбъектыРемонта.ДоговорКонтрагента,
		|	торо_ОбъектыРемонта.Изготовитель,
		|	торо_ОбъектыРемонта.ЗаводскойНомер,
		|	торо_ОбъектыРемонта.ТехНомер,
		|	торо_ОбъектыРемонта.КодПоОКОФ,
		|	торо_ОбъектыРемонта.ДатаВыпуска,
		|	торо_ОбъектыРемонта.НомерПаспорта,
		|	торо_ОбъектыРемонта.АдресМестонахождения,
		|	торо_ОбъектыРемонта.ПодразделениеИсполнитель,
		|	торо_ОбъектыРемонта.КонтрагентИсполнительРемонта,
		|	торо_ОбъектыРемонта.НеУчаствуетВПланировании,
		|	торо_ОбъектыРемонта.ВестиУчетСерийныхЗапчастей,
		|	торо_ОбъектыРемонта.Приоритет,
		|	торо_ОбъектыРемонта."+СтруктураИерархии.РеквизитОР+" КАК Родитель
		|ИЗ
		|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|ГДЕ 
		| торо_ОбъектыРемонта.Ссылка В (&Ссылка)
		|";
		
	Иначе
			
		Если СтруктураИерархии.ИзменяетсяДокументами Тогда
			
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	торо_ОбъектыРемонта.Ссылка,
			|	торо_ОбъектыРемонта.Код КАК Код,
			|	торо_ОбъектыРемонта.Наименование КАК Наименование,
			|	торо_ОбъектыРемонта.Направление КАК Направление,
			|	торо_ОбъектыРемонта.ТиповойОР КАК ТиповойОР,
			|	торо_ОбъектыРемонта.ИнвентарныйНомер КАК ИнвентарныйНомер,
			|	торо_ОбъектыРемонта.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
			|	торо_ОбъектыРемонта.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
			|	торо_ОбъектыРемонта.ПлановыйГрафикРаботы КАК ПлановыйГрафикРаботы,
			|	торо_ОбъектыРемонта.Организация КАК Организация,
			|	торо_ОбъектыРемонта.Подразделение КАК Подразделение,
			|	торо_ОбъектыРемонта.ВнешнийОбъект КАК ВнешнийОбъект,
			|	торо_ОбъектыРемонта.Контрагент КАК Контрагент,
			|	торо_ОбъектыРемонта.Комментарий,
			|	торо_ОбъектыРемонта.ДоговорКонтрагента КАК ДоговорКонтрагента,
			|	торо_ОбъектыРемонта.Изготовитель КАК Изготовитель,
			|	торо_ОбъектыРемонта.ЗаводскойНомер КАК ЗаводскойНомер,
			|	торо_ОбъектыРемонта.ТехНомер КАК ТехНомер,
			|	торо_ОбъектыРемонта.КодПоОКОФ КАК КодПоОКОФ,
			|	торо_ОбъектыРемонта.ДатаВыпуска КАК ДатаВыпуска,
			|	торо_ОбъектыРемонта.НомерПаспорта КАК НомерПаспорта,
			|	торо_ОбъектыРемонта.АдресМестонахождения КАК АдресМестонахождения,
			|	торо_ОбъектыРемонта.ПодразделениеИсполнитель КАК ПодразделениеИсполнитель,
			|	торо_ОбъектыРемонта.КонтрагентИсполнительРемонта КАК КонтрагентИсполнительРемонта,
			|	торо_ОбъектыРемонта.НеУчаствуетВПланировании КАК НеУчаствуетВПланировании,
			|	торо_ОбъектыРемонта.ВестиУчетСерийныхЗапчастей КАК ВестиУчетСерийныхЗапчастей,
			|	торо_ОбъектыРемонта.Приоритет КАК Приоритет,
			|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.РодительИерархии КАК Родитель
			|ИЗ
			|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(, СтруктураИерархии = &СтруктураИерархии) КАК торо_РасположениеОРВСтруктуреИерархииСрезПоследних
			|		ПО торо_ОбъектыРемонта.Ссылка = торо_РасположениеОРВСтруктуреИерархииСрезПоследних.ОбъектИерархии
			|			И (торо_ОбъектыРемонта.Ссылка В (&Ссылка))";

		Иначе
			
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	торо_ОбъектыРемонта.Ссылка КАК Ссылка,
			|	торо_ОбъектыРемонта.Код КАК Код,
			|	торо_ОбъектыРемонта.Наименование КАК Наименование,
			|	торо_ОбъектыРемонта.Направление КАК Направление,
			|	торо_ОбъектыРемонта.ТиповойОР КАК ТиповойОР,
			|	торо_ОбъектыРемонта.ИнвентарныйНомер КАК ИнвентарныйНомер,
			|	торо_ОбъектыРемонта.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
			|	торо_ОбъектыРемонта.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
			|	торо_ОбъектыРемонта.ПлановыйГрафикРаботы КАК ПлановыйГрафикРаботы,
			|	торо_ОбъектыРемонта.Организация КАК Организация,
			|	торо_ОбъектыРемонта.Подразделение КАК Подразделение,
			|	торо_ОбъектыРемонта.ВнешнийОбъект КАК ВнешнийОбъект,
			|	торо_ОбъектыРемонта.Контрагент КАК Контрагент,
			|	торо_ОбъектыРемонта.Комментарий КАК Комментарий,
			|	торо_ОбъектыРемонта.ДоговорКонтрагента КАК ДоговорКонтрагента,
			|	торо_ОбъектыРемонта.Изготовитель КАК Изготовитель,
			|	торо_ОбъектыРемонта.ЗаводскойНомер КАК ЗаводскойНомер,
			|	торо_ОбъектыРемонта.ТехНомер КАК ТехНомер,
			|	торо_ОбъектыРемонта.КодПоОКОФ КАК КодПоОКОФ,
			|	торо_ОбъектыРемонта.ДатаВыпуска КАК ДатаВыпуска,
			|	торо_ОбъектыРемонта.НомерПаспорта КАК НомерПаспорта,
			|	торо_ОбъектыРемонта.АдресМестонахождения КАК АдресМестонахождения,
			|	торо_ОбъектыРемонта.ПодразделениеИсполнитель КАК ПодразделениеИсполнитель,
			|	торо_ОбъектыРемонта.КонтрагентИсполнительРемонта КАК КонтрагентИсполнительРемонта,
			|	торо_ОбъектыРемонта.НеУчаствуетВПланировании КАК НеУчаствуетВПланировании,
			|	торо_ОбъектыРемонта.ВестиУчетСерийныхЗапчастей КАК ВестиУчетСерийныхЗапчастей,
			|	торо_ОбъектыРемонта.Приоритет КАК Приоритет,
			|	торо_ИерархическиеСтруктурыОР.РодительИерархии КАК Родитель
			|ИЗ
			|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИерархическиеСтруктурыОР КАК торо_ИерархическиеСтруктурыОР
			|		ПО торо_ОбъектыРемонта.Ссылка = торо_ИерархическиеСтруктурыОР.ОбъектИерархии
			|			И (торо_ОбъектыРемонта.Ссылка В (&Ссылка))
			|ГДЕ
			|	торо_ИерархическиеСтруктурыОР.СтруктураИерархии = &СтруктураИерархии";

		КонецЕсли;
		
		Запрос.УстановитьПараметр("СтруктураИерархии", СтруктураИерархии);
			
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	
	Выборка = Запрос.Выполнить().Выбрать();

	Возврат Выборка;
	
КонецФункции

Функция ПолучитьДатуСнятияСУчета (МассивОбъектов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_СтатусыОбъектовРемонтаВУчете.ОбъектРемонта КАК ОбъектРемонта,
	               |	торо_СтатусыОбъектовРемонтаВУчете.СтатусОР КАК СтатусОР,
	               |	торо_СтатусыОбъектовРемонтаВУчете.Период КАК Период
	               |ИЗ
	               |	РегистрСведений.торо_СтатусыОбъектовРемонтаВУчете.СрезПоследних(, ОбъектРемонта В (&Ссылка)) КАК торо_СтатусыОбъектовРемонтаВУчете
	               |ГДЕ
	               |	торо_СтатусыОбъектовРемонтаВУчете.СтатусОР = ЗНАЧЕНИЕ(Перечисление.торо_СтатусыОРВУчете.СнятоСУчета)";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Период;
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции

Процедура ПечатьПаспортаОР_КонтролируемыеПоказатели(ТабДок, Макет, ЗаголовокИОсновныеДанные)
	
	// Область "ГлПоказатели"
	ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ГлПоказатели"),Табдок,ЗаголовокИОсновныеДанные);
	
	ТаблицаРодителейТОР = торо_ОбщегоНазначения.ПолучитьТаблицуРодителейОбъекта(ЗаголовокИОсновныеДанные.ТиповойОР);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Таб.Родитель КАК ТОР
	|ПОМЕСТИТЬ ТабРодителейТОР
	|ИЗ
	|	&ТабРодителейТОР КАК Таб
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТОР
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_ИзмеряемыеПоказателиОбъектовРемонта.Показатель КАК Показатель,
	|	ЗНАЧЕНИЕ(Справочник.торо_ТиповыеОР.ПустаяСсылка) КАК ТиповойОР,
	|	1 КАК Приоритет,
	|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ДопустимыйМинимум КАК ДопустимыйМинимум,
	|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ДопустимыйМаксимум КАК ДопустимыйМаксимум,
	|	торо_ИзмеряемыеПоказателиОбъектовРемонта.КритическийМинимум КАК КритическийМинимум,
	|	торо_ИзмеряемыеПоказателиОбъектовРемонта.КритическийМаксимум КАК КритическийМаксимум,
	|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ЗначенияКонтролируемыхПоказателейИзОР КАК ЗначенияКонтролируемыхПоказателейИзОР,
	|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ТочкаЗамера КАК ТочкаЗамера,
	|	торо_ИзмеряемыеПоказателиОбъектовРемонта.Удален КАК Удален
	|ПОМЕСТИТЬ ПоказателиОРИТиповогоОР
	|ИЗ
	|	РегистрСведений.торо_ИзмеряемыеПоказателиОбъектовРемонта КАК торо_ИзмеряемыеПоказателиОбъектовРемонта
	|ГДЕ
	|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ОбъектРемонта = &ОбъектРемонта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.торо_ОбъектыРемонта.ПустаяСсылка),
	|	торо_ИзмеряемыеПоказателиОбъектовРемонта.Показатель,
	|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ОбъектРемонта,
	|	0,
	|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ДопустимыйМинимум,
	|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ДопустимыйМаксимум,
	|	торо_ИзмеряемыеПоказателиОбъектовРемонта.КритическийМинимум,
	|	торо_ИзмеряемыеПоказателиОбъектовРемонта.КритическийМаксимум,
	|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ЗначенияКонтролируемыхПоказателейИзОР,
	|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ТочкаЗамера,
	|	торо_ИзмеряемыеПоказателиОбъектовРемонта.Удален
	|ИЗ
	|	ТабРодителейТОР КАК ТабРодителейТОР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИзмеряемыеПоказателиОбъектовРемонта КАК торо_ИзмеряемыеПоказателиОбъектовРемонта
	|		ПО ТабРодителейТОР.ТОР = торо_ИзмеряемыеПоказателиОбъектовРемонта.ОбъектРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПриоритетовПолная.Показатель КАК Показатель,
	|	МАКСИМУМ(ТаблицаПриоритетовПолная.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ ТаблицаПриоритетов
	|ИЗ
	|	ПоказателиОРИТиповогоОР КАК ТаблицаПриоритетовПолная
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПриоритетовПолная.Показатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоказателиОРИТиповогоОР.Показатель КАК Показатель,
	|	ПоказателиОРИТиповогоОР.ДопустимыйМинимум КАК ДопустимыйМинимум,
	|	ПоказателиОРИТиповогоОР.ДопустимыйМаксимум КАК ДопустимыйМаксимум,
	|	ПоказателиОРИТиповогоОР.КритическийМинимум КАК КритическийМинимум,
	|	ПоказателиОРИТиповогоОР.КритическийМаксимум КАК КритическийМаксимум,
	|	ПоказателиОРИТиповогоОР.ЗначенияКонтролируемыхПоказателейИзОР КАК ЗначенияКонтролируемыхПоказателейИзОР,
	|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ЕдиницаИзмерения КАК ЕдИзм
	|ИЗ
	|	ПоказателиОРИТиповогоОР КАК ПоказателиОРИТиповогоОР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПриоритетов КАК ТаблицаПриоритетов
	|		ПО ПоказателиОРИТиповогоОР.Показатель = ТаблицаПриоритетов.Показатель
	|			И ПоказателиОРИТиповогоОР.Приоритет = ТаблицаПриоритетов.Приоритет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.торо_ИзмеряемыеПоказателиОбъектовРемонта КАК торо_ИзмеряемыеПоказателиОбъектовРемонта
	|		ПО ПоказателиОРИТиповогоОР.Показатель = торо_ИзмеряемыеПоказателиОбъектовРемонта.Ссылка
	|ГДЕ
	|	НЕ ПоказателиОРИТиповогоОР.Удален";
	
	Запрос.УстановитьПараметр("ТабРодителейТОР", ТаблицаРодителейТОР);
	Запрос.УстановитьПараметр("ОбъектРемонта", ЗаголовокИОсновныеДанные.Ссылка);
	Запрос.УстановитьПараметр("СсылкаТиповойОбъект", ЗаголовокИОсновныеДанные.ТиповойОР);
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ТблШпПоказатели"),ТабДок);
		Показатели = Результат.Выбрать();
		Область = Макет.ПолучитьОбласть("ТблПоказатели");
		
		Пока Показатели.Следующий() Цикл
			ЗаполнитьИВывестиОбласть(Область, ТабДок, Показатели);
		КонецЦикла;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПечатьПаспортаОР_Наработка(ТабДок, Макет, ЗаголовокИОсновныеДанные)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ПараметрыНаработкиОбъектовРемонта.ОбъектРемонта,
	|	торо_ПараметрыНаработкиОбъектовРемонта.Показатель,
	|	торо_ПараметрыНаработкиОбъектовРемонта.ПлановаяНаработка,
	|	торо_ПараметрыНаработкиОбъектовРемонта.КоэффициентИспользованияОборудования,
	|	торо_ПараметрыНаработкиОбъектовРемонта.Показатель.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	торо_ПараметрыНаработкиОбъектовРемонта.ПериодПлановойНаработки,
	|	торо_ПараметрыНаработкиОбъектовРемонта.ПродолжительностьПериодаПлановойНаработки
	|ПОМЕСТИТЬ Таб3
	|ИЗ
	|	РегистрСведений.торо_ПараметрыНаработкиОбъектовРемонта.СрезПоследних(, ОбъектРемонта = &ОбъектРемонта) КАК торо_ПараметрыНаработкиОбъектовРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_НаработкаОбъектовРемонта.Период,
	|	торо_НаработкаОбъектовРемонта.Регистратор,
	|	торо_НаработкаОбъектовРемонта.ОбъектРемонта,
	|	Таб3.Показатель                                КАК ПоказательНаработки,
	|	торо_НаработкаОбъектовРемонта.ДатаКон,
	|	торо_НаработкаОбъектовРемонта.Наработка        КАК Наработка,
	|	Таб3.ЕдиницаИзмерения                          КАК ЕдИзм,
	|	Таб3.ПлановаяНаработка                         КАК ПлановаяНаработка,
	|	Таб3.ПродолжительностьПериодаПлановойНаработки КАК ПродолжительностьПериода,
	|	Таб3.ПериодПлановойНаработки                   КАК ПериодПлановойНаработки,
	|	Таб3.КоэффициентИспользованияОборудования      КАК Коэф
	|ИЗ
	|	Таб3 КАК Таб3
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.торо_НаработкаОбъектовРемонта КАК торо_НаработкаОбъектовРемонта
	|		ПО    (торо_НаработкаОбъектовРемонта.ОбъектРемонта = Таб3.ОбъектРемонта)
	|			И (торо_НаработкаОбъектовРемонта.Показатель = Таб3.Показатель)
	|ИТОГИ
	|	СУММА(Наработка),
	|	МИНИМУМ(ЕдИзм),
	|	МИНИМУМ(ПлановаяНаработка),
	|	МИНИМУМ(ПродолжительностьПериода),
	|	МИНИМУМ(ПериодПлановойНаработки),
	|	МИНИМУМ(Коэф)
	|ПО
	|	ПоказательНаработки";
	
	Запрос.УстановитьПараметр("ОбъектРемонта", ЗаголовокИОсновныеДанные.Ссылка);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
		ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ГлНаработка"), Табдок);
		
		// Определим области, которые будут использоваться в цикле, чтобы не получать их постоянно.
		
		ОбластьТаблШапкаПоказатели      = Макет.ПолучитьОбласть("ТблШпПоказателиНаработки");
		ОбластьТаблПоказатели           = Макет.ПолучитьОбласть("ТблПоказателиНаработки");
		
		ОбластьТаблШапкаЖурналНаработки = Макет.ПолучитьОбласть("ТблШпЖурналНаработки");
		ОбластьТаблЖурналНаработки      = Макет.ПолучитьОбласть("ТблЖурналНаработки");
		
		ОбластьНаработкаИтого           = Макет.ПолучитьОбласть("ТблЖурналНаработкиИтоги");
		
		Пока Выборка.Следующий() Цикл
			ЗаполнитьИВывестиОбласть(ОбластьТаблШапкаПоказатели, Табдок);
			ЗаполнитьИВывестиОбласть(ОбластьТаблПоказатели, Табдок, Выборка);
			
			ВыборкаВторогоУровня = Выборка.Выбрать(ОбходРезультатаЗапроса.Прямой);
			
			Если ВыборкаВторогоУровня.Количество() > 0 Тогда
				
				ЗаполнитьИВывестиОбласть(ОбластьТаблШапкаЖурналНаработки, Табдок);
				
				Пока ВыборкаВторогоУровня.Следующий() Цикл 
					ЗаполнитьИВывестиОбласть(ОбластьТаблЖурналНаработки,Табдок, ВыборкаВторогоУровня);
				КонецЦикла;
				
				ЗаполнитьИВывестиОбласть(ОбластьНаработкаИтого,Табдок, Выборка);
				
			КонецЕсли; 
		КонецЦикла;
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПечатьПаспортаОР_Ремонты(ТабДок, Макет, ЗаголовокИОсновныеДанные)
	
	ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ГлРемонты"), Табдок);
	
	//////////////////////////////////////////////////////////////////////////	
	// Область "Выявленные дефекты"
	Если ПолучитьФункциональнуюОпцию("торо_УчетВыявленныхДефектовОборудования") Тогда 
		ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ВыявленныеДефекты"), Табдок);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	торо_ВыявленныеДефектыСписокДефектов.Ссылка КАК Ссылка,
		               |	торо_ВыявленныеДефектыСписокДефектов.Ссылка.Номер КАК Номер,
		               |	торо_ВыявленныеДефектыСписокДефектов.Ссылка.Дата КАК Дата,
		               |	торо_ВыявленныеДефектыСписокДефектов.ОтказавшийЭлемент КАК ОтказавшийЭлемент,
		               |	торо_ВыявленныеДефектыСписокДефектов.ВидДефекта КАК ВидДефекта,
		               |	торо_ВыявленныеДефектыСписокДефектов.ДефектПричина КАК ПричинаДефекта,
		               |	торо_ВыявленныеДефектыСписокДефектов.КритичностьДефекта КАК КритичностьДефекта
		               |ИЗ
		               |	Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов
		               |ГДЕ
		               |	торо_ВыявленныеДефектыСписокДефектов.ОбъектРемонта = &ОбъектРемонта
		               |	И торо_ВыявленныеДефектыСписокДефектов.Ссылка.Проведен
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	торо_ВыявленныеДефектыСписокДефектов.Ссылка.Дата";
		
		Запрос.УстановитьПараметр("ОбъектРемонта", ЗаголовокИОсновныеДанные.Ссылка);
		Результат = Запрос.Выполнить();
		
		Если Не Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ТблШпВыявленныеДефекты"), Табдок);
			Область = Макет.ПолучитьОбласть("ТблВыявленныеДефекты");
			
			Пока Выборка.Следующий() Цикл
				ЗаполнитьИВывестиОбласть(Область, Табдок, Выборка);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	//////////////////////////////////////////////////////////////////////////
	// Область "ПредстоящиеРемонты"  
	ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ПредстоящиеРемонты"),ТабДок);	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаНачалаРемонтныхРабот КАК ДатаНачалаРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаОкончанияРемонтныхРабот КАК ДатаОкончанияРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Регистратор КАК Регистратор,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ID КАК ID
	|ПОМЕСТИТЬ ВТ_ПлановыеРемонтныеРаботы
	|ИЗ
	|	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(, ОбъектРемонтныхРабот = &ОбъектРемонтныхРабот) КАК торо_ПлановыеРемонтныеРаботыСрезПоследних
	|ГДЕ
	|	НЕ торо_ПлановыеРемонтныеРаботыСрезПоследних.Отменен
	|	И НЕ торо_ПлановыеРемонтныеРаботыСрезПоследних.Замещен
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ЗавершенныеРемонтныеРаботыСрезПоследних.ID КАК ID
	|ПОМЕСТИТЬ ВТ_ЗавершенныеРемонты
	|ИЗ
	|	РегистрСведений.торо_ЗавершенныеРемонтныеРаботы.СрезПоследних(
	|			,
	|			ID В
	|				(ВЫБРАТЬ
	|					ВТ_ПлановыеРемонтныеРаботы.ID КАК ID
	|				ИЗ
	|					ВТ_ПлановыеРемонтныеРаботы КАК ВТ_ПлановыеРемонтныеРаботы)) КАК торо_ЗавершенныеРемонтныеРаботыСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ПлановыеРемонтныеРаботы.ДатаНачалаРемонтныхРабот КАК НачалоРемонта,
	|	ВТ_ПлановыеРемонтныеРаботы.ДатаОкончанияРемонтныхРабот КАК ОкончаниеРемонта,
	|	ВТ_ПлановыеРемонтныеРаботы.Регистратор КАК Регистратор,
	|	ВТ_ПлановыеРемонтныеРаботы.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	ВТ_ПлановыеРемонтныеРаботы.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	|	ВТ_ПлановыеРемонтныеРаботы.ID КАК ID
	|ИЗ
	|	ВТ_ПлановыеРемонтныеРаботы КАК ВТ_ПлановыеРемонтныеРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗавершенныеРемонты КАК ВТ_ЗавершенныеРемонты
	|		ПО ВТ_ПлановыеРемонтныеРаботы.ID = ВТ_ЗавершенныеРемонты.ID
	|ГДЕ
	|	ВТ_ЗавершенныеРемонты.ID ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидРемонтныхРабот,
	|	НачалоРемонта";
	
	Запрос.УстановитьПараметр("ДатаНачала", ТекущаяДата());
	Запрос.УстановитьПараметр("ОбъектРемонтныхРабот", ЗаголовокИОсновныеДанные.Ссылка);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ТблШпПредстоящиеРемонты"),ТабДок);	
		Выборка = Результат.Выбрать();
		ТаблВыполненныеРемонты = Макет.ПолучитьОбласть("ТблПредстоящиеРемонты");
		
		Пока Выборка.Следующий() Цикл
			ТаблВыполненныеРемонты.Параметры.Заполнить(Выборка);
			ТаблВыполненныеРемонты.Параметры.ВидРемонтныхРабот = торо_ЗаполнениеДокументов.ПолучитьПредоставленияВРДляПечати(Выборка.ВидРемонтныхРабот);
			ТабДок.Вывести(ТаблВыполненныеРемонты, Выборка.Уровень()); 
		КонецЦикла;
	КонецЕсли;

	//////////////////////////////////////////////////////////////////////////	
	// Область "Заявки на ремонт"  
	ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ЗаявкиНаРемонт"), Табдок);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаНачала КАК НачалоРемонта,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаОкончания КАК ОкончаниеРемонта,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка.Дата КАК ДатаДокумента,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка.Номер КАК Номер
	|ИЗ
	|	Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК торо_ЗаявкаНаРемонтРемонтыОборудования
	|ГДЕ
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ОбъектРемонта = &ОбъектРемонта
	|	И торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаНачала";
	
	Запрос.УстановитьПараметр("ОбъектРемонта", ЗаголовокИОсновныеДанные.Ссылка);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ТблШпЗаявкиНаРемонт"), Табдок);
		Область = Макет.ПолучитьОбласть("ТблЗаявкиНаРемонт");
		
		Пока Выборка.Следующий() Цикл
			ЗаполнитьИВывестиОбласть(Область, Табдок, Выборка);
		КонецЦикла;
	КонецЕсли;
	
	//////////////////////////////////////////////////////////////////////////	
	// Область "Наряды на выполнение ремонтных работ"
	Если ПолучитьФункциональнуюОпцию("торо_ИспользоватьНарядыНаВыполнениеРабот") Тогда 
		ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("НарядыНаРемРаботы"), Табдок);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка КАК Ссылка,
		               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Дата КАК Дата,
		               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Номер КАК Номер,
		               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
		               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ДатаНачала КАК ДатаНачала,
		               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ДатаОкончания КАК ДатаОкончания
		               |ИЗ
		               |	Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтыОборудования КАК торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования
		               |ГДЕ
		               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОбъектРемонта = &ОбъектРемонта
		               |	И торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Проведен
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Дата";
		
		Запрос.УстановитьПараметр("ОбъектРемонта", ЗаголовокИОсновныеДанные.Ссылка);
		Результат = Запрос.Выполнить();
		
		Если Не Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ТблШпНарядыНаРемРаботы"), Табдок);
			Область = Макет.ПолучитьОбласть("ТблНарядыНаРемРаботы");
			
			Пока Выборка.Следующий() Цикл
				ЗаполнитьИВывестиОбласть(Область, Табдок, Выборка);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
			
	//////////////////////////////////////////////////////////////////////////
	// Область "ВыполненныеРемонты"
	ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ВыполненныеРемонты"),ТабДок);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_ЗавершенныеРемонтныеРаботы.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	               |	МИНИМУМ(ВЫБОР
	               |			КОГДА ТИПЗНАЧЕНИЯ(торо_ЗавершенныеРемонтныеРаботы.Регистратор) = ТИП(Документ.торо_АктОВыполненииЭтапаРабот)
	               |				ТОГДА ВЫБОР
	               |						КОГДА ТИПЗНАЧЕНИЯ(торо_Ремонты.Регистратор) = ТИП(Документ.торо_ЗаявкаНаРемонт)
	               |							ТОГДА торо_Ремонты.ДатаНачалаПлан
	               |						ИНАЧЕ NULL
	               |					КОНЕЦ
	               |			ИНАЧЕ торо_ЗавершенныеРемонтныеРаботы.Период
	               |		КОНЕЦ) КАК ДатаНачалаЗаявка,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА ТИПЗНАЧЕНИЯ(торо_ЗавершенныеРемонтныеРаботы.Регистратор) = ТИП(Документ.торо_АктОВыполненииЭтапаРабот)
	               |				ТОГДА ВЫБОР
	               |						КОГДА ТИПЗНАЧЕНИЯ(торо_Ремонты.Регистратор) = ТИП(Документ.торо_ЗаявкаНаРемонт)
	               |							ТОГДА торо_Ремонты.ДатаОкончанияПлан
	               |						ИНАЧЕ NULL
	               |					КОНЕЦ
	               |			ИНАЧЕ торо_ЗавершенныеРемонтныеРаботы.Период
	               |		КОНЕЦ) КАК ДатаОкончанияЗаявка,
	               |	МИНИМУМ(ВЫБОР
	               |			КОГДА ТИПЗНАЧЕНИЯ(торо_ЗавершенныеРемонтныеРаботы.Регистратор) = ТИП(Документ.торо_АктОВыполненииЭтапаРабот)
	               |				ТОГДА ВЫБОР
	               |						КОГДА торо_Ремонты.ДатаНачалаФакт = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |							ТОГДА NULL
	               |						ИНАЧЕ торо_Ремонты.ДатаНачалаФакт
	               |					КОНЕЦ
	               |			ИНАЧЕ торо_ЗавершенныеРемонтныеРаботы.Период
	               |		КОНЕЦ) КАК ДатаНачалаФакт,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА ТИПЗНАЧЕНИЯ(торо_ЗавершенныеРемонтныеРаботы.Регистратор) = ТИП(Документ.торо_АктОВыполненииЭтапаРабот)
	               |				ТОГДА ВЫБОР
	               |						КОГДА торо_Ремонты.ДатаОкончанияФакт = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |							ТОГДА NULL
	               |						ИНАЧЕ торо_Ремонты.ДатаОкончанияФакт
	               |					КОНЕЦ
	               |			ИНАЧЕ торо_ЗавершенныеРемонтныеРаботы.Период
	               |		КОНЕЦ) КАК ДатаОкончанияФакт,
	               |	МИНИМУМ(ВЫБОР
	               |			КОГДА ТИПЗНАЧЕНИЯ(торо_ЗавершенныеРемонтныеРаботы.Регистратор) = ТИП(Документ.торо_АктОВыполненииЭтапаРабот)
	               |				ТОГДА ВЫБОР
	               |						КОГДА НЕ ТИПЗНАЧЕНИЯ(торо_Ремонты.Регистратор) = ТИП(Документ.торо_ЗаявкаНаРемонт)
	               |							ТОГДА ВЫБОР
	               |									КОГДА торо_Ремонты.ДатаНачалаПлан = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |										ТОГДА NULL
	               |									ИНАЧЕ торо_Ремонты.ДатаНачалаПлан
	               |								КОНЕЦ
	               |						ИНАЧЕ NULL
	               |					КОНЕЦ
	               |			ИНАЧЕ торо_ЗавершенныеРемонтныеРаботы.Период
	               |		КОНЕЦ) КАК ДатаНачалаППР,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА ТИПЗНАЧЕНИЯ(торо_ЗавершенныеРемонтныеРаботы.Регистратор) = ТИП(Документ.торо_АктОВыполненииЭтапаРабот)
	               |				ТОГДА ВЫБОР
	               |						КОГДА НЕ ТИПЗНАЧЕНИЯ(торо_Ремонты.Регистратор) = ТИП(Документ.торо_ЗаявкаНаРемонт)
	               |							ТОГДА ВЫБОР
	               |									КОГДА торо_Ремонты.ДатаОкончанияПлан = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |										ТОГДА NULL
	               |									ИНАЧЕ торо_Ремонты.ДатаОкончанияПлан
	               |								КОНЕЦ
	               |						ИНАЧЕ NULL
	               |					КОНЕЦ
	               |			ИНАЧЕ торо_ЗавершенныеРемонтныеРаботы.Период
	               |		КОНЕЦ) КАК ДатаОкончанияППР,
	               |	торо_ЗавершенныеРемонтныеРаботы.ID КАК ID
	               |ПОМЕСТИТЬ ТаблицаЗавершенныхРемонтов
	               |ИЗ
	               |	РегистрСведений.торо_ЗавершенныеРемонтныеРаботы КАК торо_ЗавершенныеРемонтныеРаботы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_Ремонты КАК торо_Ремонты
	               |		ПО торо_ЗавершенныеРемонтныеРаботы.ID = торо_Ремонты.ID
	               |ГДЕ
	               |	торо_ЗавершенныеРемонтныеРаботы.ОбъектРемонта = &ОбъектРемонта
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	торо_ЗавершенныеРемонтныеРаботы.ВидРемонтныхРабот,
	               |	торо_ЗавершенныеРемонтныеРаботы.ID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаЗавершенныхРемонтов.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	               |	ЕСТЬNULL(ТаблицаЗавершенныхРемонтов.ДатаНачалаЗаявка, ЕСТЬNULL(ТаблицаЗавершенныхРемонтов.ДатаНачалаППР, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))) КАК ПланДатаНачалаРемонтныхРабот,
	               |	ЕСТЬNULL(ТаблицаЗавершенныхРемонтов.ДатаОкончанияЗаявка, ЕСТЬNULL(ТаблицаЗавершенныхРемонтов.ДатаОкончанияППР, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))) КАК ПланДатаЗавершенияРемонтныхРабот,
	               |	ЕСТЬNULL(ТаблицаЗавершенныхРемонтов.ДатаНачалаФакт, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ФактДатаНачалаРемонтныхРабот,
	               |	ЕСТЬNULL(ТаблицаЗавершенныхРемонтов.ДатаОкончанияФакт, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ФактДатаЗавершенияРемонтныхРабот
	               |ИЗ
	               |	ТаблицаЗавершенныхРемонтов КАК ТаблицаЗавершенныхРемонтов
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТаблицаЗавершенныхРемонтов.ВидРемонтныхРабот,
	               |	ПланДатаНачалаРемонтныхРабот";
	
	Запрос.УстановитьПараметр("ОбъектРемонта", ЗаголовокИОсновныеДанные.Ссылка);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ТблШпВыполненныеРемонты"),ТабДок);
		Выборка = Результат.Выбрать();
		ТаблВыполненныеРемонты = Макет.ПолучитьОбласть("ТблВыполненныеРемонты");
		
		Пока Выборка.Следующий() Цикл
			ТаблВыполненныеРемонты.Параметры.Заполнить(Выборка);
			ТаблВыполненныеРемонты.Параметры.ВидРемонтныхРабот = торо_ЗаполнениеДокументов.ПолучитьПредоставленияВРДляПечати(Выборка.ВидРемонтныхРабот);
			ТабДок.Вывести(ТаблВыполненныеРемонты, Выборка.Уровень()); 
		КонецЦикла;
	КонецЕсли; 
	
	//////////////////////////////////////////////////////////////////////////	
	// Область "Акты о приемке оборудования"
	Если ПолучитьФункциональнуюОпцию("торо_ИспользоватьАктПриемкиОборудования") Тогда 
		ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("АктыПриемкиОборудования"), Табдок);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	торо_АктПриемкиОборудованияРемонтыОборудования.Ссылка КАК Ссылка,
		               |	торо_АктПриемкиОборудованияРемонтыОборудования.Ссылка.Номер КАК Номер,
		               |	торо_АктПриемкиОборудованияРемонтыОборудования.Ссылка.Дата КАК Дата,
		               |	торо_АктПриемкиОборудованияРемонтыОборудования.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
		               |	торо_АктПриемкиОборудованияРемонтыОборудования.ДатаНачала КАК ДатаНачала,
		               |	торо_АктПриемкиОборудованияРемонтыОборудования.ДатаОкончания КАК ДатаОкончания
		               |ИЗ
		               |	Документ.торо_АктПриемкиОборудования.РемонтыОборудования КАК торо_АктПриемкиОборудованияРемонтыОборудования
		               |ГДЕ
		               |	торо_АктПриемкиОборудованияРемонтыОборудования.ОбъектРемонта = &ОбъектРемонта
		               |	И торо_АктПриемкиОборудованияРемонтыОборудования.Ссылка.Проведен
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	торо_АктПриемкиОборудованияРемонтыОборудования.Ссылка.Дата";
		
		Запрос.УстановитьПараметр("ОбъектРемонта", ЗаголовокИОсновныеДанные.Ссылка);
		Результат = Запрос.Выполнить();
		
		Если Не Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ТблШпАктыПриемкиОборудования"), Табдок);
			Область = Макет.ПолучитьОбласть("ТблАктыПриемкиОборудования");
			
			Пока Выборка.Следующий() Цикл
				ЗаполнитьИВывестиОбласть(Область, Табдок, Выборка);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

Процедура ПечатьПаспортаОР_Мероприятия(ТабДок, Макет, ЗаголовокИОсновныеДанные)
	ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ГлМероприятия"), Табдок);
	
	//////////////////////////////////////////////////////////////////////////	
	// Область "Предстоящие регламентные мероприятия"
	ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ПредстоящиеРМ"), ТабДок);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_МаршрутыРегламентныхМероприятий.ОбъектРемонта КАК ОбъектРемонта,
	               |	торо_МаршрутыРегламентныхМероприятий.СписокОбъектов КАК СписокОбъектов
	               |ПОМЕСТИТЬ СписокОбъектовРМ
	               |ИЗ
	               |	РегистрСведений.торо_МаршрутыРегламентныхМероприятий КАК торо_МаршрутыРегламентныхМероприятий
	               |ГДЕ
	               |	торо_МаршрутыРегламентныхМероприятий.ОбъектРемонта = &ОбъектРемонта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	торо_ПлановыеМероприятияСрезПоследних.ДатаНачала КАК ДатаНачала,
	               |	торо_ПлановыеМероприятияСрезПоследних.ДатаОкончания КАК ДатаОкончания,
	               |	торо_ПлановыеМероприятияСрезПоследних.Регистратор КАК Регистратор,
	               |	торо_ПлановыеМероприятияСрезПоследних.ВидМероприятия КАК ВидМероприятия,
	               |	торо_ПлановыеМероприятияСрезПоследних.СписокОбъектов КАК СписокОбъектов,
	               |	торо_ПлановыеМероприятияСрезПоследних.ID КАК ID
	               |ПОМЕСТИТЬ ВТ_ПлановыеМероприятия
	               |ИЗ
	               |	РегистрСведений.торо_ПлановыеМероприятия.СрезПоследних(
	               |			,
	               |			СписокОбъектов В
	               |				(ВЫБРАТЬ
	               |					СписокОбъектовРМ.СписокОбъектов КАК СписокОбъектов
	               |				ИЗ
	               |					СписокОбъектовРМ КАК СписокОбъектовРМ)) КАК торо_ПлановыеМероприятияСрезПоследних
	               |ГДЕ
	               |	НЕ торо_ПлановыеМероприятияСрезПоследних.Отменен
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	торо_ЗавершенныеМероприятияСрезПоследних.ID КАК ID
	               |ПОМЕСТИТЬ ВТ_ЗавершенныеМероприятия
	               |ИЗ
	               |	РегистрСведений.торо_ЗавершенныеМероприятия.СрезПоследних(
	               |			,
	               |			ID В
	               |				(ВЫБРАТЬ
	               |					ВТ_ПлановыеМероприятия.ID КАК ID
	               |				ИЗ
	               |					ВТ_ПлановыеМероприятия КАК ВТ_ПлановыеМероприятия)) КАК торо_ЗавершенныеМероприятияСрезПоследних
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВТ_ПлановыеМероприятия.ДатаНачала КАК ДатаНачала,
	               |	ВТ_ПлановыеМероприятия.ДатаОкончания КАК ДатаОкончания,
	               |	ВТ_ПлановыеМероприятия.Регистратор КАК Регистратор,
	               |	ВТ_ПлановыеМероприятия.ВидМероприятия КАК ВидМероприятия,
	               |	ВТ_ПлановыеМероприятия.СписокОбъектов КАК СписокОбъектов,
	               |	ВТ_ПлановыеМероприятия.ID КАК ID
	               |ИЗ
	               |	ВТ_ПлановыеМероприятия КАК ВТ_ПлановыеМероприятия
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗавершенныеМероприятия КАК ВТ_ЗавершенныеМероприятия
	               |		ПО ВТ_ПлановыеМероприятия.ID = ВТ_ЗавершенныеМероприятия.ID
	               |ГДЕ
	               |	ВТ_ЗавершенныеМероприятия.ID ЕСТЬ NULL
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВидМероприятия.Наименование,
	               |	ДатаНачала";
	
	Запрос.УстановитьПараметр("ОбъектРемонта", ЗаголовокИОсновныеДанные.Ссылка);
	Результат = Запрос.Выполнить();
		
	Если Не Результат.Пустой() Тогда
		ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ТблШпПредстоящиеРМ"),ТабДок);	
		Выборка = Результат.Выбрать();
		Область = Макет.ПолучитьОбласть("ТблПредстоящиеРМ");
		
		Пока Выборка.Следующий() Цикл
			Область.Параметры.Заполнить(Выборка);
			Область.Параметры.ВидМероприятия = торо_ЗаполнениеДокументов.ПолучитьПредоставленияВРДляПечати(Выборка.ВидМероприятия);
			ТабДок.Вывести(Область, Выборка.Уровень()); 
		КонецЦикла;
	КонецЕсли;


	//////////////////////////////////////////////////////////////////////////	
	// Область "Наряды на регламентные мероприятия"
	Если ПолучитьФункциональнуюОпцию("торо_ИспользоватьНарядыНаРегламентноеМероприятие") Тогда 
		ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("НарядыРМ"), ТабДок);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	торо_МаршрутыРегламентныхМероприятий.ОбъектРемонта КАК ОбъектРемонта,
		               |	торо_МаршрутыРегламентныхМероприятий.СписокОбъектов КАК СписокОбъектов
		               |ПОМЕСТИТЬ СписокОбъектовРМ
		               |ИЗ
		               |	РегистрСведений.торо_МаршрутыРегламентныхМероприятий КАК торо_МаршрутыРегламентныхМероприятий
		               |ГДЕ
		               |	торо_МаршрутыРегламентныхМероприятий.ОбъектРемонта = &ОбъектРемонта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	торо_НарядНаРегламентноеМероприятиеРегламентныеМероприятия.Ссылка КАК Ссылка,
		               |	торо_НарядНаРегламентноеМероприятиеРегламентныеМероприятия.Ссылка.Дата КАК Дата,
		               |	торо_НарядНаРегламентноеМероприятиеРегламентныеМероприятия.Ссылка.Номер КАК Номер,
		               |	торо_НарядНаРегламентноеМероприятиеРегламентныеМероприятия.ВидРемонтныхРабот КАК ВидМероприятия,
		               |	торо_НарядНаРегламентноеМероприятиеРегламентныеМероприятия.ДатаНачала КАК ДатаНачала,
		               |	торо_НарядНаРегламентноеМероприятиеРегламентныеМероприятия.ДатаОкончания КАК ДатаОкончания
		               |ИЗ
		               |	Документ.торо_НарядНаРегламентноеМероприятие.РегламентныеМероприятия КАК торо_НарядНаРегламентноеМероприятиеРегламентныеМероприятия
		               |ГДЕ
		               |	торо_НарядНаРегламентноеМероприятиеРегламентныеМероприятия.ОбъектРемонта В
		               |			(ВЫБРАТЬ
		               |				СписокОбъектовРМ.СписокОбъектов КАК СписокОбъектов
		               |			ИЗ
		               |				СписокОбъектовРМ КАК СписокОбъектовРМ)
		               |	И торо_НарядНаРегламентноеМероприятиеРегламентныеМероприятия.Ссылка.Проведен
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	торо_НарядНаРегламентноеМероприятиеРегламентныеМероприятия.Ссылка.Дата";
		
		Запрос.УстановитьПараметр("ОбъектРемонта", ЗаголовокИОсновныеДанные.Ссылка);
		Результат = Запрос.Выполнить();
		
		Если Не Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ТблШпНарядыРМ"), Табдок);
			Область = Макет.ПолучитьОбласть("ТблНарядыРМ");
			
			Пока Выборка.Следующий() Цикл
				ЗаполнитьИВывестиОбласть(Область, Табдок, Выборка);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	//////////////////////////////////////////////////////////////////////////	
	// Область "Выполненные регламентные мероприятия"
	ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ВыполненныеРМ"), ТабДок);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_МаршрутыРегламентныхМероприятий.ОбъектРемонта КАК ОбъектРемонта,
	               |	торо_МаршрутыРегламентныхМероприятий.СписокОбъектов КАК СписокОбъектов
	               |ПОМЕСТИТЬ СписокОбъектовРМ
	               |ИЗ
	               |	РегистрСведений.торо_МаршрутыРегламентныхМероприятий КАК торо_МаршрутыРегламентныхМероприятий
	               |ГДЕ
	               |	торо_МаршрутыРегламентныхМероприятий.ОбъектРемонта = &ОбъектРемонта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	торо_ЗавершенныеМероприятия.ВидМероприятия КАК ВидМероприятия,
	               |	МИНИМУМ(ВЫБОР
	               |			КОГДА ТИПЗНАЧЕНИЯ(торо_ЗавершенныеМероприятия.Регистратор) = ТИП(Документ.торо_АктОВыполненииРегламентногоМероприятия)
	               |				ТОГДА ВЫБОР
	               |						КОГДА торо_Ремонты.ДатаНачалаФакт = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |							ТОГДА NULL
	               |						ИНАЧЕ торо_Ремонты.ДатаНачалаФакт
	               |					КОНЕЦ
	               |			ИНАЧЕ торо_ЗавершенныеМероприятия.Период
	               |		КОНЕЦ) КАК ДатаНачалаФакт,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА ТИПЗНАЧЕНИЯ(торо_ЗавершенныеМероприятия.Регистратор) = ТИП(Документ.торо_АктОВыполненииРегламентногоМероприятия)
	               |				ТОГДА ВЫБОР
	               |						КОГДА торо_Ремонты.ДатаОкончанияФакт = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |							ТОГДА NULL
	               |						ИНАЧЕ торо_Ремонты.ДатаОкончанияФакт
	               |					КОНЕЦ
	               |			ИНАЧЕ торо_ЗавершенныеМероприятия.Период
	               |		КОНЕЦ) КАК ДатаОкончанияФакт,
	               |	МИНИМУМ(ВЫБОР
	               |			КОГДА ТИПЗНАЧЕНИЯ(торо_ЗавершенныеМероприятия.Регистратор) = ТИП(Документ.торо_АктОВыполненииРегламентногоМероприятия)
	               |				ТОГДА ВЫБОР
	               |						КОГДА торо_Ремонты.ДатаНачалаПлан = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |							ТОГДА NULL
	               |						ИНАЧЕ торо_Ремонты.ДатаНачалаПлан
	               |					КОНЕЦ
	               |			ИНАЧЕ торо_ЗавершенныеМероприятия.Период
	               |		КОНЕЦ) КАК ДатаНачалаПлан,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА ТИПЗНАЧЕНИЯ(торо_ЗавершенныеМероприятия.Регистратор) = ТИП(Документ.торо_АктОВыполненииРегламентногоМероприятия)
	               |				ТОГДА ВЫБОР
	               |						КОГДА торо_Ремонты.ДатаОкончанияПлан = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |							ТОГДА NULL
	               |						ИНАЧЕ торо_Ремонты.ДатаОкончанияПлан
	               |					КОНЕЦ
	               |			ИНАЧЕ торо_ЗавершенныеМероприятия.Период
	               |		КОНЕЦ) КАК ДатаОкончанияПлан,
	               |	торо_ЗавершенныеМероприятия.ID КАК ID
	               |ПОМЕСТИТЬ ТаблицаЗавершенныхМероприятий
	               |ИЗ
	               |	РегистрСведений.торо_ЗавершенныеМероприятия КАК торо_ЗавершенныеМероприятия
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_Ремонты КАК торо_Ремонты
	               |		ПО торо_ЗавершенныеМероприятия.ID = торо_Ремонты.ID
	               |			И (НЕ ТИПЗНАЧЕНИЯ(торо_Ремонты.Регистратор) = ТИП(Документ.торо_НарядНаРегламентноеМероприятие))
	               |ГДЕ
	               |	торо_ЗавершенныеМероприятия.СписокОбъектов В
	               |			(ВЫБРАТЬ
	               |				СписокОбъектовРМ.СписокОбъектов КАК СписокОбъектов
	               |			ИЗ
	               |				СписокОбъектовРМ КАК СписокОбъектовРМ)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	торо_ЗавершенныеМероприятия.ВидМероприятия,
	               |	торо_ЗавершенныеМероприятия.ID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ТаблицаЗавершенныхМероприятий.ВидМероприятия КАК ВидМероприятия,
	               |	ЕСТЬNULL(ТаблицаЗавершенныхМероприятий.ДатаНачалаПлан, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ПланДатаНачалаРемонтныхРабот,
	               |	ЕСТЬNULL(ТаблицаЗавершенныхМероприятий.ДатаОкончанияПлан, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ПланДатаЗавершенияРемонтныхРабот,
	               |	ЕСТЬNULL(ТаблицаЗавершенныхМероприятий.ДатаНачалаФакт, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ФактДатаНачалаРемонтныхРабот,
	               |	ЕСТЬNULL(ТаблицаЗавершенныхМероприятий.ДатаОкончанияФакт, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ФактДатаЗавершенияРемонтныхРабот
	               |ИЗ
	               |	ТаблицаЗавершенныхМероприятий КАК ТаблицаЗавершенныхМероприятий
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВидМероприятия.Наименование,
	               |	ПланДатаНачалаРемонтныхРабот";
	
	Запрос.УстановитьПараметр("ОбъектРемонта", ЗаголовокИОсновныеДанные.Ссылка);
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ТблШпВыполненныеРМ"),ТабДок);
		Выборка = Результат.Выбрать();
		Область = Макет.ПолучитьОбласть("ТблВыполненныеРМ");
		
		Пока Выборка.Следующий() Цикл
			Область.Параметры.Заполнить(Выборка);
			Область.Параметры.ВидМероприятия = торо_ЗаполнениеДокументов.ПолучитьПредоставленияВРДляПечати(Выборка.ВидМероприятия);
			ТабДок.Вывести(Область, Выборка.Уровень()); 
		КонецЦикла;
	КонецЕсли; 

КонецПроцедуры 

Процедура ПечатьПаспортаОР_НормативныеРемонты(ТабДок, Макет, ЗаголовокИОсновныеДанные)
	
	ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("НормативныеРемонты"),ТабДок);
	
	// Область "ТаблНормативныеРемонты" 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_НормативныеРемонтыОборудования.ОбъектРемонта,
	|	торо_НормативныеРемонтыОборудования.ВидРемонта,
	|	торо_НормативныеРемонтыОборудования.НормативныйРемонт,
	|	торо_НормативныеРемонтыОборудования.СпособПланирования,
	|	торо_НормативныеРемонтыОборудования.ГрафикРемонтныхРабот,
	|	торо_НормативныеРемонтыОборудования.СпособВыполнения,
	|	торо_НормативныеРемонтыОборудования.НеИспользоватьВПланированииДатуВводаВЭксплуатацию,
	|	торо_НормативныеРемонтыОборудования.СпособУчетаДатыОтсчета
	|ПОМЕСТИТЬ НормРемонты
	|ИЗ
	|	РегистрСведений.торо_НормативныеРемонтыОборудования КАК торо_НормативныеРемонтыОборудования
	|ГДЕ
	|	торо_НормативныеРемонтыОборудования.ОбъектРемонта = &ОР
	|	И торо_НормативныеРемонтыОборудования.Приоритет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ПредшествующиеНормативныеРемонтыОборудования.ВидРемонта,
	|	торо_ПредшествующиеНормативныеРемонтыОборудования.ОбъектРемонта,
	|	торо_ПредшествующиеНормативныеРемонтыОборудования.ПредшествующийВидРемонта
	|ПОМЕСТИТЬ ПредшРемонты
	|ИЗ
	|	РегистрСведений.торо_ПредшествующиеНормативныеРемонтыОборудования КАК торо_ПредшествующиеНормативныеРемонтыОборудования
	|ГДЕ
	|	торо_ПредшествующиеНормативныеРемонтыОборудования.ОбъектРемонта = &ОР
	|	И торо_ПредшествующиеНормативныеРемонтыОборудования.Приоритет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.ВидРемонта,
	|	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.ОбъектРемонта,
	|	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.ЗамещаемыйВидРемонта,
	|	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.СпособЗамещения,
	|	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.НачальнаяГраница,
	|	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.КонечнаяГраница
	|ПОМЕСТИТЬ ПараметрыЗамещения
	|ИЗ
	|	РегистрСведений.торо_ПараметрыЗамещенияПланированияРемонтныхРабот КАК торо_ПараметрыЗамещенияПланированияРемонтныхРабот
	|ГДЕ
	|	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.ОбъектРемонта = &ОР
	|	И торо_ПараметрыЗамещенияПланированияРемонтныхРабот.Приоритет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НормРемонты.ВидРемонта,
	|	НормРемонты.НормативныйРемонт,
	|	НормРемонты.СпособПланирования,
	|	НормРемонты.ГрафикРемонтныхРабот,
	|	НормРемонты.СпособВыполнения,
	|	НормРемонты.НеИспользоватьВПланированииДатуВводаВЭксплуатацию,
	|	НормРемонты.СпособУчетаДатыОтсчета,
	|	""Предшеств"" КАК Груп,
	|	NULL КАК ЗамещаемыйВидРемонта,
	|	NULL КАК НачальнаяГраница,
	|	NULL КАК КонечнаяГраница,
	|	NULL КАК СпособЗамещения,
	|	ПредшРемонты.ПредшествующийВидРемонта
	|ПОМЕСТИТЬ ИтогТаб
	|ИЗ
	|	НормРемонты КАК НормРемонты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПредшРемонты КАК ПредшРемонты
	|		ПО НормРемонты.ОбъектРемонта = ПредшРемонты.ОбъектРемонта
	|			И НормРемонты.ВидРемонта = ПредшРемонты.ВидРемонта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НормРемонты.ВидРемонта,
	|	НормРемонты.НормативныйРемонт,
	|	НормРемонты.СпособПланирования,
	|	НормРемонты.ГрафикРемонтныхРабот,
	|	НормРемонты.СпособВыполнения,
	|	НормРемонты.НеИспользоватьВПланированииДатуВводаВЭксплуатацию,
	|	НормРемонты.СпособУчетаДатыОтсчета,
	|	""Зам"",
	|	ПараметрыЗамещения.ЗамещаемыйВидРемонта,
	|	ПараметрыЗамещения.НачальнаяГраница,
	|	ПараметрыЗамещения.КонечнаяГраница,
	|	ПараметрыЗамещения.СпособЗамещения,
	|	NULL
	|ИЗ
	|	НормРемонты КАК НормРемонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПараметрыЗамещения КАК ПараметрыЗамещения
	|		ПО НормРемонты.ОбъектРемонта = ПараметрыЗамещения.ОбъектРемонта
	|			И НормРемонты.ВидРемонта = ПараметрыЗамещения.ВидРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтогТаб.ВидРемонта КАК ВидРемонта,
	|	ИтогТаб.НормативныйРемонт КАК НормативныйРемонт,
	|	ИтогТаб.СпособПланирования КАК СпособПланирования,
	|	ИтогТаб.ГрафикРемонтныхРабот КАК ГрафикРемонтныхРабот,
	|	ИтогТаб.СпособВыполнения КАК СпособВыполнения,
	|	ИтогТаб.НеИспользоватьВПланированииДатуВводаВЭксплуатацию КАК НеИспользоватьВПланированииДатуВводаВЭксплуатацию,
	|	ИтогТаб.СпособУчетаДатыОтсчета КАК СпособУчетаДатыОтсчета,
	|	ИтогТаб.Груп КАК Груп,
	|	ИтогТаб.ЗамещаемыйВидРемонта,
	|	ИтогТаб.НачальнаяГраница,
	|	ИтогТаб.КонечнаяГраница,
	|	ИтогТаб.СпособЗамещения,
	|	ИтогТаб.ПредшествующийВидРемонта
	|ИЗ
	|	ИтогТаб КАК ИтогТаб
	|ИТОГИ
	|	МИНИМУМ(НормативныйРемонт),
	|	МИНИМУМ(СпособПланирования),
	|	МИНИМУМ(ГрафикРемонтныхРабот),
	|	МИНИМУМ(СпособВыполнения),
	|	МИНИМУМ(НеИспользоватьВПланированииДатуВводаВЭксплуатацию),
	|	МИНИМУМ(СпособУчетаДатыОтсчета)
	|ПО
	|	ВидРемонта,
	|	Груп";
	
	Запрос.УстановитьПараметр("ОР", ЗаголовокИОсновныеДанные.Ссылка);
	
	Результат = Запрос.Выполнить();
	ВыборкаПервогоУровня = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	ВидНормативногоРемонта = Макет.ПолучитьОбласть     ("ВидНормативногоРемонта");
	ЗаголовокНормативныеРемонты = Макет.ПолучитьОбласть("ЗаголовокНормативныеРемонты");
	ТаблНормативныеРемонты = Макет.ПолучитьОбласть     ("ТаблНормативныеРемонты");
	
	Пока ВыборкаПервогоУровня.Следующий() Цикл
		
		ЗаполнитьИВывестиОбласть(ВидНормативногоРемонта,ТабДок,ВыборкаПервогоУровня);
		ТабДок.Вывести(ЗаголовокНормативныеРемонты);
		ЗаполнитьИВывестиОбласть(ТаблНормативныеРемонты,ТабДок,ВыборкаПервогоУровня);
		
		ВыборкаВторогоУровня = ВыборкаПервогоУровня.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
		Пока ВыборкаВторогоУровня.Следующий() Цикл 
			Если ВыборкаВторогоУровня.Груп = "Предшеств" Тогда 
				ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ЗаголовокПредшРем"),ТабДок);
				ТаблПредшРем = Макет.ПолучитьОбласть("ТаблПредшРем");
				ВыборкаТретьегоУровня = ВыборкаВторогоУровня.Выбрать(ОбходРезультатаЗапроса.Прямой);
				
				Пока ВыборкаТретьегоУровня.Следующий() Цикл 
					ЗаполнитьИВывестиОбласть(ТаблПредшРем,ТабДок,ВыборкаТретьегоУровня);
				КонецЦикла;
				
			ИначеЕсли ВыборкаВторогоУровня.Груп = "Зам" Тогда 
				ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ЗаголовокЗамещРем"),ТабДок);
				ТаблЗамещРем = Макет.ПолучитьОбласть("ТаблЗамещРем");
				ВыборкаТретьегоУровня = ВыборкаВторогоУровня.Выбрать(ОбходРезультатаЗапроса.Прямой);
				
				Пока ВыборкаТретьегоУровня.Следующий() Цикл 
					ЗаполнитьИВывестиОбласть(ТаблЗамещРем,ТабДок,ВыборкаТретьегоУровня);
				КонецЦикла; 
				
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПечатьПаспортаОР_СоставТехКарт(ТабДок, Макет, ЗаголовокИОсновныеДанные)
	
	ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ТехКартыРемонта"),ТабДок);
	
	//////////////////////////////////////////////////////////////////////////	
	
	// Область "ТаблВидыРемонта"  	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	торо_НормативныеРемонтыОборудования.ОбъектРемонта,
	|	торо_НормативныеРемонтыОборудования.ВидРемонта,
	|	торо_НормативныеРемонтыОборудования.НормативныйРемонт
	|ПОМЕСТИТЬ ВсеНормативы
	|ИЗ
	|	РегистрСведений.торо_НормативныеРемонтыОборудования КАК торо_НормативныеРемонтыОборудования
	|ГДЕ
	|	торо_НормативныеРемонтыОборудования.ОбъектРемонта = &ОР
	|	И торо_НормативныеРемонтыОборудования.Приоритет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ТехКарты_СписокОпераций.Ссылка КАК ТехКарта,
	|	торо_ТехКарты_СписокОпераций.Продолжительность,
	|	торо_ТехКарты_СписокОпераций.ID,
	|	ВЫБОР
	|		КОГДА торо_ТехКарты_СписокОпераций.Операция.НаименованиеДляПечати = """"
	|			ТОГДА торо_ТехКарты_СписокОпераций.Операция.Наименование
	|		ИНАЧЕ торо_ТехКарты_СписокОпераций.Операция.НаименованиеДляПечати
	|   КОНЕЦ КАК Операция,
	|	торо_ТехКарты_СписокОпераций.Ссылка,
	|	торо_ТехКарты_СписокОпераций.СпособВыполнения,
	|	торо_ТехКарты_СписокОпераций.Количество КАК Кратность,
	|	ВсеНормативы.ВидРемонта КАК ВидРемонта,
	|	ВсеНормативы.НормативныйРемонт
	|ПОМЕСТИТЬ СписокОпераций
	|ИЗ
	|	ВсеНормативы КАК ВсеНормативы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВерсииТехКарт.СрезПоследних(
	|				,
	|				ИдентификаторТехКарты В
	|					(ВЫБРАТЬ
	|						ВсеНормативы.НормативныйРемонт
	|					ИЗ
	|						ВсеНормативы КАК ВсеНормативы)) КАК торо_ВерсииТехКартСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ТехКарты.СписокОпераций КАК торо_ТехКарты_СписокОпераций
	|			ПО торо_ВерсииТехКартСрезПоследних.ТехКарта = торо_ТехКарты_СписокОпераций.Ссылка
	|		ПО ВсеНормативы.НормативныйРемонт = торо_ВерсииТехКартСрезПоследних.ИдентификаторТехКарты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_НормыЗапчастейНаОбъектыРемонта.ОбъектРемонта КАК ОбъектРемонта,
	|	СписокОпераций.ВидРемонта КАК ВидРемонта,
	|	СписокОпераций.НормативныйРемонт КАК НормативныйРемонт,
	|	торо_НормыЗапчастейНаОбъектыРемонта.Номенклатура КАК Номенклатура,
	|	торо_НормыЗапчастейНаОбъектыРемонта.Количество КАК Количество,
	|	торо_НормыЗапчастейНаОбъектыРемонта.Характеристика КАК Характеристика,
	|	ИСТИНА КАК Приоритет,
	|	торо_НормыЗапчастейНаОбъектыРемонта.Номенклатура.ЕдиницаИзмерения КАК НоменклатураЕдиницаИзмерения
	|ПОМЕСТИТЬ МинимПриоритеты
	|ИЗ
	|	СписокОпераций КАК СписокОпераций
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_НормыЗапчастейНаОбъектыРемонта КАК торо_НормыЗапчастейНаОбъектыРемонта
	|		ПО СписокОпераций.ВидРемонта = торо_НормыЗапчастейНаОбъектыРемонта.ВидРемонта
	|			И (торо_НормыЗапчастейНаОбъектыРемонта.Приоритет)
	|ГДЕ
	|	торо_НормыЗапчастейНаОбъектыРемонта.ОбъектРемонта = &ОР
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокОпераций.ВидРемонта КАК ВидРемонта,
	|	СписокОпераций.НормативныйРемонт КАК НормативныйРемонт,
	|	СписокОпераций.Операция КАК Операция,
	|	СписокОпераций.Продолжительность КАК Продолжительность,
	|	СписокОпераций.СпособВыполнения КАК СпособВыполнения,
	|	""Материалы"" КАК ДопКолонка,
	|	торо_РемонтыМатериальныеЗатраты.Номенклатура КАК Номенклатура,
	|	торо_РемонтыМатериальныеЗатраты.КоличествоУпаковок КАК Количество,
	|   торо_РемонтыМатериальныеЗатраты.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА торо_РемонтыМатериальныеЗатраты.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА торо_РемонтыМатериальныеЗатраты.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ торо_РемонтыМатериальныеЗатраты.Упаковка
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) * торо_РемонтыМатериальныеЗатраты.Количество * ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) / ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 1) КАК Сумма,
	|	NULL КАК Квалификация,
	|	NULL КАК ВремяРаботы,
	|	NULL КАК Инструмент,
	|	NULL КАК Показатель,
	|	NULL КАК МерыБезопасности,
	|	NULL КАК НомерСтроки
	|ИЗ
	|	Справочник.торо_ТехКарты.МатериальныеЗатраты КАК торо_РемонтыМатериальныеЗатраты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокОпераций КАК СписокОпераций
	|		ПО торо_РемонтыМатериальныеЗатраты.Ссылка = СписокОпераций.Ссылка
	|			И торо_РемонтыМатериальныеЗатраты.ID = СписокОпераций.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ТекущаяДата, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ТекущаяДата, ) КАК КурсыВалютСрезПоследних
	|			ПО ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютСрезПоследних.Валюта
	|		ПО торо_РемонтыМатериальныеЗатраты.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СписокОпераций.ВидРемонта,
	|	СписокОпераций.НормативныйРемонт,
	|	СписокОпераций.Операция,
	|	СписокОпераций.Продолжительность,
	|	СписокОпераций.СпособВыполнения,
	|	""Трудозатраты"",
	|	NULL,
	|	торо_РемонтыТрудовыеЗатраты.Количество,
	|	NULL,   
	|	NULL,
	|	ВЫРАЗИТЬ(торо_СтоимостьЧасаКвалификации.Стоимость * торо_РемонтыТрудовыеЗатраты.Количество * торо_РемонтыТрудовыеЗатраты.ВремяРаботы / 3600 * ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) / ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 1) КАК ЧИСЛО(10, 2)),
	|	торо_РемонтыТрудовыеЗатраты.Квалификация,
	|	торо_РемонтыТрудовыеЗатраты.ВремяРаботы,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	Справочник.торо_ТехКарты.ТрудовыеЗатраты КАК торо_РемонтыТрудовыеЗатраты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокОпераций КАК СписокОпераций
	|		ПО торо_РемонтыТрудовыеЗатраты.Ссылка = СписокОпераций.Ссылка
	|			И торо_РемонтыТрудовыеЗатраты.ID = СписокОпераций.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_СтоимостьЧасаКвалификации.СрезПоследних КАК торо_СтоимостьЧасаКвалификации
	|		ПО торо_РемонтыТрудовыеЗатраты.Квалификация = торо_СтоимостьЧасаКвалификации.Квалификация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних КАК КурсыВалютСрезПоследних
	|		ПО (торо_СтоимостьЧасаКвалификации.Валюта = КурсыВалютСрезПоследних.Валюта)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СписокОпераций.ВидРемонта,
	|	СписокОпераций.НормативныйРемонт,
	|	СписокОпераций.Операция,
	|	СписокОпераций.Продолжительность,
	|	СписокОпераций.СпособВыполнения,
	|	""Инструменты"",
	|	NULL,
	|	торо_РемонтыИнструментыИТехника.КоличествоУпаковок,
	|	NULL,
	|	ВЫБОР
	|		КОГДА торо_РемонтыИнструментыИТехника.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА торо_РемонтыИнструментыИТехника.Инструмент.ЕдиницаИзмерения
	|		ИНАЧЕ торо_РемонтыИнструментыИТехника.Упаковка
	|	КОНЕЦ,
	|	NULL,
	|	NULL,
	|	NULL,
	|	торо_РемонтыИнструментыИТехника.Инструмент,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	Справочник.торо_ТехКарты.ИнструментыИТехника КАК торо_РемонтыИнструментыИТехника
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокОпераций КАК СписокОпераций
	|		ПО торо_РемонтыИнструментыИТехника.Ссылка = СписокОпераций.Ссылка
	|			И торо_РемонтыИнструментыИТехника.ID = СписокОпераций.ID
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СписокОпераций.ВидРемонта,
	|	СписокОпераций.НормативныйРемонт,
	|	СписокОпераций.Операция,
	|	СписокОпераций.Продолжительность,
	|	СписокОпераций.СпособВыполнения,
	|	""Показатели"",
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	торо_РемонтыИзмеряемыеПоказатели.Показатель,
	|	NULL,
	|	NULL
	|ИЗ
	|	Справочник.торо_ТехКарты.ИзмеряемыеПоказатели КАК торо_РемонтыИзмеряемыеПоказатели
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокОпераций КАК СписокОпераций
	|		ПО торо_РемонтыИзмеряемыеПоказатели.Ссылка = СписокОпераций.Ссылка
	|			И торо_РемонтыИзмеряемыеПоказатели.ID = СписокОпераций.ID
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СписокОпераций.ВидРемонта,
	|	СписокОпераций.НормативныйРемонт,
	|	""ДокИУслуги"",
	|	NULL,
	|	NULL,
	|	""МерыБезопасности"",
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	торо_ТехКартыМерыБезопасности.МераБезопасности,
	|	торо_ТехКартыМерыБезопасности.НомерСтроки
	|ИЗ
	|	Справочник.торо_ТехКарты.МерыБезопасности КАК торо_ТехКартыМерыБезопасности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокОпераций КАК СписокОпераций
	|		ПО торо_ТехКартыМерыБезопасности.Ссылка = СписокОпераций.Ссылка
	|			И торо_ТехКартыМерыБезопасности.ID = СписокОпераций.ID
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МинимПриоритеты.ВидРемонта,
	|	МинимПриоритеты.НормативныйРемонт,
	|	""ДокИУслуги"",
	|	NULL,
	|	NULL,
	|	""Номенклатура"",
	|	МинимПриоритеты.Номенклатура,
	|	МинимПриоритеты.Количество,
	|	МинимПриоритеты.Характеристика,
	|	МинимПриоритеты.НоменклатураЕдиницаИзмерения,
	|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) * МинимПриоритеты.Количество * ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) / ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 1),
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	МинимПриоритеты КАК МинимПриоритеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ТекущаяДата, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ТекущаяДата, ) КАК КурсыВалютСрезПоследних
	|			ПО ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютСрезПоследних.Валюта
	|		ПО МинимПриоритеты.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И МинимПриоритеты.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
	|ИТОГИ
	|	МАКСИМУМ(НормативныйРемонт),
	|	МАКСИМУМ(Продолжительность),
	|	МАКСИМУМ(СпособВыполнения),
	|	СУММА(Сумма)
	|ПО
	|	ВидРемонта,
	|	Операция,
	|	ДопКолонка";
	
	Запрос.УстановитьПараметр("ОР", ЗаголовокИОсновныеДанные.Ссылка);
	Запрос.УстановитьПараметр("ГР", ЗаголовокИОсновныеДанные.ТиповойОР);
	Запрос.УстановитьПараметр("ВидЦены", Константы.торо_ТипЦеныДляРасчетаСебестоимостиРемонта.Получить());
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Результат = Запрос.Выполнить();
	ВыборкаПервогоУровня = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	ЗаголовокВидыРемонта = Макет.ПолучитьОбласть("ЗаголовокВидыРемонта");
	ТаблВидыРемонта = Макет.ПолучитьОбласть("ТаблВидыРемонта");
	ИспользоватьХарактеристики = Константы.торо_ИспользоватьХарактеристикиНоменклатуры.Получить();
	
	Пока ВыборкаПервогоУровня.Следующий() Цикл
		
		ТабДок.Вывести(ЗаголовокВидыРемонта);
		
		ЗаполнитьИВывестиОбласть(ТаблВидыРемонта,ТабДок,ВыборкаПервогоУровня);
		
		Если ИспользоватьХарактеристики Тогда
			ЗаголовокИнструкции = Макет.ПолучитьОбласть("ЗаголовокИнструкции");			
			ЗаголовокНоменклатура = Макет.ПолучитьОбласть("ЗаголовокНоменклатураФО"); 
		Иначе
			ЗаголовокИнструкции = Макет.ПолучитьОбласть("ЗаголовокИнструкции");			
			ЗаголовокНоменклатура = Макет.ПолучитьОбласть("ЗаголовокНоменклатура"); 
		КонецЕсли;
		
		ВыборкаВторогоУровня = ВыборкаПервогоУровня.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		Пока ВыборкаВторогоУровня.Следующий() Цикл 						
			
			Если ВыборкаВторогоУровня.Операция <> "ДокИУслуги" Тогда
				ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ТаблСписокОпераций"),ТабДок,ВыборкаВторогоУровня);
				ВыборкаТретьегоУровня = ВыборкаВторогоУровня.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);			
				
				Пока ВыборкаТретьегоУровня.Следующий() Цикл 
					
					Если ВыборкаТретьегоУровня.ДопКолонка = "Материалы" Тогда
						Если ИспользоватьХарактеристики Тогда 
							ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ЗаголовокМатерЗатратыФО"),ТабДок);
						Иначе
							ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ЗаголовокМатерЗатраты"),ТабДок);
						КонецЕсли;
						ВыборкаЧетвертогоУровня = ВыборкаТретьегоУровня.Выбрать(ОбходРезультатаЗапроса.Прямой);
						
						Пока ВыборкаЧетвертогоУровня.Следующий() Цикл 
							Если ИспользоватьХарактеристики Тогда 
								ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ТаблМатерЗатратыФО"),ТабДок, ВыборкаЧетвертогоУровня);
							Иначе 
								ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ТаблМатерЗатраты"),ТабДок, ВыборкаЧетвертогоУровня);
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
					
					Если ВыборкаТретьегоУровня.ДопКолонка = "Трудозатраты" Тогда
						ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ЗаголовокКвалификация"),ТабДок); 												
						ВыборкаЧетвертогоУровня = ВыборкаТретьегоУровня.Выбрать(ОбходРезультатаЗапроса.Прямой);						
						
						Пока ВыборкаЧетвертогоУровня.Следующий() Цикл
							Если ЗначениеЗаполнено(ВыборкаЧетвертогоУровня.Квалификация)Тогда 
								Область = Макет.ПолучитьОбласть("ТаблКвалификация");
								ЗаполнитьЗначенияСвойств(Область.Параметры,ВыборкаЧетвертогоУровня);
								Область.Параметры.ВремяРаботы = ПреобразоватьСекундыВоВремя(ВыборкаЧетвертогоУровня.ВремяРаботы);
								Табдок.Вывести(Область);
							КонецЕсли;	
						КонецЦикла;
					КонецЕсли;
					
					Если ВыборкаТретьегоУровня.ДопКолонка = "Инструменты" Тогда
						ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ЗаголовокИнструменты"),ТабДок);									
						ВыборкаЧетвертогоУровня = ВыборкаТретьегоУровня.Выбрать(ОбходРезультатаЗапроса.Прямой); 						
						ТаблИнструменты = Макет.ПолучитьОбласть("ТаблИнструменты");
						Пока ВыборкаЧетвертогоУровня.Следующий() Цикл 
							Если  ЗначениеЗаполнено(ВыборкаЧетвертогоУровня.Инструмент)Тогда 
								ЗаполнитьИВывестиОбласть(ТаблИнструменты, ТабДок, ВыборкаЧетвертогоУровня);
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
					
					Если ВыборкаТретьегоУровня.ДопКолонка = "Показатели" Тогда
						
						ВыборкаЧетвертогоУровня = ВыборкаТретьегоУровня.Выбрать(ОбходРезультатаЗапроса.Прямой);
						ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ЗаголовокИзмерПоказатели"),ТабДок); 					
						ТаблИзмерПоказатели = Макет.ПолучитьОбласть("ТаблИзмерПоказатели");
						
						Пока ВыборкаЧетвертогоУровня.Следующий() Цикл 
							Если  ЗначениеЗаполнено(ВыборкаЧетвертогоУровня.Показатель)Тогда
								ЗаполнитьИВывестиОбласть(ТаблИзмерПоказатели,ТабДок,ВыборкаЧетвертогоУровня);
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
					
				КонецЦикла;
				
				Граница = Макет.ПолучитьОбласть("Граница");
				ТабДок.Вывести(Граница);
				
			Иначе  					               
				
				ВыборкаТретьегоУровня = ВыборкаВторогоУровня.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
				Пока ВыборкаТретьегоУровня.Следующий() Цикл 
					
					Если ВыборкаТретьегоУровня.ДопКолонка = "Номенклатура" Тогда
						ТабДок.Вывести(ЗаголовокНоменклатура); 
						ВыборкаЧетвертогоУровня = ВыборкаТретьегоУровня.Выбрать(ОбходРезультатаЗапроса.Прямой);
						Пока ВыборкаЧетвертогоУровня.Следующий() Цикл
							Если ИспользоватьХарактеристики Тогда
								ТаблНоменклитура = Макет.ПолучитьОбласть("ТаблНоменклитураФО");	
							Иначе 
								ТаблНоменклитура = Макет.ПолучитьОбласть("ТаблНоменклитура");
							КонецЕсли;
							ТаблНоменклитура.Параметры.Заполнить(ВыборкаЧетвертогоУровня);
							ТабДок.Вывести(ТаблНоменклитура, ВыборкаЧетвертогоУровня.Уровень()); 
						КонецЦикла;
					КонецЕсли;
					
					Если ВыборкаТретьегоУровня.ДопКолонка = "МерыБезопасности" Тогда
						ТабДок.Вывести(ЗаголовокИнструкции); 
						ВыборкаЧетвертогоУровня = ВыборкаТретьегоУровня.Выбрать(ОбходРезультатаЗапроса.Прямой);
						Пока ВыборкаЧетвертогоУровня.Следующий() Цикл 
							ТаблИнструкции = Макет.ПолучитьОбласть("ТаблИнструкции");
							ТаблИнструкции.Параметры.Заполнить(ВыборкаЧетвертогоУровня);
							ТабДок.Вывести(ТаблИнструкции, ВыборкаЧетвертогоУровня.Уровень()); 
						КонецЦикла;
					КонецЕсли;
					
				КонецЦикла;
				Граница = Макет.ПолучитьОбласть("Граница2");
				ТабДок.Вывести(Граница);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПечатьПаспортаОР_КоэффициентыРемонтныхОсобенностей(ТабДок, Макет, ЗаголовокИОсновныеДанные)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ЗначенияКоэффициентовРемонтныхОсобенностейСрезПоследних.Период КАК ДатаВвода,
	|	торо_ЗначенияКоэффициентовРемонтныхОсобенностейСрезПоследних.ВидКоэффициента КАК ВидКоэффициента,
	|	торо_ЗначенияКоэффициентовРемонтныхОсобенностейСрезПоследних.ЗначениеКоэффициента,
	|	торо_ВидыКоэффициентовРемонтныхОсобенностей.Рассчитываемый,
	|	торо_ВидыКоэффициентовРемонтныхОсобенностей.ЗависитОтНаработки,
	|	торо_ВидыКоэффициентовРемонтныхОсобенностей.СчитатьВозрастОтДатыИзготовления,
	|	торо_ВидыКоэффициентовРемонтныхОсобенностей.УчитыватьГрафикРаботыОборудования,
	|	торо_ВидыКоэффициентовРемонтныхОсобенностей.УчитыватьПростоиОборудования,
	|	торо_ВидыКоэффициентовРемонтныхОсобенностей.ПараметрНаработки
	|ИЗ
	|	РегистрСведений.торо_ЗначенияКоэффициентовРемонтныхОсобенностей.СрезПоследних(
	|			,
	|			ОбъектРемонта = &ОбъектРемонта
	|				И Использование) КАК торо_ЗначенияКоэффициентовРемонтныхОсобенностейСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ВидыКоэффициентовРемонтныхОсобенностей КАК торо_ВидыКоэффициентовРемонтныхОсобенностей
	|		ПО торо_ЗначенияКоэффициентовРемонтныхОсобенностейСрезПоследних.ВидКоэффициента = торо_ВидыКоэффициентовРемонтныхОсобенностей.Ссылка
	|ГДЕ
	|	НЕ торо_ВидыКоэффициентовРемонтныхОсобенностей.ПометкаУдаления";
	Запрос.УстановитьПараметр("ОбъектРемонта", ЗаголовокИОсновныеДанные.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаКоэффициентов = РезультатЗапроса.Выгрузить().СкопироватьКолонки("ДатаВвода,ВидКоэффициента, ЗначениеКоэффициента");
	ТаблицаКоэффициентов.Колонки.Добавить("Коэффициент");
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Рассчитываемый Тогда
			Если Выборка.ЗависитОтНаработки Тогда
				
				НаработкаОР = ВычислитьТекущееЗначениеНаработки(ЗаголовокИОсновныеДанные.Ссылка, Выборка.ПараметрНаработки, Выборка.УчитыватьПростоиОборудования);
				Если НЕ НаработкаОР = Неопределено Тогда
					СтруктураКоэффициент = ПолучитьРассчитываемыйКоэффициент(НаработкаОР, Выборка.ВидКоэффициента);
					Если НЕ СтруктураКоэффициент = Неопределено Тогда
						
						НС = ТаблицаКоэффициентов.Добавить();
						НС.ДатаВвода = Выборка.ДатаВвода;
						НС.ВидКоэффициента = Выборка.ВидКоэффициента;
						НС.ЗначениеКоэффициента = СтруктураКоэффициент.ЗначениеКоэффициента;
						НС.Коэффициент = СтруктураКоэффициент.Коэффициент;
						
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Если Выборка.УчитыватьГрафикРаботыОборудования Тогда
					ВозрастОР = ВычислитьВремяРаботыОборудованияСУчетомГрафика(ЗаголовокИОсновныеДанные.Ссылка,Выборка.СчитатьВозрастОтДатыИзготовления);	
				Иначе
					Если Выборка.СчитатьВозрастОтДатыИзготовления Тогда
						ВозрастОР = Год(ТекущаяДата()) - Год(ЗаголовокИОсновныеДанные.ДатаВыпуска) + 1;
					Иначе
						ВозрастОР = Год(ТекущаяДата()) - Год(ЗаголовокИОсновныеДанные.ДатаВводаВЭксплуатацию) + 1;
					КонецЕсли;
				КонецЕсли;
				
				СтруктураКоэффициент = ПолучитьРассчитываемыйКоэффициент(ВозрастОР, Выборка.ВидКоэффициента);
				Если НЕ СтруктураКоэффициент = Неопределено Тогда
					
					НС = ТаблицаКоэффициентов.Добавить();
					НС.ДатаВвода            = Выборка.ДатаВвода;
					НС.ВидКоэффициента      = Выборка.ВидКоэффициента;
					НС.ЗначениеКоэффициента = СтруктураКоэффициент.ЗначениеКоэффициента;
					НС.Коэффициент          = СтруктураКоэффициент.Коэффициент;
					
				КонецЕсли;
				
			КонецЕсли;
		Иначе
			НС = ТаблицаКоэффициентов.Добавить();
			НС.ДатаВвода            = Выборка.ДатаВвода;
			НС.ВидКоэффициента      = Выборка.ВидКоэффициента;
			НС.ЗначениеКоэффициента = Выборка.ЗначениеКоэффициента;
			НС.Коэффициент          = Выборка.ЗначениеКоэффициента.Коэффициент;
			
		КонецЕсли;
	КонецЦикла;
	
	Граница3 = Макет.ПолучитьОбласть("Граница3");
	ТабДок.Вывести(Граница3);
	
	// Заголовок
	ЗаголовокКоэфРемОсобенностей = Макет.ПолучитьОбласть("КоэффициентыРемонтныхОсобенностей");
	ТабДок.Вывести(ЗаголовокКоэфРемОсобенностей);
	
	// Шапка таблицы
	ШапкаКоэфРемОсобенностей = Макет.ПолучитьОбласть("ЗаголовокКоэфРемОсобенностей");
	ТабДок.Вывести(ШапкаКоэфРемОсобенностей);
	
	// Таблица
	Для Каждого Строка Из ТаблицаКоэффициентов Цикл
		СтрокаТаблицы = Макет.ПолучитьОбласть("ТаблКоэфРемОсобенностей");
		СтрокаТаблицы.Параметры.ДатаВвода            = Строка.ДатаВвода;
		СтрокаТаблицы.Параметры.ВидКоэффициента      = Строка.ВидКоэффициента;
		СтрокаТаблицы.Параметры.ЗначениеКоэффициента = Строка.ЗначениеКоэффициента;
		СтрокаТаблицы.Параметры.Коэффициент          = Строка.Коэффициент;
		ТабДок.Вывести(СтрокаТаблицы);
	КонецЦикла;                         
	
	Граница4 = Макет.ПолучитьОбласть("Граница4");
	ТабДок.Вывести(Граница4);
	
КонецПроцедуры

Процедура ЗаполнитьИВывестиОбласть(Область,ТабДок, ДанныеЗаполнения = Неопределено, ДатаСнятия = Неопределено)
	
	Если ДанныеЗаполнения = Неопределено Тогда
		
		ТабДок.Вывести(Область);
		
	Иначе
		ЗаполнитьЗначенияСвойств(Область.Параметры,ДанныеЗаполнения);
		Если ДатаСнятия <> Неопределено И ТипЗнч(ДатаСнятия) = Тип("Дата") Тогда  
			Область.Параметры.ДатаСнятияСУчета = ДатаСнятия;
		КонецЕсли;
		
		// Обработка представления видов ремонта для печати
		Для Инд = 0 по Область.Параметры.Количество()-1 Цикл
			ТекПараметр = Область.Параметры.Получить(Инд);
			Если ТипЗнч(ТекПараметр) = Тип("СправочникСсылка.торо_ВидыРемонтов") Тогда
				Область.Параметры.Установить(Инд, торо_ЗаполнениеДокументов.ПолучитьПредоставленияВРДляПечати(ТекПараметр));
			КонецЕсли;
		КонецЦикла;
		
		ТабДок.Вывести(Область);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПреобразоватьСекундыВоВремя(Секунды)
	
	Часы    = Цел(Секунды / 3600);
	Минуты  = Цел((Секунды - 3600 * Часы) / 60);
	Время = ""+Часы + "час. " + Минуты + "мин.";
	Возврат(Время);
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
