#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЭтоНовый() Тогда
		Если ПодразделениеИсполнитель <> Ссылка.ПодразделениеИсполнитель Тогда
			ДополнительныеСвойства.Вставить("НеобходимаРегистрацияЗаявокДляМобильныхБригад", Истина);
		КонецЕсли;
	Иначе
		Если ДополнительныеСвойства.Свойство("ТекСтруктураИерархии") И ДополнительныеСвойства.Свойство("РодительИерархии") Тогда
			СсылкаНаОбъект = торо_ОбщегоНазначения.ПолучитьСсылкуНаОбъект(ЭтотОбъект);
			
			Попытка
				торо_РаботаСИерархией20.ВключитьНовыйОбъектРемонтаВИерархию(СсылкаНаОбъект, ДополнительныеСвойства.ТекСтруктураИерархии, ДополнительныеСвойства.РодительИерархии, Отказ, ОбменДанными.Загрузка);
			Исключение
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Исключение'"), УровеньЖурналаРегистрации.Предупреждение, 
					Метаданные.Справочники.торо_ОбъектыРемонта,,ОписаниеОшибки());
				Отказ = Истина;
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ДополнительныеСвойства.Свойство("НеобходимаРегистрацияЗаявокДляМобильныхБригад") Тогда
		СтруктураПараметров = Новый Структура("ИзменениеОР, ОбъектРемонта", Истина, Ссылка);
		Обмен_mobileBrigades_События.ЗарегистрироватьЗаявкиПриИзмененииПараметров(СтруктураПараметров);
	КонецЕсли;
		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УдалитьНаборСвойств = Неопределено;
	НеУчаствуетВПланировании = Ложь;
		
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
			
		Если ДанныеЗаполнения.Свойство("Основание") Тогда 
			ТиповойОР = ДанныеЗаполнения.Основание; 
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("торо_ИспользоватьДокументыПринятияИСписанияОборудования") И НЕ ЭтоГруппа Тогда
		ЗначениеПеречисления = Перечисления.торо_СтатусыОРВУчете.НеПринятоКУчету;
		Структура = торо_СтатусыОРВУчете.НастройкиСтатуса(ЗначениеПеречисления);
		Если Структура <> Неопределено Тогда
			НеУчаствуетВПланировании = Структура.ЗначениеПоУмолчанию;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
		
		Если НЕ ЗначениеЗаполнено(Направление) Тогда 
			Направление = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР", "ОсновноеНаправлениеОР");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ПлановыйГрафикРаботы) Тогда 
			ПлановыйГрафикРаботы = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР", "ОсновнойГрафикРаботы");
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НеПроверяемыеРеквизиты = Новый Массив;
	
	Если не ЭтоГруппа Тогда
		Если ВнешнийОбъект Тогда
			НеПроверяемыеРеквизиты.Добавить("Организация");
		Иначе 
			НеПроверяемыеРеквизиты.Добавить("Контрагент");
		КонецЕсли;
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НеПроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Нужно проверить, остались ли родители группами.
	// Регистр торо_ОбъектыРемонтаГруппы используется только в иерархиях, неизменяемых документами.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ИерархическиеСтруктурыОР.СтруктураИерархии КАК СтруктураИерархии,
	|	торо_ИерархическиеСтруктурыОР.РодительИерархии КАК РодительИерархии
	|ПОМЕСТИТЬ ВТ_ТаблицаРодителейПоИерархиям
	|ИЗ
	|	РегистрСведений.торо_ИерархическиеСтруктурыОР КАК торо_ИерархическиеСтруктурыОР
	|ГДЕ
	|	торо_ИерархическиеСтруктурыОР.ОбъектИерархии = &ОбъектИерархии
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РодительИерархии,
	|	СтруктураИерархии
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ТаблицаРодителейПоИерархиям.СтруктураИерархии КАК СтруктураИерархии,
	|	ВТ_ТаблицаРодителейПоИерархиям.РодительИерархии КАК РодительИерархии,
	|	СУММА(ВЫБОР
	|			КОГДА торо_ИерархическиеСтруктурыОР.ОбъектИерархии = &ОбъектИерархии
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ) КАК НовоеКоличествоПодчиненных
	|ПОМЕСТИТЬ ВТ_НовоеКоличествоПодчиненных
	|ИЗ
	|	ВТ_ТаблицаРодителейПоИерархиям КАК ВТ_ТаблицаРодителейПоИерархиям
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИерархическиеСтруктурыОР КАК торо_ИерархическиеСтруктурыОР
	|		ПО ВТ_ТаблицаРодителейПоИерархиям.СтруктураИерархии = торо_ИерархическиеСтруктурыОР.СтруктураИерархии
	|			И ВТ_ТаблицаРодителейПоИерархиям.РодительИерархии = торо_ИерархическиеСтруктурыОР.РодительИерархии
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаРодителейПоИерархиям.СтруктураИерархии,
	|	ВТ_ТаблицаРодителейПоИерархиям.РодительИерархии
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РодительИерархии,
	|	СтруктураИерархии
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НовоеКоличествоПодчиненных.СтруктураИерархии КАК СтруктураИерархии,
	|	ВТ_НовоеКоличествоПодчиненных.РодительИерархии КАК РодительИерархии
	|ИЗ
	|	РегистрСведений.торо_ОбъектыРемонтаГруппы КАК торо_ОбъектыРемонтаГруппы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НовоеКоличествоПодчиненных КАК ВТ_НовоеКоличествоПодчиненных
	|		ПО торо_ОбъектыРемонтаГруппы.ОбъектИерархии = ВТ_НовоеКоличествоПодчиненных.РодительИерархии
	|			И торо_ОбъектыРемонтаГруппы.СтруктураИерархии = ВТ_НовоеКоличествоПодчиненных.СтруктураИерархии
	|ГДЕ
	|	ВТ_НовоеКоличествоПодчиненных.НовоеКоличествоПодчиненных = 0";
	
	Запрос.УстановитьПараметр("ОбъектИерархии", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		торо_РаботаСИерархией20.ИзменитьЗаписьВРСторо_ОбъектыРемонтаГруппы(Выборка.РодительИерархии, Выборка.СтруктураИерархии, Ложь);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли