
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПЕРЕМЕННЫЕ

перем СтруктураДанных Экспорт;  // Структура, хранящая данные для работы с уведомлениями.
Перем БезусловнаяЗапись Экспорт; // Отключает проверки при записи документа

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	
	Если Операции.Количество() = 0 Тогда
		ШаблонСообщения = НСтр("es='En el documento %1 no es rellenada la parte tabular ""las Reparaciones"". ¡La realización es imposible!';ru='В документе %1 не заполнена табличная часть ""Ремонты"". Проведение невозможно!';en='In the document%1, the tabular part ""Repairs"" is not filled. Conducting is impossible!'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, Ссылка);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;
	
	// регистр торо_ЗапланированныеПодрядчикиРемонтов	
	Движения.торо_ЗапланированныеПодрядчикиРемонтов.Записывать = Истина;

	Для Каждого ТекСтрокаОперации Из Операции Цикл
		Движение = Движения.торо_ЗапланированныеПодрядчикиРемонтов.Добавить();
		Движение.Период            = Дата;
		Движение.ID                = ТекСтрокаОперации.ID;
		Движение.Подрядчик         = Подрядчик;
		Движение.ДоговорПодрядчика = Договор;
	КонецЦикла;

	
КонецПроцедуры
#КонецОбласти

#КонецЕсли