#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Перем БезусловнаяЗапись Экспорт; // Отключает проверки при записи документа
перем СтруктураДанных Экспорт;  // Структура, хранящая данные для работы с уведомлениями.
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР", "ОсновнаяОрганизация");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР", "ОсновнойОтветственный");
		Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
			Ответственный = Пользователи.ТекущийПользователь();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ШаблонСообщения = НСтр("es='Para el índice %1 es indicada la fecha menos de fechas del documento. ¡El documento no puede ser pasado!';ru='Для показателя %1 указана дата меньше даты документа. Документ не может быть проведен!';en='For metric%1, the date is less than the date of the document. The document cannot be posted!'");
	
	Для Каждого Строка Из КлючевыеПоказатели Цикл
		Если Строка.ЗначениеПоказателяОграниченоПоВремени = Истина
			И Строка.ДатаПо < Дата тогда
			
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Строка.Показатель);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.торо_ЦелевыеЗначенияKPI.Записывать = Истина;
	Движения.торо_ЦелевыеЗначенияKPI.Очистить();
	
	Для Каждого ТекСтрока Из КлючевыеПоказатели Цикл
		Движение = Движения.торо_ЦелевыеЗначенияKPI.Добавить();
		Движение.Период = Дата;
		Движение.Организация = ТекСтрока.Организация;
		Движение.Подразделение = ТекСтрока.Подразделение;
		Движение.ОбъектРемонта = ТекСтрока.ОбъектРемонта;
		Движение.Показатель = ТекСтрока.Показатель;
		Движение.Значение = ТекСтрока.ЗначениеПоказателя;
		Движение.КритическоеЗначение = ТекСтрока.КритическоеЗначениеПоказателя;
		Движение.ДатаПо = ?(ТекСтрока.ЗначениеПоказателяОграниченоПоВремени, ТекСтрока.ДатаПО, '39991231235959');
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли