#Область ПрограммныйИнтерфейс

// Гкс+[TOIR20-469/TOIR20-591] Зозуля А.В. от 18.11.2024. Добавлено:{

// Вызывается при проведении документов торо_ВыявленныеДефекты и торо_АктОВыполненииЭтапаРабот.
// 
// Параметры:
//  ВладелецФайла - ДокументСсылка.торо_ВыявленныеДефекты, ДокументСсылка.торо_АктОВыполненииЭтапаРабот - 
//   владелец прикрепленных файлов.
// 
// Возвращаемое значение:
//  Булево -  Истина, если файлов нет.
Функция НетПрикрепленныхФайловДО(ВладелецФайла) Экспорт
    
    // Гкс+[TOIR20-681] Зозуля А.В. от 21.08.2025. Добавлено:{
	Если Пользователи.РолиДоступны("гкс_КлючевойПользователь", , Ложь) Тогда 
		Возврат Ложь;
	КонецЕсли;
	// } Гкс-[TOIR20-681] Зозуля А.В. от 21.08.2025.
    
	//Не записанные документы не могут иметь прикрепленные файлы в ДО 
	Если Не ЗначениеЗаполнено(ВладелецФайла) Тогда
		Возврат Истина;
	КонецЕсли;	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НаличиеПрикрепленныхФайловВДокументообороте.ИдентификаторФайла КАК ИдентификаторФайла
		|ИЗ
		|	РегистрСведений.гкс_НаличиеПрикрепленныхФайловВДокументообороте КАК НаличиеПрикрепленныхФайловВДокументообороте
		|ГДЕ
		|	НаличиеПрикрепленныхФайловВДокументообороте.ВладелецФайла = &ВладелецФайла";
	
	Запрос.УстановитьПараметр("ВладелецФайла", ВладелецФайла);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Пустой();
	
КонецФункции // } Гкс-[TOIR20-469/TOIR20-591] Зозуля А.В. от 18.11.2024.

#КонецОбласти 