
&ИзменениеИКонтроль("ДанныеИзЖурналаРегистрации")
Функция гкс_ДанныеИзЖурналаРегистрации(ПараметрыОтчета)

	// Подготовка параметров отчета.
	ДатаНачала = ПараметрыОтчета.ДатаНачала;
	ДатаОкончания = ПараметрыОтчета.ДатаОкончания;
	Пользователь = ПараметрыОтчета.Пользователь;
	ПользователиИГруппы = ПараметрыОтчета.ПользователиИГруппы;
	ВариантОтчета = ПараметрыОтчета.ВариантОтчета;

	Если ВариантОтчета = "АктивностьПользователя" Тогда
		ВыводитьБизнесПроцессы = ПараметрыОтчета.ВыводитьБизнесПроцессы;
		ВыводитьЗадачи = ПараметрыОтчета.ВыводитьЗадачи;
		ВыводитьСправочники = ПараметрыОтчета.ВыводитьСправочники;
		ВыводитьДокументы = ПараметрыОтчета.ВыводитьДокументы;
	Иначе
		ВыводитьСправочники = Истина;
		ВыводитьДокументы = Истина;
		ВыводитьБизнесПроцессы = Ложь;
		ВыводитьЗадачи = Ложь;
	КонецЕсли;

	// Формируем таблицу исходных данных.
	ИсходныеДанные = Новый ТаблицаЗначений();
	ИсходныеДанные.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ИсходныеДанные.Колонки.Добавить("Неделя", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(10)));
	ИсходныеДанные.Колонки.Добавить("Пользователь");
	ИсходныеДанные.Колонки.Добавить("ЧасовРаботы", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ИсходныеДанные.Колонки.Добавить("КоличествоЗапусков", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10)));
	ИсходныеДанные.Колонки.Добавить("СозданоДокументов", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10)));
	ИсходныеДанные.Колонки.Добавить("СозданоСправочников", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10)));
	ИсходныеДанные.Колонки.Добавить("ИзмененоДокументов", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10)));
	ИсходныеДанные.Колонки.Добавить("СозданоБизнесПроцессов",	Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10)));
	ИсходныеДанные.Колонки.Добавить("СозданоЗадач", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10)));
	ИсходныеДанные.Колонки.Добавить("ИзмененоБизнесПроцессов", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10)));
	ИсходныеДанные.Колонки.Добавить("ИзмененоЗадач", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10)));
	ИсходныеДанные.Колонки.Добавить("ИзмененоСправочников",	Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10)));
	ИсходныеДанные.Колонки.Добавить("Ошибок", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10)));
	ИсходныеДанные.Колонки.Добавить("Предупреждений", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10)));
	ИсходныеДанные.Колонки.Добавить("ВидОбъекта", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50)));
	ИсходныеДанные.Колонки.Добавить("ОбъектСправочникДокумент");

	// Расчет максимального количества одновременных сессий.
	ОдновременноСессий = Новый ТаблицаЗначений();
	ОдновременноСессий.Колонки.Добавить("ДатаОдновременноРаботавшихПользователей",
	Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ОдновременноСессий.Колонки.Добавить("ОдновременноРаботавшихПользователей",
	Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10)));
	ОдновременноСессий.Колонки.Добавить("СписокОдновременноРаботавшихПользователей");

	ДанныеЖурналаРегистрации = Новый ТаблицаЗначений;

	Уровни = Новый Массив;
	Уровни.Добавить(УровеньЖурналаРегистрации.Информация);

	События = Новый Массив;
	События.Добавить("_$Session$_.Start"); //  Начало сессии
	События.Добавить("_$Session$_.Finish"); //  Конец сессии  
	События.Добавить("_$Data$_.New"); // Добавление данных
	События.Добавить("_$Data$_.Update"); // Изменение данных

	ИмяПриложения = Новый Массив;
	ИмяПриложения.Добавить("1CV8C");
	ИмяПриложения.Добавить("WebClient");
	ИмяПриложения.Добавить("1CV8");

	ПользовательФильтр = Новый Массив;

	// Получаем список пользователей.
	Если ВариантОтчета = "АктивностьПользователя" Тогда
		#Вставка
		Если ТипЗнч(Пользователь) = Тип("СписокЗначений") Тогда
			Для Каждого Элемент Из Пользователь Цикл
				ПользователиДляАнализа(ПользовательФильтр, Элемент.Значение);
			КонецЦикла;
		Иначе
		#КонецВставки
		ПользовательФильтр.Добавить(ИмяПользователяИБ(Пользователь));
		#Вставка
		КонецЕсли;
		#КонецВставки
	ИначеЕсли ТипЗнч(ПользователиИГруппы) = Тип("СписокЗначений") Тогда

		Для Каждого Элемент Из ПользователиИГруппы Цикл
			ПользователиДляАнализа(ПользовательФильтр, Элемент.Значение);
		КонецЦикла;

	Иначе
		ПользователиДляАнализа(ПользовательФильтр, ПользователиИГруппы);
	КонецЕсли;

	ДатыВЧасовомПоясеСервера = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОтчета, "ДатыВЧасовомПоясеСервера", Ложь);
	Если ДатыВЧасовомПоясеСервера Тогда
		СмещениеВремениСервера = 0;
	Иначе
		СмещениеВремениСервера = ЖурналРегистрации.СмещениеВремениСервера();
	КонецЕсли;

	ОтборЖурналаРегистрации = Новый Структура;
	ОтборЖурналаРегистрации.Вставить("ДатаНачала", ДатаНачала + СмещениеВремениСервера);
	ОтборЖурналаРегистрации.Вставить("ДатаОкончания", ДатаОкончания + СмещениеВремениСервера);
	ОтборЖурналаРегистрации.Вставить("ИмяПриложения", ИмяПриложения);
	ОтборЖурналаРегистрации.Вставить("Уровень", Уровни);
	ОтборЖурналаРегистрации.Вставить("Событие", События);

	Если ПользовательФильтр.Количество() = 0 Тогда
		Возврат Новый Структура("АнализАктивностиПользователей, ОдновременноСессий, ОтчетПустой", ИсходныеДанные, ОдновременноСессий, Истина);
	КонецЕсли;

	Если ПользовательФильтр.Найти("ВсеПользователи") = Неопределено Тогда
		ОтборЖурналаРегистрации.Вставить("Пользователь", ПользовательФильтр);
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	ВыгрузитьЖурналРегистрации(ДанныеЖурналаРегистрации, ОтборЖурналаРегистрации);
	УстановитьПривилегированныйРежим(Ложь);

	ОтчетПустой = (ДанныеЖурналаРегистрации.Количество() = 0);

	ДанныеЖурналаРегистрации.Сортировать("Сеанс, Дата");

	// Добавляем соответствие УникальныйИдентификатор-ПользовательСсылка для дальнейшего использования.
	ИдентификаторыПользователей = ДанныеЖурналаРегистрации.ВыгрузитьКолонку("Пользователь");
	СоответствиеИдентификаторыПользователей = УникальныеИдентификаторыПользователей(ИдентификаторыПользователей);

	ТекущийСеанс        = Неопределено;
	ЧасовРаботы         = 0;
	КоличествоЗапусков  = 0;
	СозданоДокументов   = 0;
	СозданоСправочников = 0;
	ИзмененоДокументов  = 0;
	ИзмененоСправочников= 0;
	ВидОбъекта          = Неопределено;
	СтрокаИсходныхДанных= Неопределено;
	НачалоСеанса        = Неопределено;

	// Расчет данных, необходимых для составления отчета.
	Для Каждого СтрокаДанныхЖурналаРегистрации Из ДанныеЖурналаРегистрации Цикл
		СтрокаДанныхЖурналаРегистрации.Дата = СтрокаДанныхЖурналаРегистрации.Дата - СмещениеВремениСервера;
		Если СтрокаДанныхЖурналаРегистрации.ИмяПользователя = "" Тогда
			Продолжить;
		КонецЕсли;
		Сеанс = СтрокаДанныхЖурналаРегистрации.Сеанс; 

		Если Не ЗначениеЗаполнено(СтрокаДанныхЖурналаРегистрации.Сеанс)
			Или Не ЗначениеЗаполнено(СтрокаДанныхЖурналаРегистрации.Дата) Тогда
			Продолжить;
		КонецЕсли;

		ИмяПользователяСсылка = СоответствиеИдентификаторыПользователей[СтрокаДанныхЖурналаРегистрации.Пользователь];

		// Расчет продолжительности работы пользователей и количества запусков программы.
		Если ТекущийСеанс <> Сеанс
			Или СтрокаДанныхЖурналаРегистрации.Событие = "_$Session$_.Start" Тогда
			Если СтрокаИсходныхДанных <> Неопределено Тогда
				СтрокаИсходныхДанных.ЧасовРаботы  = ЧасовРаботы;
				СтрокаИсходныхДанных.КоличествоЗапусков = КоличествоЗапусков;
			КонецЕсли;
			СтрокаИсходныхДанных = ИсходныеДанные.Добавить();
			СтрокаИсходныхДанных.Дата		  = СтрокаДанныхЖурналаРегистрации.Дата;
			СтрокаИсходныхДанных.Неделя 	  = СтрокаНеделяГода(СтрокаДанныхЖурналаРегистрации.Дата);
			СтрокаИсходныхДанных.Пользователь = ИмяПользователяСсылка;
			ЧасовРаботы			= 0;
			КоличествоЗапусков	= 0; 
			ТекущийСеанс			= Сеанс; 
			НачалоСеанса		= СтрокаДанныхЖурналаРегистрации.Дата;
		КонецЕсли;

		Если СтрокаДанныхЖурналаРегистрации.Событие = "_$Session$_.Finish" Тогда

			КоличествоЗапусков	= КоличествоЗапусков + 1;
			Если НачалоСеанса <> Неопределено Тогда 

				// Проверяем закончился сеанс пользователя в этот же день или на следующий.
				Если НачалоДня(СтрокаДанныхЖурналаРегистрации.Дата) > НачалоДня(НачалоСеанса) Тогда
					// Если окончание сеанса произошло на следующий день, то необходимо заполнить часы работы за предыдущий день.
					Разность = КонецДня(НачалоСеанса) - НачалоСеанса;
					ЧасовРаботы = Разность/60/60;
					СтрокаИсходныхДанных.ЧасовРаботы = ЧасовРаботы;
					ДеньСеанса = КонецДня(НачалоСеанса) + 86400;
					Пока КонецДня(СтрокаДанныхЖурналаРегистрации.Дата) > ДеньСеанса Цикл
						СтрокаИсходныхДанных = ИсходныеДанные.Добавить();
						СтрокаИсходныхДанных.Дата = ДеньСеанса;
						СтрокаИсходныхДанных.Неделя 	  = СтрокаНеделяГода(СтрокаДанныхЖурналаРегистрации.Дата);
						СтрокаИсходныхДанных.Пользователь = ИмяПользователяСсылка;
						ЧасовРаботы = (ДеньСеанса - НачалоДня(ДеньСеанса))/60/60;
						СтрокаИсходныхДанных.ЧасовРаботы  = ЧасовРаботы;
						ДеньСеанса = ДеньСеанса + 86400;
					КонецЦикла;	
					СтрокаИсходныхДанных = ИсходныеДанные.Добавить();
					СтрокаИсходныхДанных.Дата = СтрокаДанныхЖурналаРегистрации.Дата;
					СтрокаИсходныхДанных.Неделя 	  = СтрокаНеделяГода(СтрокаДанныхЖурналаРегистрации.Дата);
					СтрокаИсходныхДанных.Пользователь = ИмяПользователяСсылка;
					ЧасовРаботы = (СтрокаДанныхЖурналаРегистрации.Дата - НачалоДня(ДеньСеанса))/60/60;
					СтрокаИсходныхДанных.ЧасовРаботы  = ЧасовРаботы;
				Иначе
					Разность =  (СтрокаДанныхЖурналаРегистрации.Дата - НачалоСеанса)/60/60;
					ЧасовРаботы = ЧасовРаботы + Разность;
				КонецЕсли;

			КонецЕсли;

		КонецЕсли;

		// Расчет количества созданных документов и справочников.
		Если СтрокаДанныхЖурналаРегистрации.Событие = "_$Data$_.New" Тогда

			Если СтрНайти(СтрокаДанныхЖурналаРегистрации.Метаданные, "Документ.") > 0 
				И ВыводитьДокументы Тогда
				ВидОбъекта = СтрокаДанныхЖурналаРегистрации.ПредставлениеМетаданных;
				ОбъектСправочникДокумент = СтрокаДанныхЖурналаРегистрации.Данные;
				СозданоДокументов = СозданоДокументов + 1;
				СтрокаИсходныхДанных = ИсходныеДанные.Добавить();
				СтрокаИсходныхДанных.Дата		  = СтрокаДанныхЖурналаРегистрации.Дата;
				СтрокаИсходныхДанных.Пользователь = ИмяПользователяСсылка;
				СтрокаИсходныхДанных.ВидОбъекта = ВидОбъекта;
				СтрокаИсходныхДанных.СозданоДокументов = СозданоДокументов;
				СтрокаИсходныхДанных.ОбъектСправочникДокумент = ОбъектСправочникДокумент;
				СтрокаИсходныхДанных.Неделя 	  = СтрокаНеделяГода(СтрокаДанныхЖурналаРегистрации.Дата); 
			КонецЕсли;

			Если СтрНайти(СтрокаДанныхЖурналаРегистрации.Метаданные, "Справочник.") > 0
				И ВыводитьСправочники Тогда
				ВидОбъекта = СтрокаДанныхЖурналаРегистрации.ПредставлениеМетаданных;
				ОбъектСправочникДокумент = СтрокаДанныхЖурналаРегистрации.Данные;
				СозданоСправочников = СозданоСправочников + 1;
				СтрокаИсходныхДанных = ИсходныеДанные.Добавить();
				СтрокаИсходныхДанных.Дата		  = СтрокаДанныхЖурналаРегистрации.Дата;
				СтрокаИсходныхДанных.Пользователь = ИмяПользователяСсылка;
				СтрокаИсходныхДанных.ВидОбъекта = ВидОбъекта;
				СтрокаИсходныхДанных.СозданоСправочников = СозданоСправочников;
				СтрокаИсходныхДанных.ОбъектСправочникДокумент = ОбъектСправочникДокумент;
				СтрокаИсходныхДанных.Неделя 	  = СтрокаНеделяГода(СтрокаДанныхЖурналаРегистрации.Дата);
			КонецЕсли;

		КонецЕсли;

		// Расчет количества измененных документов и справочников.
		Если СтрокаДанныхЖурналаРегистрации.Событие = "_$Data$_.Update" Тогда

			Если СтрНайти(СтрокаДанныхЖурналаРегистрации.Метаданные, "Документ.") > 0
				И ВыводитьДокументы Тогда
				ВидОбъекта = СтрокаДанныхЖурналаРегистрации.ПредставлениеМетаданных;
				ОбъектСправочникДокумент = СтрокаДанныхЖурналаРегистрации.Данные;
				ИзмененоДокументов = ИзмененоДокументов + 1;
				СтрокаИсходныхДанных = ИсходныеДанные.Добавить();
				СтрокаИсходныхДанных.Дата		  = СтрокаДанныхЖурналаРегистрации.Дата;
				СтрокаИсходныхДанных.Пользователь = ИмяПользователяСсылка;
				СтрокаИсходныхДанных.ИзмененоДокументов = ИзмененоДокументов;  	
				СтрокаИсходныхДанных.ВидОбъекта = ВидОбъекта;
				СтрокаИсходныхДанных.ОбъектСправочникДокумент = ОбъектСправочникДокумент;
				СтрокаИсходныхДанных.Неделя 	  = СтрокаНеделяГода(СтрокаДанныхЖурналаРегистрации.Дата);
			КонецЕсли;

			Если СтрНайти(СтрокаДанныхЖурналаРегистрации.Метаданные, "Справочник.") > 0
				И ВыводитьСправочники Тогда
				ВидОбъекта = СтрокаДанныхЖурналаРегистрации.ПредставлениеМетаданных;
				ОбъектСправочникДокумент = СтрокаДанныхЖурналаРегистрации.Данные;
				ИзмененоСправочников = ИзмененоСправочников + 1;
				СтрокаИсходныхДанных = ИсходныеДанные.Добавить();
				СтрокаИсходныхДанных.Дата		  = СтрокаДанныхЖурналаРегистрации.Дата;
				СтрокаИсходныхДанных.Пользователь = ИмяПользователяСсылка;
				СтрокаИсходныхДанных.ИзмененоСправочников = ИзмененоСправочников;
				СтрокаИсходныхДанных.ВидОбъекта = ВидОбъекта;
				СтрокаИсходныхДанных.ОбъектСправочникДокумент = ОбъектСправочникДокумент;
				СтрокаИсходныхДанных.Неделя 	  = СтрокаНеделяГода(СтрокаДанныхЖурналаРегистрации.Дата);
			КонецЕсли;

		КонецЕсли;

		// Расчет количества созданных БизнесПроцессов и Задач.
		Если СтрокаДанныхЖурналаРегистрации.Событие = "_$Data$_.New" Тогда

			Если СтрНайти(СтрокаДанныхЖурналаРегистрации.Метаданные, "БизнесПроцесс.") > 0 
				И ВыводитьБизнесПроцессы Тогда
				ВидОбъекта = СтрокаДанныхЖурналаРегистрации.ПредставлениеМетаданных;
				ОбъектСправочникДокумент = СтрокаДанныхЖурналаРегистрации.Данные;
				СозданоБизнесПроцессов = СозданоБизнесПроцессов + 1;
				СтрокаИсходныхДанных = ИсходныеДанные.Добавить();
				СтрокаИсходныхДанных.Дата		  = СтрокаДанныхЖурналаРегистрации.Дата;
				СтрокаИсходныхДанных.Пользователь = ИмяПользователяСсылка;
				СтрокаИсходныхДанных.ВидОбъекта = ВидОбъекта;
				СтрокаИсходныхДанных.СозданоБизнесПроцессов = СозданоБизнесПроцессов;
				СтрокаИсходныхДанных.ОбъектСправочникДокумент = ОбъектСправочникДокумент;
				СтрокаИсходныхДанных.Неделя 	  = СтрокаНеделяГода(СтрокаДанныхЖурналаРегистрации.Дата); 
			КонецЕсли;

			Если СтрНайти(СтрокаДанныхЖурналаРегистрации.Метаданные, "Задача.") > 0 
				И ВыводитьЗадачи Тогда
				ВидОбъекта = СтрокаДанныхЖурналаРегистрации.ПредставлениеМетаданных;
				ОбъектСправочникДокумент = СтрокаДанныхЖурналаРегистрации.Данные;
				СозданоЗадач = СозданоЗадач + 1;
				СтрокаИсходныхДанных = ИсходныеДанные.Добавить();
				СтрокаИсходныхДанных.Дата		  = СтрокаДанныхЖурналаРегистрации.Дата;
				СтрокаИсходныхДанных.Пользователь = ИмяПользователяСсылка;
				СтрокаИсходныхДанных.ВидОбъекта = ВидОбъекта;
				СтрокаИсходныхДанных.СозданоЗадач = СозданоЗадач;
				СтрокаИсходныхДанных.ОбъектСправочникДокумент = ОбъектСправочникДокумент;
				СтрокаИсходныхДанных.Неделя 	  = СтрокаНеделяГода(СтрокаДанныхЖурналаРегистрации.Дата);
			КонецЕсли;

		КонецЕсли;

		// Расчет количества измененных БизнесПроцессов и задач.
		Если СтрокаДанныхЖурналаРегистрации.Событие = "_$Data$_.Update" Тогда

			Если СтрНайти(СтрокаДанныхЖурналаРегистрации.Метаданные, "БизнесПроцесс.") > 0
				И ВыводитьБизнесПроцессы Тогда
				ВидОбъекта = СтрокаДанныхЖурналаРегистрации.ПредставлениеМетаданных;
				ОбъектСправочникДокумент = СтрокаДанныхЖурналаРегистрации.Данные;
				ИзмененоБизнесПроцессов = ИзмененоБизнесПроцессов + 1;
				СтрокаИсходныхДанных = ИсходныеДанные.Добавить();
				СтрокаИсходныхДанных.Дата		  = СтрокаДанныхЖурналаРегистрации.Дата;
				СтрокаИсходныхДанных.Пользователь = ИмяПользователяСсылка;
				СтрокаИсходныхДанных.ВидОбъекта = ВидОбъекта;
				СтрокаИсходныхДанных.ИзмененоБизнесПроцессов = ИзмененоБизнесПроцессов;
				СтрокаИсходныхДанных.ОбъектСправочникДокумент = ОбъектСправочникДокумент;
				СтрокаИсходныхДанных.Неделя 	  = СтрокаНеделяГода(СтрокаДанныхЖурналаРегистрации.Дата);
			КонецЕсли;

			Если СтрНайти(СтрокаДанныхЖурналаРегистрации.Метаданные, "Задача.") > 0 
				И ВыводитьЗадачи Тогда
				ВидОбъекта = СтрокаДанныхЖурналаРегистрации.ПредставлениеМетаданных;
				ОбъектСправочникДокумент = СтрокаДанныхЖурналаРегистрации.Данные;
				ИзмененоЗадач = ИзмененоЗадач + 1;
				СтрокаИсходныхДанных = ИсходныеДанные.Добавить();
				СтрокаИсходныхДанных.Дата		  = СтрокаДанныхЖурналаРегистрации.Дата;
				СтрокаИсходныхДанных.Пользователь = ИмяПользователяСсылка;
				СтрокаИсходныхДанных.ВидОбъекта = ВидОбъекта;
				СтрокаИсходныхДанных.ИзмененоЗадач = ИзмененоЗадач;
				СтрокаИсходныхДанных.ОбъектСправочникДокумент = ОбъектСправочникДокумент;
				СтрокаИсходныхДанных.Неделя 	  = СтрокаНеделяГода(СтрокаДанныхЖурналаРегистрации.Дата);
			КонецЕсли;

		КонецЕсли;

		СозданоДокументов       = 0;
		СозданоСправочников     = 0;
		ИзмененоДокументов      = 0;
		ИзмененоСправочников    = 0;
		СозданоБизнесПроцессов  = 0;
		ИзмененоБизнесПроцессов = 0;
		ИзмененоЗадач           = 0;
		СозданоЗадач            = 0;
		ВидОбъекта              = Неопределено;

	КонецЦикла; 

	Если СтрокаИсходныхДанных <> Неопределено Тогда
		СтрокаИсходныхДанных.ЧасовРаботы  = ЧасовРаботы;
		СтрокаИсходныхДанных.КоличествоЗапусков = КоличествоЗапусков;
	КонецЕсли;

	Если ВариантОтчета = "АнализАктивностиПользователей" Тогда

		ДанныеЖурналаРегистрации.Сортировать("Дата");

		МассивПользователей 	= Новый Массив;
		МаксМассивПользователей = Новый Массив;
		ОдновременноРаботавшихПользователей  = 0;
		Счетчик                 = 0;
		ТекущаяДата             = Неопределено;

		Для Каждого СтрокаДанныхЖурналаРегистрации Из ДанныеЖурналаРегистрации Цикл

			Если Не ЗначениеЗаполнено(СтрокаДанныхЖурналаРегистрации.Дата)
				Или СтрокаДанныхЖурналаРегистрации.ИмяПользователя = "" Тогда
				Продолжить;
			КонецЕсли;

			ИмяПользователяСсылка = СоответствиеИдентификаторыПользователей[СтрокаДанныхЖурналаРегистрации.Пользователь];
			Если ИмяПользователяСсылка = Неопределено Тогда
				Продолжить;
			КонецЕсли;

			ИмяПользователяСтрока = ИмяПользователяИБ(ИмяПользователяСсылка);

			ДатаОдновременноРаботавшихПользователей = НачалоДня(СтрокаДанныхЖурналаРегистрации.Дата);

			// При смене дня обнуляем все данные по одновременным сессиям и заполняем данные за прошедший день.
			Если ТекущаяДата <> ДатаОдновременноРаботавшихПользователей Тогда
				Если ОдновременноРаботавшихПользователей <> 0 Тогда
					СформироватьСтрокуОдновременноСессий(ОдновременноСессий, МаксМассивПользователей, 
					ОдновременноРаботавшихПользователей, ТекущаяДата);
				КонецЕсли;
				ОдновременноРаботавшихПользователей = 0;
				Счетчик    = 0;
				МассивПользователей.Очистить();
				ТекущаяДата = ДатаОдновременноРаботавшихПользователей;
			КонецЕсли;

			Если СтрокаДанныхЖурналаРегистрации.Событие = "_$Session$_.Start" Тогда
				Счетчик = Счетчик + 1;
				МассивПользователей.Добавить(ИмяПользователяСтрока);
			ИначеЕсли СтрокаДанныхЖурналаРегистрации.Событие = "_$Session$_.Finish" Тогда
				ИндексПользователя = МассивПользователей.Найти(ИмяПользователяСтрока);
				Если Не ИндексПользователя = Неопределено Тогда 
					МассивПользователей.Удалить(ИндексПользователя);
					Счетчик = Счетчик - 1;
				КонецЕсли;
			КонецЕсли;

			// Проверяем значение счетчика и сравниваем с максимальным значением.
			Счетчик = Макс(Счетчик, 0);
			Если Счетчик > ОдновременноРаботавшихПользователей Тогда
				МаксМассивПользователей = Новый Массив;
				Для Каждого Элемент Из МассивПользователей Цикл
					МаксМассивПользователей.Добавить(Элемент);
				КонецЦикла;
			КонецЕсли;
			ОдновременноРаботавшихПользователей = Макс(ОдновременноРаботавшихПользователей, Счетчик);

		КонецЦикла;

		Если ОдновременноРаботавшихПользователей <> 0 Тогда
			СформироватьСтрокуОдновременноСессий(ОдновременноСессий, МаксМассивПользователей, 
			ОдновременноРаботавшихПользователей, ТекущаяДата);
		КонецЕсли;

		// Расчет количества ошибок и предупреждений.
		ДанныеЖурналаРегистрации = Неопределено;
		Ошибок 					 = 0;
		Предупреждений			 = 0;
		ДанныеЖурналаРегистрации = ИнформацияПоОшибкамЖурналаРегистрации(ДатаНачала, ДатаОкончания, СмещениеВремениСервера);

		ОтчетПустой =  ОтчетПустой Или (ДанныеЖурналаРегистрации.Количество() = 0);

		Для Каждого СтрокаДанныхЖурналаРегистрации Из ДанныеЖурналаРегистрации Цикл

			Если СтрокаДанныхЖурналаРегистрации.ИмяПользователя = "" Тогда
				Продолжить;
			КонецЕсли;

			Если ПользовательФильтр.Найти(СтрокаДанныхЖурналаРегистрации.ИмяПользователя) = Неопределено
				И ПользовательФильтр.Количество() <> 0 Тогда
				Продолжить;
			КонецЕсли;

			ИмяПользователяСсылка = СоответствиеИдентификаторыПользователей[СтрокаДанныхЖурналаРегистрации.Пользователь];

			Если СтрокаДанныхЖурналаРегистрации.Уровень = УровеньЖурналаРегистрации.Ошибка Тогда
				Ошибок = Ошибок + 1;
				СтрокаИсходныхДанных = ИсходныеДанные.Добавить();
				СтрокаИсходныхДанных.Дата = СтрокаДанныхЖурналаРегистрации.Дата;
				СтрокаИсходныхДанных.Неделя 	  = СтрокаНеделяГода(СтрокаДанныхЖурналаРегистрации.Дата);
				СтрокаИсходныхДанных.Пользователь = ИмяПользователяСсылка;
				СтрокаИсходныхДанных.Ошибок = Ошибок;
			КонецЕсли;

			Если СтрокаДанныхЖурналаРегистрации.Уровень = УровеньЖурналаРегистрации.Предупреждение Тогда
				Предупреждений = Предупреждений + 1;
				СтрокаИсходныхДанных = ИсходныеДанные.Добавить();
				СтрокаИсходныхДанных.Дата = СтрокаДанныхЖурналаРегистрации.Дата;
				СтрокаИсходныхДанных.Неделя 	  = СтрокаНеделяГода(СтрокаДанныхЖурналаРегистрации.Дата);
				СтрокаИсходныхДанных.Пользователь = ИмяПользователяСсылка;
				СтрокаИсходныхДанных.Предупреждений = Предупреждений;
			КонецЕсли;

			Ошибок         = 0;
			Предупреждений = 0;
		КонецЦикла;

	КонецЕсли;

	Возврат Новый Структура("АнализАктивностиПользователей, ОдновременноСессий, ОтчетПустой", ИсходныеДанные, ОдновременноСессий, ОтчетПустой);

КонецФункции
