
#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Идентификатор = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ИерархияТип")).ИдентификаторПользовательскойНастройки;
	СтрокаПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Идентификатор);
	
	Если СтрокаПараметр <> Неопределено И ЗначениеЗаполнено(СтрокаПараметр.Значение) Тогда
		ТекИерархия = СтрокаПараметр.Значение;
	Иначе
		ТекИерархия = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			"НастройкиТОиР",
			"ОсновнаяСтруктураИерархии",
			Справочники.торо_СтруктурыОР.ПустаяСсылка());
			
		Если СтрокаПараметр <> Неопределено Тогда
			СтрокаПараметр.Значение = ТекИерархия;
		КонецЕсли;
		
	КонецЕсли;
	
	торо_ОтчетыСервер.УстановитьЗапросыНаборовДанныхИерархииОР(СхемаКомпоновкиДанных, ТекИерархия, "КонецПериода");
	
	Если ТекИерархия.СтроитсяАвтоматически Тогда
				
		СхемаКомпоновкиДанных.НаборыДанных.Объекты.Запрос =
		ПолучитьСодержательнуюЧастьЗапроса()+
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Данные.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
		|	Данные.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
		|	Данные.ДатаНачалаРемонтныхРабот КАК ДатаНачалаРемонтныхРабот,
		|	Данные.ДатаОкончанияРемонтныхРабот КАК ДатаОкончанияРемонтныхРабот,
		|	Данные.Исполнитель КАК Исполнитель,
		|	Данные.НормативныйРемонт КАК НормативныйРемонт,
		|	Данные.СтатусВыполнения КАК СтатусВыполнения,
		|	Данные.ДатаНачалаФакт КАК ДатаНачалаФакт,
		|	Данные.ДатаОкончанияФакт КАК ДатаОкончанияФакт,
		|	торо_ОбъектыРемонта." + ТекИерархия.РеквизитОР + " КАК ОбъектИерархии
		|ИЗ
		|	Данные КАК Данные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|		ПО Данные.ОбъектРемонтныхРабот = торо_ОбъектыРемонта.Ссылка";

		торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.Иерархия);
		
	Иначе

		торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.ТолькоИерархия);

		СхемаКомпоновкиДанных.НаборыДанных.Объекты.Запрос = 
		ПолучитьСодержательнуюЧастьЗапроса()+
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Данные.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
		|	Данные.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
		|	Данные.ДатаНачалаРемонтныхРабот КАК ДатаНачалаРемонтныхРабот,
		|	Данные.ДатаОкончанияРемонтныхРабот КАК ДатаОкончанияРемонтныхРабот,
		|	Данные.Исполнитель КАК Исполнитель,
		|	Данные.НормативныйРемонт КАК НормативныйРемонт,
		|	Данные.СтатусВыполнения КАК СтатусВыполнения,
		|	Данные.ДатаНачалаФакт КАК ДатаНачалаФакт,
		|	Данные.ДатаОкончанияФакт КАК ДатаОкончанияФакт,
		|	торо_ОбъектыРемонта.Ссылка КАК ОбъектИерархии
		|ИЗ
		|	Данные КАК Данные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|		ПО Данные.ОбъектРемонтныхРабот = торо_ОбъектыРемонта.Ссылка";
		
	КонецЕсли;
	
	// >> [Деснол] [Ушаков А.Д.] [04.10.2019]
	дс_ДобавитьПараметрыВСКД();
	дс_УстановитьУсловноеОформление();
	// << [Деснол] [Ушаков А.Д.] [04.10.2019] 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСодержательнуюЧастьЗапроса() 
	
	ЗапросТекст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаНачалаРемонтныхРабот КАК ДатаНачалаРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаОкончанияРемонтныхРабот КАК ДатаОкончанияРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Исполнитель КАК Исполнитель,
	|	торо_НормативныеРемонтыОборудования.НормативныйРемонт КАК НормативныйРемонт,
	|	ВЫБОР
	|		КОГДА торо_ЗавершенныеРемонтныеРаботыСрезПоследних.ID ЕСТЬ NULL
	|			ТОГДА ""НЕ ВЫПОЛНЕН""
	|		ИНАЧЕ ""ВЫПОЛНЕН""
	|	КОНЕЦ КАК СтатусВыполнения,
	|	торо_РемонтыСрезПоследних.ДатаНачалаФакт КАК ДатаНачалаФакт,
	|	торо_РемонтыСрезПоследних.ДатаОкончанияФакт КАК ДатаОкончанияФакт
	|ПОМЕСТИТЬ Данные
	|ИЗ
	|	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних КАК торо_ПлановыеРемонтныеРаботыСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_НормативныеРемонтыОборудования КАК торо_НормативныеРемонтыОборудования
	|		ПО торо_ПлановыеРемонтныеРаботыСрезПоследних.ОбъектРемонтныхРабот = торо_НормативныеРемонтыОборудования.ОбъектРемонта
	|			И торо_ПлановыеРемонтныеРаботыСрезПоследних.ВидРемонтныхРабот = торо_НормативныеРемонтыОборудования.ВидРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗавершенныеРемонтныеРаботы.СрезПоследних КАК торо_ЗавершенныеРемонтныеРаботыСрезПоследних
	|		ПО торо_ПлановыеРемонтныеРаботыСрезПоследних.ID = торо_ЗавершенныеРемонтныеРаботыСрезПоследних.ID
	|			И торо_ПлановыеРемонтныеРаботыСрезПоследних.ОбъектРемонтныхРабот = торо_ЗавершенныеРемонтныеРаботыСрезПоследних.ОбъектРемонта
	|			И торо_ПлановыеРемонтныеРаботыСрезПоследних.ВидРемонтныхРабот = торо_ЗавершенныеРемонтныеРаботыСрезПоследних.ВидРемонтныхРабот
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_Ремонты.СрезПоследних КАК торо_РемонтыСрезПоследних
	|		ПО торо_ПлановыеРемонтныеРаботыСрезПоследних.ID = торо_РемонтыСрезПоследних.ID
	|			И торо_ПлановыеРемонтныеРаботыСрезПоследних.ОбъектРемонтныхРабот = торо_РемонтыСрезПоследних.ОбъектРемонта
	|			И торо_ПлановыеРемонтныеРаботыСрезПоследних.ВидРемонтныхРабот = торо_РемонтыСрезПоследних.ВидРемонта
	|ГДЕ
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.СпособВыполнения = ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный)
	|	И торо_НормативныеРемонтыОборудования.Приоритет
	|{ГДЕ
	|	(торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаНачалаРемонтныхРабот >= &НачалоПериода
	|			И торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаНачалаРемонтныхРабот <= &КонецПериода)}
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектРемонтныхРабот"
		
	+ "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	// >> [Деснол] [Ушаков А.Д.] [04.10.2019]
	ЗапросТекст = дс_ДобавитьПараметрыВТекстЗапроса(ЗапросТекст);
	// << [Деснол] [Ушаков А.Д.] [04.10.2019] 
	
	Возврат ЗапросТекст;
	
КонецФункции

// >> [Деснол] [Ушаков А.Д.] [04.10.2019]
#Область Локализация

Функция дс_ДобавитьПараметрыВТекстЗапроса(ТекстЗапроса)
	СтрокиЗамены = Новый Соответствие;

	СтрокиЗамены.Вставить("""НЕ ВЫПОЛНЕН""", "&НЕВЫПОЛНЕН");
	СтрокиЗамены.Вставить("""ВЫПОЛНЕН""", "&ВЫПОЛНЕН");

	Для каждого КодЗамены Из СтрокиЗамены Цикл
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, КодЗамены.Ключ, КодЗамены.Значение);
	КонецЦикла;
	
	Возврат ТекстЗапроса;
КонецФункции
 
Процедура дс_ДобавитьПараметрыВСКД()
	Переводы = Новый Соответствие;
	
	Переводы.Вставить("НЕВЫПОЛНЕН", НСтр("es='NO SE HA INICIADO';ru='НЕ ВЫПОЛНЕН';en='NOT EXECUTED'"));
	Переводы.Вставить("ВЫПОЛНЕН", НСтр("es='EJECUTADO';ru='ВЫПОЛНЕН';en='DONE'"));
	
	Для каждого Перевод Из Переводы Цикл
		Если СхемаКомпоновкиДанных.Параметры.Найти(Перевод.Ключ) = Неопределено Тогда
			НовыйПараметр = СхемаКомпоновкиДанных.Параметры.Добавить();
			НовыйПараметр.Имя 			= Перевод.Ключ;
			НовыйПараметр.Значение 		= Перевод.Значение;
			НовыйПараметр.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда;
			НовыйПараметр.ОграничениеИспользования = Истина;
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

Процедура дс_УстановитьУсловноеОформление()
	Переводы = Новый Соответствие;
	
	Переводы.Вставить("НЕ ВЫПОЛНЕН", НСтр("es='NO SE HA INICIADO';ru='НЕ ВЫПОЛНЕН';en='NOT EXECUTED'"));
	Переводы.Вставить("ВЫПОЛНЕН", НСтр("es='EJECUTADO';ru='ВЫПОЛНЕН';en='DONE'"));
	
	УО = КомпоновщикНастроек.Настройки.УсловноеОформление.Элементы;
	
	Для каждого ЭлементУТ Из УО Цикл
		
		ЭлементыОтбора = ЭлементУТ.Отбор.Элементы;
		Для каждого ЭлементОтбора Из ЭлементыОтбора Цикл
			Перевод = Переводы[ЭлементОтбора.ПравоеЗначение];
			
			Если Перевод <> Неопределено Тогда
				ЭлементОтбора.ПравоеЗначение = Перевод;
			КонецЕсли; 
		КонецЦикла; 
	КонецЦикла;
КонецПроцедуры

#КонецОбласти 
// << [Деснол] [Ушаков А.Д.] [04.10.2019] 

#КонецОбласти
