////////////////////////////////////////////////////////////////////////////////
// <гкс_ОбъектыТОИРИзКлассификатора: Предназанчен для процедур и функций создания объектов ТОИР
//	из элементов классификатора.>
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
//
// Процедура СоздатьОбъектыТОИР
//
// Описание: Создает объекты ТОИР из объектов Классификатора.
//
Процедура СоздатьОбъектыТОИР() Экспорт
	
	Отказ = Ложь;
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.гкс_СоздатьОбъектыТОИРИзКлассификатора);
	
	ИмяСобытия = ИмяСобытияЖурналаРегистрации();
	
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация, , ,
		НСтр("ru = 'Начато регламентное создание объектов ТОИР'"));
	
	СозданиеТОР();
	СозданиеОР();
		
	Если Отказ Тогда
		ЗаписьЖурналаРегистрации(
			ИмяСобытия,
			УровеньЖурналаРегистрации.Ошибка,
			, 
			,
			НСтр("ru = 'Во время создания объектов ТОИР произошли ошибки'"));
		ВызватьИсключение НСтр("ru = 'Регламентное задание не выполнено.'");
	Иначе
		ЗаписьЖурналаРегистрации(
			ИмяСобытия,
			УровеньЖурналаРегистрации.Информация,
			,
			,
			НСтр("ru = 'Завершено регламентное создание объектов ТОИР.'"));
	КонецЕсли;	
	
КонецПроцедуры 

////////////////////////////////////////////////////////////////////////////////
//
// Функция ИмяСобытияЖурналаРегистрации
//
// Описание: Сообщение журнала регистрации	
//
// Возвращаемое значение: 
//	Строка - Сообщение журнала регистрации.
//
Функция ИмяСобытияЖурналаРегистрации() Экспорт
	Возврат НСтр("ru = 'Загрузка заданий из Jira'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
КонецФункции

#Область ТиповыеОбъектыРемонта  

////////////////////////////////////////////////////////////////////////////////
//
// Функция СозданиеТОР
//
// Описание: Создание типовых объектов ремонта.
//
Процедура СозданиеТОР()
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	СоздатьИерархиюНаСервере(МенеджерВТ);
	СоздатьТиповыеОрНаСервере(МенеджерВТ);
		
КонецПроцедуры  

////////////////////////////////////////////////////////////////////////////////
//
// Функция СоздатьИерархиюНаСервере
//
// Описание: Создание новых групп типовых объектов ремонта.
//
// Параметры 
//	МенеджерВТ - МенеджерВременныхТаблиц - МенеджерВременныхТаблиц.
//
Процедура СоздатьИерархиюНаСервере(МенеджерВТ)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = ТекстЗапроса_ТиповыеОРКДобавлению();
			
	Запрос.УстановитьПараметр("Оборудование", 
		ПредопределенноеЗначение("Справочник.Классы.Оборудование"));
	Запрос.УстановитьПараметр("КодГруппы", 
		ПредопределенноеЗначение("ПланВидовХарактеристик.АтрибутыКласса.КодГруппы"));
	Запрос.УстановитьПараметр("ВыгружатьОР", 
		ПредопределенноеЗначение("ПланВидовХарактеристик.АтрибутыКласса.ВыгружатьВТиповыеОР"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		КодГруппыСсылка = Выборка.СсылкаГруппыОборудования;
		
		Если Выборка.СоздатьКодГруппы Тогда
			
			КодГруппы = Справочники.гкс_ГруппыОборудования.СоздатьЭлемент();
			
			КодГруппы.Наименование = Выборка.ИмяГруппыОборудования;
			КодГруппы.Код = Выборка.КодГруппыОборудования;
			КодГруппы.Записать();
			
			ДобавитьСоответствиеОбъектов(Выборка.СсылкаГруппы, КодГруппы.Ссылка);
			КодГруппыСсылка = КодГруппы.Ссылка;
			
		КонецЕсли; 
		
		Если Не ЗначениеЗаполнено(Выборка.ГруппаТОР) Тогда
			ГруппаТОР = Справочники.торо_ТиповыеОР.СоздатьГруппу();
		
			ГруппаТОР.Наименование = Выборка.КлассНаименование;
			ГруппаТОР.КодГруппы = КодГруппы;
			Если ЗначениеЗаполнено(Выборка.ГруппаТОРРодитель) Тогда
				ГруппаТОР.Родитель = Выборка.ГруппаТОРРодитель;						
			КонецЕсли; 
			ГруппаТОР.Записать();
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
//
// Функция СоздатьТиповыеОрНаСервере
//
// Описание: Создание новых типовых объектов.
//
// Параметры 
//	МенеджерВТ - МенеджерВременныхТаблиц - МенеджерВременныхТаблиц.
//
Процедура СоздатьТиповыеОрНаСервере(МенеджерВТ)
	
	ГруппыОборудования = СоответствиеГруппыОборудования();
	
	ОбъектыДляЗаполнения = ПодготовитьОбъектыДляЗаполнения();
	
	СтрокиТабличныхАтрибутов = ОбъектыДляЗаполнения.СтрокиТабличныхАтрибутов;
	ЗначенияТабличныхАтрибутов = ОбъектыДляЗаполнения.ЗначенияТабличныхАтрибутов;
	ТЗМатЗатраты = ОбъектыДляЗаполнения.ТЗМатЗатраты;
	ТЗПоказатели = ОбъектыДляЗаполнения.ТЗПоказатели;
	ТЗИсполнитель = ОбъектыДляЗаполнения.ТЗИсполнитель;
	ТЗИнструменты = ОбъектыДляЗаполнения.ТЗИнструменты;
	ТЗСписокОпераций = ОбъектыДляЗаполнения.ТЗСписокОпераций;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = ТекстЗапроса_НоменклатураКласса();
	Запрос.УстановитьПараметр("ТипОбъекта", ПредопределенноеЗначение("Перечисление.гкс_ТипОбъектаТОИР.ПустаяСсылка")); 
	
	РезультатЗапросаТОР = Запрос.Выполнить();
	
	ВыборкаТОР = РезультатЗапросаТОР.Выбрать();
	Пока ВыборкаТОР.Следующий() Цикл
		
		Если ЗначениеЗаполнено(ВыборкаТОР.ТОРСсылкаПоРегистру) Тогда
			ТОР = ВыборкаТОР.ТОРСсылкаПоРегистру.ПолучитьОбъект();
		Иначе
			ТОР = Справочники.торо_ТиповыеОР.СоздатьЭлемент();
		КонецЕсли; 
		
		ТОР.Наименование = ВыборкаТОР.Наименование;
		Если ЗначениеЗаполнено(ВыборкаТОР.ТОРРодитель) Тогда
			ТОР.Родитель = ВыборкаТОР.ТОРРодитель;	
		КонецЕсли; 
		ТОР.ТипОбъекта = ПредопределенноеЗначение("Перечисление.торо_ТипыОбъектовRCM.Объект");

		ТЗМатЗатраты.Очистить();
		ТЗПоказатели.Очистить();
		ТЗИсполнитель.Очистить();
		ТЗИнструменты.Очистить();
		СтрокиТабличныхАтрибутов.Очистить();
		ЗначенияТабличныхАтрибутов.Очистить();	

		НоменклатураКласса = ВыборкаТОР.Ссылка;

		СписокРодителей  = Справочники.Классы.ПолучитьТаблицуРодителей(НоменклатураКласса.Класс);

		ТаблицаАтрибутов = Справочники.Классы.ПолучитьТаблицуАтрибутов(СписокРодителей);
		
		СтрокаПроизводитель = 
			ТаблицаАтрибутов.НайтиСтроки(Новый Структура("АтрибутКласса", 
				ПредопределенноеЗначение("ПланВидовХарактеристик.АтрибутыКласса.Производитель")));
		Если СтрокаПроизводитель.Количество() > 0 Тогда
			ТОР.Изготовитель = Строка(СтрокаПроизводитель[0].ЗначениеАтрибутаКласса);
			Если Не ЗначениеЗаполнено(Тор.Изготовитель) Тогда
				ТОР.Изготовитель = ЗначениеАтрибута(ВыборкаТОР.Ссылка, 
									ПредопределенноеЗначение("ПланВидовХарактеристик.АтрибутыКласса.Производитель"));
			КонецЕсли; 			
		КонецЕсли; 	
		СтрокаКодГруппы = 
			ТаблицаАтрибутов.НайтиСтроки(Новый Структура("АтрибутКласса", 
				ПредопределенноеЗначение("ПланВидовХарактеристик.АтрибутыКласса.КодГруппы")));
		Если СтрокаКодГруппы.Количество() > 0 Тогда
			КодГруппы = СтрокаКодГруппы[0].ЗначениеАтрибутаКласса;
			КодГруппыТОИР = НайтиПоСоответствию(КодГруппы);
			Если Не ЗначениеЗаполнено(КодГруппыТОИР) Тогда
				ПоискКодГруппыТОИР = ГруппыОборудования[КодГруппы.Код];
				Если ПоискКодГруппыТОИР = Неопределено Тогда
					КодГруппыТОИР = Справочники.гкс_ГруппыОборудования.СоздатьЭлемент();
					КодГруппыТОИР.Наименование = КодГруппы.Наименование;
					КодГруппыТОИР.Код = КодГруппы.Код;
					КодГруппыТОИР.Записать();
				Иначе
					КодГруппыТОИР = ПоискКодГруппыТОИР;
				КонецЕсли; 
				
				ДобавитьСоответствиеОбъектов(КодГруппы.Ссылка, КодГруппыТОИР.Ссылка);
			КонецЕсли; 
			ТОР.КодГруппы = КодГруппыТОИР;
		КонецЕсли; 	
		
		ДанныеТабличныхАтрибутов = ТаблицаАтрибутов.Скопировать(Новый Структура("КлассТабличнаяЧасть", Истина), "АтрибутКласса").ВыгрузитьКолонку("АтрибутКласса");

		РегистрыСведений.МножественныеЗначенияАтрибутов.ПрочитатьЗначенияТабличныхАтрибутов(НоменклатураКласса, 
																				Неопределено, 
																				ДанныеТабличныхАтрибутов, 
																				1, 
																				Неопределено, 
																				СтрокиТабличныхАтрибутов, 
																				ЗначенияТабличныхАтрибутов);

		БылиПустыеСтроки = Ложь;																				
		Для каждого ТекСтрока Из СтрокиТабличныхАтрибутов Цикл
			Если Не ЗначениеЗаполнено(ТекСтрока.ЗначениеАтрибутаКласса) Тогда
				ТекСтрока.ЗначениеАтрибутаКласса = ТекСтрока.ИсточникЗначений;					
				Если Не ЗначениеЗаполнено(ТекСтрока.Наименование) Тогда
					ТекСтрока.Наименование = Строка(ТекСтрока.ИсточникЗначений);
				КонецЕсли; 
				БылиПустыеСтроки = Истина;
			КонецЕсли; 
		КонецЦикла; 			
		
		АтрибутТехКарта = ПредопределенноеЗначение("ПланВидовХарактеристик.АтрибутыКласса.ТехКарты");
		ТехКарты = СтрокиТабличныхАтрибутов.НайтиСтроки(Новый Структура("АтрибутКласса", АтрибутТехКарта));

		СоответствиеИДСтрокИНомеровТехКарт = Новый Соответствие;	
		Для каждого ТехКарта Из ТехКарты Цикл
			ТехКарта.ТехКарта = ТехКарта.ЗначениеАтрибутаКласса;
			СоответствиеИДСтрокИНомеровТехКарт.Вставить(ТехКарта.ИдСтроки, ТехКарта.ЗначениеАтрибутаКласса);
		КонецЦикла; 

		Для каждого ТекСтрока Из СтрокиТабличныхАтрибутов Цикл
			Если ТекСтрока.ИДСтрокиРодителя = 0 Тогда
				Продолжить;			
			КонецЕсли;     		
			ТекСтрока.ТехКарта = СоответствиеИДСтрокИНомеровТехКарт[ТекСтрока.ИДСтрокиРодителя];
			СоответствиеИДСтрокИНомеровТехКарт.Вставить(ТекСтрока.ИДСтроки, ТекСтрока.ТехКарта);
		КонецЦикла; 														
											
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("СтрокиТабличныхАтрибутов", СтрокиТабличныхАтрибутов);
		Запрос.УстановитьПараметр("ЗначенияТабличныхАтрибутов", ЗначенияТабличныхАтрибутов);
		Запрос.Текст = ТекстЗапроса_ТехКарты();    					
		РезультатЗапросаТК = Запрос.Выполнить();

		СоответствиеСтрокГуИДам = Новый Соответствие;

		ВыборкаТехКарта = РезультатЗапросаТК.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаТехКарта.Следующий() Цикл
			ТЗСписокОпераций.Очистить();
			СпособПланирования = Неопределено;
			ТипТехКарты = Неопределено;
			ИсходящиеДанные = новый Структура;
			ИсходящиеДанные.Вставить("НормаВремени", 0);
			Если ВыборкаТехКарта.ТехКарта = ПредопределенноеЗначение("Справочник.НоменклатураКласса.ПустаяСсылка") Тогда
				Продолжить;			
			КонецЕсли; 
			ИсходящиеДанные.Вставить("ТехКарта", ВыборкаТехКарта.ТехКарта);
			ИсходящиеДанные.Вставить("Наименование", СокрЛП(ВыборкаТехКарта.ТехКарта));
			ВыборкаАтрибут = ВыборкаТехКарта.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаАтрибут.Следующий() Цикл
				ВыборкаСтроки = ВыборкаАтрибут.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Если ВыборкаАтрибут.ИмяДляОбмена = "ТехОперации" Тогда
					ОбработатьСтрокиТехОпераций(ВыборкаСтроки, СоответствиеСтрокГуИДам, ТЗСписокОпераций);             					 		
				ИначеЕсли ВыборкаАтрибут.ИмяДляОбмена = "Инструменты" Тогда
					ОбработатьСтрокиИнструменты(ВыборкаСтроки, СоответствиеСтрокГуИДам, ТЗИнструменты);    					
				ИначеЕсли ВыборкаАтрибут.ИмяДляОбмена = "Исполнители" Тогда
					ОбработатьСтрокиИсполнители(ВыборкаСтроки, СоответствиеСтрокГуИДам, ТЗИсполнитель);
				ИначеЕсли ВыборкаАтрибут.ИмяДляОбмена = "Показатели" Тогда
					ОбработатьСтрокиПоказатели(ВыборкаСтроки, СоответствиеСтрокГуИДам, ТЗПоказатели, ТЗСписокОпераций);
				ИначеЕсли ВыборкаАтрибут.ИмяДляОбмена = "МатериальныеЗатраты" Тогда				 
					ОбработатьСтрокиМатериальныеЗатраты(ВыборкаСтроки, СоответствиеСтрокГуИДам, ТЗМатЗатраты);
				ИначеЕсли ВыборкаАтрибут.ИмяДляОбмена = "ТехКарта" Тогда				 
					ОбработатьСтрокиТехКарт(ВыборкаСтроки, СоответствиеСтрокГуИДам, ИсходящиеДанные);
				КонецЕсли; 
			КонецЦикла;   
			
			ИсходящиеДанные.Вставить("СписокОпераций", 			ТЗСписокОпераций);
			ИсходящиеДанные.Вставить("ИнструментыИТехника", 	ТЗИнструменты);
			ИсходящиеДанные.Вставить("СписокИсполнителей", 		ТЗИсполнитель);
			ИсходящиеДанные.Вставить("ИзмеряемыеПоказатели",	ТЗПоказатели);
			ИсходящиеДанные.Вставить("МатериальныеЗатраты", 	ТЗМатЗатраты);

			Если ИсходящиеДанные.Наименование <> "" Тогда
					
				ИдКарта =  СоздатьТехКарту(ИсходящиеДанные);  
				Если ЗначениеЗаполнено(ИдКарта) Тогда
					ДобавитьСтрокуНормативныхРемонтов(ТОР, ИдКарта, ИсходящиеДанные);  				
				КонецЕсли; 
			КонецЕсли; 
			
		КонецЦикла;
		
		ТОР.Записать();
		
		ДобавитьСоответствиеОбъектов(ТОР.Ссылка, ВыборкаТОР.Ссылка);
		
	КонецЦикла;  
	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
//
// Функция ТекстЗапроса_ТиповыеОРКДобавлению
//
// Описание: ТекстЗапроса_ТиповыеОРКДобавлению.
//
// Возвращаемое значение: 
//	Строка - ТекстЗапроса.
//
Функция ТекстЗапроса_ТиповыеОРКДобавлению()
	
	Возврат "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	Классы.Ссылка КАК Ссылка
	        |ПОМЕСТИТЬ ВыгружаемаяИерархия
	        |ИЗ
	        |	Справочник.Классы КАК Классы
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияАтрибутовКласса КАК ЗначенияАтрибутовКласса
	        |		ПО Классы.Ссылка = ЗначенияАтрибутовКласса.Класс
	        |ГДЕ
	        |	ЗначенияАтрибутовКласса.АтрибутКласса = &ВыгружатьОР
	        |	И ЗначенияАтрибутовКласса.ЗначениеАтрибутаКласса = ИСТИНА
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	Классы.Ссылка КАК Ссылка,
	        |	Классы.Наименование КАК Наименование,
	        |	Классы.Родитель.Наименование КАК Родитель,
	        |	Классы.Родитель КАК РодительСсылка
	        |ПОМЕСТИТЬ ВыгружаемыеКлассы
	        |ИЗ
	        |	Справочник.Классы КАК Классы
	        |ГДЕ
	        |	Классы.Ссылка В ИЕРАРХИИ
	        |			(ВЫБРАТЬ
	        |				ВыгружаемаяИерархия.Ссылка КАК Ссылка
	        |			ИЗ
	        |				ВыгружаемаяИерархия КАК ВыгружаемаяИерархия)
	        |	И Классы.Ссылка <> &Оборудование
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ЗначенияАтрибутовКласса.Класс КАК Класс,
	        |	ВЫРАЗИТЬ(ЗначенияАтрибутовКласса.ЗначениеАтрибутаКласса КАК Справочник.ВариантыЗначенийАтрибутовКласса).Наименование КАК ИмяГруппы,
	        |	ВЫРАЗИТЬ(ЗначенияАтрибутовКласса.ЗначениеАтрибутаКласса КАК Справочник.ВариантыЗначенийАтрибутовКласса).Код КАК КодГруппы,
	        |	ВЫРАЗИТЬ(ЗначенияАтрибутовКласса.ЗначениеАтрибутаКласса КАК Справочник.ВариантыЗначенийАтрибутовКласса).Ссылка КАК СсылкаГруппы
	        |ПОМЕСТИТЬ КодыГрупп
	        |ИЗ
	        |	РегистрСведений.ЗначенияАтрибутовКласса КАК ЗначенияАтрибутовКласса
	        |ГДЕ
	        |	ЗначенияАтрибутовКласса.Класс В
	        |			(ВЫБРАТЬ
	        |				ВыгружаемыеКлассы.Ссылка КАК Ссылка
	        |			ИЗ
	        |				ВыгружаемыеКлассы КАК ВыгружаемыеКлассы)
	        |	И ЗначенияАтрибутовКласса.АтрибутКласса = &КодГруппы
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	торо_ТиповыеОР.Ссылка КАК Ссылка,
	        |	торо_ТиповыеОР.Наименование КАК Наименование
	        |ПОМЕСТИТЬ ГруппыТиповыхОР
	        |ИЗ
	        |	Справочник.торо_ТиповыеОР КАК торо_ТиповыеОР
	        |ГДЕ
	        |	торо_ТиповыеОР.ЭтоГруппа
	        |	И торо_ТиповыеОР.Наименование В
	        |			(ВЫБРАТЬ
	        |				ВыгружаемыеКлассы.Наименование КАК Наименование
	        |			ИЗ
	        |				ВыгружаемыеКлассы КАК ВыгружаемыеКлассы)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВыгружаемыеКлассы.Ссылка КАК КлассСсылка,
	        |	ВыгружаемыеКлассы.Наименование КАК КлассНаименование,
	        |	ВЫБОР
	        |		КОГДА ВыгружаемыеКлассы.РодительСсылка В
	        |				(ВЫБРАТЬ
	        |					ВыгружаемыеКлассы.Ссылка КАК Ссылка
	        |				ИЗ
	        |					ВыгружаемыеКлассы КАК ВыгружаемыеКлассы)
	        |			ТОГДА ВыгружаемыеКлассы.Родитель
	        |		ИНАЧЕ """"
	        |	КОНЕЦ КАК КлассРодитель,
	        |	ГруппыТиповыхОР.Ссылка КАК ГруппаТОР,
	        |	КодыГрупп.ИмяГруппы КАК ИмяГруппыОборудования,
	        |	КодыГрупп.КодГруппы КАК КодГруппыОборудования,
	        |	гкс_ГруппыОборудования.Ссылка КАК СсылкаГруппыОборудования,
	        |	ВЫБОР
	        |		КОГДА гкс_ГруппыОборудования.Ссылка ЕСТЬ NULL
	        |				И НЕ КодыГрупп.КодГруппы ЕСТЬ NULL
	        |			ТОГДА ИСТИНА
	        |		ИНАЧЕ ЛОЖЬ
	        |	КОНЕЦ КАК СоздатьКодГруппы,
	        |	КодыГрупп.СсылкаГруппы КАК СсылкаГруппы,
	        |	ВЫБОР
	        |		КОГДА ВыгружаемыеКлассы.РодительСсылка В
	        |				(ВЫБРАТЬ
	        |					ВыгружаемыеКлассы.Ссылка КАК Ссылка
	        |				ИЗ
	        |					ВыгружаемыеКлассы КАК ВыгружаемыеКлассы)
	        |			ТОГДА ГруппыТиповыхОРРодители.Ссылка
	        |		ИНАЧЕ """"
	        |	КОНЕЦ КАК ГруппаТОРРодитель
	        |ИЗ
	        |	ВыгружаемыеКлассы КАК ВыгружаемыеКлассы
	        |		ЛЕВОЕ СОЕДИНЕНИЕ КодыГрупп КАК КодыГрупп
	        |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гкс_ГруппыОборудования КАК гкс_ГруппыОборудования
	        |			ПО КодыГрупп.КодГруппы = гкс_ГруппыОборудования.Код
	        |		ПО ВыгружаемыеКлассы.Ссылка = КодыГрупп.Класс
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ГруппыТиповыхОР КАК ГруппыТиповыхОР
	        |		ПО ВыгружаемыеКлассы.Наименование = ГруппыТиповыхОР.Наименование
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ТиповыеОР КАК ГруппыТиповыхОРРодители
	        |		ПО ВыгружаемыеКлассы.Родитель = ГруппыТиповыхОРРодители.Наименование";
	
		
КонецФункции

////////////////////////////////////////////////////////////////////////////////
//
// Функция ТекстЗапроса_НоменклатураКласса
//
// Описание: ТекстЗапроса_НоменклатураКласса.
//
// Возвращаемое значение: 
//	Строка - ТекстЗапроса.
//
Функция ТекстЗапроса_НоменклатураКласса()
	
	Возврат  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	         |	НоменклатураКласса.Ссылка КАК Ссылка,
	         |	НоменклатураКласса.Наименование КАК Наименование,
	         |	торо_ТиповыеОР.Ссылка КАК ТОРСсылка,
	         |	Родители.Ссылка КАК ТОРРодитель
	         |ПОМЕСТИТЬ ВременнаяТаблица_ПроверкаТОР
	         |ИЗ
	         |	Справочник.НоменклатураКласса КАК НоменклатураКласса
	         |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ТиповыеОР КАК торо_ТиповыеОР
	         |		ПО НоменклатураКласса.Наименование = торо_ТиповыеОР.Наименование
	         |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ТиповыеОР КАК Родители
	         |		ПО НоменклатураКласса.Родитель.Наименование = Родители.Наименование
	         |ГДЕ
	         |	НоменклатураКласса.Класс В
	         |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	         |				ВыгружаемыеКлассы.Ссылка КАК Ссылка
	         |			ИЗ
	         |				ВыгружаемыеКлассы КАК ВыгружаемыеКлассы)
	         |	И НЕ НоменклатураКласса.ЭтоГруппа
	         |	И торо_ТиповыеОР.Ссылка ЕСТЬ NULL
	         |;
	         |
	         |////////////////////////////////////////////////////////////////////////////////
	         |ВЫБРАТЬ
	         |	гкс_СоответствиеОбъектовКлассификатораИТОИР.ОбъектКлассификатора КАК ОбъектКлассификатора,
	         |	гкс_СоответствиеОбъектовКлассификатораИТОИР.ОбъектТОИР КАК ОбъектТОИР
	         |ПОМЕСТИТЬ ТОРПоРегиструСоответствия
	         |ИЗ
	         |	РегистрСведений.гкс_СоответствиеОбъектовКлассификатораИТОИР КАК гкс_СоответствиеОбъектовКлассификатораИТОИР
	         |ГДЕ
	         |	гкс_СоответствиеОбъектовКлассификатораИТОИР.ТипОбъекта = &ТипОбъекта
	         |	И гкс_СоответствиеОбъектовКлассификатораИТОИР.ОбъектКлассификатора В
	         |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	         |				ВременнаяТаблица_ПроверкаТОР.Ссылка КАК Ссылка
	         |			ИЗ
	         |				ВременнаяТаблица_ПроверкаТОР КАК ВременнаяТаблица_ПроверкаТОР)
	         |;
	         |
	         |////////////////////////////////////////////////////////////////////////////////
	         |ВЫБРАТЬ
	         |	ВременнаяТаблица_ПроверкаТОР.Ссылка КАК Ссылка,
	         |	ВременнаяТаблица_ПроверкаТОР.Наименование КАК Наименование,
	         |	ВременнаяТаблица_ПроверкаТОР.ТОРСсылка КАК ТОРСсылка,
	         |	ВременнаяТаблица_ПроверкаТОР.ТОРРодитель КАК ТОРРодитель,
	         |	ТОРПоРегиструСоответствия.ОбъектТОИР КАК ТОРСсылкаПоРегистру
	         |ИЗ
	         |	ВременнаяТаблица_ПроверкаТОР КАК ВременнаяТаблица_ПроверкаТОР
	         |		ЛЕВОЕ СОЕДИНЕНИЕ ТОРПоРегиструСоответствия КАК ТОРПоРегиструСоответствия
	         |		ПО ВременнаяТаблица_ПроверкаТОР.Ссылка = ТОРПоРегиструСоответствия.ОбъектКлассификатора";
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
//
// Функция ТекстЗапроса_ТехКарты
//
// Описание: ТекстЗапроса_ТехКарты.
//
// Возвращаемое значение: 
//	Строка - ТекстЗапроса.
//
Функция ТекстЗапроса_ТехКарты()
	
	Возврат "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтрокиТабличныхАтрибутов.АтрибутКласса,
		|	СтрокиТабличныхАтрибутов.ЗначениеАтрибутаКласса,
		|	СтрокиТабличныхАтрибутов.ИДСтроки,
		|	СтрокиТабличныхАтрибутов.ИДСтрокиРодителя,
		|	СтрокиТабличныхАтрибутов.ИсточникЗначений,
		|	СтрокиТабличныхАтрибутов.ИсходныйНомерСтроки,
		|	СтрокиТабличныхАтрибутов.Наименование,
		|	СтрокиТабличныхАтрибутов.НоменклатураКласса,
		|	СтрокиТабличныхАтрибутов.ОбъектыНоменклатуры,
		|	СтрокиТабличныхАтрибутов.Порядок,
		|	СтрокиТабличныхАтрибутов.ТехКарта
		|ПОМЕСТИТЬ ВТ_СтрокиТабличныхАтрибутов
		|ИЗ
		|	&СтрокиТабличныхАтрибутов КАК СтрокиТабличныхАтрибутов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗначенияТабличныхАтрибутов.АтрибутКласса,
		|	ЗначенияТабличныхАтрибутов.АтрибутТаблицы,
		|	ЗначенияТабличныхАтрибутов.ЗначениеАтрибутаТаблицы КАК ЗначениеАтрибутаТаблицы,
		|	ЗначенияТабличныхАтрибутов.ИДСтроки,
		|	ЗначенияТабличныхАтрибутов.ИДСтрокиРодителя
		|ПОМЕСТИТЬ ВТ_ЗначенияТабличныхАтрибутов
		|ИЗ
		|	&ЗначенияТабличныхАтрибутов КАК ЗначенияТабличныхАтрибутов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СтрокиТабличныхАтрибутов.ТехКарта КАК ТехКарта,
		|	ВТ_ЗначенияТабличныхАтрибутов.АтрибутКласса КАК АтрибутКласса,
		|	ВТ_ЗначенияТабличныхАтрибутов.ИДСтроки КАК ИДСтроки,
		|	ВТ_ЗначенияТабличныхАтрибутов.ИДСтрокиРодителя КАК ИДСтрокиРодителя,
		|	ВТ_СтрокиТабличныхАтрибутов.ЗначениеАтрибутаКласса,
		|	ВТ_ЗначенияТабличныхАтрибутов.АтрибутТаблицы,
		|	ВТ_ЗначенияТабличныхАтрибутов.ЗначениеАтрибутаТаблицы,
		|	АтрибутыКласса.ИмяДляОбмена КАК ИмяДляОбмена,
		|	АтрибутыКласса1.ИмяДляОбмена КАК ИмяДляОбменаАтрибутТаблицы
		|ИЗ
		|	ВТ_СтрокиТабличныхАтрибутов КАК ВТ_СтрокиТабличныхАтрибутов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗначенияТабличныхАтрибутов КАК ВТ_ЗначенияТабличныхАтрибутов
		|			ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.АтрибутыКласса КАК АтрибутыКласса
		|			ПО ВТ_ЗначенияТабличныхАтрибутов.АтрибутКласса = АтрибутыКласса.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.АтрибутыКласса КАК АтрибутыКласса1
		|			ПО ВТ_ЗначенияТабличныхАтрибутов.АтрибутТаблицы = АтрибутыКласса1.Ссылка
		|		ПО ВТ_СтрокиТабличныхАтрибутов.ИДСтроки = ВТ_ЗначенияТабличныхАтрибутов.ИДСтроки
		|			И ВТ_СтрокиТабличныхАтрибутов.АтрибутКласса = ВТ_ЗначенияТабличныхАтрибутов.АтрибутКласса
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИДСтрокиРодителя,
		|	ИДСтроки
		|ИТОГИ
		|	МАКСИМУМ(ИмяДляОбмена)
		|ПО
		|	ТехКарта,
		|	АтрибутКласса,
		|	ИДСтроки,
		|	ИДСтрокиРодителя";
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
//
// Функция ДобавитьСоответствиеОбъектов
//
// Описание: Добавляет соответствие в РС гкс_СоответствиеОбъектовКлассификатораИТОИР.
//
// Параметры:
//	ОбъектТоир - СправочникСсылка.Классы, СправочникСсылка.НоменклатураКласса - Объект ТОИР
//	ОбъектКлассификатора - СправочникСсылка - ОбъектКлассификатора
//	ТипОбъекта - ПеречислениеСсылка.гкс_ТипОбъектаТОИР - ТипОбъекта.
//
Процедура ДобавитьСоответствиеОбъектов(ОбъектТоир, ОбъектКлассификатора, ТипОбъекта = Неопределено)
	
	НаборЗаписейСооттветствия = РегистрыСведений.гкс_СоответствиеОбъектовКлассификатораИТОИР.СоздатьНаборЗаписей();
	НаборЗаписейСооттветствия.Отбор.ОбъектКлассификатора.Установить(ОбъектКлассификатора);
	Если ЗначениеЗаполнено(ТипОбъекта) Тогда
		НаборЗаписейСооттветствия.Отбор.ТипОбъекта.Установить(ТипОбъекта);
	КонецЕсли; 
	НаборЗаписейСооттветствия.Прочитать();
	НаборЗаписейСооттветствия.Очистить();
	НоваяЗапись = НаборЗаписейСооттветствия.Добавить();
	Если ЗначениеЗаполнено(ТипОбъекта) Тогда
		НоваяЗапись.ТипОбъекта = ТипОбъекта;
	КонецЕсли; 
	НоваяЗапись.ОбъектКлассификатора = ОбъектКлассификатора;
	НоваяЗапись.ОбъектТОИР = ОбъектТоир;

	НаборЗаписейСооттветствия.Записать();

КонецПроцедуры 

////////////////////////////////////////////////////////////////////////////////
//
// Функция СоответствиеГруппыОборудования
//
// Описание: Заполняет соответствие всемы кодами групп оборудорвания с ссылками.
//
// Возвращаемое значение: 
//	Соответствие - Ключ: код группы, Значение: СправочникСсылка.гкс_КодыГруппОборудования.
//
Функция СоответствиеГруппыОборудования()
	
	Соответствие = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	гкс_ГруппыОборудования.Код КАК Код,
		|	гкс_ГруппыОборудования.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.гкс_ГруппыОборудования КАК гкс_ГруппыОборудования
		|ГДЕ
		|	гкс_ГруппыОборудования.Код <> """"";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Соответствие.Вставить(ВыборкаДетальныеЗаписи.Код, ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
//
// Функция ПодготовитьОбъектыДляЗаполнения
//
// Описание: Подготовка пустых структур, ТЗ и т.д. для заполнения данных по значениям атрибутов.
//
// Возвращаемое значение: 
//	Структура - пустые структуры для заполнения.
//
Функция ПодготовитьОбъектыДляЗаполнения()
	
	СтруктураДляЗаполнения = Новый Структура;
	
	ОписаниеТипСтрока = Новый ОписаниеТипов("Строка");

	ДобавляемыеТипы = Перечисления.ТипВсеСсылки().Типы();
	ДобавляемыеТипы.Добавить(Тип("Строка"));
	ДобавляемыеТипы.Добавить(Тип("Число"));
	ДобавляемыеТипы.Добавить(Тип("Дата"));

	ТипВсеСсылки =  Новый ОписаниеТипов(Справочники.ТипВсеСсылки(), ДобавляемыеТипы);

	МассивТипПВХ = Новый Массив;
	МассивТипПВХ.Добавить(Тип("ПланВидовХарактеристикСсылка.АтрибутыКласса")); 
	МассивТипПВХ.Добавить(Тип("СправочникСсылка.ВложенныеАтрибутыКласса")); 
	ТипПВХ = Новый ОписаниеТипов(МассивТипПВХ);

	ТипКлассы = Новый ОписаниеТипов("СправочникСсылка.Классы");
	СтрокиТабличныхАтрибутов = Новый ТаблицаЗначений;
	СтрокиТабличныхАтрибутов.Колонки.Добавить("АтрибутКласса", ТипПВХ);
	СтрокиТабличныхАтрибутов.Колонки.Добавить("ЗначениеАтрибутаКласса", ТипВсеСсылки);
	СтрокиТабличныхАтрибутов.Колонки.Добавить("ИДСтроки", Новый ОписаниеТипов("Число"));
	СтрокиТабличныхАтрибутов.Колонки.Добавить("ИДСтрокиРодителя", Новый ОписаниеТипов("Число"));
	СтрокиТабличныхАтрибутов.Колонки.Добавить("ИсточникЗначений", ТипКлассы);
	СтрокиТабличныхАтрибутов.Колонки.Добавить("ИсходныйНомерСтроки", Новый ОписаниеТипов("Число"));
	СтрокиТабличныхАтрибутов.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));
	СтрокиТабличныхАтрибутов.Колонки.Добавить("НоменклатураКласса", Новый ОписаниеТипов("СправочникСсылка.НоменклатураКласса"));
	СтрокиТабличныхАтрибутов.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	СтрокиТабличныхАтрибутов.Колонки.Добавить("ОбъектыНоменклатуры", Новый ОписаниеТипов("Строка"));
	СтрокиТабличныхАтрибутов.Колонки.Добавить("Порядок", Новый ОписаниеТипов("Число"));
	СтрокиТабличныхАтрибутов.Колонки.Добавить("СтатусНаследования", Новый ОписаниеТипов("Число"));
	МассивТипТехКарты = Новый Массив;
	МассивТипТехКарты.Добавить(Тип("СправочникСсылка.Классы")); 
	МассивТипТехКарты.Добавить(Тип("СправочникСсылка.НоменклатураКласса")); 
	ТипТК = Новый ОписаниеТипов(МассивТипТехКарты);
	СтрокиТабличныхАтрибутов.Колонки.Добавить("ТехКарта", ТипТК);		
	
	СтруктураДляЗаполнения.Вставить("СтрокиТабличныхАтрибутов", СтрокиТабличныхАтрибутов);

	ЗначенияТабличныхАтрибутов = Новый ТаблицаЗначений;
	ЗначенияТабличныхАтрибутов.Колонки.Добавить("АтрибутКласса", ТипПВХ);
	ЗначенияТабличныхАтрибутов.Колонки.Добавить("АтрибутТаблицы", ТипПВХ);
	ЗначенияТабличныхАтрибутов.Колонки.Добавить("ЗначениеАтрибутаТаблицы",  ТипВсеСсылки);
	ЗначенияТабличныхАтрибутов.Колонки.Добавить("ИДСтроки", Новый ОписаниеТипов("Число"));
	ЗначенияТабличныхАтрибутов.Колонки.Добавить("ИДСтрокиРодителя", Новый ОписаниеТипов("Число"));
	ЗначенияТабличныхАтрибутов.Колонки.Добавить("ИсходныйНомерСтроки", Новый ОписаниеТипов("Число"));
	ЗначенияТабличныхАтрибутов.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	
	СтруктураДляЗаполнения.Вставить("ЗначенияТабличныхАтрибутов", ЗначенияТабличныхАтрибутов);
	
	ТЗМатЗатраты = Новый ТаблицаЗначений;
	ТЗМатЗатраты.Колонки.Добавить("ID");
	ТЗМатЗатраты.Колонки.Добавить("ЕдиницаИзмерения");
	ТЗМатЗатраты.Колонки.Добавить("Качество");
	ТЗМатЗатраты.Колонки.Добавить("Количество");
	ТЗМатЗатраты.Колонки.Добавить("Операция");
	ТЗМатЗатраты.Колонки.Добавить("Номенклатура");
	ТЗМатЗатраты.Колонки.Добавить("ХарактеристикаНоменклатуры");
	
	СтруктураДляЗаполнения.Вставить("ТЗМатЗатраты", ТЗМатЗатраты);
	
	ТЗПоказатели = Новый ТаблицаЗначений;
	ТЗПоказатели.Колонки.Добавить("ID");
	ТЗПоказатели.Колонки.Добавить("Показатель");
	ТЗПоказатели.Колонки.Добавить("ЕдиницаИзмерения");
	ТЗПоказатели.Колонки.Добавить("Операция");
	ТЗПоказатели.Колонки.Добавить("Значение");
	
	СтруктураДляЗаполнения.Вставить("ТЗПоказатели", ТЗПоказатели);
	
	ТЗИсполнитель = Новый ТаблицаЗначений;
	ТЗИсполнитель.Колонки.Добавить("Исполнитель");
	
	СтруктураДляЗаполнения.Вставить("ТЗИсполнитель", ТЗИсполнитель);
	
	ТЗИнструменты = Новый ТаблицаЗначений;
	ТЗИнструменты.Колонки.Добавить("ID");
	ТЗИнструменты.Колонки.Добавить("ЕдиницаИзмерения");
	ТЗИнструменты.Колонки.Добавить("Инструмент");
	ТЗИнструменты.Колонки.Добавить("Количество");
	ТЗИнструменты.Колонки.Добавить("Операция");
	
	СтруктураДляЗаполнения.Вставить("ТЗИнструменты", ТЗИнструменты);
	
	ТЗСписокОпераций = Новый ТаблицаЗначений;		
	ТЗСписокОпераций.Колонки.Добавить("ID", ОписаниеТипСтрока);
	Массив = Новый Массив;
	Массив.Добавить(Тип("СправочникСсылка.НоменклатураКласса"));
	Массив.Добавить(Тип("СправочникСсылка.Классы"));
	ТЗСписокОпераций.Колонки.Добавить("Операция", Новый ОписаниеТипов(Массив));
	ТЗСписокОпераций.Колонки.Добавить("Продолжительность", Новый ОписаниеТипов("Число"));
	ТЗСписокОпераций.Колонки.Добавить("НормаВремениВСекундах", Новый ОписаниеТипов("Число"));
	
	СтруктураДляЗаполнения.Вставить("ТЗСписокОпераций", ТЗСписокОпераций);
	
	Возврат СтруктураДляЗаполнения;
	
КонецФункции                            

////////////////////////////////////////////////////////////////////////////////
//
// Функция ЗначениеАтрибута
//
// Описание: Значение атрибута класса.	
//
// Параметры:
//	НомКласса - СправочникСсылка.НоменклатураКласса - Объект ТОИР
//	Атрибут - ПланВидовХарактеристикСсылка.АтрибутыКласса - ОбъектКлассификатора.
//
// Возвращаемое значение: 
//	ЗначениеАтрибутаКласса - ЗначениеАтрибутаКласса.
//
Функция ЗначениеАтрибута(НомКласса, Атрибут)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		|	ЗначенияАтрибутовКласса.ЗначениеАтрибутаКласса КАК ЗначениеАтрибутаКласса
		|ИЗ
		|	РегистрСведений.ЗначенияАтрибутовКласса КАК ЗначенияАтрибутовКласса
		|ГДЕ
		|	ЗначенияАтрибутовКласса.Класс = &Класс
		|	И ЗначенияАтрибутовКласса.АтрибутКласса = &АтрибутКласса";
	
	Запрос.УстановитьПараметр("АтрибутКласса", Атрибут);
	Запрос.УстановитьПараметр("Класс", НомКласса);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();

	Возврат ВыборкаДетальныеЗаписи.ЗначениеАтрибутаКласса;
	
КонецФункции
 
////////////////////////////////////////////////////////////////////////////////
//
// Функция НайтиПоСоответствию
//
// Описание: Поиск объекта ТОИР по ссылке на объект классификатора.	
//
// Параметры:
//	ОбъектКлассификатора - СправочникСсылка.Классы, СправочникСсылка.НоменклатураКласса - Объект ТОИР
//	ТипОбъекта - ПеречислениеСсылка.гкс_ТипОбъектаТОИР - ОбъектКлассификатора.
//
// Возвращаемое значение: 
//	СправочникСсылка - Найденное значение.
//
Функция НайтиПоСоответствию(ОбъектКлассификатора, ТипОбъекта = Неопределено)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	гкс_СоответствиеОбъектовКлассификатораИТОИР.ОбъектТОИР КАК ОбъектТОИР
		|ИЗ
		|	РегистрСведений.гкс_СоответствиеОбъектовКлассификатораИТОИР КАК гкс_СоответствиеОбъектовКлассификатораИТОИР
		|ГДЕ
		|	гкс_СоответствиеОбъектовКлассификатораИТОИР.ОбъектКлассификатора = &ОбъектКлассификатора
		|	И гкс_СоответствиеОбъектовКлассификатораИТОИР.ТипОбъекта = &ТипОбъекта";
	
	Запрос.УстановитьПараметр("ОбъектКлассификатора", ОбъектКлассификатора);
	Запрос.УстановитьПараметр("ТипОбъекта", ТипОбъекта);
	
	Если ТипОбъекта = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И гкс_СоответствиеОбъектовКлассификатораИТОИР.ТипОбъекта = &ТипОбъекта", "");
	КонецЕсли; 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();

	Возврат ВыборкаДетальныеЗаписи.ОбъектТОИР;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
//
// Функция ОбработатьСтрокиТехОпераций
//
// Описание: Заполнение списка операций на основании множественных значений атрибутов. 	
// 
// Параметры:
//	ВыборкаСтроки - ВыборкаИзРезультатаЗапроса - ВыборкаИзРезультатаЗапроса
//	СоответствиеСтрокГуИДам - Соответствие - соответствие для связи строк различных табличных частей
//	ТЗСписокОпераций - ТаблицаЗначений - ТЗСписокОпераций.
//
Процедура ОбработатьСтрокиТехОпераций(ВыборкаСтроки,
									СоответствиеСтрокГуИДам,
									ТЗСписокОпераций)
	                                                             
	Пока ВыборкаСтроки.Следующий() Цикл
		ВыборкаСтрокиРодителя = ВыборкаСтроки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСтрокиРодителя.Следующий() Цикл
			ГУИДСтроки = Новый УникальныйИдентификатор;
			СоответствиеСтрокГуИДам.Вставить(ВыборкаСтрокиРодителя.ИДСтроки, ГУИДСтроки);
			СтрокаТЗ = ТЗСписокОпераций.Добавить();
			Выборка = ВыборкаСтрокиРодителя.Выбрать();
			Пока Выборка.Следующий() Цикл
				СтрокаТЗ.ID = ГУИДСтроки;
				Если Выборка.ИмяДляОбменаАтрибутТаблицы = "ВидОперации" Тогда
					СтрокаТЗ.Операция = Выборка.ЗначениеАтрибутаТаблицы;	
				ИначеЕсли Выборка.ИмяДляОбменаАтрибутТаблицы = "ДлительностьОперации" Тогда
					СтрокаТЗ.Продолжительность = Выборка.ЗначениеАтрибутаТаблицы;
					Если Выборка.ЗначениеАтрибутаТаблицы = Неопределено Тогда
						СтрокаТЗ.НормаВремениВСекундах = 0;
					Иначе
						СтрокаТЗ.НормаВремениВСекундах = Выборка.ЗначениеАтрибутаТаблицы * 60;
					КонецЕсли; 
				КонецЕсли; 
			КонецЦикла; 
		КонецЦикла; 
	КонецЦикла;
					
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
//
// Функция ОбработатьСтрокиИнструменты
//
// Описание: Заполнение списка Инструментов на основании множественных значений атрибутов. 	
// 
// Параметры:
//	ВыборкаСтроки - ВыборкаИзРезультатаЗапроса - ВыборкаИзРезультатаЗапроса
//	СоответствиеСтрокГуИДам - Соответствие - соответствие для связи строк различных табличных частей
//	ТЗИнструменты - ТаблицаЗначений - ТЗИнструменты.
//
Процедура ОбработатьСтрокиИнструменты(ВыборкаСтроки, СоответствиеСтрокГуИДам, ТЗИнструменты)
									
	Пока ВыборкаСтроки.Следующий() Цикл
	ВыборкаСтрокиРодителя = ВыборкаСтроки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСтрокиРодителя.Следующий() Цикл
			Выборка = ВыборкаСтрокиРодителя.Выбрать();
			СтрокаТЗ = ТЗИнструменты.Добавить();
			СтрокаТЗ.ID = СоответствиеСтрокГуИДам[ВыборкаСтрокиРодителя.ИДСтрокиРодителя];
			СтрокаТЗ.Количество = 1;
			
			Пока Выборка.Следующий() Цикл							
				Если Выборка.ИмяДляОбменаАтрибутТаблицы = "Номенклатура" Тогда
					СтрокаТЗ.Инструмент = Выборка.ЗначениеАтрибутаТаблицы;	
				ИначеЕсли Выборка.ИмяДляОбменаАтрибутТаблицы = "ЕдиницаИзмерения" Тогда
					СтрокаТЗ.ЕдиницаИзмерения = Выборка.ЗначениеАтрибутаТаблицы;	
				КонецЕсли; 														
			КонецЦикла; 
		КонецЦикла; 
	КонецЦикла; 	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
//
// Функция ОбработатьСтрокиИсполнители
//
// Описание: Заполнение списка Исполнителей на основании множественных значений атрибутов. 	
// 
// Параметры:
//	ВыборкаСтроки - ВыборкаИзРезультатаЗапроса - ВыборкаИзРезультатаЗапроса
//	СоответствиеСтрокГуИДам - Соответствие - соответствие для связи строк различных табличных частей
//	ТЗИсполнитель - ТаблицаЗначений - ТЗИсполнитель.
//
Процедура ОбработатьСтрокиИсполнители(ВыборкаСтроки, СоответствиеСтрокГуИДам, ТЗИсполнитель)
	
	Пока ВыборкаСтроки.Следующий() Цикл
	ВыборкаСтрокиРодителя = ВыборкаСтроки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСтрокиРодителя.Следующий() Цикл
			Выборка = ВыборкаСтрокиРодителя.Выбрать();
			СтрокаТЗ = ТЗИсполнитель.Добавить();
			Пока Выборка.Следующий() Цикл
				Если Выборка.ИмяДляОбменаАтрибутТаблицы = "Исполнитель" Тогда
					СтрокаТЗ.Исполнитель = Выборка.ЗначениеАтрибутаТаблицы;	
				КонецЕсли; 	
			КонецЦикла; 
		КонецЦикла; 
	КонецЦикла; 
	
КонецПроцедуры
 
////////////////////////////////////////////////////////////////////////////////
//
// Функция ОбработатьСтрокиПоказатели
//
// Описание: Заполнение списка Показателей на основании множественных значений атрибутов. 	
// 
// Параметры:
//	ВыборкаСтроки - ВыборкаИзРезультатаЗапроса - ВыборкаИзРезультатаЗапроса
//	СоответствиеСтрокГуИДам - Соответствие - соответствие для связи строк различных табличных частей
//	ТЗПоказатели - ТаблицаЗначений - ТЗПоказатели
//	ТЗСписокОпераций - ТаблицаЗначений - ТЗСписокОпераций.
//
Процедура ОбработатьСтрокиПоказатели(ВыборкаСтроки, СоответствиеСтрокГуИДам, ТЗПоказатели, ТЗСписокОпераций)
	
	Пока ВыборкаСтроки.Следующий() Цикл
	ВыборкаСтрокиРодителя = ВыборкаСтроки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСтрокиРодителя.Следующий() Цикл
			Выборка = ВыборкаСтрокиРодителя.Выбрать();
			СтрокаТЗ = ТЗПоказатели.Добавить();
			СтрокаТЗ.ID = СоответствиеСтрокГуИДам[ВыборкаСтрокиРодителя.ИДСтрокиРодителя];
			СтрокаОперации = ТЗСписокОпераций.НайтиСтроки(Новый Структура("ID",СтрокаТЗ.ID));
			Если СтрокаОперации.Количество() > 0 Тогда
				СтрокаТЗ.Операция = СтрокаОперации[0].Операция;
			КонецЕсли; 
			Пока Выборка.Следующий() Цикл
				Если Выборка.ИмяДляОбменаАтрибутТаблицы = "КонтролируемыйПоказатель" Тогда
					СтрокаТЗ.Показатель = Выборка.ЗначениеАтрибутаТаблицы;	
				ИначеЕсли Выборка.ИмяДляОбменаАтрибутТаблицы = "ЕдиницаИзмерения" Тогда 
					СтрокаТЗ.ЕдиницаИзмерения = Выборка.ЗначениеАтрибутаТаблицы;	
				ИначеЕсли Выборка.ИмяДляОбменаАтрибутТаблицы = "Значение" Тогда
					СтрокаТЗ.Значение = Выборка.ЗначениеАтрибутаТаблицы;	
				КонецЕсли; 	
			КонецЦикла; 
		КонецЦикла; 
	КонецЦикла; 
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
//
// Функция ОбработатьСтрокиМатериальныеЗатраты
//
// Описание: Заполнение списка материальных затрат на основании множественных значений атрибутов. 	
// 
// Параметры:
//	ВыборкаСтроки - ВыборкаИзРезультатаЗапроса - ВыборкаИзРезультатаЗапроса
//	СоответствиеСтрокГуИДам - Соответствие - соответствие для связи строк различных табличных частей
//	ТЗМатЗатраты - ТаблицаЗначений - ТЗМатЗатраты.
//
Процедура ОбработатьСтрокиМатериальныеЗатраты(ВыборкаСтроки, СоответствиеСтрокГуИДам, ТЗМатЗатраты)
	
	Пока ВыборкаСтроки.Следующий() Цикл
	ВыборкаСтрокиРодителя = ВыборкаСтроки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСтрокиРодителя.Следующий() Цикл
			Выборка = ВыборкаСтрокиРодителя.Выбрать();
			СтрокаТЗ = ТЗМатЗатраты.Добавить();
			СтрокаТЗ.ID = СоответствиеСтрокГуИДам[ВыборкаСтрокиРодителя.ИДСтрокиРодителя];
			Пока Выборка.Следующий() Цикл
				Если Выборка.ИмяДляОбменаАтрибутТаблицы = "Номенклатура" Тогда
					СтрокаТЗ.Номенклатура = Выборка.ЗначениеАтрибутаТаблицы;	
				ИначеЕсли Выборка.ИмяДляОбменаАтрибутТаблицы = "ЕдиницаИзмерения" Тогда
					СтрокаТЗ.ЕдиницаИзмерения = Выборка.ЗначениеАтрибутаТаблицы;	
				ИначеЕсли Выборка.ИмяДляОбменаАтрибутТаблицы = "Количество" Тогда
					СтрокаТЗ.Количество = Выборка.ЗначениеАтрибутаТаблицы;	
				КонецЕсли; 														
			КонецЦикла; 
		КонецЦикла; 
	КонецЦикла; 	
	
КонецПроцедуры
 
////////////////////////////////////////////////////////////////////////////////
//
// Функция ОбработатьСтрокиТехКарт
//
// Описание: Заполнение структуру данных тех. карт. 	
// 
// Параметры:
//	ВыборкаСтроки - ВыборкаИзРезультатаЗапроса - ВыборкаИзРезультатаЗапроса
//	СоответствиеСтрокГуИДам - Соответствие - соответствие для связи строк различных табличных частей
//	ИсходящиеДанные - Структура - Данные тех карты.
//
Процедура ОбработатьСтрокиТехКарт(ВыборкаСтроки, СоответствиеСтрокГуИДам, ИсходящиеДанные)
	
	Периодичность = 0;
	Наименование = "";
	СпособПланирования = Неопределено;
	ТипТехКарты = Неопределено;
	
	Пока ВыборкаСтроки.Следующий() Цикл
	ВыборкаСтрокиРодителя = ВыборкаСтроки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСтрокиРодителя.Следующий() Цикл
			Выборка = ВыборкаСтрокиРодителя.Выбрать();
			Пока Выборка.Следующий() Цикл
				Если Выборка.ИмяДляОбменаАтрибутТаблицы = "Периодичность" Тогда
					Периодичность = Выборка.ЗначениеАтрибутаТаблицы;													
				ИначеЕсли Выборка.ИмяДляОбменаАтрибутТаблицы = "СпособПланирования" Тогда
					СпособПланирования = Выборка.ЗначениеАтрибутаТаблицы;													
				ИначеЕсли Выборка.ИмяДляОбменаАтрибутТаблицы = "ТипТехКарты" Тогда
					ТипТехКарты = Выборка.ЗначениеАтрибутаТаблицы;													
				КонецЕсли; 
				Наименование = Выборка.ЗначениеАтрибутаКласса;
			КонецЦикла; 
		КонецЦикла; 
	КонецЦикла; 
	ИсходящиеДанные.Вставить("НормаВремени", ?(Не ЗначениеЗаполнено(Периодичность), 1, Периодичность));	
	ИсходящиеДанные.Вставить("Наименование", СокрЛП(Наименование));	
	ИсходящиеДанные.Вставить("СпособПланирования", СпособПланирования);	
	ИсходящиеДанные.Вставить("ТипТехКарты", ТипТехКарты);	
	
КонецПроцедуры
 
////////////////////////////////////////////////////////////////////////////////
//
// Функция ДобавитьСтрокуНормативныхРемонтов
//
// Описание: ДобавитьСтрокуНормативныхРемонтов.
//
// Параметры:
//	ТОР - СправочникСсылка.торо_ТиповыеОР  
//	ИдКарта - СправочникСсылка.торо_ИдентификаторыТехКарт
//	ИсходящиеДанные - Структура - Данные тех карты.
//
Процедура ДобавитьСтрокуНормативныхРемонтов(ТОР, ИдКарта, ИсходящиеДанные)
	
	НормРемонт = ТОР.НормативныеРемонты.Добавить();					
	НормРемонт.НормативныйРемонт = ИдКарта;
	НормРемонт.Статус = ПредопределенноеЗначение("Перечисление.торо_СтатусыНормативныхРемонтовИТехКарт.Редактируется");
	НормРемонт.ГрафикРемонтныхРабот = ПредопределенноеЗначение("Справочник.Календари.Круглосуточно");
	НормРемонт.СпособВыполнения = ПредопределенноеЗначение("Перечисление.СпособыСтроительства.Подрядный");
	НормРемонт.СпособУчетаДатыОтсчета = ПредопределенноеЗначение("Перечисление.торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот.ПоПоследнемуРемонтуИлиДатеПланирования");						
	ВидыРемонтов = ТОР.НормативныеРемонты.ВыгрузитьКолонку("ВидРемонта");
	Если ИсходящиеДанные.Свойство("ТипТехКарты") И ЗначениеЗаполнено(ИсходящиеДанные.ТипТехКарты) Тогда
		ВидРемонта = ВидРемонта(ИсходящиеДанные.ТипТехКарты, ВидыРемонтов);
	Иначе
		ВидРемонта = ВидРемонта(ИдКарта, ВидыРемонтов);
	КонецЕсли; 
	НормРемонт.ВидРемонта = ВидРемонта;
	
	Если ИсходящиеДанные.Свойство("СпособПланирования") И ЗначениеЗаполнено(ИсходящиеДанные.СпособПланирования) Тогда
		НормРемонт.СпособПланирования = СпособПланирования(СокрЛП(ИсходящиеДанные.СпособПланирования));						
	Иначе
		НормРемонт.СпособПланирования = ПредопределенноеЗначение("Справочник.торо_СпособыПланированияРемонтныхРабот.Ежегодно");
	КонецЕсли; 
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
//
// Функция СоздатьТехКарту
//
// Описание: Сообщение журнала регистрации	
//
// Параметры:
//	ИсходящиеДанные - Структура - Данные тех карты.
//
// Возвращаемое значение: 
//	СправочникСсылка.торо_ИдентификаторыТехКарт - СправочникСсылка.торо_ИдентификаторыТехКарт.
//
Функция СоздатьТехКарту(ИсходящиеДанные)
	
	НоваяКарта = Ложь;
	ТехКарта = НайтиПоСоответствию(ИсходящиеДанные.ТехКарта, ПредопределенноеЗначение("Перечисление.гкс_ТипОбъектаТОИР.ТехКрата"));	
	Если ТехКарта = Неопределено Тогда
		НоваяКарта = Истина;
		ТехКарта = Справочники.торо_ТехКарты.СоздатьЭлемент();
	Иначе
		ТехКарта = ТехКарта.ПолучитьОбъект();
	КонецЕсли;
	
	ТехКарта.Наименование = ИсходящиеДанные.Наименование;
	ТехКарта.НормаВремени = ИсходящиеДанные.НормаВремени * 3600;
	ТехКарта.ДатаПринятия = НачалоМесяца(ТекущаяДатаСеанса());
	
	ЗаполнитьОперации(ИсходящиеДанные, ТехКарта);
	ЗаполнитьИзмеряемыеПоказатели(ИсходящиеДанные, ТехКарта);
	
	ТехКарта.Записать();		
	
	Если НоваяКарта Тогда
		ИДКарты = СоздатьИДКарту(ТехКарта, ИсходящиеДанные);
	Иначе
		ИДКарты = ПолучитьИДКарты(ТехКарта, ИсходящиеДанные);
	КонецЕсли; 
	
	Возврат ИДКарты;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
//
// Функция ВидРемонта
//
// Описание: поиск вида ремонта тех карты.	
//
// Параметры:
//	ИдКарта - СправочникСсылка.торо_ИдентификаторыТехКарт
//	ВидыРемонтов - Массив - Массив видов ремонта.
//
// Возвращаемое значение: 
//	СправочникСсылка.торо_ВидыРемонтов - ВидРемонта.
//
Функция ВидРемонта(ИдКарта, ВидыРемонтов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	торо_ВидыРемонтов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.торо_ВидыРемонтов КАК торо_ВидыРемонтов
		|ГДЕ
		|	торо_ВидыРемонтов.Наименование = &Наименование
		|	И НЕ торо_ВидыРемонтов.Ссылка В (&ВидыРемонтов)";
	
	Запрос.УстановитьПараметр("ВидыРемонтов", ВидыРемонтов);
	Запрос.УстановитьПараметр("Наименование", ИДКарта.Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	ВидРемонта = ВыборкаДетальныеЗаписи.Ссылка;
	Если Не ЗначениеЗаполнено(ВидРемонта) Тогда
		НовыйВидРемонта = Справочники.торо_ВидыРемонтов.СоздатьЭлемент();
		НовыйВидРемонта.Наименование = ИдКарта.Наименование;
		НовыйВидРемонта.ГрафикМероприятий = Истина;
		НовыйВидРемонта.ПланГрафикППР = Истина;
		НовыйВидРемонта.Записать();
		ВидРемонта = НовыйВидРемонта.Ссылка;
	КонецЕсли; 
	
	Возврат ВидРемонта;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
//
// Функция СпособПланирования
//
// Описание: Возвращает ссылку на способ планирования ремонтных работ.
//
// Параметры:
//	СпособПланированияИмя - Строка
//
// Возвращаемое значение: 
//	СправочникСсылка.торо_СпособыПланированияРемонтныхРабот - СправочникСсылка.торо_СпособыПланированияРемонтныхРабот.
//
Функция СпособПланирования(СпособПланированияИмя)
	
	СпособПланирования = торо_СпособыПланированияРемонтныхРаботПоНаименованию(СпособПланированияИмя);
	Если Не ЗначениеЗаполнено(СпособПланирования) Тогда
		НовыйСпособПланирования = Справочники.торо_СпособыПланированияРемонтныхРабот.СоздатьЭлемент();
		НовыйСпособПланирования.Наименование = СпособПланированияИмя;
		НовыйСпособПланирования.Записать();
		СпособПланирования = НовыйСпособПланирования.Ссылка;
	КонецЕсли; 
	
	Возврат СпособПланирования;
	
КонецФункции      

////////////////////////////////////////////////////////////////////////////////
//
// Функция ЗаполнитьОперации
//
// Описание: Заполнение списка операций в тех карте.
//
// Параметры:
//	ИсходящиеДанные - Структура
//	ТехКарта - СправочникСсылка.торо_ТехКарты - заполняемая тех карта.
//
Процедура ЗаполнитьОперации(ИсходящиеДанные, ТехКарта)
	
	ТехКарта.СписокОпераций.Очистить();
		
	Операции = ИсходящиеДанные.СписокОпераций;
	Для каждого ТекСтрока Из Операции Цикл
		Если ТекСтрока.Операция = Неопределено Тогда
			Продолжить;			
		КонецЕсли; 
		
		ТехОперация = НайтиПоСоответствию(ТекСтрока.Операция);
		Если ТехОперация = Неопределено Тогда
			ТехОперация = Справочники.торо_ТехнологическиеОперации.СоздатьЭлемент();
		Иначе
		    ТехОперация = ТехОперация.ПолучитьОбъект();
		КонецЕсли; 
		
		ТехОперация.Наименование = ТекСтрока.Операция.Наименование;
		ТехОперация.НормаВремени = ТекСтрока.НормаВремениВСекундах;
		
		ТехОперация.Записать();
		
		ДобавитьСоответствиеОбъектов(ТехОперация.Ссылка, ТекСтрока.Операция);
		
		НовСтрока = ТехКарта.СписокОпераций.Добавить();
		НовСтрока.ID = ТекСтрока.ID;
		НовСтрока.Количество = 1;
		НовСтрока.Продолжительность = ТекСтрока.НормаВремениВСекундах;
		НовСтрока.Операция = ТехОперация.Ссылка;		
		
	КонецЦикла;     		

КонецПроцедуры 

////////////////////////////////////////////////////////////////////////////////
//
// Функция ЗаполнитьИзмеряемыеПоказатели
//
// Описание: Заполнение списка измеряемых показателей в тех карте.
//
// Параметры:
//	ИсходящиеДанные - Структура
//	ТехКарта - СправочникСсылка.торо_ТехКарты - заполняемая тех карта.
//
Процедура ЗаполнитьИзмеряемыеПоказатели(ИсходящиеДанные, ТехКарта)
	
	ИзмеряемыеПоказатели = ИсходящиеДанные.ИзмеряемыеПоказатели;
	ИзмеряемыеПоказателиТОиР = ТехКарта.ИзмеряемыеПоказатели;
	
	ИзмеряемыеПоказателиТОиР.Очистить();
	Для каждого ТекПоказатель Из ИзмеряемыеПоказатели Цикл
		НоваяСтрока = ИзмеряемыеПоказателиТОиР.Добавить();
		ПоказательТОИР = СсылкаНаПоказатель(ТекПоказатель.Показатель, ТекПоказатель.ЕдиницаИзмерения);
		НоваяСтрока.ID = ТекПоказатель.ID;
		НоваяСтрока.Показатель = ПоказательТОИР;
	КонецЦикла; 

КонецПроцедуры 

////////////////////////////////////////////////////////////////////////////////
//
// Функция ПолучитьИДКарты
//
// Описание: Поиск Идентификатора Тех карты по ссылке на тех карту.
//
// Параметры:
//	ТехКарта - СправочникСсылка.торо_ТехКарты - заполняемая тех карта.
//	ИсходящиеДанные - Структура
//
// Возвращаемое значение: 
//	СправочникСсылка.торо_ИдентификаторыТехКарт - торо_ИдентификаторыТехКарт.
//
Функция ПолучитьИДКарты(ТехКарта, ИсходящиеДанные)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		|	торо_ВерсииТехКартСрезПоследних.ИдентификаторТехКарты КАК ИдентификаторТехКарты
		|ИЗ
		|	РегистрСведений.торо_ВерсииТехКарт.СрезПоследних КАК торо_ВерсииТехКартСрезПоследних
		|ГДЕ
		|	торо_ВерсииТехКартСрезПоследних.ТехКарта = &ТехКарта";
	
	Запрос.УстановитьПараметр("ТехКарта", ТехКарта.ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат СоздатьИДКарту(ТехКарта, ИсходящиеДанные);		
	КонецЕсли; 
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.ИдентификаторТехКарты;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
//
// Функция СоздатьИДКарту
//
// Описание: Создает элемент справочника торо_ИдентификаторыТехКарт.
//
// Параметры:
//	ТехКарта - СправочникСсылка.торо_ТехКарты - заполняемая тех карта.
//	ИсходящиеДанные - Структура
//
// Возвращаемое значение: 
//	СправочникСсылка.торо_ИдентификаторыТехКарт - торо_ИдентификаторыТехКарт.
//
Функция СоздатьИДКарту(ТехКарта, ИсходящиеДанные)
	
	ИдентификаторТехКарты = Справочники.торо_ИдентификаторыТехКарт.СоздатьЭлемент();
	ИдентификаторТехКарты.Наименование = ИсходящиеДанные.Наименование;
	ИдентификаторТехКарты.Статус = ПредопределенноеЗначение("Перечисление.торо_СтатусыНормативныхРемонтовИТехКарт.Действует");
	ИдентификаторТехКарты.Записать();
	
	ДобавитьСоответствиеОбъектов(ТехКарта.Ссылка, ИсходящиеДанные.ТехКарта, ПредопределенноеЗначение("Перечисление.гкс_ТипОбъектаТОИР.ТехКрата"));
	
	НаборЗаписейИдентификатора = РегистрыСведений.торо_ВерсииТехКарт.СоздатьНаборЗаписей();
	НаборЗаписейИдентификатора.Отбор.ИдентификаторТехКарты.Установить(ИдентификаторТехКарты.Ссылка);
	НоваяЗапись = НаборЗаписейИдентификатора.Добавить();
	НоваяЗапись.Период = НачалоМесяца(ТекущаяДатаСеанса());
	НоваяЗапись.ИдентификаторТехКарты = ИдентификаторТехКарты.Ссылка;
	НоваяЗапись.ТехКарта = ТехКарта.Ссылка;
	НаборЗаписейИдентификатора.Записать();		
	
	Возврат ИдентификаторТехКарты.Ссылка;
		
КонецФункции          

////////////////////////////////////////////////////////////////////////////////
//
// Функция СсылкаНаПоказатель
//
// Описание: Получает ссылку на измеряемый показатель.
//
// Параметры:
//	ТекПоказатель - СправочникСсылка.НоменклатураКласса - показатель в классификаторе.
//	ЕдиницаИзмерения - СправочникСсылка.ЕдиницыИзмерения.
//
// Возвращаемое значение: 
//	ПланВидовХарактеристик.торо_ИзмеряемыеПоказателиОбъектовРемонта - Измеряемы показатель.
//
Функция СсылкаНаПоказатель(ТекПоказатель, ЕдиницаИзмерения)
	
	Если Не ЗначениеЗаполнено(ТекПоказатель) Тогда
		Возврат Неопределено;		
	КонецЕсли; 
	
	ЕдИзмИмя = "";
	
	ТекПоказательИмя = гкс_ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекПоказатель, "Наименование");
	Если ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
		ЕдИзмИмя = гкс_ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЕдиницаИзмерения, "Наименование");
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		|	ПоказателиТОИР.Ссылка КАК Ссылка
		|ИЗ
		|	ПланВидовХарактеристик.торо_ИзмеряемыеПоказателиОбъектовРемонта КАК ПоказателиТОИР
		|ГДЕ
		|	ПоказателиТОИР.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", ТекПоказательИмя);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		НовыйПоказатель = ПланыВидовХарактеристик.торо_ИзмеряемыеПоказателиОбъектовРемонта.СоздатьЭлемент();
		НовыйПоказатель.Наименование = ТекПоказательИмя;
		Если ЕдИзмИмя <> "" Тогда
			ЕдИзм = ЕдИзмПоИмени(ЕдИзмИмя);
			НовыйПоказатель.ЕдиницаИзмерения = ЕдИзм;    			
		КонецЕсли; 
		НовыйПоказатель.Записать();		
		Возврат НовыйПоказатель.Ссылка;
	КонецЕсли; 
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	ПоказательТОИР = ВыборкаДетальныеЗаписи.Ссылка;
	Если ЗначениеЗаполнено(ПоказательТОИР) И Не ЗначениеЗаполнено(ПоказательТОИР.ЕдиницаИзмерения) Тогда
		ПоказательТОИРОбъект = ПоказательТОИР.ПолучитьОбъект();		
		ПоказательТОИРОбъект.ЕдиницаИзмерения = ЕдИзмПоИмени(ЕдИзмИмя);
		ПоказательТОИРОбъект.Записать();
		ПоказательТОИР = ПоказательТОИРОбъект.Ссылка;
	КонецЕсли; 
	
	Возврат ПоказательТОИР;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
//
// Функция ЕдИзмПоИмени
//
// Описание: Сообщение журнала регистрации	
//
// Возвращаемое значение: 
//	Строка - Сообщение журнала регистрации.
//
Функция ЕдИзмПоИмени(ЕдИзмИмя)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		|	ЕдиницыИзмерения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
		|ГДЕ
		|	ЕдиницыИзмерения.НаименованиеПолное = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", ЕдИзмИмя);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		ЕдИзм = ДобавитьЕдИзмИзКлассификатора(ЕдИзмИмя);	
		
	КонецЕсли; 
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	ЕдИзм = ВыборкаДетальныеЗаписи.Ссылка;
	
	Возврат ЕдИзм;	
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
//
// Функция ДобавитьЕдИзмИзКлассификатора
//
// Описание: Сообщение журнала регистрации	
//
// Возвращаемое значение: 
//	Строка - Сообщение журнала регистрации.
//
Функция ДобавитьЕдИзмИзКлассификатора(ЕдИзмИмя)
	
	ЕдИзм = Неопределено;
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	Макет = Справочники.ЕдиницыИзмерения.ПолучитьМакет("КлассификаторЕдиницИзмерения");
	Макет.Записать(ИмяВременногоФайла);
	Дерево = ЗначениеИзФайла(ИмяВременногоФайла);
	
	СтрокаДерева = Дерево.Строки.Найти(ЕдИзмИмя, "Наименование", Истина);
	
	Если ЗначениеЗаполнено(СтрокаДерева) Тогда
		СправочникОбъект = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
			
		Если ЗначениеЗаполнено(СтрокаДерева.УсловноеОбозначениеНациональное) Тогда
			Наименование = СтрокаДерева.УсловноеОбозначениеНациональное;
		ИначеЕсли ЗначениеЗаполнено(СтрокаДерева.УсловноеОбозначениеМеждународное) Тогда
			Наименование = СтрокаДерева.УсловноеОбозначениеМеждународное;
		ИначеЕсли ЗначениеЗаполнено(СтрокаДерева.КодовоеБуквенноеОбозначениеНациональное) Тогда
			Наименование = СтрокаДерева.КодовоеБуквенноеОбозначениеНациональное;
		ИначеЕсли ЗначениеЗаполнено(СтрокаДерева.КодовоеБуквенноеОбозначениеМеждународное) Тогда
			Наименование = СтрокаДерева.КодовоеБуквенноеОбозначениеМеждународное;
		Иначе
			Наименование = СтрокаДерева.Наименование;
		КонецЕсли;
			
		СправочникОбъект.Наименование            = СтрЗаменить(Наименование,Символы.ПС,"/");
		СправочникОбъект.МеждународноеСокращение = СтрЗаменить(СтрокаДерева.КодовоеБуквенноеОбозначениеМеждународное,Символы.ПС,"/");
		СправочникОбъект.НаименованиеПолное      = СтрЗаменить(СтрокаДерева.Наименование,Символы.ПС,"/");
		СправочникОбъект.Код                     = СтрокаДерева.КодЧисловой;
		
		Если СтрокаДерева.ВесоваяЕдиницаИзмерения Тогда
			СправочникОбъект.ТипЕдиницыИзмерения = Перечисления.ТипыЕдиницИзмерения.Весовая;
		Иначе
			КодыШтучныхТоваров = КодыШтучныхТоваров();
			Если КодыШтучныхТоваров.Найти(СтрокаДерева.КодЧисловой) <> Неопределено Тогда
				СправочникОбъект.ТипЕдиницыИзмерения = Перечисления.ТипыЕдиницИзмерения.Штучная;
			КонецЕсли;
		КонецЕсли;
		
		СправочникОбъект.Записать();
		
		ЕдИзм = СправочникОбъект.Ссылка;
	КонецЕсли;
	
	Возврат ЕдИзм;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
//
// Функция КодыШтучныхТоваров
//
// Описание: Сообщение журнала регистрации	
//
// Возвращаемое значение: 
//	Строка - Сообщение журнала регистрации.
//
Функция КодыШтучныхТоваров()
	
	КодыШтучныхТоваров = Новый Массив;
	КодыШтучныхТоваров.Добавить("616");
	КодыШтучныхТоваров.Добавить("625");
	КодыШтучныхТоваров.Добавить("626");
	КодыШтучныхТоваров.Добавить("630");
	КодыШтучныхТоваров.Добавить("641");
	КодыШтучныхТоваров.Добавить("657");
	КодыШтучныхТоваров.Добавить("683");
	КодыШтучныхТоваров.Добавить("704");
	КодыШтучныхТоваров.Добавить("715");
	КодыШтучныхТоваров.Добавить("730");
	КодыШтучныхТоваров.Добавить("732");
	КодыШтучныхТоваров.Добавить("733");
	КодыШтучныхТоваров.Добавить("734");
	КодыШтучныхТоваров.Добавить("735");
	КодыШтучныхТоваров.Добавить("736");
	КодыШтучныхТоваров.Добавить("737");
	КодыШтучныхТоваров.Добавить("740");
	КодыШтучныхТоваров.Добавить("745");
	КодыШтучныхТоваров.Добавить("778");
	КодыШтучныхТоваров.Добавить("780");
	КодыШтучныхТоваров.Добавить("781");
	КодыШтучныхТоваров.Добавить("796");
	КодыШтучныхТоваров.Добавить("797");
	КодыШтучныхТоваров.Добавить("798");
	КодыШтучныхТоваров.Добавить("799");
	КодыШтучныхТоваров.Добавить("800");
	КодыШтучныхТоваров.Добавить("801");
	КодыШтучныхТоваров.Добавить("802");
	
	Возврат КодыШтучныхТоваров;

КонецФункции

////////////////////////////////////////////////////////////////////////////////
//
// Функция торо_СпособыПланированияРемонтныхРаботПоНаименованию
//
// Описание: Поиск способа планирования ремонтных работ по наименование.
//
// Параметры:
//	Наименование - Строка - Наименование способа планирования.
//
// Возвращаемое значение: 
//	СправочникСсылка.торо_СпособыПланированияРемонтныхРабот - найденное значение.
//
Функция торо_СпособыПланированияРемонтныхРаботПоНаименованию(Наименование)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	торо_СпособыПланированияРемонтныхРабот.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.торо_СпособыПланированияРемонтныхРабот КАК торо_СпособыПланированияРемонтныхРабот
		|ГДЕ
		|	торо_СпособыПланированияРемонтныхРабот.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.Ссылка;
		
КонецФункции
 
#КонецОбласти 

#Область ОбъектыРемонта

////////////////////////////////////////////////////////////////////////////////
//
// Функция СозданиеОР
//
// Описание: Создание новых объектов ремонта.
//
Процедура СозданиеОР()
	
	Группа = Константы.гкс_ОсновнаяГруппаОбъектовРемонта.Получить();
	СоздатьИерархиюОРНаСервере(Группа);
	СоздатьОРНаСервере();        
		
КонецПроцедуры
 
////////////////////////////////////////////////////////////////////////////////
//
// Функция СоздатьИерархиюОРНаСервере
//
// Описание: Создание/добавление новых групп объектов ремонта.
//
// Параметры:
//	Группа - Константа.гкс_ОсновнаяГруппаОбъектовРемонта - Группа объектов ремонта,
//								в которую создаются все объекты ремонта по умолчанию.
//
Процедура СоздатьИерархиюОРНаСервере(Группа)
	
	ИерархияПоДокументам = ПолучитьИерархиюОРПоДокументам(Группа);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ГруппыВИерархии", ИерархияПоДокументам);
	Запрос.Текст = ТекстЗапроса_ИерархияОР();
			
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Добавленные = Новый Соответствие;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Наименование) Тогда
			
			НоваяГруппа = Справочники.торо_ОбъектыРемонта.СоздатьГруппу();        				
			
			НоваяГруппа.Наименование = ВыборкаДетальныеЗаписи.Наименование;
			
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ОРРодитель) Тогда
				Родитель = ВыборкаДетальныеЗаписи.ОРРодитель;
			Иначе
				Родитель = Группа;
			КонецЕсли; 
			НоваяГруппа.Записать();
			
			Добавленные.Вставить(НоваяГруппа.Ссылка, Родитель);
		КонецЕсли; 
		
	КонецЦикла;
	
	Если Добавленные.Количество() > 0 Тогда
		ДокументДобавленияВИерархию = Документы.торо_ИзменениеПоложенияВСтруктуреИерархии.СоздатьДокумент();
		ДокументДобавленияВИерархию.СтруктураИерархии = ПредопределенноеЗначение("Справочник.торо_СтруктурыОР.ОсновнаяИерархия");
		ДокументДобавленияВИерархию.Дата = ТекущаяДатаСеанса();
		Для каждого ТекСтрока Из Добавленные Цикл
			НоваяСтрока = ДокументДобавленияВИерархию.ПоложенияВСтруктуреИерархии.Добавить();
			НоваяСтрока.ОбъектИерархии = ТекСтрока.Ключ;
			НоваяСтрока.РодительИерархии = ТекСтрока.Значение;
			НоваяСтрока.ПредыдущееПоложение = "Внесен в структуру иерархии";
			НоваяСтрока.Удален = Ложь;
		КонецЦикла; 
		ДокументДобавленияВИерархию.Записать(РежимЗаписиДокумента.Проведение);		
	КонецЕсли; 	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
//
// Функция СоздатьОРНаСервере
//
// Описание: Создание нового объекта ремонта с установкой в иерархии документом.	
//
Процедура СоздатьОРНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса_ОРКСозданию();
			
	РезультатЗапроса = Запрос.Выполнить();
	МассивОР = Новый Массив; 
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ГрафикКруглосуточно = ПредопределенноеЗначение("Справочник.Календари.Круглосуточно");
		ДокументДобавленияВИерархию = Документы.торо_ИзменениеПоложенияВСтруктуреИерархии.СоздатьДокумент();
		ДокументДобавленияВИерархию.СтруктураИерархии = ПредопределенноеЗначение("Справочник.торо_СтруктурыОР.ОсновнаяИерархия");
		ДокументДобавленияВИерархию.Дата = ТекущаяДатаСеанса();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ОР) Тогда
				НовыйОбъектРемонта = ВыборкаДетальныеЗаписи.ОР.ПолучитьОбъект();
			Иначе
				НовыйОбъектРемонта = Справочники.торо_ОбъектыРемонта.СоздатьЭлемент();
			КонецЕсли; 
			НовыйОбъектРемонта.Наименование = ВыборкаДетальныеЗаписи.ТОРНаименование;
			НовыйОбъектРемонта.Изготовитель = ВыборкаДетальныеЗаписи.ТОРИзготовитель;
			НовыйОбъектРемонта.ПлановыйГрафикРаботы = ГрафикКруглосуточно;
			НовыйОбъектРемонта.ТиповойОР = ВыборкаДетальныеЗаписи.ТОР;
			НовыйОбъектРемонта.ДатаВыпуска = Дата(2018, 2, 10);
			НовыйОбъектРемонта.ДатаВводаВЭксплуатацию = Дата(2018, 2, 14);
			НовыйОбъектРемонта.Записать();
			МассивОР.Добавить(НовыйОбъектРемонта.Ссылка);
			
			НоваяСтрока = ДокументДобавленияВИерархию.ПоложенияВСтруктуреИерархии.Добавить();
			НоваяСтрока.ОбъектИерархии = НовыйОбъектРемонта.Ссылка;
			НоваяСтрока.РодительИерархии = ВыборкаДетальныеЗаписи.ОРРодитель;
			НоваяСтрока.ПредыдущееПоложение = "Внесен в структуру иерархии";
			НоваяСтрока.Удален = Ложь;
		КонецЦикла;
	
		ДокументДобавленияВИерархию.Записать(РежимЗаписиДокумента.Проведение);		
		
	КонецЕсли; 
	
	Если МассивОР.Количество() > 0 Тогда
		ЗаполнитьНормативныеРемонтыОРНаСервере(МассивОР);			
	КонецЕсли; 

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
//
// Функция ЗаполнитьНормативныеРемонтыОРНаСервере
//
// Описание: Заполнение РС нормативных ремонтов на основании ТЧ 
//			Нормативные ремонты справочника типовые объекты ремонта.
//
// Параметры:
//	МассивОР - Массив - массив Объектов ремонта.
//
Процедура ЗаполнитьНормативныеРемонтыОРНаСервере(МассивОР)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОР", МассивОР);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ОбъектыРемонта.Ссылка КАК ОбъектРемонта,
		|	торо_ТиповыеОРНормативныеРемонты.ВидРемонта КАК ВидРемонта,
		|	торо_ТиповыеОРНормативныеРемонты.Ссылка КАК ТиповойОР,
		|	торо_ТиповыеОРНормативныеРемонты.НормативныйРемонт КАК НормативныйРемонт,
		|	торо_ТиповыеОРНормативныеРемонты.СпособПланирования КАК СпособПланирования,
		|	торо_ТиповыеОРНормативныеРемонты.ГрафикРемонтныхРабот КАК ГрафикРемонтныхРабот,
		|	торо_ТиповыеОРНормативныеРемонты.СпособВыполнения КАК СпособВыполнения,
		|	торо_ТиповыеОРНормативныеРемонты.СпособУчетаДатыОтсчета КАК СпособУчетаДатыОтсчета
		|ИЗ
		|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ТиповыеОР.НормативныеРемонты КАК торо_ТиповыеОРНормативныеРемонты
		|		ПО торо_ОбъектыРемонта.ТиповойОР = торо_ТиповыеОРНормативныеРемонты.Ссылка
		|ГДЕ
		|	НЕ торо_ОбъектыРемонта.ЭтоГруппа
		|	И НЕ торо_ТиповыеОРНормативныеРемонты.Ссылка ЕСТЬ NULL
		|	И НЕ торо_ТиповыеОРНормативныеРемонты.Ссылка.ПометкаУдаления
		|	И торо_ОбъектыРемонта.Ссылка В (&МассивОР)
		|ИТОГИ
		|	МАКСИМУМ(ТиповойОР)
		|ПО
		|	ОбъектРемонта";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.торо_НормативныеРемонтыОборудования.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ОбъектРемонта.Установить(Выборка.ОбъектРемонта);
		НаборЗаписей.Отбор.ТиповойОР.Установить(Выборка.ТиповойОР);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		
		ВыборкаДетЗаписи = Выборка.Выбрать();
		Проверка = Новый Массив;
		Пока ВыборкаДетЗаписи.Следующий() Цикл
			Если Проверка.Найти(ВыборкаДетЗаписи.ВидРемонта) <> Неопределено Тогда
				Продолжить;				
			КонецЕсли; 
			
			НоваяЗапись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, ВыборкаДетЗаписи);
			Проверка.Добавить(ВыборкаДетЗаписи.ВидРемонта);
			
		КонецЦикла; 
		
		НаборЗаписей.Записать();
				
	КонецЦикла;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
//
// Функция ТекстЗапроса_ИерархияОР
//
// Описание: ТекстЗапроса_ИерархияОР.
//
// Возвращаемое значение: 
//	Строка - ТекстЗапроса.
//
Функция ТекстЗапроса_ИерархияОР()
	
	// Гкс+[TOIR20-59] Селимов от 31.01.2020. Изменено:{
	//Возврат "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//        |	торо_ТиповыеОР.Наименование КАК Наименование,
	//        |	торо_ТиповыеОР.Родитель.Наименование КАК РодительНаименование,
	//        |	торо_ТиповыеОР.Ссылка КАК Ссылка
	//        |ПОМЕСТИТЬ ВТ_ТиповыеОбъектыРемонта
	//        |ИЗ
	//        |	Справочник.торо_ТиповыеОР КАК торо_ТиповыеОР
	//        |ГДЕ
	//        |	торо_ТиповыеОР.ЭтоГруппа
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	торо_ОбъектыРемонта.Наименование КАК Наименование
	//        |ПОМЕСТИТЬ ВТ_ОбъектыРемонта
	//        |ИЗ
	//        |	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	//        |ГДЕ
	//        |	торо_ОбъектыРемонта.ЭтоГруппа
	//        |	И торо_ОбъектыРемонта.Ссылка В(&ГруппыВИерархии)
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	ВТ_ТиповыеОбъектыРемонта.Наименование КАК Наименование,
	//        |	ВТ_ТиповыеОбъектыРемонта.РодительНаименование КАК РодительНаименование,
	//        |	торо_ОбъектыРемонтаРодитель.Ссылка КАК ОРРодитель
	//        |ИЗ
	//        |	ВТ_ТиповыеОбъектыРемонта КАК ВТ_ТиповыеОбъектыРемонта
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбъектыРемонта КАК ВТ_ОбъектыРемонта
	//        |		ПО ВТ_ТиповыеОбъектыРемонта.Наименование = ВТ_ОбъектыРемонта.Наименование
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	//        |		ПО ВТ_ТиповыеОбъектыРемонта.Наименование = торо_ОбъектыРемонта.Наименование
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонтаРодитель
	//        |		ПО ВТ_ТиповыеОбъектыРемонта.РодительНаименование = торо_ОбъектыРемонтаРодитель.Наименование
	//        |ГДЕ
	//        |	ВТ_ОбъектыРемонта.Наименование ЕСТЬ NULL
	//        |	И торо_ОбъектыРемонта.ЭтоГруппа
	//        |	И торо_ОбъектыРемонта.Ссылка ЕСТЬ NULL
	//        |ИТОГИ ПО
	//        |	ВТ_ТиповыеОбъектыРемонта.Ссылка ТОЛЬКО ИЕРАРХИЯ";
	// }На:{
	Возврат "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	торо_ТиповыеОР.Наименование КАК Наименование,
	        |	торо_ТиповыеОР.Родитель.Наименование КАК РодительНаименование,
	        |	торо_ТиповыеОР.Ссылка КАК Ссылка
	        |ПОМЕСТИТЬ ВТ_ТиповыеОбъектыРемонта
	        |ИЗ
	        |	Справочник.торо_ТиповыеОР КАК торо_ТиповыеОР
	        |ГДЕ
	        |	торо_ТиповыеОР.ЭтоГруппа
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	торо_ОбъектыРемонта.Наименование КАК Наименование
	        |ПОМЕСТИТЬ ВТ_ОбъектыРемонта
	        |ИЗ
	        |	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	        |ГДЕ
	        |	торо_ОбъектыРемонта.ЭтоГруппа
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ТиповыеОбъектыРемонта.Наименование КАК Наименование,
	        |	ВТ_ТиповыеОбъектыРемонта.РодительНаименование КАК РодительНаименование,
	        |	торо_ОбъектыРемонтаРодитель.Ссылка КАК ОРРодитель
	        |ИЗ
	        |	ВТ_ТиповыеОбъектыРемонта КАК ВТ_ТиповыеОбъектыРемонта
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбъектыРемонта КАК ВТ_ОбъектыРемонта
	        |		ПО ВТ_ТиповыеОбъектыРемонта.Наименование = ВТ_ОбъектыРемонта.Наименование
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонтаРодитель
	        |		ПО ВТ_ТиповыеОбъектыРемонта.РодительНаименование = торо_ОбъектыРемонтаРодитель.Наименование
	        |ГДЕ
	        |	ВТ_ОбъектыРемонта.Наименование ЕСТЬ NULL
	        |ИТОГИ ПО
	        |	ВТ_ТиповыеОбъектыРемонта.Ссылка ТОЛЬКО ИЕРАРХИЯ";

	// } Гкс-[TOIR20-59]
				
КонецФункции

////////////////////////////////////////////////////////////////////////////////
//
// Функция ТекстЗапроса_ОРКСозданию
//
// Описание: ТекстЗапроса_ОРКСозданию.
//
// Возвращаемое значение: 
//	Строка - ТекстЗапроса.
//
Функция ТекстЗапроса_ОРКСозданию()
	
	Возврат "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	торо_ОбъектыРемонта.Ссылка КАК ОРРодитель,
			|	торо_ОбъектыРемонта.Наименование КАК ОРРодительНаименование
			|ПОМЕСТИТЬ ВременнаяТаблица_ГруппыОР
			|ИЗ
			|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
			|ГДЕ
			|	торо_ОбъектыРемонта.ЭтоГруппа
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	торо_ТиповыеОР.Ссылка КАК ТОР,
			|	ВременнаяТаблица_ГруппыОР.ОРРодитель КАК ОРРодитель,
			|	торо_ТиповыеОР.Наименование КАК ТОРНаименование,
			|	торо_ТиповыеОР.Изготовитель КАК ТОРИзготовитель
			|ПОМЕСТИТЬ ВременнаяТаблица_ТОР
			|ИЗ
			|	Справочник.торо_ТиповыеОР КАК торо_ТиповыеОР
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблица_ГруппыОР КАК ВременнаяТаблица_ГруппыОР
			|		ПО торо_ТиповыеОР.Родитель.Наименование = ВременнаяТаблица_ГруппыОР.ОРРодительНаименование
			|ГДЕ
			|	НЕ торо_ТиповыеОР.ПометкаУдаления
			|	И НЕ торо_ТиповыеОР.ЭтоГруппа
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВременнаяТаблица_ТОР.ТОР КАК ТОР,
			|	ВременнаяТаблица_ТОР.ОРРодитель КАК ОРРодитель,
			|	ВременнаяТаблица_ТОР.ТОРНаименование КАК ТОРНаименование,
			|	ВременнаяТаблица_ТОР.ТОРИзготовитель КАК ТОРИзготовитель,
			|	торо_ОбъектыРемонта.Ссылка КАК ОР
			|ИЗ
			|	ВременнаяТаблица_ТОР КАК ВременнаяТаблица_ТОР
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
			|		ПО ВременнаяТаблица_ТОР.ТОР = торо_ОбъектыРемонта.ТиповойОР
			|ГДЕ
			|	(торо_ОбъектыРемонта.Ссылка ЕСТЬ NULL
			|			ИЛИ торо_ОбъектыРемонта.ПлановыйГрафикРаботы = ЗНАЧЕНИЕ(Справочник.Календари.ПустаяСсылка))";

		
КонецФункции

Функция ПолучитьИерархиюОРПоДокументам(Группа)
	
	СтруктураПараметровИерархии = Новый Структура;
	СтруктураПараметровИерархии.Вставить("ИерархическийСправочник", Ложь);
	СтруктураПараметровИерархии.Вставить("ИзменяетсяДокументами", Истина);
	СтруктураПараметровИерархии.Вставить("КонечныеЭлементыВДереве", Истина);
	СтруктураПараметровИерархии.Вставить("РазрешенВводНовыхОР", Истина);
	СтруктураПараметровИерархии.Вставить("РеквизитОР", "");
	СтруктураПараметровИерархии.Вставить("СтроитсяАвтоматически", Ложь);
	СтруктураПараметровИерархии.Вставить("ТекСтруктураИерархии", 
			ПредопределенноеЗначение("Справочник.торо_СтруктурыОР.ОсновнаяИерархия"));
	СтруктураПараметровИерархии.Вставить("ТипРеквизитаОР", "");
	
	МассивГруппОР = Новый Массив;
	
	ИерархияОРРекурсия(СтруктураПараметровИерархии, Группа, МассивГруппОР);
	
	Возврат МассивГруппОР;
		
КонецФункции

Процедура ИерархияОРРекурсия(СтруктураПараметровИерархии, Группа, МассивГруппОР)
	
	МассивСтрок = 
		торо_РаботаСИерархией20.ПолучитьМассивСтрокОдногоУровняИерархииСКоличествомПодчиненных(СтруктураПараметровИерархии, 
															Группа, 
															Ложь, 
															Неопределено, 
															Истина, 
															Неопределено);
															
	Для каждого ТекСтрока Из МассивСтрок Цикл
		
		Если ТекСтрока.ЭтоГруппа Тогда
			
			ИерархияОРРекурсия(СтруктураПараметровИерархии, ТекСтрока.ОбъектРемонта, МассивГруппОР);
			МассивГруппОР.Добавить(ТекСтрока.ОбъектРемонта);
			
		КонецЕсли; 
		
	КонецЦикла; 											
		
КонецПроцедуры    

#КонецОбласти 

#КонецОбласти 
