#Область ОбработчикиСобытийФормы

&НаСервере
&После("ПриСозданииНаСервере")
Процедура гкс_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// гкс+ [Часовые пояса] Куст 09.04.2020
	Сдвиг = Час(ТекущаяДатаСеанса()) - Час(ТекущаяДата());
	ТекстыЗамены = Новый Массив();
	ТекстыЗамены.Добавить(Новый Структура("До, После", "Документторо_ЗаявкаНаРемонт.Дата",
		"ДобавитьКДате(Документторо_ЗаявкаНаРемонт.Дата, Час, " + Сдвиг + ") КАК Дата"));
	Список.ТекстЗапроса = гкс_ЧасовыеПоясаВызовСервера.ИзменитьТекстЗапросаФормыСписка(
		Список.ТекстЗапроса, ТекстыЗамены);
	// гкс- [Часовые пояса] Куст 09.04.2020
	
	// Гкс+[TOIR20-677] Оселедько В.С. от 01.08.2025. Добавлено:{
	гкс_ДобавитьИзменитьРеквизитыФормы();
	Если Параметры.Свойство("ВремяНачалаОткрытияФормы") Тогда
		ЭтотОбъект.гкс_ВремяНачалаЗамера = Параметры.ВремяНачалаОткрытияФормы;		
	КонецЕсли;
	// Гкс+[TOIR20-677]
	
	ЭтотОбъект["гкс_ОтборОР"].ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта");
	//
	Список.ТекстЗапроса = 
	СтрЗаменить(Список.ТекстЗапроса, "Документторо_ЗаявкаНаРемонт.Ссылка,", 
	"Документторо_ЗаявкаНаРемонт.Ссылка,
	// гкс+ [Релиз18] Деснол
	|Документторо_ЗаявкаНаРемонт.гкс_ИсполнительСтрокой КАК гкс_ИсполнительСтрокой,
	// гкс- [Релиз18]
	// гкс+ [05.23] Деснол 05.05.2023
	|Документторо_ЗаявкаНаРемонт.гкс_ОРСтрокой КАК гкс_ОРСтрокой,
	// гкс- [05.23] Деснол 05.05.2023
	// гкс+ [02.23] Деснол 07.02.2023
	|ВсеДок.Просрочен
	|И торо_СтатусыДокументов.СтатусДокумента = Значение(Перечисление.торо_СтатусыДокументов.Зарегистрирован)
	|И торо_ТекущиеСтатусыСогласованияДокументов.СтатусДокумента = &СтатусВнесеноВПланРабот
	|  КАК гкс_Просрочен,
	|Документторо_ЗаявкаНаРемонт.гкс_ОбщееОписаниеРемонта КАК гкс_ОбщееОписаниеРемонта,");
	// гкс+ [разработка 2021] Куст 09.07.2021
	Список.ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ЕСТЬNULL(Регистр_АктуальныеПлановыеДатыРемонтов.ДатаОкончания, торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаОкончания) < &ТекДата) КАК Просрочен
	|ПОМЕСТИТЬ ВсеДок
	|ИЗ
	|	Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК торо_ЗаявкаНаРемонтРемонтыОборудования
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК Регистр_АктуальныеПлановыеДатыРемонтов
	|		ПО (Регистр_АктуальныеПлановыеДатыРемонтов.IDРемонта = торо_ЗаявкаНаРемонтРемонтыОборудования.ID)
	|ГДЕ
	|	(&ИспОтборОР = ЛОЖЬ
	|			ИЛИ торо_ЗаявкаНаРемонтРемонтыОборудования.ОбъектРемонта В (&ОР))
	|	И (&ИспОтборАкДата = ЛОЖЬ
	|			ИЛИ &АкДатаНачала <= ЕСТЬNULL(Регистр_АктуальныеПлановыеДатыРемонтов.ДатаНачала, торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаНачала)
	|				И &АкДатаОкончания >= ЕСТЬNULL(Регистр_АктуальныеПлановыеДатыРемонтов.ДатаОкончания, торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаОкончания))
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка
	|
	// Гкс+[TOIR20-678] Оселедько В.С. от 04.08.2025. Добавлено:{
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка"
	// Гкс-[TOIR20-678] Оселедько В.С. от 04.08.2025."
	// гкс- [02.23] Деснол 07.02.2023
		+ " ; " + Строка(Список.ТекстЗапроса);
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "Документ.торо_ЗаявкаНаРемонт КАК Документторо_ЗаявкаНаРемонт",
	"Документ.торо_ЗаявкаНаРемонт КАК Документторо_ЗаявкаНаРемонт
	|	Внутреннее соединение ВсеДок КАК ВсеДок
	|	ПО ВсеДок.Ссылка = Документторо_ЗаявкаНаРемонт.Ссылка ");
	Список.Параметры.УстановитьЗначениеПараметра("ИспОтборОР", ЭтотОбъект["гкс_ОтборОРИсп"]);
	Список.Параметры.УстановитьЗначениеПараметра("ОР", ЭтотОбъект["гкс_ОтборОР"]);
	Список.Параметры.УстановитьЗначениеПараметра("ИспОтборАкДата", ЭтотОбъект["гкс_ОтборАкДатаИсп"]);
	Список.Параметры.УстановитьЗначениеПараметра("АкДатаНачала", ЭтотОбъект["гкс_ОтборАкДатаНачала"] - (Сдвиг * 3600));
	Список.Параметры.УстановитьЗначениеПараметра("ТекДата", ТекущаяДата());
	Если ЭтотОбъект["гкс_ОтборАкДатаОкончания"] = Дата(1,1,1) Тогда 
		Список.Параметры.УстановитьЗначениеПараметра("АкДатаОкончания", Дата(3999,1,1));
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("АкДатаОкончания", ЭтотОбъект["гкс_ОтборАкДатаОкончания"] - (Сдвиг * 3600));
	КонецЕсли;
	Список.Параметры.УстановитьЗначениеПараметра("СтатусВнесеноВПланРабот", 
		ПланыВидовХарактеристик.гкс_ПроизвольныеПредопределенныеОбъекты.ПроизвольныйПредопределенныйОбъект(
		"СтатусСогласованияВнесеноВПланРабот")); 
	//
	НоваяГруппа = Элементы.Вставить("гкс_ГруппаОтборы1", Тип("ГруппаФормы"), ЭтаФорма, Элементы.Список);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	НоваяГруппа.ОтображатьЗаголовок = Ложь;
	//
	НоваяГруппа = Элементы.Вставить("гкс_ГруппаОртборОР", Тип("ГруппаФормы"), ЭтаФорма, Элементы["гкс_ГруппаОтборы1"]);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.ОтображатьЗаголовок = Ложь;
	//
	НовыйЭлемент = Элементы.Добавить("гкс_ОтборОРИсп", Тип("ПолеФормы"), Элементы["гкс_ГруппаОртборОР"]);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "гкс_ОтборОРИсп";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	НовыйЭлемент.Заголовок = "Объект ремонта";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "гкс_ОтборОРПриИзменеии");
	//
	НовыйЭлемент = Элементы.Добавить("гкс_ОтборОР", Тип("ПолеФормы"), Элементы["гкс_ГруппаОртборОР"]);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "гкс_ОтборОР";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "гкс_ОтборОРПриИзменеии");
	//
	НовыйЭлемент = Элементы.Добавить("гкс_ОбщееОписаниеРемонта", Тип("ПолеФормы"), Элементы.Список);
	НовыйЭлемент.ПутьКДанным = "Список.гкс_ОбщееОписаниеРемонта";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	// гкс+ [Релиз18] Деснол
	НовыйЭлемент = Элементы.Добавить("гкс_ИсполнительСтрокой", Тип("ПолеФормы"), Элементы.Список);
	НовыйЭлемент.ПутьКДанным = "Список.гкс_ИсполнительСтрокой";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	// гкс- [Релиз18]
	// гкс+ [05.23] Деснол 05.05.2023
	НовыйЭлемент = Элементы.Добавить("гкс_ОРСтрокой", Тип("ПолеФормы"), Элементы.Список);
	НовыйЭлемент.ПутьКДанным = "Список.гкс_ОРСтрокой";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	// гкс- [05.23] Деснол 05.05.2023
	// гкс+ [Релиз17] Деснол
	НовыйЭлемент = Элементы.Добавить("список_СтатусСогласования", Тип("ПолеФормы"), Элементы.Список);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Список.СтатусСогласования";
	//
	НоваяГруппа = Элементы.Вставить("гкс_ГруппаОртборАкДата", Тип("ГруппаФормы"), ЭтаФорма, Элементы["гкс_ГруппаОтборы1"]);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.ОтображатьЗаголовок = Ложь;
	//
	НовыйЭлемент = Элементы.Добавить("гкс_ОтборАкДатаИсп", Тип("ПолеФормы"), Элементы["гкс_ГруппаОртборАкДата"]);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "гкс_ОтборАкДатаИсп";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	НовыйЭлемент.Заголовок = "Актуальная дата ремонта";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "гкс_ОтборАкДатаПриИзменеии");
	//
	НовыйЭлемент = Элементы.Добавить("гкс_ОтборАкДатаНачала", Тип("ПолеФормы"), Элементы["гкс_ГруппаОртборАкДата"]);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "гкс_ОтборАкДатаНачала";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "гкс_ОтборАкДатаПриИзменеии");
	//
	НовыйЭлемент = Элементы.Добавить("гкс_ОтборАкДатаОкончания", Тип("ПолеФормы"), Элементы["гкс_ГруппаОртборАкДата"]);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "гкс_ОтборАкДатаОкончания";
	НовыйЭлемент.Заголовок = "-";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "гкс_ОтборАкДатаПриИзменеии");
	// гкс- [Релиз17]
	
	// гкс+ [11.22] Деснол 03.11.2022
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("список_СтатусСогласования");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.СтатусСогласования");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "Черновик");
	Элемент.Использование = Истина;
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("СтатусДокумента");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.СтатусДокумента");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "Черновик");
	Элемент.Использование = Истина;
	// гкс- [11.22] Деснол 03.11.2022
	// гкс+ [02.23] Деснол 07.02.2023
	НовыйЭлемент = Элементы.Добавить("гкс_Просрочен", Тип("ПолеФормы"), Элементы.Список);
	НовыйЭлемент.ПутьКДанным = "Список.гкс_Просрочен";
	НовыйЭлемент.Заголовок = "Просрочен";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("Список");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.гкс_Просрочен");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ЛососьСветлый);
	Элемент.Использование = Истина;
	// гкс- [02.23] Деснол 07.02.2023
КонецПроцедуры

&НаКлиенте
Процедура гкс_ПриОткрытииПосле(Отказ)
	
	гкс_ЗавершитьЗамерОткрытияФормы(ЭтотОбъект.гкс_ВремяНачалаЗамера);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура гкс_ОтборОРПриИзменеии(Элемент)
	Список.Параметры.УстановитьЗначениеПараметра("ИспОтборОР", ЭтотОбъект["гкс_ОтборОРИсп"]);
	Список.Параметры.УстановитьЗначениеПараметра("ОР", ЭтотОбъект["гкс_ОтборОР"]);
КонецПроцедуры

&НаКлиенте
Процедура гкс_ОтборАкДатаПриИзменеии(Элемент)
	Сдвиг = гкс_ПолучитьСдвигЧП();
	Список.Параметры.УстановитьЗначениеПараметра("ИспОтборАкДата", ЭтотОбъект["гкс_ОтборАкДатаИсп"]);
	Список.Параметры.УстановитьЗначениеПараметра("АкДатаНачала", ЭтотОбъект["гкс_ОтборАкДатаНачала"] - (Сдвиг * 3600));
	Если ЭтотОбъект["гкс_ОтборАкДатаОкончания"] = Дата(1,1,1) Тогда 
		Список.Параметры.УстановитьЗначениеПараметра("АкДатаОкончания", Дата(3999,1,1));
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("АкДатаОкончания", ЭтотОбъект["гкс_ОтборАкДатаОкончания"] - (Сдвиг * 3600));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
функция гкс_ПолучитьСдвигЧП()
	Возврат Час(ТекущаяДатаСеанса()) - Час(ТекущаяДата());
КонецФункции

// Гкс+[TOIR20-677] Оселедько В.С. от 01.08.2025. Добавлено:{
&НаСервере
Процедура гкс_ДобавитьИзменитьРеквизитыФормы()

	// гкс+ [8589] Куст 29.10.2020
	МассивРеквизитов = Новый Массив();
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ОтборОРИсп", Новый ОписаниеТипов("Булево")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ОтборОР", Новый ОписаниеТипов("СписокЗначений")));
	// гкс+ [Релиз17] Деснол
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ОтборАкДатаИсп", Новый ОписаниеТипов("Булево")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ОтборАкДатаНачала", Новый ОписаниеТипов("Дата")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ОтборАкДатаОкончания", Новый ОписаниеТипов("Дата")));
	// гкс- [Релиз17] 
	// Гкс+[TOIR20-677] Оселедько В.С. от 01.08.2025. Добавлено:{
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ВремяНачалаЗамера", 
		Новый ОписаниеТипов("Число",,,,Новый КвалификаторыЧисла(15))));
	// Гкс+[TOIR20-677] Оселедько В.С. от 01.08.2025	
	ИзменитьРеквизиты(МассивРеквизитов);	
	
КонецПроцедуры // Гкс+[TOIR20-677] 	

// Гкс+[TOIR20-677] Оселедько В.С. от 01.08.2025. Добавлено:{
&НаСервереБезКонтекста
Процедура гкс_ЗавершитьЗамерОткрытияФормы(ВремяНачалаЗамера)
	
    ОценкаПроизводительности.ЗакончитьЗамерВремени("Документ.торо_ЗаявкаНаРемонт.ОткрытиеФормыСписка", ВремяНачалаЗамера); 
	
КонецПроцедуры // Гкс+[TOIR20-677] 

#КонецОбласти