
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура Расш_гкс_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ТипОбъекта_ПриИзмененииНаСервере();
	ДобавитьНовыеЭлементыПосле();
	Если Объект.ТипОбъекта = Перечисления.торо_ТипыОбъектовRCM.ФункциональноеМесто Тогда
		ЗаполнитьДеревоОграничений();
		ТиповойСостав_Загрузить();
	КонецЕсли;
	// гкс+ [КатегорияРиска] Куст 19.10.2020
	ДобавитьЭлементыМатрицы();
	// гкс- [КатегорияРиска] Куст 19.10.2020
КонецПроцедуры

&НаСервере
Процедура Расш_гкс_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("СоздатьФМ") И Параметры.СоздатьФМ Тогда 
		Объект.ТипОбъекта = Перечисления.торо_ТипыОбъектовRCM.ФункциональноеМесто;
	ИначеЕсли ЗначениеЗаполнено(Объект.ТипОбъекта) = Ложь Тогда
		Объект.ТипОбъекта = Перечисления.торо_ТипыОбъектовRCM.Объект;
	КонецЕсли;
	ДобавитьНовыеЭлементы();
	дс_ПриСозданииНаСервере();
КонецПроцедуры

&НаСервере
Процедура Расш_гкс_ПередЗаписьюНаСервереПеред(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Объект.ТипОбъекта = Перечисления.торо_ТипыОбъектовRCM.ФункциональноеМесто Тогда 
		Если ЗначениеЗаполнено(Объект.ДатаВыпуска) = Ложь И ЗначениеЗаполнено(Объект.ДатаВводаВЭксплуатацию) Тогда 
			Объект.ДатаВыпуска = Объект.ДатаВводаВЭксплуатацию-1;
		КонецЕсли;
	КонецЕсли;
	Если ЭтотОбъект["ИзмененТипОбъекта"] И ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		гкс_ПроверкаФункциональныхМест.ОбновитьТекущийФМОР(Объект.Ссылка,
			Объект.ТипОбъекта = Перечисления.торо_ТипыОбъектовRCM.ФункциональноеМесто);
		ЭтотОбъект["ИзмененТипОбъекта"] = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура Расш_гкс_ПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтотОбъект["МодифицированностьОграничений"] Тогда 
		ЗаписатьДеревоОграничений();
		ЭтотОбъект["МодифицированностьОграничений"] = Ложь;
	КонецЕсли;
	Если ЭтотОбъект["МодифицированностьСостава"] Тогда 
		ТиповойСостав_Записать();
		ЭтотОбъект["МодифицированностьСостава"] = Истина;
	КонецЕсли;
	
	дс_ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
КонецПроцедуры

&НаСервере
Процедура Расш_гкс_ПриЧтенииНаСервереПосле(ТекущийОбъект)
	ВременнаяСтруктура = Новый Структура("гкс_ТМ,гкс_Кодировка", Неопределено, Неопределено);
	ЗаполнитьЗначенияСвойств(ВременнаяСтруктура, ЭтотОбъект);
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Если Не ВременнаяСтруктура.гкс_ТМ = Неопределено Тогда 
			НайтиТМ(Объект.Ссылка, ЭтотОбъект["гкс_ТМ"], ЭтотОбъект["гкс_ТМФМ"], Объект.ТипОбъекта);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура Расш_гкс_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	дс_ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	гкс_КодировкаОР.Текст КАК Текст
		|ИЗ
		|	РегистрСведений.гкс_КодировкаОР КАК гкс_КодировкаОР
		|ГДЕ
		|	гкс_КодировкаОР.ОР = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() = Ложь Тогда 
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЭтотОбъект["гкс_Кодировка"] = Выборка.Текст;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Расш_гкс_ПередЗаписьюПеред5656(Отказ, ПараметрыЗаписи)
	Если ЭтотОбъект["ФОИспользоватьФункциональныеМеста"] Тогда 
		Если ЗначениеЗаполнено(Объект.ТипОбъекта) = Ложь Тогда 
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru = 'Не указан тип объекта!'; en = 'Do not specify the type of object!';"
				+" es = 'No se especifica el tipo de objeto!'");
			Сообщение.Поле = "Объект.ТипОбъекта";
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЕсли;
	Если Объект.ТипОбъекта = торо_ОбщегоНазначенияКлиентПовтИсп.ПолучитьПеречисление("торо_ТипыОбъектовRCM",
			"ФункциональноеМесто") Тогда 
		Если ЗначениеЗаполнено(Объект.ДатаВыпуска) = Ложь Тогда 
			Если ЗначениеЗаполнено(Объект.ДатаВводаВЭксплуатацию) Тогда 
				Объект.ДатаВыпуска = Объект.ДатаВводаВЭксплуатацию - 1;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(Объект.ДатаВыпуска) = Ложь Тогда 
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru = 'Дата выпуска не заполнена'; en = 'Date of issue is not populated';"
				+" es = 'Fecha de lanzamiento no está llena'");
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// гкс+ [05.23] Деснол 10.05.2023
&НаКлиенте
&Вместо("ПередЗаписью")
Процедура гкс_ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Не ЗначениеЗаполнено(Объект.гкс_КатегорияРиска) Тогда 
		ТекстСообщения = "Категория риска не заполнена!";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ПродолжитьВызов(Отказ, ПараметрыЗаписи);
КонецПроцедуры // гкс- [05.23] Деснол 10.05.2023

&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура Расш_гкс_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ПравоРедактирования = ПравоДоступа("Редактирование", Объект.Ссылка.Метаданные());

	// СтандартныеПодсистемы.Свойства
	Контекст = Новый Структура();
	Контекст.Вставить("Объект",                     Объект);
	Контекст.Вставить("ИмяЭлементаДляРазмещения",   "ГруппаДополнительныеРеквизиты");
	Контекст.Вставить("ПроизвольныйОбъект",         Ложь);
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, Контекст);
	// Конец СтандартныеПодсистемы.Свойства

	торо_УправлениеСвойствами.ПроставитьПризнакОбщегоСвойстваВТаблицеДопРеквизитов(ЭтаФорма, Неопределено);
	ПривязатьОбработчикИзмененияДопРеквизитов();
	УнаследоватьДопРеквизитыИзТиповогоОР();

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтотОбъект, Объект, "КонтактнаяИнформация", ПоложениеЗаголовкаЭлементаФормы.Лево);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация

	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

	торо_СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка, Новый Структура("УстановитьСвойствоЭлементовФормыОтПрав", Истина));

	Если Параметры.Свойство("СтруктураИерархии") И ЗначениеЗаполнено(Параметры.СтруктураИерархии) Тогда
		ТекСтруктураИерархии = Параметры.СтруктураИерархии;
	Иначе
		ТекСтруктураИерархии = Константы.торо_ИерархияДляВводаНовыхОР.Получить();
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОписаниеОшибки = "";
		Если слкМенеджерЗащиты.ПроверитьЛицензииСеанса(ОписаниеОшибки) <> Истина Тогда
			ТекстСообщения = НСтр("es='¡La licencia no es descubierta! La creación del objeto de la reparación es imposible.';ru='Лицензия не обнаружена! Создание объекта ремонта невозможно.';en='No license found! Creating a repair facility is not possible.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			Возврат;
		КонецЕсли;

		РодительИерархии = ?(Параметры.Свойство("РодительИерархии"), Параметры.РодительИерархии, Справочники.торо_ОбъектыРемонта.ПустаяСсылка());
		ЭтоНовыйЭлемент = Истина;

		Модифицированность = Истина;
		ЗаполнитьПослеКопирования();
	КонецЕсли;

	Родитель = НайтиРодителяИерархии(ТекСтруктураИерархии, Объект.Ссылка);
	Если НЕ ЗначениеЗаполнено(Родитель) и ЗначениеЗаполнено(РодительИерархии) Тогда
		Родитель = РодительИерархии;
	КонецЕсли;

	ОтображатьИзображение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР","ОбъектыРемонта_ОтображатьИзображение", Ложь);

	ТекТиповойОР  = Объект.ТиповойОР;
	ПредТиповойОР = Объект.ТиповойОР;

	ОбновитьЗначенияНаработки = Истина;

	МодифицированностьПараметровНаработки   = Ложь;
	МодифицированностьНормРемонтов          = Ложь;
	МодифицированностьИзмеряемыхПоказателей = Ложь;
	МодифицированностьМаксЗначНаработки = Ложь;

	КоличествоПусков.Загрузить(РегистрыНакопления.торо_КоличествоПусковОР.Обороты('00010101',ТекущаяДата(),Новый Структура("ОбъектРемонта", Объект.Ссылка)));

	// ЖЦ Оборудования++
	ФОИспользоватьДокументыЖЦОборудования = ПолучитьФункциональнуюОпцию("торо_ИспользоватьДокументыПринятияИСписанияОборудования");
	Если ФОИспользоватьДокументыЖЦОборудования Тогда
		ЗаполнитьДатыЭксплуатации();
		УстановитьФлагПланированияИДоступность(Не ЗначениеЗаполнено(Объект.Ссылка));
	КонецЕсли; 
	// ЖЦ Оборудования--

	// Гарантии++
	ФОИспользоватьГарантии = ПолучитьФункциональнуюОпцию("торо_ИспользоватьГарантии");
	Если ФОИспользоватьГарантии Тогда
		#Удаление
		ТаблицаГарантий = торо_ГарантийноеОбслуживание.ПолучитьТаблицуГарантий(Объект.Ссылка);
		#КонецУдаления
		#Вставка
		Если Объект.ТипОбъекта = Перечисления.торо_ТипыОбъектовRCM.ФункциональноеМесто Тогда 
			ТаблицаГарантий = торо_ГарантийноеОбслуживание.ПолучитьТаблицуГарантийФМ(Объект.Ссылка);
		Иначе
			ТаблицаГарантий = торо_ГарантийноеОбслуживание.ПолучитьТаблицуГарантий(Объект.Ссылка);
		КонецЕсли;
		#КонецВставки

		Если Не ТаблицаГарантий = Неопределено  Тогда
			ГарантииОбъектаРемонта.Загрузить(ТаблицаГарантий);
		КонецЕсли; 

		Если ГарантииОбъектаРемонта.Количество() > 0 Тогда
			ЕстьГарантияДляОбъекта = Истина;
		Иначе
			ЕстьГарантияДляОбъекта = Ложь;
		КонецЕсли;

	КонецЕсли;
	// Гарантии--

	// Ремонты_по_состоянию++
	ФОИспользоватьРемонтыПоСостоянию = ПолучитьФункциональнуюОпцию("торо_ИспользоватьРемонтыПоСостоянию");
	// Ремонты_по_состоянию--

	УстановитьВидимостьДоступность(Истина);
	УстановитьПараметрыЗапросовНаСервере();

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПослеЗаписи")
Процедура Расш_гкс_ПослеЗаписи(ПараметрыЗаписи)

	// Для обновления данных в дереве ОР.
	СтруктураРеквизитов = Новый Структура("Ссылка, ПометкаУдаления, Наименование", Объект.Ссылка, Объект.ПометкаУдаления, Объект.Наименование);

	Если ЭтоНовыйЭлемент Тогда
		СтруктураРеквизитов.Вставить("ЭтоНовый", ЭтоНовыйЭлемент);						
		СтруктураРеквизитов.Вставить("СтруктураИерархии", ТекСтруктураИерархии);
		СтруктураРеквизитов.Вставить("РодительИерархии", РодительИерархии);
	КонецЕсли;
	#Вставка
	СтруктураРеквизитов.Вставить("ТипОбъекта", Объект.ТипОбъекта);
	#КонецВставки

	Оповестить("ЗаписанОбъектРемонта", СтруктураРеквизитов, ЭтаФорма);

	ЗаписатьНормативыОРПриИзмененииТиповогоОРНаСервере(Объект.ТиповойОР, Объект.Ссылка);
	УстановитьКоличествоОсновногоЗависимогоОборудования();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы
&НаСервере
Процедура ДобавитьНовыеЭлементы()
	МассивРеквизитов = Новый Массив();
	
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ФОИспользоватьФункциональныеМеста", Новый ОписаниеТипов("Булево")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ИсторияПеремещенияФМ", Новый ОписаниеТипов("ТаблицаЗначений")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ОбъектРемонта", 
		Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта"),"ИсторияПеремещенияФМ",
		НСтр("ru = 'Объект ремонта'; en = 'Object of repair'; es = 'El objeto de la reparación'")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("Событие",
		Новый ОписаниеТипов("ПеречислениеСсылка.торо_СобытияОборудованияНаФМ"), "ИсторияПеремещенияФМ",
		НСтр("ru = 'Событие'; en = 'Event'; es = 'El evento'")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("Период",Новый ОписаниеТипов("Дата",,,,,
		Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)), "ИсторияПеремещенияФМ",
		НСтр("ru = 'Период'; en = 'Period'; es = 'El período de'")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ТаблицаОграничений", Новый ОписаниеТипов("ДеревоЗначений")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("Иерархия", Новый ОписаниеТипов("СправочникСсылка.торо_СтруктурыОР"),
		"ТаблицаОграничений", НСтр("ru = 'Иерархия'; en = 'Hierarchy'; es = 'La jerarquía de'")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("Ограничение", 
		Новый ОписаниеТипов("СправочникСсылка.торо_ОграниченияНаХарактеристикиОбрудования"),
		"ТаблицаОграничений", НСтр("en='Rrestriction';es='La limitación de la';ru='Ограничение'")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("Собственное", Новый ОписаниеТипов("Булево"),
		"ТаблицаОграничений", НСтр("ru = 'Собственное'; en = 'Private'; es = 'Propia'")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_Удален", Новый ОписаниеТипов("Булево"), 
		"ТаблицаОграничений", "гкс_Удален"));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("МодифицированностьОграничений", Новый ОписаниеТипов("Булево")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("МодифицированностьСостава", Новый ОписаниеТипов("Булево")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ТиповойСостав", Новый ОписаниеТипов("ТаблицаЗначений")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ОР", 
		Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта"), "ТиповойСостав", 
		НСтр("ru = 'Установленный ОР'; en = 'Set the EI'; es = 'Fijado el RP'")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ТОР", Новый ОписаниеТипов("СправочникСсылка.торо_ТиповыеОР"), 
		"ТиповойСостав", НСтр("ru = 'Тип оборудования'; en = 'Type of equipment'; es = 'El tipo de hardware'")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("НомерПП", 
		Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(4,0)), "ТиповойСостав","№"));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ОРИнвентарный", Новый ОписаниеТипов("Строка",,,, 
		Новый КвалификаторыСтроки(25)), "ТиповойСостав", НСтр("en='Inventory №';es='De inventario №';ru='Инвентарный №'")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ОРДатаВвода", Новый ОписаниеТипов("Дата",,,,, 
		Новый КвалификаторыДаты(ЧастиДаты.Дата)), "ТиповойСостав", 
		НСтр("ru = 'Дата ввода в эксплуатацию'; en = 'Commissioning date'; es = 'Fecha de puesta en marcha'")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ОРЗаводской", Новый ОписаниеТипов("Строка",,,, 
		Новый КвалификаторыСтроки(250)), "ТиповойСостав", НСтр("ru = 'Заводской №'; en = 'Factory №'; es = 'La fábrica nº'")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ОРДатаУстановки", Новый ОписаниеТипов("Дата",,,,,
		Новый КвалификаторыДаты(ЧастиДаты.Дата)), "ТиповойСостав",
		НСтр("en='Installation date for FP';es='La fecha de instalación de la fm';ru='Дата установки на ФМ'")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("НераспределенныйСостав", Новый ОписаниеТипов("ТаблицаЗначений")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ОР", Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта"),
		"НераспределенныйСостав", НСтр("ru = 'Установленный ОР'; en = 'Set the EI'; es = 'Fijado el RP'")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ТОР", Новый ОписаниеТипов("СправочникСсылка.торо_ТиповыеОР"),
		"НераспределенныйСостав", НСтр("ru = 'Тип оборудования'; en = 'Type of equipment'; es = 'El tipo de hardware'")));
	ИмяТега = НСтр("ru='Тег';en='Tag'");
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_Тег", 
		Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(100)), "СписокИзмеряемыхПоказателей", ИмяТега));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_Тег",
		Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(100)), "СписокПараметровНаработки", ИмяТега));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ТМ",
		Новый ОписаниеТипов("СправочникСсылка.гкс_ТехническиеМеста")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ТМФМ", 
		Новый ОписаниеТипов("СправочникСсылка.гкс_ТехническиеМеста")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ИзмененТипОбъекта", Новый ОписаниеТипов("Булево")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_Остановочная", 
		Новый ОписаниеТипов("Булево"),"ЗависимоеОборудование"));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_Технологическая", 
		Новый ОписаниеТипов("Булево"),"ЗависимоеОборудование"));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_Остановочная", 
		Новый ОписаниеТипов("Булево"),"ОсновноеОборудование"));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_Технологическая", 
		Новый ОписаниеТипов("Булево"),"ОсновноеОборудование"));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_Остановочная", 
		Новый ОписаниеТипов("Булево"),"СписокОбъектовРемонта"));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_Технологическая", 
		Новый ОписаниеТипов("Булево"),"СписокОбъектовРемонта"));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_Кодировка", 
		Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(17))));
	
	ИзменитьРеквизиты(МассивРеквизитов);
	//
	ЭтотОбъект["ФОИспользоватьФункциональныеМеста"] = Константы.торо_ИспользоватьФункциональныеМеста.Получить();
	//
	НЭлем = Элементы.Добавить("ПолеВвода_ТипОбъекта",Тип("ПолеФормы"),Элементы["ГруппаУсловиеРемонта"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.РежимВыбораИзСписка = Истина;
	НЭлем.ПутьКДанным = "Объект.ТипОбъекта";
	НЭлем.СписокВыбора.Добавить(Перечисления.торо_ТипыОбъектовRCM.ФункциональноеМесто);
	НЭлем.СписокВыбора.Добавить(Перечисления.торо_ТипыОбъектовRCM.Объект);
	НЭлем.Видимость = ЭтотОбъект["ФОИспользоватьФункциональныеМеста"];
	НЭлем.УстановитьДействие("ПриИзменении","ТипОбъекта_ПриИзменении");
	//
	нСтран = Элементы.Добавить("Страница_ОграниченияИСостав", Тип("ГруппаФормы"), Элементы["ПанельОР"]);
	нСтран.Вид = ВидГруппыФормы.Страница;
	нСтран.Заголовок = НСтр("en='Constraint and composition';"
		+ "es='Limitaciones y la composición de';ru='Ограничения и состав'");
	
	нСтран = Элементы.Добавить("Страницы_ОграниченияИСостав", Тип("ГруппаФормы"),
		Элементы["Страница_ОграниченияИСостав"]);
	нСтран.Вид = ВидГруппыФормы.Страницы;
	
	нСтран = Элементы.Добавить("Страница_Ограничения", Тип("ГруппаФормы"), Элементы["Страницы_ОграниченияИСостав"]);
	нСтран.Вид = ВидГруппыФормы.Страница;
	нСтран.Заголовок = НСтр("en='Constraints';es='Restricciones';ru='Ограничения'");
	
	нСтран = Элементы.Добавить("Страница_Состав", Тип("ГруппаФормы"), Элементы["Страницы_ОграниченияИСостав"]);
	нСтран.Вид = ВидГруппыФормы.Страница;
	нСтран.Заголовок = НСтр("ru = 'Состав'; en = 'Composition'; es = 'La composición de la'");
	//
	Элементы.ГарантииОбъектаРемонта.УстановитьДействие("Выбор", "ГарантииОбъектаРемонтаВыбор");
	//              
	МассивРеквизитов = Новый Массив();
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ОбъектРемонта", 
		Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта"), "ИсторияПеремещенияОборудования"));
	ИзменитьРеквизиты(МассивРеквизитов);
	//
	НЭлем = Элементы.Добавить("История_ОбъектРемонта", Тип("ПолеФормы"), Элементы.ИсторияПеремещенияОборудования1);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "ИсторияПеремещенияОборудования.ОбъектРемонта";
	НЭлем.АвтоВысотаЯчейки = Истина;
	//
	НЭлем = Элементы.Добавить("ОтборыИсторииПеремещений", Тип("ГруппаФормы"), Элементы.ИсторияПеремещенияОборудования);
	НЭлем.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НЭлем.ОтображатьЗаголовок = Ложь;
	Элементы.Переместить(Элементы["ОтборыИсторииПеремещений"],
		Элементы.ИсторияПеремещенияОборудования, Элементы.ВыборВидаИерархииИстория);
	Элементы.Переместить(Элементы.ВыборВидаИерархииИстория, Элементы["ОтборыИсторииПеремещений"]);
	//
	НКом = Команды.Добавить("ОбновитьИсториюПеремещений");
	НКом.Действие = "ПолучитьИсториюПеремещенияНаКлиенте";
	НКом.Заголовок = НСтр("ru = 'Обновить'; en = 'Update'; es = 'Actualizar'");
	//
	НЭлем = Элементы.Добавить("Кнопка_ОбновитьИсториюПеремещений", 
		Тип("КнопкаФормы"), Элементы["ОтборыИсторииПеремещений"]);
	НЭлем.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НЭлем.ИмяКоманды = "ОбновитьИсториюПеремещений";
	//	
	нТабл = Элементы.Добавить("ИсторияПеремещенияФМ", Тип("ТаблицаФормы"), Элементы.ИсторияПеремещенияОборудования);
	нТабл.ПутьКДанным = "ИсторияПеремещенияФМ";
	нТабл.КоманднаяПанель.Видимость = Ложь;
	нТабл.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	нТабл.ТолькоПросмотр = Истина;
	
	НЭлем = Элементы.Добавить("ИсторияПеремещенияФМ_Период", Тип("ПолеФормы"), Элементы["ИсторияПеремещенияФМ"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "ИсторияПеремещенияФМ.Период";
	НЭлем.АвтоВысотаЯчейки = Истина;
	НЭлем.ТолькоПросмотр = Истина;
	
	НЭлем = Элементы.Добавить("ИсторияПеремещенияФМ_ОбъектРемонта", Тип("ПолеФормы"), Элементы["ИсторияПеремещенияФМ"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "ИсторияПеремещенияФМ.ОбъектРемонта";
	НЭлем.АвтоВысотаЯчейки = Истина;
	НЭлем.ТолькоПросмотр = Истина;
	
	НЭлем = Элементы.Добавить("ИсторияПеремещенияФМ_ОбъектРемонтаТехНомер", 
		Тип("ПолеФормы"), Элементы["ИсторияПеремещенияФМ"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "ИсторияПеремещенияФМ.ОбъектРемонта.ТехНомер";
	НЭлем.АвтоВысотаЯчейки = Истина;
	НЭлем.ТолькоПросмотр = Истина;
	
	НЭлем = Элементы.Добавить("ИсторияПеремещенияФМ_Событие", Тип("ПолеФормы"), Элементы["ИсторияПеремещенияФМ"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "ИсторияПеремещенияФМ.Событие";
	НЭлем.АвтоВысотаЯчейки = Истина;
	НЭлем.ТолькоПросмотр = Истина;
	//
	Элементы.ГарантииОбъектаРемонта.УстановитьДействие("ПередНачаломДобавления",
		"ГарантииОбъектаРемонта_ПередНачаломДобавления");
	// Ограничения
	НЭлем = Элементы.Добавить("ГруппаКомандыОграничений", Тип("ГруппаФормы"), Элементы["Страница_Ограничения"]);
	НЭлем.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НЭлем.ОтображатьЗаголовок = Ложь;
	//
	нТабл = Элементы.Добавить("ТаблицаОграничений", Тип("ТаблицаФормы"), Элементы["Страница_Ограничения"]);
	нТабл.ПутьКДанным = "ТаблицаОграничений";
	нТабл.Отображение = ОтображениеТаблицы.Дерево;
	нТабл.КоманднаяПанель.Видимость = Ложь;
	нТабл.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	нТабл.УстановитьДействие("ПередУдалением", "ТаблицаОграничений_ПередУдалением");
	нТабл.УстановитьДействие("ПередНачаломДобавления", "ТаблицаОграничений_ПередНачаломДобавления");
	нТабл.УстановитьДействие("Выбор", "Ограничения_Выбор");
	
	НЭлем = Элементы.Добавить("Ограничения_Иерархия", Тип("ПолеФормы"), Элементы["ТаблицаОграничений"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "ТаблицаОграничений.Иерархия";
	НЭлем.АвтоВысотаЯчейки = Истина;
	НЭлем.ТолькоПросмотр = Истина;
	
	НЭлем = Элементы.Добавить("Ограничения_Ограничение", Тип("ПолеФормы"), Элементы["ТаблицаОграничений"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "ТаблицаОграничений.Ограничение";
	НЭлем.АвтоВысотаЯчейки = Истина;
	НЭлем.УстановитьДействие("ПриИзменении", "Ограничения_Ограничение_ПриИзменении");
	НЭлем.ТолькоПросмотр = Истина;
	// Гкс+[TOIR20-222] Селимов от 02.02.2021. Добавлено:{
	НЭлем = Элементы.Добавить("гкс_ОсновноеСредство", Тип("ПолеФормы"), Элементы["ГруппаСрокПолезногоИспользованияИнвНомер"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Объект.гкс_ОсновноеСредство"; 
	НЭлем.АвтоМаксимальнаяШирина = Ложь;
	НЭлем.РастягиватьПоГоризонтали = Истина; 
	НЭлем.УстановитьДействие("ПриИзменении", "Подключаемый_гкс_ОсновноеСредство_ПриИзменении");
	Элементы.Переместить(Элементы["гкс_ОсновноеСредство"], 
						Элементы.ГруппаДанныеЭксплЛевая, 
						Элементы.ТехНомер); // } Гкс-[TOIR20-222]
	//
	НКом = Команды.Добавить("Ограничения_ДобавитьИерархию");
	НКом.Действие = "Ограничения_ДобавитьИерархию";
	НКом.Заголовок = НСтр("ru = 'Добавить иерархию'; en = 'To add a hierarchy'; es = 'Añadir la jerarquía'");
	//
	НЭлем = Элементы.Добавить("Кнопка_Ограничения_ДобавитьИерархию",
		Тип("КнопкаФормы"), Элементы["ГруппаКомандыОграничений"]);
	НЭлем.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НЭлем.ИмяКоманды = "Ограничения_ДобавитьИерархию";
	//
	НКом = Команды.Добавить("Ограничения_ДобавитьОграничение");
	НКом.Действие = "Ограничения_ДобавитьОграничение";
	НКом.Заголовок = НСтр("ru = 'Добавить ограничение'; en = 'Add constraint'; es = 'Agregar la restricción'");
	//
	НЭлем = Элементы.Добавить("Кнопка_Ограничения_ДобавитьОграничение",
		Тип("КнопкаФормы"), Элементы["ГруппаКомандыОграничений"]);
	НЭлем.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НЭлем.ИмяКоманды = "Ограничения_ДобавитьОграничение";
	//
	НКом = Команды.Добавить("Ограничения_ДобавитьОграничениеВсем");
	НКом.Действие = "Ограничения_ДобавитьОграничениеВсем";
	НКом.Заголовок = НСтр("ru = 'Добавить ограничение для всех';"
	+ " en = 'Add constraint for all'; es = 'Agregar una restricción para todos'");
	//
	НЭлем = Элементы.Добавить("Кнопка_Ограничения_ДобавитьОграничениеВсем",
		Тип("КнопкаФормы"), Элементы["ГруппаКомандыОграничений"]);
	НЭлем.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НЭлем.ИмяКоманды = "Ограничения_ДобавитьОграничениеВсем";
	//
	НКом = Команды.Добавить("ПроверитьОР");
	НКом.Действие = "ПроверитьОР";
	НКом.Заголовок = "Проверить ОР";
	//
	НЭлем = Элементы.Добавить("Кнопка_ПроверитьОР", Тип("КнопкаФормы"), Элементы["ГруппаКомандыОграничений"]);
	НЭлем.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НЭлем.ИмяКоманды = "ПроверитьОР";
	НЭлем.Заголовок = НСтр("en='To check the EI';es='Comprobar el RP';ru='Проверить ОР'");
	//	Типовой состав
	НЭлем = Элементы.Добавить("ГруппаКомандыТиповойСостав", Тип("ГруппаФормы"), Элементы["Страница_Состав"]);
	НЭлем.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НЭлем.ОтображатьЗаголовок = Ложь;
	//
	НКом = Команды.Добавить("ТиповойСостав_Добавить");
	НКом.Действие = "ТиповойСостав_Добавить";
	НКом.Заголовок = НСтр("ru = 'Добавить'; en = 'Add'; es = 'Agregar'");
	//
	НЭлем = Элементы.Добавить("Кнопка_ТиповойСостав_Добавить",
		Тип("КнопкаФормы"), Элементы["ГруппаКомандыТиповойСостав"]);
	НЭлем.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НЭлем.ИмяКоманды = "ТиповойСостав_Добавить";
	//
	НКом = Команды.Добавить("ТиповойСостав_Удалить");
	НКом.Действие = "ТиповойСостав_Удалить"; 
	НКом.Заголовок = НСтр("ru = 'Удалить'; en = 'To remove'; es = 'Eliminar'");
	//
	НЭлем = Элементы.Добавить("Кнопка_ТиповойСостав_Удалить",
		Тип("КнопкаФормы"), Элементы["ГруппаКомандыТиповойСостав"]);
	НЭлем.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НЭлем.ИмяКоманды = "ТиповойСостав_Удалить";
	//
	НКом = Команды.Добавить("ТиповойСостав_Проставить");
	НКом.Действие = "ТиповойСостав_Проставить";
	НКом.Заголовок = НСтр("ru = 'Проставить установленные ОР';"
		+ " en = 'To put installed the EI'; es = 'Poner instalados RP'");
	//
	НЭлем = Элементы.Добавить("Кнопка_ТиповойСостав_Проставить",
		Тип("КнопкаФормы"), Элементы["ГруппаКомандыТиповойСостав"]);
	НЭлем.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НЭлем.ИмяКоманды = "ТиповойСостав_Проставить";
	//
	нТабл = Элементы.Добавить("ТиповойСостав", Тип("ТаблицаФормы"), Элементы["Страница_Состав"]);
	нТабл.ПутьКДанным = "ТиповойСостав";
	нТабл.КоманднаяПанель.Видимость = Ложь;
	нТабл.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	нТабл.ТолькоПросмотр = Истина;
	// гкс+ [Релиз18] Деснол
	нТабл.ВысотаВСтрокахТаблицы = 5;
	нТабл.Высота = 5;
	// гкс- [Релиз18]
	
	НЭлем = Элементы.Добавить("ТиповойСостав_НомерПП", Тип("ПолеФормы"), Элементы["ТиповойСостав"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "ТиповойСостав.НомерПП";
	НЭлем.АвтоВысотаЯчейки = Истина;
	НЭлем.ТолькоПросмотр = Истина;
		
	НЭлем = Элементы.Добавить("ТиповойСостав_ТОР", Тип("ПолеФормы"), Элементы["ТиповойСостав"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "ТиповойСостав.ТОР";
	НЭлем.АвтоВысотаЯчейки = Истина;
	НЭлем.ТолькоПросмотр = Истина;
	
	НЭлем = Элементы.Добавить("ТиповойСостав_ОР", Тип("ПолеФормы"), Элементы["ТиповойСостав"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "ТиповойСостав.ОР";
	НЭлем.АвтоВысотаЯчейки = Истина;
	НЭлем.ТолькоПросмотр = Истина;
	
	НЭлем = Элементы.Добавить("ТиповойСостав_ОРИнвентарный", Тип("ПолеФормы"), Элементы["ТиповойСостав"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "ТиповойСостав.ОРИнвентарный";
	НЭлем.АвтоВысотаЯчейки = Истина;
	НЭлем.ТолькоПросмотр = Истина;
	
	НЭлем = Элементы.Добавить("ТиповойСостав_ОРДатаВвода", Тип("ПолеФормы"), Элементы["ТиповойСостав"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "ТиповойСостав.ОРДатаВвода";
	НЭлем.АвтоВысотаЯчейки = Истина;
	НЭлем.ТолькоПросмотр = Истина;
	
	НЭлем = Элементы.Добавить("ТиповойСостав_ОРЗаводской", Тип("ПолеФормы"), Элементы["ТиповойСостав"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "ТиповойСостав.ОРЗаводской";
	НЭлем.АвтоВысотаЯчейки = Истина;
	НЭлем.ТолькоПросмотр = Истина;
	
	НЭлем = Элементы.Добавить("ТиповойСостав_ОРДатаУстановки", Тип("ПолеФормы"), Элементы["ТиповойСостав"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "ТиповойСостав.ОРДатаУстановки";
	НЭлем.АвтоВысотаЯчейки = Истина;
	НЭлем.ТолькоПросмотр = Истина;
	//
	нТабл = Элементы.Добавить("НераспределенныйСостав", Тип("ТаблицаФормы"), Элементы["Страница_Состав"]);
	нТабл.ПутьКДанным = "НераспределенныйСостав";
	нТабл.КоманднаяПанель.Видимость = Ложь;
	нТабл.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	нТабл.ТолькоПросмотр = Истина;
	// гкс+ [Релиз18] Деснол
	нТабл.ВысотаВСтрокахТаблицы = 5;
	нТабл.Высота = 5;
	// гкс- [Релиз18]
		
	НЭлем = Элементы.Добавить("НераспределенныйСостав_ТОР", Тип("ПолеФормы"), Элементы["НераспределенныйСостав"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "НераспределенныйСостав.ТОР";
	НЭлем.АвтоВысотаЯчейки = Истина;
	НЭлем.ТолькоПросмотр = Истина;
	НЭлем.ЦветТекста = Новый Цвет(200,200,200);
	
	НЭлем = Элементы.Добавить("НераспределенныйСостав_ОР", Тип("ПолеФормы"), Элементы["НераспределенныйСостав"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "НераспределенныйСостав.ОР";
	НЭлем.АвтоВысотаЯчейки = Истина;
	НЭлем.ТолькоПросмотр = Истина;
	НЭлем.ЦветТекста = Новый Цвет(200,200,200);
	//
	НЭлем = Элементы.Добавить("СписокИзмеряемыхПоказателей_дс_Тег", 
		Тип("ПолеФормы"), Элементы.СписокИзмеряемыхПоказателей);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "СписокИзмеряемыхПоказателей.гкс_Тег";
	НЭлем.УстановитьДействие("ПриИзменении","гкс_ТегПриИзменении");
	//
	НЭлем = Элементы.Добавить("СписокПараметровНаработки_дс_Тег", 
		Тип("ПолеФормы"), Элементы.СписокПараметровНаработки);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "СписокПараметровНаработки.гкс_Тег";
	НЭлем.УстановитьДействие("ПриИзменении","гкс_Тег1ПриИзменении");
	//
	ЗаголовокТМ = НСтр("ru='Техническое место';en='Technical location'");
	НЭлем = Элементы.Добавить("гкс_ТМ",Тип("ПолеФормы"), Элементы.ГруппаДанныеЭксплЛевая);
	НЭлем.Заголовок = ЗаголовокТМ;
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.АвтоМаксимальнаяШирина = Ложь;
	НЭлем.ПутьКДанным = "гкс_ТМ";
	НЭлем.ТолькоПросмотр = Истина;
	НЭлем.УстановитьДействие("Открытие", "гкс_ТМОткрытие");
	//
	// гкс+ [04.23] Деснол 14.04.2023
	НГруп = Элементы.Добавить("гкс_ГрупаТМФМ", Тип("ГруппаФормы"), Элементы.ГруппаДанныеЭксплЛевая);
	НГруп.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НГруп.отображатьЗаголовок = Ложь;
	НГруп.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	//
	НЭлем = Элементы.Добавить("гкс_ТМФМ",Тип("ПолеФормы"), Элементы["гкс_ГрупаТМФМ"]);
	НЭлем.Заголовок = ЗаголовокТМ;
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.АвтоМаксимальнаяШирина = Ложь;
	НЭлем.ПутьКДанным = "гкс_ТМФМ";
	НЭлем.ТолькоПросмотр = Истина;
	НЭлем.УстановитьДействие("Открытие", "гкс_ТМФМОткрытие");
	//
	НоваяКоманда = Команды.Добавить("гкс_СоздатьТМ");
	НоваяКоманда.Действие = "гкс_СоздатьТМ";
	НоваяКоманда.Заголовок = "Создать собственное техническое место";
	//
	НоваяКнопка = Элементы.Добавить("гкс_СоздатьТМКнопка", Тип("КнопкаФормы"), Элементы["гкс_ГрупаТМФМ"]);
	НоваяКнопка.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НоваяКнопка.ИмяКоманды = "гкс_СоздатьТМ";
	НоваяКнопка.Картинка = БиблиотекаКартинок.ДобавитьЭлементСписка;
	НоваяКнопка.Отображение = ОтображениеКнопки.Картинка;
	НоваяКнопка.Видимость = Ложь;
	//
	// гкс- [04.23] Деснол 14.04.2023
	//
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		НайтиТМ(Объект.Ссылка, ЭтотОбъект["гкс_ТМ"], ЭтотОбъект["гкс_ТМФМ"], Объект.ТипОбъекта);
	КонецЕсли;
	//
	НЭлем = Элементы.Добавить("гкс_Кодировка", Тип("ПолеФормы"), Элементы.ГруппаНаименованиеКод);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.Заголовок = НСтр("ru='Кодировка';en='Encoding'");
	НЭлем.ПутьКДанным = "гкс_Кодировка";
	НЭлем.ТолькоПросмотр = Истина;
	// гкс+ [Релиз17] Деснол
	НЭлем.Видимость = Ложь;
	// гкс- [Релиз17]
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	гкс_КодировкаОР.Текст КАК Текст
			|ИЗ
			|	РегистрСведений.гкс_КодировкаОР КАК гкс_КодировкаОР
			|ГДЕ
			|	гкс_КодировкаОР.ОР = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() = Ложь Тогда 
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			ЭтотОбъект["гкс_Кодировка"] = Выборка.Текст;
		КонецЕсли;
	КонецЕсли;
	//
	Элементы.Изготовитель.Видимость = Ложь;
	НЭлем = Элементы.Добавить("гкс_Изготовитель", Тип("ПолеФормы"), Элементы.Группа3);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.Заголовок = НСтр("ru='Изготовитель';en='Manufacturer'; es = 'el Fabricador'");
	НЭлем.ПутьКДанным = "Объект.Изготовитель";
	НЭлем.АвтоМаксимальнаяШирина = Ложь;
	Элементы.Переместить(Элементы["гкс_Изготовитель"], Элементы.Группа3, Элементы.ДатаВыпуска);

КонецПроцедуры

&НаСервере
Процедура ДобавитьНовыеЭлементыПосле()
	//
	НЭлем = Элементы.Добавить("ПредстоящиеРемонты_ОР",Тип("ПолеФормы"),Элементы.ПредстоящиеРемонты);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "ПредстоящиеРемонты.ОбъектРемонтныхРабот";
	//
	НЭлем = Элементы.Добавить("ЗаявкиНаРемонт_ОР",Тип("ПолеФормы"),Элементы.ЗаявкиНаРемонт);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "ЗаявкиНаРемонт.ОбъектРемонта";
	//
	НЭлем = Элементы.Добавить("НарядыНВРР_ОР",Тип("ПолеФормы"),Элементы.НарядыНаВыполнениеРемонтныхРабот);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "НарядыНаВыполнениеРемонтныхРабот.ОбъектРемонта";
	//
	НЭлем = Элементы.Добавить("ВыполненныеРемонты_ОР",Тип("ПолеФормы"),Элементы.ВыполненныеРемонты);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "ВыполненныеРемонты.ОбъектРемонта";
	//    
	НЭлем = Элементы.Добавить("АктыПриемкиОборудования_ОР",Тип("ПолеФормы"),Элементы.АктыПриемкиОборудования);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "АктыПриемкиОборудования.ОбъектРемонта";
	//
	Элементы.Переместить(Элементы["ПредстоящиеРемонты_ОР"],Элементы.ПредстоящиеРемонты,Элементы.ПредстоящиеРемонтыРегистратор);
	Элементы.Переместить(Элементы["ЗаявкиНаРемонт_ОР"],Элементы.ЗаявкиНаРемонт,Элементы.ЗаявкиНаРемонтСсылка);
	Элементы.Переместить(Элементы["НарядыНВРР_ОР"],Элементы.НарядыНаВыполнениеРемонтныхРабот,Элементы.НарядыНаВыполнениеРемонтныхРаботДокумент);
	Элементы.Переместить(Элементы["ВыполненныеРемонты_ОР"],Элементы.ВыполненныеРемонты,Элементы.ВыполненныеРемонтыСсылка);
	Элементы.Переместить(Элементы["АктыПриемкиОборудования_ОР"],Элементы.АктыПриемкиОборудования,Элементы.АктыПриемкиОборудованияДокумент);
	Элементы.Переместить(Элементы["История_ОбъектРемонта"],Элементы.ИсторияПеремещенияОборудования1,Элементы.ИсторияПеремещенияОборудования1Период);
	// УсловноеОформление
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы["Ограничения_Ограничение"].Имя);
		
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаОграничений.Собственное");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста",Новый Цвет(200,200,200));
	Элемент.Использование = Истина;
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы["Ограничения_Ограничение"].Имя);
		
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаОграничений.гкс_Удален");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	//Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста",Новый Цвет(250,150,150));
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт",Новый Шрифт(Элементы["Ограничения_Ограничение"].Шрифт,,,,,,Истина));
	Элемент.Использование = Истина;
	//
	// гкс+ [Релиз17] Деснол
	НовыйЭлемент = Элементы.Добавить("гкс_МетодПланированияТоир", Тип("ПолеФормы"), Элементы.ГруппаНаименованиеКод);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гкс_МетодПланированияТоир";
	// гкс- [Релиз17]
	// гкс+ [Релиз18] Деснол
	НовыйЭлемент = Элементы.Вставить("гкс_НаработкаАкта", Тип("ПолеФормы"), Элементы.ВыполненныеРемонты, Элементы.ВыполненныеРемонтыГруппа1);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ВыполненныеРемонты.гкс_НаработкаАкта";
	НовыйЭлемент.Заголовок = "Наработка на момент закрытия акта";
	//
	НовыйЭлемент = Элементы.Добавить("гкс_Комментарий", Тип("ПолеФормы"), Элементы.ВыполненныеРемонты);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ВыполненныеРемонты.Комментарий";
	НовыйЭлемент.Заголовок = НСтр("ru='Комментарий';en='Comment'; es = 'El comentario'");
	// гкс- [Релиз18]
	
	// Гкс+[TOIR20-582] Зозуля А.В. от 27.05.2025. Добавлено:{
	Элементы.Подразделение.АвтоОтметкаНезаполненного = Истина;
	Элементы.ПодразделениеИсполнитель.АвтоОтметкаНезаполненного = Истина
	// } Гкс-[TOIR20-582] Зозуля А.В. от 27.05.2025.
	
КонецПроцедуры

&НаКлиенте 
Процедура ТипОбъекта_ПриИзменении(Элемент)
	ЭтотОбъект["ИзмененТипОбъекта"] = Истина;
	
	ТекВидимость = Не(Объект.ТипОбъекта = торо_ОбщегоНазначенияКлиентПовтИсп.ПолучитьПеречисление("торо_ТипыОбъектовRCM","ФункциональноеМесто"));
	Элементы.Направление.Видимость = ТекВидимость;
	Элементы.СрокПолезногоИспользования.Видимость = ТекВидимость;
	Элементы.ИнвентарныйНомер.Видимость = ТекВидимость;
	Элементы.ДатаСнятияСУчета.Видимость = ТекВидимость;
	Элементы.ВвестиОткрытьДокументСнятияСУчета.Видимость = ТекВидимость;
	//Элементы.Изготовитель.Видимость = ТекВидимость;
	Элементы.гкс_Изготовитель.Видимость = ТекВидимость;
	
	Элементы.НомерПаспорта.Видимость = ТекВидимость;
	Элементы.ЗаводскойНомер.Видимость = ТекВидимость;
	Элементы.КодКодПоОКОФ.Видимость = ТекВидимость;
	Элементы.КодПоОКОФ.Видимость = ТекВидимость;
	Элементы.ЕстьГарантияДляОбъекта.Видимость = ТекВидимость;
	Элементы.СписокПараметровНаработкиРесурсГарантии.Видимость = ТекВидимость;
	Элементы.ВыявленныеДефектыВвестиДефект.Видимость = ТекВидимость;
	Элементы.ГарантииОбъектаРемонтаДобавить.Видимость = ТекВидимость;
	Элементы.ГарантииОбъектаРемонтаУдалить.Видимость = ТекВидимость;
	Элементы["Страница_ОграниченияИСостав"].Видимость = Не ТекВидимость;
	Элементы.ЭтоАктив.Видимость = ТекВидимость;
	Элементы.ДанныеИзготовителя.Видимость = ТекВидимость;
	Элементы.ВнешнийОбъект.Видимость = ТекВидимость;
	Элементы["История_ОбъектРемонта"].Видимость = Не ТекВидимость;
	Элементы.ГруппаДополнительныеРеквизиты.Видимость = ТекВидимость;
	Элементы["ИсторияПеремещенияФМ"].Видимость = Не ТекВидимость;
	Элементы.ИсторияПеремещенияОборудования1.Видимость = ТекВидимость;
	Элементы.ВыборВидаИерархииИстория.Видимость = ТекВидимость;
	// гкс+ [04.23] Деснол 14.04.2023
	Если ЗначениеЗаполнено(ЭтотОбъект["гкс_ТМ"]) Тогда 
		Элементы["гкс_ТМ"].Видимость = Истина;
		Элементы["гкс_ТМФМ"].Видимость = Ложь;
		Элементы["гкс_СоздатьТМКнопка"].Видимость = Ложь;
	Иначе
		Элементы["гкс_ТМ"].Видимость = Не ТекВидимость;
		Элементы["гкс_ТМФМ"].Видимость = ТекВидимость;
		Элементы["гкс_СоздатьТМКнопка"].Видимость = ТекВидимость;
	КонецЕсли;
	// гкс- [04.23] Деснол 14.04.2023
	
	Если ТекВидимость = Ложь Тогда 
		Объект.ЭтоАктив = Ложь;
		Объект.ВнешнийОбъект = Ложь;
		Элементы.ВыборВидаИерархииИстория.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив());
	Иначе
		ТемпМасс = Новый Массив();
		ТемпМасс.Добавить(Новый ПараметрВыбора("Отбор.ИзменяетсяДокументами", Истина));
		Элементы.ВыборВидаИерархииИстория.ПараметрыВыбора = Новый ФиксированныйМассив(ТемпМасс);
	КонецЕсли;
	
	ИзменитьЗапросыДинамическихСписков(ТекВидимость);

КонецПроцедуры

&НаСервере
Процедура ТипОбъекта_ПриИзмененииНаСервере()
	ТекВидимость = Не(Объект.ТипОбъекта = Перечисления.торо_ТипыОбъектовRCM.ФункциональноеМесто);
	Элементы.Направление.Видимость = ТекВидимость;
	Элементы.СрокПолезногоИспользования.Видимость = ТекВидимость;
	Элементы.ИнвентарныйНомер.Видимость = ТекВидимость;
	Элементы.ДатаСнятияСУчета.Видимость = ТекВидимость;
	Элементы.ВвестиОткрытьДокументСнятияСУчета.Видимость = ТекВидимость;
	//Элементы.Изготовитель.Видимость = ТекВидимость;
	Элементы.гкс_Изготовитель.Видимость = ТекВидимость;

	Элементы.НомерПаспорта.Видимость = ТекВидимость;
	Элементы.ЗаводскойНомер.Видимость = ТекВидимость;
	Элементы.КодКодПоОКОФ.Видимость = ТекВидимость;
	Элементы.КодПоОКОФ.Видимость = ТекВидимость;
	Элементы.ЕстьГарантияДляОбъекта.Видимость = ТекВидимость;
	Элементы.СписокПараметровНаработкиРесурсГарантии.Видимость = ТекВидимость;
	Элементы.ВыявленныеДефектыВвестиДефект.Видимость = ТекВидимость;
	Элементы.ГарантииОбъектаРемонтаДобавить.Видимость = ТекВидимость;
	Элементы.ГарантииОбъектаРемонтаУдалить.Видимость = ТекВидимость;
	Элементы["Страница_ОграниченияИСостав"].Видимость = Не ТекВидимость;
	Элементы.ЭтоАктив.Видимость = ТекВидимость;
	Элементы.ДанныеИзготовителя.Видимость = ТекВидимость;
	Элементы.ВнешнийОбъект.Видимость = ТекВидимость;
	Элементы["История_ОбъектРемонта"].Видимость = Не ТекВидимость;
	Элементы.ГруппаДополнительныеРеквизиты.Видимость = ТекВидимость;
	Элементы["ИсторияПеремещенияФМ"].Видимость = Не ТекВидимость;
	Элементы.ИсторияПеремещенияОборудования1.Видимость = ТекВидимость;
	Элементы.ВыборВидаИерархииИстория.Видимость = ТекВидимость;
	Если ЗначениеЗаполнено(ЭтотОбъект["гкс_ТМ"]) Тогда 
		Элементы["гкс_ТМ"].Видимость = Истина;
		Элементы["гкс_ТМФМ"].Видимость = Ложь;
		Элементы["гкс_СоздатьТМКнопка"].Видимость = Ложь;
	Иначе
		Элементы["гкс_ТМ"].Видимость = Не ТекВидимость;
		Элементы["гкс_ТМФМ"].Видимость = ТекВидимость;
		Элементы["гкс_СоздатьТМКнопка"].Видимость = ТекВидимость;
	КонецЕсли;
	// гкс+ [04.23] Деснол 14.04.2023
	// гкс- [04.23] Деснол 14.04.2023
	// гкс+ [разработка 2021] Куст 07.06.2021
	Элементы.ОбновитьТехническиеДанные.Видимость = ТекВидимость;
	Элементы.ТиповойОР.Видимость = ТекВидимость;
	Элементы.Приоритет.Видимость = ТекВидимость;
	Элементы.СтраницаПоказателиЭксплуатации.Видимость = ТекВидимость;
	Элементы.СтраницаНормативыПланирования.Видимость = ТекВидимость;
	Элементы.СтраницаРегМероприятия.Видимость = ТекВидимость;
	Элементы.Исполнители.Видимость = ТекВидимость;
	Элементы["гкс_ОсновноеСредство"].Видимость = ТекВидимость;
	// гкс- [разработка 2021] Куст 07.06.2021
	
	Если ТекВидимость = Ложь Тогда 
		Объект.ЭтоАктив = Ложь;
		Объект.ВнешнийОбъект = Ложь;
		Элементы.ВыборВидаИерархииИстория.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив());
		ПолучитьИсториюПеремещения();
	Иначе
		ТемпМасс = Новый Массив();
		ТемпМасс.Добавить(Новый ПараметрВыбора("Отбор.ИзменяетсяДокументами", Истина));
		Элементы.ВыборВидаИерархииИстория.ПараметрыВыбора = Новый ФиксированныйМассив(ТемпМасс);
	КонецЕсли;
	
	ИзменитьЗапросыДинамическихСписков(ТекВидимость);
КонецПроцедуры

&НаСервере
Процедура ИзменитьЗапросыДинамическихСписков(ТекВидимость)
	Если ТекВидимость Тогда 
		НарядыНаВыполнениеРемонтныхРабот.ТекстЗапроса = "";
		АктыПриемкиОборудования.ТекстЗапроса = "";
#Область ВыявленныеДефекты_ТекстЗапроса
		ВыявленныеДефекты.ТекстЗапроса =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	торо_ВыявленныеДефектыСписокДефектов.Ссылка КАК Документ,
			|	торо_ВыявленныеДефектыСписокДефектов.ОтказавшийЭлемент КАК ОтказавшийЭлемент,
			|	торо_ВыявленныеДефектыСписокДефектов.ТиповойДефект КАК ТиповойДефект,
			|	торо_ВыявленныеДефектыСписокДефектов.ВидДефекта КАК ВидДефекта,
			|	торо_ВыявленныеДефектыСписокДефектов.ДефектПричина КАК ПричинаДефекта,
			|	торо_ВыявленныеДефектыСписокДефектов.КритичностьДефекта КАК КритичностьДефекта,
			|	ВЫБОР
			|		КОГДА НЕ торо_ВыявленныеДефекты.ПометкаУдаления
			|			ТОГДА ВЫБОР
			|					КОГДА торо_ВыявленныеДефекты.Проведен
			|						ТОГДА 1
			|					ИНАЧЕ 0
			|				КОНЕЦ
			|		ИНАЧЕ 2
			|	КОНЕЦ КАК ИндексКартинки
			|ИЗ
			|	Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефекты
			|		ПО торо_ВыявленныеДефектыСписокДефектов.Ссылка = торо_ВыявленныеДефекты.Ссылка
			|ГДЕ
			// гкс+ [] Деснол 24.08.2022
			|	(торо_ВыявленныеДефектыСписокДефектов.ОбъектРемонта В (&ОбъектРемонта)
			|			ИЛИ торо_ВыявленныеДефектыСписокДефектов.ОтказавшийЭлемент В (&ОбъектРемонта))
			// гкс- [] Деснол 24.08.2022
			|	И ВЫБОР
			|			КОГДА &ОтображатьТолькоПроведенные
			|				ТОГДА торо_ВыявленныеДефекты.Проведен
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			|
			|УПОРЯДОЧИТЬ ПО
			|	ОтказавшийЭлемент,
			|	торо_ВыявленныеДефекты.ДатаОбнаружения УБЫВ";
#КонецОбласти
#Область ПредстоящиеРемонты_ТекстЗапроса
		ПредстоящиеРемонты.ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                                  |	торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала КАК ДатаНачалаРемонтныхРабот,
		                                  |	торо_АктуальныеПлановыеДатыРемонтов.ДатаОкончания КАК ДатаОкончанияРемонтныхРабот,
		                                  |	торо_ПлановыеРемонтныеРаботыСрезПоследних.Отменен КАК Отменен,
		                                  |	торо_АктуальныеПлановыеДатыРемонтов.ДокументОснование КАК Регистратор,
		                                  |	торо_ПлановыеРемонтныеРаботыСрезПоследних.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
		                                  |	торо_ПлановыеРемонтныеРаботыСрезПоследних.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
		                                  |	торо_ПлановыеРемонтныеРаботыСрезПоследних.ID КАК ID,
		                                  |	1 КАК ИндексКартинки
		                                  |{ВЫБРАТЬ
		                                  |	ОбъектРемонтныхРабот.*}
		                                  |ИЗ
							// гкс+ [] Деснол 24.08.2022
		                                  |	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(, ОбъектРемонтныхРабот В (&ОбъектРемонта)) КАК торо_ПлановыеРемонтныеРаботыСрезПоследних
		                                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗавершенныеРемонтныеРаботы.СрезПоследних(&ДатаНачала, ОбъектРемонта В (&ОбъектРемонта)) КАК торо_ЗавершенныеРемонтныеРаботыСрезПоследних
							// гкс- [] Деснол 24.08.2022
		                                  |		ПО торо_ПлановыеРемонтныеРаботыСрезПоследних.ID = торо_ЗавершенныеРемонтныеРаботыСрезПоследних.ID
		                                  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК торо_АктуальныеПлановыеДатыРемонтов
		                                  |		ПО торо_ПлановыеРемонтныеРаботыСрезПоследних.ID = торо_АктуальныеПлановыеДатыРемонтов.IDРемонта
		                                  |ГДЕ
		                                  |	НЕ торо_ПлановыеРемонтныеРаботыСрезПоследних.Регистратор ЕСТЬ NULL
		                                  |	И торо_ЗавершенныеРемонтныеРаботыСрезПоследних.ID ЕСТЬ NULL
		                                  |	И НЕ торо_ПлановыеРемонтныеРаботыСрезПоследних.Отменен
		                                  |	И НЕ торо_ПлановыеРемонтныеРаботыСрезПоследних.Замещен
		                                  |
		                                  |ОБЪЕДИНИТЬ ВСЕ
		                                  |
		                                  |ВЫБРАТЬ
		                                  |	торо_ПланГрафикРемонтаПланРемонтов.ДатаНач,
		                                  |	торо_ПланГрафикРемонтаПланРемонтов.ДатаКон,
		                                  |	торо_ПланГрафикРемонтаПланРемонтов.Отменен,
		                                  |	торо_ПланГрафикРемонтаПланРемонтов.Ссылка,
		                                  |	торо_ПланГрафикРемонтаПланРемонтов.ВидРемонтныхРабот,
		                                  |	торо_ПланГрафикРемонтаПланРемонтов.ОбъектРемонтныхРабот,
		                                  |	торо_ПланГрафикРемонтаПланРемонтов.ID,
		                                  |	ВЫБОР
		                                  |		КОГДА торо_ПланГрафикРемонта.Проведен
		                                  |			ТОГДА 1
		                                  |		КОГДА торо_ПланГрафикРемонта.ПометкаУдаления
		                                  |			ТОГДА 2
		                                  |		ИНАЧЕ 0
		                                  |	КОНЕЦ
		                                  |ИЗ
		                                  |	Документ.торо_ПланГрафикРемонта.ПланРемонтов КАК торо_ПланГрафикРемонтаПланРемонтов
		                                  |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ПланГрафикРемонта КАК торо_ПланГрафикРемонта
		                                  |		ПО торо_ПланГрафикРемонтаПланРемонтов.Ссылка = торо_ПланГрафикРемонта.Ссылка
		                                  |ГДЕ
		                                  |	ВЫБОР
		                                  |			КОГДА &ОтображатьТолькоПроведенные
		                                  |				ТОГДА ЛОЖЬ
		                                  |			ИНАЧЕ НЕ торо_ПланГрафикРемонта.Проведен
		                                  |		КОНЕЦ
										  // гкс+ [] Деснол 24.08.2022
		                                  |	И торо_ПланГрафикРемонтаПланРемонтов.ОбъектРемонтныхРабот В (&ОбъектРемонта)
										  // гкс- [] Деснол 24.08.2022
		                                  |	И НЕ торо_ПланГрафикРемонтаПланРемонтов.Замещен
		                                  |
		                                  |УПОРЯДОЧИТЬ ПО
		                                  |	ОбъектРемонтныхРабот,
		                                  |	ДатаНачалаРемонтныхРабот";
#КонецОбласти
#Область ЗаявкиНаРемонт_ТекстЗапроса
		ЗаявкиНаРемонт.ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                              |	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка КАК Ссылка,
		                              |	торо_ТекущиеСтатусыСогласованияДокументов.СтатусДокумента КАК СтатусДокумента,
		                              |	торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаНачала КАК ДатаНачала,
		                              |	торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаОкончания КАК ДатаОкончания,
		                              |	торо_ЗаявкаНаРемонт.Дата КАК Дата,
		                              |	торо_ЗаявкаНаРемонт.Номер КАК Номер,
		                              |	ВЫБОР
		                              |		КОГДА НЕ торо_ЗаявкаНаРемонт.ПометкаУдаления
		                              |			ТОГДА ВЫБОР
		                              |					КОГДА торо_ЗаявкаНаРемонт.Проведен
		                              |						ТОГДА 1
		                              |					ИНАЧЕ 0
		                              |				КОНЕЦ
		                              |		ИНАЧЕ 2
		                              |	КОНЕЦ КАК ИндексКартинки,
		                              |	торо_ЗаявкаНаРемонтРемонтыОборудования.ГарантийныйРемонт КАК ГарантийныйРемонт,
		                              |	торо_ЗаявкаНаРемонтРемонтыОборудования.ВидРемонтныхРабот КАК ВидРемонта,
		                              |	торо_ЗаявкаНаРемонтРемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта
		                              |{ВЫБРАТЬ
		                              |	ОбъектРемонта.*}
		                              |ИЗ
		                              |	Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК торо_ЗаявкаНаРемонтРемонтыОборудования
		                              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ТекущиеСтатусыСогласованияДокументов КАК торо_ТекущиеСтатусыСогласованияДокументов
		                              |		ПО торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка = торо_ТекущиеСтатусыСогласованияДокументов.СогласуемыйДокумент
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт КАК торо_ЗаявкаНаРемонт
		                              |		ПО торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка = торо_ЗаявкаНаРемонт.Ссылка
		                              |ГДЕ
									  // гкс+ [] Деснол 24.08.2022
		                              |	торо_ЗаявкаНаРемонтРемонтыОборудования.ОбъектРемонта В (&ОбъектРемонта)
									  // гкс- [] Деснол 24.08.2022
		                              |	И ВЫБОР
		                              |			КОГДА &ОтображатьТолькоПроведенные
		                              |				ТОГДА торо_ЗаявкаНаРемонт.Проведен
		                              |			ИНАЧЕ ИСТИНА
		                              |		КОНЕЦ
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	ОбъектРемонта,
		                              |	торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаНачала УБЫВ";
#КонецОбласти
#Область ВыполненныеРемонты_ТекстЗапроса
		ВыполненныеРемонты.ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
|	торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала КАК ДатаНачалаПлан,
|	торо_АктуальныеПлановыеДатыРемонтов.ДатаОкончания КАК ДатаОкончанияПлан,
|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ДатаНачала КАК ДатаНачалаФакт,
|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ДатаОкончания КАК ДатаОкончанияФакт,
|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
|	торо_АктОВыполненииЭтапаРабот.ЗавершитьРемонтныеРаботы КАК РаботыЗавершены,
|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка КАК Ссылка,
|	ВЫБОР
|		КОГДА торо_АктОВыполненииЭтапаРабот.Проведен
|			ТОГДА 1
|		КОГДА торо_АктОВыполненииЭтапаРабот.ПометкаУдаления
|			ТОГДА 2
|		ИНАЧЕ 0
|	КОНЕЦ КАК ИндексКартинки,
|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ГарантийныйРемонт КАК ГарантийныйРемонт,
|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ID КАК ID,
|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта
|ПОМЕСТИТЬ ВТ_Документы
|ИЗ
|	Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК торо_АктОВыполненииЭтапаРаботРемонтыОборудования
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот КАК торо_АктОВыполненииЭтапаРабот
|		ПО торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка = торо_АктОВыполненииЭтапаРабот.Ссылка
// гкс+ [] Деснол 24.08.2022
|			И (торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ОбъектРемонта В (&ОбъектРемонта))
// гкс- [] Деснол 24.08.2022
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК торо_АктуальныеПлановыеДатыРемонтов
|		ПО торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ID = торо_АктуальныеПлановыеДатыРемонтов.IDРемонта
|ГДЕ
|	ВЫБОР
|			КОГДА &ОтображатьТолькоПроведенные
|				ТОГДА торо_АктОВыполненииЭтапаРабот.Проведен
|			ИНАЧЕ ИСТИНА
|		КОНЕЦ
|
|ОБЪЕДИНИТЬ
|
|ВЫБРАТЬ
|	торо_ВводНачальныхДанныхВыполненныеРаботы.ДатаОкончанияРемонта,
|	торо_ВводНачальныхДанныхВыполненныеРаботы.ДатаОкончанияРемонта,
|	торо_ВводНачальныхДанныхВыполненныеРаботы.ДатаОкончанияРемонта,
|	торо_ВводНачальныхДанныхВыполненныеРаботы.ДатаОкончанияРемонта,
|	торо_ВводНачальныхДанныхВыполненныеРаботы.ВидРемонтныхРабот,
|	ИСТИНА,
|	торо_ВводНачальныхДанныхВыполненныеРаботы.Ссылка,
|	ВЫБОР
|		КОГДА торо_ВводНачальныхДанных.Проведен
|			ТОГДА 1
|		КОГДА торо_ВводНачальныхДанных.ПометкаУдаления
|			ТОГДА 2
|		ИНАЧЕ 0
|	КОНЕЦ,
|	NULL,
|	NULL,
|	торо_ВводНачальныхДанныхВыполненныеРаботы.ОбъектРемонта
|ИЗ
|	Документ.торо_ВводНачальныхДанных.ВыполненныеРаботы КАК торо_ВводНачальныхДанныхВыполненныеРаботы
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ВводНачальныхДанных КАК торо_ВводНачальныхДанных
|		ПО торо_ВводНачальныхДанныхВыполненныеРаботы.Ссылка = торо_ВводНачальныхДанных.Ссылка
// гкс+ [] Деснол 24.08.2022
|			И (торо_ВводНачальныхДанныхВыполненныеРаботы.ОбъектРемонта В (&ОбъектРемонта))
// гкс- [] Деснол 24.08.2022
|ГДЕ
|	ВЫБОР
|			КОГДА &ОтображатьТолькоПроведенные
|				ТОГДА торо_ВводНачальныхДанных.Проведен
|			ИНАЧЕ ИСТИНА
|		КОНЕЦ
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗЛИЧНЫЕ
|	ВТ_Документы.ОбъектРемонта КАК ОбъектРемонта,
|	ВТ_Документы.ДатаОкончанияФакт КАК ДатаОкончанияФакт
|ПОМЕСТИТЬ ВТ_РазредОР
|ИЗ
|	ВТ_Документы КАК ВТ_Документы
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВТ_РазредОР.ОбъектРемонта КАК ОбъектРемонта,
|	ВТ_РазредОР.ДатаОкончанияФакт КАК ДатаОкончанияФакт,
|	СУММА(торо_НаработкаОбъектовРемонта.Наработка) КАК Наработка
|ПОМЕСТИТЬ СрезНаработки
|ИЗ
|	ВТ_РазредОР КАК ВТ_РазредОР
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.торо_НаработкаОбъектовРемонта КАК торо_НаработкаОбъектовРемонта
|		ПО ВТ_РазредОР.ОбъектРемонта = торо_НаработкаОбъектовРемонта.ОбъектРемонта
|			И ВТ_РазредОР.ДатаОкончанияФакт >= торо_НаработкаОбъектовРемонта.Период
|	И торо_НаработкаОбъектовРемонта.Показатель = Значение(Справочник.ПараметрыВыработкиОС.гкс_ПоЧасам)
|
|СГРУППИРОВАТЬ ПО
|	ВТ_РазредОР.ОбъектРемонта,
|	ВТ_РазредОР.ДатаОкончанияФакт
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВТ_Документы.ДатаНачалаПлан КАК ДатаНачалаПлан,
|	ВТ_Документы.ДатаОкончанияПлан КАК ДатаОкончанияПлан,
|	ВТ_Документы.ДатаНачалаФакт КАК ДатаНачалаФакт,
|	ВТ_Документы.ДатаОкончанияФакт КАК ДатаОкончанияФакт,
|	ВТ_Документы.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
|	ВТ_Документы.РаботыЗавершены КАК РаботыЗавершены,
|	ВТ_Документы.Ссылка КАК Ссылка,
|	ВТ_Документы.ИндексКартинки КАК ИндексКартинки,
|	ВТ_Документы.ГарантийныйРемонт КАК ГарантийныйРемонт,
|	ВТ_Документы.ID КАК ID,
|	ВТ_Документы.ОбъектРемонта КАК ОбъектРемонта,
|	ВТ_Документы.Ссылка.Комментарий КАК Комментарий,
|	СрезНаработки.Наработка КАК гкс_НаработкаАкта
|{ВЫБРАТЬ
|	ОбъектРемонта.*}
|ИЗ
|	ВТ_Документы КАК ВТ_Документы
|		ЛЕВОЕ СОЕДИНЕНИЕ СрезНаработки КАК СрезНаработки
|		ПО ВТ_Документы.ОбъектРемонта = СрезНаработки.ОбъектРемонта
|			И ВТ_Документы.ДатаОкончанияФакт = СрезНаработки.ДатаОкончанияФакт";
#КонецОбласти
		
		
	Иначе
		ТекИерархия = Константы.торо_ИерархияДляВводаНовыхОР.Получить();
		// гкс+ [] Деснол 24.08.2022
		#Область ИерархияПодчиненных
		Если ТекИерархия.ИзменяетсяДокументами Тогда 
			ТекстЗапросаПодчиненных = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.ОбъектИерархии КАК ОР
			|ПОМЕСТИТЬ ПодчиненныеОР
			|ИЗ
			|	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(
			|			,
			|			СтруктураИерархии В
			|					(ВЫБРАТЬ
			|						торо_ИерархияДляВводаНовыхОР.Значение КАК Значение
			|					ИЗ
			|						Константа.торо_ИерархияДляВводаНовыхОР КАК торо_ИерархияДляВводаНовыхОР)
			|				И РодительИерархии В (&ОбъектРемонта)) КАК торо_РасположениеОРВСтруктуреИерархииСрезПоследних"+"
			|;
			| ";
		Иначе
			ТекстЗапросаПодчиненных = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	торо_ИерархическиеСтруктурыОР.ОбъектИерархии КАК ОР
			|ПОМЕСТИТЬ ПодчиненныеОР
			|ИЗ
			|	РегистрСведений.торо_ИерархическиеСтруктурыОР КАК торо_ИерархическиеСтруктурыОР
			|ГДЕ
			|	торо_ИерархическиеСтруктурыОР.СтруктураИерархии В
			|			(ВЫБРАТЬ
			|				торо_ИерархияДляВводаНовыхОР.Значение КАК Значение
			|			ИЗ
			|				Константа.торо_ИерархияДляВводаНовыхОР КАК торо_ИерархияДляВводаНовыхОР)
			|	И торо_ИерархическиеСтруктурыОР.РодительИерархии В (&ОбъектРемонта)"+"
			|;
			| ";
		КонецЕсли;
		#КонецОбласти
		// гкс- [] Деснол 24.08.2022
		НарядыНаВыполнениеРемонтныхРабот.ТекстЗапроса = ТекстЗапросаПодчиненных;
		АктыПриемкиОборудования.ТекстЗапроса = ТекстЗапросаПодчиненных;
		ВыявленныеДефекты.ТекстЗапроса = ТекстЗапросаПодчиненных +
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	торо_ВыявленныеДефектыСписокДефектов.Ссылка КАК Документ,
			|	торо_ВыявленныеДефектыСписокДефектов.ОтказавшийЭлемент КАК ОтказавшийЭлемент,
			|	торо_ВыявленныеДефектыСписокДефектов.ТиповойДефект КАК ТиповойДефект,
			|	торо_ВыявленныеДефектыСписокДефектов.ВидДефекта КАК ВидДефекта,
			|	торо_ВыявленныеДефектыСписокДефектов.ДефектПричина КАК ПричинаДефекта,
			|	торо_ВыявленныеДефектыСписокДефектов.КритичностьДефекта КАК КритичностьДефекта,
			|	ВЫБОР
			|		КОГДА НЕ торо_ВыявленныеДефекты.ПометкаУдаления
			|			ТОГДА ВЫБОР
			|					КОГДА торо_ВыявленныеДефекты.Проведен
			|						ТОГДА 1
			|					ИНАЧЕ 0
			|				КОНЕЦ
			|		ИНАЧЕ 2
			|	КОНЕЦ КАК ИндексКартинки
			|ИЗ
			|	Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефекты
			|		ПО торо_ВыявленныеДефектыСписокДефектов.Ссылка = торо_ВыявленныеДефекты.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПодчиненныеОР КАК ПодчиненныеОР
			|		ПО (ПодчиненныеОР.ОР = торо_ВыявленныеДефектыСписокДефектов.ОбъектРемонта
			|				ИЛИ ПодчиненныеОР.ОР = торо_ВыявленныеДефектыСписокДефектов.ОтказавшийЭлемент)
			|ГДЕ
			|	ВЫБОР
			|			КОГДА &ОтображатьТолькоПроведенные
			|				ТОГДА торо_ВыявленныеДефекты.Проведен
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			|
			|УПОРЯДОЧИТЬ ПО
			|	ОтказавшийЭлемент,
			|	торо_ВыявленныеДефекты.ДатаОбнаружения УБЫВ";
		
		ПредстоящиеРемонты.ТекстЗапроса = ТекстЗапросаПодчиненных + "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                                                            |	торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала КАК ДатаНачалаРемонтныхРабот,
		                                                            |	торо_АктуальныеПлановыеДатыРемонтов.ДатаОкончания КАК ДатаОкончанияРемонтныхРабот,
		                                                            |	торо_ПлановыеРемонтныеРаботыСрезПоследних.Отменен КАК Отменен,
		                                                            |	торо_АктуальныеПлановыеДатыРемонтов.ДокументОснование КАК Регистратор,
		                                                            |	торо_ПлановыеРемонтныеРаботыСрезПоследних.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
		                                                            |	торо_ПлановыеРемонтныеРаботыСрезПоследних.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
		                                                            |	торо_ПлановыеРемонтныеРаботыСрезПоследних.ID КАК ID,
		                                                            |	1 КАК ИндексКартинки
		                                                            |{ВЫБРАТЬ
		                                                            |	ОбъектРемонтныхРабот.*}
		                                                            |ИЗ
		                                                            |	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(
		                                                            |			,
																	// гкс+ [] Деснол 24.08.2022
		                                                            |			ОбъектРемонтныхРабот В (&ОбъектРемонта)
																	// гкс- [] Деснол 24.08.2022
		                                                            |				ИЛИ ОбъектРемонтныхРабот В
		                                                            |					(ВЫБРАТЬ
		                                                            |						ПодчиненныеОР.ОР
		                                                            |					ИЗ
		                                                            |						ПодчиненныеОР КАК ПодчиненныеОР)) КАК торо_ПлановыеРемонтныеРаботыСрезПоследних
																	// гкс+ [] Деснол 24.08.2022
		                                                            |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗавершенныеРемонтныеРаботы.СрезПоследних(&ДатаНачала, ОбъектРемонта В (&ОбъектРемонта)) КАК торо_ЗавершенныеРемонтныеРаботыСрезПоследних
																	// гкс- [] Деснол 24.08.2022
		                                                            |		ПО торо_ПлановыеРемонтныеРаботыСрезПоследних.ID = торо_ЗавершенныеРемонтныеРаботыСрезПоследних.ID
		                                                            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК торо_АктуальныеПлановыеДатыРемонтов
		                                                            |		ПО торо_ПлановыеРемонтныеРаботыСрезПоследних.ID = торо_АктуальныеПлановыеДатыРемонтов.IDРемонта
		                                                            |ГДЕ
		                                                            |	НЕ торо_ПлановыеРемонтныеРаботыСрезПоследних.Регистратор ЕСТЬ NULL
		                                                            |	И торо_ЗавершенныеРемонтныеРаботыСрезПоследних.ID ЕСТЬ NULL
		                                                            |	И НЕ торо_ПлановыеРемонтныеРаботыСрезПоследних.Отменен
		                                                            |	И НЕ торо_ПлановыеРемонтныеРаботыСрезПоследних.Замещен
		                                                            |
		                                                            |ОБЪЕДИНИТЬ ВСЕ
		                                                            |
		                                                            |ВЫБРАТЬ
		                                                            |	торо_ПланГрафикРемонтаПланРемонтов.ДатаНач,
		                                                            |	торо_ПланГрафикРемонтаПланРемонтов.ДатаКон,
		                                                            |	торо_ПланГрафикРемонтаПланРемонтов.Отменен,
		                                                            |	торо_ПланГрафикРемонтаПланРемонтов.Ссылка,
		                                                            |	торо_ПланГрафикРемонтаПланРемонтов.ВидРемонтныхРабот,
		                                                            |	торо_ПланГрафикРемонтаПланРемонтов.ОбъектРемонтныхРабот,
		                                                            |	торо_ПланГрафикРемонтаПланРемонтов.ID,
		                                                            |	ВЫБОР
		                                                            |		КОГДА торо_ПланГрафикРемонта.Проведен
		                                                            |			ТОГДА 1
		                                                            |		КОГДА торо_ПланГрафикРемонта.ПометкаУдаления
		                                                            |			ТОГДА 2
		                                                            |		ИНАЧЕ 0
		                                                            |	КОНЕЦ
		                                                            |ИЗ
		                                                            |	Документ.торо_ПланГрафикРемонта.ПланРемонтов КАК торо_ПланГрафикРемонтаПланРемонтов
		                                                            |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ПланГрафикРемонта КАК торо_ПланГрафикРемонта
		                                                            |		ПО торо_ПланГрафикРемонтаПланРемонтов.Ссылка = торо_ПланГрафикРемонта.Ссылка
		                                                            |		ЛЕВОЕ СОЕДИНЕНИЕ ПодчиненныеОР КАК ПодчиненныеОР
		                                                            |		ПО (ПодчиненныеОР.ОР = торо_ПланГрафикРемонтаПланРемонтов.ОбъектРемонтныхРабот)
		                                                            |ГДЕ
		                                                            |	ВЫБОР
		                                                            |			КОГДА &ОтображатьТолькоПроведенные
		                                                            |				ТОГДА ЛОЖЬ
		                                                            |			ИНАЧЕ НЕ торо_ПланГрафикРемонта.Проведен
		                                                            |		КОНЕЦ
		                                                            |	И (торо_ПланГрафикРемонтаПланРемонтов.ОбъектРемонтныхРабот В (&ОбъектРемонта)
		                                                            |			ИЛИ НЕ ПодчиненныеОР.ОР ЕСТЬ NULL)
		                                                            |	И НЕ торо_ПланГрафикРемонтаПланРемонтов.Замещен
		                                                            |
		                                                            |УПОРЯДОЧИТЬ ПО
		                                                            |	ОбъектРемонтныхРабот";
		
		ЗаявкиНаРемонт.ТекстЗапроса = ТекстЗапросаПодчиненных + "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                                                        |	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка КАК Ссылка,
		                                                        |	торо_ТекущиеСтатусыСогласованияДокументов.СтатусДокумента КАК СтатусДокумента,
		                                                        |	торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаНачала КАК ДатаНачала,
		                                                        |	торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаОкончания КАК ДатаОкончания,
		                                                        |	торо_ЗаявкаНаРемонт.Дата КАК Дата,
		                                                        |	торо_ЗаявкаНаРемонт.Номер КАК Номер,
		                                                        |	ВЫБОР
		                                                        |		КОГДА НЕ торо_ЗаявкаНаРемонт.ПометкаУдаления
		                                                        |			ТОГДА ВЫБОР
		                                                        |					КОГДА торо_ЗаявкаНаРемонт.Проведен
		                                                        |						ТОГДА 1
		                                                        |					ИНАЧЕ 0
		                                                        |				КОНЕЦ
		                                                        |		ИНАЧЕ 2
		                                                        |	КОНЕЦ КАК ИндексКартинки,
		                                                        |	торо_ЗаявкаНаРемонтРемонтыОборудования.ГарантийныйРемонт КАК ГарантийныйРемонт,
		                                                        |	торо_ЗаявкаНаРемонтРемонтыОборудования.ВидРемонтныхРабот КАК ВидРемонта,
		                                                        |	торо_ЗаявкаНаРемонтРемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта
		                                                        |{ВЫБРАТЬ
		                                                        |	ОбъектРемонта.*}
		                                                        |ИЗ
		                                                        |	Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК торо_ЗаявкаНаРемонтРемонтыОборудования
		                                                        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ТекущиеСтатусыСогласованияДокументов КАК торо_ТекущиеСтатусыСогласованияДокументов
		                                                        |		ПО торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка = торо_ТекущиеСтатусыСогласованияДокументов.СогласуемыйДокумент
		                                                        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт КАК торо_ЗаявкаНаРемонт
		                                                        |		ПО торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка = торо_ЗаявкаНаРемонт.Ссылка
		                                                        |		ЛЕВОЕ СОЕДИНЕНИЕ ПодчиненныеОР КАК ПодчиненныеОР
		                                                        |		ПО (ПодчиненныеОР.ОР = торо_ЗаявкаНаРемонтРемонтыОборудования.ОбъектРемонта)
		                                                        |ГДЕ
																// гкс+ [] Деснол 24.08.2022
		                                                        |	(торо_ЗаявкаНаРемонтРемонтыОборудования.ОбъектРемонта В (&ОбъектРемонта)
																// гкс- [] Деснол 24.08.2022
		                                                        |			ИЛИ НЕ ПодчиненныеОР.ОР ЕСТЬ NULL)
		                                                        |	И ВЫБОР
		                                                        |			КОГДА &ОтображатьТолькоПроведенные
		                                                        |				ТОГДА торо_ЗаявкаНаРемонт.Проведен
		                                                        |			ИНАЧЕ ИСТИНА
		                                                        |		КОНЕЦ
		                                                        |
		                                                        |УПОРЯДОЧИТЬ ПО
		                                                        |	ОбъектРемонта,
		                                                        |	торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаНачала УБЫВ";
#Область ВыполненныеРемонты_ТекстЗапроса
		ВыполненныеРемонты.ТекстЗапроса = ТекстЗапросаПодчиненных + "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                                                            |	торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала КАК ДатаНачалаПлан,
		                                                            |	торо_АктуальныеПлановыеДатыРемонтов.ДатаОкончания КАК ДатаОкончанияПлан,
		                                                            |	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ДатаНачала КАК ДатаНачалаФакт,
		                                                            |	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ДатаОкончания КАК ДатаОкончанияФакт,
		                                                            |	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
		                                                            |	торо_АктОВыполненииЭтапаРабот.ЗавершитьРемонтныеРаботы КАК РаботыЗавершены,
		                                                            |	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка КАК Ссылка,
		                                                            |	ВЫБОР
		                                                            |		КОГДА торо_АктОВыполненииЭтапаРабот.Проведен
		                                                            |			ТОГДА 1
		                                                            |		КОГДА торо_АктОВыполненииЭтапаРабот.ПометкаУдаления
		                                                            |			ТОГДА 2
		                                                            |		ИНАЧЕ 0
		                                                            |	КОНЕЦ КАК ИндексКартинки,
		                                                            |	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ГарантийныйРемонт КАК ГарантийныйРемонт,
		                                                            |	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ID КАК ID,
		                                                            |	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта
		                                                            |Поместить ВТ_Документы
		                                                            |ИЗ
		                                                            |	Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК торо_АктОВыполненииЭтапаРаботРемонтыОборудования
		                                                            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот КАК торо_АктОВыполненииЭтапаРабот
		                                                            |		ПО торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка = торо_АктОВыполненииЭтапаРабот.Ссылка
		                                                            |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК торо_АктуальныеПлановыеДатыРемонтов
		                                                            |		ПО торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ID = торо_АктуальныеПлановыеДатыРемонтов.IDРемонта
		                                                            |		ЛЕВОЕ СОЕДИНЕНИЕ ПодчиненныеОР КАК ПодчиненныеОР
		                                                            |		ПО (ПодчиненныеОР.ОР = торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ОбъектРемонта)
		                                                            |ГДЕ
																	// гкс+ [] Деснол 24.08.2022
		                                                            |	(торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ОбъектРемонта В (&ОбъектРемонта)
																	// гкс- [] Деснол 24.08.2022
		                                                            |			ИЛИ НЕ ПодчиненныеОР.ОР ЕСТЬ NULL)
		                                                            |	И ВЫБОР
		                                                            |			КОГДА &ОтображатьТолькоПроведенные
		                                                            |				ТОГДА торо_АктОВыполненииЭтапаРабот.Проведен
		                                                            |			ИНАЧЕ ИСТИНА
		                                                            |		КОНЕЦ
		                                                            |
		                                                            |ОБЪЕДИНИТЬ
		                                                            |
		                                                            |ВЫБРАТЬ
		                                                            |	торо_ВводНачальныхДанныхВыполненныеРаботы.ДатаОкончанияРемонта,
		                                                            |	торо_ВводНачальныхДанныхВыполненныеРаботы.ДатаОкончанияРемонта,
		                                                            |	торо_ВводНачальныхДанныхВыполненныеРаботы.ДатаОкончанияРемонта,
		                                                            |	торо_ВводНачальныхДанныхВыполненныеРаботы.ДатаОкончанияРемонта,
		                                                            |	торо_ВводНачальныхДанныхВыполненныеРаботы.ВидРемонтныхРабот,
		                                                            |	ИСТИНА,
		                                                            |	торо_ВводНачальныхДанныхВыполненныеРаботы.Ссылка,
		                                                            |	ВЫБОР
		                                                            |		КОГДА торо_ВводНачальныхДанных.Проведен
		                                                            |			ТОГДА 1
		                                                            |		КОГДА торо_ВводНачальныхДанных.ПометкаУдаления
		                                                            |			ТОГДА 2
		                                                            |		ИНАЧЕ 0
		                                                            |	КОНЕЦ,
		                                                            |	NULL,
		                                                            |	NULL,
		                                                            |	NULL
		                                                            |ИЗ
		                                                            |	Документ.торо_ВводНачальныхДанных.ВыполненныеРаботы КАК торо_ВводНачальныхДанныхВыполненныеРаботы
		                                                            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ВводНачальныхДанных КАК торо_ВводНачальныхДанных
		                                                            |		ПО торо_ВводНачальныхДанныхВыполненныеРаботы.Ссылка = торо_ВводНачальныхДанных.Ссылка
		                                                            |		ЛЕВОЕ СОЕДИНЕНИЕ ПодчиненныеОР КАК ПодчиненныеОР
		                                                            |		ПО (ПодчиненныеОР.ОР = торо_ВводНачальныхДанныхВыполненныеРаботы.ОбъектРемонта)
		                                                            |ГДЕ
																	// гкс+ [] Деснол 24.08.2022
		                                                            |	(торо_ВводНачальныхДанныхВыполненныеРаботы.ОбъектРемонта В (&ОбъектРемонта)
																	// гкс- [] Деснол 24.08.2022
		                                                            |			ИЛИ НЕ ПодчиненныеОР.ОР ЕСТЬ NULL)
		                                                            |	И ВЫБОР
		                                                            |			КОГДА &ОтображатьТолькоПроведенные
		                                                            |				ТОГДА торо_ВводНачальныхДанных.Проведен
		                                                            |			ИНАЧЕ ИСТИНА
		                                                            |		КОНЕЦ
		                                                            |
																	|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗЛИЧНЫЕ
|	ВТ_Документы.ОбъектРемонта КАК ОбъектРемонта,
|	ВТ_Документы.ДатаОкончанияФакт КАК ДатаОкончанияФакт
|ПОМЕСТИТЬ ВТ_РазредОР
|ИЗ
|	ВТ_Документы КАК ВТ_Документы
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВТ_РазредОР.ОбъектРемонта КАК ОбъектРемонта,
|	ВТ_РазредОР.ДатаОкончанияФакт КАК ДатаОкончанияФакт,
|	СУММА(торо_НаработкаОбъектовРемонта.Наработка) КАК Наработка
|ПОМЕСТИТЬ СрезНаработки
|ИЗ
|	ВТ_РазредОР КАК ВТ_РазредОР
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.торо_НаработкаОбъектовРемонта КАК торо_НаработкаОбъектовРемонта
|		ПО ВТ_РазредОР.ОбъектРемонта = торо_НаработкаОбъектовРемонта.ОбъектРемонта
|			И ВТ_РазредОР.ДатаОкончанияФакт >= торо_НаработкаОбъектовРемонта.Период
|	И торо_НаработкаОбъектовРемонта.Показатель = Значение(Справочник.ПараметрыВыработкиОС.гкс_ПоЧасам)
|
|СГРУППИРОВАТЬ ПО
|	ВТ_РазредОР.ОбъектРемонта,
|	ВТ_РазредОР.ДатаОкончанияФакт
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВТ_Документы.ДатаНачалаПлан КАК ДатаНачалаПлан,
|	ВТ_Документы.ДатаОкончанияПлан КАК ДатаОкончанияПлан,
|	ВТ_Документы.ДатаНачалаФакт КАК ДатаНачалаФакт,
|	ВТ_Документы.ДатаОкончанияФакт КАК ДатаОкончанияФакт,
|	ВТ_Документы.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
|	ВТ_Документы.РаботыЗавершены КАК РаботыЗавершены,
|	ВТ_Документы.Ссылка КАК Ссылка,
|	ВТ_Документы.ИндексКартинки КАК ИндексКартинки,
|	ВТ_Документы.ГарантийныйРемонт КАК ГарантийныйРемонт,
|	ВТ_Документы.ID КАК ID,
|	ВТ_Документы.ОбъектРемонта КАК ОбъектРемонта,
|	ВТ_Документы.Ссылка.Комментарий КАК Комментарий,
|	СрезНаработки.Наработка КАК гкс_НаработкаАкта
|{ВЫБРАТЬ
|	ОбъектРемонта.*}
|ИЗ
|	ВТ_Документы КАК ВТ_Документы
|		ЛЕВОЕ СОЕДИНЕНИЕ СрезНаработки КАК СрезНаработки
|		ПО ВТ_Документы.ОбъектРемонта = СрезНаработки.ОбъектРемонта
|			И ВТ_Документы.ДатаОкончанияФакт = СрезНаработки.ДатаОкончанияФакт
| УПОРЯДОЧИТЬ ПО
|	ОбъектРемонта";
#КонецОбласти
	КонецЕсли;
	
	НарядыНаВыполнениеРемонтныхРабот.ТекстЗапроса = НарядыНаВыполнениеРемонтныхРабот.ТекстЗапроса + "ВЫБРАТЬ
	                                                |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка КАК Документ,
	                                                |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	                                                |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ДатаНачала КАК ДатаНачала,
	                                                |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ДатаОкончания КАК ДатаОкончания,
	                                                |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОпаснаяРабота КАК ОпаснаяРабота,
	                                                |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.МестоПроведенияРабот КАК МестоПроведенияРабот,
	                                                |	ВЫБОР
	                                                |		КОГДА НЕ торо_НарядНаВыполнениеРемонтныхРабот.ПометкаУдаления
	                                                |			ТОГДА ВЫБОР
	                                                |					КОГДА торо_НарядНаВыполнениеРемонтныхРабот.Проведен
	                                                |						ТОГДА 1
	                                                |					ИНАЧЕ 0
	                                                |				КОНЕЦ
	                                                |		ИНАЧЕ 2
	                                                |	КОНЕЦ КАК ИндексКартинки,
	                                                |	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта
													|{ВЫБРАТЬ
		                                            |	ОбъектРемонта.*}
	                                                |ИЗ
	                                                |	Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтыОборудования КАК торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования
	                                                |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_НарядНаВыполнениеРемонтныхРабот КАК торо_НарядНаВыполнениеРемонтныхРабот
	                                                |		ПО торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка = торо_НарядНаВыполнениеРемонтныхРабот.Ссылка";
	Если ТекВидимость Тогда 
		НарядыНаВыполнениеРемонтныхРабот.ТекстЗапроса = НарядыНаВыполнениеРемонтныхРабот.ТекстЗапроса + "
		|ГДЕ
		// гкс+ [] Деснол 24.08.2022
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОбъектРемонта В (&ОбъектРемонта)";
		// гкс- [] Деснол 24.08.2022
	Иначе
		НарядыНаВыполнениеРемонтныхРабот.ТекстЗапроса = НарядыНаВыполнениеРемонтныхРабот.ТекстЗапроса + "
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПодчиненныеОР КАК ПодчиненныеОР
		|		ПО (ПодчиненныеОР.ОР = торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОбъектРемонта)
		|ГДЕ
		// гкс+ [] Деснол 24.08.2022
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОбъектРемонта В (&ОбъектРемонта) ИЛИ Не ПодчиненныеОР.ОР Есть Null";
		// гкс- [] Деснол 24.08.2022
	КонецЕсли;
	НарядыНаВыполнениеРемонтныхРабот.ТекстЗапроса = НарядыНаВыполнениеРемонтныхРабот.ТекстЗапроса + "
	                                                |	И ВЫБОР
	                                                |			КОГДА &ОтображатьТолькоПроведенные
	                                                |				ТОГДА торо_НарядНаВыполнениеРемонтныхРабот.Проведен
	                                                |			ИНАЧЕ ИСТИНА
	                                                |		КОНЕЦ
	                                                |
	                                                |УПОРЯДОЧИТЬ ПО
	                                                |	ОбъектРемонта";
	
	АктыПриемкиОборудования.ТекстЗапроса = АктыПриемкиОборудования.ТекстЗапроса +
	"ВЫБРАТЬ
	|	торо_АктПриемкиОборудованияРемонтыОборудования.Ссылка КАК Документ,
	|	торо_АктПриемкиОборудованияРемонтыОборудования.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	торо_АктПриемкиОборудованияРемонтыОборудования.ДатаНачала КАК ДатаНачала,
	|	торо_АктПриемкиОборудованияРемонтыОборудования.ДатаОкончания КАК ДатаОкончания,
	|	ВЫБОР
	|		КОГДА НЕ торо_АктПриемкиОборудования.ПометкаУдаления
	|			ТОГДА ВЫБОР
	|					КОГДА торо_АктПриемкиОборудования.Проведен
	|						ТОГДА 1
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК ИндексКартинки,
	|	торо_АктПриемкиОборудованияРемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта
	|{ВЫБРАТЬ
	|	ОбъектРемонта.*}
	|ИЗ
	|	Документ.торо_АктПриемкиОборудования.РемонтыОборудования КАК торо_АктПриемкиОборудованияРемонтыОборудования
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_АктПриемкиОборудования КАК торо_АктПриемкиОборудования
	|		ПО торо_АктПриемкиОборудованияРемонтыОборудования.Ссылка = торо_АктПриемкиОборудования.Ссылка";
	Если ТекВидимость Тогда 
		АктыПриемкиОборудования.ТекстЗапроса = АктыПриемкиОборудования.ТекстЗапроса + "
		|ГДЕ
		// гкс+ [] Деснол 24.08.2022
		|	торо_АктПриемкиОборудованияРемонтыОборудования.ОбъектРемонта В (&ОбъектРемонта)";
		// гкс- [] Деснол 24.08.2022
	Иначе
		АктыПриемкиОборудования.ТекстЗапроса = АктыПриемкиОборудования.ТекстЗапроса + "
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПодчиненныеОР КАК ПодчиненныеОР
		|		ПО (ПодчиненныеОР.ОР = торо_АктПриемкиОборудованияРемонтыОборудования.ОбъектРемонта)
		|ГДЕ
		// гкс+ [] Деснол 24.08.2022
		|	торо_АктПриемкиОборудованияРемонтыОборудования.ОбъектРемонта В (&ОбъектРемонта) ИЛИ Не ПодчиненныеОР.ОР Есть Null";
		// гкс- [] Деснол 24.08.2022
	КонецЕсли;
	АктыПриемкиОборудования.ТекстЗапроса = АктыПриемкиОборудования.ТекстЗапроса + "
	
	|	И ВЫБОР
	|			КОГДА &ОтображатьТолькоПроведенные
	|				ТОГДА торо_АктПриемкиОборудования.Проведен
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|УПОРЯДОЧИТЬ ПО
	|	ОбъектРемонта";

	// гкс+ [10.22] Деснол 12.10.2022
	ПредстоящиеРегМероприятия.ТекстЗапроса = СтрЗаменить(ПредстоящиеРегМероприятия.ТекстЗапроса , "= &ОбъектРемонта", "В (&ОбъектРемонта)");
	НарядыНаРегМероприятия.ТекстЗапроса = СтрЗаменить(НарядыНаРегМероприятия.ТекстЗапроса , "= &ОбъектРемонта", "В (&ОбъектРемонта)");
	ВыполненныеРегМероприятия.ТекстЗапроса = СтрЗаменить(ВыполненныеРегМероприятия.ТекстЗапроса , "= &ОбъектРемонта", "В (&ОбъектРемонта)");
	// гкс- [10.22] Деснол 12.10.2022
КонецПроцедуры

&НаКлиенте
Процедура ГарантииОбъектаРемонта_ПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если Объект.ТипОбъекта = торо_ОбщегоНазначенияКлиентПовтИсп.ПолучитьПеречисление("торо_ТипыОбъектовRCM",
			"ФункциональноеМесто") Тогда 
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТиповойСостав_Добавить(Команда)
	ОписаниеОповещенияПослеВыбора = Новый ОписаниеОповещения("ТиповойСостав_ДобавитьПослеВыбора", ЭтотОбъект);
	ОткрытьФорму("Справочник.торо_ТиповыеОР.ФормаВыбора", Новый Структура("МножественныйВыбор", Ложь),,,,,
		ОписаниеОповещенияПослеВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ТиповойСостав_ДобавитьПослеВыбора(Результат,ДопПараметры)Экспорт
	Если ЗначениеЗаполнено(Результат) Тогда 
		Если ТипЗнч(Результат) = Тип("СправочникСсылка.торо_ТиповыеОР") Тогда 
			НоваяСтрока = ЭтотОбъект["ТиповойСостав"].Добавить();
			НоваяСтрока.ТОР = Результат;
		Иначе
			Для Каждого СтрокаМассива Из Результат Цикл
				НоваяСтрока = ЭтотОбъект["ТиповойСостав"].Добавить();
				НоваяСтрока.ТОР = СтрокаМассива;
			КонецЦикла;
		КонецЕсли;
		ЭтотОбъект["МодифицированностьСостава"] = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТиповойСостав_Удалить(Команда)
	ТекДанные = Элементы["ТиповойСостав"].ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		ЭтотОбъект["ТиповойСостав"].Удалить(ТекДанные);
		ЭтотОбъект["МодифицированностьСостава"] = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТиповойСостав_Проставить(Команда)
	ТиповойСостав_ПроставитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТиповойСостав_ПроставитьНаСервере()
	Если ЗначениеЗаполнено(Объект.Ссылка)= Ложь Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Необходимо записать объект";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	ТЧ = Новый ТаблицаЗначений();
	ТЧ.Колонки.Добавить("ТОР",Новый ОписаниеТипов("СправочникСсылка.торо_ТиповыеОР"));
	Для Каждого СтрокаТаблицы ИЗ ЭтотОбъект["ТиповойСостав"] Цикл
		НоваяСтрока = ТЧ.Добавить();
		НоваяСтрока.ТОР = СтрокаТаблицы.ТОР;
	КонецЦикла;
	
	ЭтотОбъект["ТиповойСостав"].Очистить();
	ЭтотОбъект["НераспределенныйСостав"].Очистить();
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧ.ТОР КАК ТОР
		|ПОМЕСТИТЬ Исходная
		|ИЗ
		|	&ТЧ КАК ТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ИерархическиеСтруктурыОР.ОбъектИерархии КАК ОбъектРемонта,
		|	торо_ИерархическиеСтруктурыОР.ОбъектИерархии.ТиповойОР КАК ТипОборудования,
		|	торо_ИерархическиеСтруктурыОР.ОбъектИерархии.ТиповойОР.Родитель КАК ТОРРодитель
		|ПОМЕСТИТЬ Оры
		|ИЗ
		|	РегистрСведений.торо_ИерархическиеСтруктурыОР КАК торо_ИерархическиеСтруктурыОР
		|ГДЕ
		|	торо_ИерархическиеСтруктурыОР.РодительИерархии = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.ОбъектИерархии,
		|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.ОбъектИерархии.ТиповойОР,
		|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.ОбъектИерархии.ТиповойОР.Родитель
		|ИЗ
		|	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних КАК торо_РасположениеОРВСтруктуреИерархииСрезПоследних
		|ГДЕ
		|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.РодительИерархии = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Исходная.ТОР КАК ТОР
		|ПОМЕСТИТЬ УникальныеТОР
		|ИЗ
		|	Исходная КАК Исходная
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	УникальныеТОР.ТОР КАК ТОР,
		|	Оры.ОбъектРемонта КАК ОР,
		|	Оры.ОбъектРемонта.ДатаВыпуска КАК ОРДатаУстановки,
		|	Оры.ОбъектРемонта.ДатаВводаВЭксплуатацию КАК ОРДатаВвода,
		|	Оры.ОбъектРемонта.ЗаводскойНомер КАК ОРЗаводской,
		|	Оры.ОбъектРемонта.ИнвентарныйНомер КАК ОРИнвентарный,
		|	ВЫБОР
		|		КОГДА УникальныеТОР.ТОР = Оры.ОбъектРемонта
		|			ТОГДА 1
		|		КОГДА Оры.ТОРРодитель = УникальныеТОР.ТОР
		|			ТОГДА 2
		|		ИНАЧЕ 3
		|	КОНЕЦ КАК Приоритет
		|ИЗ
		|	УникальныеТОР КАК УникальныеТОР
		|		ЛЕВОЕ СОЕДИНЕНИЕ Оры КАК Оры
		|		ПО УникальныеТОР.ТОР = Оры.ТипОборудования
		|			ИЛИ УникальныеТОР.ТОР = Оры.ТОРРодитель
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет
		|ИТОГИ ПО
		|	ТОР
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ Различные
		|	Оры.ОбъектРемонта КАК ОР,
		|	Оры.ТипОборудования КАК ТОР
		|ИЗ
		|	Оры КАК Оры
		|		ЛЕВОЕ СОЕДИНЕНИЕ УникальныеТОР КАК УникальныеТОР
		|		ПО Оры.ТипОборудования = УникальныеТОР.ТОР
		|			ИЛИ Оры.ТОРРодитель = УникальныеТОР.ТОР
		|ГДЕ
		|	УникальныеТОР.ТОР ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("ТЧ", ТЧ);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка1 = РезультатЗапроса[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	РазличныеОР = Новый Массив();
	НомерПП = 1;
	Пока Выборка1.Следующий() Цикл
		ЭтоПервый = Истина;
		Выборка = Выборка1.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка.ОР) Тогда 
				Если РазличныеОР.Найти(Выборка.ОР) = Неопределено Тогда 
					РазличныеОР.Добавить(Выборка.ОР);
				Иначе
					Продолжить;
				КонецЕсли;
				НоваяСтрока = ЭтотОбъект["ТиповойСостав"].Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);				
				НоваяСтрока.НомерПП = НомерПП;
				НомерПП = НомерПП + 1;
				ЭтоПервый = Ложь;
			КонецЕсли;
		КонецЦикла;
		Если ЭтоПервый Тогда 
			НоваяСтрока = ЭтотОбъект["ТиповойСостав"].Добавить();
			НоваяСтрока.ТОР = Выборка1.ТОР;
			НоваяСтрока.НомерПП = НомерПП;
			НомерПП = НомерПП + 1;
		КонецЕсли;
	КонецЦикла;
	
	Выборка = РезультатЗапроса[4].Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ЭтотОбъект["НераспределенныйСостав"].Добавить();
		НоваяСтрока.ТОР = Выборка.ТОР;
		НоваяСтрока.ОР = Выборка.ОР;
	КонецЦикла;
	
	ЭтотОбъект["МодифицированностьСостава"] = Истина;
КонецПроцедуры

&НаСервере
Процедура ТиповойСостав_Записать()
	Если ЗначениеЗаполнено(Объект.Ссылка)= Ложь Тогда 
		Возврат;
	КонецЕсли;
	НаборЗаписей = РегистрыСведений.торо_ТиповойСоставФункциональныхМест.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ФункциональноеМесто.Установить(Объект.Ссылка);
	НаборЗаписей.Записать();
	
	НаборЗаписей = РегистрыСведений.торо_СоставФункциональныхМест.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ФункциональноеМесто.Установить(Объект.Ссылка);
	НаборЗаписей.Записать();
		
	//
	ТЧ = Новый ТаблицаЗначений();
	ТЧ.Колонки.Добавить("ТОР",Новый ОписаниеТипов("СправочникСсылка.торо_ТиповыеОР"));
	ТЧ.Колонки.Добавить("ОР",Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта"));
	Для Каждого СтрокаТаблицы ИЗ ЭтотОбъект["ТиповойСостав"] Цикл
		НоваяСтрока = ТЧ.Добавить();
		НоваяСтрока.ТОР = СтрокаТаблицы.ТОР;
		НоваяСтрока.ОР = СтрокаТаблицы.ОР;
	КонецЦикла;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧ.ТОР КАК ТОР,
		|	ТЧ.ОР КАК ОР
		|ПОМЕСТИТЬ Исходная
		|ИЗ
		|	&ТЧ КАК ТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Исходная.ТОР КАК ТОР,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Исходная.ОР) КАК Количество
		|ИЗ
		|	Исходная КАК Исходная
		|
		|СГРУППИРОВАТЬ ПО
		|	Исходная.ТОР
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Исходная.ОР КАК ОР,
		|	Исходная.ТОР КАК ТОР
		|ИЗ
		|	Исходная КАК Исходная
		|ГДЕ
		|	НЕ Исходная.ОР = ЗНАЧЕНИЕ(Справочник.торо_ОбъектыРемонта.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("ТЧ", ТЧ);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Выборка = РезультатЗапроса[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.торо_ТиповойСоставФункциональныхМест.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ФункциональноеМесто.Установить(Объект.Ссылка);
		НаборЗаписей.Отбор.ТипОборудования.Установить(Выборка.ТОР);
		НоваяСтрока = НаборЗаписей.Добавить();
		НоваяСтрока.ФункциональноеМесто = Объект.Ссылка;
		НоваяСтрока.ТипОборудования = Выборка.ТОР;
		НоваяСтрока.Количество = Выборка.Количество;
		НаборЗаписей.Записать();
	КонецЦикла;
	
	Выборка = РезультатЗапроса[2].Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.торо_СоставФункциональныхМест.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ФункциональноеМесто.Установить(Объект.Ссылка);
		НаборЗаписей.Отбор.ТипОборудования.Установить(Выборка.ТОР);
		НаборЗаписей.Отбор.ОбъектРемонта.Установить(Выборка.ОР);
		НоваяСтрока = НаборЗаписей.Добавить();
		НоваяСтрока.ФункциональноеМесто = Объект.Ссылка;
		НоваяСтрока.ТипОборудования = Выборка.ТОР;
		НоваяСтрока.ОбъектРемонта = Выборка.ОР;
		НаборЗаписей.Записать();
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ТиповойСостав_Загрузить()
	Если ЗначениеЗаполнено(Объект.Ссылка)= Ложь Тогда 
		Возврат;
	КонецЕсли;
	ЭтотОбъект["ТиповойСостав"].Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ИерархическиеСтруктурыОР.ОбъектИерархии КАК ОбъектРемонта,
		|	торо_ИерархическиеСтруктурыОР.ОбъектИерархии.ТиповойОР КАК ТипОборудования
		|ПОМЕСТИТЬ Оры
		|ИЗ
		|	РегистрСведений.торо_ИерархическиеСтруктурыОР КАК торо_ИерархическиеСтруктурыОР
		|ГДЕ
		|	торо_ИерархическиеСтруктурыОР.РодительИерархии = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.ОбъектИерархии,
		|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.ОбъектИерархии.ТиповойОР
		|ИЗ
		|	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних КАК торо_РасположениеОРВСтруктуреИерархииСрезПоследних
		|ГДЕ
		|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.РодительИерархии = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_ТиповойСоставФункциональныхМест.ТипОборудования КАК ТОР,
		|	торо_СоставФункциональныхМест.ОбъектРемонта КАК ОР,
		|	торо_СоставФункциональныхМест.ОбъектРемонта.ДатаВводаВЭксплуатацию КАК ОРДатаВвода,
		|	торо_СоставФункциональныхМест.ОбъектРемонта.ДатаВыпуска КАК ОРДатаУстановки,
		|	торо_СоставФункциональныхМест.ОбъектРемонта.ЗаводскойНомер КАК ОРЗаводской,
		|	торо_СоставФункциональныхМест.ОбъектРемонта.ИнвентарныйНомер КАК ОРИнвентарный
		|ПОМЕСТИТЬ Состав
		|ИЗ
		|	РегистрСведений.торо_ТиповойСоставФункциональныхМест КАК торо_ТиповойСоставФункциональныхМест
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_СоставФункциональныхМест КАК торо_СоставФункциональныхМест
		|		ПО торо_ТиповойСоставФункциональныхМест.ФункциональноеМесто = торо_СоставФункциональныхМест.ФункциональноеМесто
		|			И торо_ТиповойСоставФункциональныхМест.ТипОборудования = торо_СоставФункциональныхМест.ТипОборудования
		|ГДЕ
		|	торо_ТиповойСоставФункциональныхМест.ФункциональноеМесто = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ Различные
		|	Состав.ТОР КАК ТОР,
		|	Состав.ОР КАК ОР,
		|	Состав.ОРДатаВвода КАК ОРДатаВвода,
		|	Состав.ОРДатаУстановки КАК ОРДатаУстановки,
		|	Состав.ОРЗаводской КАК ОРЗаводской,
		|	Состав.ОРИнвентарный КАК ОРИнвентарный
		|ИЗ
		|	Состав КАК Состав
		|ИТОГИ ПО
		|	ТОР
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ  Различные
		|	Оры.ОбъектРемонта КАК ОР,
		|	Оры.ТипОборудования КАК ТОР
		|ИЗ
		|	Оры КАК Оры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Состав КАК Состав
		|		ПО Оры.ОбъектРемонта = Состав.ОР
		|ГДЕ
		|	Состав.ОР ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка1 = РезультатЗапроса[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	НомерПП = 1;
	Пока Выборка1.Следующий() Цикл
		ЭтоПервый = Истина;
		Выборка = Выборка1.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка.ОР) Тогда 
				НоваяСтрока = ЭтотОбъект["ТиповойСостав"].Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);				
				НоваяСтрока.НомерПП = НомерПП;
				НомерПП = НомерПП + 1;
				ЭтоПервый = Ложь;
			КонецЕсли;
		КонецЦикла;
		Если ЭтоПервый Тогда 
			НоваяСтрока = ЭтотОбъект["ТиповойСостав"].Добавить();
			НоваяСтрока.ТОР = Выборка1.ТОР;
			НоваяСтрока.НомерПП = НомерПП;
			НомерПП = НомерПП + 1;
		КонецЕсли;
	КонецЦикла;
	
	Выборка = РезультатЗапроса[3].Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ЭтотОбъект["НераспределенныйСостав"].Добавить();
		НоваяСтрока.ТОР = Выборка.ТОР;
		НоваяСтрока.ОР = Выборка.ОР;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура гкс_ТегПриИзменении(Элемент)
	МодифицированностьИзмеряемыхПоказателей = Истина;
	
	ТекДанные = Элементы.СписокИзмеряемыхПоказателей.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		ТекущийТег = ТекДанные.гкс_Тег;
		НовыйТекст = "";
		Если ЕстьЗапрещенныеСимволы(ТекущийТег, , НовыйТекст) Тогда 
			ТекДанные.гкс_Тег = НовыйТекст;
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru='Для тега можно использовать только латинские символы и цифры'");
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура гкс_Тег1ПриИзменении(Элемент)
	МодифицированностьПараметровНаработки = Истина;
	
	ТекДанные = Элементы.СписокПараметровНаработки.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		ТекущийТег = ТекДанные.гкс_Тег;
		НовыйТекст = "";
		Если ЕстьЗапрещенныеСимволы(ТекущийТег, , НовыйТекст) Тогда 
			ТекДанные.гкс_Тег = НовыйТекст;
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru='Для тега можно использовать только латинские символы и цифры'");
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ЕстьЗапрещенныеСимволы(Текст, Маска = "абвгдеёжзийклмнопрстуфхьъычцшщэюяАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЬЪЫЧЦШЩЭЮЯ", НовоеЗначение)
	НовоеЗначение = "";
	ЕстьОшибка = Ложь;
	МаскаЗамены = "f,dult`;pbqrkvyjghcnea[m]sxwio'.zF<DULT~:PBQRKVYJGHCNEA{M}SXWIO"">Z";
	Для Счетчик = 1 По СтрДлина(Текст) Цикл
		ТекБуква = Сред(Текст, Счетчик, 1);
		СимволВМаске = СтрНайти(Маска, ТекБуква);
		Если СимволВМаске = 0 Тогда 
			НовоеЗначение = НовоеЗначение + ТекБуква;
		Иначе
			ЕстьОшибка = Истина;
			НовоеЗначение = НовоеЗначение + Сред(МаскаЗамены, СимволВМаске, 1);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЕстьОшибка;
КонецФункции

#КонецОбласти

#Область ТехнологическоеМесто

&НаКлиенте
Процедура гкс_ТМОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	//
	Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Необходимо записать объект!';en='Need to record an object!'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект["гкс_ТМ"]) = Ложь Тогда 
		ЭтотОбъект["гкс_ТМ"] = СоздатьТМ(Объект.Ссылка);
		// гкс+ [04.23] Деснол 14.04.2023
	//ИначеЕсли НЕ Объект.ТипОбъекта = торо_ОбщегоНазначенияПовтИсп.ПолучитьПеречисление("торо_ТипыОбъектовRCM", "ФункциональноеМесто") Тогда 
		//Возврат;
		// гкс- [04.23] Деснол 14.04.2023
	КонецЕсли;
	ОписаниеОповещенияПослеОткрытия = Новый ОписаниеОповещения("гкс_ТМПослеОткрытия", ЭтотОбъект);
	ОткрытьФорму("Справочник.гкс_ТехническиеМеста.ФормаОбъекта",Новый Структура("Ключ", ЭтотОбъект["гкс_ТМ"]),,,,,
		ОписаниеОповещенияПослеОткрытия, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
&НаКлиенте
Процедура гкс_ТМФМОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	//
	Если ЗначениеЗаполнено(ЭтотОбъект["гкс_ТМФМ"]) = Ложь Тогда 
		Возврат;
	КонецЕсли;
	ОписаниеОповещенияПослеОткрытия = Новый ОписаниеОповещения("гкс_ТМПослеОткрытия", ЭтотОбъект);
	ОткрытьФорму("Справочник.гкс_ТехническиеМеста.ФормаОбъекта", Новый Структура("Ключ,ТолькоПросмотр",
		ЭтотОбъект["гкс_ТМФМ"], Истина),,,,, ОписаниеОповещенияПослеОткрытия,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
&НаКлиенте
Процедура гкс_ТМПослеОткрытия(Результат, ДопПараметры)Экспорт
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьТМ(Ссылка)
	ОбъектТехническоеМесто = Справочники.гкс_ТехническиеМеста.СоздатьЭлемент();
	ОбъектТехническоеМесто.Наименование = Ссылка;
	ОбъектТехническоеМесто.Записать();
	
	НаборЗаписейРегистрагкс_ТекущиеФМОР = РегистрыСведений.гкс_ТекущиеФМОР.СоздатьНаборЗаписей();
	НаборЗаписейРегистрагкс_ТекущиеФМОР.Отбор.ОР.Установить(Ссылка);
	НоваяСтрокаНабораЗаписей = НаборЗаписейРегистрагкс_ТекущиеФМОР.Добавить();
	НоваяСтрокаНабораЗаписей.ОР = Ссылка;
	НоваяСтрокаНабораЗаписей.ФМ = Ссылка;
	НоваяСтрокаНабораЗаписей.ТМ = ОбъектТехническоеМесто.Ссылка;
	НоваяСтрокаНабораЗаписей.ТМФМ = ОбъектТехническоеМесто.Ссылка;
	НаборЗаписейРегистрагкс_ТекущиеФМОР.Записать();
	
	гкс_ПроверкаФункциональныхМест.ПроецироватьТКНаПодчиненных(Ссылка);
	//
	Возврат ОбъектТехническоеМесто.Ссылка;
КонецФункции
&НаСервереБезКонтекста
Функция НайтиФМ(Ссылка)
	ПоследняяСсылка = Ссылка;
	Иерархия = Константы.торо_ИерархияДляВводаНовыхОР.Получить();
	Запрос = Новый Запрос;
	Пока ЗначениеЗаполнено(ПоследняяСсылка) Цикл
		Если Иерархия.ИзменяетсяДокументами = истина Тогда 
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	РегистрОР.РодительИерархии КАК РодительИерархии,
				|	РегистрОР.РодительИерархии.ТипОбъекта = &ТипФМ КАК ТипОбъекта,
				|	1 КАК Приоритет
				|ПОМЕСТИТЬ Уровень1
				|ИЗ
				|	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(
				|			,
				|			ОбъектИерархии = &Ссылка
				|				И СтруктураИерархии = &Иерархия) КАК РегистрОР
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	РегистрОР.РодительИерархии КАК РодительИерархии,
				|	РегистрОР.РодительИерархии.ТипОбъекта = &ТипФМ КАК ТипОбъекта,
				|	2 КАК Приоритет
				|ПОМЕСТИТЬ Уровень2
				|ИЗ
				|	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(
				|			,
				|			ОбъектИерархии В
				|					(ВЫБРАТЬ
				|						ТЧ.РодительИерархии
				|					ИЗ
				|						Уровень1 КАК ТЧ)
				|				И СтруктураИерархии = &Иерархия) КАК РегистрОР
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	РегистрОР.РодительИерархии КАК РодительИерархии,
				|	РегистрОР.РодительИерархии.ТипОбъекта = &ТипФМ КАК ТипОбъекта,
				|	3 КАК Приоритет
				|ПОМЕСТИТЬ Уровень3
				|ИЗ
				|	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(
				|			,
				|			ОбъектИерархии В
				|					(ВЫБРАТЬ
				|						ТЧ.РодительИерархии
				|					ИЗ
				|						Уровень2 КАК ТЧ)
				|				И СтруктураИерархии = &Иерархия) КАК РегистрОР";
		Иначе
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	РегистрОР.РодительИерархии КАК РодительИерархии,
				|	РегистрОР.РодительИерархии.ТипОбъекта = &ТипФМ КАК ТипОбъекта,
				|	1 КАК Приоритет
				|ПОМЕСТИТЬ Уровень1
				|ИЗ
				|	РегистрСведений.торо_ИерархическиеСтруктурыОР КАК РегистрОР
				|ГДЕ
				|	РегистрОР.ОбъектИерархии = &Ссылка
				|	И РегистрОР.СтруктураИерархии = &Иерархия
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	РегистрОР.РодительИерархии КАК РодительИерархии,
				|	РегистрОР.РодительИерархии.ТипОбъекта = &ТипФМ КАК ТипОбъекта,
				|	2 КАК Приоритет
				|ПОМЕСТИТЬ Уровень2
				|ИЗ
				|	Уровень1 КАК Уровень1
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИерархическиеСтруктурыОР КАК РегистрОР
				|		ПО Уровень1.РодительИерархии = РегистрОР.ОбъектИерархии
				|			И (РегистрОР.СтруктураИерархии = &Иерархия)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	РегистрОР.РодительИерархии КАК РодительИерархии,
				|	РегистрОР.РодительИерархии.ТипОбъекта = &ТипФМ КАК ТипОбъекта,
				|	3 КАК Приоритет
				|ПОМЕСТИТЬ Уровень3
				|ИЗ
				|	Уровень2 КАК Уровень1
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИерархическиеСтруктурыОР КАК РегистрОР
				|		ПО Уровень1.РодительИерархии = РегистрОР.ОбъектИерархии
				|			И (РегистрОР.СтруктураИерархии = &Иерархия)";
		КонецЕсли;
		//
		Запрос.Текст = Запрос.Текст + "
		| ;  "+"ВЫБРАТЬ
		       |	Уровень1.РодительИерархии КАК РодительИерархии,
		       |	Уровень1.ТипОбъекта КАК ТипОбъекта,
		       |	Уровень1.Приоритет КАК Приоритет
		       |ПОМЕСТИТЬ ВсеРодители
		       |ИЗ
		       |	Уровень1 КАК Уровень1
		       |
		       |ОБЪЕДИНИТЬ ВСЕ
		       |
		       |ВЫБРАТЬ
		       |	Уровень2.РодительИерархии,
		       |	Уровень2.ТипОбъекта,
		       |	Уровень2.Приоритет
		       |ИЗ
		       |	Уровень2 КАК Уровень2
		       |
		       |ОБЪЕДИНИТЬ ВСЕ
		       |
		       |ВЫБРАТЬ
		       |	Уровень3.РодительИерархии,
		       |	Уровень3.ТипОбъекта,
		       |	Уровень3.Приоритет
		       |ИЗ
		       |	Уровень3 КАК Уровень3
		       |;
		       |
		       |////////////////////////////////////////////////////////////////////////////////
		       |ВЫБРАТЬ
		       |	ВсеРодители.РодительИерархии КАК РодительИерархии,
		       |	ВсеРодители.ТипОбъекта КАК ТипОбъекта,
		       |	ВсеРодители.Приоритет КАК Приоритет
		       |ИЗ
		       |	ВсеРодители КАК ВсеРодители
		       |
		       |УПОРЯДОЧИТЬ ПО
		       |	Приоритет";
		//
		Запрос.УстановитьПараметр("Иерархия", Иерархия);
		Запрос.УстановитьПараметр("Ссылка", ПоследняяСсылка);
		Запрос.УстановитьПараметр("ТипФМ", Перечисления.торо_ТипыОбъектовRCM.ФункциональноеМесто);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		ПоследняяСсылка = Неопределено;
		Пока Выборка.Следующий() Цикл
			ПоследняяСсылка = Выборка.РодительИерархии;
			Если Выборка.ТипОбъекта Тогда 
				ПоследняяСсылка = Неопределено;
				Возврат Выборка.РодительИерархии;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции
&НаСервереБезКонтекста
Процедура НайтиТМ(Ссылка, ТехническоеМесто, ТехническоеМестоФункциональногоМеста, ТипОбъекта)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	гкс_ТекущиеФМОР.ФМ КАК ФМ,
		|	гкс_ТекущиеФМОР.ТМ КАК ТМ,
		|	гкс_ТекущиеФМОР.ТМФМ КАК ТМФМ
		|ИЗ
		|	РегистрСведений.гкс_ТекущиеФМОР КАК гкс_ТекущиеФМОР
		|ГДЕ
		|	гкс_ТекущиеФМОР.ОР = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		// Если записи нет совсем
		Если ТипОбъекта = Перечисления.торо_ТипыОбъектовRCM.ФункциональноеМесто Тогда
			НаборЗаписейРегистрагкс_ТекущиеФМОР = РегистрыСведений.гкс_ТекущиеФМОР.СоздатьНаборЗаписей();
			НаборЗаписейРегистрагкс_ТекущиеФМОР.Отбор.ОР.Установить(Ссылка);
			НоваяСтрокаНабораЗаписей = НаборЗаписейРегистрагкс_ТекущиеФМОР.Добавить();
			НоваяСтрокаНабораЗаписей.ОР = Ссылка;
			НоваяСтрокаНабораЗаписей.ФМ = Ссылка;
			НоваяСтрокаНабораЗаписей.ТМ = Неопределено;
			НоваяСтрокаНабораЗаписей.ТМФМ = Неопределено;
			НаборЗаписейРегистрагкс_ТекущиеФМОР.Записать();
		Иначе
			ТекущееФункциональноеМесто = гкс_ПроверкаФункциональныхМест.НайтиФМ(Ссылка);
			Если ЗначениеЗаполнено(ТекущееФункциональноеМесто) Тогда
				// Запись должна быть если есть ФМ
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	гкс_ТекущиеФМОР.ФМ КАК ФМ,
					|	гкс_ТекущиеФМОР.ТМ КАК ТМ,
					|	гкс_ТекущиеФМОР.ТМФМ КАК ТМФМ
					|ИЗ
					|	РегистрСведений.гкс_ТекущиеФМОР КАК гкс_ТекущиеФМОР
					|ГДЕ
					|	гкс_ТекущиеФМОР.ОР = &Ссылка";
				Запрос.УстановитьПараметр("Ссылка", ТекущееФункциональноеМесто);
				РезультатЗапроса = Запрос.Выполнить();
				Если РезультатЗапроса.Пустой() = Ложь Тогда 
					Выборка = РезультатЗапроса.Выбрать();
					Выборка.Следующий();
					//
					ТехническоеМестоФункциональногоМеста = Выборка.ТМ;
					НаборЗаписейРегистрагкс_ТекущиеФМОР = РегистрыСведений.гкс_ТекущиеФМОР.СоздатьНаборЗаписей();
					НаборЗаписейРегистрагкс_ТекущиеФМОР.Отбор.ОР.Установить(Ссылка);
					НоваяСтрокаНабораЗаписей = НаборЗаписейРегистрагкс_ТекущиеФМОР.Добавить();
					НоваяСтрокаНабораЗаписей.ОР = Ссылка;
					НоваяСтрокаНабораЗаписей.ФМ = Выборка.ФМ;
					НоваяСтрокаНабораЗаписей.ТМ = Неопределено;
					НоваяСтрокаНабораЗаписей.ТМФМ = Выборка.ТМ;
					НаборЗаписейРегистрагкс_ТекущиеФМОР.Записать();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ТехническоеМесто = Выборка.ТМ;
			ТехническоеМестоФункциональногоМеста = Выборка.ТМФМ;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ДеревоОграничений

&НаСервере
Процедура ЗаполнитьДеревоОграничений()

	Корень = ЭтотОбъект["ТаблицаОграничений"].ПолучитьЭлементы();
	Корень.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ОграниченияНаХарактеристикиОборудования.Иерархия КАК ТекИерархия,
		|	торо_ОграниченияНаХарактеристикиОборудования.Ограничение КАК Ограничение,
		|	ИСТИНА КАК Собственное,
		|	торо_ОграниченияНаХарактеристикиОборудования.гкс_Удален КАК гкс_Удален
		|ПОМЕСТИТЬ ВсеНужные
		|ИЗ
		|	РегистрСведений.торо_ОграниченияНаХарактеристикиОборудования КАК торо_ОграниченияНаХарактеристикиОборудования
		|ГДЕ
		|	торо_ОграниченияНаХарактеристикиОборудования.ФункциональноеМесто = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_ТиповыеОРОграниченияНаХарактеристикиОборудования.Иерархия,
		|	торо_ТиповыеОРОграниченияНаХарактеристикиОборудования.Ограничение,
		|	ЛОЖЬ,
		|	ЛОЖЬ
		|ИЗ
		|	Справочник.торо_ТиповыеОР.ОграниченияНаХарактеристикиОборудования КАК торо_ТиповыеОРОграниченияНаХарактеристикиОборудования
		|ГДЕ
		|	торо_ТиповыеОРОграниченияНаХарактеристикиОборудования.Ссылка = &ТОР
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсеНужные.ТекИерархия КАК ТекИерархия,
		|	ВсеНужные.Ограничение КАК Ограничение,
		|	МАКСИМУМ(ВсеНужные.Собственное) КАК Собственное,
		|	МАКСИМУМ(ВсеНужные.гкс_Удален) КАК гкс_Удален
		|ИЗ
		|	ВсеНужные КАК ВсеНужные
		|
		|СГРУППИРОВАТЬ ПО
		|	ВсеНужные.ТекИерархия,
		|	ВсеНужные.Ограничение
		|ИТОГИ ПО
		|	ТекИерархия";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("ТОР", Объект.ТиповойОР);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() = Ложь Тогда 
		Выборка1 = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Выборка1.Следующий() Цикл
			НоваяСтрока = Корень.Добавить();
			НоваяСтрока.Иерархия = Выборка1.ТекИерархия;
			Ветвь = НоваяСтрока.ПолучитьЭлементы();
			
			Выборка = Выборка1.Выбрать();
			Пока Выборка.Следующий() Цикл
				НоваяСтрока1 = Ветвь.Добавить();
				НоваяСтрока1.Иерархия = Выборка1.ТекИерархия;
				НоваяСтрока1.Ограничение = Выборка.Ограничение;
				НоваяСтрока1.Собственное = Выборка.Собственное;
				НоваяСтрока1.гкс_Удален = Выборка.гкс_Удален;
				Если НоваяСтрока1.гкс_Удален Тогда 
					НоваяСтрока1.Собственное = Ложь;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДеревоОграничений()
	Если Объект.ТипОбъекта = Перечисления.торо_ТипыОбъектовRCM.ФункциональноеМесто Тогда 
		Корень = ЭтотОбъект["ТаблицаОграничений"].ПолучитьЭлементы();
		Для Каждого СтрокаКорня Из Корень Цикл
			Ветвь = СтрокаКорня.ПолучитьЭлементы();
			Для Каждого СтрокаВетви Из Ветвь Цикл
				Если СтрокаВетви.Собственное Или СтрокаВетви.гкс_Удален Тогда 
					НаборЗаписейРегистраторо_ОграниченияНаХарактеристикиОборудования = 
						РегистрыСведений.торо_ОграниченияНаХарактеристикиОборудования.СоздатьНаборЗаписей();
					НаборЗаписейРегистраторо_ОграниченияНаХарактеристикиОборудования.Отбор.Иерархия.Установить(СтрокаКорня.Иерархия);
					НаборЗаписейРегистраторо_ОграниченияНаХарактеристикиОборудования.Отбор.Ограничение.Установить(СтрокаВетви.Ограничение);
					НаборЗаписейРегистраторо_ОграниченияНаХарактеристикиОборудования.Отбор.ФункциональноеМесто.Установить(Объект.Ссылка);
					НоваяСтрокаНабораЗаписей = НаборЗаписейРегистраторо_ОграниченияНаХарактеристикиОборудования.Добавить();
					НоваяСтрокаНабораЗаписей.Иерархия = СтрокаКорня.Иерархия;
					НоваяСтрокаНабораЗаписей.Ограничение = СтрокаВетви.Ограничение;
					НоваяСтрокаНабораЗаписей.ФункциональноеМесто = Объект.Ссылка;
					НоваяСтрокаНабораЗаписей.гкс_Удален = СтрокаВетви.гкс_Удален;
					НаборЗаписейРегистраторо_ОграниченияНаХарактеристикиОборудования.Записать();
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		НаборЗаписейРегистраторо_ОбъектыДляПроверкиТребованийФМ = РегистрыСведений.торо_ОбъектыДляПроверкиТребованийФМ.СоздатьНаборЗаписей();
		НаборЗаписейРегистраторо_ОбъектыДляПроверкиТребованийФМ.Отбор.Объект.Установить(Объект.Ссылка);
		НоваяСтрокаНабораЗаписей = НаборЗаписейРегистраторо_ОбъектыДляПроверкиТребованийФМ.Добавить();
		НоваяСтрокаНабораЗаписей.Объект = Объект.Ссылка;
		НоваяСтрокаНабораЗаписей.Период = ТекущаяДата();
		НаборЗаписейРегистраторо_ОбъектыДляПроверкиТребованийФМ.Записать();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Ограничения_Ограничение_ПриИзменении(Элемент)
	ЭтотОбъект["МодифицированностьОграничений"] = Истина;
	Модифицированность = Истина;
КонецПроцедуры

// Гкс+[TOIR20-222] Селимов от 02.02.2021. Добавлено:{
&НаКлиенте
Процедура Подключаемый_гкс_ОсновноеСредство_ПриИзменении(Элемент)
	
	Объект.ИнвентарныйНомер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.гкс_ОсновноеСредство, "Код");
	
КонецПроцедуры // } Гкс-[TOIR20-222] 

&НаКлиенте
Процедура ТаблицаОграничений_ПередУдалением(Элемент, Отказ)
	ТекДанные = Элементы["ТаблицаОграничений"].ТекущиеДанные;
	Если Не ТекДанные = Неопределено И ТекДанные.Собственное = Ложь Тогда 
		ТекДанные.гкс_Удален = Не ТекДанные.гкс_Удален;
		ЭтотОбъект["МодифицированностьОграничений"] = Истина;
		Модифицированность = Истина;
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ЭтотОбъект["МодифицированностьОграничений"] = Истина;
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОграничений_ПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Ограничения_Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекДанные = Элементы["ТаблицаОграничений"].ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		Если ЗначениеЗаполнено(ТекДанные.Ограничение) Тогда 
			ПоказатьЗначение(, ТекДанные.Ограничение);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Ограничения_ДобавитьИерархию(Команда)
	СтруктураОпОп = Новый Структура("МножественныйВыбор",Ложь);
	ОписаниеОповещенияПослеДобавления = Новый ОписаниеОповещения("Ограничения_ПослеВыбораИерархии", ЭтотОбъект);
	ОткрытьФорму("Справочник.торо_СтруктурыОР.ФормаВыбора", СтруктураОпОп,,,,,
		ОписаниеОповещенияПослеДобавления, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура Ограничения_ДобавитьОграничение(Команда)
	ТекДанные = Элементы["ТаблицаОграничений"].ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		СтруктураОпОп = Новый Структура("Иерархия", ТекДанные.Иерархия);
		ОписаниеОповещенияПослеДобавления = Новый ОписаниеОповещения("Ограничения_ПослеВыбораОграничения",
			ЭтотОбъект, СтруктураОпОп);
		ОткрытьФорму("Справочник.торо_ОграниченияНаХарактеристикиОбрудования.ФормаВыбора",
			Новый Структура("МножественныйВыбор", Ложь),,,,,
			ОписаниеОповещенияПослеДобавления, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Ограничения_ДобавитьОграничениеВсем(Команда)
	
	СтруктураОпОп = Новый Структура("Иерархия",Неопределено);
	ОписаниеОповещенияПослеДобавления = Новый ОписаниеОповещения("Ограничения_ПослеВыбораОграничения",
		ЭтотОбъект, СтруктураОпОп);
	ОткрытьФорму("Справочник.торо_ОграниченияНаХарактеристикиОбрудования.ФормаВыбора",
		Новый Структура("МножественныйВыбор", Ложь),,,,,
		ОписаниеОповещенияПослеДобавления, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура Ограничения_ПослеВыбораИерархии(Результат, ДопПараметры)Экспорт
	Если ЗначениеЗаполнено(Результат) Тогда 
		Корень = ЭтотОбъект["ТаблицаОграничений"].ПолучитьЭлементы();
		Для Каждого СтрокаКорня Из Корень Цикл
			Если СтрокаКорня.Иерархия = Результат Тогда 
				Возврат;
			КонецЕсли;
		КонецЦикла;
		НоваяСтрокаКорня = Корень.Добавить();
		НоваяСтрокаКорня.Иерархия = Результат;
		
		ЭтотОбъект["МодифицированностьОграничений"] = Истина;
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Ограничения_ПослеВыбораОграничения(Результат, ДопПараметры)Экспорт
	Если ЗначениеЗаполнено(Результат) Тогда 
		
		Корень = ЭтотОбъект["ТаблицаОграничений"].ПолучитьЭлементы();
		Ветвь = Неопределено;
		Если ДопПараметры.Иерархия = Неопределено Тогда 
			
			Для Каждого СтрокаКорня Из Корень Цикл
				Если ЗначениеЗаполнено(СтрокаКорня.Иерархия)=Ложь Тогда 
					Ветвь = СтрокаКорня.ПолучитьЭлементы();
					Прервать;
				КонецЕсли;
			КонецЦикла;
		
			Если Ветвь = Неопределено Тогда 
				НоваяСтрокаКорня = Корень.Добавить();
				Ветвь = НоваяСтрокаКорня.ПолучитьЭлементы();
			КонецЕсли;
		Иначе
			Для Каждого СтрокаКорня Из Корень Цикл
				Если СтрокаКорня.Иерархия = ДопПараметры.Иерархия Тогда 
					Ветвь = СтрокаКорня.ПолучитьЭлементы();
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если Ветвь = Неопределено Тогда 
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		Для Каждого СтрокаВетви Из Ветвь Цикл
			Если СтрокаВетви.Ограничение = Результат Тогда 
				СтрокаВетви.Собственное = Истина;
				Возврат;
			КонецЕсли;					
		КонецЦикла;
		НоваяСтрокаВетви = Ветвь.Добавить();
		НоваяСтрокаВетви.Иерархия = ДопПараметры.Иерархия;
		НоваяСтрокаВетви.Ограничение = Результат;
		НоваяСтрокаВетви.Собственное = Истина;
		ЭтотОбъект["МодифицированностьОграничений"] = Истина;
		Модифицированность = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОР(Команда)
	Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда 
		Сообщить = Новый СообщениеПользователю();
		Сообщить.Текст = НСтр("ru = 'Необходимо записать объект.';
			| en = 'you Need to write the object.'; es = 'Debe escribir un objeto.'");
		Сообщить.Сообщить();
		Возврат;
	КонецЕсли;
	ПроверитьОРНаСервере(Объект.Ссылка);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПроверитьОРНаСервере(Ссылка)
	Результат = гкс_ПроверкаФункциональныхМест.ПроверитьОграниченияМассиваОР(,Ссылка);
	Если ТипЗнч(Результат) = Тип("Структура") Тогда 
		Если Результат.НеПодходят.Количество() = 0 Тогда 
			Сообщить = Новый СообщениеПользователю();
			Сообщить.Текст = НСтр("ru = 'Все объекты ремонта удовлетворяют требованиям.';
				| en = 'All repair facilities meet the requirements.';
				| es = 'Todos los objetos de la reparación satisfacen sus necesidades.'");
			Сообщить.Сообщить();
		Иначе
			Для Каждого СтрокаТаблицы ИЗ Результат.НеПодходят Цикл
				Сообщить = Новый СообщениеПользователю();
				Сообщить.Текст = НСтр("ru = 'Объект '; en = 'Object '; es = 'el Objeto '")
					+ СтрокаТаблицы.Ссылка+НСтр("en=' do not meet the requirements FP: ';
					|es=' no cumplen con los requisitos de fm: '
					|;ru=' не соответствуют требованиям ФМ: '")
					+ СтрокаТаблицы.ТекстТребований;
				Сообщить.КлючДанных = СтрокаТаблицы.Ссылка;
				Сообщить.Сообщить();
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область Локализация

&НаКлиенте
Процедура дс_НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	торо_ЛокализацияКлиент.НачалоВыбора(ЭтаФорма, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура дс_ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	торо_ЛокализацияКлиент.ОбработкаВыбора(ЭтаФорма, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура дс_ПриСозданииНаСервере()
	//СтроковыеРеквизиты = "Наименование,АдресМестонахождения,Изготовитель,Комментарий";
	СтроковыеРеквизиты = "Наименование,АдресМестонахождения,Комментарий";
	торо_ЛокализацияСобытияФорм.ПриСоздании(ЭтаФорма, СтроковыеРеквизиты);
	дс_УстановитьЗаголовкиЭлементов();
КонецПроцедуры 

&НаСервере
Процедура дс_ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи)
	торо_ЛокализацияСобытияФорм.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
КонецПроцедуры 

&НаСервере
Процедура дс_ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи)
	торо_ЛокализацияСобытияФорм.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
КонецПроцедуры 

&НаСервере
Процедура дс_УстановитьЗаголовкиЭлементов()
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("НарядыНаВыполнениеРемонтныхРаботДокумент", 
	НСтр("es='El documento';ru='Документ';en='Document'"));
	Заголовки.Вставить("ВыявленныеДефектыДокумент", 	
	НСтр("es='El documento';ru='Документ';en='Document'"));
	Заголовки.Вставить("НарядыНаРегМероприятияДокумент",
	НСтр("es='El documento';ru='Документ';en='Document'"));
	Заголовки.Вставить("ЗаявкиНаРемонтВидРемонта", 		
	НСтр("es='Tipo de reparación';ru='Вид ремонта';en='Type of repair'"));
	Заголовки.Вставить("ЗаявкиНаРемонтВидРемонта", 		
	НСтр("es='Tipo de reparación';ru='Вид ремонта';en='Type of repair'"));
	
	Заголовки.Вставить("ВыполненныеРемонтыДатаНачалаПлан", 		
	НСтр("es='Fecha de inicio del plan de';ru='Дата начала план';en='Plan start date'"));
	Заголовки.Вставить("ВыполненныеРемонтыДатаНачалаФакт", 		
	НСтр("es='Fecha de inicio del hecho';ru='Дата начала факт';en='Start date fact'"));
	Заголовки.Вставить("ВыполненныеРемонтыДатаОкончанияПлан", 	
	НСтр("es='La fecha de finalización de un plan de';ru='Дата окончания план';en='Plan end date'"));
	Заголовки.Вставить("ВыполненныеРемонтыДатаОкончанияФакт", 	
	НСтр("es='La fecha de finalización de hecho';ru='Дата окончания факт';en='End date fact'"));
	
	Заголовки.Вставить("ВыполненныеРегМероприятияДатаНачалаПлан", 		
	НСтр("es='Fecha de inicio del plan de';ru='Дата начала план';en='Plan start date'"));
	Заголовки.Вставить("ВыполненныеРегМероприятияДатаНачалаФакт", 		
	НСтр("es='Fecha de inicio del hecho';ru='Дата начала факт';en='Start date fact'"));
	Заголовки.Вставить("ВыполненныеРегМероприятияДатаОкончанияПлан", 	
	НСтр("es='La fecha de finalización de un plan de';ru='Дата окончания план';en='Plan end date'"));
	Заголовки.Вставить("ВыполненныеРегМероприятияДатаОкончанияФакт", 	
	НСтр("es='La fecha de finalización de hecho';ru='Дата окончания факт';en='End date fact'"));

	Для каждого ЗаголовокЭлемента Из Заголовки Цикл
		ИмяЭлемента = ЗаголовокЭлемента.Ключ;
		ПереводЗаголовка = ЗаголовокЭлемента.Значение;
		
		Элементы[ИмяЭлемента].Заголовок = ПереводЗаголовка;
	КонецЦикла; 
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

// гкс+ [КатегорияРиска] Куст 19.10.2020
&НаКлиенте
Процедура ОткрытьМатрицуОценкиРисков(Команда)
	
	МассивВыбранныхЗначений = Новый Массив;
	
	Для Каждого Строка Из Объект.гкс_ВыборИзМатрицы Цикл
		СтруктураВыбранных = Новый Структура;
		СтруктураВыбранных.Вставить("ОбъектВоздействия", Строка.ОбъектВоздействия);
		СтруктураВыбранных.Вставить("КатегорияРиска"   , Строка.КатегорияРиска);
		СтруктураВыбранных.Вставить("Комментарий"   , Строка.Комментарий);
		МассивВыбранныхЗначений.Добавить(СтруктураВыбранных);
	КонецЦикла; 
	СтруктураОпОп = Новый Структура();
	ОпОп = Новый ОписаниеОповещения("ПолучитьРезультатМатрицы",ЭтотОбъект,СтруктураОпОп);
	ОткрытьФорму("Обработка.торо_МатрицаОценкиРисков.Форма.ФормаПодбора",
		Новый Структура("ДатаОбнаружения, МассивВыбранныхЗначений, КлючНазначенияИспользования,Комментарий", ТекущаяДата(),
		МассивВыбранныхЗначений, "ПодборКатегорииРискаВДефект",
		Объект.гкс_КомментарийМатрицы),,,,, ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементыМатрицы()
	НЭлем = Элементы.Добавить("гкс_КатегорияРискаГруппа", Тип("ГруппаФормы"), Элементы.ГруппаДанныеЭксплЛевая);
	НЭлем.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НЭлем.ОтображатьЗаголовок = Ложь;
	Элементы.Переместить(Элементы["гкс_КатегорияРискаГруппа"], Элементы.ГруппаДанныеЭксплЛевая, Элементы.Приоритет);
	Элементы.Приоритет.Видимость = Ложь;
	
	НЭлем = Элементы.Добавить("гкс_КатегорияРиска", Тип("ПолеФормы"), Элементы["гкс_КатегорияРискаГруппа"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Объект.гкс_КатегорияРиска";
	НЭлем.АвтоМаксимальнаяШирина = Ложь;
	НЭлем.ТолькоПросмотр = Истина;
	// гкс+ [07.23] Деснол 17.07.2023
	НЭлем = Элементы.Добавить("гкс_КачественнаяОценка", Тип("ПолеФормы"), Элементы["гкс_КатегорияРискаГруппа"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Объект.гкс_КачественнаяОценка";
	НЭлем.АвтоМаксимальнаяШирина = Ложь;
	НЭлем.ТолькоПросмотр = Истина;
	// гкс- [07.23] Деснол 17.07.2023
	
	НКом = Команды.Добавить("гкс_ОткрытьМатрицу");
	НКом.Действие = "ОткрытьМатрицуОценкиРисков";
	НКом.Заголовок = НСтр("ru='Открыть матрицу'");
	
	НКом.Картинка = БиблиотекаКартинок.Задача;
	
	НЭлем = Элементы.Добавить("гкс_ОткрытьМатрицу", Тип("КнопкаФормы"), Элементы["гкс_КатегорияРискаГруппа"]);
	НЭлем.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НЭлем.ИмяКоманды = "гкс_ОткрытьМатрицу";
	НЭлем.Отображение = ОтображениеКнопки.Картинка;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьРезультатМатрицы(Результат, ДопПараметры)Экспорт
	Если Не Результат = Неопределено Тогда 
		Модифицированность = Истина;
		Объект.гкс_КатегорияРиска = Результат.КатегорияРиска;
		// гкс+ [07.23] Деснол 17.07.2023
		Объект.гкс_КачественнаяОценка = Результат.КачественнаяОценка;
		// гкс- [07.23] Деснол 17.07.2023
		Объект.гкс_ВыборИзМатрицы.Очистить();
		Объект.гкс_КомментарийМатрицы = Результат.Комментарий;
		РезультатыВыбора = Новый Массив;			
		Если Результат.Свойство("РезультатыПодбораИзМатрицыОценкиРисков", РезультатыВыбора) Тогда
			Для каждого Строка Из РезультатыВыбора Цикл
				НоваяСтрока = Объект.гкс_ВыборИзМатрицы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			КонецЦикла; 
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
// гкс- [КатегорияРиска] Куст 19.10.2020

&НаСервереБезКонтекста
&Вместо("ОбновитьИзмеряемыеПоказатели")
Функция Расш_гкс_ОбновитьИзмеряемыеПоказатели(ОбъектРемонта, ТиповойОР)
	// гкс+ [Релиз 1] Куст 17.03.2020
	Запрос = Новый Запрос();
	Запрос.Текст =
	 "ВЫБРАТЬ
	 |	гкс_ТегиПоказателей.Показатель КАК Показатель,
	 |	гкс_ТегиПоказателей.Тег КАК Тег
	 |ИЗ
	 |	РегистрСведений.гкс_ТегиПоказателей КАК гкс_ТегиПоказателей
	 |ГДЕ
	 |	гкс_ТегиПоказателей.ОР = &ОР";
	Запрос.УстановитьПараметр("ОР",ОбъектРемонта);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	// гкс- [Релиз 1] Куст 17.03.2020
	СтруктураВозврата = Новый Массив;
	
	СписокТиповых = Новый Массив;
	Если ЗначениеЗаполнено(ТиповойОР) Тогда
		СписокТиповых.Добавить(ТиповойОР);
	КонецЕсли;
	
	ТаблицаРодителейТиповых = торо_ОбщегоНазначения.ПолучитьТаблицуРодителейСпискаОбъектов(СписокТиповых, Тип("СправочникСсылка.торо_ТиповыеОР"), Истина);
	ТаблицаРодителейТиповых.Колонки.Добавить("ОбъектРемонта", Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта"));
	ТаблицаРодителейТиповых.ЗаполнитьЗначения(ОбъектРемонта, "ОбъектРемонта");
	
	МассивПоказателей = ПланыВидовХарактеристик.торо_ИзмеряемыеПоказателиОбъектовРемонта.ПолучитьСтруктуруИзмеряемыхПоказателейОбъектовРемонта(ОбъектРемонта,,Истина,,ТаблицаРодителейТиповых);
	
	Для Каждого СтрокаПоказатель из МассивПоказателей Цикл	
		
		СтруктураСтроки = Новый Структура("ОбъектРемонта, Показатель, ДопустимыйМинимум,
										  |ДопустимыйМаксимум, КритическийМинимум, КритическийМаксимум,
										  |ЗначенияКонтролируемыхПоказателейИзОР, ИзТиповогоОР,
										  // гкс+ [Релиз 1] Куст 17.03.2020
										  |гкс_Тег,
										  // гкс- [Релиз 1] Куст 17.03.2020
    									  |ТочкаЗамера,ТиповойОР,Удален, Доступность");
		
		ЗаполнитьЗначенияСвойств(СтруктураСтроки,СтрокаПоказатель);
		СтруктураСтроки.Доступность = Истина;
		
		Если НЕ ТипЗнч(СтруктураСтроки.ДопустимыйМаксимум) = Тип("Число") Тогда
			СтруктураСтроки.ДопустимыйМаксимум = 0;
		КонецЕсли;
		Если НЕ ТипЗнч(СтруктураСтроки.КритическийМинимум) = Тип("Число") Тогда
			СтруктураСтроки.КритическийМинимум = 0;
		КонецЕсли;
		Если НЕ ТипЗнч(СтруктураСтроки.КритическийМаксимум) = Тип("Число") Тогда
			СтруктураСтроки.КритическийМаксимум = 0;
		КонецЕсли;
		Если НЕ ТипЗнч(СтруктураСтроки.ДопустимыйМаксимум) = Тип("Число") Тогда
			СтруктураСтроки.ДопустимыйМаксимум = 0;
		КонецЕсли;
		// гкс+ [Релиз 1] Куст 17.03.2020
		Если Выборка.НайтиСледующий(Новый Структура("Показатель",СтрокаПоказатель.Показатель)) Тогда 
			СтруктураСтроки.гкс_Тег = Выборка.Тег;
		КонецЕсли;
		Выборка.Сбросить();
		// гкс- [Релиз 1] Куст 17.03.2020
		СтруктураСтроки.Доступность = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураСтроки.Показатель, "ТипЗначения").СодержитТип(Тип("Число"));
		
		СтруктураВозврата.Добавить(СтруктураСтроки);
		
	КонецЦикла;
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаСервере
&Вместо("ЗаполнитьОсновныеИЗависимыеРемонты")
Процедура Расш_гкс_ЗаполнитьОсновныеИЗависимыеРемонты()
	
	ОсновноеОборудование.ПолучитьЭлементы().Очистить();
	ЗависимоеОборудование.ПолучитьЭлементы().Очистить();
	// гкс+ [10.22] Деснол 12.10.2022
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Возврат;
	КонецЕсли;
	// гкс- [10.22] Деснол 12.10.2022
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	торо_РемонтыОсновногоЗависимогоОборудования.ОсновнойОбъектРемонта КАК ОбъектРемонта,
	|	торо_РемонтыОсновногоЗависимогоОборудования.ВидРемонтаЗависимогоОбъекта КАК ВидРемонтаЭтогоОбъекта,
	|	торо_РемонтыОсновногоЗависимогоОборудования.ВидРемонтаОсновногоОбъекта КАК ВидРемонтаСвязанногоОбъекта,
	// гкс+ [Релиз 1] Куст 17.03.2020
	|	торо_РемонтыОсновногоЗависимогоОборудования.гкс_Остановочная КАК гкс_Остановочная,
	|	торо_РемонтыОсновногоЗависимогоОборудования.гкс_Технологическая КАК гкс_Технологическая
	// гкс- [Релиз 1] Куст 17.03.2020
	|ИЗ
	|	РегистрСведений.торо_РемонтыОсновногоЗависимогоОборудования КАК торо_РемонтыОсновногоЗависимогоОборудования
	|ГДЕ
	|	торо_РемонтыОсновногоЗависимогоОборудования.СвязанныйОбъектРемонта = &ОбъектРемонта
	// гкс+ [Релиз 1] Куст 17.03.2020
	|ИТОГИ
	|	МАКСИМУМ(гкс_Остановочная),
	|	МАКСИМУМ(гкс_Технологическая)
	|ПО
	|	ОбъектРемонта,
	|	ВидРемонтаЭтогоОбъекта";
	// гкс- [Релиз 1] Куст 17.03.2020
	
	Запрос.УстановитьПараметр("ОбъектРемонта", Объект.Ссылка);

	ВыборкаПоОР = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ОбъектРемонта");
	Пока ВыборкаПоОР.Следующий() Цикл
		СтрокаОР = ОсновноеОборудование.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаОР, ВыборкаПоОР);
		
		ВыборкаПоВР = ВыборкаПоОР.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоВР.Следующий() Цикл
			СтрокаВР = СтрокаОР.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаВР, ВыборкаПоВР);
			
			ВыборкаДеталей = ВыборкаПоВР.Выбрать(ОбходРезультатаЗапроса.Прямой);
			Пока ВыборкаДеталей.Следующий() Цикл
				СтрокаДеталей = СтрокаВР.ПолучитьЭлементы().Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДеталей, ВыборкаДеталей);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	торо_РемонтыОсновногоЗависимогоОборудования.СвязанныйОбъектРемонта КАК ОбъектРемонта,
	|	торо_РемонтыОсновногоЗависимогоОборудования.ВидРемонтаОсновногоОбъекта КАК ВидРемонтаЭтогоОбъекта,
	|	торо_РемонтыОсновногоЗависимогоОборудования.ВидРемонтаЗависимогоОбъекта КАК ВидРемонтаСвязанногоОбъекта
	// гкс+ [Релиз 1] Куст 17.03.2020
	|	,торо_РемонтыОсновногоЗависимогоОборудования.гкс_Остановочная КАК гкс_Остановочная,
	|	торо_РемонтыОсновногоЗависимогоОборудования.гкс_Технологическая КАК гкс_Технологическая
	// гкс- [Релиз 1] Куст 17.03.2020
	|ИЗ
	|	РегистрСведений.торо_РемонтыОсновногоЗависимогоОборудования КАК торо_РемонтыОсновногоЗависимогоОборудования
	|ГДЕ
	|	торо_РемонтыОсновногоЗависимогоОборудования.ОсновнойОбъектРемонта = &ОбъектРемонта
	// гкс+ [Релиз 1] Куст 17.03.2020
	|ИТОГИ
	|	МАКСИМУМ(гкс_Остановочная),
	|	МАКСИМУМ(гкс_Технологическая)
	|ПО
	|	ОбъектРемонта,
	|	ВидРемонтаЭтогоОбъекта";
	// гкс- [Релиз 1] Куст 17.03.2020
	
	Запрос.УстановитьПараметр("ОбъектРемонта", Объект.Ссылка);

	ВыборкаПоОР = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ОбъектРемонта");
	Пока ВыборкаПоОР.Следующий() Цикл
		СтрокаОР = ЗависимоеОборудование.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаОР, ВыборкаПоОР);
		
		ВыборкаПоВР = ВыборкаПоОР.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоВР.Следующий() Цикл
			СтрокаВР = СтрокаОР.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаВР, ВыборкаПоВР);
			
			ВыборкаДеталей = ВыборкаПоВР.Выбрать(ОбходРезультатаЗапроса.Прямой);
			Пока ВыборкаДеталей.Следующий() Цикл
				СтрокаДеталей = СтрокаВР.ПолучитьЭлементы().Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДеталей, ВыборкаДеталей);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
&Вместо("СохранитьДанныеИзЭлементовФормы")
Процедура Расш_гкс_СохранитьДанныеИзЭлементовФормы(Форма)
	Если Форма.ВыбраноОсновное Тогда
		ДеревоДляРаботы = Форма.ОсновноеОборудование;
		ВтороеДерево = Форма.ЗависимоеОборудование;
	Иначе
		ДеревоДляРаботы = Форма.ЗависимоеОборудование;
		ВтороеДерево = Форма.ОсновноеОборудование;
	КонецЕсли; 
	// гкс+ [Релиз 1] Куст 17.03.2020
	Корень1 = ДеревоДляРаботы.ПолучитьЭлементы();
	Для каждого ВыборкаОР из Форма.СписокОбъектовРемонта Цикл
		Для Каждого СТ ИЗ Корень1 Цикл
			Если ВыборкаОР.ОбъектРемонта = СТ.ОбъектРемонта Тогда 
				ВыборкаОР.гкс_Остановочная = СТ.гкс_Остановочная;
				ВыборкаОР.гкс_Технологическая = СТ.гкс_Технологическая;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Корень1.Очистить();
	// гкс- [Релиз 1] Куст 17.03.2020
	
	Для каждого ВыборкаОР из Форма.СписокОбъектовРемонта Цикл
		СтрокаОР = ДеревоДляРаботы.ПолучитьЭлементы().Добавить();
		СтрокаОР.ОбъектРемонта = ВыборкаОР.ОбъектРемонта;
		// гкс+ [Релиз 1] Куст 17.03.2020
		СтрокаОР.гкс_Остановочная = ВыборкаОР.гкс_Остановочная;
		СтрокаОР.гкс_Технологическая = ВыборкаОР.гкс_Технологическая;
		// гкс- [Релиз 1] Куст 17.03.2020
		
		СтрокиВидовРемонта = Форма.ВидыРемонтаЭтогоОбъекта.НайтиСтроки(Новый Структура("ОбъектРемонта", ВыборкаОР.ОбъектРемонта));
		Если СтрокиВидовРемонта.Количество() = 0 Тогда
			СтрокаВР = СтрокаОР.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаВР, СтрокаОР);
			
			СтрокаДеталей = СтрокаВР.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДеталей, СтрокаВР);
			
			НовСтр = Форма.ВидыРемонтаЭтогоОбъекта.Добавить();
			НовСтр.ОбъектРемонта = ВыборкаОР.ОбъектРемонта;
			
			НовСтр = Форма.ВидыРемонтаОсновногоСвязанного.Добавить();
			НовСтр.ОбъектРемонта = ВыборкаОР.ОбъектРемонта;
		Иначе
		
			Для каждого ВыборкаВР из СтрокиВидовРемонта Цикл
				СтрокаВР = СтрокаОР.ПолучитьЭлементы().Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаВР, СтрокаОР);
				СтрокаВР.ВидРемонтаЭтогоОбъекта = ВыборкаВР.ВидРемонта;
				
				СтрокиДеталей = Форма.ВидыРемонтаОсновногоСвязанного.НайтиСтроки(Новый Структура("ОбъектРемонта, ВидРемонтаЭтогоОбъекта",ВыборкаВР.ОбъектРемонта, ВыборкаВР.ВидРемонта));
				Если СтрокиДеталей.Количество() = 0 Тогда
					СтрокаДеталей = СтрокаВР.ПолучитьЭлементы().Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаДеталей, СтрокаВР);
					
					НовСтр = Форма.ВидыРемонтаОсновногоСвязанного.Добавить();
					НовСтр.ОбъектРемонта = ВыборкаВР.ОбъектРемонта;
					НовСтр.ВидРемонтаЭтогоОбъекта = ВыборкаВР.ВидРемонта;
				Иначе
					Для каждого ВыборкаДеталей из СтрокиДеталей Цикл
						СтрокаДеталей = СтрокаВР.ПолучитьЭлементы().Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаДеталей, СтрокаВР);
						СтрокаДеталей.ВидРемонтаСвязанногоОбъекта = ВыборкаДеталей.ВидРемонтаСвязанногоОбъекта;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		// Если мы добавили в одну из таблиц оборудования самого себя, 
		// то надо добавить себя также и во вторую таблицу, иначе при записи данные потеряются.
		// Только виды ремонта следует поменять местами.
		Если ВыборкаОР.ОбъектРемонта = Форма.Объект.Ссылка Тогда
			СтрокаОрДругая = Неопределено;
			Для каждого Строка из ВтороеДерево.ПолучитьЭлементы() Цикл
				Если Строка.ОбъектРемонта = ВыборкаОР.ОбъектРемонта Тогда
					СтрокаОрДругая = Строка;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если СтрокаОрДругая = Неопределено Тогда
				СтрокаОрДругая = ВтороеДерево.ПолучитьЭлементы().Добавить();
				СтрокаОрДругая.ОбъектРемонта = ВыборкаОР.ОбъектРемонта;
			КонецЕсли;
			
			СтрокаОрДругая.ПолучитьЭлементы().Очистить();
			
			СтрокиВР = Форма.ВидыРемонтаОсновногоСвязанного.НайтиСтроки(Новый Структура("ОбъектРемонта", ВыборкаОР.ОбъектРемонта));
			СоответсивиеВР = Новый Соответствие;
			Для каждого СтрокаВР из СтрокиВР Цикл
				ЗначениеСоответствия = СоответсивиеВР[СтрокаВР.ВидРемонтаСвязанногоОбъекта];
				Если ЗначениеСоответствия = Неопределено Тогда
					ЗначениеСоответствия = Новый Массив;
				КонецЕсли;
				
				ЗначениеСоответствия.Добавить(СтрокаВР.ВидРемонтаЭтогоОбъекта);
				
				СоответсивиеВР.Вставить(СтрокаВР.ВидРемонтаСвязанногоОбъекта, ЗначениеСоответствия);
			КонецЦикла;
			
			Для каждого КлючИЗначение из СоответсивиеВР Цикл
				СтрокаВР = СтрокаОрДругая.ПолучитьЭлементы().Добавить();
				СтрокаВР.ОбъектРемонта = ВыборкаОР.ОбъектРемонта;
				СтрокаВР.ВидРемонтаЭтогоОбъекта = КлючИЗначение.Ключ;
				
				Для каждого ВидРемонта из КлючИЗначение.Значение Цикл
					СтрокаДеталей = СтрокаВР.ПолучитьЭлементы().Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаДеталей, СтрокаВР);
					СтрокаДеталей.ВидРемонтаСвязанногоОбъекта = ВидРемонта;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
&Вместо("ЗаписатьОсновноеЗависимоеОборудование")
Процедура Расш_гкс_ЗаписатьОсновноеЗависимоеОборудование(ТекОбъект, Отказ)
	Если МодифицированностьОсновныхЗависимых Тогда
		
		СохранитьДанныеИзЭлементовФормы(ЭтаФорма);
		
		ПроверитьЗацикливаниеОсновногоЗависимогоОборудованияНаСервере(Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		НаборЗаписейОсновного = РегистрыСведений.торо_РемонтыОсновногоЗависимогоОборудования.СоздатьНаборЗаписей();
		НаборЗаписейОсновного.Отбор.СвязанныйОбъектРемонта.Установить(Объект.Ссылка);
		НаборЗаписейОсновного.Прочитать();
		НаборЗаписейОсновного.Очистить();
		
		Для каждого СтрокаОР Из ОсновноеОборудование.ПолучитьЭлементы() Цикл
			Для каждого СтрокаВР Из СтрокаОР.ПолучитьЭлементы() Цикл
				Для каждого СтрокаДеталей Из СтрокаВР.ПолучитьЭлементы() Цикл
					МенеджерЗаписи = НаборЗаписейОсновного.Добавить();
					
					МенеджерЗаписи.ОсновнойОбъектРемонта       = СтрокаДеталей.ОбъектРемонта;
					МенеджерЗаписи.СвязанныйОбъектРемонта      = Объект.Ссылка;
					МенеджерЗаписи.ВидРемонтаОсновногоОбъекта  = СтрокаДеталей.ВидРемонтаСвязанногоОбъекта;
					МенеджерЗаписи.ВидРемонтаЗависимогоОбъекта = СтрокаДеталей.ВидРемонтаЭтогоОбъекта;
					// гкс+ [Релиз 1] Куст 17.03.2020
					МенеджерЗаписи.гкс_Остановочная = СтрокаОР.гкс_Остановочная Или Не СтрокаОР.гкс_Технологическая;
					МенеджерЗаписи.гкс_Технологическая = СтрокаОР.гкс_Технологическая;
					// гкс- [Релиз 1] Куст 17.03.2020
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		
		Попытка
			НаборЗаписейОсновного.Записать(Истина);
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("es='La excepción';ru='Исключение';en='An exception'"), УровеньЖурналаРегистрации.Предупреждение, 
				Метаданные.Справочники.торо_ОбъектыРемонта,,ОписаниеОшибки());
		КонецПопытки; 
		
		НаборЗаписейЗависимого = РегистрыСведений.торо_РемонтыОсновногоЗависимогоОборудования.СоздатьНаборЗаписей();
		НаборЗаписейЗависимого.Отбор.ОсновнойОбъектРемонта.Установить(Объект.Ссылка);
		НаборЗаписейЗависимого.Прочитать();
		НаборЗаписейЗависимого.Очистить();
		
		Для каждого СтрокаОР Из ЗависимоеОборудование.ПолучитьЭлементы() Цикл
			Для каждого СтрокаВР Из СтрокаОР.ПолучитьЭлементы() Цикл
				Для каждого СтрокаДеталей Из СтрокаВР.ПолучитьЭлементы() Цикл
					МенеджерЗаписи = НаборЗаписейЗависимого.Добавить();
					
					МенеджерЗаписи.ОсновнойОбъектРемонта       = Объект.Ссылка;
					МенеджерЗаписи.СвязанныйОбъектРемонта      = СтрокаДеталей.ОбъектРемонта;
					МенеджерЗаписи.ВидРемонтаОсновногоОбъекта  = СтрокаДеталей.ВидРемонтаЭтогоОбъекта;
					МенеджерЗаписи.ВидРемонтаЗависимогоОбъекта = СтрокаДеталей.ВидРемонтаСвязанногоОбъекта;
					// гкс+ [Релиз 1] Куст 17.03.2020
					МенеджерЗаписи.гкс_Остановочная = СтрокаОР.гкс_Остановочная Или Не СтрокаОР.гкс_Технологическая;
					МенеджерЗаписи.гкс_Технологическая = СтрокаОР.гкс_Технологическая;
					// гкс- [Релиз 1] Куст 17.03.2020
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		
		Попытка
			НаборЗаписейЗависимого.Записать(Истина);
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("es='La excepción';ru='Исключение';en='An exception'"), УровеньЖурналаРегистрации.Предупреждение, 
				Метаданные.Справочники.торо_ОбъектыРемонта,,ОписаниеОшибки());
		КонецПопытки; 	
	КонецЕсли;
КонецПроцедуры

&НаСервере
&Вместо("ПолучитьИсториюПеремещения")
Процедура Расш_гкс_ПолучитьИсториюПеремещения()
	Запрос = Новый Запрос;
	// гкс+ [Релиз 1] Куст 17.03.2020
	ИсторияПеремещенияОборудования.Очистить();
	Если Объект.ТипОбъекта = Перечисления.торо_ТипыОбъектовRCM.ФункциональноеМесто Тогда 
		ЭтотОбъект["ИсторияПеремещенияФМ"].Очистить();
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	торо_ИсторияПеремещенияОборудованияМеждуФМ.Период КАК Период,
			|	торо_ИсторияПеремещенияОборудованияМеждуФМ.ОбъектРемонта КАК ОбъектРемонта,
			|	торо_ИсторияПеремещенияОборудованияМеждуФМ.Событие КАК Событие
			|ИЗ
			|	РегистрСведений.торо_ИсторияПеремещенияОборудованияМеждуФМ КАК торо_ИсторияПеремещенияОборудованияМеждуФМ
			|ГДЕ
			|	торо_ИсторияПеремещенияОборудованияМеждуФМ.ФункциональноеМесто = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ЭтотОбъект["ИсторияПеремещенияФМ"].Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
		КонецЦикла;
		Возврат;
	Иначе
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.Период КАК Период,
			|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.Регистратор КАК Регистратор,
			|	0 КАК НомерСтроки,
			|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.ОбъектИерархии КАК ОбъектРемонта,
			|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.СтруктураИерархии КАК СтруктураИерархии,
			|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.РодительИерархии КАК РодительИерархии
			|ИЗ
			|	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии КАК торо_РасположениеОРВСтруктуреИерархииСрезПоследних
			|ГДЕ
			|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.ОбъектИерархии = &ОбъектИерархии
			|	И торо_РасположениеОРВСтруктуреИерархииСрезПоследних.СтруктураИерархии = &СтруктураИерархии
			|	И НЕ торо_РасположениеОРВСтруктуреИерархииСрезПоследних.Регистратор.Организация ЕСТЬ NULL";
	КонецЕсли;
	// гкс- [Релиз 1] Куст 17.03.2020
 
	Запрос.УстановитьПараметр("ОбъектИерархии", Объект.Ссылка);
	Запрос.УстановитьПараметр("СтруктураИерархии", ВыборВидаИерархииИстория);

	ИсторияПеремещенияОборудования.Загрузить(Запрос.Выполнить().Выгрузить());
	парам = 0;
	Для Каждого ТекСтрока Из ИсторияПеремещенияОборудования Цикл
		парам = парам + 1;
		ТекСтрока.НомерСтроки = парам;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьИсториюПеремещенияНаКлиенте(Команда)
	ПолучитьИсториюПеремещения();
КонецПроцедуры

&НаКлиенте
Процедура ГарантииОбъектаРемонтаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элементы.ГарантииОбъектаРемонта.ТекущиеДанные;
	Если Не ТекДанные = Неопределено И Не ТекДанные.ОбъектРемонта = Объект.Ссылка Тогда 
		ОткрытьФорму("Справочник.торо_ОбъектыРемонта.Форма.ФормаЭлемента", 
			Новый Структура("Ключ", ТекДанные.ОбъектРемонта),, ТекДанные.ОбъектРемонта);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМассивДокументовНаработкиФМ(Ссылка)
	ТекИерархия = Константы.торо_ИерархияДляВводаНовыхОР.Получить();	
	//
	Массив = Новый Массив;
	Запрос = Новый Запрос;
	Если ТекИерархия.ИзменяетсяДокументами Тогда 
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.ОбъектИерархии КАК ОР
		|ПОМЕСТИТЬ ПодчиненныеОР
		|ИЗ
		|	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(
		|			,
		|			СтруктураИерархии = &СтруктураИерархии
		|				И РодительИерархии = &ОбъектРемонта) КАК торо_РасположениеОРВСтруктуреИерархииСрезПоследних"+"
		|;
		| ";
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_ИерархическиеСтруктурыОР.ОбъектИерархии КАК ОР
		|ПОМЕСТИТЬ ПодчиненныеОР
		|ИЗ
		|	РегистрСведений.торо_ИерархическиеСтруктурыОР КАК торо_ИерархическиеСтруктурыОР
		|ГДЕ
		|	торо_ИерархическиеСтруктурыОР.СтруктураИерархии = &СтруктураИерархии
		|	И торо_ИерархическиеСтруктурыОР.РодительИерархии = &ОбъектРемонта "+"
		|;
		| ";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст +"
	|////////////////////////////////////////////////////////////////////////////////
	|"
	+" ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 |	торо_НаработкаОбъектовРемонта.Период КАК Период,
	 |	торо_НаработкаОбъектовРемонта.Регистратор КАК Регистратор,
	 |	торо_НаработкаОбъектовРемонта.Показатель КАК Показатель,
	 |	торо_НаработкаОбъектовРемонта.Наработка КАК Наработка,
	 |	торо_НаработкаОбъектовРемонта.ДатаНач КАК ДатаНач,
	 |	торо_НаработкаОбъектовРемонта.ВидДвижения КАК ВидДвижения,
	 |	ВЫБОР
	 |		КОГДА торо_НаработкаОбъектовРемонта.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	 |			ТОГДА 28
	 |		ИНАЧЕ 29
	 |	КОНЕЦ КАК Картинка
	 |ИЗ
	 |	РегистрНакопления.торо_НаработкаОбъектовРемонта КАК торо_НаработкаОбъектовРемонта
	 |		ЛЕВОЕ СОЕДИНЕНИЕ ПодчиненныеОР КАК ПодчиненныеОР
	 |		ПО (ПодчиненныеОР.ОР = торо_НаработкаОбъектовРемонта.ОбъектРемонта)
	 |ГДЕ
	 |	(торо_НаработкаОбъектовРемонта.ОбъектРемонта = &ОбъектРемонта
	 |			ИЛИ НЕ ПодчиненныеОР.ОР ЕСТЬ NULL)
	 |	И НЕ торо_НаработкаОбъектовРемонта.Регистратор.Организация ЕСТЬ NULL
	 |
	 |УПОРЯДОЧИТЬ ПО
	 |	Период";
				   
	Запрос.УстановитьПараметр("ОбъектРемонта", Ссылка);
	Запрос.УстановитьПараметр("СтруктураИерархии", ТекИерархия);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл 
			Структура = Новый Структура("Период, Регистратор, Показатель, Наработка, ВидДвижения, Картинка");
			ЗаполнитьЗначенияСвойств(Структура, Выборка);
			Массив.Добавить(Структура);	
		КонецЦикла; 
	КонецЕсли; 
	
	Возврат Массив;
	
КонецФункции

&НаКлиенте
Процедура Расш_гкс_ТиповойОРПриИзмененииПосле(Элемент)
	ЗаполнитьДеревоОграничений();
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ВычислениеМежремонтногоИнтервала")
Функция Расш_гкс_ВычислениеМежремонтногоИнтервала(ТекДанные)
	
	Перем МежремонтныйИнтервал;
	
	Запрос = Новый Запрос;
	Таб = НормативныеРемонты.Выгрузить(,"ВидРемонта, СпособПланирования");
	Запрос.УстановитьПараметр("Таб", Таб);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таб.СпособПланирования
	|ПОМЕСТИТЬ ОпредСпособПланирования
	|ИЗ
	|	&Таб КАК Таб
	|ГДЕ
	|	Таб.ВидРемонта = &ВидРемонта
	|	И Таб.СпособПланирования <>ЗНАЧЕНИЕ(Справочник.торо_СпособыПланированияРемонтныхРабот.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_СпособыПланированияРемонтныхРабот.ИспользоватьПараметрыНаработки,
	|	торо_СпособыПланированияРемонтныхРабот.ИспользоватьПериодичность,
	|	торо_СпособыПланированияРемонтныхРабот.КоличествоПериодов,
	|	торо_СпособыПланированияРемонтныхРабот.ПериодичностьРемонтныхРабот КАК Периодичность,
	|	ОпредСпособПланирования.СпособПланирования КАК СпособПланирования
	|ИЗ
	|	ОпредСпособПланирования КАК ОпредСпособПланирования
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_СпособыПланированияРемонтныхРабот КАК торо_СпособыПланированияРемонтныхРабот
	|		ПО ОпредСпособПланирования.СпособПланирования = торо_СпособыПланированияРемонтныхРабот.Ссылка";


	Запрос.УстановитьПараметр("ВидРемонта", ТекДанные.ЗамещаемыйВидРемонта);

	Результат = Запрос.Выполнить();

	ВыборкаДляПериодичности = Результат.Выбрать();

	Если ВыборкаДляПериодичности.Следующий() Тогда

		Если ВыборкаДляПериодичности.ИспользоватьПериодичность Тогда

			Если ВыборкаДляПериодичности.Периодичность = Перечисления.Периодичность.Год Тогда
				Период = 365;
			ИначеЕсли ВыборкаДляПериодичности.Периодичность = Перечисления.Периодичность.Полугодие Тогда
				Период = 182;
			ИначеЕсли ВыборкаДляПериодичности.Периодичность = Перечисления.Периодичность.Квартал Тогда
				Период = 90;
			ИначеЕсли ВыборкаДляПериодичности.Периодичность = Перечисления.Периодичность.Месяц Тогда
				Период = 28;
			ИначеЕсли ВыборкаДляПериодичности.Периодичность = Перечисления.Периодичность.Декада Тогда
				Период = 10;
			ИначеЕсли ВыборкаДляПериодичности.Периодичность = Перечисления.Периодичность.Неделя Тогда
				Период = 7;
			Иначе Период = 1;
			КонецЕсли;

			МежремонтныйИнтервал = ВыборкаДляПериодичности.КоличествоПериодов * Период;

		КонецЕсли;

		Если ВыборкаДляПериодичности.ИспользоватьПараметрыНаработки Тогда

			Запрос3 = Новый Запрос;

			Если СписокПараметровНаработки.Количество() > 0 Тогда

				ТаблНараб = СписокПараметровНаработки.Выгрузить(, "ОбъектРемонта,Показатель,ПродолжительностьПериодаПлановойНаработки,ПериодПлановойНаработки,ПлановаяНаработка,КоэффициентИспользованияОборудования"); 

			Иначе

				СписокОтбора = Новый СписокЗначений;
				СписокОтбора.Добавить(Объект.Ссылка);

				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	торо_ПараметрыНаработкиОбъектовРемонта.ОбъектРемонта,
				|	торо_ПараметрыНаработкиОбъектовРемонта.Показатель,
				|	торо_ПараметрыНаработкиОбъектовРемонта.ПлановаяНаработка,
				|	торо_ПараметрыНаработкиОбъектовРемонта.ПериодПлановойНаработки,
				|	торо_ПараметрыНаработкиОбъектовРемонта.КоэффициентИспользованияОборудования,
				|	торо_ПараметрыНаработкиОбъектовРемонта.Период,
				|	торо_ПараметрыНаработкиОбъектовРемонта.ПродолжительностьПериодаПлановойНаработки
				|ИЗ
				|	РегистрСведений.торо_ПараметрыНаработкиОбъектовРемонта КАК торо_ПараметрыНаработкиОбъектовРемонта
				|ГДЕ
				|	торо_ПараметрыНаработкиОбъектовРемонта.ОбъектРемонта В(&СписокОтбора)";

				Запрос.УстановитьПараметр("СписокОтбора", СписокОтбора);

				Результат = Запрос.Выполнить();
				ТаблНараб = Результат.Выгрузить();

			КонецЕсли;

			Запрос3.УстановитьПараметр("ТаблНараб", ТаблНараб);


			Запрос3.Текст = 
			"ВЫБРАТЬ
			|	ТаблНараб.Показатель,
			|	ТаблНараб.ПродолжительностьПериодаПлановойНаработки,
			|	ТаблНараб.ПериодПлановойНаработки,
			|	ТаблНараб.ПлановаяНаработка * ТаблНараб.КоэффициентИспользованияОборудования КАК ПлановаяНаработка
			|ПОМЕСТИТЬ ВыбрПараметрыНаработки
			|ИЗ
			|	&ТаблНараб КАК ТаблНараб
			|ГДЕ
			|	ТаблНараб.ОбъектРемонта = &ОбъектРемонта
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	торо_СпособыПланированияРемонтныхРаботПараметрыНаработки.ЗначениеПараметраНаработки,
			|	торо_СпособыПланированияРемонтныхРаботПараметрыНаработки.ПараметрНаработки
			|ПОМЕСТИТЬ ВыбрСпобобыПланирования
			|ИЗ
			|	Справочник.торо_СпособыПланированияРемонтныхРабот.ПараметрыНаработки КАК торо_СпособыПланированияРемонтныхРаботПараметрыНаработки
			|ГДЕ
			|	торо_СпособыПланированияРемонтныхРаботПараметрыНаработки.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВыбрСпобобыПланирования.ЗначениеПараметраНаработки,
			|	ЕстьNULL(ВыбрПараметрыНаработки.ПродолжительностьПериодаПлановойНаработки,0) КАК ПродолжительностьПериодаПлановойНаработки,
			|	ВыбрПараметрыНаработки.ПериодПлановойНаработки,
			|	ЕстьNULL(ВыбрПараметрыНаработки.ПлановаяНаработка,0) КАК ПлановаяНаработка
			|ИЗ
			|	ВыбрСпобобыПланирования КАК ВыбрСпобобыПланирования
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВыбрПараметрыНаработки КАК ВыбрПараметрыНаработки
			|		ПО ВыбрСпобобыПланирования.ПараметрНаработки = ВыбрПараметрыНаработки.Показатель";


			Запрос3.УстановитьПараметр("Ссылка", ВыборкаДляПериодичности.СпособПланирования);
			Запрос3.УстановитьПараметр("ОбъектРемонта", Объект.Ссылка);

			Результат = Запрос3.Выполнить();

			ВыборкаДляНаработки = Результат.Выбрать();
			ВыборкаДляНаработки.Следующий();

			Если ВыборкаДляНаработки.ПлановаяНаработка > 0 И ВыборкаДляНаработки.ПродолжительностьПериодаПлановойНаработки > 0 Тогда


				Если ВыборкаДляНаработки.ПериодПлановойНаработки = Перечисления.Периодичность.Год Тогда
					ПериодПлановойНаработки = 365;
				ИначеЕсли ВыборкаДляНаработки.ПериодПлановойНаработки = Перечисления.Периодичность.Полугодие Тогда
					ПериодПлановойНаработки = 182;
				ИначеЕсли ВыборкаДляНаработки.ПериодПлановойНаработки = Перечисления.Периодичность.Квартал Тогда
					ПериодПлановойНаработки = 90;
				ИначеЕсли ВыборкаДляНаработки.ПериодПлановойНаработки = Перечисления.Периодичность.Месяц Тогда
					ПериодПлановойНаработки = 28;
				ИначеЕсли ВыборкаДляНаработки.ПериодПлановойНаработки = Перечисления.Периодичность.Декада Тогда
					ПериодПлановойНаработки = 10;
				ИначеЕсли ВыборкаДляНаработки.ПериодПлановойНаработки = Перечисления.Периодичность.Неделя Тогда
					ПериодПлановойНаработки = 7;
				Иначе ПериодПлановойНаработки = 1;
				КонецЕсли;

				ПериодВДнях = ПериодПлановойНаработки * ВыборкаДляНаработки.ПродолжительностьПериодаПлановойНаработки;
				ПланНарабВДень = ВыборкаДляНаработки.ПлановаяНаработка / ПериодВДнях;

				МежремИнтервал = ВыборкаДляНаработки.ЗначениеПараметраНаработки / ПланНарабВДень;
				Если ЗначениеЗаполнено(МежремонтныйИнтервал) Тогда
					Если МежремИнтервал < МежремонтныйИнтервал Тогда
						МежремонтныйИнтервал = МежремИнтервал;
					КонецЕсли;
				Иначе МежремонтныйИнтервал = МежремИнтервал;
				КонецЕсли;
			Иначе 
				#Удаление
				ШаблонСообщения = НСтр("ru = 'Проверьте заполнение показателей на вкладке ""Наработка"", Параметров планирования по наработке в способе планирования %1'");
				#КонецУдаления
				#Вставка
				ШаблонСообщения = НСтр("es='Comprueben el relleno de los índices en вкладке ""la Elaboración"","
				+ " los Parámetros de la planificación por la "
				+ "elaboración en el modo de la planificación %1';ru='Проверьте заполнение показателей на вкладке"
				+ " ""Наработка"", Параметров планирования "
				+ "по наработке в способе планирования %1';en='Check the filling of indicators on the tab"
				+ " ""Timing” of the Operating time planning "
				+ "parameters in the planning method%1'");
				#КонецВставки
				ТекстСообщения = СтрШаблон(ШаблонСообщения, ВыборкаДляПериодичности.СпособПланирования);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		КонецЕсли;


	Иначе 
		#Удаление
		ТекстСообщения = НСтр("ru = 'Проверьте заполнение ""Способ планирования""'");
		#КонецУдаления
		#Вставка
		ТекстСообщения = НСтр("es='Comprueben el relleno ""el Modo de la planificación""';
		|ru='Проверьте заполнение ""Способ планирования""';en='Check the ""Planning method"" filling'");
		#КонецВставки
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;

	Возврат МежремонтныйИнтервал;

КонецФункции

&НаСервере
&ИзменениеИКонтроль("ПерерасчитатьНаСервере")
Функция Расш_гкс_ПерерасчитатьНаСервере(СписокНеНужныхВР)

	ПолеТД.Очистить();
	ПолеТД.АвтоМасштаб = Истина;

	СоответствиеИндексаИНомераКолонки.Очистить();

	Для каждого ЭлемСписка Из СписокНеНужныхВР Цикл

		МассивСтрок = ТаблицаОбъектыРемонта.НайтиСтроки(Новый Структура("ВидРемонтныхРабот", ЭлемСписка.Значение));

		Если МассивСтрок.Количество() Тогда
			ТаблицаОбъектыРемонта.Удалить(МассивСтрок[0]);
		КонецЕсли;

	КонецЦикла;

	ТабПараметрыНаработки = ПолучитьТаблицуПараметровНаработки();
	ТабПараметрыНаработкиОбъектовРемонта.Загрузить(ТабПараметрыНаработки);

	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ТаблицаПланРемонтов"     , Документы.торо_ПланГрафикРемонта.ПустаяСсылка().ПланРемонтов.ВыгрузитьКолонки());
	СтруктураДанных.Вставить("ТаблицаОбъектыРемонта"   , ТаблицаОбъектыРемонта.Выгрузить().Скопировать(,"ОбъектРемонтныхРабот,ВидРемонтныхРабот,ПлановыйГрафикРаботы,РемонтнаяГруппа"));
	СтруктураДанных.Вставить("ДатаПланирования"        , НачалоДня(ТекущаяДата()));
	СтруктураДанных.Вставить("ПериодичностьДетализации", Перечисления.Периодичность.Год);
	СтруктураДанных.Вставить("КоличествоПериодов"      , 1);
	СтруктураДанных.Вставить("ТабПараметрыНаработкиОбъектовРемонта", ТабПараметрыНаработкиОбъектовРемонта.Выгрузить());
	СтруктураДанных.Вставить("ВРНачалоЦикла"           , ВРНачалоЦикла);
	СтруктураДанных.Вставить("ВизуализацияТипОР"       , Ложь);

	ТабНормативов = Новый ТаблицаЗначений;
	СтруктураДанных.Вставить("ТаблицаНормативов", ТабНормативов);

	// Для совместимости с расчетом ППР создаем пустую таблицу
	ТаблицаЦепочки = Новый ТаблицаЗначений;
	ТаблицаЦепочки.Колонки.Добавить("ОбъектРемонтныхРабот", Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта"));
	ТаблицаЦепочки.Колонки.Добавить("Цепочка",              Новый ОписаниеТипов("СправочникСсылка.торо_ЦепочкиРемонта"));

	СтруктураДанных.Вставить("ТаблицаЦепочки", ТаблицаЦепочки);

	ДатаПланированияОкончание = Неопределено;
	ВыполнятьРасчет = ПроверкаПередРасчетом(СтруктураДанных["ДатаПланирования"], ДатаПланированияОкончание, ТаблицаОбъектыРемонта.Выгрузить().Скопировать(, "ОбъектРемонтныхРабот, ВидРемонтныхРабот"), СтруктураДанных["ТабПараметрыНаработкиОбъектовРемонта"]);

	Если ВыполнятьРасчет Тогда

		СтруктураДанных.Вставить("ДатаОкончанияВизуализации",ДатаПланированияОкончание);
		ТабРемонтов = торо_РасчетППР.РасчетППР(Неопределено,,,СтруктураДанных);

		Если ТабРемонтов = ложь или ТабРемонтов.Количество() = 0 Тогда
			#Удаление
			ТекстСообщения = НСтр("ru = 'Не удалось рассчитать ремонтный цикл, проверьте настройки планирования!'");
			#КонецУдаления
			#Вставка
			ТекстСообщения = НСтр("es='¡No consiguió contar el ciclo de reparación, comprueben los ajustes de la "
				+ "planificación!';ru='Не удалось рассчитать ремонтный цикл, проверьте настройки планирования!';"
				+ "en='Failed to calculate repair cycle, check planning settings!'");
			#КонецВставки
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат ложь;
		Иначе
			ТаблицаРемонтов.Загрузить(ТабРемонтов);
		КонецЕсли;

		ТаблицаНормативов.Загрузить(СтруктураДанных.ТаблицаНормативов);

		ТаблицаРемонтов.Сортировать("ДатаНач");

		СтрокиНачало = ТаблицаРемонтов.НайтиСтроки(Новый Структура("ВидРемонтныхРабот", ВРНачалоЦикла));
		Если СтрокиНачало.Количество() > 0 Тогда
			СтрНачало = СтрокиНачало[0];
			ИндексНачало = ТаблицаРемонтов.Индекс(СтрНачало);
			Пока ИндексНачало > 0 Цикл
				ТаблицаРемонтов.Удалить(0);
				ИндексНачало = ИндексНачало - 1;
			КонецЦикла;
		КонецЕсли;


		КоличествоРемонтов = ТаблицаРемонтов.Количество();
		Пока КоличествоРемонтов > 0 Цикл
			Если ТаблицаРемонтов[КоличествоРемонтов - 1].ВидРемонтныхРабот = ВРНачалоЦикла Тогда
				Прервать;
			Иначе
				ТаблицаРемонтов.Удалить(КоличествоРемонтов - 1);
				КоличествоРемонтов = КоличествоРемонтов - 1;
			КонецЕсли;
		КонецЦикла;


		Если ТаблицаРемонтов.Количество() > 0 Тогда

			ЗапланРемонты = ТаблицаОбъектыРемонта.Выгрузить().Скопировать(,"ВидРемонтныхРабот");

			Массив = Новый Массив;
			Массив.Добавить(Тип("Булево"));
			ОписаниеТиповБул = Новый ОписаниеТипов(Массив);
			ЗапланРемонты.Колонки.Добавить("Выбран",ОписаниеТиповБул);
			Массив = Новый Массив;
			Массив.Добавить(Тип("Цвет"));
			ОписаниеТиповЦвет = Новый ОписаниеТипов(Массив);
			ЗапланРемонты.Колонки.Добавить("Цвет",ОписаниеТиповЦвет);
			ЗапланРемонты.ЗаполнитьЗначения(Истина,"Выбран");
			ЗапланРемонты.ЗаполнитьЗначения(Новый Цвет(255, 255, 255) ,"Цвет");

			Нормировать = Ложь;

		Иначе
			#Удаление
			ТекстСообщения = НСтр("ru = 'Не удалось рассчитать ремонтный цикл, проверьте настройки планирования!'");
			#КонецУдаления
			#Вставка
			ТекстСообщения = НСтр("es='¡No consiguió contar el ciclo de reparación, comprueben los ajustes de la "
				+ "planificación!';ru='Не удалось рассчитать ремонтный цикл, проверьте настройки планирования!';"
				+ "en='Failed to calculate repair cycle, check planning settings!'");
			#КонецВставки
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат Ложь;

		КонецЕсли;

		ТаблицаРемонтовВизуализация.Загрузить(ТаблицаРемонтов.Выгрузить().Скопировать());
		РассчитатьПараметрыОтПредыдущего();

		Если ТаблицаРемонтов.Количество() > 0 Тогда
			ПоследнийРемонт = ТаблицаРемонтов[ТаблицаРемонтов.Количество() - 1];
			ДатаПоследнего = ТаблицаРемонтов[0].ДатаНач;
			ОбщаяПродолжительность = ПоследнийРемонт.ДатаНач - ДатаПоследнего;

			Если ОбщаяПродолжительность = 0 Тогда
				ОбщаяПродолжительность = 1;
			КонецЕсли;

		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
КонецФункции

&НаСервере
&ИзменениеИКонтроль("ПроверитьЗаполненностьГрафика")
Функция Расш_гкс_ПроверитьЗаполненностьГрафика(ДатаПланированияНачало, ДатаПланированияОкончание, НужныеГода, НужныеРемонты)

	ГрафикЗаполнен = Истина;
	ТабПлановыйГрафикРаботы = Новый ТаблицаЗначений;
	ТабПлановыйГрафикРаботы.Колонки.Добавить("График", Новый ОписаниеТипов("СправочникСсылка.Календари"));
	НовСтрока = ТабПлановыйГрафикРаботы.Добавить();
	НовСтрока.График = Объект.ПлановыйГрафикРаботы;

	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = "ВЫБРАТЬ
	|	торо_ТиповыеОРНормативныеРемонты.ВидРемонта,
	|	торо_ТиповыеОРНормативныеРемонты.Ссылка КАК ТиповойОР,
	|	торо_ТиповыеОРНормативныеРемонты.НормативныйРемонт
	|ПОМЕСТИТЬ ВсеНормРемонтыТиповогоОР
	|ИЗ
	|	Справочник.торо_ТиповыеОР.НормативныеРемонты КАК торо_ТиповыеОРНормативныеРемонты
	|ГДЕ
	|	торо_ТиповыеОРНормативныеРемонты.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НужныеРемонты.ВидРемонтныхРабот
	|ПОМЕСТИТЬ ВидыРемонтов
	|ИЗ
	|	&НужныеРемонты КАК НужныеРемонты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВсеНормРемонтыТиповогоОР.ВидРемонта,
	|	ВсеНормРемонтыТиповогоОР.ТиповойОР,
	|	ВсеНормРемонтыТиповогоОР.НормативныйРемонт
	|ПОМЕСТИТЬ НужныеРемонты
	|ИЗ
	|	ВсеНормРемонтыТиповогоОР КАК ВсеНормРемонтыТиповогоОР
	|ГДЕ
	|	ВсеНормРемонтыТиповогоОР.ВидРемонта В
	|			(ВЫБРАТЬ
	|				НужныеРемонты.ВидРемонтныхРабот
	|			ИЗ
	|				ВидыРемонтов КАК НужныеРемонты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПлановыйГрафикРаботы.График
	|ПОМЕСТИТЬ ПлановыйГрафикРаботы
	|ИЗ
	|	&ПлановыйГрафикРаботы КАК ПлановыйГрафикРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ТиповыеОРНормативныеРемонты.ГрафикРемонтныхРабот
	|ПОМЕСТИТЬ ТабГрафиков
	|ИЗ
	|	НужныеРемонты КАК НужныеРемонты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ТиповыеОР.НормативныеРемонты КАК торо_ТиповыеОРНормативныеРемонты
	|		ПО НужныеРемонты.ВидРемонта = торо_ТиповыеОРНормативныеРемонты.ВидРемонта
	|			И НужныеРемонты.ТиповойОР = торо_ТиповыеОРНормативныеРемонты.Ссылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ПлановыйГрафикРаботы.График
	|ИЗ
	|	ПлановыйГрафикРаботы КАК ПлановыйГрафикРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабГрафиков.ГрафикРемонтныхРабот
	|ИЗ
	|	ТабГрафиков КАК ТабГрафиков";

	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("ДатаПланированияНачало", ДатаПланированияНачало);
	Запрос.УстановитьПараметр("НужныеРемонты", НужныеРемонты);
	Запрос.УстановитьПараметр("ПлановыйГрафикРаботы", ТабПлановыйГрафикРаботы);

	Результат = Запрос.Выполнить();
	МассивГрафиков = Результат.Выгрузить().ВыгрузитьКолонку("ГрафикРемонтныхРабот");

	КалендарныеГрафики.СоздатьВТРасписанияРаботыНаПериод(МенеджерВТ, МассивГрафиков, НачалоДня(ДатаПланированияНачало), ДатаПланированияОкончание);

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = "ВЫБРАТЬ
	|	НужныеГода.ГодГрафика
	|ПОМЕСТИТЬ НужныеГода
	|ИЗ
	|	&НужныеГода КАК НужныеГода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабГрафиков.ГрафикРемонтныхРабот,
	|	НужныеГода.ГодГрафика
	|ПОМЕСТИТЬ ВремТабл
	|ИЗ
	|	ТабГрафиков КАК ТабГрафиков,
	|	НужныеГода КАК НужныеГода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРасписанияРаботы.ГрафикРаботы,
	|	ГОД(ВТРасписанияРаботы.ДатаГрафика) КАК ГодГрафика,
	|	СУММА(РАЗНОСТЬДАТ(ВТРасписанияРаботы.ВремяНачала, ВТРасписанияРаботы.ВремяОкончания, СЕКУНДА)) КАК ОсновноеЗначение
	|ПОМЕСТИТЬ ВТРасписанияРаботыИзм
	|ИЗ
	|	ВТРасписанияРаботы КАК ВТРасписанияРаботы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТРасписанияРаботы.ГрафикРаботы,
	|	ГОД(ВТРасписанияРаботы.ДатаГрафика)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремТабл.ГрафикРемонтныхРабот КАК ГрафикРаботы,
	|	ВремТабл.ГодГрафика,
	|	ЕСТЬNULL(ВТРасписанияРаботыИзм.ОсновноеЗначение, 0) КАК ОсновноеЗначение
	|ИЗ
	|	ВремТабл КАК ВремТабл
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасписанияРаботыИзм КАК ВТРасписанияРаботыИзм
	|		ПО ВремТабл.ГодГрафика = ВТРасписанияРаботыИзм.ГодГрафика
	|			И ВремТабл.ГрафикРемонтныхРабот = ВТРасписанияРаботыИзм.ГрафикРаботы";

	Запрос.УстановитьПараметр("НужныеГода", НужныеГода);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();

	Пока Выборка.Следующий() Цикл
		Если Выборка.ОсновноеЗначение = 0 Тогда
			#Удаление
			ШаблонСообщения = НСтр("ru = 'Не заполнен график %1 за %2 год'");
			#КонецУдаления
			#Вставка
			ШаблонСообщения = НСтр("es='año';ru='Не заполнен график %1 за %2 год';en='Chart%1 for%2 year not filled'");
			#КонецВставки

			ТекстСообщения = СтрШаблон(ШаблонСообщения, Выборка.ГрафикРаботы, Выборка.ГодГрафика);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			ГрафикЗаполнен = Ложь;
		КонецЕсли;
	КонецЦикла;

	Возврат ГрафикЗаполнен;

КонецФункции

&НаСервере
&ИзменениеИКонтроль("ПечатьНаСервере")
Функция Расш_гкс_ПечатьНаСервере()

	ТабДок = Новый ТабличныйДокумент;

	ПолужирныйШрифт = Новый Шрифт("Arial", 9,ИСТИНА,,,);

	ОбластьДляЗаголовка = ТабДок.ПолучитьОбласть(1,2,4,17);
	ОбластьЗаголовок = ОбластьДляЗаголовка.Область(1,2,4,17);
	ОбластьЗаголовок.Объединить();
	ОбластьЗаголовок.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
	#Удаление
	ОбластьЗаголовок.Текст = НСтр("ru = 'Структура ремонтного цикла'");
	#КонецУдаления
	#Вставка
	ОбластьЗаголовок.Текст = НСтр("es='La estructura del ciclo de reparación';ru='Структура ремонтного цикла';en='Repair cycle structure'");
	#КонецВставки

	ОбластьЗаголовок.Шрифт = Новый Шрифт("Arial", 18, Истина);  
	ОбластьЗаголовок.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	ОбластьЗаголовок.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
	ТабДок.Вывести(ОбластьДляЗаголовка);

	ОбластьПараметров = ТабДок.ПолучитьОбласть(6,2,12, 17);

	ОбластьОРЗголовок = ОбластьПараметров.Область(2,2,2,17);
	ОбластьОРЗголовок.Объединить();
	ОбластьОРЗголовок.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
	ОбластьОРЗголовок.Шрифт = ПолужирныйШрифт;
	#Удаление
	ОбластьОРЗголовок.Текст = НСтр("ru = 'Объект ремонта: '") + торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(Объект.Ссылка);
	#КонецУдаления
	#Вставка
	ОбластьОРЗголовок.Текст = НСтр("es='El objeto de la reparación: ';ru='Объект ремонта: ';en='Object of repair: '") + торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(Объект.Ссылка);
	#КонецВставки

	ОбластьОРЗголовок.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;

	ОбластьГрафикЗаголовок = ОбластьПараметров.Область(3,2,3,17);
	ОбластьГрафикЗаголовок.Объединить();
	ОбластьГрафикЗаголовок.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
	ОбластьГрафикЗаголовок.Шрифт = ПолужирныйШрифт;
	#Удаление
	ОбластьГрафикЗаголовок.Текст = НСтр("ru = 'Плановый график работы: '") + Объект.ПлановыйГрафикРаботы;
	#КонецУдаления
	#Вставка
	ОбластьГрафикЗаголовок.Текст = НСтр("es='El gráfico planificado del trabajo: ';ru='Плановый график работы: ';en='Scheduled work schedule: '") + Объект.ПлановыйГрафикРаботы;
	#КонецВставки

	ОбластьГрафикЗаголовок.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;

	ОбластьНормироватьЗаголовок = ОбластьПараметров.Область(4,2,4,17);
	ОбластьНормироватьЗаголовок.Объединить();
	ОбластьНормироватьЗаголовок.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
	ОбластьНормироватьЗаголовок.Шрифт = ПолужирныйШрифт;
	#Удаление
	ОбластьНормироватьЗаголовок.Текст = НСтр("ru = 'Нормировать интервалы между ремонтами: '") + ?(Нормировать, НСтр("ru = 'Да'"), НСтр("ru = 'Нет'"));
	#КонецУдаления
	#Вставка
	ОбластьНормироватьЗаголовок.Текст = НСтр("es='Normar los intervalos entre las reparaciones: ';ru='Нормировать интервалы между ремонтами: ';en='Normalize the intervals between repairs: '") + ?(Нормировать, НСтр("es='Sí';ru='Да';en='Yes'"), НСтр("es='No';ru='Нет';en='No'"));
	#КонецВставки

	ОбластьНормироватьЗаголовок.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;

	ОбластьВРЗаголовок = ОбластьПараметров.Область(5,2,5,17);
	ОбластьВРЗаголовок.Объединить();
	ОбластьВРЗаголовок.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
	ОбластьВРЗаголовок.Шрифт = ПолужирныйШрифт;

	ПредставлениеПланируемыхРемонтов = "";
	Для Каждого ПланируемыйВР Из СписокВидовРемонтов Цикл
		ПредставлениеВР = торо_ЗаполнениеДокументов.ПолучитьПредоставленияВРДляПечати(ПланируемыйВР.Значение);
		ПредставлениеПланируемыхРемонтов = ?(ПредставлениеПланируемыхРемонтов = "", ПредставлениеПланируемыхРемонтов, ПредставлениеПланируемыхРемонтов + "; ") + ПредставлениеВР;
	КонецЦикла;

	#Удаление
	ОбластьВРЗаголовок.Текст = НСтр("ru = 'Планируемые виды ремонтов: '") + ПредставлениеПланируемыхРемонтов;
	#КонецУдаления
	#Вставка
	ОбластьВРЗаголовок.Текст = НСтр("es='Los tipos planeados de las reparaciones: ';ru='Планируемые виды ремонтов: ';en='Planned types of repairs: '") + ПредставлениеПланируемыхРемонтов;
	#КонецВставки

	ОбластьВРЗаголовок.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
	ОбластьВРЗаголовок.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;

	ОбластьОтображВР = ОбластьПараметров.Область(6,2,6,17);
	ОбластьОтображВР.Объединить();
	ОбластьОтображВР.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
	ОбластьОтображВР.Шрифт = ПолужирныйШрифт;
	ОбластьОтображВР.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
	ОбластьОтображВР.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;

	ОтображаемыеВР = Новый СписокЗначений;
	ОтображаемыеВРТекст = "";
	Для Каждого ЗапланированныйРемонт Из ЗапланированныеРемонты Цикл
		Если ЗапланированныйРемонт.Выбран Тогда
			ПредставлениеВР = торо_ЗаполнениеДокументов.ПолучитьПредоставленияВРДляПечати(ЗапланированныйРемонт.ВидРемонтныхРабот);
			ОтображаемыеВР.Добавить(ЗапланированныйРемонт.ВидРемонтныхРабот, ПредставлениеВР);
			ОтображаемыеВРТекст = ?(ОтображаемыеВРТекст = "", ОтображаемыеВРТекст, ОтображаемыеВРТекст + "; ") + ПредставлениеВР;
		КонецЕсли;
	КонецЦикла;
	#Удаление
	ОбластьОтображВР.Текст = НСтр("ru = 'Отображаемые ремонты: '") + ОтображаемыеВРТекст;
	#КонецУдаления
	#Вставка
	ОбластьОтображВР.Текст = НСтр("es='Las reparaciones representadas: ';ru='Отображаемые ремонты: ';en='Displayed repairs: '") + ОтображаемыеВРТекст;
	#КонецВставки

	ТабДок.Вывести(ОбластьПараметров);

	ПолеМнемосхемы.ИспользоватьСетку = Ложь;
	ГрафСхема = ПолеМнемосхемы.ПолучитьКартинку();
	ПолеМнемосхемы.ИспользоватьСетку = Истина;

	ОбластьКартинка = ТабДок.ПолучитьОбласть(13,2,13,КолвоКолонокМнемосхемы+1);
	Рис = Областькартинка.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
	Рис.Картинка = ГрафСхема;
	Рис.РазмерКартинки  = РазмерКартинки.Пропорционально;
	Рис.Расположить(ТабДок.Область(2,2,2,КолвоКолонокМнемосхемы+1));
	Рис.Высота = (50+ (90*КолСтрокСхемы) + 20)/4;
	Рис.ГраницаСверху = Ложь;
	Рис.ГраницаСлева = Ложь;
	рис.ГраницаСнизу = Ложь;
	Рис.ГраницаСправа = Ложь;

	ТабДок.Вывести(ОбластьКартинка);

	НарисоватьТаблицу(ТабДок);

	Для Каждого Элемент Из ОтображаемыеВР Цикл
		ОбластьРасшифровкаКода = ТабДок.ПолучитьОбласть(ТабДок.ВысотаТаблицы + 1 ,2,	ТабДок.ВысотаТаблицы + 2, 17);
		ОбластьКод = ОбластьРасшифровкаКода.Область(2,2,2, 17);
		ОбластьКод.Объединить();
		ОбластьКод.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
		ОбластьКод.Шрифт = Новый Шрифт("Arial", 9, Ложь);
		ОбластьКод.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
		ОбластьКод.Текст = СокрЛП(Элемент.Значение.Код) + " - " + Элемент.Значение;
		ТабДок.Вывести(ОбластьРасшифровкаКода);
	КонецЦикла;


	ТабДок.ОтображатьСетку = Ложь;
	табДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.КлючПараметровПечати = "торо_РемонтныеГруппы_Визуализация";
	ТабДок.ИмяПараметровПечати = "торо_РемонтныеГруппы_Визуализация";

	Возврат ТабДок;

КонецФункции

&НаСервере
&ИзменениеИКонтроль("ДополнитьЗаголовокФормыСостояниемОР")
Процедура Расш_гкс_ДополнитьЗаголовокФормыСостояниемОР()

	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		#Вставка
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(торо_ТекущееСостояниеОРСрезПоследних.ВидЭксплуатации, ЗНАЧЕНИЕ(Справочник.торо_ВидыЭксплуатации.ПустаяСсылка)) КАК ВидЭксплуатации,
		|	торо_Переводы.Текст КАК Текст
		|ИЗ
		|	РегистрСведений.торо_ТекущееСостояниеОР.СрезПоследних(&ТекущаяДата, ОбъектРемонта = &ОбъектРемонта) КАК торо_ТекущееСостояниеОРСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_Переводы КАК торо_Переводы
		|		ПО (торо_ТекущееСостояниеОРСрезПоследних.ВидЭксплуатации = торо_Переводы.ID
		|				И торо_Переводы.Реквизит = ""Наименование""
		|				И торо_Переводы.Язык = &Язык)";
		Запрос.УстановитьПараметр("ОбъектРемонта",Объект.Ссылка);
		Запрос.УстановитьПараметр("Язык",торо_ОбщегоНазначенияПовтИсп.ТекущийЯзыкИБ());
		Запрос.УстановитьПараметр("ТекущаяДата",ОбщегоНазначения.ТекущаяДатаПользователя());
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Если Выборка.ВидЭксплуатации = Справочники.торо_ВидыЭксплуатации.ПустаяСсылка() Тогда
				ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + НСтр("es=' [El tipo de la explotación no es establecido]';ru=' [Вид эксплуатации не установлен]';en=' [Type of operation is not set]'");
			Иначе
				Если ЗначениеЗаполнено(Выборка.Текст) Тогда 
					ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + " [" + Выборка.Текст + "]";
				Иначе
					ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + " [" + Выборка.ВидЭксплуатации + "]";
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		#КонецВставки

		#Удаление
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(торо_ТекущееСостояниеОРСрезПоследних.ВидЭксплуатации, ЗНАЧЕНИЕ(Справочник.торо_ВидыЭксплуатации.ПустаяСсылка)) КАК ВидЭксплуатации
		|ИЗ
		|	РегистрСведений.торо_ТекущееСостояниеОР.СрезПоследних(&ТекущаяДата, ОбъектРемонта = &ОбъектРемонта) КАК торо_ТекущееСостояниеОРСрезПоследних";
		Запрос.УстановитьПараметр("ОбъектРемонта",Объект.Ссылка);
		Запрос.УстановитьПараметр("ТекущаяДата",ОбщегоНазначения.ТекущаяДатаПользователя());
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.ВидЭксплуатации = Справочники.торо_ВидыЭксплуатации.ПустаяСсылка() Тогда
				ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + НСтр("ru = ' [Вид эксплуатации не установлен]'");
			Иначе
				ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + " [" + Выборка.ВидЭксплуатации + "]";
			КонецЕсли;
		КонецЕсли;
		#КонецУдаления

		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_Ремонты.ID КАК ID,
		|	торо_Ремонты.ОбъектРемонта КАК ОбъектРемонта,
		|	торо_Ремонты.Регистратор КАК Регистратор,
		|	1 КАК Приоритет
		|ИЗ
		|	РегистрСведений.торо_Ремонты КАК торо_Ремонты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗавершенныеРемонтныеРаботы КАК торо_ЗавершенныеРемонтныеРаботы
		|		ПО торо_Ремонты.ID = торо_ЗавершенныеРемонтныеРаботы.ID
		|ГДЕ
		|	торо_Ремонты.ОбъектРемонта = &ОбъектРемонта
		|	И торо_Ремонты.Регистратор ССЫЛКА Документ.торо_ВыявленныеДефекты
		|	И торо_ЗавершенныеРемонтныеРаботы.Регистратор ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_Ремонты.ID,
		|	торо_Ремонты.ОбъектРемонта,
		|	торо_Ремонты.Регистратор,
		|	2
		|ИЗ
		|	РегистрСведений.торо_Ремонты КАК торо_Ремонты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗавершенныеРемонтныеРаботы КАК торо_ЗавершенныеРемонтныеРаботы
		|		ПО торо_Ремонты.ID = торо_ЗавершенныеРемонтныеРаботы.ID
		|ГДЕ
		|	торо_Ремонты.ОбъектРемонта = &ОбъектРемонта
		|	И торо_Ремонты.Регистратор ССЫЛКА Документ.торо_НарядНаВыполнениеРемонтныхРабот
		|	И торо_ЗавершенныеРемонтныеРаботы.Регистратор ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет УБЫВ";

		Запрос.УстановитьПараметр("ОбъектРемонта", Объект.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.Приоритет = 1 Тогда
				#Удаление
				ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + НСтр("ru = ' [Выявлен дефект]'");
				#КонецУдаления
				#Вставка
				ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + НСтр("es=' [Es revelado el defecto]';ru=' [Выявлен дефект]';en=' [Defect detected]'");
				#КонецВставки
			Иначе
				#Удаление
				ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + НСтр("ru = ' [Выполняется ремонт]'");
				#КонецУдаления
				#Вставка
				ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + НСтр("es=' [Se cumple la reparación]';ru=' [Выполняется ремонт]';en=' [Repairs are in progress]'");
				#КонецВставки
			КонецЕсли;			
		Иначе
			#Удаление
			ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + НСтр("ru = ' [Работает]'");
			#КонецУдаления
			#Вставка
			ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + НСтр("es=' [Trabaja]';ru=' [Работает]';en=' [Active]'");
			#КонецВставки
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ОбновитьЖурналНаработки")
Процедура Расш_гкс_ОбновитьЖурналНаработки(Команда)

	#Вставка
	Если торо_ОбщегоНазначенияПовтИсп.ПолучитьПеречисление("торо_ТипыОбъектовRCM","ФункциональноеМесто") = Объект.ТипОбъекта Тогда 
		МассивСтрокНаработки = ПолучитьМассивДокументовНаработкиФМ(Объект.Ссылка);
	Иначе
	#КонецВставки
	МассивСтрокНаработки = ПолучитьМассивДокументовНаработки(Объект.Ссылка);
	#Вставка
	КонецЕсли;
	#КонецВставки

	ТабВыработкиОбъектаРемонта.Очистить();
	Для каждого Элемент Из МассивСтрокНаработки Цикл
		НС = ТабВыработкиОбъектаРемонта.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Элемент);
	КонецЦикла;

	СписокПараметровНаработкиПриАктивизацииСтроки(Истина);
	ОбновитьЗначенияИзноса();

КонецПроцедуры


&НаСервере
&ИзменениеИКонтроль("ЗаписатьПоказателиЭксплуатации")
Процедура Расш_гкс_ЗаписатьПоказателиЭксплуатации(ТекОбъект, Отказ)

	Если МодифицированностьПараметровНаработки Тогда
		#Вставка
		НаборЗаписейгкс_ТегиНаработки = РегистрыСведений.гкс_ТегиНаработки.СоздатьНаборЗаписей();
		НаборЗаписейгкс_ТегиНаработки.Отбор.ОР.Установить(Объект.Ссылка);
		Для каждого Строка из СписокПараметровНаработки Цикл
			Если ЗначениеЗаполнено(Строка.гкс_Тег) Тогда 
				НоваяСтрокаНабораЗаписей = НаборЗаписейгкс_ТегиНаработки.Добавить();
				НоваяСтрокаНабораЗаписей.ОР = Объект.Ссылка;
				НоваяСтрокаНабораЗаписей.Тег = Строка.гкс_Тег;
				НоваяСтрокаНабораЗаписей.ПараметрНаработки = Строка.Показатель;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Строка.ОбъектРемонта) Тогда
				Строка.ОбъектРемонта = ТекОбъект;
			КонецЕсли;
		КонецЦикла;
		НаборЗаписейгкс_ТегиНаработки.Записать();
		#КонецВставки

		Попытка
			ТаблицаЗначенийПараметровНаработки = СписокПараметровНаработки.Выгрузить();
			МассивСтрокПараметров = ТаблицаЗначенийПараметровНаработки.НайтиСтроки(Новый Структура("ОбъектРемонта", ТекОбъект));
			ТаблицаБуфер = ТаблицаЗначенийПараметровНаработки.Скопировать(МассивСтрокПараметров);

			НаборПараметровНаработки = РегистрыСведений.торо_ПараметрыНаработкиОбъектовРемонта.СоздатьНаборЗаписей();
			НаборПараметровНаработки.Отбор.ОбъектРемонта.Установить(ТекОбъект);
			НаборПараметровНаработки.Загрузить(ТаблицаБуфер);
			НаборПараметровНаработки.Записать();

			МодифицированностьПараметровНаработки = Ложь;
		Исключение
			ТекстСообщения = НСтр("es='No consiguió anotar los parámetros de la elaboración: ';ru='Не удалось записать параметры наработки: ';en='Failed to write running hours: '") + ОписаниеОшибки();
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			Возврат;
		КонецПопытки;

	КонецЕсли;

	Если МодифицированностьМаксЗначНаработки Тогда

		Для каждого Строка из ТабМаксимальныхЗначенийНаработки Цикл
			Если НЕ ЗначениеЗаполнено(Строка.ОбъектРемонта) Тогда
				Строка.ОбъектРемонта = ТекОбъект;
			КонецЕсли;
		КонецЦикла;

		Попытка
			ТабМаксЗнач = ТабМаксимальныхЗначенийНаработки.Выгрузить();
			// Удалить строки, которые могут быть получены из параметров Типовго ОР и не прописаны для текущего ОР.

			ПараметрыОтбора = Новый Структура("ОбъектРемонта", ТекОбъект);
			ВременнаяТЗ = ТабМаксЗнач.Скопировать(ПараметрыОтбора);
			ТабМаксЗнач.Очистить();
			ТабМаксЗнач = ВременнаяТЗ.Скопировать();

			НаборКонтролируемыхПоказателей = РегистрыСведений.торо_МаксимальныеЗначенияНаработкиОР.СоздатьНаборЗаписей();
			НаборКонтролируемыхПоказателей.Отбор.ОбъектРемонта.Установить(ТекОбъект);
			НаборКонтролируемыхПоказателей.Загрузить(ТабМаксЗнач);
			НаборКонтролируемыхПоказателей.Записать();

			МодифицированностьМаксЗначНаработки = Ложь;
		Исключение
			ТекстСообщения = НСтр("es='No consiguió anotar los significados máximos de la elaboración: ';ru='Не удалось записать максимальные значения наработки: ';en='Failed to record maximum running hours: '") + ОписаниеОшибки();
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			Возврат;
		КонецПопытки;

	КонецЕсли;

	Если МодифицированностьИзмеряемыхПоказателей Тогда		

		#Вставка
		НаборЗаписейРегистрагкс_ТегиПоказателей = РегистрыСведений.гкс_ТегиПоказателей.СоздатьНаборЗаписей();
		НаборЗаписейРегистрагкс_ТегиПоказателей.Отбор.ОР.Установить(Объект.Ссылка);
		Для каждого Строка из СписокИзмеряемыхПоказателей Цикл
			Если ЗначениеЗаполнено(Строка.гкс_Тег) Тогда 
				НоваяСтрокаНабораЗаписей = НаборЗаписейРегистрагкс_ТегиПоказателей.Добавить();
				НоваяСтрокаНабораЗаписей.ОР = Объект.Ссылка;
				НоваяСтрокаНабораЗаписей.Тег = Строка.гкс_Тег;
				НоваяСтрокаНабораЗаписей.Показатель = Строка.Показатель;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Строка.ОбъектРемонта) Тогда
				Строка.ОбъектРемонта = ТекОбъект;
			КонецЕсли;
		КонецЦикла;
		НаборЗаписейРегистрагкс_ТегиПоказателей.Записать();
		#КонецВставки

		Попытка
			ЗаписиОР = СписокИзмеряемыхПоказателей.НайтиСтроки(Новый Структура("ОбъектРемонта", ТекОбъект));

			НаборКонтролируемыхПоказателей = РегистрыСведений.торо_ИзмеряемыеПоказателиОбъектовРемонта.СоздатьНаборЗаписей();
			НаборКонтролируемыхПоказателей.Отбор.ОбъектРемонта.Установить(ТекОбъект);
			НаборКонтролируемыхПоказателей.Прочитать();
			НаборКонтролируемыхПоказателей.Очистить();

			Для Каждого СтрПоказателя Из ЗаписиОР Цикл
				Если СтрПоказателя.ИзТиповогоОР И НЕ СтрПоказателя.ЗначенияКонтролируемыхПоказателейИзОР И НЕ СтрПоказателя.Удален Тогда
					Продолжить;
				КонецЕсли;
				ЗаполнитьЗначенияСвойств(НаборКонтролируемыхПоказателей.Добавить(),СтрПоказателя);
			КонецЦикла;

			НаборКонтролируемыхПоказателей.Записать();

			МодифицированностьИзмеряемыхПоказателей = Ложь;
		Исключение
			ТекстСообщения = НСтр("es='No consiguió anotar los índices controlados: ';ru='Не удалось записать контролируемые показатели: ';en='Failed to record monitored metrics: '") + ОписаниеОшибки();
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			Возврат;
		КонецПопытки;

	КонецЕсли;

	Если МодифицированностьПараметровОповещенияОСостоянииОР Тогда

		Для каждого Строка из ПараметрыОповещенияПоСостояниямОР Цикл
			Если НЕ ЗначениеЗаполнено(Строка.ОбъектРемонта) Тогда
				Строка.ОбъектРемонта = ТекОбъект;
			КонецЕсли;
		КонецЦикла;

		Попытка
			ТаблицаПараметровОповещения = ПараметрыОповещенияПоСостояниямОР.Выгрузить(Новый Структура("ТиповойОР", Справочники.торо_ТиповыеОР.ПустаяСсылка()));

			НаборПараметровОповещения = РегистрыСведений.торо_ПараметрыОповещенияОСостоянииОборудования.СоздатьНаборЗаписей();
			НаборПараметровОповещения.Отбор.ОбъектРемонта.Установить(ТекОбъект);
			НаборПараметровОповещения.Загрузить(ТаблицаПараметровОповещения);
			НаборПараметровОповещения.Записать();

			МодифицированностьПараметровОповещенияОСостоянииОР = Ложь;
		Исключение
			ТекстСообщения = НСтр("es='No consiguió anotar los parámetros del aviso sobre el estado de la maquinaria: ';ru='Не удалось записать параметры оповещения о состоянии оборудования: ';en='Failed to record equipment status alert parameters: '") + ОписаниеОшибки();
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			Возврат;
		КонецПопытки;

	КонецЕсли;

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПроверитьЗаполненностьПараметровНаработки")
Функция Расш_гкс_ПроверитьЗаполненностьПараметровНаработки(ТабПараметрыНаработкиОбъектовРемонта)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	торо_ТиповыеОРНормативныеРемонты.ВидРемонта КАК ВидРемонта,
	|	торо_ТиповыеОРНормативныеРемонты.Ссылка КАК ТиповойОР
	|ПОМЕСТИТЬ РассчитываемыеПоНаработке
	|ИЗ
	|	Справочник.торо_ТиповыеОР.НормативныеРемонты КАК торо_ТиповыеОРНормативныеРемонты
	|ГДЕ
	|	торо_ТиповыеОРНормативныеРемонты.ВидРемонта = &ВР
	|	И торо_ТиповыеОРНормативныеРемонты.Ссылка = &Ссылка
	|	И торо_ТиповыеОРНормативныеРемонты.СпособПланирования.ИспользоватьПараметрыНаработки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Ссылка КАК ОбъектРемонта,
	|	ТабПараметрыНаработки.Показатель КАК Показатель,
	|	ТабПараметрыНаработки.Период КАК Период,
	|	ТабПараметрыНаработки.ПлановаяНаработка КАК ПлановаяНаработка,
	|	ТабПараметрыНаработки.ПериодПлановойНаработки КАК ПериодПлановойНаработки,
	|	ТабПараметрыНаработки.ПродолжительностьПериодаПлановойНаработки КАК ПродолжительностьПериодаПлановойНаработки,
	|	ТабПараметрыНаработки.КоэффициентИспользованияОборудования КАК КоэффициентИспользованияОборудования
	|ПОМЕСТИТЬ ТабПараметрыНаработки
	|ИЗ
	|	&ТабПараметрыНаработки КАК ТабПараметрыНаработки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РассчитываемыеПоНаработке.ВидРемонта КАК ВидРемонта,
	|	торо_ПараметрыНаработкиОбъектовРемонта.Показатель КАК Показатель
	|ПОМЕСТИТЬ ПараметрыПлановойНаработки
	|ИЗ
	|	РассчитываемыеПоНаработке КАК РассчитываемыеПоНаработке
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабПараметрыНаработки КАК торо_ПараметрыНаработкиОбъектовРемонта
	|		ПО (торо_ПараметрыНаработкиОбъектовРемонта.ОбъектРемонта = РассчитываемыеПоНаработке.ТиповойОР)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПараметрыПлановойНаработки.ВидРемонта КАК ВидРемонта
	|ИЗ
	|	ПараметрыПлановойНаработки КАК ПараметрыПлановойНаработки
	|ГДЕ
	|	ПараметрыПлановойНаработки.Показатель = NULL";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("ВР", ВРНачалоЦикла);
	Запрос.УстановитьПараметр("ТабПараметрыНаработки", ТабПараметрыНаработкиОбъектовРемонта);
	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Количество() > 0 Тогда
		#Удаление
		ТекстСообщения = НСтр("ru = 'Проверьте заполненность показателей плановой наработки.'");
		#КонецУдаления
		#Вставка
		ТекстСообщения = НСтр("es='Comprueben заполненность de los índices de la elaboración planificada.';
			|ru='Проверьте заполненность показателей плановой наработки.';
			|en='Check the completeness of the indicators of the planned operating time.'");
		#КонецВставки

		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	Иначе
		СтруктураВозврата = торо_РаботаСНаработкой.ОбновитьНаработку(Объект.Ссылка, Объект.ТиповойОР);
		Если СтруктураВозврата.Количество() <> 0 Тогда
			Для Каждого Строка из СтруктураВозврата Цикл
				Если Не ЗначениеЗаполнено(Строка.Период) ИЛИ Не ЗначениеЗаполнено(Строка.ПлановаяНаработка) ИЛИ Не ЗначениеЗаполнено(Строка.ПродолжительностьПериодаПлановойНаработки) Тогда
					#Удаление
					ТекстСообщения = НСтр("ru = 'Проверьте заполненность показателей плановой наработки.'");
					#КонецУдаления
					#Вставка
					ТекстСообщения = НСтр("es='Comprueben заполненность de los índices de la elaboración planificada.';
						|ru='Проверьте заполненность показателей плановой наработки.';
						|en='Check the completeness of the indicators of the planned operating time.'");
					#КонецВставки

					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
					Возврат Ложь;
				Иначе
					Возврат Истина;
				КонецЕсли;
			КонецЦикла;
		Иначе
			#Удаление
			ТекстСообщения = НСтр("ru = 'Проверьте заполненность показателей плановой наработки.'");
			#КонецУдаления
			#Вставка
			ТекстСообщения = НСтр("es='Comprueben заполненность de los índices de la elaboración planificada.';
				|ru='Проверьте заполненность показателей плановой наработки.';
				|en='Check the completeness of the indicators of the planned operating time.'");
			#КонецВставки

			ОбщегоНазначения.СообщитьПользователю();
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
КонецФункции

// гкс+ [Релиз20] Деснол
&НаКлиенте
&ИзменениеИКонтроль("СписокПараметровНаработкиПередУдалением")
Процедура гкс_СписокПараметровНаработкиПередУдалением(Элемент, Отказ)

	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		#Удаление
		ДанныеНаработки = ТабВыработкиОбъектаРемонта.НайтиСтроки(Новый Структура("Показатель",ТекДанные.Показатель));
		Если ДанныеНаработки.Количество() > 0 Тогда
			ТекстСообщения = НСтр("es='No es posible quitar el índice, si por él es introducida ya la elaboración.';ru='Нельзя удалить показатель, если по нему уже введена наработка.';en='Can not delete a metric if you have already entered a run time for it.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			Возврат;
		КонецЕсли;
		#КонецУдаления

		НайденныеСтроки = СписокПараметровНаработки.НайтиСтроки(Новый Структура("ОбъектРемонта, Показатель", ТекДанные.ОбъектРемонта, ТекДанные.Показатель));
		Если НайденныеСтроки.Количество() = 1 Тогда
			НайденныеСтроки = ТабМаксимальныхЗначенийНаработки.НайтиСтроки(Новый Структура("ОбъектРемонта, Показатель", ТекДанные.ОбъектРемонта, ТекДанные.Показатель));
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				ТабМаксимальныхЗначенийНаработки.Удалить(НайденнаяСтрока);
			КонецЦикла;
			МодифицированностьМаксЗначНаработки = Истина;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // гкс- [Релиз20]

// гкс+ [] Деснол 24.08.2022
&НаСервере
&ИзменениеИКонтроль("УстановитьПараметрыЗапросовНаСервере")
Процедура гкс_УстановитьПараметрыЗапросовНаСервере()
	#Вставка
	ТекИерархия = Константы.торо_ИерархияДляВводаНовыхОР.Получить();
	
	Если ТекИерархия.ИзменяетсяДокументами Тогда 
		ТекстЗапросаПодчиненных = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.ОбъектИерархии КАК ОР,
		|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.РодительИерархии КАК Родитель
		|ПОМЕСТИТЬ ВсяИерархия
		|ИЗ
		|	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(
		|			,
		|			СтруктураИерархии = &Структура) КАК торо_РасположениеОРВСтруктуреИерархииСрезПоследних"+"
		|;
		| ";
	Иначе
		ТекстЗапросаПодчиненных = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_ИерархическиеСтруктурыОР.ОбъектИерархии КАК ОР
		|	торо_ИерархическиеСтруктурыОР.РодительИерархии КАК Родитель
		|ПОМЕСТИТЬ ВсяИерархия
		|ИЗ
		|	РегистрСведений.торо_ИерархическиеСтруктурыОР КАК торо_ИерархическиеСтруктурыОР
		|ГДЕ
		|	торо_ИерархическиеСтруктурыОР.СтруктураИерархии = &Структура  "+"
		|;
		| ";
	КонецЕсли;
	ТекстЗапросаПодчиненных = ТекстЗапросаПодчиненных + "Выбрать ВсяИерархия.ОР КАК ОР
	|Поместить Уровень1
	|ИЗ ВсяИерархия КАК ВсяИерархия
	|Где ВсяИерархия.Родитель = &Ссылка
	| ; 
	|Выбрать ВсяИерархия.ОР КАК ОР
	|Поместить Уровень2
	|ИЗ Уровень1 КАК Уровень1
	|	Внутреннее соединение ВсяИерархия КАК ВсяИерархия
	|	ПО ВсяИерархия.Родитель = Уровень1.ОР
	| ; 
	|Выбрать ВсяИерархия.ОР КАК ОР
	|Поместить Уровень3
	|ИЗ Уровень2 КАК Уровень1
	|	Внутреннее соединение ВсяИерархия КАК ВсяИерархия
	|	ПО ВсяИерархия.Родитель = Уровень1.ОР
	| ; 
	|Выбрать ВсяИерархия.ОР КАК ОР
	|Поместить Уровень4
	|ИЗ Уровень3 КАК Уровень1
	|	Внутреннее соединение ВсяИерархия КАК ВсяИерархия
	|	ПО ВсяИерархия.Родитель = Уровень1.ОР
	| ; 
	|Выбрать Различные
	|ВсяИерархия.ОР КАК ОР
	|ИЗ Уровень4 КАК Уровень1
	|	Внутреннее соединение ВсяИерархия КАК ВсяИерархия
	|	ПО ВсяИерархия.Родитель = Уровень1.ОР
	|
	|Объединить все
	|
	|Выбрать Различные
	|Уровень4.ОР
	|ИЗ Уровень4 КАК Уровень4
	|
	|Объединить все
	|
	|Выбрать Различные
	|Уровень3.ОР
	|ИЗ Уровень3 КАК Уровень3
	|
	|Объединить все
	|
	|Выбрать Различные
	|Уровень2.ОР
	|ИЗ Уровень2 КАК Уровень2
	|
	|Объединить все
	|
	|Выбрать Различные
	|Уровень1.ОР
	|ИЗ Уровень1 КАК Уровень1
	|";
	Запрос = Новый Запрос();
	Запрос.Текст = ТекстЗапросаПодчиненных;
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Структура", ТекИерархия);
	// гкс+ [] Деснол 10.10.2022
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		МассивОР = Новый Массив();
		Пока Выборка.Следующий() Цикл
			МассивОР.Добавить(Выборка.ОР);
		КонецЦикла;
		МассивОР.Добавить(Объект.Ссылка);
	Иначе
		МассивОР = Новый Массив();
	КонецЕсли;
	// гкс- [] Деснол 10.10.2022
	#КонецВставки

	Кнопка = Элементы.ЗаявкиНаРемонтОтображатьТолькоПроведенныеЗаявки;
	ЗаявкиНаРемонт.Параметры.УстановитьЗначениеПараметра("ОтображатьТолькоПроведенные", Кнопка.Пометка);
	ЗаявкиНаРемонт.Параметры.УстановитьЗначениеПараметра("ОбъектРемонта", Объект.Ссылка);

	Кнопка = Элементы.ВыявленныеДефектыОтображатьТолькоПроведенныеДефекты;
	ВыявленныеДефекты.Параметры.УстановитьЗначениеПараметра("ОбъектРемонта", Объект.Ссылка);
	ВыявленныеДефекты.Параметры.УстановитьЗначениеПараметра("ОтображатьТолькоПроведенные", Кнопка.Пометка);

	Кнопка = Элементы.ВыполненныеРемонтыОтображатьТолькоПроведенныеАкты;
	ВыполненныеРемонты.Параметры.УстановитьЗначениеПараметра("ОтображатьТолькоПроведенные", Кнопка.Пометка);
	ВыполненныеРемонты.Параметры.УстановитьЗначениеПараметра("ОбъектРемонта", Объект.Ссылка);                             

	Кнопка = Элементы.ПредстоящиеРемонтыОтображатьТолькоПроведенныеППР;
	ПредстоящиеРемонты.Параметры.УстановитьЗначениеПараметра("ОтображатьТолькоПроведенные", Кнопка.Пометка);
	ПредстоящиеРемонты.Параметры.УстановитьЗначениеПараметра("ОбъектРемонта", Объект.Ссылка);
	ПредстоящиеРемонты.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ТекущаяДата());

	Кнопка = Элементы.ПредстоящиеРегМероприятияОтображатьТолькоПроведенныеРМ;
	ПредстоящиеРегМероприятия.Параметры.УстановитьЗначениеПараметра("ОтображатьТолькоПроведенные", Кнопка.Пометка);
	ПредстоящиеРегМероприятия.Параметры.УстановитьЗначениеПараметра("ОбъектРемонта", Объект.Ссылка);
	ПредстоящиеРегМероприятия.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ТекущаяДата());

	Кнопка = Элементы.НарядыОтображатьТолькоПроведенныеНаряды;
	НарядыНаВыполнениеРемонтныхРабот.Параметры.УстановитьЗначениеПараметра("ОтображатьТолькоПроведенные", Кнопка.Пометка);
	НарядыНаВыполнениеРемонтныхРабот.Параметры.УстановитьЗначениеПараметра("ОбъектРемонта", Объект.Ссылка);

	Кнопка = Элементы.АктыПриемкиОтображатьТолькоПроведенныеАкты;
	АктыПриемкиОборудования.Параметры.УстановитьЗначениеПараметра("ОтображатьТолькоПроведенные", Кнопка.Пометка);
	АктыПриемкиОборудования.Параметры.УстановитьЗначениеПараметра("ОбъектРемонта", Объект.Ссылка);

	Кнопка = Элементы.НарядыРМОтображатьТолькоПроведенные;
	НарядыНаРегМероприятия.Параметры.УстановитьЗначениеПараметра("ОтображатьТолькоПроведенные", Кнопка.Пометка);
	НарядыНаРегМероприятия.Параметры.УстановитьЗначениеПараметра("ОбъектРемонта", Объект.Ссылка);

	Кнопка = Элементы.ВыполненныеРМОтображатьТолькоПроведенные;
	ВыполненныеРегМероприятия.Параметры.УстановитьЗначениеПараметра("ОтображатьТолькоПроведенные", Кнопка.Пометка);
	ВыполненныеРегМероприятия.Параметры.УстановитьЗначениеПараметра("ОбъектРемонта", Объект.Ссылка);

	#Вставка
	ЗаявкиНаРемонт.Параметры.УстановитьЗначениеПараметра("ОбъектРемонта", МассивОР);
	ВыявленныеДефекты.Параметры.УстановитьЗначениеПараметра("ОбъектРемонта", МассивОР);
	ВыполненныеРемонты.Параметры.УстановитьЗначениеПараметра("ОбъектРемонта", МассивОР);                             
	ПредстоящиеРемонты.Параметры.УстановитьЗначениеПараметра("ОбъектРемонта", МассивОР);
	ПредстоящиеРегМероприятия.Параметры.УстановитьЗначениеПараметра("ОбъектРемонта", МассивОР);
	НарядыНаВыполнениеРемонтныхРабот.Параметры.УстановитьЗначениеПараметра("ОбъектРемонта", МассивОР);
	АктыПриемкиОборудования.Параметры.УстановитьЗначениеПараметра("ОбъектРемонта", МассивОР);
	НарядыНаРегМероприятия.Параметры.УстановитьЗначениеПараметра("ОбъектРемонта", МассивОР);
	ВыполненныеРегМероприятия.Параметры.УстановитьЗначениеПараметра("ОбъектРемонта", МассивОР);
	#КонецВставки
КонецПроцедуры
// гкс- [] Деснол 24.08.2022

// гкс+ [04.23] Деснол 14.04.2023
&НаКлиенте
Процедура гкс_СоздатьТМ(Команда)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Если ЗначениеЗаполнено(ЭтотОбъект["гкс_ТМ"]) Тогда 
			Элементы["гкс_СоздатьТМКнопка"].Видимость = Ложь;
			Возврат;
		КонецЕсли;
		ОпОп = Новый ОписаниеОповещения("гкс_СоздатьТМПослеВопроса", ЭтотОбъект);
		ПоказатьВопрос(ОпОп, "Для объекта будет создано собственное техническое место. Редактироваться оно будет отдельно. Процесс необратим. Продолжить?", РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры // гкс- [04.23] Деснол 14.04.2023

// гкс+ [04.23] Деснол 14.04.2023
&НаКлиенте
Процедура гкс_СоздатьТМПослеВопроса(Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда 
		Элементы["гкс_СоздатьТМКнопка"].Видимость = Ложь;
		Элементы["гкс_ТМ"].Видимость = Истина;
		Элементы["гкс_ТМФМ"].Видимость = Ложь;
		гкс_СкопироватьТМ();
	КонецЕсли;
КонецПроцедуры // гкс- [04.23] Деснол 14.04.2023

// гкс+ [04.23] Деснол 14.04.2023
&НаСервере
Процедура гкс_СкопироватьТМ()
	Если ЗначениеЗаполнено(ЭтотОбъект["гкс_ТМФМ"]) Тогда 
		ОбъектТехническоеМесто = ЭтотОбъект["гкс_ТМФМ"].Скопировать();
		ОбъектТехническоеМесто.Наименование = Объект.Ссылка;
		ОбъектТехническоеМесто.Записать();
	Иначе
		ОбъектТехническоеМесто = Справочники.гкс_ТехническиеМеста.СоздатьЭлемент();
		ОбъектТехническоеМесто.Наименование = Объект.Ссылка;
		ОбъектТехническоеМесто.Записать();
	КонецЕсли;
	ЭтотОбъект["гкс_ТМ"] = ОбъектТехническоеМесто.Ссылка;
	
	ТекущееФункциональноеМесто = гкс_ПроверкаФункциональныхМест.НайтиФМ(Объект.Ссылка);
	НаборЗаписейРегистрагкс_ТекущиеФМОР = РегистрыСведений.гкс_ТекущиеФМОР.СоздатьНаборЗаписей();
	НаборЗаписейРегистрагкс_ТекущиеФМОР.Отбор.ОР.Установить(Объект.Ссылка);
	НоваяСтрокаНабораЗаписей = НаборЗаписейРегистрагкс_ТекущиеФМОР.Добавить();
	НоваяСтрокаНабораЗаписей.ОР = Объект.Ссылка;
	НоваяСтрокаНабораЗаписей.ФМ = ТекущееФункциональноеМесто;
	НоваяСтрокаНабораЗаписей.ТМ = ОбъектТехническоеМесто.Ссылка;
	НоваяСтрокаНабораЗаписей.ТМФМ = Неопределено;
	НаборЗаписейРегистрагкс_ТекущиеФМОР.Записать();
КонецПроцедуры // гкс- [04.23] Деснол 14.04.2023



#КонецОбласти
