
#Область ОбработчикиСобытий

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Счетчик", Справочники.Счетчики.СчетчикЧерновиков);
		Запрос.УстановитьПараметр("Объект", Ссылка);
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗначенияСчетчиков.НомерПоСчетчику
			|ИЗ
			|	РегистрСведений.ЗначенияСчетчиков КАК ЗначенияСчетчиков
			|ГДЕ
			|	ЗначенияСчетчиков.Счетчик = &Счетчик
			|	И ЗначенияСчетчиков.Объект = &Объект";
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			НомерПоСчетчику = Результат.НомерПоСчетчику;
		Иначе
			НомерПоСчетчику = ШаблоныСтрокСервер.ПолучитьНовоеЗначениеСчетчика(Справочники.Счетчики.СчетчикЧерновиков, 1);
		КонецЕсли;
	Иначе
		НомерПоСчетчику = ШаблоныСтрокСервер.ПолучитьНовоеЗначениеСчетчика(Справочники.Счетчики.СчетчикЧерновиков, 1);
	КонецЕсли;
	Код = ШаблоныСтрокКлиентСервер.ФорматироватьСтроку(Формат(НомерПоСчетчику, "ЧГ=0"), """Ч""!0000000000000000000");
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Родитель = Справочники.НоменклатураКласса.ПолучитьРодителяПоКлассу(Класс);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если НЕ ЭтоГруппа Тогда
		ЗаписатьЗначенияСчетчиков();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	КонтрольДублейПоНаименованию(Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьЗначенияСчетчиков()
	
	ЗаписатьНомерПоСчетчику = (НомерПоСчетчику > 0);
	ПодчиненРодителю = Ложь;
	НомерРодителя = 0;
	
	РеквизитыКласса = ?(ЗначениеЗаполнено(Класс), 
		УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначенияРеквизитовОбъекта(
			Класс, "СчетчикНоменклатуры, ШаблонКодаНоменклатуры"), Неопределено);
	СчетчикНоменклатурыЗаполнен = 
		ПрисвоенНомерПоШаблону И ЗначениеЗаполнено(Класс) И ЗначениеЗаполнено(РеквизитыКласса.СчетчикНоменклатуры);
	СчетчикНоменклатуры = ?(СчетчикНоменклатурыЗаполнен,
		РеквизитыКласса.СчетчикНоменклатуры, Справочники.Счетчики.СчетчикЧерновиков);
	
	Если ЗаписатьНомерПоСчетчику И СчетчикНоменклатурыЗаполнен Тогда
		СписокРодителей = Справочники.Классы.ПолучитьТаблицуРодителей(Класс, 
			"ШаблонКодаКласса, СчетчикКлассов, ПрисвоенНомерПоШаблону, НомерПоСчетчику, ШагСчетчика");
		УровеньОбъекта  = СписокРодителей.Количество() + 1;
		ШаблонРодителя  = Справочники.Классы.ПолучитьЗначениеРодителя(
			СписокРодителей, УровеньОбъекта - 2, "ШаблонКодаКласса");
		СчетчикРодителя = ШаблоныСтрокСервер.ПолучитьСчетчикДляУровня(
			ШаблонРодителя, УровеньОбъекта - 2, СписокРодителей, "СчетчикКлассов");
		
		РеквизитыРодителя = СписокРодителей[УровеньОбъекта - 2];
		ПодчиненРодителю = (НЕ СчетчикРодителя = Неопределено
		    И СчетчикРодителя.Счетчик = СчетчикНоменклатуры
			И РеквизитыРодителя.ШагСчетчика > ШагСчетчика);
		НомерРодителя = ?(ПодчиненРодителю И РеквизитыРодителя.ПрисвоенНомерПоШаблону, РеквизитыРодителя.НомерПоСчетчику, 0);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", Ссылка);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияСчетчиков.Счетчик,
		|	ЗначенияСчетчиков.НомерПоСчетчику,
		|	ЗначенияСчетчиков.НомерРодителя
		|ИЗ
		|	РегистрСведений.ЗначенияСчетчиков КАК ЗначенияСчетчиков
		|ГДЕ
		|	ЗначенияСчетчиков.Объект = &Объект";
	ЗаписанныеЗначения = Запрос.Выполнить().Выгрузить();
	// Удаляем лишние записи регистра "ЗначенияСчетчиков".
	Если ЗаписанныеЗначения.Количество() > 0 Тогда
		// Из списка удаляемых исключаем правильную запись.
		Если ЗаписатьНомерПоСчетчику Тогда
			Найдено = ЗаписанныеЗначения.НайтиСтроки(Новый Структура("Счетчик", СчетчикНоменклатуры));
			Если Найдено.Количество() > 0 Тогда
				ЗаписатьНомерПоСчетчику = 
					(НЕ Найдено[0].НомерПоСчетчику = НомерПоСчетчику ИЛИ НЕ Найдено[0].НомерРодителя = НомерРодителя);
				ЗаписанныеЗначения.Удалить(Найдено[0]);
			КонецЕсли;
		КонецЕсли;
			
		Для Каждого ЗаписьКУдалению ИЗ ЗаписанныеЗначения Цикл
			Запись = РегистрыСведений.ЗначенияСчетчиков.СоздатьМенеджерЗаписи();
			Запись.Счетчик = ЗаписьКУдалению.Счетчик;
			Запись.Объект  = Ссылка;
			Запись.Удалить();
		КонецЦикла;
	КонецЕсли;
	
	Если ЗаписатьНомерПоСчетчику Тогда
		
		Запись = РегистрыСведений.ЗначенияСчетчиков.СоздатьМенеджерЗаписи();
		
		Запись.Объект          = Ссылка;
		Запись.Счетчик         = СчетчикНоменклатуры;
		Запись.НомерПоСчетчику = НомерПоСчетчику;
		Запись.НомерРодителя   = НомерРодителя;
		
		Запись.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура КонтрольДублейПоНаименованию(Отказ)
	
	Если НЕ Статус = Перечисления.СтатусыОбъектовНСИ.Активный Тогда
		Возврат;
	КонецЕсли;
	
	// Контроль наличия дублей по наименованию
	СписокРодителей = Справочники.Классы.ПолучитьТаблицуРодителей(Класс, 
		"РежимКонтроляДублейПоНаименованию, КонтрольДублейВПределахКласса");
	КолВо = СписокРодителей.Количество();
	
	РежимКонтроляДублейПоНаименованию = СписокРодителей[КолВо - 1].РежимКонтроляДублейПоНаименованию;
	КонтрольДублейВПределахКласса     = СписокРодителей[КолВо - 1].КонтрольДублейВПределахКласса;
	
	Если НЕ ЗначениеЗаполнено(РежимКонтроляДублейПоНаименованию) Тогда
		ДанныеКонтроляДублей = Справочники.Классы.ПолучитьРежимКонтроляДублейПоНаименованию(СписокРодителей);
		РежимКонтроляДублейПоНаименованию = ДанныеКонтроляДублей.РежимКонтроляДублейПоНаименованию;
		КонтрольДублейВПределахКласса     = ДанныеКонтроляДублей.КонтрольДублейВПределахКласса;
	КонецЕсли;
	
	Если РежимКонтроляДублейПоНаименованию = Перечисления.РежимыКонтроляДублей.ВПределахКласса Тогда
		Если НЕ ЗначениеЗаполнено(КонтрольДублейВПределахКласса) Тогда
			КонтрольДублейВПределахКласса = Класс;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка",       Ссылка);
		Запрос.УстановитьПараметр("Класс",        КонтрольДублейВПределахКласса);
		Запрос.УстановитьПараметр("Наименование", Наименование);
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НоменклатураКласса.Ссылка) КАК КолВо
			|ИЗ
			|	Справочник.НоменклатураКласса КАК НоменклатураКласса
			|ГДЕ
			|	НоменклатураКласса.Класс В ИЕРАРХИИ(&Класс)
			|	И НоменклатураКласса.Наименование = &Наименование
			|	И НЕ НоменклатураКласса.Ссылка = &Ссылка
			|	И НоменклатураКласса.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбъектовНСИ.Активный)";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() И Выборка.КолВо > 0 Тогда
			Если Выборка.КолВо = 1 Тогда
				ШаблонОшибки = НСтр("ru='Обнаружен 1 дубль номенклатуры с наименованием ''%1''. 
					|Нельзя записать две номенклатуры класса с одним наименованием в статусе ''Активный''.'")
			ИначеЕсли Выборка.КолВо > 1 Тогда
				ШаблонОшибки = НСтр("ru='Обнаружено дублей номенклатуры с наименованием ''%1'': %2. 
					|Нельзя записать более одной номенклатуры класса с одним наименованием в статусе ''Активный''.'")
			КонецЕсли;
			ОбщегоНазначения.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонОшибки, Наименование, Выборка.КолВо), , , , Отказ);
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
