#Область ОбработчикиСобытийФормы
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Подразделение) Тогда
		
		Подразделение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"НастройкиТОиР",
		"ОсновноеПодразделение",
		Справочники.СтруктураПредприятия.ПустаяСсылка());
		
	КонецЕсли;
	Склад = Подразделение.Склад;
	
	Направление = " Возр";
	Сортировка = "Номенклатура";
	
	Период.Вариант = ВариантСтандартногоПериода.СледующийМесяц;
	ОбновитьДанные();
	
	УстановитьУсловноеОформление();
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ОбновитьДанныеОбработчикОжидания", 90, Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеСкладПриИзменении(Элемент)
	ОбновитьДанные();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыМатериалы
&НаКлиенте
Процедура МатериалыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ДанныеСтроки = Элемент.ДанныеСтроки(ВыбраннаяСтрока);
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить("Ремонты", НСтр("es='Las reparaciones, donde es necesario""';ru='Ремонты, где требуется ""';en='Repairs where required ""'")+ ДанныеСтроки.Номенклатура + """" + ?(ЗначениеЗаполнено(ДанныеСтроки.Характеристика), " """ + ДанныеСтроки.Характеристика + """", ""));
	СписокВыбора.Добавить("Заказы", НСтр("es='Los encargos, donde asiste""';ru='Заказы, где присутствует ""';en=""Orders where presents '""")+ ДанныеСтроки.Номенклатура + """" + ?(ЗначениеЗаполнено(ДанныеСтроки.Характеристика), " """ + ДанныеСтроки.Характеристика + """", ""));
	СписокВыбора.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("МатериалыВыборЗавершение", ЭтотОбъект, Новый Структура("ДанныеСтроки", ДанныеСтроки)));
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыВыборЗавершение(ВыбранныйЭлемент, Параметры) Экспорт
	
	ДанныеСтроки = Параметры.ДанныеСтроки;
	Если ВыбранныйЭлемент <> Неопределено Тогда
		Если ВыбранныйЭлемент.Значение = "Ремонты" Тогда
			
			НайденныеСтроки = Объект.Ремонты.НайтиСтроки(Новый Структура("Номенклатура, ХарактеристикаНоменклатуры", ДанныеСтроки.Номенклатура, ДанныеСтроки.Характеристика));
			МассивСтрок = Новый Массив;
			Для Каждого Строка Из НайденныеСтроки Цикл
				СтруктураСтроки = Новый Структура("ДокументОснование, ОбъектРемонта, ВидРемонта, ДатаНачала, РемонтВыполняется, ЕстьДокументыЗаказа, ВЗаказеЕстьВсеПозиции, ID_Ремонта, ТребуемоеКоличество");
				ЗаполнитьЗначенияСвойств(СтруктураСтроки, Строка);
				МассивСтрок.Добавить(СтруктураСтроки);
			КонецЦикла;
			
			Форма = ОткрытьФорму("Обработка.торо_ПолучениеИВозвратМатериалов.Форма.СписокРемонтов", Новый Структура("МассивСтрок, Номенклатура, Характеристика", МассивСтрок, ДанныеСтроки.Номенклатура, ДанныеСтроки.Характеристика), Объект, Объект,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		ИначеЕсли ВыбранныйЭлемент.Значение = "Заказы" Тогда
			
			НайденныеСтроки = Объект.Заказы.НайтиСтроки(Новый Структура("Номенклатура, ХарактеристикаНоменклатуры", ДанныеСтроки.Номенклатура, ДанныеСтроки.Характеристика));
			МассивСтрок = Новый Массив;
			Для Каждого Строка Из НайденныеСтроки Цикл
				СтруктураСтроки = Новый Структура("ДокументЗаказа, ЗаказанноеКоличество");
				ЗаполнитьЗначенияСвойств(СтруктураСтроки, Строка);
				МассивСтрок.Добавить(СтруктураСтроки);
			КонецЦикла;
			
			Форма = ОткрытьФорму("Обработка.торо_ПолучениеИВозвратМатериалов.Форма.СписокЗаказов", Новый Структура("МассивСтрок, Номенклатура, Характеристика", МассивСтрок, ДанныеСтроки.Номенклатура, ДанныеСтроки.Характеристика), Объект, Объект,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПереместитьИзлишкиНаДругойСклад(Команда)
	
	Форма = ПолучитьФорму("Документ.ПеремещениеТоваров.ФормаОбъекта");
	Форма.Объект.СкладОтправитель = Склад;
		
	Для Каждого ВыделеннаяСтрока Из Элементы.Материалы.ВыделенныеСтроки Цикл
		
		ДанныеСтроки = Элементы.Материалы.ДанныеСтроки(ВыделеннаяСтрока);
		Если ДанныеСтроки.ПланируемыйИзлишекДефицит > 0 Тогда
			НС = Форма.Объект.Товары.Добавить();
			НС.Номенклатура = ДанныеСтроки.Номенклатура;
			НС.Характеристика = ДанныеСтроки.Характеристика;
			НС.КоличествоУпаковок = ДанныеСтроки.ПланируемыйИзлишекДефицит;
		КонецЕсли;
		
	КонецЦикла;
	
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура УстранитьДефицитЗаказами(Команда)
	
	ДатаОтгрузки = Период.ДатаОкончания;
	
	СоответствиеID = Новый Соответствие;
	МассивСтрокНоменклатуры = Новый Массив;
	Для Каждого ВыделеннаяСтрока Из Элементы.Материалы.ВыделенныеСтроки Цикл
		
		ДанныеСтроки = Элементы.Материалы.ДанныеСтроки(ВыделеннаяСтрока);
		Если ДанныеСтроки.ПланируемыйИзлишекДефицит < 0 Тогда
			//НС = Форма.Объект.Товары.Добавить();
			НС = Новый Структура("Номенклатура, Характеристика, КоличествоУпаковок, Количество"); 
			НС.Номенклатура = ДанныеСтроки.Номенклатура;
			НС.Характеристика = ДанныеСтроки.Характеристика;
			НС.КоличествоУпаковок = 0 - ДанныеСтроки.ПланируемыйИзлишекДефицит;
			НС.Количество = 0 - ДанныеСтроки.ПланируемыйИзлишекДефицит;
			
			НайденныеСтроки = Объект.Ремонты.НайтиСтроки(Новый Структура("Номенклатура, ХарактеристикаНоменклатуры", ДанныеСтроки.Номенклатура, ДанныеСтроки.Характеристика));
			
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				ДатаОтгрузки = ?(НайденнаяСтрока.ДатаНачала < ДатаОтгрузки, НайденнаяСтрока.ДатаНачала, ДатаОтгрузки);
				СоответствиеID.Вставить(НайденнаяСтрока.ID_Ремонта, НайденнаяСтрока.ДокументОснование);
			КонецЦикла;
			МассивСтрокНоменклатуры.Добавить(НС);
		КонецЕсли;
	КонецЦикла;
	ТекДата = ТекущаяДата();
	ДатаОтгрузки = ?(ТекДата >= ДатаОтгрузки, ТекДата, ДатаОтгрузки);
	
	ДатаДокумента = ?(ТекДата < ДатаОтгрузки, ТекДата, ДатаОтгрузки);
	Комментарий = "Документ сгенерирован обработкой ""Получение и возврат материалов""";
	ЗначенияЗаполнения = Новый Структура("Дата, МассивСтрокНоменклатуры, ДатаОтгрузки, Склад, Комментарий",
		ДатаДокумента, МассивСтрокНоменклатуры, ДатаОтгрузки, Склад, Комментарий);
	СтруктураПараметров = Новый Структура("СписокID, ЗначенияЗаполнения", СоответствиеID, ЗначенияЗаполнения);
	ОткрытьФорму("Документ.ЗаказНаВнутреннееПотребление.ФормаОбъекта", СтруктураПараметров, ,,,,Новый ОписаниеОповещения("ОбновитьДанныеУстраненДефицит", ЭтотОбъект));

КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеУстраненДефицит(Результат, Параметры)
	ОбновитьДанные();
КонецПроцедуры


&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура СортироватьМатериалыПоВозрастанию(Команда)
	Направление = " Возр"; 
	Сортировка = Элементы.Материалы.ТекущийЭлемент.Имя;
	СортироватьМатериалы();
КонецПроцедуры

&НаКлиенте
Процедура СортироватьМатериалыПоУбыванию(Команда)
	Направление = " Убыв";
	Сортировка = Элементы.Материалы.ТекущийЭлемент.Имя;
	СортироватьМатериалы();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьДанныеОбработчикОжидания()
	
	ОбновитьДанные();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанные()
	
	ТекСтрока = Элементы.Материалы.ТекущаяСтрока;
	МассивВыделенных = Новый Массив;
	
	Если ТекСтрока <> Неопределено Тогда
		ТекДанные = Объект.Материалы.НайтиПоИдентификатору(ТекСтрока);
		ВыделенныеСтроки = Элементы.Материалы.ВыделенныеСтроки;
		
		Для Каждого ИдВыделеннойСтроки Из ВыделенныеСтроки Цикл
			ДанныеВыделенной = Объект.Материалы.НайтиПоИдентификатору(ИдВыделеннойСтроки);
			МассивВыделенных.Добавить(Новый Структура("Номенклатура, Характеристика", ДанныеВыделенной.Номенклатура, ДанныеВыделенной.Характеристика));
		КонецЦикла;
		
		СтруктураПоиска = Новый Структура("Номенклатура, Характеристика", ТекДанные.Номенклатура, ТекДанные.Характеристика);
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	торо_ПлановыеРемонтныеРаботыСрезПоследних.Период КАК Период,
	               |	торо_ПлановыеРемонтныеРаботыСрезПоследних.Регистратор КАК Регистратор,
	               |	торо_ПлановыеРемонтныеРаботыСрезПоследних.НомерСтроки КАК НомерСтроки,
	               |	торо_ПлановыеРемонтныеРаботыСрезПоследних.Активность КАК Активность,
	               |	торо_ПлановыеРемонтныеРаботыСрезПоследних.Организация КАК Организация,
	               |	торо_ПлановыеРемонтныеРаботыСрезПоследних.ID КАК ID,
	               |	торо_ПлановыеРемонтныеРаботыСрезПоследних.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	               |	торо_ПлановыеРемонтныеРаботыСрезПоследних.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	               |	торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаНачалаРемонтныхРабот КАК ДатаНачалаРемонтныхРабот,
	               |	торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаОкончанияРемонтныхРабот КАК ДатаОкончанияРемонтныхРабот,
	               |	торо_ПлановыеРемонтныеРаботыСрезПоследних.Исполнитель КАК Исполнитель,
	               |	торо_ПлановыеРемонтныеРаботыСрезПоследних.СпособВыполнения КАК СпособВыполнения,
	               |	торо_ПлановыеРемонтныеРаботыСрезПоследних.Отменен КАК Отменен,
	               |	торо_ПлановыеРемонтныеРаботыСрезПоследних.ID_базы_расчета КАК ID_базы_расчета,
	               |	торо_ПлановыеРемонтныеРаботыСрезПоследних.Замещен КАК Замещен,
	               |	торо_ПлановыеРемонтныеРаботыСрезПоследних.ID_замещающего КАК ID_замещающего,
	               |	торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаНачалаРасчетная КАК ДатаНачалаРасчетная,
	               |	торо_ПлановыеРемонтныеРаботыСрезПоследних.СтоимостьРемонта КАК СтоимостьРемонта
	               |ПОМЕСТИТЬ ВТ_ППР
	               |ИЗ
	               |	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних КАК торо_ПлановыеРемонтныеРаботыСрезПоследних
	               |ГДЕ
	               |	НЕ торо_ПлановыеРемонтныеРаботыСрезПоследних.Отменен
	               |	И НЕ торо_ПлановыеРемонтныеРаботыСрезПоследних.Замещен
	               |	И ВЫБОР
	               |			КОГДА &ПериодЗаполнен
	               |				ТОГДА торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаНачалаРемонтныхРабот МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.ID КАК ID,
	               |	торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.ОбъектРемонта КАК ОбъектРемонта,
	               |	торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.ПлановаяДатаРемонта КАК ПлановаяДатаРемонта,
	               |	торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.Исполнитель КАК Исполнитель,
	               |	1 КАК Приоритет,
	               |	торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_ВнешниеОснования
	               |ИЗ
	               |	Документ.торо_ВнешнееОснованиеДляРабот.ОбследованноеОборудование КАК торо_ВнешнееОснованиеДляРаботОбследованноеОборудование
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &ПериодЗаполнен
	               |				ТОГДА торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.ПлановаяДатаРемонта МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.Ссылка.Проведен = ИСТИНА
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	1 КАК Приоритет,
	               |	торо_ВыявленныеДефектыСрезПоследних.ОтказавшийЭлемент КАК ОтказавшийЭлемент,
	               |	торо_ВыявленныеДефектыСрезПоследних.ID КАК ID,
	               |	торо_ВыявленныеДефектыСрезПоследних.ПодразделениеИсполнитель КАК ПодразделениеИсполнитель,
	               |	торо_ВыявленныеДефектыСрезПоследних.Регистратор КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_ВыявленныеДефекты
	               |ИЗ
	               |	РегистрСведений.торо_ВыявленныеДефекты.СрезПоследних КАК торо_ВыявленныеДефектыСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ВнешниеОснования.ID КАК ID,
	               |	ВТ_ВнешниеОснования.ОбъектРемонта КАК ОбъектРемонта,
	               |	ВТ_ВнешниеОснования.ПлановаяДатаРемонта КАК ПлановаяДатаРемонта,
	               |	ВТ_ВнешниеОснования.Исполнитель КАК Исполнитель,
	               |	ВТ_ВнешниеОснования.Приоритет КАК Приоритет,
	               |	ВТ_ВнешниеОснования.Ссылка КАК Ссылка,
	               |	NULL КАК ВидРемонтныхРабот
	               |ПОМЕСТИТЬ ВТ_ДокументыОснования
	               |ИЗ
	               |	ВТ_ВнешниеОснования КАК ВТ_ВнешниеОснования
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_ВыявленныеДефекты.ID,
	               |	ВТ_ВыявленныеДефекты.ОтказавшийЭлемент,
	               |	NULL,
	               |	ВТ_ВыявленныеДефекты.ПодразделениеИсполнитель,
	               |	ВТ_ВыявленныеДефекты.Приоритет,
	               |	ВТ_ВыявленныеДефекты.Ссылка,
	               |	NULL
	               |ИЗ
	               |	ВТ_ВыявленныеДефекты КАК ВТ_ВыявленныеДефекты
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_ППР.ID,
	               |	ВТ_ППР.ОбъектРемонтныхРабот,
	               |	ВТ_ППР.ДатаНачалаРемонтныхРабот,
	               |	ВТ_ППР.Исполнитель,
	               |	1,
	               |	ВТ_ППР.Регистратор,
	               |	ВТ_ППР.ВидРемонтныхРабот
	               |ИЗ
	               |	ВТ_ППР КАК ВТ_ППР
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ID,
	               |	ОбъектРемонта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДокументыОснования.ID КАК ID,
	               |	ВТ_ДокументыОснования.ОбъектРемонта КАК ОбъектРемонта,
	               |	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка КАК Заявка,
	               |	ЕСТЬNULL(торо_ЗаявкаНаРемонтИсполнителиРемонтныхРабот.Исполнитель, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК Исполнитель,
	               |	ВЫБОР
	               |		КОГДА торо_ЗаявкаНаРемонтИсполнителиРемонтныхРабот.Исполнитель = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	               |				ИЛИ торо_ЗаявкаНаРемонтИсполнителиРемонтныхРабот.Исполнитель ЕСТЬ NULL
	               |			ТОГДА 0
	               |		ИНАЧЕ 2
	               |	КОНЕЦ КАК ПриоритетИсполнителя,
	               |	торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаНачала КАК ПлановаяДатаРемонта,
	               |	2 КАК ПриоритетДокумента,
	               |	торо_ЗаявкаНаРемонтРемонтыОборудования.ВидРемонтныхРабот КАК ВидРемонтныхРабот
	               |ПОМЕСТИТЬ ВТ_Заявки
	               |ИЗ
	               |	ВТ_ДокументыОснования КАК ВТ_ДокументыОснования
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.ИсполнителиПоРемонтам КАК торо_ЗаявкаНаРемонтИсполнителиРемонтныхРабот
	               |		ПО ВТ_ДокументыОснования.ID = торо_ЗаявкаНаРемонтИсполнителиРемонтныхРабот.РемонтыОборудования_ID
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК торо_ЗаявкаНаРемонтРемонтыОборудования
	               |		ПО ВТ_ДокументыОснования.ID = торо_ЗаявкаНаРемонтРемонтыОборудования.ID
	               |			И ВТ_ДокументыОснования.ОбъектРемонта = торо_ЗаявкаНаРемонтРемонтыОборудования.ОбъектРемонта
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &ПериодЗаполнен
	               |				ТОГДА торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаНачала МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДокументыОснования.ID КАК ID,
	               |	ВТ_ДокументыОснования.ОбъектРемонта КАК ОбъектРемонта,
	               |	ВТ_ДокументыОснования.ПлановаяДатаРемонта КАК ПлановаяДатаРемонта,
	               |	ВТ_ДокументыОснования.Исполнитель КАК Исполнитель,
	               |	ВТ_ДокументыОснования.Приоритет КАК ПриоритетИсполнителя,
	               |	ВТ_ДокументыОснования.Ссылка КАК Ссылка,
	               |	ВТ_ДокументыОснования.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	               |	1 КАК ПриоритетДокумента
	               |ПОМЕСТИТЬ ВТ_ДляСрезаПоПриоритету
	               |ИЗ
	               |	ВТ_ДокументыОснования КАК ВТ_ДокументыОснования
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_Заявки.ID,
	               |	ВТ_Заявки.ОбъектРемонта,
	               |	ВТ_Заявки.ПлановаяДатаРемонта,
	               |	ВТ_Заявки.Исполнитель,
	               |	ВТ_Заявки.ПриоритетИсполнителя,
	               |	ВТ_Заявки.Заявка,
	               |	ВТ_Заявки.ВидРемонтныхРабот,
	               |	ВТ_Заявки.ПриоритетДокумента
	               |ИЗ
	               |	ВТ_Заявки КАК ВТ_Заявки
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ID,
	               |	ОбъектРемонта,
	               |	ПриоритетДокумента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДляСрезаПоПриоритету.ID КАК ID,
	               |	ВТ_ДляСрезаПоПриоритету.ОбъектРемонта КАК ОбъектРемонта,
	               |	МАКСИМУМ(ВТ_ДляСрезаПоПриоритету.ПриоритетДокумента) КАК ПриоритетДокумента,
	               |	МАКСИМУМ(ВТ_ДляСрезаПоПриоритету.ПриоритетИсполнителя) КАК ПриоритетИсполнителя
	               |ПОМЕСТИТЬ ВТ_МаксимумПриоритетов
	               |ИЗ
	               |	ВТ_ДляСрезаПоПриоритету КАК ВТ_ДляСрезаПоПриоритету
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ДляСрезаПоПриоритету.ID,
	               |	ВТ_ДляСрезаПоПриоритету.ОбъектРемонта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДляСрезаПоПриоритету.ID КАК ID,
	               |	ВТ_ДляСрезаПоПриоритету.ОбъектРемонта КАК ОбъектРемонта,
	               |	ВТ_ДляСрезаПоПриоритету.Исполнитель КАК Исполнитель
	               |ПОМЕСТИТЬ ВТ_СрезПоИсполнителям
	               |ИЗ
	               |	ВТ_ДляСрезаПоПриоритету КАК ВТ_ДляСрезаПоПриоритету
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МаксимумПриоритетов КАК ВТ_МаксимумПриоритетов
	               |		ПО ВТ_ДляСрезаПоПриоритету.ID = ВТ_МаксимумПриоритетов.ID
	               |			И ВТ_ДляСрезаПоПриоритету.ОбъектРемонта = ВТ_МаксимумПриоритетов.ОбъектРемонта
	               |			И ВТ_ДляСрезаПоПриоритету.ПриоритетИсполнителя = ВТ_МаксимумПриоритетов.ПриоритетИсполнителя
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДляСрезаПоПриоритету.ID КАК ID,
	               |	ВТ_ДляСрезаПоПриоритету.ОбъектРемонта КАК ОбъектРемонтныхРабот,
	               |	ВТ_ДляСрезаПоПриоритету.ПлановаяДатаРемонта КАК ДатаНачалаРемонтныхРабот,
	               |	ВТ_ДляСрезаПоПриоритету.ПриоритетДокумента КАК Приоритет,
	               |	ВТ_ДляСрезаПоПриоритету.Ссылка КАК Регистратор,
	               |	ВТ_ДляСрезаПоПриоритету.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	               |	ВТ_СрезПоИсполнителям.Исполнитель КАК Исполнитель
	               |ПОМЕСТИТЬ ВТ_ПоследниеДокиПоРемонтамСУстановленнымИсполнителем
	               |ИЗ
	               |	ВТ_ДляСрезаПоПриоритету КАК ВТ_ДляСрезаПоПриоритету
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МаксимумПриоритетов КАК ВТ_МаксимумПриоритетов
	               |		ПО ВТ_ДляСрезаПоПриоритету.ID = ВТ_МаксимумПриоритетов.ID
	               |			И (ВТ_МаксимумПриоритетов.ОбъектРемонта = ВТ_ДляСрезаПоПриоритету.ОбъектРемонта)
	               |			И (ВТ_МаксимумПриоритетов.ПриоритетДокумента = ВТ_ДляСрезаПоПриоритету.ПриоритетДокумента)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СрезПоИсполнителям КАК ВТ_СрезПоИсполнителям
	               |		ПО ВТ_ДляСрезаПоПриоритету.ID = ВТ_СрезПоИсполнителям.ID
	               |			И ВТ_ДляСрезаПоПриоритету.ОбъектРемонта = ВТ_СрезПоИсполнителям.ОбъектРемонта
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ВТ_СрезПоИсполнителям.Исполнитель = &Подразделение
	               |		КОНЕЦ
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ID,
	               |	ОбъектРемонтныхРабот,
	               |	ВидРемонтныхРабот
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ПоследниеДокиПоРемонтамСУстановленнымИсполнителем.ДатаНачалаРемонтныхРабот КАК ДатаНачалаРемонтныхРабот,
	               |	ВТ_ПоследниеДокиПоРемонтамСУстановленнымИсполнителем.ID КАК ID,
	               |	ВТ_ПоследниеДокиПоРемонтамСУстановленнымИсполнителем.ОбъектРемонтныхРабот КАК ОбъектРемонта,
	               |	ВТ_ПоследниеДокиПоРемонтамСУстановленнымИсполнителем.ВидРемонтныхРабот КАК ВидРемонта,
	               |	торо_НормативныеРемонтыОборудования.НормативныйРемонт КАК НормативныйРемонт,
	               |	ВТ_ПоследниеДокиПоРемонтамСУстановленнымИсполнителем.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ ППР
	               |ИЗ
	               |	ВТ_ПоследниеДокиПоРемонтамСУстановленнымИсполнителем КАК ВТ_ПоследниеДокиПоРемонтамСУстановленнымИсполнителем
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_Ремонты КАК торо_Ремонты
	               |		ПО (торо_Ремонты.Регистратор ССЫЛКА Документ.торо_ЗаявкаНаРемонт)
	               |			И ВТ_ПоследниеДокиПоРемонтамСУстановленнымИсполнителем.ID = торо_Ремонты.ID
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_НормативныеРемонтыОборудования КАК торо_НормативныеРемонтыОборудования
	               |		ПО ВТ_ПоследниеДокиПоРемонтамСУстановленнымИсполнителем.ОбъектРемонтныхРабот = торо_НормативныеРемонтыОборудования.ОбъектРемонта
	               |			И ВТ_ПоследниеДокиПоРемонтамСУстановленнымИсполнителем.ВидРемонтныхРабот = торо_НормативныеРемонтыОборудования.ВидРемонта
	               |			И (торо_НормативныеРемонтыОборудования.Приоритет)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗавершенныеРемонтныеРаботы КАК торо_ЗавершенныеРемонтныеРаботы
	               |		ПО ВТ_ПоследниеДокиПоРемонтамСУстановленнымИсполнителем.ID = торо_ЗавершенныеРемонтныеРаботы.ID
	               |ГДЕ
	               |	(торо_Ремонты.Регистратор ЕСТЬ NULL
	               |			ИЛИ торо_Ремонты.Регистратор ССЫЛКА Документ.торо_ЗаявкаНаРемонт
	               |				И торо_ЗавершенныеРемонтныеРаботы.ID ЕСТЬ NULL)
	               |	И ВТ_ПоследниеДокиПоРемонтамСУстановленнымИсполнителем.Регистратор ССЫЛКА Документ.торо_ПланГрафикРемонта
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	НормативныйРемонт,
	               |	ДатаНачалаРемонтныхРабот
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ППР.ДатаНачалаРемонтныхРабот КАК ДатаНачалаРемонтныхРабот,
	               |	ППР.ID КАК ID,
	               |	ППР.ОбъектРемонта КАК ОбъектРемонта,
	               |	ППР.ВидРемонта КАК ВидРемонта,
	               |	торо_ВерсииТехКарт.Период КАК Период,
	               |	торо_ВерсииТехКарт.ИдентификаторТехКарты КАК ИдентификаторТехКарты,
	               |	ППР.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ ВТ_ДатыДляСреза
	               |ИЗ
	               |	ППР КАК ППР
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВерсииТехКарт КАК торо_ВерсииТехКарт
	               |		ПО ППР.НормативныйРемонт = торо_ВерсииТехКарт.ИдентификаторТехКарты
	               |			И ППР.ДатаНачалаРемонтныхРабот >= торо_ВерсииТехКарт.Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДатыДляСреза.ДатаНачалаРемонтныхРабот КАК ДатаНачалаРемонтныхРабот,
	               |	ВТ_ДатыДляСреза.ID КАК ID,
	               |	ВТ_ДатыДляСреза.ОбъектРемонта КАК ОбъектРемонта,
	               |	ВТ_ДатыДляСреза.ВидРемонта КАК ВидРемонта,
	               |	МАКСИМУМ(ВТ_ДатыДляСреза.Период) КАК Период,
	               |	ВТ_ДатыДляСреза.ИдентификаторТехКарты КАК ИдентификаторТехКарты,
	               |	ВТ_ДатыДляСреза.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ ВТ_МаксимумДат
	               |ИЗ
	               |	ВТ_ДатыДляСреза КАК ВТ_ДатыДляСреза
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ДатыДляСреза.ДатаНачалаРемонтныхРабот,
	               |	ВТ_ДатыДляСреза.ID,
	               |	ВТ_ДатыДляСреза.ВидРемонта,
	               |	ВТ_ДатыДляСреза.ОбъектРемонта,
	               |	ВТ_ДатыДляСреза.ИдентификаторТехКарты,
	               |	ВТ_ДатыДляСреза.Регистратор
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Период,
	               |	ИдентификаторТехКарты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_МаксимумДат.ДатаНачалаРемонтныхРабот КАК ДатаНачалаРемонтныхРабот,
	               |	ВТ_МаксимумДат.ID КАК ID,
	               |	ВТ_МаксимумДат.ОбъектРемонта КАК ОбъектРемонта,
	               |	ВТ_МаксимумДат.ВидРемонта КАК ВидРемонта,
	               |	торо_ВерсииТехКарт.ТехКарта КАК ТехКарта,
	               |	ВТ_МаксимумДат.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ ВТ_ППРсТехКартами
	               |ИЗ
	               |	ВТ_МаксимумДат КАК ВТ_МаксимумДат
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВерсииТехКарт КАК торо_ВерсииТехКарт
	               |		ПО ВТ_МаксимумДат.Период = торо_ВерсииТехКарт.Период
	               |			И ВТ_МаксимумДат.ИдентификаторТехКарты = торо_ВерсииТехКарт.ИдентификаторТехКарты
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ID,
	               |	Регистратор,
	               |	ТехКарта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	торо_ЗаявкаНаРемонтРемонтыОборудования.ID КАК ID,
	               |	торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаНачалаРемонтныхРабот КАК ДатаНачала,
	               |	ВЫБОР
	               |		КОГДА торо_Ремонты.ID ЕСТЬ NULL
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК РемонтВыполняется,
	               |	торо_ЗаявкаНаРемонтРемонтыОборудования.ОбъектРемонтныхРабот КАК ОбъектРемонта,
	               |	торо_ЗаявкаНаРемонтРемонтыОборудования.ВидРемонтныхРабот КАК ВидРемонта,
	               |	торо_ЗаявкаНаРемонтРемонтыОборудования.Регистратор КАК Документ
	               |ПОМЕСТИТЬ ВТ_IDРемонтов
	               |ИЗ
	               |	ВТ_ПоследниеДокиПоРемонтамСУстановленнымИсполнителем КАК торо_ЗаявкаНаРемонтРемонтыОборудования
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_Ремонты КАК торо_Ремонты
	               |		ПО торо_ЗаявкаНаРемонтРемонтыОборудования.ID = торо_Ремонты.ID
	               |			И (торо_Ремонты.Регистратор ССЫЛКА Документ.торо_НарядНаВыполнениеРемонтныхРабот
	               |				ИЛИ торо_Ремонты.Регистратор ССЫЛКА Документ.торо_АктОВыполненииЭтапаРабот)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗавершенныеРемонтныеРаботы КАК торо_ЗавершенныеРемонтныеРаботы
	               |		ПО торо_ЗаявкаНаРемонтРемонтыОборудования.ID = торо_ЗавершенныеРемонтныеРаботы.ID
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.ИсполнителиПоРемонтам КАК торо_ЗаявкаНаРемонтИсполнителиРемонтныхРабот
	               |		ПО торо_ЗаявкаНаРемонтРемонтыОборудования.Регистратор = торо_ЗаявкаНаРемонтИсполнителиРемонтныхРабот.Ссылка
	               |ГДЕ
	               |	торо_ЗаявкаНаРемонтРемонтыОборудования.Регистратор ССЫЛКА Документ.торо_ЗаявкаНаРемонт
	               |	И торо_ЗавершенныеРемонтныеРаботы.ID ЕСТЬ NULL
	               |	И торо_Ремонты.Регистратор ЕСТЬ NULL
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_ППРсТехКартами.ID,
	               |	ВТ_ППРсТехКартами.ДатаНачалаРемонтныхРабот,
	               |	ВЫБОР
	               |		КОГДА торо_Ремонты.ID ЕСТЬ NULL
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ,
	               |	ВТ_ППРсТехКартами.ОбъектРемонта,
	               |	ВТ_ППРсТехКартами.ВидРемонта,
	               |	ВТ_ППРсТехКартами.Регистратор
	               |ИЗ
	               |	ВТ_ППРсТехКартами КАК ВТ_ППРсТехКартами
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_Ремонты КАК торо_Ремонты
	               |		ПО ВТ_ППРсТехКартами.ID = торо_Ремонты.ID
	               |			И (торо_Ремонты.Регистратор ССЫЛКА Документ.торо_НарядНаВыполнениеРемонтныхРабот
	               |				ИЛИ торо_Ремонты.Регистратор ССЫЛКА Документ.торо_АктОВыполненииЭтапаРабот)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ID,
	               |	ОбъектРемонта,
	               |	ВидРемонта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	IDРемонтов.ID КАК ID,
	               |	IDРемонтов.ДатаНачала КАК ДатаНачала,
	               |	IDРемонтов.РемонтВыполняется КАК РемонтВыполняется,
	               |	IDРемонтов.ОбъектРемонта КАК ОбъектРемонта,
	               |	IDРемонтов.ВидРемонта КАК ВидРемонта,
	               |	ВЫБОР
	               |		КОГДА торо_РемонтыСрезПоследних.Регистратор ЕСТЬ NULL
	               |			ТОГДА IDРемонтов.Документ
	               |		ИНАЧЕ торо_РемонтыСрезПоследних.Регистратор
	               |	КОНЕЦ КАК Документ
	               |ПОМЕСТИТЬ IDРемонтов
	               |ИЗ
	               |	ВТ_IDРемонтов КАК IDРемонтов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_Ремонты.СрезПоследних КАК торо_РемонтыСрезПоследних
	               |		ПО IDРемонтов.ID = торо_РемонтыСрезПоследних.ID
	               |			И IDРемонтов.ОбъектРемонта = торо_РемонтыСрезПоследних.ОбъектРемонта
	               |			И IDРемонтов.ВидРемонта = торо_РемонтыСрезПоследних.ВидРемонта
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВТ_ППРсТехКартами.Регистратор КАК ДокументПлан,
	               |	ВТ_ППРсТехКартами.ID КАК ID_Ремонта,
	               |	торо_ТехКартыМатериальныеЗатраты.Номенклатура КАК Номенклатура,
	               |	торо_ТехКартыМатериальныеЗатраты.Количество КАК ТребуемоеКоличество,
	               |	ВЫБОР
	               |		КОГДА &ФОИспользованиеХарактеристик
	               |			ТОГДА торо_ТехКартыМатериальныеЗатраты.Характеристика
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	               |	КОНЕЦ КАК ХарактеристикаНоменклатуры,
	               |	IDРемонтов.ДатаНачала КАК ПлановаяДатаРемонта,
	               |	IDРемонтов.РемонтВыполняется КАК РемонтВыполняется
	               |ПОМЕСТИТЬ Требуемые
	               |ИЗ
	               |	ВТ_ППРсТехКартами КАК ВТ_ППРсТехКартами
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТехКарты.МатериальныеЗатраты КАК торо_ТехКартыМатериальныеЗатраты
	               |		ПО ВТ_ППРсТехКартами.ТехКарта = торо_ТехКартыМатериальныеЗатраты.Ссылка
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ IDРемонтов КАК IDРемонтов
	               |		ПО ВТ_ППРсТехКартами.ID = IDРемонтов.ID
	               |ГДЕ
	               |	НЕ торо_ТехКартыМатериальныеЗатраты.Номенклатура.ВидНоменклатуры.ТипНоменклатуры В (&Услуга)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_ППРсТехКартами.Регистратор,
	               |	ВТ_ППРсТехКартами.ID,
	               |	торо_ТехКартыМатериальныеЗатраты.Номенклатура,
	               |	торо_ТехКартыМатериальныеЗатраты.Количество,
	               |	ВЫБОР
	               |		КОГДА &ФОИспользованиеХарактеристик
	               |			ТОГДА торо_ТехКартыМатериальныеЗатраты.Характеристика
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	               |	КОНЕЦ,
	               |	IDРемонтов.ДатаНачала,
	               |	IDРемонтов.РемонтВыполняется
	               |ИЗ
	               |	ВТ_ППРсТехКартами КАК ВТ_ППРсТехКартами
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_СоставИерархическихТехКартРемонтов КАК торо_СоставИерархическихТехКартРемонтов
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТехКарты.МатериальныеЗатраты КАК торо_ТехКартыМатериальныеЗатраты
	               |			ПО торо_СоставИерархическихТехКартРемонтов.Состав = торо_ТехКартыМатериальныеЗатраты.Ссылка
	               |		ПО ВТ_ППРсТехКартами.ТехКарта = торо_СоставИерархическихТехКартРемонтов.ТехКарта
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ IDРемонтов КАК IDРемонтов
	               |		ПО ВТ_ППРсТехКартами.ID = IDРемонтов.ID
	               |ГДЕ
	               |	НЕ торо_ТехКартыМатериальныеЗатраты.Номенклатура.ВидНоменклатуры.ТипНоменклатуры В (&Услуга)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_ППРсТехКартами.Регистратор,
	               |	ВТ_ППРсТехКартами.ID,
	               |	торо_НормыЗапчастейНаОбъектыРемонта.Номенклатура,
	               |	торо_НормыЗапчастейНаОбъектыРемонта.Количество,
	               |	ВЫБОР
	               |		КОГДА &ФОИспользованиеХарактеристик
	               |			ТОГДА торо_НормыЗапчастейНаОбъектыРемонта.Характеристика
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	               |	КОНЕЦ,
	               |	IDРемонтов.ДатаНачала,
	               |	IDРемонтов.РемонтВыполняется
	               |ИЗ
	               |	ВТ_ППРсТехКартами КАК ВТ_ППРсТехКартами
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_НормыЗапчастейНаОбъектыРемонта КАК торо_НормыЗапчастейНаОбъектыРемонта
	               |		ПО (торо_НормыЗапчастейНаОбъектыРемонта.Приоритет)
	               |			И ВТ_ППРсТехКартами.ОбъектРемонта = торо_НормыЗапчастейНаОбъектыРемонта.ОбъектРемонта
	               |			И ВТ_ППРсТехКартами.ВидРемонта = торо_НормыЗапчастейНаОбъектыРемонта.ВидРемонта
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ IDРемонтов КАК IDРемонтов
	               |		ПО ВТ_ППРсТехКартами.ID = IDРемонтов.ID
	               |ГДЕ
	               |	НЕ торо_НормыЗапчастейНаОбъектыРемонта.Номенклатура.ВидНоменклатуры.ТипНоменклатуры В (&Услуга)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.Регистратор,
	               |	торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.РемонтыОборудования_ID,
	               |	торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.Номенклатура,
	               |	торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.Количество,
	               |	ВЫБОР
	               |		КОГДА &ФОИспользованиеХарактеристик
	               |			ТОГДА торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.ХарактеристикаНоменклатуры
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	               |	КОНЕЦ,
	               |	IDРемонтов.ДатаНачала,
	               |	IDРемонтов.РемонтВыполняется
	               |ИЗ
	               |	IDРемонтов КАК IDРемонтов
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.торо_ПлановыеМатериальныеЗатратыРемонтныхРабот КАК торо_ПлановыеМатериальныеЗатратыРемонтныхРабот
	               |		ПО IDРемонтов.ID = торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.РемонтыОборудования_ID
	               |ГДЕ
	               |	НЕ торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.Номенклатура.ВидНоменклатуры.ТипНоменклатуры В (&Услуга)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	торо_ПлановыеЗатратыЗапчастей.Регистратор,
	               |	торо_ПлановыеЗатратыЗапчастей.РемонтыОборудования_ID,
	               |	торо_ПлановыеЗатратыЗапчастей.Номенклатура,
	               |	торо_ПлановыеЗатратыЗапчастей.Количество,
	               |	ВЫБОР
	               |		КОГДА &ФОИспользованиеХарактеристик
	               |			ТОГДА торо_ПлановыеЗатратыЗапчастей.ХарактеристикаНоменклатуры
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	               |	КОНЕЦ,
	               |	IDРемонтов.ДатаНачала,
	               |	IDРемонтов.РемонтВыполняется
	               |ИЗ
	               |	IDРемонтов КАК IDРемонтов
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.торо_ПлановыеЗатратыЗапчастей КАК торо_ПлановыеЗатратыЗапчастей
	               |		ПО (торо_ПлановыеЗатратыЗапчастей.РемонтыОборудования_ID = IDРемонтов.ID)
	               |ГДЕ
	               |	НЕ торо_ПлановыеЗатратыЗапчастей.Номенклатура.ВидНоменклатуры.ТипНоменклатуры В (&Услуга)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Требуемые.ДокументПлан КАК ДокументПлан,
	               |	Требуемые.ID_Ремонта КАК ID_Ремонта,
	               |	Требуемые.Номенклатура КАК Номенклатура,
	               |	СУММА(Требуемые.ТребуемоеКоличество) КАК ТребуемоеКоличество,
	               |	Требуемые.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	Требуемые.ПлановаяДатаРемонта КАК ПлановаяДатаРемонта,
	               |	Требуемые.РемонтВыполняется КАК РемонтВыполняется
	               |ПОМЕСТИТЬ ТребуемыеСумма
	               |ИЗ
	               |	Требуемые КАК Требуемые
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Требуемые.ДокументПлан,
	               |	Требуемые.ID_Ремонта,
	               |	Требуемые.Номенклатура,
	               |	Требуемые.ХарактеристикаНоменклатуры,
	               |	Требуемые.ПлановаяДатаРемонта,
	               |	Требуемые.РемонтВыполняется
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ID_Ремонта,
	               |	Номенклатура,
	               |	ХарактеристикаНоменклатуры
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаказыНаВнутреннееПотребление.ЗаказНаВнутреннееПотребление КАК ДокументЗаказа,
	               |	ЗаказыНаВнутреннееПотребление.Номенклатура КАК Номенклатура,
	               |	ВЫБОР
	               |		КОГДА &ФОИспользованиеХарактеристик
	               |			ТОГДА ЗаказыНаВнутреннееПотребление.Характеристика
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	               |	КОНЕЦ КАК ХарактеристикаНоменклатуры,
	               |	ЗаказыНаВнутреннееПотребление.КОформлениюОстаток КАК ЗаказанноеКоличество,
	               |	IDРемонтов.ID КАК ID_Ремонта,
	               |	ЗаказыНаВнутреннееПотребление.КодСтроки КАК КодСтроки
	               |ПОМЕСТИТЬ Заказанные
	               |ИЗ
	               |	РегистрНакопления.ЗаказыНаВнутреннееПотребление.Остатки КАК ЗаказыНаВнутреннееПотребление
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИнтеграцияДокументов КАК торо_ИнтеграцияДокументов
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ IDРемонтов КАК IDРемонтов
	               |			ПО (IDРемонтов.ID = торо_ИнтеграцияДокументов.ID)
	               |		ПО (торо_ИнтеграцияДокументов.ДокументЕРП = ЗаказыНаВнутреннееПотребление.ЗаказНаВнутреннееПотребление)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаВнутреннееПотребление КАК ДокументЗаказНаВнутреннееПотребление
	               |		ПО ЗаказыНаВнутреннееПотребление.ЗаказНаВнутреннееПотребление = ДокументЗаказНаВнутреннееПотребление.Ссылка
	               |ГДЕ
	               |	(&НеОтбиратьПоСкладу
	               |			ИЛИ ЗаказыНаВнутреннееПотребление.Склад = &Склад)
	               |	И (ВЫБОР
	               |					КОГДА &ПериодЗаполнен
	               |						ТОГДА ДокументЗаказНаВнутреннееПотребление.ДатаОтгрузки МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |					ИНАЧЕ ИСТИНА
	               |				КОНЕЦ
	               |				И IDРемонтов.ID ЕСТЬ NULL
	               |			ИЛИ НЕ IDРемонтов.ID ЕСТЬ NULL)
	               |	И НЕ ЗаказыНаВнутреннееПотребление.Номенклатура.ВидНоменклатуры.ТипНоменклатуры В (&Услуга)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ID_Ремонта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	               |	ВЫБОР
	               |		КОГДА &ФОИспользованиеХарактеристик
	               |			ТОГДА ТоварыНаСкладахОстатки.Характеристика
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	               |	КОНЕЦ КАК ХарактеристикаНоменклатуры,
	               |	СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток) КАК Количество
	               |ПОМЕСТИТЬ ИмеющиесяВсего
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
	               |ГДЕ
	               |	НЕ ТоварыНаСкладахОстатки.Номенклатура.ВидНоменклатуры.ТипНоменклатуры В (&Услуга)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТоварыНаСкладахОстатки.Номенклатура,
	               |	ВЫБОР
	               |		КОГДА &ФОИспользованиеХарактеристик
	               |			ТОГДА ТоварыНаСкладахОстатки.Характеристика
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	               |	КОНЕЦ
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура,
	               |	ХарактеристикаНоменклатуры
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	               |	ВЫБОР
	               |		КОГДА &ФОИспользованиеХарактеристик
	               |			ТОГДА ТоварыНаСкладахОстатки.Характеристика
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	               |	КОНЕЦ КАК ХарактеристикаНоменклатуры,
	               |	СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток) КАК Количество
	               |ПОМЕСТИТЬ Имеющиеся
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.Остатки(
	               |			&ДатаОкончания,
	               |			&НеОтбиратьПоСкладу
	               |				ИЛИ Склад = &Склад) КАК ТоварыНаСкладахОстатки
	               |ГДЕ
	               |	НЕ ТоварыНаСкладахОстатки.Номенклатура.ВидНоменклатуры.ТипНоменклатуры В (&Услуга)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТоварыНаСкладахОстатки.Номенклатура,
	               |	ВЫБОР
	               |		КОГДА &ФОИспользованиеХарактеристик
	               |			ТОГДА ТоварыНаСкладахОстатки.Характеристика
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	               |	КОНЕЦ
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура,
	               |	ХарактеристикаНоменклатуры
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТребуемыеСумма.Номенклатура КАК Номенклатура,
	               |	ТребуемыеСумма.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	СУММА(ТребуемыеСумма.ТребуемоеКоличество) КАК ТребуемоеКоличество,
	               |	СУММА(ВЫБОР
	               |			КОГДА ТребуемыеСумма.РемонтВыполняется
	               |				ТОГДА ТребуемыеСумма.ТребуемоеКоличество
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ТребуетсяПоВыполняемым
	               |ПОМЕСТИТЬ ТребуемыеСуммаГр
	               |ИЗ
	               |	ТребуемыеСумма КАК ТребуемыеСумма
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТребуемыеСумма.Номенклатура,
	               |	ТребуемыеСумма.ХарактеристикаНоменклатуры
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура,
	               |	ХарактеристикаНоменклатуры
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Заказанные.Номенклатура КАК Номенклатура,
	               |	Заказанные.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	МАКСИМУМ(Заказанные.ЗаказанноеКоличество) КАК ЗаказанноеКоличество,
	               |	Заказанные.КодСтроки КАК КодСтроки,
	               |	Заказанные.ДокументЗаказа КАК ДокументЗаказа
	               |ПОМЕСТИТЬ ВТ_ЗаказанныеГруппировка
	               |ИЗ
	               |	Заказанные КАК Заказанные
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Заказанные.Номенклатура,
	               |	Заказанные.ХарактеристикаНоменклатуры,
	               |	Заказанные.КодСтроки,
	               |	Заказанные.ДокументЗаказа
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ЗаказанныеГруппировка.Номенклатура КАК Номенклатура,
	               |	ВТ_ЗаказанныеГруппировка.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	СУММА(ВТ_ЗаказанныеГруппировка.ЗаказанноеКоличество) КАК ЗаказанноеКоличество
	               |ПОМЕСТИТЬ ЗаказанныеГр
	               |ИЗ
	               |	ВТ_ЗаказанныеГруппировка КАК ВТ_ЗаказанныеГруппировка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ЗаказанныеГруппировка.Номенклатура,
	               |	ВТ_ЗаказанныеГруппировка.ХарактеристикаНоменклатуры
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура,
	               |	ХарактеристикаНоменклатуры
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТребуемыеСумма.ДокументПлан КАК Документ,
	               |	IDРемонтов.ОбъектРемонта КАК ОбъектРемонта,
	               |	IDРемонтов.ВидРемонта КАК ВидРемонта,
	               |	ВЫБОР
	               |		КОГДА IDРемонтов.РемонтВыполняется
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК РемонтВыполняется,
	               |	IDРемонтов.ДатаНачала КАК ДатаНачала,
	               |	ВЫБОР
	               |		КОГДА СУММА(ВЫБОР
	               |					КОГДА Заказанные1.ДокументЗаказа ЕСТЬ NULL
	               |						ТОГДА 1
	               |					ИНАЧЕ 0
	               |				КОНЕЦ) > 0
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК ЕстьДокументыЗаказа,
	               |	ВЫБОР
	               |		КОГДА СУММА(ВЫБОР
	               |					КОГДА Заказанные.Номенклатура ЕСТЬ NULL
	               |						ТОГДА 1
	               |					ИНАЧЕ 0
	               |				КОНЕЦ) > 0
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК ВЗаказеЕстьВсеПозиции,
	               |	ТребуемыеСумма.ID_Ремонта КАК ID_Ремонта
	               |ПОМЕСТИТЬ НаличиеЗаказовПоРемонтам
	               |ИЗ
	               |	ТребуемыеСумма КАК ТребуемыеСумма
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Заказанные КАК Заказанные
	               |		ПО ТребуемыеСумма.ID_Ремонта = Заказанные.ID_Ремонта
	               |			И ТребуемыеСумма.Номенклатура = Заказанные.Номенклатура
	               |			И ТребуемыеСумма.ХарактеристикаНоменклатуры = Заказанные.ХарактеристикаНоменклатуры
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ IDРемонтов КАК IDРемонтов
	               |		ПО ТребуемыеСумма.ID_Ремонта = IDРемонтов.ID
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Заказанные КАК Заказанные1
	               |		ПО ТребуемыеСумма.ID_Ремонта = Заказанные1.ID_Ремонта
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВЫБОР
	               |		КОГДА IDРемонтов.РемонтВыполняется
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ,
	               |	ТребуемыеСумма.ДокументПлан,
	               |	IDРемонтов.ВидРемонта,
	               |	IDРемонтов.ОбъектРемонта,
	               |	IDРемонтов.ДатаНачала,
	               |	ТребуемыеСумма.ID_Ремонта
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ID_Ремонта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТребуемыеСумма.ДокументПлан КАК Документ,
	               |	IDРемонтов.ОбъектРемонта КАК ОбъектРемонта,
	               |	IDРемонтов.ВидРемонта КАК ВидРемонта,
	               |	ВЫБОР
	               |		КОГДА IDРемонтов.РемонтВыполняется
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК РемонтВыполняется,
	               |	IDРемонтов.ДатаНачала КАК ДатаНачала,
	               |	ВЫБОР
	               |		КОГДА СУММА(ВЫБОР
	               |					КОГДА Заказанные.Номенклатура ЕСТЬ NULL
	               |						ТОГДА 1
	               |					ИНАЧЕ 0
	               |				КОНЕЦ) > 0
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК ВЗаказеЕстьВсеПозиции,
	               |	ТребуемыеСумма.ID_Ремонта КАК ID_Ремонта,
	               |	Заказанные.Номенклатура КАК Номенклатура,
	               |	Заказанные.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	               |ПОМЕСТИТЬ ВТ_НаличиеЗаказовПоНоменклатуре
	               |ИЗ
	               |	ТребуемыеСумма КАК ТребуемыеСумма
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Заказанные КАК Заказанные
	               |		ПО ТребуемыеСумма.ID_Ремонта = Заказанные.ID_Ремонта
	               |			И ТребуемыеСумма.Номенклатура = Заказанные.Номенклатура
	               |			И ТребуемыеСумма.ХарактеристикаНоменклатуры = Заказанные.ХарактеристикаНоменклатуры
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ IDРемонтов КАК IDРемонтов
	               |		ПО ТребуемыеСумма.ID_Ремонта = IDРемонтов.ID
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВЫБОР
	               |		КОГДА IDРемонтов.РемонтВыполняется
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ,
	               |	ТребуемыеСумма.ДокументПлан,
	               |	IDРемонтов.ВидРемонта,
	               |	IDРемонтов.ОбъектРемонта,
	               |	IDРемонтов.ДатаНачала,
	               |	ТребуемыеСумма.ID_Ремонта,
	               |	Заказанные.Номенклатура,
	               |	Заказанные.ХарактеристикаНоменклатуры
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ID_Ремонта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТребуемыеСумма.Номенклатура КАК Номенклатура,
	               |	ТребуемыеСумма.ХарактеристикаНоменклатуры КАК Характеристика,
	               |	СпрНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ЕСТЬNULL(Имеющиеся.Количество, 0) КАК ОстатокНаСкладе,
	               |	ЕСТЬNULL(ИмеющиесяВсего.Количество, 0) КАК ОстатокВсего,
	               |	ЕСТЬNULL(Имеющиеся.Количество, 0) - ЕСТЬNULL(ТребуемыеСумма.ТребуетсяПоВыполняемым, 0) КАК ТекущийИзлишекДефицит,
	               |	ЕСТЬNULL(Имеющиеся.Количество, 0) + ЕСТЬNULL(Заказанные.ЗаказанноеКоличество, 0) - ЕСТЬNULL(ТребуемыеСумма.ТребуемоеКоличество, 0) КАК ПланируемыйИзлишекДефицит
	               |ИЗ
	               |	ТребуемыеСуммаГр КАК ТребуемыеСумма
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	               |		ПО ТребуемыеСумма.Номенклатура = СпрНоменклатура.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ЗаказанныеГр КАК Заказанные
	               |		ПО ТребуемыеСумма.Номенклатура = Заказанные.Номенклатура
	               |			И ТребуемыеСумма.ХарактеристикаНоменклатуры = Заказанные.ХарактеристикаНоменклатуры
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Имеющиеся КАК Имеющиеся
	               |		ПО ТребуемыеСумма.Номенклатура = Имеющиеся.Номенклатура
	               |			И ТребуемыеСумма.ХарактеристикаНоменклатуры = Имеющиеся.ХарактеристикаНоменклатуры
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ИмеющиесяВсего КАК ИмеющиесяВсего
	               |		ПО ТребуемыеСумма.Номенклатура = ИмеющиесяВсего.Номенклатура
	               |			И ТребуемыеСумма.ХарактеристикаНоменклатуры = ИмеющиесяВсего.ХарактеристикаНоменклатуры
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НаличиеЗаказовПоРемонтам.Документ КАК ДокументОснование,
	               |	НаличиеЗаказовПоРемонтам.ОбъектРемонта КАК ОбъектРемонта,
	               |	НаличиеЗаказовПоРемонтам.ВидРемонта КАК ВидРемонта,
	               |	НаличиеЗаказовПоРемонтам.ДатаНачала КАК ДатаНачала,
	               |	НаличиеЗаказовПоРемонтам.РемонтВыполняется КАК РемонтВыполняется,
	               |	НаличиеЗаказовПоРемонтам.ЕстьДокументыЗаказа КАК ЕстьДокументыЗаказа,
	               |	ТребуемыеСумма.Номенклатура КАК Номенклатура,
	               |	ТребуемыеСумма.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	ТребуемыеСумма.ID_Ремонта КАК ID_Ремонта,
	               |	ТребуемыеСумма.ТребуемоеКоличество КАК ТребуемоеКоличество,
	               |	ЕСТЬNULL(ВТ_НаличиеЗаказовПоНоменклатуре.ВЗаказеЕстьВсеПозиции, 0) КАК ВЗаказеЕстьВсеПозиции
	               |ИЗ
	               |	НаличиеЗаказовПоРемонтам КАК НаличиеЗаказовПоРемонтам
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТребуемыеСумма КАК ТребуемыеСумма
	               |		ПО НаличиеЗаказовПоРемонтам.ID_Ремонта = ТребуемыеСумма.ID_Ремонта
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НаличиеЗаказовПоНоменклатуре КАК ВТ_НаличиеЗаказовПоНоменклатуре
	               |		ПО (ВТ_НаличиеЗаказовПоНоменклатуре.ID_Ремонта = ТребуемыеСумма.ID_Ремонта)
	               |			И (ВТ_НаличиеЗаказовПоНоменклатуре.Номенклатура = ТребуемыеСумма.Номенклатура)
	               |			И (ВТ_НаличиеЗаказовПоНоменклатуре.ХарактеристикаНоменклатуры = ТребуемыеСумма.ХарактеристикаНоменклатуры)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НаличиеЗаказовПоРемонтам.Документ,
	               |	НаличиеЗаказовПоРемонтам.ОбъектРемонта,
	               |	НаличиеЗаказовПоРемонтам.ВидРемонта,
	               |	НаличиеЗаказовПоРемонтам.ДатаНачала,
	               |	НаличиеЗаказовПоРемонтам.РемонтВыполняется,
	               |	НаличиеЗаказовПоРемонтам.ЕстьДокументыЗаказа,
	               |	ТребуемыеСумма.Номенклатура,
	               |	ТребуемыеСумма.ХарактеристикаНоменклатуры,
	               |	ТребуемыеСумма.ID_Ремонта,
	               |	ТребуемыеСумма.ТребуемоеКоличество,
	               |	ВТ_НаличиеЗаказовПоНоменклатуре.ВЗаказеЕстьВсеПозиции
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ЗаказанныеГруппировка.ДокументЗаказа КАК ДокументЗаказа,
	               |	СУММА(ВТ_ЗаказанныеГруппировка.ЗаказанноеКоличество) КАК ЗаказанноеКоличество,
	               |	ВТ_ЗаказанныеГруппировка.Номенклатура КАК Номенклатура,
	               |	ВТ_ЗаказанныеГруппировка.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	               |ИЗ
	               |	ВТ_ЗаказанныеГруппировка КАК ВТ_ЗаказанныеГруппировка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ЗаказанныеГруппировка.Номенклатура,
	               |	ВТ_ЗаказанныеГруппировка.ХарактеристикаНоменклатуры,
	               |	ВТ_ЗаказанныеГруппировка.ДокументЗаказа";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ПериодЗаполнен", ЗначениеЗаполнено(Период));
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("НеОтбиратьПоСкладу", Не ЗначениеЗаполнено(Склад));
	Запрос.УстановитьПараметр("Склад", Склад);
	Услуга = Новый Массив(2);
	Услуга[0] = Перечисления.ТипыНоменклатуры.Услуга;
	Услуга[1] = Перечисления.ТипыНоменклатуры.Работа;
	Запрос.УстановитьПараметр("Услуга", Услуга);
	Запрос.УстановитьПараметр("НеОтбиратьПоПодразделению", Не ЗначениеЗаполнено(Подразделение));
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("ФОИспользованиеХарактеристик", Константы.торо_ИспользоватьХарактеристикиНоменклатуры.Получить());

	Результат = Запрос.ВыполнитьПакет();
	Объект.Материалы.Загрузить(Результат[25].Выгрузить());
	Объект.Ремонты.Загрузить(Результат[26].Выгрузить());
	Объект.Заказы.Загрузить(Результат[27].Выгрузить());
	
	НоменклатураСервер.ЗаполнитьСлужебныеРеквизитыПоНоменклатуреВКоллекции(
		Объект.Материалы,
		Новый Структура("ЗаполнитьПризнакХарактеристикиИспользуются",
			Новый Структура("Номенклатура", "ХарактеристикиИспользуются")));
			
	Если СтруктураПоиска <> Неопределено Тогда
		НайденныеСтроки = Объект.Материалы.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() > 0 Тогда
			НайденнаяСтрока = НайденныеСтроки[0];
			Элементы.Материалы.ТекущаяСтрока = НайденнаяСтрока.ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
	Если МассивВыделенных.Количество() > 0 Тогда
		Для Каждого СтруктураПоиска Из МассивВыделенных Цикл
			НайденныеСтроки = Объект.Материалы.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() > 0 Тогда
				НайденнаяСтрока = НайденныеСтроки[0];
				Элементы.Материалы.ВыделенныеСтроки.Добавить(НайденнаяСтрока.ПолучитьИдентификатор());
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	СортироватьМатериалы();
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.МатериалыХарактеристика.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Материалы.ХарактеристикиИспользуются");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("es='<las características no se usan>';ru='<характеристики не используются>';en='<характеристики не используются>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

&НаСервере
Процедура СортироватьМатериалы()
	
	Объект.Материалы.Сортировать(СтрЗаменить(Сортировка, "Материалы", "") + Направление);
	Элементы.Материалы.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	ОбновитьДанные();
КонецПроцедуры

#КонецОбласти