// гкс+ [02.23] Деснол 06.02.2023
&НаСервере
Процедура гкс_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	НСтраница = Элементы.Добавить("гкс_СтраницаКомментарий", Тип("ГруппаФормы"), Элементы.Страницы);
	НСтраница.Вид = ВидГруппыФормы.Страница;
	НСтраница.Заголовок = "Комментарий";
	//
	НЭлемент = Элементы.Добавить("гкс_Комментарий", Тип("ПолеФормы"), Элементы["гкс_СтраницаКомментарий"]);
	НЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НЭлемент.АвтоМаксимальнаяШирина = Ложь;
	НЭлемент.ПутьКДанным = "Объект.гкс_Комментарий";
	НЭлемент.МногострочныйРежим = Истина;
	// гкс+ [03.23] Деснол 13.03.2023
	Если Не РольДоступна("гкс_РедактированиеЗаявкиНаРемонт") Тогда 
		Элементы.Дата.ТолькоПросмотр = Истина;
	КонецЕсли;
	// гкс- [03.23] Деснол 13.03.2023
КонецПроцедуры // гкс- [02.23] Деснол 06.02.2023
