
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	торо_ЛокализацияАвтоформы.ПриСозданииСтандартнойФормы(ЭтаФорма, Отказ, СтандартнаяОбработка);
	торо_ЛокализацияАвтоформы.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	Если Параметры.ВидФормы <> "ФормаОбъекта" Тогда
		торо_ЛокализацияАвтоформы.МодифицироватьСписокДляПеревода(ЭтаФорма.Список);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	Отказ = Ложь;
	ЗаписатьНаСервере(Отказ);
	Если Не Отказ Тогда 
		ТемпСтрукт = Новый Структура("ИсходныйКлючЗаписи", Неопределено);
		ЗаполнитьЗначенияСвойств(ТемпСтрукт,ЭтаФорма.Объект);
		Если Не ТемпСтрукт.ИсходныйКлючЗаписи = Неопределено Тогда 
			ОповеститьОбИзменении(ТемпСтрукт.ИсходныйКлючЗаписи);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	Отказ = Ложь;
	ЗаписатьНаСервере(Отказ);
	Если Не Отказ Тогда 
		ТемпСтрукт = Новый Структура("ИсходныйКлючЗаписи", Неопределено);
		ЗаполнитьЗначенияСвойств(ТемпСтрукт,ЭтаФорма.Объект);
		Если Не ТемпСтрукт.ИсходныйКлючЗаписи = Неопределено Тогда 
			ОповеститьОбИзменении(ТемпСтрукт.ИсходныйКлючЗаписи);
		КонецЕсли;
		//
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере(Отказ, РежимЗаписи = Неопределено)

	ПараметрыЗаписи = Новый Структура();
	ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ЭтаФорма["Объект"], ПараметрыЗаписи);
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	Если РежимЗаписи = Неопределено Тогда 
		СтруктураПроведения = Новый Структура("Проведен",Ложь);
		ЗаполнитьЗначенияСвойств(СтруктураПроведения,ТекОбъект);
		Если СтруктураПроведения.Проведен Тогда 
			ТекОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			ТекОбъект.Записать();
		КонецЕсли;
	Иначе
		ТекОбъект.Записать(РежимЗаписи);
	КонецЕсли;
	//
	ЗначениеВРеквизитФормы(ТекОбъект,"Объект");
	Модифицированность = Ложь;
	
	ПослеЗаписиНаСервере(ЭтаФорма["Объект"], ПараметрыЗаписи);
КонецПроцедуры

&НаКлиенте
Процедура Перечитать(Команда)
	Отказ = Ложь;
	ПеречитатьНаСервере(Отказ);
КонецПроцедуры

&НаСервере
Процедура ПеречитатьНаСервере(Отказ)
	Если ЗначениеЗаполнено(ЭтаФорма.Объект.Ссылка) Тогда 
		ТекОбъект = ЭтаФорма.Объект.Ссылка.ПолучитьОбъект();
		ЗначениеВРеквизитФормы(ТекОбъект,"Объект");
		Модифицированность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПометитьНаУдаление(Команда)
	Отказ = Ложь;
	ПометитьНаУдалениеНаСервере(Отказ);
КонецПроцедуры

&НаСервере 
Процедура ПометитьНаУдалениеНаСервере(Отказ)

	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.Записать();
	ТекОбъект.УстановитьПометкуУдаления(Не ТекОбъект.ПометкаУдаления);
	ЗначениеВРеквизитФормы(ТекОбъект,"Объект");
	Модифицированность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура Провести(Команда)
	Отказ = Ложь;
	ЗаписатьНаСервере(Отказ, РежимЗаписиДокумента.Проведение);
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПроведение(Команда)
	Отказ = Ложь;
	ЗаписатьНаСервере(Отказ, РежимЗаписиДокумента.ОтменаПроведения);
КонецПроцедуры

&НаКлиенте
Процедура торо_ОткрытьСправку(Команда)
	ТемпСтрукт = Новый Структура("торо_ПутьКСправке",Неопределено);
	ЗаполнитьЗначенияСвойств(ТемпСтрукт,ЭтаФорма);
	Если ЗначениеЗаполнено(ТемпСтрукт.торо_ПутьКСправке) Тогда 
		ОткрытьСправку(ТемпСтрукт.торо_ПутьКСправке);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекДанные = Элементы["Список"].ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		ПоказатьЗначение(,ТекДанные.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(ТекФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи)
	торо_ЛокализацияАвтоформы.ПередЗаписьюНаСервере(ТекФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	торо_ЛокализацияАвтоформы.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// >> [Деснол] [Ушаков А.Д.] [20.09.2019]
	ПриОткрытииНаСервере();
	Если Параметры.ВидФормы <> "ФормаЭлемента" И Параметры.ВидФормы <> "ФормаОбъекта" Тогда
		Элементы.Ссылка.Видимость = Ложь;
	КонецЕсли; 
	// << [Деснол] [Ушаков А.Д.] [20.09.2019] 
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	ТемпСтрукт = Новый Структура("СписокКоманднаяПанель",Неопределено);
	ЗаполнитьЗначенияСвойств(ТемпСтрукт,ЭтаФорма.Элементы);
	Если Не ТемпСтрукт.СписокКоманднаяПанель = Неопределено Тогда 
		Для Каждого СМ Из ЭтаФорма.Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы Цикл
			ЭтаФорма.Элементы.Переместить(СМ,ТемпСтрукт.СписокКоманднаяПанель);
		КонецЦикла;
	КонецЕсли;
	
	// >> [Деснол] [Ушаков А.Д.] [20.09.2019]
	Если Параметры.ВидФормы = "ФормаВыбора" Тогда
		Элементы.Переместить(Элементы.Кнопка_Выбрать, Элементы.СписокКоманднаяПанель, Элементы.СписокСоздать);
	КонецЕсли; 
	// << [Деснол] [Ушаков А.Д.] [20.09.2019] 
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		ОповеститьОВыборе(ТекДанные.Ссылка);
	КонецЕсли;
КонецПроцедуры