
&После("ПередЗаписью")
Процедура Расш_гкс_ПередЗаписью(Отказ)
	Если ЭтотОбъект.Значение = Ложь Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	торо_ОбъектыРемонта.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
			|ГДЕ
			|	торо_ОбъектыРемонта.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	торо_ТиповыеОР.Ссылка
			|ИЗ
			|	Справочник.торо_ТиповыеОР КАК торо_ТиповыеОР
			|ГДЕ
			|	торо_ТиповыеОР.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто)";
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() = Ложь Тогда 
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru='В справочнике объектов ремонта присутствуют функциональные места.';
			|en='In the directory of Equipment Items there are functional positions.';
			|es=''");
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
