#Область ПрограммныйИнтерфейс

// Функция ПолучитьДанныеРегистра
//
// Описание: Возвращает таблицу значений с колонками Должность и квалификация 
// 		с данными в разрезе организации и подразделение на определенную дату
//
// Параметры
//  Организация - СправочникСсылка.Организации - Организации
//  Подразделение - СправочникСсылка.СтруктураПредприятия – Подразделение
//  Должность - СправочникСсылка.Должности - Должность
//  Период - Дата – Дата, на которую получают данные, если не указана - то текущая дата сеанса	
//
// Возвращаемое значение: ТаблицаЗначений 
//   
Функция ПолучитьДанныеРегистра(Организация, Подразделение, Должность = Неопределено, Период = Неопределено) Экспорт 
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат Неопределено;		
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Подразделение) Тогда
		Возврат Неопределено;		
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		Период = ТекущаяДатаСеанса();		
	КонецЕсли; 

	Запрос = Новый Запрос;
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Соответствия.Должность КАК Должность,
		|	Соответствия.Квалификация КАК Квалификация
		|ИЗ
		|	РегистрСведений.гкс_СоответствияДолжностейИКвалификаций.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Подразделение = &Подразделение
		|				И Должность = &Должность) КАК Соответствия";
	
	Запрос.УстановитьПараметр("Период", КонецДня(Период));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Если ЗначениеЗаполнено(Должность) Тогда
		Запрос.УстановитьПараметр("Должность", Должность);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
		"И Должность = &Должность", "");
	КонецЕсли; 
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции 

#КонецОбласти

