#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТаблицуГарантийФМ(ОбъектРемонта, ДатаОкончания = Неопределено) Экспорт
	
	Иерархия = Константы.торо_ИерархияДляВводаНовыхОР.Получить();
	Если Иерархия.ИзменяетсяДокументами Тогда 
		ТекстЗапросаПодчиненных = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.ОбъектИерархии КАК ОР
		|ПОМЕСТИТЬ ПодчиненныеОР
		|ИЗ
		|	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(
		|			,
		|			СтруктураИерархии В
		|					(ВЫБРАТЬ
		|						торо_ИерархияДляВводаНовыхОР.Значение КАК Значение
		|					ИЗ
		|						Константа.торо_ИерархияДляВводаНовыхОР КАК торо_ИерархияДляВводаНовыхОР)
		|				И РодительИерархии = &ОбъектРемонта) КАК торо_РасположениеОРВСтруктуреИерархииСрезПоследних"+"
		|;
		| ";
	Иначе
		ТекстЗапросаПодчиненных = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_ИерархическиеСтруктурыОР.ОбъектИерархии КАК ОР
		|ПОМЕСТИТЬ ПодчиненныеОР
		|ИЗ
		|	РегистрСведений.торо_ИерархическиеСтруктурыОР КАК торо_ИерархическиеСтруктурыОР
		|ГДЕ
		|	торо_ИерархическиеСтруктурыОР.СтруктураИерархии В
		|			(ВЫБРАТЬ
		|				торо_ИерархияДляВводаНовыхОР.Значение КАК Значение
		|			ИЗ
		|				Константа.торо_ИерархияДляВводаНовыхОР КАК торо_ИерархияДляВводаНовыхОР)
		|	И торо_ИерархическиеСтруктурыОР.РодительИерархии = &ОбъектРемонта"+"
		|;
		| ";
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПодчиненных + "ВЫБРАТЬ
	                                         |	торо_СрокиГарантииОбъектовРемонта.ОбъектРемонта КАК ОбъектРемонта,
	                                         |	торо_СрокиГарантииОбъектовРемонта.УсловияГарантии КАК УсловияГарантии,
	                                         |	торо_СрокиГарантииОбъектовРемонта.УсловияГарантии.ДатаНачалаГарантии КАК ДатаНачала,
	                                         |	торо_СрокиГарантииОбъектовРемонта.УсловияГарантии.ДатаОкончанияГарантии КАК ДатаОкончания,
	                                         |	торо_СрокиГарантииОбъектовРемонта.ГарантирующаяОрганизация КАК ГарантирующаяОрганизация,
	                                         |	торо_СрокиГарантииОбъектовРемонта.Договор КАК Договор,
	                                         |	торо_СрокиГарантииОбъектовРемонта.УсловияГарантии.ПроверятьПериодГарантии КАК ПроверятьПериодГарантии,
	                                         |	торо_СрокиГарантииОбъектовРемонта.УсловияГарантии.ПроверятьНаработку КАК ПроверятьНаработку,
	                                         |	торо_СрокиГарантииОбъектовРемонта.УсловияГарантии.ПоказательНаработки КАК ПоказательНаработки,
	                                         |	торо_СрокиГарантииОбъектовРемонта.УсловияГарантии.ЗначениеНаработки КАК ЗначениеНаработки
	                                         |ИЗ
	                                         |	РегистрСведений.торо_СрокиГарантииОбъектовРемонта КАК торо_СрокиГарантииОбъектовРемонта
	                                         |ГДЕ
	                                         |	торо_СрокиГарантииОбъектовРемонта.ОбъектРемонта В
	                                         |			(ВЫБРАТЬ
	                                         |				ТЧ.ОР
	                                         |			ИЗ
	                                         |				ПодчиненныеОР КАК ТЧ)";
	
	Запрос.УстановитьПараметр("ОбъектРемонта", ОбъектРемонта);
	
	ТаблицаГарантий = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаГарантий;
	
КонецФункции

#КонецОбласти