#Область ПрограммныйИнтерфейс

// Процедура - При получении настроек
//
// Параметры:
//  Настройки	 - Структура - ключ - имя настройки, значение – значение настройки
//
Процедура ПриПолученииНастроек(Настройки) Экспорт
	
	Настройки.Алгоритмы.ПриПолученииОписанияВариантаНастройки = Истина;
	
КонецПроцедуры

// Процедура - При получении описания варианта настройки
//
// Параметры:
//  ОписаниеВарианта	 - Структура - Переченьдоступных свойств варианта настройки
//  ИдентификаторНастройки	 - Строка - Строковый идентификатор варианта настройки
//  ПараметрыКонтекста	 - Структура - Режим работы метода через контекст его выполнения
//
Процедура ПриПолученииОписанияВариантаНастройки(ОписаниеВарианта, ИдентификаторНастройки, ПараметрыКонтекста) Экспорт
	
	ОписаниеВарианта.ИспользоватьПомощникСозданияОбменаДанными = Истина;
	ОписаниеВарианта.КраткаяИнформацияПоОбмену = НСтр("es='El ajuste dado permitirá sincronizar los datos entre los programas 1С: ТОИР la Dirección de las reparaciones y el servicio de la maquinaria 2.0 y 1С: RCM';ru='Данная настройка позволит синхронизировать данные между программами 1С: ТОИР Управление ремонтами и обслуживанием оборудования 2.0 и 1С: RCM';en='This setting will allow you to synchronize data between 1C: MRO programs. Repair and maintenance management of equipment 2.0 and 1C: RCM'");
	ОписаниеВарианта.ПодробнаяИнформацияПоОбмену = "ПланОбмена.ОбменТОИР20RCM.Форма.ПодробнаяИнформация";
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти