////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПЕРЕМЕННЫЕ
&НаКлиенте
Перем РемонтОборудованияУдаляется;

&НаКлиенте
Перем ИДВыбраннойСтроки;

&НаКлиенте
Перем СтруктураДанныхДоРедактирования;


#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	   
	Если Параметры.Свойство("Основание") 
		И ТипЗнч(Параметры.Основание) <> Тип("Структура") 
		И ТипЗнч(Параметры.Основание) <> Тип("Соответствие") Тогда
		торо_ЗаполнениеДокументов.ПроверитьВозможностьВводаНаОсновании(Параметры.Основание, Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	
	Если Параметры.Свойство("Основание") И Параметры.Свойство("ВыделенныеСтроки") Тогда
		ДокОснованиеППР = Параметры.Основание;
		МассивIDИзППР.ЗагрузитьЗначения(Параметры.ВыделенныеСтроки);
	КонецЕсли;
	
	Если Параметры.Свойство("ID") Тогда
		
		Строки = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", Параметры.ID));
		Если Строки.Количество() Тогда
			Элементы.РемонтыОборудования.ТекущаяСтрока = Строки[0].ПолучитьИдентификатор();
		КонецЕсли;
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
		
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	УстановитьУсловноеОформление();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ФункциональныеОпции
	ФОИспользоватьГарантии      = ПолучитьФункциональнуюОпцию("торо_ИспользоватьГарантии");
	ФОЗапретитьРемонтГарантийногоОборудованияХозспособом = ПолучитьФункциональнуюОпцию("торо_ЗапретитьРемонтГарантийногоОборудованияХозспособом");
	ФОИспользоватьОстановочные	= ПолучитьФункциональнуюОпцию("торо_ИспользоватьОстановочныеРемонты");
		
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
				
		Если ФОИспользоватьГарантии Тогда
			Для каждого ТекСтрока из Объект.РемонтыОборудования Цикл
				ТекСтрока.ГарантийныйРемонт = торо_ГарантийноеОбслуживание.ПолучитьЗначениеФлагаГарантийныйРемонтДляОбъектаРемонта(
					ТекСтрока.ОбъектРемонта, ТекСтрока.ДатаНачала, ТекСтрока.ДатаОкончания);
			КонецЦикла;
		КонецЕсли;		
	КонецЕсли;
	
	ЗаполнитьДеревоРемонтныхРаботНаСервере();
	
	// Заголовок формы++
	торо_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(Объект, ЭтаФорма, "");
	// Заголовок формы--
	
	// Согласование++
	ВидДокумента = Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_НарядНаВыполнениеРемонтныхРабот;
	торо_РаботаССогласованиями.ПриСозданииНаСервере(ЭтаФорма, ВидДокумента);
	// Согласование --
	
	Для Каждого СтрокаРемонта Из Объект.РемонтыОборудования Цикл
		Если СтрокаРемонта.ДокументИсточник <> Неопределено Тогда
			СтрокаРемонта.ТипДокументаОснования = СтрокаРемонта.ДокументИсточник.Метаданные().Имя;
		КонецЕсли;	
	КонецЦикла;
	
	ПравоРедактирование = ПравоДоступа("Редактирование", Метаданные.Документы.торо_НарядНаВыполнениеРемонтныхРабот);
	
	Если ФОИспользоватьОстановочные Тогда
		ОбновитьОстановочные();
	КонецЕсли;
	ОбновитьЗависимыеЛоты();
	ОбновитьДоступностьДляРедактирования();
	
	// Ограничение ввода на основании
	торо_СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка, Новый Структура("ОграничитьВводНаОсновании, УстановитьСвойствоЭлементовФормыОтПрав",Истина, Истина));

	УправлениеВидимостью(ЭтотОбъект);
	
	ПараметрыВыбораМассив = Новый Массив;
	ПараметрыВыбораМассив.Добавить(Новый ПараметрВыбора("ДополнительныеПараметры.ОтображениеСписком", Истина));
	Элементы.ДеревоРемонтныхРаботИсполнитель.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораМассив);
	
	// >> [Деснол] [Ушаков А.Д.] [03.10.2019]
	дс_ЛокализоватьУсловноеОформление();
	// << [Деснол] [Ушаков А.Д.] [03.10.2019] 
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
    УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И Объект.РемонтыОборудования.Количество() = 0 И Объект.ДокументыОснования.Количество() > 0 Тогда
		
		Если МассивIDИзППР.Количество() = 0 Тогда
			ПодключитьОбработчикОжидания("ПодборРемонтовОбработчикОжидания",0.5,Истина);
		Иначе
			ВыбранноеЗначение = ЗаполнитьДанныеНаОснованииППРВыделенныеСтроки();
			ОбработкаВыбора(ВыбранноеЗначение, ЭтаФорма);
		КонецЕсли;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Ссылка) И Объект.РемонтыОборудования.Количество() > 0 И 
		       ( ТипЗнч(Объект.ДокументыОснования[0].ДокументОснование) = Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот") ИЛИ 
			     ТипЗнч(Объект.ДокументыОснования[0].ДокументОснование) = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") ИЛИ 
				 ТипЗнч(Объект.ДокументыОснования[0].ДокументОснование) = Тип ("ДокументСсылка.торо_ВыявленныеДефекты")) Тогда
			РемОборудования = Объект.РемонтыОборудования[0].ID;
			НайденныеСтрокиРемонта = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", РемОборудования ));
			НайденныеСтрокиИсполнителей = Объект.Исполнители.НайтиСтроки( Новый Структура("РемонтыОборудования_ID", РемОборудования )); 
			Если НайденныеСтрокиРемонта.Количество() <> 0 И НайденныеСтрокиИсполнителей.Количество() = 0 Тогда
				НомерСтроки = НайденныеСтрокиРемонта[0].ПолучитьИдентификатор();
				Если ТипЗнч(Объект.ДокументыОснования[0].ДокументОснование) = Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот") Тогда
					ЗаполнитьИсполнителейПоОснованиюНаСервере(Неопределено, НомерСтроки);
					ЗаполнитьИсполнителейПоНормамНаСервере(Неопределено, НомерСтроки);
				Иначе
					ЗаполнитьИсполнителейПоОснованиюНаСервере(Неопределено, НомерСтроки);
				КонецЕсли; 
			КонецЕсли; 
	КонецЕсли;
	
	ЭтоПервыйДокументВЦепочке = ЭтоПервыйДокументВЦепочке();
	ЭтоПоследнийДокументВЦепочке = ЭтоПоследнийДокументВЦепочке();
	
	// Имена элементов формы типа ТаблицаФормы, в которых необходимо обрабатывать события изменения строк.
	Массив = Новый Массив;
	Массив.Добавить("ДокументыОснования");
	торо_СобытияФормКлиент.ЗаполнитьСтруктуруДанныхДоРедактирования(СтруктураДанныхДоРедактирования,Массив);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	Если ФОИспользоватьГарантии И ФОЗапретитьРемонтГарантийногоОборудованияХозспособом Тогда
		торо_ГарантийноеОбслуживание.ПроверитьНаличиеКонтрагентов(Объект, "ИсполнителиПоРемонтам", "Исполнитель", Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

	// Согласование++
	торо_РаботаССогласованиями.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	// Согласование--
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение
		И ФОИспользоватьГарантии Тогда
		торо_ГарантийноеОбслуживание.СформироватьПредупрежденияОРекламационныхАктах(Объект, "РемонтыОборудования");
	КонецЕсли;
	
	Если торо_ОбщегоНазначения.ПроверитьВремяРаботыСотрудников(Объект, "Исполнители") Тогда 
		Отказ = Истина;
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Согласование++
	торо_РаботаССогласованиями.ПриЗаписиНаСервере(ЭтаФорма, ТекущийОбъект);
	// Согласование--

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// Заголовок формы++
	торо_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(Объект, ЭтаФорма, "");
	// Заголовок формы--
	
	РемонтыОборудованияОбновитьДокументыИсточники();
	
	Если ФОИспользоватьОстановочные Тогда
		ОбновитьОстановочные();
	КонецЕсли;
	ОбновитьЗависимыеЛоты();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("СозданДокументЧерезРМТехСпец", Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	РемонтУжеДобавлен = Ложь;
	ЭтоРемонтнаяРабота = Ложь;
	МассивИДДобавленныхРемонтов = Новый Массив;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") И ВыбранноеЗначение.Количество() > 0 Тогда 
		Для каждого ЭлементМассива Из ВыбранноеЗначение Цикл
			Если ТипЗнч(ЭлементМассива) = Тип("Структура") И ЭлементМассива.Свойство("СтрокаРемонтовОборудования") Тогда 
				НайденныеРемонты = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", ЭлементМассива.СтрокаРемонтовОборудования.ID));
				Если НайденныеРемонты.Количество() > 0 Тогда
					РемонтУжеДобавлен = Истина;
					МассивИДДобавленныхРемонтов.Добавить(ЭлементМассива.СтрокаРемонтовОборудования.ID);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если РемонтУжеДобавлен Тогда 
			Вопрос = НСтр("es='Algunos de las reparaciones escogidas son añadidos ya. Los trabajos de reparación vinculados serán limpiados y añadidos de nuevo. ¿Continuar?';ru='Некоторые из выбранных ремонтов уже добавлены. Связанные ремонтные работы будут очищены и добавлены заново. Продолжить?';en='Some of the selected repairs have already been added. Associated repairs will be cleaned and re-added. Continue?'");
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") И ВыбранноеЗначение.Свойство("СтрокаРемонтовОборудования") 
		И ВыбранноеЗначение.Количество() > 0 Тогда
		ЭтоРемонтнаяРабота = ВыбранноеЗначение.ЭтоРемонтнаяРабота;
		НайденныеРемонты = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", ВыбранноеЗначение.СтрокаРемонтовОборудования.ID));
		Если НайденныеРемонты.Количество() > 0 Тогда
			РемонтУжеДобавлен = Истина;
			МассивИДДобавленныхРемонтов.Добавить(ВыбранноеЗначение.СтрокаРемонтовОборудования.ID);
		КонецЕсли;
		
		Если РемонтУжеДобавлен Тогда 
			Вопрос = НСтр("es='Esta reparación es añadida ya. Los trabajos de reparación vinculados serán limpiados y añadidos de nuevo. ¿Continuar?';ru='Этот ремонт уже добавлен. Связанные ремонтные работы будут очищены и добавлены заново. Продолжить?';en='This repair has already been added. Associated repairs will be cleaned and re-added. Continue?'");
		КонецЕсли;
	КонецЕсли;
	
	Если РемонтУжеДобавлен И НЕ ЭтоРемонтнаяРабота Тогда
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ВыбранноеЗначение", ВыбранноеЗначение);
		СтруктураПараметров.Вставить("МассивИДДобавленныхРемонтов", МассивИДДобавленныхРемонтов);
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаВыбораПослеВопроса", ЭтотОбъект, СтруктураПараметров),
		   Вопрос, РежимДиалогаВопрос.ДаНет);
	Иначе
		 ОбработкаВыбораЗавершение(ВыбранноеЗначение);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства

	Если ИмяСобытия = "РабочееМестоТехСпец" Тогда
		Объект.Организация = Параметр.Организация;
		Объект.Подразделение = Параметр.Подразделение;
		Для каждого Элем Из Параметр.МассивСтруктур Цикл
			ДеревоРемонтныхРаботОбработкаВыбора(, Элем, );
		КонецЦикла;
	КонецЕсли;
	
	// Согласование++
	Если ИмяСобытия = "УтверждениеСтатусаСогласования" Тогда
		Если Параметр.Документ = Объект.Ссылка Тогда
			ЗавершитьУтверждениеСтатусаДокумента(Параметр);
		КонецЕсли;
	КонецЕсли;
	// Согласование--
	
КонецПроцедуры
// гкс+ [Перед записью] Куст 27.10.2020
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
КонецПроцедуры
// гкс- [Перед записью] Куст 27.10.2020

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура СпособСогласованияПриИзменении(Элемент)
	Если фПослеОчистки = Ложь Тогда
		ОбновитьДеревоСогласующих(Истина);
		торо_РаботаССогласованиямиКлиентСервер.ДобавитьСтрокуВИсториюСтатусов(ЭтаФорма, СтатусДокументаРегистр,, Истина);
	Иначе
		фПослеОчистки = Ложь;
	КонецЕсли;
	
	УправлениеВидимостью(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СпособСогласованияОчистка(Элемент, СтандартнаяОбработка)
	Если Элемент.Значение = ПредопределенноеЗначение("Справочник.торо_СпособыСогласованияДокументов.ПустаяСсылка") Тогда
		фПослеОчистки = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СпособСогласованияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если СогласующиеРегистр.Количество() > 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		ПоказатьВопрос(Новый ОписаниеОповещения("СпособСогласованияНачалоВыбораЗавершение",ЭтотОбъект,Новый Структура("Элемент", Элемент)),
						НСтр("es='¡Los datos de los estatus establecidos del documento serán limpiados! ¿Continuar?';ru='Данные по установленным статусам документа будут очищены! Продолжить?';en='Data on the established statuses of the document will be cleared! Continue?'"), РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоРемонтныхРабот

&НаКлиенте
Процедура ДеревоРемонтныхРаботПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРемонтныхРаботОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекСтрокаДерева = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	
	Если ТекСтрокаДерева = Неопределено Тогда
		СтрокаРодитель = Новый Структура("ID, РемонтыОборудования_ID, Родитель_ID", "", "", "");
		ИДВыбраннойСтроки = "";
	Иначе
		СтрокаРодитель = ТекСтрокаДерева;
		ИДВыбраннойСтроки = ТекСтрокаДерева.ID;
	КонецЕсли;
	
	
	ТекРемонт = Элементы.РемонтыОборудования.ТекущиеДанные;
	
	Если ТекРемонт <> Неопределено Тогда
		РемонтыОборудования_ID = ТекРемонт.ID;
	Иначе
		РемонтыОборудования_ID = "";
	КонецЕсли;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") И ВыбранноеЗначение.Количество()>0 И ТипЗнч(ВыбранноеЗначение[0]) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда
		ТекущийРемонт = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
		Пока ТекущийРемонт <> Неопределено И ТипЗнч(ТекущийРемонт.РемонтнаяРабота) <> Тип("Строка") Цикл
			Если ТекущийРемонт.РемонтнаяРабота = ВыбранноеЗначение[0] Тогда
				ШаблонСообщения = НСтр("es='El significado escogido ""%1"" no puede ser incluido en la composición.';ru='Выбранное значение ""%1"" не может быть включено в состав самого себя.';en='The selected value ""%1"" cannot be included in itself.'");
				ТекстСообщения = СтрШаблон(ШаблонСообщения, ВыбранноеЗначение[0]);
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
				Возврат;
			КонецЕсли; 
			ТекущийРемонт = ТекущийРемонт.ПолучитьРодителя();	
		КонецЦикла; 
	КонецЕсли;
	
	Если  ТекРемонт <> Неопределено Тогда
		ТекущиеДанные = Новый Структура("ТекущийРемонт_ID, СтрокаРодитель_ID, СтрокаРодительРемонтыОборудования_ID, СтрокаРодительРодитель_ID, ДатаНачалаРемонта", РемонтыОборудования_ID, СтрокаРодитель.ID, СтрокаРодитель.РемонтыОборудования_ID, СтрокаРодитель.Родитель_ID, ТекРемонт.ДатаНачала);
	Иначе
	    ТекущиеДанные = Новый Структура("ТекущийРемонт_ID, СтрокаРодитель_ID, СтрокаРодительРемонтыОборудования_ID, СтрокаРодительРодитель_ID, ДатаНачалаРемонта", РемонтыОборудования_ID, СтрокаРодитель.ID, СтрокаРодитель.РемонтыОборудования_ID, СтрокаРодитель.Родитель_ID, Дата(1,1,1,0,0,0));
	КонецЕсли; 
	
	СтруктураПараметры = Новый Структура;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		МассивСтруктурВозврата = ДеревоРемонтныхРаботОбработкаВыбораНаСервереДляМассива(ВыбранноеЗначение, ТекущиеДанные, СтруктураПараметры);
		Если ФОИспользоватьОстановочные Тогда
			ОбновитьОстановочные();
		КонецЕсли;
	Иначе
		СтруктураВозврата = ДеревоРемонтныхРаботОбработкаВыбораНаСервере(ВыбранноеЗначение, ТекущиеДанные, СтруктураПараметры);
		МассивСтруктурВозврата = Новый Массив;
		МассивСтруктурВозврата.Добавить(СтруктураВозврата);
		Если ФОИспользоватьОстановочные Тогда
			ОбновитьОстановочные();
		КонецЕсли; 
	КонецЕсли;
		
	Для Каждого ЭлементМассива Из МассивСтруктурВозврата Цикл
		Если ТипЗнч(ЭлементМассива) = Тип("Строка") Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(ЭлементМассива);
		КонецЕсли;
	КонецЦикла;	
		
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		Массивстрок = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", ВыбранноеЗначение.СтрокаРемонтовОборудования.ID));
		Если МассивСтрок.Количество() Тогда
			Идентиф = МассивСтрок[0].ПолучитьИдентификатор();
			Элементы.РемонтыОборудования.ТекущаяСтрока = Идентиф;
		КонецЕсли;
	КонецЕсли;
	ОбновитьЗависимыеЛоты();
	Модифицированность = Истина;

	Если Элементы.РемонтыОборудования.ТекущаяСтрока = Неопределено Тогда
		Если Объект.РемонтыОборудования.Количество() > 0 Тогда
			Элементы.РемонтыОборудования.ТекущаяСтрока = Объект.РемонтыОборудования[0].ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
	РемонтыОборудованияПриАктивизацииСтроки(Элементы.РемонтыОборудования); 
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗависимыеЛоты()
	Если Константы.торо_ИспользоватьЛоты.Получить() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	торо_ЗапланированныеПодрядчикиРемонтовСрезПоследних.ID КАК ID
		               |ИЗ
		               |	РегистрСведений.торо_ЗапланированныеПодрядчикиРемонтов.СрезПоследних КАК торо_ЗапланированныеПодрядчикиРемонтовСрезПоследних
		               |ГДЕ
		               |	торо_ЗапланированныеПодрядчикиРемонтовСрезПоследних.ID В(&МассивID)";
		Запрос.УстановитьПараметр("МассивID", Объект.РемонтыОборудования.Выгрузить().ВыгрузитьКолонку("ID"));
		МассивСвязанныхЛотов = Запрос.Выполнить().Выгрузить();
		Для каждого Ремонт Из МассивСвязанныхЛотов Цикл
			 МассивIDЛотов.Добавить(Ремонт.ID);
		КонецЦикла; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРемонтныхРаботПередУдалением(Элемент, Отказ) 
	ТекСтрокаДРР = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	
	СтруктураСвязанныхТЧ = Новый Структура();
	СтруктураСвязанныхТЧ.Вставить("Исполнители");
	СтруктураСвязанныхТЧ.Вставить("РемонтныеРаботы");
	
	// >> [Деснол] [Ушаков А.Д.] [03.10.2019] 
	Если НЕ ЗначениеЗаполнено(ТекСтрокаДРР.Родитель_ID) И ТекСтрокаДРР.РемонтнаяРабота = дс_ПолучитьПредставлениеКорневойРемонтнойРаботы() Тогда
	//Если НЕ ЗначениеЗаполнено(ТекСтрокаДРР.Родитель_ID) И ТекСтрокаДРР.РемонтнаяРабота = "Ремонтные работы" Тогда
	// << [Деснол] [Ушаков А.Д.] [03.10.2019] 
		
		ТекСтрокаДРР.ПолучитьЭлементы().Очистить();
		
		Для Каждого КлючИЗначение Из СтруктураСвязанныхТЧ Цикл
			
			ТабличнаяЧасть = Объект[КлючИЗначение.Ключ];
		
			ПараметрыПоиска = Новый Структура;
			ПараметрыПоиска.Вставить("РемонтыОборудования_ID", Элементы.РемонтыОборудования.ТекущиеДанные.ID);
		
			СтрокиКУдалению = ТабличнаяЧасть.НайтиСтроки(ПараметрыПоиска);
			
			Для Каждого Строка Из СтрокиКУдалению Цикл
				
				ТабличнаяЧасть.Удалить(Строка);
				
			КонецЦикла;		    
						
		КонецЦикла;

		Модифицированность = Истина;
		
		Отказ = Истина;

	Иначе
		
		ВыделенныеСтроки = Элементы.ДеревоРемонтныхРабот.ВыделенныеСтроки;
		МассивСтрокДляУдаления = Новый Массив;
		
		Для каждого Стр Из ВыделенныеСтроки Цикл 
			Строка = ДеревоРемонтныхРабот.НайтиПоИдентификатору(Стр);
			// >> [Деснол] [Ушаков А.Д.] [03.10.2019] 
			Если Строка <> Неопределено И Строка.РемонтнаяРабота <> дс_ПолучитьПредставлениеКорневойРемонтнойРаботы() Тогда 
			//Если Строка <> Неопределено И Строка.РемонтнаяРабота <> "Ремонтные работы" Тогда 
			// << [Деснол] [Ушаков А.Д.] [03.10.2019] 
				МассивСтрокДляУдаления.Добавить(Строка);
			КонецЕсли;
		КонецЦикла;		
		
		Для каждого Элемент Из МассивСтрокДляУдаления Цикл
			СтруктурыДляПередачи = Новый Структура("ID, РемонтыОборудования_ID, Родитель_ID, РемонтнаяРабота",
			Элемент.ID, Элемент.РемонтыОборудования_ID, Элемент.Родитель_ID, Элемент.РемонтнаяРабота);
			УдалитьДанныеТЧПоIDСтрокиДереваНаСервере(СтруктурыДляПередачи, СтруктураСвязанныхТЧ);
			
			СтрокаРодителя = Элемент.ПолучитьРодителя();
			Если СтрокаРодителя <> Неопределено Тогда 
				СтрокаРодителя.ПолучитьЭлементы().Удалить(Элемент); 
			КонецЕсли; 
		КонецЦикла;
		
		
		Модифицированность = Истина;
		Отказ = Истина;  
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДеревоРемонтныхРаботПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	
	Если НЕ ТекДанные = Неопределено Тогда
		// >> [Деснол] [Ушаков А.Д.] [03.10.2019] 
		Если ТекДанные.РемонтнаяРабота = дс_ПолучитьПредставлениеКорневойРемонтнойРаботы() Тогда
		//Если ТекДанные.РемонтнаяРабота = "Ремонтные работы" Тогда
		// << [Деснол] [Ушаков А.Д.] [03.10.2019] 
			Элементы.ДеревоРемонтныхРаботКоличество.ТолькоПросмотр = Истина;
		Иначе
			Элементы.ДеревоРемонтныхРаботКоличество.ТолькоПросмотр = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьОтборПоИсполнителям();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРемонтныхРаботПриИзменении(Элемент)
	
	Если Объект.РемонтныеРаботы.Количество() > 1 Тогда 
		торо_ДанныеФормыДеревоКлиентСервер.УпорядочитьРемонтныеРаботы(ДеревоРемонтныхРабот, Объект.РемонтныеРаботы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРемонтныхРаботКоличествоПриИзменении(Элемент)
	
	ТекСтрока = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	Если ТекСтрока.Количество <= 0 Тогда
		ТекСтрока.Количество = 1;
	КонецЕсли;
	
	ID = ТекСтрока.ID;
	МассивСтрТЧ = Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("ID", ID));
	Если МассивСтрТЧ.Количество() Тогда
		СтрТЧ = МассивСтрТЧ[0];
		
			КоличествоБуфер = ?(СтрТЧ.Количество = 0, 1, СтрТЧ.Количество);
			Коэффициент = ТекСтрока.Количество / КоличествоБуфер;
			СтрТЧ.Количество = ТекСтрока.Количество;
			ПересчитатьКоличествоВПодчиненныхСтроках(ТекСтрока, Коэффициент);
			
	КонецЕсли;
	
КонецПроцедуры
	
&НаКлиенте
Процедура ДеревоРемонтныхРаботИсполнительПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.ДоговорБригада = Неопределено;
		УстановитьПараметрыВыбораДоговораБригады_ДляРемонтныхРабот(ТекущиеДанные.Исполнитель, ТекущиеДанные.РемонтыОборудования_ID);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРемонтныхРаботПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		УстановитьПараметрыВыбораИсполнителя_ДляРемонтныхРабот(ТекущиеДанные.РемонтыОборудования_ID);
		УстановитьПараметрыВыбораДоговораБригады_ДляРемонтныхРабот(ТекущиеДанные.Исполнитель, ТекущиеДанные.РемонтыОборудования_ID);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРемонтыОборудования
&НаКлиенте
Процедура РемонтыОборудованияПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.РемонтыОборудования.ТекущиеДанные;
	
	Если Не ТекущиеДанные = Неопределено Тогда
		ЗаполнитьДеревоРемонтныхРаботНаСервере(ТекущиеДанные.ID);
		Элементы.ДеревоРемонтныхРабот.Развернуть(ДеревоРемонтныхРабот.ПолучитьЭлементы()[0].ПолучитьИдентификатор(),Истина);
		УстановитьДоступностьДляРедактированияПоТекРемонту(ТекущиеДанные.БлокироватьДляИзменения);
		Найденный = МассивIDЛотов.НайтиПоЗначению(ТекущиеДанные.ID);
		Если Найденный <> Неопределено Тогда
			Элементы.ИсполнителиПоРемонтамЗаполнитьИзЛотов.Доступность = Истина;
		Иначе
			Элементы.ИсполнителиПоРемонтамЗаполнитьИзЛотов.Доступность = Ложь;
		КонецЕсли;
	Иначе
		ЗаполнитьДеревоРемонтныхРаботНаСервере();
	КонецЕсли;
	
	ЭлементыДереваРемРабот = ДеревоРемонтныхРабот.ПолучитьЭлементы();
	
	Для каждого Строка Из ЭлементыДереваРемРабот Цикл
		Элементы.ДеревоРемонтныхРабот.Развернуть(Строка.ПолучитьИдентификатор(),Истина);
	КонецЦикла; 
	
	Если ЗначениеЗаполнено(ИДВыбраннойСтроки) Тогда
		Идентификатор = Неопределено;
		ОбщегоНазначенияКлиентСервер.ПолучитьИдентификаторСтрокиДереваПоЗначениюПоля("ID", Идентификатор, ДеревоРемонтныхРабот.ПолучитьЭлементы(), ИДВыбраннойСтроки, Ложь);
		Если Идентификатор <> Неопределено Тогда
			Элементы.ДеревоРемонтныхРабот.ТекущаяСтрока = Идентификатор;
		КонецЕсли;
	КонецЕсли;		
	
	УстановитьОтборыСвязанныхТаблицРемонты();
	
КонецПроцедуры

&НаКлиенте
Процедура РемонтыОборудованияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
	ПодборРемонтов(Элементы.РемонтыОборудованияПодборРемонтов);
КонецПроцедуры

&НаКлиенте
Процедура РемонтыОборудованияПередНачаломИзменения(Элемент, Отказ)
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если Не ТекДанные = Неопределено И ТекДанные.БлокироватьДляИзменения Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РемонтыОборудованияПередУдалением(Элемент, Отказ)
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если Не ТекДанные = Неопределено И ТекДанные.БлокироватьДляИзменения Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Вопрос = НСтр("es='Los trabajos de reparación vinculados serán limpiados. ¿Continuar?';ru='Связанные ремонтные работы будут очищены. Продолжить?';en='Related repairs will be cleared. Continue?'");
	Если Не РемонтОборудованияУдаляется Тогда
		Отказ = Истина;
		ПоказатьВопрос(Новый ОписаниеОповещения("РемонтыОборудованияПередУдалениемЗавершение", ЭтотОбъект,Новый Структура("Элемент",Элемент)),
						Вопрос,РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РемонтыОборудованияПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекДанные = Элементы.РемонтыОборудования.ТекущиеДанные;
	
	Если Не ТекДанные = Неопределено Тогда
		Если ФОИспользоватьГарантии Тогда
			
			ТекДанные.ГарантийныйРемонт = торо_ГарантийноеОбслуживание.ПолучитьЗначениеФлагаГарантийныйРемонтДляОбъектаРемонта(ТекДанные.ОбъектРемонта, ТекДанные.ДатаНачала, ТекДанные.ДатаОкончания);
			
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура РемонтыОборудованияОбъектРемонтаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры


&НаКлиенте
Процедура РемонтыОборудованияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Если Поле.Имя = "РемонтыОборудованияВРамкахОстановочного" И ЗначениеЗаполнено(ТекДанные.ВРамкахОстановочного) Тогда
			ОткрытьФорму("Документ.торо_ОстановочныеРемонты.ФормаОбъекта", Новый Структура("Ключ, ID", ТекДанные.ВРамкахОстановочного, ТекДанные.ID), ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИсполнителиПоРемонтам

&НаКлиенте
Процедура ИсполнителиПоРемонтамПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Элементы.РемонтыОборудования.ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиПоРемонтамПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И НЕ Копирование Тогда
		ТекущиеДанные = Элемент.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			СтрокаРемонта = Элементы.РемонтыОборудования.ТекущиеДанные;
			Если СтрокаРемонта <> Неопределено Тогда
				ТекущиеДанные.ДатаНачала = СтрокаРемонта.ДатаНачала;
				ТекущиеДанные.ДатаОкончания = СтрокаРемонта.ДатаОкончания;
				ТекущиеДанные.РемонтыОборудования_ID = СтрокаРемонта.ID;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиПоРемонтамИсполнительОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ИсполнителиПоРемонтам.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Исполнитель) ИЛИ ТекущиеДанные.Исполнитель = ВыбранноеЗначение Тогда
		Возврат;
	КонецЕсли; 	
	
	МассивСтрокДереваРР = НайтиРемонтныеРаботыДляОчисткиИсполнителей(ТекущиеДанные.РемонтыОборудования_ID, ТекущиеДанные.ПолучитьИдентификатор());
	
	Если МассивСтрокДереваРР.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		
		ШаблонВопроса = НСтр("es='El ejecutor %1 es indicado para el trabajo de reparación. Con el cambio el ejecutor dado será limpiado en el árbol de los trabajos de reparación. ¿Continuar?';ru='Исполнитель %1 указан для ремонтной работы. При изменении данный исполнитель будет очищен в дереве ремонтных работ. Продолжить?';en='Executor %1 is listed for repair work. When changing, this contractor will be cleared in the repair tree. Continue?'");
		ТекстВопроса = СтрШаблон(ШаблонВопроса, ТекущиеДанные.Исполнитель);
		
		ДополнительныеПараметры = Новый Структура("ТекущиеДанные, ИсполнительНовый, МассивСтрокДереваРР", ТекущиеДанные, ВыбранноеЗначение, МассивСтрокДереваРР);
		ОписаниеОповещения = Новый ОписаниеОповещения("ИсполнителиПоРемонтамИсполнительОбработкаВыбораПослеВопроса", ЭтотОбъект, ДополнительныеПараметры);
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиПоРемонтамИсполнительОбработкаВыбораПослеВопроса(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
		ИсполнительНовый = ДополнительныеПараметры.ИсполнительНовый;
		МассивСтрокДереваРР = ДополнительныеПараметры.МассивСтрокДереваРР;
		МассивСтрокРРОтбор = Новый Структура("РемонтыОборудования_ID, Исполнитель", ТекущиеДанные.РемонтыОборудования_ID, ТекущиеДанные.Исполнитель);
		МассивСтрокРР = Объект.РемонтныеРаботы.НайтиСтроки(МассивСтрокРРОтбор);
		
		Для каждого Строка из МассивСтрокРР Цикл
			Строка.Исполнитель = Неопределено;
			Строка.ДоговорБригада = Неопределено;
		КонецЦикла;
		
		Для каждого Строка из МассивСтрокДереваРР Цикл
			Строка.Исполнитель = Неопределено;
			Строка.ДоговорБригада = Неопределено;
		КонецЦикла;
		
		ТекущиеДанные.Исполнитель = ИсполнительНовый;
		ИсполнителиПоРемонтамИсполнительПриИзменении(Элементы.ИсполнителиПоРемонтам);
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиПоРемонтамИсполнительОчистка(Элемент, СтандартнаяОбработка)
	
	ИсполнителиПоРемонтамИсполнительОбработкаВыбора(Элемент, Неопределено, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиПоРемонтамИсполнительОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Текст) Тогда
		// Если сделать так, то вызывается событие ОбработкаВыбора, в противном случае - не вызывается. 
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиПоРемонтамИсполнительПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ИсполнителиПоРемонтам.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.УточнениеИсполнителя = Неопределено;
		УстановитьПараметрыВыбораДоговораБригады(ТекущиеДанные.Исполнитель, Элементы.ИсполнителиПоРемонтамУточнениеИсполнителя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиПоРемонтамПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ИсполнителиПоРемонтам.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		УстановитьПараметрыВыбораДоговораБригады(ТекущиеДанные.Исполнитель, Элементы.ИсполнителиПоРемонтамУточнениеИсполнителя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиПоРемонтамПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ИсполнителиПоРемонтам.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Исполнитель) Тогда
		Возврат;
	КонецЕсли; 	
	
	МассивСтрокДереваРР = НайтиРемонтныеРаботыДляОчисткиИсполнителей(ТекущиеДанные.РемонтыОборудования_ID, ТекущиеДанные.ПолучитьИдентификатор());
	
	Если МассивСтрокДереваРР.Количество() > 0 Тогда
		Отказ = Истина;
		
		ШаблонВопроса = НСтр("es='El ejecutor %1 es indicado para el trabajo de reparación. Con el cambio el ejecutor dado será limpiado en el árbol de los trabajos de reparación. ¿Continuar?';ru='Исполнитель %1 указан для ремонтной работы. При изменении данный исполнитель будет очищен в дереве ремонтных работ. Продолжить?';en='Executor %1 is listed for repair work. When changing, this contractor will be cleared in the repair tree. Continue?'");
		ТекстВопроса = СтрШаблон(ШаблонВопроса, ТекущиеДанные.Исполнитель);
		
		ДополнительныеПараметры = Новый Структура("ТекущиеДанные, МассивСтрокДереваРР", ТекущиеДанные, МассивСтрокДереваРР);
		ОписаниеОповещения = Новый ОписаниеОповещения("ИсполнителиПоРемонтамПередУдалениемПослеВопроса", ЭтотОбъект, ДополнительныеПараметры);
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиПоРемонтамПередУдалениемПослеВопроса(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
		МассивСтрокДереваРР = ДополнительныеПараметры.МассивСтрокДереваРР;
		МассивСтрокРРОтбор = Новый Структура("РемонтыОборудования_ID, Исполнитель", ТекущиеДанные.РемонтыОборудования_ID, ТекущиеДанные.Исполнитель);
		МассивСтрокРР = Объект.РемонтныеРаботы.НайтиСтроки(МассивСтрокРРОтбор);
		
		Для каждого Строка из МассивСтрокРР Цикл
			Строка.Исполнитель = Неопределено;
			Строка.ДоговорБригада = Неопределено;
		КонецЦикла;
		
		Для каждого Строка из МассивСтрокДереваРР Цикл
			Строка.Исполнитель = Неопределено;
			Строка.ДоговорБригада = Неопределено;
		КонецЦикла;
		
		Модифицированность = Истина;
		Объект.ИсполнителиПоРемонтам.Удалить(ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиПоРемонтамУточнениеИсполнителяОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ИсполнителиПоРемонтам.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.УточнениеИсполнителя) ИЛИ ТекущиеДанные.УточнениеИсполнителя = ВыбранноеЗначение Тогда
		Возврат;
	КонецЕсли; 	
	
	МассивСтрокДереваРР = НайтиРемонтныеРаботыДляОчисткиДоговораБригады(ТекущиеДанные.РемонтыОборудования_ID, ТекущиеДанные.ПолучитьИдентификатор());
	
	Если МассивСтрокДереваРР.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		
		ШаблонВопроса = НСтр("es='El contracto/brigada %1 es indicado para el trabajo de reparación. Con el cambio el contracto/brigada dado será limpiado en el árbol de los trabajos de reparación. ¿Continuar?';ru='Договор/бригада %1 указан для ремонтной работы. При изменении данный договор/бригада будет очищен в дереве ремонтных работ. Продолжить?';en='Contract / brigade %1 is indicated for repair work. Upon amendment, this contract / brigade will be cleared in the repair tree. Continue?'");
		ТекстВопроса = СтрШаблон(ШаблонВопроса, ТекущиеДанные.УточнениеИсполнителя);
		
		ДополнительныеПараметры = Новый Структура("ТекущиеДанные, ИсполнительНовый, МассивСтрокДереваРР", ТекущиеДанные, ВыбранноеЗначение, МассивСтрокДереваРР);
		ОписаниеОповещения = Новый ОписаниеОповещения("ИсполнителиПоРемонтамУточнениеИсполнителяОбработкаВыбораПослеВопроса", ЭтотОбъект, ДополнительныеПараметры);
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиПоРемонтамУточнениеИсполнителяОбработкаВыбораПослеВопроса(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
		ИсполнительНовый = ДополнительныеПараметры.ИсполнительНовый;
		МассивСтрокДереваРР = ДополнительныеПараметры.МассивСтрокДереваРР;
		МассивСтрокРРОтбор = Новый Структура("РемонтыОборудования_ID, ДоговорБригада", ТекущиеДанные.РемонтыОборудования_ID, ТекущиеДанные.УточнениеИсполнителя);
		МассивСтрокРР = Объект.РемонтныеРаботы.НайтиСтроки(МассивСтрокРРОтбор);
		
		Для каждого Строка из МассивСтрокРР Цикл
			Строка.ДоговорБригада = Неопределено;
		КонецЦикла;
		
		Для каждого Строка из МассивСтрокДереваРР Цикл
			Строка.ДоговорБригада = Неопределено;
		КонецЦикла;
		
		Модифицированность = Истина;
		ТекущиеДанные.УточнениеИсполнителя = ИсполнительНовый;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиПоРемонтамУточнениеИсполнителяОчистка(Элемент, СтандартнаяОбработка)
	
	ИсполнителиПоРемонтамУточнениеИсполнителяОбработкаВыбора(Элемент, Неопределено, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиПоРемонтамУточнениеИсполнителяОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Текст) Тогда
		// Если сделать так, то вызывается событие ОбработкаВыбора, в противном случае - не вызывается. 
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИсполнители

&НаКлиенте
Процедура ИсполнителиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ТекСтрокаДереваРемонтныхРабот = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	
	ТекстПредупреждения = НСтр("es='¡Se puede indicar a los ejecutores de los trabajos de reparación solamente para las operaciones tecnológicas!';ru='Исполнителей ремонтных работ можно указывать только для технологических операций!';en='Executors of repair work can be specified only for technological operations!'");
	ПроверкаТипаВСтрокеДереваРемонтныхРабот(ТекСтрокаДереваРемонтныхРабот, Тип("СправочникСсылка.торо_ТехнологическиеОперации"), ТекстПредупреждения, Отказ);
	
	Если НЕ Отказ И НЕ Копирование Тогда
		Отказ = Истина;
		СтрокаРемонта = Элементы.РемонтыОборудования.ТекущиеДанные;
		НС = Объект.Исполнители.Добавить();
		НС.РемонтыОборудования_ID = СтрокаРемонта.ID;
		НС.ID = ТекСтрокаДереваРемонтныхРабот.ID;
		НС.ДатаНачала = СтрокаРемонта.ДатаНачала;
		НС.ДатаОкончания = СтрокаРемонта.ДатаОкончания;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если Не ОтменаРедактирования Тогда 
		
		Если НоваяСтрока Тогда
			ТекСтрокаДереваРемонтныхРабот = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
			Если НЕ Элемент.ТекущиеДанные = Неопределено Тогда 
				Элемент.ТекущиеДанные.ID = ТекСтрокаДереваРемонтныхРабот.ID;
				Элемент.ТекущиеДанные.РемонтыОборудования_ID = ТекСтрокаДереваРемонтныхРабот.РемонтыОборудования_ID;
				
			КонецЕсли;
		КонецЕсли;
		
		ТЧ = Объект.РемонтыОборудования;
		ДатаНачалаРемонта = торо_ЗаполнениеДокументов.ПолучитьДатуРемонтаПоID(ТЧ, Элементы.ДеревоРемонтныхРабот.ТекущиеДанные.РемонтыОборудования_ID);
		торо_ЗаполнениеДокументов.ВыполнитьАвтоподставлениеСотрудникаИКвалификации(Элемент.ТекущиеДанные.Сотрудник, Элемент.ТекущиеДанные.Квалификация, ДатаНачалаРемонта);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиПослеУдаления(Элемент)
	
	ТекСтрДереваРемонтов = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	ТекСтрРемонтовОборудования = Элементы.РемонтыОборудования.ТекущиеДанные;
	
	// >> [Деснол] [Ушаков А.Д.] [03.10.2019] 
	Если ТекСтрДереваРемонтов <> Неопределено И ТекСтрДереваРемонтов.РемонтнаяРабота <> дс_ПолучитьПредставлениеКорневойРемонтнойРаботы() Тогда
	//Если ТекСтрДереваРемонтов <> Неопределено И ТекСтрДереваРемонтов.РемонтнаяРабота <> "Ремонтные работы" Тогда
	// << [Деснол] [Ушаков А.Д.] [03.10.2019] 
		МассивСтрок = Объект.Исполнители.НайтиСтроки(Новый Структура("ID, РемонтыОборудования_ID", ТекСтрДереваРемонтов.ID, ТекСтрДереваРемонтов.РемонтыОборудования_ID));
		
		Если МассивСтрок.Количество() > 0 Тогда
			Элементы.Исполнители.ТекущаяСтрока = МассивСтрок[0].ПолучитьИдентификатор();
		КонецЕсли;
		
	ИначеЕсли ТекСтрРемонтовОборудования <> Неопределено Тогда 
		МассивСтрок = Объект.Исполнители.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", ТекСтрРемонтовОборудования.ID));
		Если МассивСтрок.Количество() > 0 Тогда 
			Элементы.Исполнители.ТекущаяСтрока = МассивСтрок[0].ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ЗаполнитьИсполнителей(ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиСотрудникОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ТЧ = Объект.РемонтыОборудования;
	ДатаНачалаРемонта = торо_ЗаполнениеДокументов.ПолучитьДатуРемонтаПоID(ТЧ, Элементы.ДеревоРемонтныхРабот.ТекущиеДанные.РемонтыОборудования_ID);
	торо_ЗаполнениеДокументовКлиент.СформироватьСписокАвтоподбораСотрудниковСКвалификацией(Элементы.Исполнители.ТекущиеДанные.Квалификация, ДатаНачалаРемонта, Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиКвалификацияОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ТЧ = Объект.РемонтыОборудования;
	ДатаНачалаРемонта = торо_ЗаполнениеДокументов.ПолучитьДатуРемонтаПоID(ТЧ, Элементы.ДеревоРемонтныхРабот.ТекущиеДанные.РемонтыОборудования_ID);
	торо_ЗаполнениеДокументовКлиент.СформироватьСписокАвтоподбораКвалификацийСотрудника(Элементы.Исполнители.ТекущиеДанные.Сотрудник, ДатаНачалаРемонта, Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиСотрудникАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ТЧ = Объект.РемонтыОборудования;
	ДатаНачалаРемонта = торо_ЗаполнениеДокументов.ПолучитьДатуРемонтаПоID(ТЧ, Элементы.ДеревоРемонтныхРабот.ТекущиеДанные.РемонтыОборудования_ID);
	торо_ЗаполнениеДокументовКлиент.СформироватьСписокАвтоподбораСотрудниковСКвалификацией(Элементы.Исполнители.ТекущиеДанные.Квалификация, ДатаНачалаРемонта, Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиСотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТЧ = Объект.РемонтыОборудования;
	ДатаНачалаРемонта = торо_ЗаполнениеДокументов.ПолучитьДатуРемонтаПоID(ТЧ, Элементы.ДеревоРемонтныхРабот.ТекущиеДанные.РемонтыОборудования_ID);
	торо_ЗаполнениеДокументовКлиент.СформироватьСписокВыбораСотрудниковСКвалификацией(Элемент, ЭтотОбъект, Элементы.Исполнители.ТекущиеДанные.Квалификация, ДатаНачалаРемонта, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиКвалификацияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ТЧ = Объект.РемонтыОборудования;
	ДатаНачалаРемонта = торо_ЗаполнениеДокументов.ПолучитьДатуРемонтаПоID(ТЧ, Элементы.ДеревоРемонтныхРабот.ТекущиеДанные.РемонтыОборудования_ID);
	торо_ЗаполнениеДокументовКлиент.СформироватьСписокАвтоподбораКвалификацийСотрудника(Элементы.Исполнители.ТекущиеДанные.Сотрудник, ДатаНачалаРемонта, Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиКвалификацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТЧ = Объект.РемонтыОборудования;
	ДатаНачалаРемонта = торо_ЗаполнениеДокументов.ПолучитьДатуРемонтаПоID(ТЧ, Элементы.ДеревоРемонтныхРабот.ТекущиеДанные.РемонтыОборудования_ID);
	торо_ЗаполнениеДокументовКлиент.СформироватьСписокВыбораКвалификацийСотрудника(Элемент, ЭтотОбъект, Элементы.Исполнители.ТекущиеДанные.Сотрудник, ДатаНачалаРемонта, СтандартнаяОбработка);	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументыОснования

&НаКлиенте
Процедура ДокументыОснованияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	// Запись данных до редактирования
	торо_СобытияФормКлиент.ПриНачалеРедактирования(Элемент,СтруктураДанныхДоРедактирования,Элемент.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекДанные = Элементы.ДокументыОснования.ТекущиеДанные;
	Если Не ОтменаРедактирования Тогда
		Если НЕ ЗначениеЗаполнено(ТекДанные.ДокументОснование) Тогда
			ТекстСообщения = НСтр("es='¡Es necesario rellenar el documento-razón!';ru='Необходимо заполнить документ-основание!';en='Required to fill out a base document!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		Иначе
			МасСтр = Объект.ДокументыОснования.НайтиСтроки(Новый Структура("ДокументОснование", ТекДанные.ДокументОснование));
			Если МасСтр.Количество() > 1 Тогда
				ТекстСообщения = НСтр("es='¡El documento-razón dado es añadido ya!';ru='Данный документ-основание уже добавлен!';en='This base document has already been added!'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			Иначе
				СтарыйДокОснование = СтруктураДанныхДоРедактирования[Элемент.Имя].ДокументОснование;
				Если ЗначениеЗаполнено(СтарыйДокОснование) И СтарыйДокОснование <> ТекДанные.ДокументОснование Тогда
					Вопрос = НСтр("es='Los trabajos de reparación vinculados serán limpiados. ¿Continuar?';ru='Связанные ремонтные работы будут очищены. Продолжить?';en='Related repairs will be cleared. Continue?'");
					СтруктураПараметров = Новый Структура("Элемент, СтарыйДокОснование, НовыйДокОснование",Элемент, СтарыйДокОснование, ТекДанные.ДокументОснование);
					ПоказатьВопрос(Новый ОписаниеОповещения("ДокументыОснованияПередИзменениемЗавершение",ЭтаФорма,СтруктураПараметров),Вопрос,РежимДиалогаВопрос.ДаНет);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Не НоваяСтрока Тогда
		// возврат старых значений
		ЗаполнитьЗначенияСвойств(ТекДанные,СтруктураДанныхДоРедактирования[Элемент.Имя]);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияПередИзменениемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Элемент = ДополнительныеПараметры.Элемент;
	СтарыйДокОснование = ДополнительныеПараметры.СтарыйДокОснование;
	НовыйДокОснование = ДополнительныеПараметры.НовыйДокОснование;
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ОчиститьСвязанныеТабличныеЧасти(СтарыйДокОснование);
		Элемент.ТекущиеДанные.ДокументОснование = НовыйДокОснование;
	Иначе
		Элемент.ТекущиеДанные.ДокументОснование = СтарыйДокОснование;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияПередУдалением(Элемент, Отказ)   	
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		СтрокиВО = Объект.ЗакрываемыеПредписания.НайтиСтроки(Новый Структура("ДокументВнешнегоОснования", Элемент.ТекущиеДанные.ДокументОснование));
		Если СтрокиВО.Количество() <> 0 Тогда
			Для каждого СтрокаДокумента Из СтрокиВО Цикл
				Объект.ЗакрываемыеПредписания.Удалить(СтрокаДокумента);
			КонецЦикла; 
		Иначе
			Вопрос = НСтр("es='Los trabajos de reparación vinculados serán limpiados. ¿Continuar?';ru='Связанные ремонтные работы будут очищены. Продолжить?';en='Related repairs will be cleared. Continue?'");
			Отказ = Истина;
			ПоказатьВопрос(Новый ОписаниеОповещения("ДокументыОснованияПередУдалениемЗавершение",ЭтаФорма,Новый Структура("Элемент",Элемент)),Вопрос,РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
	КонецЕсли; 
	
	//Вопрос = НСтр("es='Los trabajos de reparación vinculados serán limpiados. ¿Continuar?';ru='Связанные ремонтные работы будут очищены. Продолжить?';en='Related repairs will be cleared. Continue?'");
	//Отказ = Истина;
	//ПоказатьВопрос(Новый ОписаниеОповещения("ДокументыОснованияПередУдалениемЗавершение",ЭтаФорма,Новый Структура("Элемент",Элемент)),Вопрос,РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры 

&НаКлиенте
Процедура ДокументыОснованияПередУдалениемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Элемент = ДополнительныеПараметры.Элемент;
	
	Если РезультатВопроса = КодВозвратаДиалога.Да И Элемент.ТекущиеДанные <> Неопределено Тогда
		ОчиститьСвязанныеТабличныеЧасти(Элемент.ТекущиеДанные.ДокументОснование);
		текСтрока = Объект.ДокументыОснования.НайтиПоИдентификатору(Элемент.ТекущаяСтрока);
		Объект.ДокументыОснования.Удалить(текСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияДокументОснованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущийДокументОснование = Элементы.ДокументыОснования.текущиеДанные.ДокументОснование;
	
	Если ТекущийДокументОснование = Неопределено Тогда
		СписокВыбора = торо_ЗаполнениеДокументов.СформироватьСписокВыбораТипаДокументаОснования(Объект.Ссылка);
		ОписаниеОповещения = Новый ОписаниеОповещения("ДокументыОснованияДокументОснованиеНачалоВыбораЗавершение",ЭтотОбъект, Новый Структура("Элемент", Элемент));
		СписокВыбора.ПоказатьВыборЭлемента(ОписаниеОповещения, НСтр("es='La elección del tipo de datos';ru='Выбор типа данных';en='Data type selection'"));
	Иначе
		торо_ЗаполнениеДокументовКлиент.ОткрытьФормуВыбораДокументаОснованияРемонтаСПараметрами(ТипЗнч(ТекущийДокументОснование), ТекущийДокументОснование, Элемент, ЭтаФорма.КлючУникальности);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияДокументОснованиеНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элемент = ДополнительныеПараметры.Элемент;
	торо_ЗаполнениеДокументовКлиент.ОткрытьФормуВыбораДокументаОснованияРемонтаСПараметрами(ВыбранныйЭлемент.Значение, Неопределено, Элемент, ЭтаФорма.КлючУникальности);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтветственные

&НаКлиенте
Процедура ОтветственныеПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекДанные = Элементы.Ответственные.ТекущиеДанные;
	
	Если Не (ОтменаРедактирования Или ТекДанные = Неопределено) тогда
	
		стрПоиска = Новый Структура("ОтветственноеЛицо");
		стрПоиска.ОтветственноеЛицо = ТекДанные.ОтветственноеЛицо;
		
		НайС = Объект.Ответственные.НайтиСтроки(стрПоиска);
		
		Если НайС.Количество() > 1 Тогда
			ТекстСообщения = НСтр("es='Este papel es añadido ya. Escojan otra.';ru='Эта роль уже добавлена. Выберите другую.';en='This role has already been added. Choose another.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти



#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ПодборОпераций(Команда)
	
	ТекущиеДанные = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("es='¡Indiquen la disposición de la reparación!';ru='Укажите расположение ремонта!';en='Specify  the location of the repair!'"), 10); 
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("es='¡La reparación no es posible incluir en la composición de la operación tecnológica!';ru='Ремонт нельзя включать в состав технологической операции!';en='Repair can not be included in the technological operation!'"), 10); 
		Возврат;
	КонецЕсли;
	
	ФормаВыбора = ПолучитьФорму("Справочник.торо_ТехнологическиеОперации.ФормаВыбора", Новый Структура("МножественныйВыбор", Истина), Элементы.ДеревоРемонтныхРабот);
	ФормаВыбора.ЗакрыватьПриВыборе = Ложь;
	ФормаВыбора.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТехКарту(Команда)
	
	ТекущиеДанные = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("es='¡Indiquen la disposición de la reparación!';ru='Укажите расположение ремонта!';en='Specify  the location of the repair!'"), 10); 
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("es='¡La reparación no es posible incluir en la composición de la operación tecnológica!';ru='Ремонт нельзя включать в состав технологической операции!';en='Repair can not be included in the technological operation!'"), 10); 
		Возврат;
	КонецЕсли;
	
	ФормаВыбора = ПолучитьФорму("Справочник.торо_ИдентификаторыТехКарт.ФормаВыбора", Новый Структура("ОтборПоСтатусам, МножественныйВыбор", ПредопределенноеЗначение("Перечисление.торо_СтатусыНормативныхРемонтовИТехКарт.Действует"), Истина), Элементы.ДеревоРемонтныхРабот);
	ФормаВыбора.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТехОперацию(Команда)
	
	ТекущиеДанные = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("es='¡Indiquen la disposición de la reparación!';ru='Укажите расположение ремонта!';en='Specify  the location of the repair!'"), 10); 
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("es='¡La reparación no es posible incluir en la composición de la operación tecnológica!';ru='Ремонт нельзя включать в состав технологической операции!';en='Repair can not be included in the technological operation!'"), 10); 
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.торо_ТехнологическиеОперации.ФормаВыбора", Новый Структура("МножественныйВыбор", Истина), Элементы.ДеревоРемонтныхРабот);		
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборРемонтов(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Владелец", Объект.Ссылка);
	ПараметрыФормы.Вставить("ВладелецДата", Объект.Дата);
	ПараметрыФормы.Вставить("Организация", Объект.Организация);
	ПараметрыФормы.Вставить("Подразделение", Объект.Подразделение);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	
	ДокументыОснования = Новый СписокЗначений;
	Для Каждого СтрокаДО Из Объект.ДокументыОснования Цикл
		ДокументыОснования.Добавить(СтрокаДО.ДокументОснование);
	КонецЦикла;
	
	ПараметрыФормы.Вставить("ДокументыОснования", ДокументыОснования);
	
	ОткрытьФорму("Обработка.торо_ПодборРемонтныхРаботОборудования.Форма.ПодборРемонтовОборудованияИРемонтныхРабот",
		ПараметрыФормы, ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборПредписаний(Команда)
	
	ФормаПодбора = ПолучитьФорму("Обработка.торо_ПодборРемонтныхРаботОборудования.Форма.ФормаПодбораПредписаний",
	Новый Структура("Владелец", Объект.Ссылка), ЭтаФорма, Объект.Ссылка, ВариантОткрытияОкна.ОтдельноеОкно);
	
	ФормаПодбора.Объект.ДокументыОснования.Очистить();
	
	Для Каждого СтрокаДО Из Объект.ДокументыОснования Цикл
		Если ТипЗнч(СтрокаДО.ДокументОснование) = Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот") Тогда
			ФормаПодбора.Объект.ДокументыОснования.Добавить().ДокументОснование = СтрокаДО.ДокументОснование;
		КонецЕсли;
	КонецЦикла;
	
	ФормаПодбора.ЗакрыватьПриВыборе = Ложь;
	
	ФормаПодбора.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура УтвердитьСтатус(Команда)

	торо_РаботаССогласованиямиКлиент.УстановитьСтатус(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПодборПоБригадамДляДокумента(Команда)
	
	стрПараметров = Новый Структура;
	стрПараметров.Вставить("Подразделение", Объект.Подразделение);
	стрПараметров.Вставить("НеобходимыеКвалификации", Объект.Исполнители);
	стрПараметров.Вставить("ВидПодбора", "ПоДокументу");
	стрПараметров.Вставить("ID", Неопределено);
	стрПараметров.Вставить("РемонтыОборудования_ID", Неопределено);
	
	ОткрытьФорму("ОбщаяФорма.торо_ФормаПодбораИсполнителей", стрПараметров, Элементы.Исполнители,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборПоБригадамДляОперации(Команда)
	
	ТекСтрокаДереваРемонтов = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	ТекСтрокаРемонтовОборудования = Элементы.РемонтыОборудования.ТекущиеДанные;
	
	Если ТекСтрокаДереваРемонтов = Неопределено тогда
		ID_Отбора = Неопределено;
	Иначе
		МасИД = Новый Массив;
		ID_Отбора = Новый Массив;
		торо_РаботаССогласованиямиКлиентСервер.ЗаполнитьМассивИзДерева(МасИД, ТекСтрокаДереваРемонтов.ПолучитьЭлементы());
		ID_Отбора.Добавить(ТекСтрокаДереваРемонтов.ID);
		
		Для каждого текСтрока из МасИД цикл
			ID_Отбора.Добавить(текСтрока.ID);
		КонецЦикла;
	КонецЕсли;
	
	ID_ОтбораРемонтов = ?(ТекСтрокаРемонтовОборудования = Неопределено, Неопределено, ТекСтрокаРемонтовОборудования.ID);
	
	стрПараметров = Новый Структура;
	стрПараметров.Вставить("Подразделение", Объект.Подразделение);
	стрПараметров.Вставить("НеобходимыеКвалификации", Объект.Исполнители);
	стрПараметров.Вставить("ВидПодбора", "ПоОперации");
	стрПараметров.Вставить("ID", ID_Отбора);
	стрПараметров.Вставить("РемонтыОборудования_ID", ID_ОтбораРемонтов);
	
	ОткрытьФорму("ОбщаяФорма.торо_ФормаПодбораИсполнителей", стрПараметров, Элементы.Исполнители,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьИсполнителейПоНормам_ТекущаяОперация(Команда)
	
	ТекущийРемонт = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если ТекущийРемонт = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("es='la reparación.';ru='Не выбран ремонт.';en='No repair selected.'"));
		Возврат;
	КонецЕсли;
	
	ТекущаяОперация = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	Если ТекущаяОперация = Неопределено 
		ИЛИ ТипЗнч(ТекущаяОперация.РемонтнаяРабота) = Тип("Строка") Тогда
		ПоказатьПредупреждение(, НСтр("es='el trabajo de reparación.';ru='Не выбрана ремонтная работа.';en='No repair work selected.'"));
		Возврат;
	КонецЕсли;
	
	МасивОперацийДляОтбора = Новый Массив;
	МасивОперацийДляОтбора.Добавить(ТекущаяОперация);
	торо_РаботаССогласованиямиКлиентСервер.ЗаполнитьМассивИзДерева(МасивОперацийДляОтбора, ТекущаяОперация.ПолучитьЭлементы());
	
	МасивIDДляОтбора = Новый Массив;
	Для каждого СтрокаОперации из МасивОперацийДляОтбора Цикл
		МасивIDДляОтбора.Добавить(СтрокаОперации.ID);
	КонецЦикла;
	
   МассивСтрокДляУдаления = Новый Массив;
	Для каждого Строка из Объект.Исполнители Цикл
		Если Строка.РемонтыОборудования_ID = ТекущийРемонт.ID 
			И МасивIDДляОтбора.Найти(Строка.ID) <> Неопределено Тогда
			МассивСтрокДляУдаления.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивСтрокДляУдаления.Количество() > 0 Тогда
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("МассивСтрокДляУдаления", МассивСтрокДляУдаления);
		ДопПараметры.Вставить("ИДТекущейОперации", ТекущаяОперация.ПолучитьИдентификатор());
		ДопПараметры.Вставить("ИДТекущегоРемонта", ТекущийРемонт.ПолучитьИдентификатор());
		
		ТекстВопроса = НСтр("es='""Los Ejecutores,"" dados en la tabla, serán regrabados. ¿Continuar?';ru='Данные в таблице ""Исполнители"" будут перезаписаны. Продолжить?';en='The data in the table ""Performers"" will be overwritten. Continue?'");
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьИсполнителейПоНормам_ПослеВопроса", ЭтаФорма, ДопПараметры); 
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьИсполнителейПоНормамНаСервере(ТекущаяОперация.ПолучитьИдентификатор(), ТекущийРемонт.ПолучитьИдентификатор());
	КонецЕсли;
				
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИсполнителейПоНормам_ВсеОперации(Команда)
	
	ТекущийРемонт = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если ТекущийРемонт = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("es='la reparación.';ru='Не выбран ремонт.';en='No repair selected.'"));
		Возврат;
	КонецЕсли;
	
	МассивСтрокДляУдаления = Объект.Исполнители.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", ТекущийРемонт.ID));
	Если МассивСтрокДляУдаления.Количество() > 0 Тогда
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("МассивСтрокДляУдаления", МассивСтрокДляУдаления);
		ДопПараметры.Вставить("ИДТекущейОперации", Неопределено);
		ДопПараметры.Вставить("ИДТекущегоРемонта", ТекущийРемонт.ПолучитьИдентификатор());
		
		ТекстВопроса = НСтр("es='""Los Ejecutores,"" dados en la tabla, serán regrabados. ¿Continuar?';ru='Данные в таблице ""Исполнители"" будут перезаписаны. Продолжить?';en='The data in the table ""Performers"" will be overwritten. Continue?'");
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьИсполнителейПоНормам_ПослеВопроса", ЭтаФорма, ДопПараметры); 
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьИсполнителейПоНормамНаСервере(Неопределено, ТекущийРемонт.ПолучитьИдентификатор());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИсполнителейПоНормам_ВсеРемонты(Команда)
	
	Если Объект.Исполнители.Количество() > 0 Тогда
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("МассивСтрокДляУдаления", Объект.Исполнители);
		ДопПараметры.Вставить("ИДТекущейОперации", Неопределено);
		ДопПараметры.Вставить("ИДТекущегоРемонта", Неопределено);
		
		ТекстВопроса = НСтр("es='""Los Ejecutores,"" dados en la tabla, serán regrabados. ¿Continuar?';ru='Данные в таблице ""Исполнители"" будут перезаписаны. Продолжить?';en='The data in the table ""Performers"" will be overwritten. Continue?'");
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьИсполнителейПоНормам_ПослеВопроса", ЭтаФорма, ДопПараметры); 
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьИсполнителейПоНормамНаСервере(Неопределено, Неопределено);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИсполнителейПоНормам_ПослеВопроса(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		Если ТипЗнч(ДополнительныеПараметры.МассивСтрокДляУдаления) = Тип("Массив") Тогда
			Для каждого СтрокаДляУдаления из ДополнительныеПараметры.МассивСтрокДляУдаления Цикл
				Объект.Исполнители.Удалить(СтрокаДляУдаления);
			КонецЦикла;
		Иначе
			Объект.Исполнители.Очистить();
		КонецЕсли;
		ЗаполнитьИсполнителейПоНормамНаСервере(ДополнительныеПараметры.ИДТекущейОперации, ДополнительныеПараметры.ИДТекущегоРемонта);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИсполнителейПоНормамНаСервере(ИДТекущейОперации, ИДТекущегоРемонта)
	
	торо_Ремонты.ЗаполнитьИсполнителейПоНормам(ЭтаФорма, ИДТекущейОперации, ИДТекущегоРемонта, "Исполнители");
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьИсполнителейПоОснованию_ТекущаяОперация(Команда)
	
	ТекущийРемонт = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если ТекущийРемонт = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("es='la reparación.';ru='Не выбран ремонт.';en='No repair selected.'"));
		Возврат;
	КонецЕсли;
	
	ТекущаяОперация = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	Если ТекущаяОперация = Неопределено 
		ИЛИ ТипЗнч(ТекущаяОперация.РемонтнаяРабота) = Тип("Строка") Тогда
		ПоказатьПредупреждение(, НСтр("es='el trabajo de reparación.';ru='Не выбрана ремонтная работа.';en='No repair work selected.'"));
		Возврат;
	КонецЕсли;
	
	МасивОперацийДляОтбора = Новый Массив;
	МасивОперацийДляОтбора.Добавить(ТекущаяОперация);
	торо_РаботаССогласованиямиКлиентСервер.ЗаполнитьМассивИзДерева(МасивОперацийДляОтбора, ТекущаяОперация.ПолучитьЭлементы());
	
	МасивIDДляОтбора = Новый Массив;
	Для каждого СтрокаОперации из МасивОперацийДляОтбора Цикл
		МасивIDДляОтбора.Добавить(СтрокаОперации.ID);
	КонецЦикла;
	
	МассивСтрокДляУдаленияИсполнители = Новый Массив;
	Для каждого Строка из Объект.Исполнители Цикл
		Если Строка.РемонтыОборудования_ID = ТекущийРемонт.ID 
			И МасивIDДляОтбора.Найти(Строка.ID) <> Неопределено Тогда
			МассивСтрокДляУдаленияИсполнители.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;

	
	Если МассивСтрокДляУдаленияИсполнители.Количество() > 0 Тогда
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("МассивСтрокДляУдаленияПодрядчики", Новый Массив);
		ДопПараметры.Вставить("МассивСтрокДляУдаленияИсполнители", МассивСтрокДляУдаленияИсполнители);
		ДопПараметры.Вставить("ИДТекущейОперации", ТекущаяОперация.ПолучитьИдентификатор());
		ДопПараметры.Вставить("ИДТекущегоРемонта", ТекущийРемонт.ПолучитьИдентификатор());
		
		ТекстВопроса = НСтр("es='""Los Ejecutores,"" dados en la tabla, serán regrabados. ¿Continuar?';ru='Данные в таблице ""Исполнители"" будут перезаписаны. Продолжить?';en='The data in the table ""Performers"" will be overwritten. Continue?'");
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьИсполнителейПоОснованию_ПослеВопроса", ЭтаФорма, ДопПараметры); 
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьИсполнителейПоОснованиюНаСервере(ТекущаяОперация.ПолучитьИдентификатор(), ТекущийРемонт.ПолучитьИдентификатор());
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИсполнителейПоОснованию_ВсеОперации(Команда)
	
	ТекущийРемонт = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если ТекущийРемонт = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("es='la reparación.';ru='Не выбран ремонт.';en='No repair selected.'"));
		Возврат;
	КонецЕсли;
	
	МассивСтрокДляУдаленияПодрядчики = Объект.ИсполнителиПоРемонтам.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", ТекущийРемонт.ID));
	МассивСтрокДляУдаленияИсполнители = Объект.Исполнители.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", ТекущийРемонт.ID));
	
	Если МассивСтрокДляУдаленияПодрядчики.Количество() > 0 
		ИЛИ МассивСтрокДляУдаленияИсполнители.Количество() > 0 Тогда
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("МассивСтрокДляУдаленияПодрядчики", МассивСтрокДляУдаленияПодрядчики);
		ДопПараметры.Вставить("МассивСтрокДляУдаленияИсполнители", МассивСтрокДляУдаленияИсполнители);
		ДопПараметры.Вставить("ИДТекущейОперации", Неопределено);
		ДопПараметры.Вставить("ИДТекущегоРемонта", ТекущийРемонт.ПолучитьИдентификатор());
		
		ТекстВопроса = НСтр("es='""Los Ejecutores,"" dados en la tabla, serán regrabados. ¿Continuar?';ru='Данные в таблице ""Исполнители"" будут перезаписаны. Продолжить?';en='The data in the table ""Performers"" will be overwritten. Continue?'");
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьИсполнителейПоОснованию_ПослеВопроса", ЭтаФорма, ДопПараметры); 
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьИсполнителейПоОснованиюНаСервере(Неопределено, ТекущийРемонт.ПолучитьИдентификатор());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИсполнителейПоОснованию_ВсеРемонты(Команда)
	
	Если Объект.ИсполнителиПоРемонтам.Количество() > 0 
		ИЛИ Объект.Исполнители.Количество() > 0 Тогда
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("МассивСтрокДляУдаленияПодрядчики", Объект.ИсполнителиПоРемонтам);
		ДопПараметры.Вставить("МассивСтрокДляУдаленияИсполнители", Объект.Исполнители);
		ДопПараметры.Вставить("ИДТекущейОперации", Неопределено);
		ДопПараметры.Вставить("ИДТекущегоРемонта", Неопределено);
		
		ТекстВопроса = НСтр("es='""Los Ejecutores,"" dados en la tabla, serán regrabados. ¿Continuar?';ru='Данные в таблице ""Исполнители"" будут перезаписаны. Продолжить?';en='The data in the table ""Performers"" will be overwritten. Continue?'");
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьИсполнителейПоОснованию_ПослеВопроса", ЭтаФорма, ДопПараметры); 
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьИсполнителейПоОснованиюНаСервере(Неопределено, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИсполнителейПоОснованию_ПослеВопроса(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		Если ТипЗнч(ДополнительныеПараметры.МассивСтрокДляУдаленияПодрядчики) = Тип("Массив") Тогда
			Для каждого СтрокаДляУдаления из ДополнительныеПараметры.МассивСтрокДляУдаленияПодрядчики Цикл
				Объект.ИсполнителиПоРемонтам.Удалить(СтрокаДляУдаления);
			КонецЦикла;
		Иначе
			Объект.ИсполнителиПоРемонтам.Очистить();
		КонецЕсли;
		
		Если ТипЗнч(ДополнительныеПараметры.МассивСтрокДляУдаленияИсполнители) = Тип("Массив") Тогда
			Для каждого СтрокаДляУдаления из ДополнительныеПараметры.МассивСтрокДляУдаленияИсполнители Цикл
				Объект.Исполнители.Удалить(СтрокаДляУдаления);
			КонецЦикла;
		Иначе
			Объект.Исполнители.Очистить();
		КонецЕсли;
		
		ЗаполнитьИсполнителейПоОснованиюНаСервере(ДополнительныеПараметры.ИДТекущейОперации, ДополнительныеПараметры.ИДТекущегоРемонта);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИсполнителейПоОснованиюНаСервере(ИДТекущейОперации, ИДТекущегоРемонта)
	
	торо_Ремонты.ЗаполнитьИсполнителейПоОснованию(ЭтаФорма, ИДТекущейОперации, ИДТекущегоРемонта);
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаСервере
Процедура УстановитьУсловноеОформление()

	// Доступость вида ремонта для редактирования.
	// Доступен если ЭтоПервыйДокументВЦепочке ИЛИ (ЭтоПоследнийДокументВЦепочке И (Докуммент-основание = ВО или ВД)).
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РемонтыОборудованияВидРемонтныхРабот.Имя);

	ГруппаНЕ = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаНЕ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаНе;

	ГруппаЭлементов = ГруппаНЕ.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементов.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	//
	ОтборЭлемента = ГруппаЭлементов.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЭтоПервыйДокументВЦепочке");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	//// ИЛИ (	
	ГруппаЭлементовВложенная = ГруппаЭлементов.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовВложенная.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаЭлементовВложенная.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.РемонтыОборудования.ТипДокументаОснования");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "торо_ВнешнееОснованиеДляРабот";
	///( И	
	ОтборЭлемента = ГруппаЭлементовВложенная.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЭтоПоследнийДокументВЦепочке");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	 //) ИЛИ
	 
	ГруппаЭлементовВложенная = ГруппаЭлементов.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовВложенная.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаЭлементовВложенная.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.РемонтыОборудования.ТипДокументаОснования");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "торо_ВыявленныеДефекты";
	///( И	
	ОтборЭлемента = ГруппаЭлементовВложенная.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЭтоПоследнийДокументВЦепочке");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	//

	
	// ТолькоПросмотр корня дерева ремонтных работ 
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоРемонтныхРаботРемонтнаяРабота.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоРемонтныхРабот.РемонтнаяРабота");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	// >> [Деснол] [Ушаков А.Д.] [03.10.2019] 
	ОтборЭлемента.ПравоеЗначение = дс_ПолучитьПредставлениеКорневойРемонтнойРаботы();
	//ОтборЭлемента.ПравоеЗначение = "Ремонтные работы";
	// << [Деснол] [Ушаков А.Д.] [03.10.2019] 

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоРемонтныхРаботИсполнитель.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоРемонтныхРаботДоговорБригада.Имя);
	                  
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоРемонтныхРабот.ЭтоТехКарта");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Представление = "ДоступностьИсполнителяДляТехОперации";
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр",Истина);
	Элемент.Использование = Истина;

КонецПроцедуры

&НаСервере
Процедура ОбновитьОстановочные(IDРемонта = Неопределено)
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	торо_ОстановочныеРемонтыСрезПоследних.IDЗависимого КАК ID,
	               |	торо_ОстановочныеРемонтыСрезПоследних.Регистратор
	               |ИЗ
	               |	РегистрСведений.торо_ОстановочныеРемонты.СрезПоследних(, IDЗависимого В (&ID)) КАК торо_ОстановочныеРемонтыСрезПоследних
	               |ГДЕ
	               |	НЕ торо_ОстановочныеРемонтыСрезПоследних.Отвязан";
	Запрос = Новый Запрос(ТекстЗапроса);
	Если IDРемонта = Неопределено Тогда
		Запрос.УстановитьПараметр("ID", Объект.РемонтыОборудования.Выгрузить().ВыгрузитьКолонку("ID"));
	Иначе
		Запрос.УстановитьПараметр("ID", IDРемонта);
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НайденныеСтроки = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", Выборка.ID));
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			НайденнаяСтрока.ВРамкахОстановочного = Выборка.Регистратор;
		КонецЦикла;
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьДоступностьДляРедактирования()
	
	МассивIDДляПроверки = Объект.РемонтыОборудования.Выгрузить().ВыгрузитьКолонку("ID");
	МассивIDДляБлокировки = торо_Ремонты.МассивIDДляБлокировкиРемонтовОборудования(Объект.Ссылка, МассивIDДляПроверки);
	
	Если Не МассивIDДляБлокировки = Неопределено Тогда
		
		Для Каждого СтрокаРемонта Из Объект.РемонтыОборудования Цикл
			СтрокаРемонта.БлокироватьДляИзменения = Не МассивIDДляБлокировки.Найти(СтрокаРемонта.ID) = Неопределено;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьДляРедактированияПоТекРемонту(БлокироватьДляИзменения)
	
	Элементы.ДеревоРемонтныхРабот.ТолькоПросмотр	= БлокироватьДляИзменения Или Не ПравоРедактирование ИЛИ ЭтаФорма["СогласованиеТолькоПросмотр"];
	Элементы.Исполнители.ТолькоПросмотр				= БлокироватьДляИзменения Или Не ПравоРедактирование ИЛИ ЭтаФорма["СогласованиеТолькоПросмотр"];
	Элементы.ИсполнителиПоРемонтам.ТолькоПросмотр				= БлокироватьДляИзменения Или Не ПравоРедактирование ИЛИ ЭтаФорма["СогласованиеТолькоПросмотр"];
		
	Элементы.ДеревоРемонтныхРаботДобавитьТехКарту.Доступность		= Не БлокироватьДляИзменения И ПравоРедактирование И НЕ ЭтаФорма["СогласованиеТолькоПросмотр"];
	Элементы.ДеревоРемонтныхРаботДобавитьТехОперацию.Доступность	= Не БлокироватьДляИзменения И ПравоРедактирование И НЕ ЭтаФорма["СогласованиеТолькоПросмотр"]; 
	
КонецПроцедуры

&НаСервере
Функция ДеревоРемонтныхРаботОбработкаВыбораНаСервере(ТехОперация, ТекущиеДанные, СтруктураПараметры)
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДеревоРеквизит = РеквизитФормыВЗначение("ДеревоРемонтныхРабот");
	СтруктураВозврата = торо_Ремонты.ОбработкаВыбораРемонта(ДеревоРеквизит, ТехОперация, ДокОбъект, ДокОбъект.РемонтыОборудования, ДокОбъект.РемонтныеРаботы, ДокОбъект.ДокументыОснования, ТекущиеДанные, СтруктураПараметры);
	
	Если ТипЗнч(СтруктураВозврата) = Тип("Структура") Тогда
		ЗначениеВРеквизитФормы(СтруктураВозврата.ДокументОбъект, "Объект");
		ЗначениеВРеквизитФормы(СтруктураВозврата.Дерево, "ДеревоРемонтныхРабот");
		ЗаполнитьДеревоРемонтныхРаботНаСервере();
		Возврат Истина;
	ИначеЕсли ТипЗнч(СтруктураВозврата) = Тип("Строка") Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
		
КонецФункции

// Функция добавлена для обработки выбора сразу нескольких тех операций или тех карт.
&НаСервере
Функция ДеревоРемонтныхРаботОбработкаВыбораНаСервереДляМассива(МассивТехОпераций, ТекущиеДанные, СтруктураПараметры)
		
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДеревоРеквизит = РеквизитФормыВЗначение("ДеревоРемонтныхРабот");
	МассивВозврата = Новый Массив;
	СтруктураПоследнегоДобавленного = Неопределено;
	Для Каждого ЭлементМассива Из МассивТехОпераций Цикл
		СтруктураВозврата = торо_Ремонты.ОбработкаВыбораРемонта(ДеревоРеквизит, ЭлементМассива, ДокОбъект, ДокОбъект.РемонтыОборудования, ДокОбъект.РемонтныеРаботы, ДокОбъект.ДокументыОснования, ТекущиеДанные, СтруктураПараметры);
		Если Не ТипЗнч(СтруктураВозврата) = Тип("Структура") Тогда
			МассивВозврата.Добавить(СтруктураВозврата);
		Иначе
			СтруктураПоследнегоДобавленного = СтруктураВозврата;
		КонецЕсли;
	КонецЦикла;	
	
	Если СтруктураПоследнегоДобавленного <> Неопределено Тогда
		ЗначениеВРеквизитФормы(СтруктураПоследнегоДобавленного.ДокументОбъект, "Объект");
		ЗначениеВРеквизитФормы(СтруктураПоследнегоДобавленного.Дерево, "ДеревоРемонтныхРабот");
		ЗаполнитьДеревоРемонтныхРаботНаСервере();
	КонецЕсли;
	
	Возврат МассивВозврата;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДеревоРемонтныхРаботНаСервере(РемонтыОборудования_ID = Неопределено)
	
	ДеревоСФормы = РеквизитФормыВЗначение("ДеревоРемонтныхРабот");
	
	ДеревоСФормы.Строки.Очистить();
	
	КорневаяСтрока = ДеревоСФормы.Строки.Добавить();
	// >> [Деснол] [Ушаков А.Д.] [03.10.2019] 
	КорневаяСтрока.РемонтнаяРабота = дс_ПолучитьПредставлениеКорневойРемонтнойРаботы();
	//КорневаяСтрока.РемонтнаяРабота = "Ремонтные работы";
	// << [Деснол] [Ушаков А.Д.] [03.10.2019] 
	КорневаяСтрока.Картинка = 4;
	
	Если Не РемонтыОборудования_ID = Неопределено Тогда
		ТЗРемонтныеРаботы = Объект.РемонтныеРаботы.Выгрузить(Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", РемонтыОборудования_ID)));
	Иначе
		ТЗРемонтныеРаботы = Неопределено;
	КонецЕсли;
	
	СоздатьВетвьДереваПоТЧ(КорневаяСтрока, ТЗРемонтныеРаботы);
	
	ЗначениеВРеквизитФормы(ДеревоСФормы, "ДеревоРемонтныхРабот");
	
КонецПроцедуры

&НаСервере
Процедура СоздатьВетвьДереваПоТЧ(СтрокаДерева, ТЧРемонтныеРаботы = Неопределено, ЕстьКартинка = Истина)
	
		Если Объект.РемонтныеРаботы.Количество() > 0 И ЗначениеЗаполнено(Объект.РемонтныеРаботы[0].ID) Тогда
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Родитель_ID", СтрокаДерева.ID);
		
		Если ТЧРемонтныеРаботы = Неопределено Тогда
			МассивСтрок = Объект.РемонтныеРаботы.НайтиСтроки(ПараметрыОтбора);
		Иначе
			МассивСтрок = ТЧРемонтныеРаботы.НайтиСтроки(ПараметрыОтбора);
		КонецЕсли;
		
		Для Каждого Элемент Из МассивСтрок Цикл
			
			НовСтрокаДерева = СтрокаДерева.Строки.Добавить();
			
			ЗаполнитьЗначенияСвойств(НовСтрокаДерева, Элемент);
			
			Если ЕстьКартинка Тогда  
				НовСтрокаДерева.Картинка = торо_Ремонты.ИндексКартинкиДереваРемонтныхРабот(Элемент.РемонтнаяРабота);
			КонецЕсли;
			
			Если ТипЗнч(НовСтрокаДерева.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда
				НовСтрокаДерева.ЭтоТехКарта = Истина;
			Иначе
				НовСтрокаДерева.ЭтоТехКарта = Ложь;
			КонецЕсли; 
					
			СоздатьВетвьДереваПоТЧ(НовСтрокаДерева, ТЧРемонтныеРаботы, ЕстьКартинка);
			
		КонецЦикла;
		
	Иначе
		Возврат;
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборРемонтовОбработчикОжидания()
	
	ПодборРемонтов(Элементы.РемонтыОборудованияПодборРемонтов);
	
КонецПроцедуры

&НаКлиенте
Процедура РемонтыОборудованияПередУдалениемЗавершение(РезультатВопроса,ДополнительныеПараметры) Экспорт
	
	Элемент = ДополнительныеПараметры.Элемент;
	Ответ  = РезультатВопроса;
	Строки = Элемент.ВыделенныеСтроки;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Для каждого идСтрока из Строки Цикл
			текСтрока = Объект.РемонтыОборудования.НайтиПоИдентификатору(идСтрока);
			
			РемонтОборудованияУдаляется = Истина;
			ОчиститьСвязанныеТабличныеЧасти(, , текСтрока.ID);
			Объект.РемонтыОборудования.Удалить(текСтрока);
			Модифицированность = Истина;
			РемонтОборудованияУдаляется = Ложь;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьСвязанныеТабличныеЧасти(ДокументОснование = Неопределено, ОбъектРемонта = Неопределено, Ремонт_ID = "")
	
	СтруктураТабличныхЧастей = Новый Структура ("Исполнители");
	СтруктураТабличныхЧастейПоРемонтам = Новый Структура("ИсполнителиПоРемонтам");
	
	Если ПустаяСтрока(Ремонт_ID) Тогда
		
		Если Не ДокументОснование = Неопределено Тогда
			
			СтрокиРО = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ДокументИсточник", ДокументОснование));
			
		ИначеЕсли Не ОбъектРемонта = Неопределено Тогда
			
			СтрокиРО = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ОбъектРемонта", ОбъектРемонта));
			
		ИначеЕсли ОбъектРемонта = Неопределено И ДокументОснование = Неопределено Тогда
			
			Возврат;
			
		КонецЕсли;	
		
		Для Каждого ОчереднаяСтрока Из СтрокиРО Цикл
			
			СтрокиРР = Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", ОчереднаяСтрока.ID));
			
			Для Каждого СтрокаРР Из СтрокиРР Цикл
				
				Для Каждого КлючИЗначение Из СтруктураТабличныхЧастей Цикл
					Если Объект[КлючИЗначение.Ключ].Количество() > 0 Тогда
						СтрокиТЧ = Объект[КлючИЗначение.Ключ].НайтиСтроки(Новый Структура("ID", СтрокаРР.ID));
						Для Каждого СтрокаТЧ Из СтрокиТЧ Цикл
							Объект[КлючИЗначение.Ключ].Удалить(СтрокаТЧ);
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
				
				Объект.РемонтныеРаботы.Удалить(СтрокаРР);
			КонецЦикла;
			
			Для Каждого КлючИЗначение Из СтруктураТабличныхЧастейПоРемонтам Цикл
				Если Объект[КлючИЗначение.Ключ].Количество() > 0 Тогда
					СтрокиТЧ = Объект[КлючИЗначение.Ключ].НайтиСтроки(Новый Структура("РемонтыОборудования_ID", ОчереднаяСтрока.ID));
					Для Каждого СтрокаТЧ Из СтрокиТЧ Цикл
						Объект[КлючИЗначение.Ключ].Удалить(СтрокаТЧ);
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
			
			Объект.РемонтыОборудования.Удалить(ОчереднаяСтрока);		
		КонецЦикла;
		
		Если Объект.РемонтныеРаботы.Количество() > 0 Тогда
			Если ПустаяСтрока(Объект.РемонтныеРаботы[0].ID) Тогда
				Объект.РемонтныеРаботы.Очистить();
			КонецЕсли
		КонецЕсли;
		
		ЗаполнитьДеревоРемонтныхРаботНаСервере();
		
		Если Объект.РемонтныеРаботы.Количество() = 0 Тогда
			Объект.РемонтныеРаботы.Добавить();
			Элементы.ДеревоРемонтныхРабот.ТекущаяСтрока = Объект.РемонтныеРаботы[0].ПолучитьИдентификатор();
		КонецЕсли;
		
	Иначе
		
		СтрокиРР = Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", Ремонт_ID));
		
		Для Каждого СтрокаРР Из СтрокиРР Цикл
			
			Для Каждого КлючИЗначение Из СтруктураТабличныхЧастей Цикл
				Если Объект[КлючИЗначение.Ключ].Количество() > 0 Тогда
					СтрокиТЧ = Объект[КлючИЗначение.Ключ].НайтиСтроки(Новый Структура("ID, РемонтыОборудования_ID", СтрокаРР.ID, СтрокаРР.РемонтыОборудования_ID));
					Для Каждого СтрокаТЧ Из СтрокиТЧ Цикл
						Объект[КлючИЗначение.Ключ].Удалить(СтрокаТЧ);
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
			
			Объект.РемонтныеРаботы.Удалить(СтрокаРР);
		КонецЦикла;
		
		Для Каждого КлючИЗначение Из СтруктураТабличныхЧастейПоРемонтам Цикл
			Если Объект[КлючИЗначение.Ключ].Количество() > 0 Тогда
				СтрокиТЧ = Объект[КлючИЗначение.Ключ].НайтиСтроки(Новый Структура("РемонтыОборудования_ID", Ремонт_ID));
				Для Каждого СтрокаТЧ Из СтрокиТЧ Цикл
					Объект[КлючИЗначение.Ключ].Удалить(СтрокаТЧ);
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если Объект.РемонтныеРаботы.Количество() > 0 Тогда
		Если ПустаяСтрока(Объект.РемонтныеРаботы[0].ID) Тогда
			Объект.РемонтныеРаботы.Очистить();
		КонецЕсли
	КонецЕсли;
	
	ЗаполнитьДеревоРемонтныхРаботНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДанныеТЧПоIDСтрокиДереваНаСервере(ТекущиеЗначения, СтруктураТабличныхЧастей)

	Для Каждого КлючИЗначение Из СтруктураТабличныхЧастей Цикл
		
		ТабличнаяЧасть = Объект[КлючИЗначение.Ключ];
		
		ПараметрыПоиска = Новый Структура;
		ПараметрыПоиска.Вставить("ID", ТекущиеЗначения.ID);
		ПараметрыПоиска.Вставить("РемонтыОборудования_ID", ТекущиеЗначения.РемонтыОборудования_ID);
		
		СтрокиДляУдаления = ТабличнаяЧасть.НайтиСтроки(ПараметрыПоиска);
		
		Для Каждого Элемент Из СтрокиДляУдаления Цикл
			
			ТабличнаяЧасть.Удалить(Элемент);
			
		КонецЦикла;
		
	КонецЦикла;
	
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("РемонтыОборудования_ID", ТекущиеЗначения.РемонтыОборудования_ID);
	ПараметрыПоиска.Вставить("Родитель_ID", ТекущиеЗначения.ID);
			
	МассивПодчиненныхСтрок = Объект.РемонтныеРаботы.НайтиСтроки(ПараметрыПоиска);
	Для Каждого СтрДерева Из МассивПодчиненныхСтрок Цикл
		СтруктураДляПередачи = Новый Структура("ID, РемонтыОборудования_ID, Родитель_ID", СтрДерева.ID, СтрДерева.РемонтыОборудования_ID, СтрДерева.Родитель_ID);
		УдалитьДанныеТЧПоIDСтрокиДереваНаСервере(СтруктураДляПередачи, СтруктураТабличныхЧастей);
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоИсполнителям()
	
	ТекСтрокаДереваРемонтов = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	ТекСтрокаРемонтовОборудования = Элементы.РемонтыОборудования.ТекущиеДанные;
	
	Если ТекСтрокаДереваРемонтов <> Неопределено Тогда
		
		ID_Отбора = ТекСтрокаДереваРемонтов.ID;
		Если ТекСтрокаРемонтовОборудования <> Неопределено Тогда
			ID_ОтбораРемонтов = ТекСтрокаРемонтовОборудования.ID;
		Иначе
			ID_ОтбораРемонтов = ТекСтрокаДереваРемонтов.РемонтыОборудования_ID;
		КонецЕсли;
		
		ОтредактироватьУсловноеОформление(ТекСтрокаДереваРемонтов.ПолучитьИдентификатор(), ID_ОтбораРемонтов);
		
		Если ЗначениеЗаполнено(ID_ОтбораРемонтов) Тогда
			Элементы.Исполнители.ОтборСтрок = Неопределено;
		Иначе
			Элементы.Исполнители.ОтборСтрок = Новый ФиксированнаяСтруктура("ID", ID_Отбора);
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
// Процедура пересчитывает количество в строках дерева ремонтных работ.
//
Процедура ПересчитатьКоличествоВПодчиненныхСтроках(СтрокаДерева, Коэффициент)
	
	Для Каждого СтрДерева Из СтрокаДерева.ПолучитьЭлементы() Цикл
		
		ID = СтрДерева.ID;
		
		МассивСтрТЧ = Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("ID", ID));
		Если МассивСтрТЧ.Количество() Тогда
			
			СтрТЧ = МассивСтрТЧ[0];
			СтрТЧ.Количество = СтрТЧ.Количество * Коэффициент;
			
			СтрДерева.Количество = СтрТЧ.Количество;
			
		КонецЕсли;
		
		ПересчитатьКоличествоВПодчиненныхСтроках(СтрДерева, Коэффициент);
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняет проверку типа ремонтной работы в строке дерева ремонтных работ.
// 
Процедура ПроверкаТипаВСтрокеДереваРемонтныхРабот(СтрокаДерева, ТипДляСравнения, ТекстПредупреждения, Отказ)
	
	Если СтрокаДерева = Неопределено Тогда
		Отказ =  Истина;
		ПоказатьПредупреждение(Неопределено, НСтр("es='de los gastos!';ru='Не выбрана ремонтная работа для отнесения затрат!';en='No repair work selected for cost allocation!'"));
		Возврат;
	КонецЕсли;
	
	Если Не ТипЗнч(СтрокаДерева.РемонтнаяРабота) = ТипДляСравнения Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(Неопределено, ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеВидимостью(ДокОбъект)
	Элементы = ДокОбъект.Элементы;
	Объект = ДокОбъект.Объект;
	Элементы.ДеревоСогласованияУтвердитьСтатус.Доступность = ЗначениеЗаполнено(Объект.СпособСогласования);
КонецПроцедуры

#Область Согласование

&НаСервере
Процедура ЗавершитьУтверждениеСтатусаДокумента(ПараметрыОповещения)
	
	торо_РаботаССогласованиями.ЗавершитьУтверждениеСтатусаДокумента(ЭтаФорма, ПараметрыОповещения);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДеревоСогласующих(НовыйСпособСогласования = Ложь) 
	
	торо_РаботаССогласованиями.ОбновитьДеревоСогласующих(ЭтаФорма, НовыйСпособСогласования);
		
КонецПроцедуры

&НаКлиенте
Процедура СпособСогласованияНачалоВыбораЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		СогласующиеРегистр.Очистить();
		Если мХранитьИсториюСогласованияВДокументах Тогда
			Объект.Согласующие.Очистить();
		КонецЕсли;
		ОткрытьФорму("Справочник.торо_СпособыСогласованияДокументов.ФормаВыбора",,ДополнительныеПараметры.Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияСтатусовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	торо_РаботаССогласованиямиКлиент.ОткрытьЗаписьИсторииСтатусов(ЭтаФорма, Элемент.ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

&НаСервере
// Проверяет, есть ли документы, созданные на основании данного и документы, на оснвоании которого был введен текущий, 
// кроме Выявленных дефектов и Внешнего основания.
Функция ЭтоПервыйДокументВЦепочке()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДокументыОснования.ДокументИсточник
	               |ПОМЕСТИТЬ ДокументыОснования_
	               |ИЗ
	               |	&ДокументыОснования КАК ДокументыОснования
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДокументыОснования_.ДокументИсточник КАК ДокументОснование
	               |ИЗ
	               |	ДокументыОснования_ КАК ДокументыОснования_
	               |ГДЕ
	               |	(ДокументыОснования_.ДокументИсточник ССЫЛКА Документ.торо_ЗаявкаНаРемонт
	               |			ИЛИ ДокументыОснования_.ДокументИсточник ССЫЛКА Документ.торо_ПланГрафикРемонта)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ДокументИсточник
	               |ИЗ
	               |	Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК торо_АктОВыполненииЭтапаРаботРемонтыОборудования
	               |ГДЕ
	               |	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |	И торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ДокументИсточник = &ДокументОснование";
	Запрос.УстановитьПараметр("ДокументыОснования", Объект.РемонтыОборудования.Выгрузить());
	Запрос.УстановитьПараметр("ДокументОснование", Объект.Ссылка);
	

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() <> 0 Тогда
		Возврат Ложь;
	Иначе 
		Возврат Истина;				   
	КонецЕсли;

КонецФункции

&НаСервере
// Проверяет, есть ли документы, введенные на основании текущего
Функция ЭтоПоследнийДокументВЦепочке()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_АктПриемкиОборудованияРемонтыОборудования.ДокументИсточник
	               |ИЗ
	               |	Документ.торо_АктПриемкиОборудования.РемонтыОборудования КАК торо_АктПриемкиОборудованияРемонтыОборудования
	               |ГДЕ
	               |	торо_АктПриемкиОборудованияРемонтыОборудования.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |	И торо_АктПриемкиОборудованияРемонтыОборудования.ДокументИсточник = &ДокументОснование";
	//Запрос.УстановитьПараметр("ДокументыОснования", Объект.ДокументыОснования.Выгрузить());
	Запрос.УстановитьПараметр("ДокументОснование", Объект.Ссылка);
	

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() <> 0 Тогда
		Возврат Ложь;
	Иначе 
		Возврат Истина;				   
	КонецЕсли;

КонецФункции

&НаСервере
Процедура РемонтыОборудованияОбновитьДокументыИсточники()
	
	
	Для Каждого СтрокаРемонта Из Объект.РемонтыОборудования Цикл
		Если СтрокаРемонта.ТипДокументаОснования = "" и СтрокаРемонта.ДокументИсточник <> Неопределено Тогда
			СтрокаРемонта.ТипДокументаОснования = СтрокаРемонта.ДокументИсточник.Метаданные().Имя;
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ОтредактироватьУсловноеОформление(ИдСтроки, ИДРемонта)
	
	ЭлементОформления1 = Неопределено;
	ЭлементОформления2 = Неопределено;
	Для каждого ТекУо из УсловноеОформление.Элементы Цикл
		Если ТекУо.Представление = "ВидимостьИсполнителей1" Тогда
			ЭлементОформления1 = ТекУо;
		КонецЕсли;
		
		Если ТекУо.Представление = "ВидимостьИсполнителей2" Тогда
			ЭлементОформления2 = ТекУо;
		КонецЕсли;
		
	КонецЦикла;
	
	ТекСтрокаДереваРемонтов = ДеревоРемонтныхРабот.НайтиПоИдентификатору(ИдСтроки);
	
	масСтрок = Новый Массив;
	торо_РаботаССогласованиямиКлиентСервер.ЗаполнитьМассивИзДерева(масСтрок, ТекСтрокаДереваРемонтов.ПолучитьЭлементы());
	
	сзИД = Новый СписокЗначений;
	Для каждого текСтрока из масСтрок Цикл
		сзИД.Добавить(текСтрока.ID);
	КонецЦикла;
	сзИД.Добавить(ТекСтрокаДереваРемонтов.ID);
	
	Если ЭлементОформления1 <> Неопределено Тогда
		ЭлементОформления1.Использование = Истина;
		ЭлементОформления1.Отбор.Элементы[0].ПравоеЗначение = сзИД;
	КонецЕсли;
	
	Если ЭлементОформления2 <> Неопределено Тогда
		ЭлементОформления2.Использование = ЗначениеЗаполнено(ИДРемонта);
		ЭлементОформления2.Отбор.Элементы[0].ПравоеЗначение = ИДРемонта;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекСтрокаДереваРемонтов.ID) И ЗначениеЗаполнено(ИДРемонта) Тогда 
		МассивСтрок = Объект.Исполнители.НайтиСтроки(Новый Структура("ID, РемонтыОборудования_ID", ТекСтрокаДереваРемонтов.ID, ИДРемонта));
		Если МассивСтрок.Количество() > 0 Тогда 
			Элементы.Исполнители.ТекущаяСтрока = МассивСтрок[0].ПолучитьИдентификатор();
		КонецЕсли; 
	ИначеЕсли ЗначениеЗаполнено(ИДРемонта) Тогда  
		МассивСтрок = Объект.Исполнители.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", ИДРемонта));
		Если МассивСтрок.Количество() > 0 Тогда 
			Элементы.Исполнители.ТекущаяСтрока = МассивСтрок[0].ПолучитьИдентификатор();
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьИсполнителей(Адрес)
	
	Если Адрес = Неопределено Тогда возврат; КонецЕсли;
	
	тз = ПолучитьИзВременногоХранилища(Адрес);
	
	стрОтбора = Новый Структура("РемонтыОборудования_ID, ID");
	
	Для каждого текСтрока из Тз Цикл
		ЗаполнитьЗначенияСвойств(стрОтбора, текСтрока);
		НайС = Объект.Исполнители.НайтиСтроки(стрОтбора);
		
		Для каждого ТезЗапись из НайС Цикл
			Объект.Исполнители.Удалить(ТезЗапись);
			Модифицированность = Истина;
		КонецЦикла;
	КонецЦикла;
	
	Для каждого текСтрока из Тз Цикл
		нс = Объект.Исполнители.Добавить();
		ЗаполнитьЗначенияСвойств(нс, текСтрока);
	КонецЦикла;	
	
КонецПроцедуры 

&НаКлиенте
Процедура УстановкаИсполнителей(ВыбранноеЗначение)
	РемОборудования = ВыбранноеЗначение.СтрокаРемонтовОборудования.ID;
	НайденныеСтрокиРемонта = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", РемОборудования ));	
	НайденныеСтрокиТрудозатрат = Объект.Исполнители.НайтиСтроки( Новый Структура("РемонтыОборудования_ID", РемОборудования ));
	Если НайденныеСтрокиРемонта.Количество() <> 0 Тогда
		НомерСтроки = НайденныеСтрокиРемонта[0].ПолучитьИдентификатор();
		ЗаполнитьИсполнителейПоНормамНаСервере(Неопределено, НомерСтроки);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИсполнителей1(Команда)
		
	ПараметрыОткрытия = Новый Структура("Ссылка, МассивИсполнителей, Наряд", Объект.Ссылка, ПолучитьМассивСтруктурИсполнителей(), Истина);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаАвтоматическогоЗаполненияИсполнителей", ЭтаФорма);
	ОткрытьФорму("Документ.торо_АктОВыполненииЭтапаРабот.Форма.ФормаАвтозаполненияИсполнителей",ПараметрыОткрытия, ЭтаФорма,,ВариантОткрытияОкна.ОтдельноеОкно,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАвтоматическогоЗаполненияИсполнителей(Результат, ДопПараметры) Экспорт
	
	Если Не Результат = Неопределено И ТипЗнч(Результат) = Тип("Массив") Тогда
		Объект.Исполнители.Очистить();
		Для каждого СтрокаМассива Из Результат Цикл
			НС = Объект.Исполнители.Добавить();
			ЗаполнитьЗначенияСвойств(НС, СтрокаМассива);
		КонецЦикла; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьМассивСтруктурИсполнителей()
	Массив = Новый Массив;
	
	Для каждого СтрокаРемонтовОборудования Из Объект.РемонтыОборудования Цикл
		
		МассивСтрокРемонныхРабот = Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", СтрокаРемонтовОборудования.ID));
		
		Для каждого СтрокаРемонтныхРабот Из МассивСтрокРемонныхРабот Цикл
			
			МассивИсполнителей = Объект.Исполнители.НайтиСтроки(Новый Структура("РемонтыОборудования_ID, ID", СтрокаРемонтовОборудования.ID, СтрокаРемонтныхРабот.ID));
			
			Для каждого СтрокаИсполнителя Из МассивИсполнителей Цикл
				
				СтруктураСтроки = Новый Структура();
				СтруктураСтроки.Вставить("РемонтыОборудования_ID", СтрокаРемонтовОборудования.ID);
				СтруктураСтроки.Вставить("ID"                    , СтрокаРемонтныхРабот.ID);
				СтруктураСтроки.Вставить("Родитель_ID"           , СтрокаРемонтныхРабот.Родитель_ID);
				СтруктураСтроки.Вставить("РемонтнаяРабота"       , СтрокаРемонтныхРабот.РемонтнаяРабота);
				СтруктураСтроки.Вставить("ОбъектРемонта"         , СтрокаРемонтовОборудования.ОбъектРемонта);
				СтруктураСтроки.Вставить("ВидРемонта"            , СтрокаРемонтовОборудования.ВидРемонтныхРабот);
				СтруктураСтроки.Вставить("ДатаНачалаРемонта"     , СтрокаРемонтовОборудования.ДатаНачала);
				СтруктураСтроки.Вставить("ДатаОкончанияРемонта"  , СтрокаРемонтовОборудования.ДатаОкончания);
				СтруктураСтроки.Вставить("Квалификация"          , СтрокаИсполнителя.Квалификация);
				СтруктураСтроки.Вставить("ДатаНачала"            , СтрокаИсполнителя.ДатаНачала);
				СтруктураСтроки.Вставить("ДатаОкончания"         , СтрокаИсполнителя.ДатаОкончания);
				//СтруктураСтроки.Вставить("ВремяРаботы"           , СтрокаИсполнителя.ВремяРаботы);
				//СтруктураСтроки.Вставить("СуммаКНачислению"      , СтрокаИсполнителя.СуммаКНачислению);
				СтруктураСтроки.Вставить("Сотрудник"             , СтрокаИсполнителя.Сотрудник);
				
				Массив.Добавить(СтруктураСтроки);
				
			КонецЦикла;
			
			Если Не ТипЗнч(СтрокаРемонтныхРабот.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт")
				И Не МассивИсполнителей.Количество() > 0 Тогда //нужно отразить хотя бы тех операции.
				
				СтруктураСтроки = Новый Структура();
				СтруктураСтроки.Вставить("РемонтыОборудования_ID", СтрокаРемонтовОборудования.ID);
				СтруктураСтроки.Вставить("ID"                    , СтрокаРемонтныхРабот.ID);
				СтруктураСтроки.Вставить("Родитель_ID"           , СтрокаРемонтныхРабот.Родитель_ID);
				СтруктураСтроки.Вставить("РемонтнаяРабота"       , СтрокаРемонтныхРабот.РемонтнаяРабота);
				СтруктураСтроки.Вставить("ОбъектРемонта"         , СтрокаРемонтовОборудования.ОбъектРемонта);
				СтруктураСтроки.Вставить("ВидРемонта"            , СтрокаРемонтовОборудования.ВидРемонтныхРабот);
				СтруктураСтроки.Вставить("ДатаНачалаРемонта"     , СтрокаРемонтовОборудования.ДатаНачала);
				СтруктураСтроки.Вставить("ДатаОкончанияРемонта"  , СтрокаРемонтовОборудования.ДатаОкончания);
				
				СтруктураСтроки.Вставить("Квалификация");
				СтруктураСтроки.Вставить("ДатаНачала");
				СтруктураСтроки.Вставить("ДатаОкончания");
				СтруктураСтроки.Вставить("ВремяРаботы");
				СтруктураСтроки.Вставить("СуммаКНачислению");
				СтруктураСтроки.Вставить("Сотрудник");
				
				Массив.Добавить(СтруктураСтроки);
				
			КонецЕсли; 
			
		КонецЦикла; 
	КонецЦикла; 
	
	Возврат Массив;
	
КонецФункции	

&НаКлиенте
Функция ЗаполнитьДанныеНаОснованииППРВыделенныеСтроки()
	
	ВыбранноеЗначение = Новый Массив;
	
	Для Каждого СтрокаМассиваIDИзППР Из МассивIDИзППР Цикл
	
		СтруктураВыбора = Новый Структура;
		
		СтруктураВыбора.Вставить("ДокументОснование", ДокОснованиеППР);
		СтруктураВыбора.Вставить("СтрокаРемонтовОборудования", СтрокаМассиваIDИзППР.Значение.СтрокаРемонтовОборудования);
		СтруктураВыбора.Вставить("МассивСтрокРемонтныхРабот", СтрокаМассиваIDИзППР.Значение.МассивСтрокРемонтныхРабот);
		
		ВыбранноеЗначение.Добавить(СтруктураВыбора);
		
	КонецЦикла;
	
	Возврат ВыбранноеЗначение;
	
КонецФункции

&НаКлиенте
Процедура ЗакрываемыеПредписанияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ТекДанныеРемОборуд = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если ТекДанныеРемОборуд = Неопределено Тогда
		
		ТекстСообщения = НСтр("es='de la maquinaria.';ru='Не выбран ремонт оборудования.';en='No equipment repair selected.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
		
	КонецЕсли;
	
	ФормаПодбора = ПолучитьФорму("Обработка.торо_ПодборРемонтныхРаботОборудования.Форма.ФормаПодбораПредписанийОпераций",
	Новый Структура("ОбъектРемонтаДляОтбора", ТекДанныеРемОборуд.ОбъектРемонта), Элементы.ЗакрываемыеПредписания, Объект.Ссылка, ВариантОткрытияОкна.ОтдельноеОкно);
	
	ФормаПодбора.Объект.ДокументыОснования.Очистить();
	
	Для Каждого СтрокаДО Из Объект.ДокументыОснования Цикл
		Если ТипЗнч(СтрокаДО.ДокументОснование) = Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот") Тогда
			ФормаПодбора.Объект.ДокументыОснования.Добавить().ДокументОснование = СтрокаДО.ДокументОснование;
		КонецЕсли;
	КонецЦикла;
	
	ФормаПодбора.ЗакрыватьПриВыборе = Ложь;
	
	ФормаПодбора.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗакрываемыеПредписанияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		СтандартнаяОбработка = Ложь;
	Если Элемент.ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(Элемент.ТекущиеДанные.ДокументВнешнегоОснования) И Поле.Имя = "ЗакрываемыеПредписанияДокументВнешнегоОснования" Тогда
		СтруктураПараметров = Новый Структура("Ключ", Элемент.ТекущиеДанные.ДокументВнешнегоОснования);
		ОткрытьФорму("Документ.торо_ВнешнееОснованиеДляРабот.ФормаОбъекта", СтруктураПараметров);		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрываемыеПредписанияПередУдалением(Элемент, Отказ)
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		СтрокиДокОснования = Объект.ДокументыОснования.НайтиСтроки(Новый Структура("ДокументОснование", Элемент.ТекущиеДанные.ДокументВнешнегоОснования));
		Если СтрокиДокОснования.Количество() <> 0 Тогда
			Для каждого СтрокаДокумента Из СтрокиДокОснования Цикл
				Объект.ДокументыОснования.Удалить(СтрокаДокумента);
			КонецЦикла; 
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрываемыеПредписанияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		
		ТекСтрокаРемонта = Элементы.РемонтыОборудования.ТекущиеДанные;
		
		Если ТекСтрокаРемонта = Неопределено Тогда
			ТекстСообщения = НСтр("es='de las prescripciones!';ru='Не выбран ремонт для прикрепления предписаний!';en='No repair selected for attaching instructions!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		СтрокиПредписания = Объект.ЗакрываемыеПредписания.НайтиСтроки(Новый Структура("ID", ВыбранноеЗначение.СтрокаРемонтовОборудования.ID));
		СтрокиПредписанияОснование = Объект.ДокументыОснования.НайтиСтроки(Новый Структура("ДокументОснование", ВыбранноеЗначение.ДокументОснование));
		
		Если СтрокиПредписанияОснование.Количество() <> 0 Тогда
			ТекстСообщения = НСтр("es='¡La razón escogida exterior hay ya en los documentos-razones!';ru='Выбранное внешнее основание уже имеется в документах-основаниях!';en='The selected external base is already in the base documents!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Возврат;

		ИначеЕсли СтрокиПредписания.Количество() = 0 ИЛИ СтрокиПредписания[0].РемонтыОборудования_ID = ТекСтрокаРемонта.ID Тогда
			Если СтрокиПредписания.Количество() = 0 Тогда
				СтрокаПредписания = Объект.ЗакрываемыеПредписания.Добавить();
				
				СтрокаПредписания.ID 						= ВыбранноеЗначение.СтрокаРемонтовОборудования.ID;
				СтрокаПредписания.ОбъектРемонта 			= ВыбранноеЗначение.СтрокаРемонтовОборудования.ОбъектРемонта;
				СтрокаПредписания.ПлановаяДатаРемонта 		= ВыбранноеЗначение.СтрокаРемонтовОборудования.ПлановаяДата;
				СтрокаПредписания.Описание					= ВыбранноеЗначение.СтрокаРемонтовОборудования.ОписаниеРемонта;
				СтрокаПредписания.РемонтыОборудования_ID 	= ТекСтрокаРемонта.ID;
				СтрокаПредписания.ДокументВнешнегоОснования = ВыбранноеЗначение.ДокументОснование;
			КонецЕсли;
			
			УвеличиватьКоличествоОпераций = Ложь;
			СтрДерева = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
			ТекСтрокаДерева = Новый Структура("РемонтнаяРабота, ID, Родитель_ID", СтрДерева.РемонтнаяРабота, СтрДерева.ID, СтрДерева.Родитель_ID);
			
			Если ВыбранноеЗначение.Свойство("СтрокаРемонтныхРабот") Тогда
				ОбработкаВыборкаСтрокиРемРаботИзПредписаний(Неопределено, Неопределено, ВыбранноеЗначение,ВыбранноеЗначение.СтрокаРемонтныхРабот,ТекСтрокаРемонта, ТекСтрокаДерева, УвеличиватьКоличествоОпераций);
			ИначеЕсли ВыбранноеЗначение.Свойство("МассивСтрокРемонтныхРабот") Тогда
				
				ОбработкаВыборкаСтрокиРемРаботИзПредписанийНаСервере(ВыбранноеЗначение, ТекСтрокаРемонта.ID, ТекСтрокаДерева, УвеличиватьКоличествоОпераций);
				
			КонецЕсли;
			//ОбновитьНадписиВремениРаботы();
			Модифицированность = Истина;
		Иначе
			ТекстСообщения = НСтр("es='¡La razón escogida exterior es añadida ya en esta reparación!';ru='Выбранное внешнее основание уже добавлено в этот ремонт!';en='The selected external base has already been added to this repair!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		СтрокиДокОснования = Объект.ДокументыОснования.НайтиСтроки(Новый Структура("ДокументОснование", ВыбранноеЗначение.ДокументОснование));
		
		Если СтрокиДокОснования.Количество() = 0 Тогда
			НоваяСтрока = Объект.ДокументыОснования.Добавить();
			НоваяСтрока.ДокументОснование = ВыбранноеЗначение.ДокументОснование;
		КонецЕсли;
		
	КонецЕсли;
	Элементы.ДеревоРемонтныхРабот.Развернуть(ДеревоРемонтныхРабот.ПолучитьЭлементы()[0].ПолучитьИдентификатор(),Истина);

КонецПроцедуры

&НаСервере
Процедура ОбработкаВыборкаСтрокиРемРаботИзПредписаний(ДокОбъект, Дерево, ВыбранноеЗначение,ТекСтрока,ТекСтрокаРемонтаID, ТекСтрокаДерева, УвеличиватьКоличествоОпераций)
	
	Если Дерево = Неопределено Тогда
		Дерево = РеквизитФормыВЗначение("ДеревоРемонтныхРабот");
	КонецЕсли;
	
	Если ДокОбъект = Неопределено Тогда
		ДокОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	МассивСтрокОпераций = Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("РемонтыОборудования_ID,РемонтнаяРабота",ТекСтрокаРемонтаID, ТекСтрока.РемонтнаяРабота));
	
	Если МассивСтрокОпераций.Количество() = 0  Или УвеличиватьКоличествоОпераций = Ложь Тогда
		
		СтрокиДерева = Дерево.Строки.НайтиСтроки(Новый Структура("РемонтнаяРабота, ID, Родитель_ID", ТекСтрокаДерева.РемонтнаяРабота, ТекСтрокаДерева.ID, ТекСтрокаДерева.Родитель_ID), Истина);
		Если СтрокиДерева.Количество() Тогда
			СтрокаДерева = СтрокиДерева[0];
			Если ТипЗнч(СтрокаДерева.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
				Пока ТипЗнч(СтрокаДерева.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Цикл
					СтрокаДерева = СтрокаДерева.Родитель;
				КонецЦикла;
			КонецЕсли;
			
			СтрокаРодитель = СтрокаДерева;
			
			РемонтыОборудования_ID = ТекСтрокаРемонтаID;
			
			ТекущиеДанные = Новый Структура("ТекущийРемонт_ID, СтрокаРодитель_ID, СтрокаРодительРемонтыОборудования_ID, СтрокаРодительРодитель_ID",
			РемонтыОборудования_ID,СтрокаРодитель.ID, СтрокаРодитель.РемонтыОборудования_ID, СтрокаРодитель.Родитель_ID);
			
			ОбработкаВыбораРемонтаНаСервере(Дерево, ДокОбъект, ТекСтрока, ТекущиеДанные);
			
		КонецЕсли;
		
	Иначе
		
		Если УвеличиватьКоличествоОпераций Тогда 
			
			УвеличиватьКоличествоОперацийНаСервере(Дерево, ДокОбъект, ТекСтрока, ТекСтрокаРемонтаID);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыборкаСтрокиРемРаботИзПредписанийНаСервере(ВыбранноеЗначение, ТекСтрокаРемонтаID, ТекСтрокаДерева, УвеличиватьКоличествоОпераций)
	
	Дерево = РеквизитФормыВЗначение("ДеревоРемонтныхРабот");
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	Для Каждого ТекСтрока из ВыбранноеЗначение.МассивСтрокРемонтныхРабот Цикл
		ДанныеТекСтроки = Новый Структура("ID, РемонтыОборудования_ID, Родитель_ID, РемонтнаяРабота, Количество", 
		ТекСтрока.ID, ТекСтрока.РемонтыОборудования_ID, ТекСтрока.Родитель_ID, ТекСтрока.РемонтнаяРабота, ТекСтрока.Количество);
		ОбработкаВыборкаСтрокиРемРаботИзПредписаний(ДокОбъект, Дерево, ВыбранноеЗначение,ДанныеТекСтроки,ТекСтрокаРемонтаID, ТекСтрокаДерева, УвеличиватьКоличествоОпераций);
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Дерево, "ДеревоРемонтныхРабот");
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект"); 
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораРемонтаНаСервере(Дерево, ДокОбъект, ТекСтрока, ТекущиеДанные)
	
	РемонтыОборудования_ID = ТекущиеДанные.ТекущийРемонт_ID;
	МассивСтрок = Дерево.Строки.НайтиСтроки(
	Новый Структура("ID, РемонтыОборудования_ID, Родитель_ID", 
	ТекущиеДанные.СтрокаРодитель_ID, 
	ТекущиеДанные.СтрокаРодительРемонтыОборудования_ID , 
	ТекущиеДанные.СтрокаРодительРодитель_ID), Истина);
	
	Если МассивСтрок.Количество() > 0 Тогда
		
		СтрокаДереваРодитель = МассивСтрок[0];
		СтрокаДерева = СтрокаДереваРодитель.Строки.Добавить();
		СтрокаДерева.ID = Новый УникальныйИдентификатор;
		СтрокаДерева.Родитель_ID     = ТекущиеДанные.СтрокаРодитель_ID;
		СтрокаДерева.РемонтнаяРабота = ТекСтрока.РемонтнаяРабота;
		СтрокаДерева.Картинка        = торо_Ремонты.ИндексКартинкиДереваРемонтныхРабот(ТекСтрока.РемонтнаяРабота);
		СтрокаДерева.РемонтыОборудования_ID = ?(РемонтыОборудования_ID = "", ТекущиеДанные.СтрокаРодительРемонтыОборудования_ID, РемонтыОборудования_ID);
		СтрокаДерева.Количество = ТекСтрока.Количество;	
		
		ЗаполнитьЗначенияСвойств(ДокОбъект.РемонтныеРаботы.Добавить(), СтрокаДерева);
		
		ТЧ = ТекСтрока.РемонтнаяРабота["ТрудовыеЗатраты"];
		
		Для Каждого СтрокаТЧ Из ТЧ Цикл
			Если СтрокаТЧ.Количество <> 0 Тогда
				Для Счетчик = 1 По СтрокаТЧ.Количество Цикл
					НовСтрокаТЧ    = ДокОбъект.Исполнители.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрокаТЧ, СтрокаТЧ);
					НовСтрокаТЧ.ID = СтрокаДерева.ID;
					НовСтрокаТЧ.РемонтыОборудования_ID = СтрокаДерева.РемонтыОборудования_ID;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура УвеличиватьКоличествоОперацийНаСервере(Дерево, ДокОбъект, ТекСтрока, ТекСтрокаРемонтаID)
	
	МассивСтрокДерева = Дерево.Строки.НайтиСтроки(Новый Структура("РемонтыОборудования_ID,РемонтнаяРабота",ТекСтрокаРемонтаID, ТекСтрока.РемонтнаяРабота),Истина);
	
	Для каждого ТекСтрокаДерева Из МассивСтрокДерева Цикл
		ТекСтрокаДерева.Количество = ТекСтрокаДерева.Количество + ТекСтрока.Количество;
		
		ID = ТекСтрокаДерева.ID;
		СтрТЧ = Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("ID", ID));
		Если СтрТЧ.Количество() Тогда
			
			КоличествоБуфер = СтрТЧ[0].Количество;
			Коэффициент = ?(КоличествоБуфер = 0, 1, (СтрТЧ[0].Количество + ТекСтрока.Количество) / КоличествоБуфер);
			СтрТЧ[0].Количество = СтрТЧ[0].Количество + ТекСтрока.Количество;
			
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзЛотовНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_ЗапланированныеПодрядчикиРемонтовСрезПоследних.ID КАК РемонтыОборудования_ID,
	|	торо_ЗапланированныеПодрядчикиРемонтовСрезПоследних.Подрядчик КАК Исполнитель,
	|	торо_ЗапланированныеПодрядчикиРемонтовСрезПоследних.ДоговорПодрядчика КАК УточнениеИсполнителя,
	|	торо_ЗапланированныеПодрядчикиРемонтовСрезПоследних.Регистратор.Сумма КАК Сумма,
	|	торо_ЗапланированныеПодрядчикиРемонтовСрезПоследних.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрСведений.торо_ЗапланированныеПодрядчикиРемонтов.СрезПоследних(, ID В (&СписокID)) КАК торо_ЗапланированныеПодрядчикиРемонтовСрезПоследних";
	
	Запрос.УстановитьПараметр("СписокID", Объект.РемонтыОборудования.Выгрузить(,"ID"));
	
	ВыборкаИсполнителей = Запрос.Выполнить().Выбрать();
	
	СтруктураПоискаИсполнителей = Новый Структура("РемонтыОборудования_ID, Исполнитель, УточнениеИсполнителя");
	
	Пока ВыборкаИсполнителей.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураПоискаИсполнителей, ВыборкаИсполнителей);
		ИсполнителиПоРемонтам = Объект.ИсполнителиПоРемонтам.НайтиСтроки(СтруктураПоискаИсполнителей);
		
		Если ИсполнителиПоРемонтам.Количество() = 0 Тогда
			НоваяСтрока = Объект.ИсполнителиПоРемонтам.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаИсполнителей); 
		Иначе
			Для каждого Строка из ИсполнителиПоРемонтам Цикл
				Строка.Сумма = ВыборкаИсполнителей.Сумма;
			КонецЦикла;
		КонецЕсли;
		
		СписокТехКарт = Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", ВыборкаИсполнителей.РемонтыОборудования_ID));
		Для Каждого ТехКарта Из СписокТехКарт Цикл
			Если ТипЗнч(ТехКарта.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда
				Если НЕ ЗначениеЗаполнено(ТехКарта.Исполнитель) Тогда
					ТехКарта.Исполнитель = ВыборкаИсполнителей.Исполнитель;
					ТехКарта.ДоговорБригада = ВыборкаИсполнителей.УточнениеИсполнителя;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзЛотов(Команда)
	
	ЗаполнитьИзЛотовНаСервере();
	
	ТекущиеДанные = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		ЗаполнитьДеревоРемонтныхРаботНаСервере(ТекущиеДанные.ID);
		Элементы.ДеревоРемонтныхРабот.Развернуть(ДеревоРемонтныхРабот.ПолучитьЭлементы()[0].ПолучитьИдентификатор(),Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборыСвязанныхТаблицРемонты()
	
	ТекДанные = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		//СтруктураОтбораID =  Новый ФиксированнаяСтруктура("РемонтыОборудования_ID",ТекДанные.ID);
		Элементы.ИсполнителиПоРемонтам.ОтборСтрок = Новый ФиксированнаяСтруктура("РемонтыОборудования_ID", ТекДанные.ID);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыВыбораДоговораБригады(Исполнитель, ЭлементДоговорБригада, ОтборПоСсылке = Неопределено)
	
	ПараметрыВыбораМассив = Новый Массив;
	МассивТипов = Новый Массив;
	
	Если ТипЗнч(Исполнитель) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		ПараметрыВыбораМассив.Добавить(Новый ПараметрВыбора("Отбор.Контрагент", Исполнитель));
		ПараметрыВыбораМассив.Добавить(Новый ПараметрВыбора("Отбор.Организация", Объект.Организация));
		МассивТипов.Добавить(Тип("СправочникСсылка.ДоговорыКонтрагентов"));
		
	ИначеЕсли ТипЗнч(Исполнитель) = Тип("СправочникСсылка.СтруктураПредприятия") Тогда
		
		ПараметрыВыбораМассив.Добавить(Новый ПараметрВыбора("Отбор.Подразделение", Исполнитель));
		МассивТипов.Добавить(Тип("СправочникСсылка.торо_РемонтныеБригады"));
		
	КонецЕсли;
	
	Если ОтборПоСсылке <> Неопределено Тогда
		ПараметрыВыбораМассив.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(ОтборПоСсылке)));
	КонецЕсли;
	
	ЭлементДоговорБригада.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораМассив);
	ЭлементДоговорБригада.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыВыбораДоговораБригады_ДляРемонтныхРабот(Исполнитель, РемонтыОборудования_ID)
	
	СтруктураПоиска = Новый Структура("РемонтыОборудования_ID, Исполнитель", РемонтыОборудования_ID, Исполнитель);
	СтрокиИсполнителей = Объект.ИсполнителиПоРемонтам.НайтиСтроки(СтруктураПоиска);
	
	ОтборПоСсылке = Новый Массив;
	Для каждого Строка из СтрокиИсполнителей Цикл
		ОтборПоСсылке.Добавить(Строка.УточнениеИсполнителя);
	КонецЦикла;
	
	УстановитьПараметрыВыбораДоговораБригады(Исполнитель, Элементы.ДеревоРемонтныхРаботДоговорБригада, ОтборПоСсылке);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыВыбораИсполнителя_ДляРемонтныхРабот(РемонтыОборудования_ID)
	
	СтруктураПоиска = Новый Структура("РемонтыОборудования_ID", РемонтыОборудования_ID);
	СтрокиИсполнителей = Объект.ИсполнителиПоРемонтам.НайтиСтроки(СтруктураПоиска);

	ОтборПоСсылке = Новый Массив;
	Для каждого Строка из СтрокиИсполнителей Цикл
		ОтборПоСсылке.Добавить(Строка.Исполнитель);
	КонецЦикла;

	ПараметрыВыбораМассив = Новый Массив;
	ПараметрыВыбораМассив.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(ОтборПоСсылке)));
	ПараметрыВыбораМассив.Добавить(Новый ПараметрВыбора("РежимОтображенияСписка", "Список"));
	Элементы.ДеревоРемонтныхРаботИсполнитель.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораМассив);
	
КонецПроцедуры

&НаКлиенте
Функция НайтиРемонтныеРаботыДляОчисткиИсполнителей(РемонтыОборудования_ID, ИдентификаторИсключаемойСтроки)
	
	МассивОтобранныхСтрок = Новый Массив;
	МассивСтрокДерева = Новый Массив;
	торо_РаботаССогласованиямиКлиентСервер.ЗаполнитьМассивИзДерева(МассивСтрокДерева, ДеревоРемонтныхРабот.ПолучитьЭлементы());

	Если МассивСтрокДерева.Количество() <=1 Тогда
		Возврат МассивОтобранныхСтрок;
	КонецЕсли;
	
	ВсеИсполнителиРемонта = Объект.ИсполнителиПоРемонтам.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", РемонтыОборудования_ID));
	МассивИсполнителей = Новый Массив;
	МассивДоговоров = Новый Массив;
	
	Для каждого Строка из ВсеИсполнителиРемонта Цикл
		Если Строка.ПолучитьИдентификатор() = ИдентификаторИсключаемойСтроки Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Строка.Исполнитель) Тогда
			МассивИсполнителей.Добавить(Строка.Исполнитель);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Строка.УточнениеИсполнителя) Тогда
			МассивДоговоров.Добавить(Строка.УточнениеИсполнителя);
		КонецЕсли;
	КонецЦикла;
		
	Для каждого Строка из МассивСтрокДерева Цикл
		Если ЗначениеЗаполнено(Строка.Исполнитель) И МассивИсполнителей.Найти(Строка.Исполнитель) = Неопределено
			ИЛИ ЗначениеЗаполнено(Строка.ДоговорБригада) И МассивДоговоров.Найти(Строка.ДоговорБригада) = Неопределено Тогда
			МассивОтобранныхСтрок.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивОтобранныхСтрок;
	
КонецФункции

&НаКлиенте
Функция НайтиРемонтныеРаботыДляОчисткиДоговораБригады(РемонтыОборудования_ID, ИдентификаторИсключаемойСтроки)
	
	МассивОтобранныхСтрок = Новый Массив;
	МассивСтрокДерева = Новый Массив;
	торо_РаботаССогласованиямиКлиентСервер.ЗаполнитьМассивИзДерева(МассивСтрокДерева, ДеревоРемонтныхРабот.ПолучитьЭлементы());

	Если МассивСтрокДерева.Количество() <=1 Тогда
		Возврат МассивОтобранныхСтрок;
	КонецЕсли;
	
	ВсеИсполнителиРемонта = Объект.ИсполнителиПоРемонтам.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", РемонтыОборудования_ID));
	МассивДоговоров = Новый Массив;
	
	Для каждого Строка из ВсеИсполнителиРемонта Цикл
		Если Строка.ПолучитьИдентификатор() = ИдентификаторИсключаемойСтроки Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Строка.УточнениеИсполнителя) Тогда
			МассивДоговоров.Добавить(Строка.УточнениеИсполнителя);
		КонецЕсли;
	КонецЦикла;
		
	Для каждого Строка из МассивСтрокДерева Цикл
		Если ЗначениеЗаполнено(Строка.ДоговорБригада) И МассивДоговоров.Найти(Строка.ДоговорБригада) = Неопределено Тогда
			МассивОтобранныхСтрок.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивОтобранныхСтрок;
	
КонецФункции

&НаКлиенте 
Процедура ОбработкаВыбораПослеВопроса(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	МассивИДРемонтов = ДополнительныеПараметры.МассивИДДобавленныхРемонтов;
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Для каждого ЭлементМассива из МассивИДРемонтов Цикл
			ОчиститьСвязанныеТабличныеЧасти(, , ЭлементМассива);
		КонецЦикла;
		
		ОбработкаВыбораЗавершение(ДополнительныеПараметры.ВыбранноеЗначение)
		
	КонецЕсли;	
	
КонецПроцедуры 

&НаКлиенте 
Процедура ОбработкаВыбораЗавершение(ВыбранноеЗначение)
	
	ДеревоРемонтныхРаботОбработкаВыбора(, ВыбранноеЗначение, );
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") И ВыбранноеЗначение.Свойство("СтрокаРемонтовОборудования") Тогда
		//Если ТипЗнч(ВыбранноеЗначение.ДокументОснование) = Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот") Тогда
		Если Не ТипЗнч(ВыбранноеЗначение.ДокументОснование) = Тип("ДокументСсылка.торо_ВыявленныеДефекты") Тогда
			УстановкаИсполнителей(ВыбранноеЗначение);
		КонецЕсли;
	КонецЕсли;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		Для каждого Элемент Из ВыбранноеЗначение Цикл
			//Если ТипЗнч(Элемент.ДокументОснование) = Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот") Тогда
			Если Не ТипЗнч(Элемент.ДокументОснование) = Тип("ДокументСсылка.торо_ВыявленныеДефекты") Тогда
				ЗаполнитьДеревоРемонтныхРаботНаСервере(Элемент.СтрокаРемонтовОборудования.ID);
				УстановкаИсполнителей(Элемент);
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли;
	ЭтоПервыйДокументВЦепочке = ЭтоПервыйДокументВЦепочке();
	ЭтоПоследнийДокументВЦепочке = ЭтоПоследнийДокументВЦепочке();
	РемонтыОборудованияОбновитьДокументыИсточники();
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
	
КонецПроцедуры

// >> [Деснол] [Ушаков А.Д.] [03.10.2019] 
&НаКлиентеНаСервереБезКонтекста
Функция дс_ПолучитьПредставлениеКорневойРемонтнойРаботы()
	Возврат НСтр("es='Los trabajos de reparación';ru='Ремонтные работы';en='Repair work'");
КонецФункции

&НаСервере
Процедура дс_ЛокализоватьУсловноеОформление()
	ИмяРеквизита = дс_ДобавитьРеквизитПредставленияКорневойРаботы();
	ЭтаФорма.дс_КорневаяРабота = дс_ПолучитьПредставлениеКорневойРемонтнойРаботы();
	дс_ЗаменитьКорневуюРаботуВУО("Ремонтные работы", ИмяРеквизита);
КонецПроцедуры

&НаСервере
Процедура дс_ЗаменитьКорневуюРаботуВУО(ИсходноеПоле, КонечноеПоле)
	Для каждого ЭлементУО Из УсловноеОформление.Элементы Цикл
		Если СтрНайти(Строка(ЭлементУО.Отбор), ИсходноеПоле) > 0 Тогда
			ТекущийОтбор = ЭлементУО.Отбор;
			ТекущийОтбор.Элементы[0].ПравоеЗначение = Новый ПолеКомпоновкиДанных(КонечноеПоле)
		КонецЕсли; 
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция дс_ДобавитьРеквизитПредставленияКорневойРаботы()
	НовыеРеквизиты = Новый Массив;
	ИмяРеквизита = "дс_КорневаяРабота";
	дс_КорневаяРабота = Новый РеквизитФормы(ИмяРеквизита, Новый ОписаниеТипов("Строка"));
	НовыеРеквизиты.Добавить(дс_КорневаяРабота);
	ИзменитьРеквизиты(НовыеРеквизиты);
	
	Возврат ИмяРеквизита;
КонецФункции 

&НаКлиенте
Процедура РемонтыОборудованияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиПоРемонтамПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	// Вставить содержимое обработчика.
КонецПроцедуры
// << [Деснол] [Ушаков А.Д.] [03.10.2019] 

фПослеОчистки = Ложь;
РемонтОборудованияУдаляется = Ложь;
#КонецОбласти

