///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Отправляет SMS через GSM-INFORM.
//
// Параметры:
//  НомераПолучателей - Массив - номера получателей в формате +7ХХХХХХХХХХ;
//  Текст 			  - Строка - текст сообщения, длиной не более 480 символов;
//  ИмяОтправителя 	  - Строка - имя отправителя, которое будет отображаться вместо номера входящего SMS;
//  Логин			  - Строка - логин пользователя услуги отправки sms;
//  Пароль			  - Строка - пароль пользователя услуги отправки sms.
//
// Возвращаемое значение:
//  Структура: ОтправленныеСообщения - Массив структур: НомерОтправителя.
//                                                  ИдентификаторСообщения.
//             ОписаниеОшибки        - Строка - пользовательское представление ошибки, если пустая строка,
//                                          то ошибки нет.
Функция ОтправитьSMS(НомераПолучателей, Текст, ИмяОтправителя, Логин, Пароль) Экспорт
	
	Результат = Новый Структура("ОтправленныеСообщения,ОписаниеОшибки", Новый Массив, "");
	
	// Подготовка строки получателей.
	СтрокаПолучателей = МассивПолучателейСтрокой(НомераПолучателей);
	
	// Проверка на заполнение обязательных параметров.
	Если ПустаяСтрока(СтрокаПолучателей) Или ПустаяСтрока(Текст) Тогда
		Результат.ОписаниеОшибки = НСтр("es='Los parámetros equivocados del mensaje';ru='Неверные параметры сообщения';en='Invalid message options'");
		Возврат Результат;
	КонецЕсли;
	
	// Подготовка параметров запроса.
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("id", Логин);
	ПараметрыЗапроса.Вставить("api_key", Пароль);
	
	ПараметрыЗапроса.Вставить("cmd", "send");
	ПараметрыЗапроса.Вставить("message", Текст);
	ПараметрыЗапроса.Вставить("to", СтрокаПолучателей);
	ПараметрыЗапроса.Вставить("sender", ИмяОтправителя);
	
	// отправка запроса
	Ответ = ВыполнитьЗапрос(ПараметрыЗапроса);
	Если Ответ = Неопределено Тогда
		Результат.ОписаниеОшибки = Результат.ОписаниеОшибки + НСтр("es='La unión no es establecida';ru='Соединение не установлено';en='Connection failed'");
		Возврат Результат;
	КонецЕсли;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Ответ);
	ОтветСервера = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Если ОтветСервера["error_no"] = 0 Тогда
		Для Каждого Элемент Из ОтветСервера["items"] Цикл
			Если Элемент["error_no"] = 0 Тогда
				ОтправленноеСообщение = Новый Структура("НомерПолучателя,ИдентификаторСообщения", Элемент["phone"], Формат(Элемент["sms_id"], "ЧГ=0"));
				Результат.ОтправленныеСообщения.Добавить(ОтправленноеСообщение);
			Иначе
				КодОшибки = Элемент["error_no"];
				Результат.ОписаниеОшибки = Результат.ОписаниеОшибки + Элемент["phone"] + ": " + ОписаниеОшибкиПолученияСтатуса(КодОшибки) + Символы.ПС;
			КонецЕсли;
		КонецЦикла;
		Если Не ПустаяСтрока(Результат.ОписаниеОшибки) Тогда
			Результат.ОписаниеОшибки = НСтр("es='No consiguió enviar SMS';ru='Не удалось отправить SMS';en='Failed to send SMS'") + ":" + СокрП(Результат.ОписаниеОшибки);
		КонецЕсли;
	Иначе
		Результат.ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("es='No consiguió enviar SMS: "
"%1 (el código de la falta: %2)';ru='Не удалось отправить SMS:"
"%1 (код ошибки: %2)';en='Failed to send SMS:"
"%1 (error code: %2) '"), ОписаниеОшибкиОтправки(ОтветСервера["error_no"]), ОтветСервера["error_no"]);
			
		ЗаписьЖурналаРегистрации(НСтр("es='El envío SMS';ru='Отправка SMS';en='SMS sending'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , , Результат.ОписаниеОшибки);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает текстовое представление статуса доставки сообщения.
//
// Параметры:
//  ИдентификаторСообщения - Строка - идентификатор, присвоенный sms при отправке;
//  НастройкиОтправкиSMS   - Структура - см. ОтправкаSMSПовтИсп.НастройкиОтправкиSMS;
//
// Возвращаемое значение:
//  Строка - статус доставки. См. описание функции ОтправкаSMS.СтатусДоставки.
Функция СтатусДоставки(ИдентификаторСообщения, НастройкиОтправкиSMS) Экспорт
	Логин = НастройкиОтправкиSMS.Логин;
	Пароль = НастройкиОтправкиSMS.Пароль;
	
	// Подготовка параметров запроса.
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("id", Логин);
	ПараметрыЗапроса.Вставить("api_key", Пароль);
	ПараметрыЗапроса.Вставить("sms_id", ИдентификаторСообщения);
	ПараметрыЗапроса.Вставить("cmd", "status");
	
	// отправка запроса
	Ответ = ВыполнитьЗапрос(ПараметрыЗапроса);
	Если Ответ = Неопределено Тогда
		Возврат "Ошибка";
	КонецЕсли;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Ответ);
	ОтветСервера = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	ОписаниеОшибки = "";
	КодОшибки = Неопределено;
	Результат = "Ошибка";
	
	Если ОтветСервера["error_no"] = 0 Тогда
		Для Каждого Элемент Из ОтветСервера["items"] Цикл
			Если Элемент.Свойство("error_no") Тогда
				КодОшибки = Элемент["error_no"];
				Прервать;
			Иначе
				Результат = СтатусДоставкиSMS(Элемент["status_no"]);
			КонецЕсли;
		КонецЦикла;
	Иначе
		КодОшибки = ОтветСервера["error_no"];
	КонецЕсли;
	
	Если КодОшибки <> Неопределено Тогда
		ОписаниеОшибки = ОписаниеОшибкиПолученияСтатуса(КодОшибки);
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("es='No consiguió recibir el estatus de la entrega SMS (id: ""%3""): "
"%1 (el código de la falta: %2)';ru='Не удалось получить статус доставки SMS (id: ""%3""):"
"%1 (код ошибки: %2)';en='Failed to get SMS delivery status (id:"" ""%3"" ""):"
"%1 (error code:%2)'"), ОписаниеОшибки, КодОшибки, ИдентификаторСообщения);
		ЗаписьЖурналаРегистрации(НСтр("es='El envío SMS';ru='Отправка SMS';en='SMS sending'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , , Комментарий);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтатусДоставкиSMS(КодСостояния)
	СоответствиеСтатусов = Новый Соответствие;
	СоответствиеСтатусов.Вставить("1", "Отправлено");
	СоответствиеСтатусов.Вставить("2", "Доставлено");
	СоответствиеСтатусов.Вставить("3", "НеДоставлено");
	СоответствиеСтатусов.Вставить("4", "Отправляется");
	СоответствиеСтатусов.Вставить("6", "НеДоставлено");
	СоответствиеСтатусов.Вставить("7", "НеОтправлялось");
	СоответствиеСтатусов.Вставить("8", "Отправляется");
	СоответствиеСтатусов.Вставить("9", "НеОтправлено");
	СоответствиеСтатусов.Вставить("10", "Отправляется");
	СоответствиеСтатусов.Вставить("11", "Отправлено");
	
	Результат = СоответствиеСтатусов[КодСостояния];
	Возврат ?(Результат = Неопределено, "НеОтправлялось", Результат);
КонецФункции

Функция ОписанияОшибок()
	Результат = Новый Соответствие;
	Результат.Вставить(1, НСтр("es='La API-llave equivocada.';ru='Неверный API-ключ.';en='Invalid API key.'"));
	Результат.Вставить(2, НСтр("es='La orden desconocida.';ru='Неизвестная команда.';en='Unknown command.'"));
	Результат.Вставить(3, НСтр("es='La API-llave equivocada.';ru='Неверный API-ключ.';en='Invalid API key.'"));
	Результат.Вставить(4, НСтр("es='La orden desconocida.';ru='Неизвестная команда.';en='Unknown command.'"));
	Результат.Вставить(5, НСтр("es='El usuario con indicado ID del gabinete no es encontrado.';ru='Пользователь с указанным ID кабинета не найден.';en='User with the specified cabinet ID was not found.'"));
	Результат.Вставить(6, НСтр("es='La lista vacía de teléfonos para el envío de los mensajes.';ru='Пустой список телефонов для отправки сообщений.';en='An empty phone list for sending messages.'"));
	Результат.Вставить(7, НСтр("es='del mensaje.';ru='Не указан текст сообщения.';en='Message text not specified.'"));
	Результат.Вставить(8, НСтр("es='No consiguió enviar el mensaje al número indicado.';ru='Не удалось отправить сообщение на указанный номер.';en='Failed to send a message to the specified number.'"));
	Результат.Вставить(9, НСтр("es='el tráfico de prioridad.';ru='Не указан отправитель по приоритетному трафику.';en='Priority traffic sender not specified.'"));
	Результат.Вставить(10, НСтр("es='identificador.';ru='Не найдено сообщение с таким идентификатором.';en='No message was found with this identifier.'"));
	Результат.Вставить(11, НСтр("es='No consiguió pagar el envío, comprueben el equilibrio.';ru='Не удалось оплатить рассылку, проверьте баланс.';en='Failed to pay for newsletter, check balance.'"));
	
	Возврат Результат;
КонецФункции

Функция ОписаниеОшибкиОтправки(КодОшибки)
	ОписанияОшибок = ОписанияОшибок();
	ТекстСообщения = ОписанияОшибок[КодОшибки];
	Если ТекстСообщения = Неопределено Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("es='El mensaje no es enviado (el código de la falta: %1).';ru='Сообщение не отправлено (код ошибки: %1).';en='Message not sent (error code:%1).'"), КодОшибки);
	КонецЕсли;
	Возврат ТекстСообщения;
КонецФункции

Функция ОписаниеОшибкиПолученияСтатуса(КодОшибки)
	ОписанияОшибок = ОписанияОшибок();
	ТекстСообщения = ОписанияОшибок[КодОшибки];
	Если ТекстСообщения = Неопределено Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("es='El estatus del mensaje no es recibido (el código de la falta: %1).';ru='Статус сообщения не получен (код ошибки: %1).';en='Message status not received (error code:%1).'"), КодОшибки);
	КонецЕсли;
	Возврат ТекстСообщения;
КонецФункции

Функция ВыполнитьЗапрос(ПараметрыЗапроса)
	
	HTTPЗапрос = ОтправкаSMS.ПодготовитьHTTPЗапрос("/api/", ПараметрыЗапроса);
	HTTPОтвет = Неопределено;
	
	Попытка
		Соединение = Новый HTTPСоединение("gsm-inform.ru",,,, 
			ПолучениеФайловИзИнтернета.ПолучитьПрокси("http"), 
			60);
		HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("es='El envío SMS';ru='Отправка SMS';en='SMS sending'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Если HTTPОтвет <> Неопределено Тогда
		Возврат HTTPОтвет.ПолучитьТелоКакСтроку();
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция МассивПолучателейСтрокой(Массив)
	Получатели = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Получатели, Массив, Истина);
	
	Результат = "";
	Для Каждого Получатель Из Получатели Цикл
		Номер = ФорматироватьНомер(Получатель);
		Если НЕ ПустаяСтрока(Номер) Тогда 
			Если Не ПустаяСтрока(Результат) Тогда
				Результат = Результат + ",";
			КонецЕсли;
			Результат = Результат + Номер;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

Функция ФорматироватьНомер(Номер)
	Результат = "";
	ДопустимыеСимволы = "+1234567890";
	Для Позиция = 1 По СтрДлина(Номер) Цикл
		Символ = Сред(Номер,Позиция,1);
		Если СтрНайти(ДопустимыеСимволы, Символ) > 0 Тогда
			Результат = Результат + Символ;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;	
КонецФункции

// Возвращает список разрешений для отправки SMS с использованием всех доступных провайдеров.
//
// Возвращаемое значение:
//  Массив.
//
Функция Разрешения() Экспорт
	
	Протокол = "HTTP";
	Адрес = "gsm-inform.ru";
	Порт = Неопределено;
	Описание = НСтр("es='El envío SMS a través de ""INFORM GSM"".';ru='Отправка SMS через ""GSM-INFORM"".';en='Sending SMS via ""GSM-INFORM"".'");
	
	МодульРаботаВБезопасномРежиме = ОбщегоНазначения.ОбщийМодуль("РаботаВБезопасномРежиме");
	
	Разрешения = Новый Массив;
	Разрешения.Добавить(
		МодульРаботаВБезопасномРежиме.РазрешениеНаИспользованиеИнтернетРесурса(Протокол, Адрес, Порт, Описание));
	
	Возврат Разрешения;
КонецФункции

Процедура ПриОпределенииНастроек(Настройки) Экспорт
	
	Настройки.АдресОписанияУслугиВИнтернете = "http://gsm-inform.ru";
	Настройки.ПриОпределенииСпособовАвторизации = Истина;
	
КонецПроцедуры

Процедура ПриОпределенииСпособовАвторизации(СпособыАвторизации) Экспорт
	
	СпособыАвторизации.Очистить();
	
	ПоляАвторизации = Новый СписокЗначений;
	ПоляАвторизации.Добавить("Логин", НСтр("es='ID del gabinete';ru='ID кабинета';en='Cabinet ID'"));
	ПоляАвторизации.Добавить("Пароль", НСтр("es='La API-llave';ru='API-ключ';en='API-key'"));
	
	СпособыАвторизации.Вставить("ПоКлючу", ПоляАвторизации);
	
КонецПроцедуры

#КонецОбласти

