///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2018, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Общего назначения

// Определяет возможность использования Монитора
// в соответствии с текущим режимом работы информационной базы
// и правами пользователя.
//
// Возвращаемое значение:
//	Булево - Истина - возможно использование, Ложь - в противном случае.
//
Функция ДоступноИспользованиеМонитора() Экспорт
	
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ПравоДоступа("Просмотр", Метаданные.Обработки.МониторПортала1СИТС);
	
КонецФункции

#Область ИнтеграцияСБиблиотекойСтандартныхПодсистем

// Добавляет необходимые параметры работы клиента при запуске.
// Добавленные параметры доступны в
// СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиентаПриЗапуске().ИнтернетПоддержкаПользователей.<ИмяПараметра>;
// Используется в том случае, если подсистема реализует сценарий, выполняемый
// при начале работы системы.
// Вызывается из ИнтернетПоддержкаПользователей.ПараметрыРаботыКлиентаПриЗапуске().
//
// Параметры:
//	Параметры - Структура - заполняемые параметры;
//
Процедура ПараметрыРаботыКлиентаПриЗапуске(Параметры) Экспорт
	
	Если Не ДоступноИспользованиеМонитора() Тогда
		Возврат;
	КонецЕсли;
	
	ОбщиеПараметры = ОбщиеПараметрыМонитора();
	Если Не ОбщиеПараметры.ИспользоватьОтображениеПриНачалеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	ИнтернетПоддержкаПодключена =
		ИнтернетПоддержкаПользователей.ЗаполненыДанныеАутентификацииПользователяИнтернетПоддержки();
	Если ИнтернетПоддержкаПодключена Тогда
		ЗначениеНастройкиПоказыватьПриНачалеРаботы = ЗначениеНастройкиПоказыватьПриНачалеРаботы();
		Если ЗначениеНастройкиПоказыватьПриНачалеРаботы = 2 Тогда
			// Никогда не показывать при начале работы.
			Возврат;
		КонецЕсли;
	Иначе
		// Если Интернет-поддержка не подключена.
		Если ИнтернетПоддержкаПользователей.ДоступноПодключениеИнтернетПоддержки() Тогда
			// Есть право подключения Интернет-поддержки - при начале работы
			// будет предложено подключить Интернет-поддержку.
			ЗначениеНастройкиПоказыватьПриНачалеРаботы = ЗначениеНастройкиПоказыватьПриНачалеРаботы();
			Если ЗначениеНастройкиПоказыватьПриНачалеРаботы = 2 Тогда
				// Никогда не показывать при начале работы.
				Возврат;
			КонецЕсли;
		Иначе
			// Нет права подключения Интернет-поддержки - не обрабатывать
			// событие начала работы с программой.
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыМонитора = Новый Структура;
	ПараметрыМонитора.Вставить("ПоказыватьПриНачалеРаботы"  , Истина);
	ПараметрыМонитора.Вставить("ИнтернетПоддержкаПодключена", ИнтернетПоддержкаПодключена);
	ПараметрыМонитора.Вставить("ПриНаличииНовойИнформации", (ЗначениеНастройкиПоказыватьПриНачалеРаботы = 1));
	Параметры.Вставить("МониторПортала1СИТС", ПараметрыМонитора);
	
КонецПроцедуры

// Интеграция с подсистемой СтандартныеПодсистемы.БазоваяФункциональность.
//
Процедура ПриЗаполненииРазрешенийНаДоступКВнешнимРесурсам(ЗапросыРазрешений) Экспорт
	
	НовыеРазрешения = Новый Массив;
	
	Разрешение = РаботаВБезопасномРежиме.РазрешениеНаИспользованиеИнтернетРесурса(
		"HTTPS",
		ХостСервиса(0),
		443,
		НСтр("es='El servicio el Monitor del Portal 1С:ИТС (la zona ru)';ru='Сервис Монитор Портала 1С:ИТС (зона ru)';en='Service Portal Monitor 1C: ITS (zone ru)'"));
	НовыеРазрешения.Добавить(Разрешение);
	
	Разрешение = РаботаВБезопасномРежиме.РазрешениеНаИспользованиеИнтернетРесурса(
		"HTTPS",
		ХостСервиса(1),
		443,
		НСтр("es='El servicio el Monitor del Portal 1С:ИТС (la zona eu)';ru='Сервис Монитор Портала 1С:ИТС (зона eu)';en='Service Portal Monitor 1C: ITS (eu zone)'"));
	НовыеРазрешения.Добавить(Разрешение);
	
	ЗапросыРазрешений.Добавить(РаботаВБезопасномРежиме.ЗапросНаИспользованиеВнешнихРесурсов(НовыеРазрешения));
	
КонецПроцедуры

// См. процедуру
// ОбщегоНазначенияПереопределяемый.ПриДобавленииПереименованийОбъектовМетаданных().
//
Процедура ПриДобавленииПереименованийОбъектовМетаданных(Итог) Экспорт
	
	ОбщегоНазначения.ДобавитьПереименование(
		Итог,
		"2.2.5.1",
		"Подсистема.ИнтернетПоддержкаПользователей.Подсистема.МониторИнтернетПоддержки",
		"Подсистема.ИнтернетПоддержкаПользователей.Подсистема.МониторПортала1СИТС",
		"ИнтернетПоддержкаПользователей");
	
	ОбщегоНазначения.ДобавитьПереименование(
		Итог,
		"2.2.5.1",
		"Роль.ИспользованиеМонитораИПП",
		"Роль.ИспользованиеМонитораПортала1СИТС",
		"ИнтернетПоддержкаПользователей");
	
КонецПроцедуры

// Вызывается из обработчика ПриСозданииНаСервере() панели администрирования
// БСП, выполняется настройку отображения элементов управления для подсистем
// библиотеки ИПП.
//
// Параметры:
//	Форма - УправляемаяФорма - форма панели управления.
//
Процедура ИнтернетПоддержкаИСервисы_ПриСозданииНаСервере(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	Элементы.БИПМониторИнтернетПоддержки.Видимость = ДоступноИспользованиеМонитора();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбщиеПараметрыМонитора() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ИспользоватьОтображениеПриНачалеРаботы", Истина);
	МониторПортала1СИТСПереопределяемый.ПриОпределенииОбщихПараметровМонитора(Результат);
	
	Возврат Результат;
	
КонецФункции

Функция ЗначениеНастройкиПоказыватьПриНачалеРаботы() Экспорт
	
	НастройкаЗапуска = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"ИнтернетПоддержкаПользователей",
		"ВсегдаПоказыватьПриСтартеПрограммы");
	
	Если НастройкаЗапуска = Неопределено Тогда
		Возврат 0; // Всегда
	ИначеЕсли НастройкаЗапуска = Истина Тогда
		ПоказыватьПриОбновлении = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			"ИнтернетПоддержкаПользователей",
			"ПоказПриСтартеТолькоПриИзменении");
		Если ПоказыватьПриОбновлении = Истина Тогда
			Возврат 1; // Только при наличии новой информации.
		Иначе
			Возврат 0; // Всегда
		КонецЕсли;
	Иначе
		Возврат 2; // Никогда
	КонецЕсли;
	
КонецФункции

Функция ОтпечатокДанныхМонитора(Логин, ДанныеМонитора)
	
	Если Логин = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеСтрока =
		Логин
		+ ", "
		+ ЗначениеЗаполнено(ДанныеМонитора.programName) + ", "
		+ ДанныеМонитора.supportConditionsImplStatus.status + ", "
		+ ДанныеМонитора.serviceContractsStatus.status + ", "
		+ ДанныеМонитора.ДоступноОбновление;
	
	Хеширование = Новый ХешированиеДанных(ХешФункция.SHA256);
	Хеширование.Добавить(ДанныеСтрока);
	Возврат Base64Строка(Хеширование.ХешСумма);
	
КонецФункции

Процедура СохранитьОтпечатокДанныхМонитора(Логин, ДанныеМонитора) Экспорт
	
	Если ДанныеМонитора <> Неопределено
		И ДанныеМонитора.authResult.authenticated Тогда
		Отпечаток = ОтпечатокДанныхМонитора(Логин, ДанныеМонитора);
	Иначе
		Отпечаток = Неопределено;
	КонецЕсли;
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		"МониторПортала1СИТС",
		"ОтпечатокДанныхМонитора",
		Лев(Отпечаток, 48));
	
КонецПроцедуры

Функция ДанныеМонитораИзменены(Логин, ДанныеМонитора)
	
	Отпечаток = ОтпечатокДанныхМонитора(Логин, ДанныеМонитора);
	
	Если Отпечаток = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СохраненныйОтпечаток = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"МониторПортала1СИТС",
		"ОтпечатокДанныхМонитора");
	
	Возврат (СохраненныйОтпечаток <> Отпечаток);
	
КонецФункции

Процедура ПроверитьНаличиеНовойИнформацииВФоне(ПараметрыМетода, АдресРезультата) Экспорт
	
	РезультатОперации = ДанныеМонитора();
	Если ПустаяСтрока(РезультатОперации.ИмяОшибки) Тогда
		
		ДанныеМонитора = РезультатОперации.Данные;
		Если ДанныеМонитора.authResult.authenticated Тогда
			
			Если ДанныеМонитора.programName = Неопределено Тогда
				ПоместитьВоВременноеХранилище("НетИзменений", АдресРезультата);
				ЗаписатьИнформациюВЖурналРегистрации(
					НСтр("es='El apoyo de Internet del producto no resulta. "
"No consiguió comprobar la presencia de la nueva información en el servicio del Monitor del Portal 1С:ИТС.';ru='Интернет-поддержка продукта не оказывается."
"Не удалось проверить наличие новой информации в сервисе Монитора Портала 1С:ИТС.';en='Online product support is not provided."
"Failed to check for new information in the Portal Monitor 1C: ITS service.'"));
				Возврат;
			КонецЕсли;
			
			СообщениеОбОшибкеДанных = ОписаниеОшибкиПолученияДанныхМонитора(ДанныеМонитора);
			Если Не ПустаяСтрока(СообщениеОбОшибкеДанных) Тогда
				
				ЗаписатьОшибкуВЖурналРегистрации(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("es='No consiguió comprobar el cambio de la información del Monitor del Portal 1С:ИТС por la falta de la recepción de los datos: "
"%1';ru='Не удалось проверить изменение информации Монитора Портала 1С:ИТС из-за ошибки получения данных:"
"%1';en='Failed to verify the change in the information of the Portal Monitor 1C: ITS due to an error in receiving data:"
"%1'"),
						СообщениеОбОшибкеДанных));
				ПоместитьВоВременноеХранилище("Ошибка", АдресРезультата);
				
			Иначе
				
				Если ДанныеМонитораИзменены(РезультатОперации.Логин, РезультатОперации.Данные) Тогда
					ПоместитьВоВременноеХранилище("ДанныеИзменены", АдресРезультата);
				Иначе
					ПоместитьВоВременноеХранилище("НетИзменений", АдресРезультата);
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			ЗаписатьОшибкуВЖурналРегистрации(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("es='No consiguió comprobar el cambio de la información del Monitor del Portal 1С:ИТС. "
"Son rellenados los datos incorrectos аутентификации. "
"%1';ru='Не удалось проверить изменение информации Монитора Портала 1С:ИТС."
"Заполнены некорректные данные аутентификации."
"%1';en='Failed to verify the change in the information of the Portal Monitor 1C: ITS."
"Incorrect authentication data filled."
"%1'"),
					РезультатОперации.ИнформацияОбОшибке));
			ПоместитьВоВременноеХранилище("Ошибка", АдресРезультата);
			
		КонецЕсли;
		
	ИначеЕсли РезультатОперации.ИмяОшибки = "НеЗаполненыДанныеАутентификации" Тогда
		
		ПоместитьВоВременноеХранилище("НетИзменений", АдресРезультата);
		
	Иначе
		
		ЗаписатьОшибкуВЖурналРегистрации(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("es='No consiguió comprobar el cambio de la información del Monitor del Portal 1С:ИТС. "
"%1';ru='Не удалось проверить изменение информации Монитора Портала 1С:ИТС."
"%1';en='Failed to verify the change in the information of the Portal Monitor 1C: ITS."
"%1'"),
				РезультатОперации.ИнформацияОбОшибке));
		ПоместитьВоВременноеХранилище("Ошибка", АдресРезультата);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ОписаниеОшибкиПолученияДанныхМонитора(ДанныеМонитора) Экспорт
	
	Результат = "";
	
	Если ДанныеМонитора.supportConditionsImplStatus <> Неопределено
		И ДанныеМонитора.supportConditionsImplStatus.blockStatus <> "200"
		И ДанныеМонитора.supportConditionsImplStatus.blockStatus <> 200 Тогда
		Результат = Результат + ?(ПустаяСтрока(Результат), "", Символы.ПС)
			+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("es='- El estado de la ejecución de las condiciones del acompañamiento (blockStatus: %1);';ru='- состояние выполнения условий сопровождения (blockStatus: %1);';en=' -the state of fulfillment of the tracking conditions (blockStatus: %1);'"),
				ДанныеМонитора.supportConditionsImplStatus.blockStatus);
	КонецЕсли;
	
	Если ДанныеМонитора.serviceContractsStatus <> Неопределено
		И ДанныеМонитора.serviceContractsStatus.blockStatus <> "200"
		И ДанныеМонитора.serviceContractsStatus.blockStatus <> 200 Тогда
		Результат = Результат + ?(ПустаяСтрока(Результат), "", Символы.ПС)
			+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("es='- La conexión de los servicios 1С (blockStatus: %1);';ru='- подключение сервисов 1С (blockStatus: %1);';en='-connection of 1C services (blockStatus:% 1);'"),
				ДанныеМонитора.serviceContractsStatus.blockStatus);
	КонецЕсли;
	
	Если ДанныеМонитора.updateInfo <> Неопределено
		И ДанныеМонитора.updateInfo.blockStatus <> "200"
		И ДанныеМонитора.updateInfo.blockStatus <> 200 Тогда
		Результат = Результат + ?(ПустаяСтрока(Результат), "", Символы.ПС)
			+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("es='- La presencia de la renovación del programa (blockStatus: %1);';ru='- наличие обновления программы (blockStatus: %1);';en='-availability of a program update (blockStatus:% 1);'"),
				ДанныеМонитора.updateInfo.blockStatus);
	КонецЕсли;
	
	Если ДанныеМонитора.patchesInfo <> Неопределено
		И ДанныеМонитора.patchesInfo.blockStatus <> "200"
		И ДанныеМонитора.patchesInfo.blockStatus <> 200 Тогда
		Результат = Результат + ?(ПустаяСтрока(Результат), "", Символы.ПС)
			+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("es='- La presencia de las correcciones (патчей) las configuraciones (blockStatus: %1);';ru='- наличие исправлений (патчей) конфигурации (blockStatus: %1);';en='-availability of corrections (patches) of the configuration (blockStatus:% 1);'"),
				ДанныеМонитора.patchesInfo.blockStatus);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаписатьОшибкуВЖурналРегистрации(СообщениеОбОшибке) Экспорт
	
	ЗаписьЖурналаРегистрации(
		ИмяСобытияЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Ошибка,
		,
		,
		СообщениеОбОшибке);
	
КонецПроцедуры

Процедура ЗаписатьПредупреждениеВЖурналРегистрации(СообщениеОбОшибке) Экспорт
	
	ЗаписьЖурналаРегистрации(
		ИмяСобытияЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Предупреждение,
		,
		,
		СообщениеОбОшибке);
	
КонецПроцедуры

Процедура ЗаписатьИнформациюВЖурналРегистрации(СообщениеЖурнала) Экспорт
	
	ЗаписьЖурналаРегистрации(
		ИмяСобытияЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Информация,
		,
		,
		СообщениеЖурнала);
	
КонецПроцедуры

Функция ИмяСобытияЖурналаРегистрации()
	
	Возврат НСтр("es='El monitor del Portal 1С:ИТС';ru='Монитор Портала 1С:ИТС';en='Portal Monitor 1C: ITS'", ОбщегоНазначения.КодОсновногоЯзыка());
	
КонецФункции

#Область ВызовОперацийСервиса

Функция ДанныеМонитора() Экспорт
	
	Результат = НовыйРезультатВызоваОперации();
	
	Если Не ДоступноИспользованиеМонитора() Тогда
		ВызватьИсключение НСтр("es='El uso del Monitor es inaccesible en el régimen corriente del trabajo.';ru='Использование Монитора недоступно в текущем режиме работы.';en='Using the Monitor is not available in the current operating mode.'");
	КонецЕсли;
	
	НастройкиСоединения = ИнтернетПоддержкаПользователей.НастройкиСоединенияССерверами();
	Результат.Вставить("Логин", Неопределено);
	Результат.Вставить("Домен", НастройкиСоединения.ДоменРасположенияСерверовИПП);
	
	ИмяПрограммы                  = Неопределено;
	ДанныеАутентификации          = Неопределено;
	ПередВызовомОперацииСервиса(ИмяПрограммы, ДанныеАутентификации, Результат);
	Если Не ПустаяСтрока(Результат.ИмяОшибки) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ВерсияКонфигурации = ИнтернетПоддержкаПользователей.ВерсияКонфигурации();
	ВерсияПлатформы    = ИнтернетПоддержкаПользователей.ТекущаяВерсияПлатформы1СПредприятие();
	ПараметрыОбновления = Неопределено;
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПолучениеОбновленийПрограммы") Тогда
		МодульПолучениеОбновленийПрограммы = ОбщегоНазначения.ОбщийМодуль("ПолучениеОбновленийПрограммы");
		ПараметрыОбновления = МодульПолучениеОбновленийПрограммы.ПараметрыПолученияОбновлений();
		Если ПараметрыОбновления.ПолучатьИсправления Тогда
			// Для пользователей с ограниченными правами,
			// информация о расширениях должна отображаться
			// в Мониторе Портала 1С:ИТС.
			УстановитьПривилегированныйРежим(Истина);
			ПараметрыОбновления.Вставить("УстановленныеИсправления",
				МодульПолучениеОбновленийПрограммы.ИдентификаторыУстановленныхИсправлений());
			УстановитьПривилегированныйРежим(Ложь);
		Иначе
			ПараметрыОбновления.Вставить("УстановленныеИсправления", Неопределено);
		КонецЕсли;
	КонецЕсли;
	
	ВызватьОперациюДанныеМонитора(
		ДанныеАутентификации,
		НастройкиСоединения.ДоменРасположенияСерверовИПП,
		ИмяПрограммы,
		ВерсияКонфигурации,
		ВерсияПлатформы,
		ПараметрыОбновления,
		Результат);
	
	Если Не ПустаяСтрока(Результат.ИмяОшибки) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат.Данные.Вставить("ДоступноОбновление", Ложь);
	Если Результат.Данные.updateInfo <> Неопределено Тогда
		Результат.Данные.ДоступноОбновление = Результат.Данные.ДоступноОбновление Или Результат.Данные.updateInfo.updateAvailable;
	КонецЕсли;
	Если Результат.Данные.patchesInfo <> Неопределено Тогда
		Результат.Данные.ДоступноОбновление = Результат.Данные.ДоступноОбновление Или Результат.Данные.patchesInfo.patchesAvailable;
	КонецЕсли;
	
	Если Результат.Данные = Неопределено Тогда
		Результат.ИмяОшибки          = "Ошибка";
		Результат.СообщениеОбОшибке  = НСтр("es='La respuesta incorrecta (vacía) del servicio.';ru='Некорректный (пустой) ответ сервиса.';en='Invalid (empty) service response.'");
		Результат.ИнформацияОбОшибке = Результат.СообщениеОбОшибке;
		Возврат Результат;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДеталиДанныхМонитора(
	Логин,
	Договоры1СИТС,
	АктивацияСервисовСопровождения,
	ДоговорыНаСервисы) Экспорт
	
	Результат = НовыйРезультатВызоваОперации();
	
	Если Не ДоступноИспользованиеМонитора() Тогда
		ВызватьИсключение НСтр("es='El uso del Monitor es inaccesible en el régimen corriente del trabajo.';ru='Использование Монитора недоступно в текущем режиме работы.';en='Using the Monitor is not available in the current operating mode.'");
	КонецЕсли;
	
	ИмяПрограммы         = Неопределено;
	ДанныеАутентификации = Неопределено;
	ПередВызовомОперацииСервиса(ИмяПрограммы, ДанныеАутентификации, Результат);
	Если Не ПустаяСтрока(Результат.ИмяОшибки) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если НРег(СокрЛП(Логин)) <> НРег(СокрЛП(ДанныеАутентификации.Логин)) Тогда
		Результат.ИмяОшибки          = "ИзмененыДанныеАутентификации";
		Результат.СообщениеОбОшибке  = НСтр("es='Se han cambiado los datos аутентификации del usuario del Apoyo De Internet. "
"Renueven el contenido del Monitor.';ru='Изменились данные аутентификации пользователя Интернет-поддержки."
"Обновите содержимое Монитора.';en='The authentication information of the Internet support user has changed. Update the contents of the Monitor.'");
		Результат.ИнформацияОбОшибке = Результат.СообщениеОбОшибке;
		Возврат Результат;
	КонецЕсли;
	
	ВызватьОперациюДеталиДанныхМонитора(
		ДанныеАутентификации,
		ИмяПрограммы,
		Договоры1СИТС,
		АктивацияСервисовСопровождения,
		ДоговорыНаСервисы,
		Результат);
	
	Если Не ПустаяСтрока(Результат.ИмяОшибки) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если Результат.Данные = Неопределено Тогда
		Результат.ИмяОшибки          = "Ошибка";
		Результат.СообщениеОбОшибке  = НСтр("es='La respuesta incorrecta (vacía) del servicio.';ru='Некорректный (пустой) ответ сервиса.';en='Invalid (empty) service response.'");
		Результат.ИнформацияОбОшибке = Результат.СообщениеОбОшибке;
		Возврат Результат;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПередВызовомОперацииСервиса(ИмяПрограммы, ДанныеАутентификации, РезультатОперации)
	
	ИмяПрограммы = ИнтернетПоддержкаПользователей.СлужебнаяИмяПрограммы();
	Если ИмяПрограммы = "Unknown" Тогда
		РезультатОперации.ИмяОшибки = "НеЗаполненоИмяПрограммы";
		РезультатОперации.СообщениеОбОшибке  = НСтр("es='del programa.';ru='Не заполнено имя программы.';en='The program name is not filled.'");
		РезультатОперации.ИнформацияОбОшибке =
			НСтр("es='No es rellenado el nombre del programa en el método ИнтернетПоддержкаПользователейПереопределяемый.ПриОпределенииИмениПрограммы ().';ru='Не заполнено имя программы в методе ИнтернетПоддержкаПользователейПереопределяемый.ПриОпределенииИмениПрограммы().';en='The program name in the method is not filled ИнтернетПоддержкаПользователейПереопределяемый.ПриОпределенииИмениПрограммы().'");
	КонецЕсли;
	
	Если ДанныеАутентификации = Неопределено Тогда
		УстановитьПривилегированныйРежим(Истина);
		ДанныеАутентификации = ИнтернетПоддержкаПользователей.ДанныеАутентификацииПользователяИнтернетПоддержки();
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Если ДанныеАутентификации = Неопределено Тогда
		РезультатОперации.ИмяОшибки = "НеЗаполненыДанныеАутентификации";
		РезультатОперации.СообщениеОбОшибке = НСтр("es='аутентификации.';ru='Не заполнены данные аутентификации.';en='Authentication data is not filled.'");
		РезультатОперации.ИнформацияОбОшибке = РезультатОперации.СообщениеОбОшибке;
		Возврат;
	ИначеЕсли РезультатОперации.Свойство("Логин") Тогда
		РезультатОперации.Логин = ДанныеАутентификации.Логин;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВызватьОперациюДанныеМонитора(
	ДанныеАутентификации,
	Домен,
	ИмяПрограммы,
	ВерсияКонфигурации,
	ВерсияПлатформы,
	ПолучитьИнформациюОбОбновлении,
	Результат)
	
	URLОперации = URLОперацииСервиса("monitor", Домен) + "/" + ИмяПрограммы;
	ТелоЗапроса = НовыйТелоЗапросаСодержимоеМонитора(
		ДанныеАутентификации,
		ВерсияКонфигурации,
		ВерсияПлатформы,
		ПолучитьИнформациюОбОбновлении);
	
	ТелоОтвета = "";
	ВызватьОперациюСервиса(URLОперации, Домен, ТелоЗапроса, Результат, ТелоОтвета);
	
	Если Не ПустаяСтрока(Результат.ИмяОшибки) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТелоОтвета);
		Результат.Данные = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		
		Если Результат.Данные.authResult.blockStatus = "429" Или Результат.Данные.authResult.blockStatus = 429 Тогда
			Результат.ИмяОшибки         = "Ошибка";
			Результат.СообщениеОбОшибке = НСтр("es='Es superada la cantidad de las tentativas аутентификации con el login incorrecto o la consigna. "
"Comprueben la corrección del login y la consigna y repitan la tentativa en 30 minutos.';ru='Превышено количество попыток аутентификации с некорректным логином или паролем."
"Проверьте правильность логина и пароля и повторите попытку через 30 минут.';en='Exceeded the number of authentication attempts with an incorrect username or password."
"Check the username and password and try again after 30 minutes. '");
			Результат.ИнформацияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("es='La falta con la llamada de la operación %1 servicios del Monitor del Portal 1С:ИТС. "
"El servicio ha informado sobre la falta - authResult.blockStatus: %2';ru='Ошибка при вызове операции %1 сервиса Монитора Портала 1С:ИТС."
"Сервис сообщил об ошибке - authResult.blockStatus: %2';en='Error while invoking operation%1 of the Portal Monitor 1C: ITS service."
"Service reported an error - authResult.blockStatus:%2'"),
				URLОперации,
				Результат.Данные.authResult.blockStatus);
		ИначеЕсли (Результат.Данные.authResult.blockStatus <> "200" И Результат.Данные.authResult.blockStatus <> 200) Тогда
			Результат.ИмяОшибки         = "ВнутренняяОшибкаСервиса";
			Результат.СообщениеОбОшибке = НСтр("es='La falta interior del servicio. "
"Repitan la tentativa de la conexión más tarde.';ru='Внутренняя ошибка сервиса."
"Повторите попытку подключения позднее.';en='Internal service error."
"Please try connecting again later.'");
			Результат.ИнформацияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("es='La falta con la llamada de la operación %1 servicios del Monitor del Portal 1С:ИТС. "
"El servicio ha informado sobre la falta - authResult.blockStatus: %2';ru='Ошибка при вызове операции %1 сервиса Монитора Портала 1С:ИТС."
"Сервис сообщил об ошибке - authResult.blockStatus: %2';en='Error while invoking operation%1 of the Portal Monitor 1C: ITS service."
"Service reported an error - authResult.blockStatus:%2'"),
				URLОперации,
				Результат.Данные.authResult.blockStatus);
		КонецЕсли;
		
	Исключение
		
		ПриОшибкеОбработкиОтветаСервиса(ИнформацияОбОшибке(), URLОперации, ТелоОтвета, Результат);
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ВызватьОперациюДеталиДанныхМонитора(
	ДанныеАутентификации,
	ИмяПрограммы,
	Договоры1СИТС,
	АктивацияСервисовСопровождения,
	ДоговорыНаСервисы,
	Результат)
	
	НастройкиСоединения = ИнтернетПоддержкаПользователей.НастройкиСоединенияССерверами();
	URLОперации = URLОперацииСервиса("support-info", НастройкиСоединения.ДоменРасположенияСерверовИПП)
		+ "/" + ИмяПрограммы;
	ТелоЗапроса = НовыйТелоЗапросаДеталиМонитора(
		ДанныеАутентификации,
		Договоры1СИТС,
		АктивацияСервисовСопровождения,
		ДоговорыНаСервисы);
	
	ТелоОтвета = "";
	
	ВызватьОперациюСервиса(URLОперации, НастройкиСоединения.ДоменРасположенияСерверовИПП, ТелоЗапроса, Результат, ТелоОтвета);
	
	Если Не ПустаяСтрока(Результат.ИмяОшибки) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТелоОтвета);
		
		ИменаСвойствСоЗначениямиДата = Новый Массив;
		ИменаСвойствСоЗначениямиДата.Добавить("from");
		ИменаСвойствСоЗначениямиДата.Добавить("to");
		Результат.Данные = ПрочитатьJSON(ЧтениеJSON, , ИменаСвойствСоЗначениямиДата, ФорматДатыJSON.ISO);
		ЧтениеJSON.Закрыть();
		
		// Проверка состояния получения данных в сервисе.
		ОшибкаСервисаПриПолученииДанных = Ложь;
		Если (Договоры1СИТС Или АктивацияСервисовСопровождения)
			И Результат.Данные.supportConditionsImplStatus.blockStatus <> "200"
			И Результат.Данные.supportConditionsImplStatus.blockStatus <> 200 Тогда
			
			ОшибкаСервисаПриПолученииДанных = Истина;
			Результат.ИнформацияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("es='La falta con la llamada de la operación %1 servicios del Monitor del Portal 1С:ИТС. "
"El servicio ha informado sobre la falta - supportConditionsImplStatus.blockStatus: %2';ru='Ошибка при вызове операции %1 сервиса Монитора Портала 1С:ИТС."
"Сервис сообщил об ошибке - supportConditionsImplStatus.blockStatus: %2';en='Error while invoking operation%1 of the Portal Monitor 1C: ITS service."
"Service reported an error - supportConditionsImplStatus.blockStatus:%2'"),
				URLОперации,
				Результат.Данные.supportConditionsImplStatus.blockStatus);
			
		ИначеЕсли Договоры1СИТС
			И Результат.Данные.itsContracts <> Неопределено
			И Результат.Данные.itsContracts.blockStatus <> "200"
			И Результат.Данные.itsContracts.blockStatus <> 200 Тогда
			
			ОшибкаСервисаПриПолученииДанных = Истина;
			Результат.ИнформацияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("es='La falta con la llamada de la operación %1 servicios del Monitor del Portal 1С:ИТС. "
"El servicio ha informado sobre la falta - itsContracts.blockStatus: %2';ru='Ошибка при вызове операции %1 сервиса Монитора Портала 1С:ИТС."
"Сервис сообщил об ошибке - itsContracts.blockStatus: %2';en='Error while invoking operation%1 of the Portal Monitor 1C: ITS service."
"Service reported an error - itsContracts.blockStatus:%2'"),
				URLОперации,
				Результат.Данные.itsContracts.blockStatus);
			
		ИначеЕсли АктивацияСервисовСопровождения
			И Результат.Данные.supportServiceActivations <> Неопределено
			И Результат.Данные.supportServiceActivations.blockStatus <> "200"
			И Результат.Данные.supportServiceActivations.blockStatus <> 200 Тогда
			
			ОшибкаСервисаПриПолученииДанных = Истина;
			Результат.ИнформацияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("es='La falta con la llamada de la operación %1 servicios del Monitor del Portal 1С:ИТС. "
"El servicio ha informado sobre la falta - supportServiceActivations.blockStatus: %2';ru='Ошибка при вызове операции %1 сервиса Монитора Портала 1С:ИТС."
"Сервис сообщил об ошибке - supportServiceActivations.blockStatus: %2';en='Error while invoking operation%1 of the Portal Monitor 1C: ITS service."
"Service reported an error - supportServiceActivations.blockStatus:%2 '"),
				URLОперации,
				Результат.Данные.supportServiceActivations.blockStatus);
			
		ИначеЕсли ДоговорыНаСервисы
			И Результат.Данные.serviceContractsStatus.blockStatus <> "200"
			И Результат.Данные.serviceContractsStatus.blockStatus <> 200 Тогда
			
			ОшибкаСервисаПриПолученииДанных = Истина;
			Результат.ИнформацияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("es='La falta con la llamada de la operación %1 servicios del Monitor del Portal 1С:ИТС. "
"El servicio ha informado sobre la falta - supportServiceActivations.blockStatus: %2';ru='Ошибка при вызове операции %1 сервиса Монитора Портала 1С:ИТС."
"Сервис сообщил об ошибке - supportServiceActivations.blockStatus: %2';en='Error while invoking operation%1 of the Portal Monitor 1C: ITS service."
"Service reported an error - supportServiceActivations.blockStatus:%2 '"),
				URLОперации,
				Результат.Данные.serviceContractsStatus.blockStatus);
			
		ИначеЕсли ДоговорыНаСервисы
			И Результат.Данные.serviceContracts <> Неопределено
			И Результат.Данные.serviceContracts.blockStatus <> "200"
			И Результат.Данные.serviceContracts.blockStatus <> 200 Тогда
			
			ОшибкаСервисаПриПолученииДанных = Истина;
			Результат.ИнформацияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("es='La falta con la llamada de la operación %1 servicios del Monitor del Portal 1С:ИТС. "
"El servicio ha informado sobre la falta - serviceContractsStatus.blockStatus: %2';ru='Ошибка при вызове операции %1 сервиса Монитора Портала 1С:ИТС."
"Сервис сообщил об ошибке - serviceContractsStatus.blockStatus: %2';en='Error while invoking operation%1 of the Portal Monitor 1C: ITS service."
"Service reported error - serviceContractsStatus.blockStatus:%2'"),
				URLОперации,
				Результат.Данные.serviceContracts.blockStatus);
			
		КонецЕсли;
		
		Если ОшибкаСервисаПриПолученииДанных Тогда
			Результат.ИмяОшибки = "ВнутренняяОшибкаСервиса";
			Результат.СообщениеОбОшибке = НСтр("es='La falta interior del servicio. "
"Repitan la tentativa de la conexión más tarde.';ru='Внутренняя ошибка сервиса."
"Повторите попытку подключения позднее.';en='Internal service error."
"Please try connecting again later.'");
		КонецЕсли;
		
	Исключение
		
		ПриОшибкеОбработкиОтветаСервиса(ИнформацияОбОшибке(), URLОперации, ТелоОтвета, Результат);
		
	КонецПопытки;
	
КонецПроцедуры

Функция НовыйТелоЗапросаСодержимоеМонитора(
	ДанныеАутентификации,
	ВерсияКонфигурации,
	ВерсияПлатформы,
	ПараметрыОбновления)
	
	ЗаписьДанныхСообщения = Новый ЗаписьJSON;
	ЗаписьДанныхСообщения.УстановитьСтроку();
	ЗаписьДанныхСообщения.ЗаписатьНачалоОбъекта();
	
	ЗаписатьДанныеАутентификации(ЗаписьДанныхСообщения, ДанныеАутентификации);
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("programVersion");
	ЗаписьДанныхСообщения.ЗаписатьЗначение(ВерсияКонфигурации);
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("platformVersion");
	ЗаписьДанныхСообщения.ЗаписатьЗначение(ВерсияПлатформы);
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("getUpdateAvailabilityStatus");
	ЗаписьДанныхСообщения.ЗаписатьЗначение((ПараметрыОбновления <> Неопределено));
	Если ПараметрыОбновления <> Неопределено Тогда
		
		ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("getOnlyPlatformUpdateAvailabilityStatus");
		ЗаписьДанныхСообщения.ЗаписатьЗначение(Не ПараметрыОбновления.ПолучатьОбновленияКонфигурации);
		
		Если ПараметрыОбновления.ПолучатьИсправления Тогда
			
			ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("patchParameters");
			
			ЗаписьДанныхСообщения.ЗаписатьНачалоОбъекта();
			ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("checkPatchesUpdates");
			ЗаписьДанныхСообщения.ЗаписатьЗначение(ПараметрыОбновления.ПолучатьИсправления);
			ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("installedPatches");
			ЗаписьДанныхСообщения.ЗаписатьНачалоМассива();
			Для Каждого ИдентификаторИсправления Из ПараметрыОбновления.УстановленныеИсправления Цикл
				ЗаписьДанныхСообщения.ЗаписатьЗначение(Строка(ИдентификаторИсправления));
			КонецЦикла;
			ЗаписьДанныхСообщения.ЗаписатьКонецМассива();
			
			ЗаписьДанныхСообщения.ЗаписатьКонецОбъекта();
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("params");
	ЗаписатьДополнительныеПараметрыЗапроса(ЗаписьДанныхСообщения);
	
	ЗаписьДанныхСообщения.ЗаписатьКонецОбъекта();
	
	Возврат ЗаписьДанныхСообщения.Закрыть();
	
КонецФункции

Функция НовыйТелоЗапросаДеталиМонитора(
	ДанныеАутентификации,
	Договоры1СИТС,
	АктивацияСервисовСопровождения,
	ДоговорыНаСервисы)
	
	ЗаписьДанныхСообщения = Новый ЗаписьJSON;
	ЗаписьДанныхСообщения.УстановитьСтроку();
	ЗаписьДанныхСообщения.ЗаписатьНачалоОбъекта();
	
	ЗаписатьДанныеАутентификации(ЗаписьДанныхСообщения, ДанныеАутентификации);
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("getItsContracts");
	ЗаписьДанныхСообщения.ЗаписатьЗначение(Договоры1СИТС);
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("getSupportServiceActivations");
	ЗаписьДанныхСообщения.ЗаписатьЗначение(АктивацияСервисовСопровождения);
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("getServiceContracts");
	ЗаписьДанныхСообщения.ЗаписатьЗначение(ДоговорыНаСервисы);
	
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("params");
	ЗаписатьДополнительныеПараметрыЗапроса(ЗаписьДанныхСообщения);
	
	ЗаписьДанныхСообщения.ЗаписатьКонецОбъекта();
	
	Возврат ЗаписьДанныхСообщения.Закрыть();
	
КонецФункции

Процедура ЗаписатьДанныеАутентификации(ЗаписьДанныхСообщения, ДанныеАутентификации)
	
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("auth");
	ЗаписьДанныхСообщения.ЗаписатьНачалоОбъекта();
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("login");
	ЗаписьДанныхСообщения.ЗаписатьЗначение(ДанныеАутентификации.Логин);
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("password");
	ЗаписьДанныхСообщения.ЗаписатьЗначение(ДанныеАутентификации.Пароль);
	ЗаписьДанныхСообщения.ЗаписатьКонецОбъекта();
	
КонецПроцедуры

Процедура ЗаписатьДополнительныеПараметрыЗапроса(ЗаписьПараметровЗапроса)
	
	ДопПараметрыЗапроса = ИнтернетПоддержкаПользователей.ДополнительныеПараметрыВызоваОперацииСервиса(Ложь);
	
	ЗаписьПараметровЗапроса.ЗаписатьНачалоОбъекта();
	
	ТипСтрока = Тип("Строка");
	ТипЧисло  = Тип("Число");
	ТипБулево = Тип("Булево");
	ТипДата   = Тип("Дата");
	Для Каждого КлючЗначение Из ДопПараметрыЗапроса Цикл
		ЗаписьПараметровЗапроса.ЗаписатьИмяСвойства(КлючЗначение.Ключ);
		Если КлючЗначение.Значение = Неопределено Тогда
			ЗаписьПараметровЗапроса.ЗаписатьЗначение(Неопределено);
		Иначе
			ТипЗнчПараметра = ТипЗнч(КлючЗначение.Значение);
			Если ТипЗнчПараметра = ТипСтрока
				Или ТипЗнчПараметра = ТипЧисло
				Или ТипЗнчПараметра = ТипБулево Тогда
				ЗаписьПараметровЗапроса.ЗаписатьЗначение(КлючЗначение.Значение);
			ИначеЕсли ТипЗнчПараметра = ТипДата Тогда
				ЗаписьПараметровЗапроса.ЗаписатьЗначение(ЗаписатьДатуJSON(КлючЗначение.Значение, ФорматДатыJSON.ISO));
			Иначе
				ЗаписьПараметровЗапроса.ЗаписатьЗначение(Строка(КлючЗначение.Значение));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ЗаписьПараметровЗапроса.ЗаписатьКонецОбъекта();
	
КонецПроцедуры

Процедура ВызватьОперациюСервиса(URLОперации, Домен, ТелоЗапроса, Результат, ТелоОтвета)
	
	ПроверитьДоступностьСервиса(Домен, Результат);
	Если Не ПустаяСтрока(Результат.ИмяОшибки) Тогда
		Возврат;
	КонецЕсли;
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	ПараметрыПолученияСодержимого = Новый Структура;
	ПараметрыПолученияСодержимого.Вставить("Метод"                   , "POST");
	ПараметрыПолученияСодержимого.Вставить("ФорматОтвета"            , 1);
	ПараметрыПолученияСодержимого.Вставить("Заголовки"               , Заголовки);
	ПараметрыПолученияСодержимого.Вставить("ДанныеДляОбработки"      , ТелоЗапроса);
	ПараметрыПолученияСодержимого.Вставить("ФорматДанныхДляОбработки", 1);
	ПараметрыПолученияСодержимого.Вставить("Таймаут"                 , 60);
	
	РезультатЗагрузкиСодержимого = ИнтернетПоддержкаПользователей.ЗагрузитьСодержимоеИзИнтернет(
		URLОперации,
		,
		,
		ПараметрыПолученияСодержимого);
	
	Результат.КодСостояния = РезультатЗагрузкиСодержимого.КодСостояния;
	
	Если ПустаяСтрока(РезультатЗагрузкиСодержимого.КодОшибки) Тогда
		
		ТелоОтвета = РезультатЗагрузкиСодержимого.Содержимое;
		
		ДлинаТелаОтвета = СтрДлина(ТелоОтвета);
		Если ДлинаТелаОтвета > 100000 Тогда
			
			Результат.ИмяОшибки         = "ВнутренняяОшибкаСервиса";
			Результат.СообщениеОбОшибке = НСтр("es='La respuesta incorrecta del servicio.';ru='Некорректный ответ сервиса.';en='Invalid service response.'");
			Результат.ИнформацияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("es='Es superada la longitud admisible del cuerpo de la respuesta de 100000 símbolos. "
"La longitud del cuerpo de la respuesta: %1 símbolos.';ru='Превышена допустимая длина тела ответа 100000 символов."
"Длина тела ответа: %1 символов.';en='Exceeded allowable response body length of 100,000 characters."
"Response body length:%1 characters.'"),
				ДлинаТелаОтвета);
			
		КонецЕсли;
		
	Иначе
		
		ПриОшибкеВызоваОперацииСервиса(РезультатЗагрузкиСодержимого, URLОперации, Результат);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОшибкеОбработкиОтветаСервиса(ИнформацияОбОшибке, URLОперации, ТелоОтвета, Результат)
	
	Результат.ИнформацияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("es='La falta con la llamada de la operación %1 servicios del Monitor del Portal 1С:ИТС. "
"La falta al tratamiento de la respuesta del servicio. %2 "
"Cuerpo de la respuesta: %3';ru='Ошибка при вызове операции %1 сервиса Монитора Портала 1С:ИТС."
"Ошибка при обработке ответа сервиса. %2"
"Тело ответа: %3';en='Error while invoking operation%1 of the Portal Monitor 1C: ITS service."
"Error processing service response. %2"
"Answer body:%3 '"),
		URLОперации,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке),
		Лев(ТелоОтвета, 5120));
	
	Результат.ИмяОшибки         = "ВнутренняяОшибкаСервиса";
	Результат.СообщениеОбОшибке = НСтр("es='La respuesta incorrecta del servicio.';ru='Некорректный ответ сервиса.';en='Invalid service response.'");
	
КонецПроцедуры

Процедура ПриОшибкеВызоваОперацииСервиса(РезультатЗагрузкиСодержимого, URLОперации, Результат)
	
	ШапкаИнформацииОбОшибке =
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("es='La falta con la llamada de la operación %1 servicios del Monitor del Portal 1С:ИТС.';ru='Ошибка при вызове операции %1 сервиса Монитора Портала 1С:ИТС.';en='An error occurred while invoking operation%1 of the Portal Monitor 1C: ITS service.'"),
			URLОперации);
	
	Если РезультатЗагрузкиСодержимого.КодОшибки = "ConnectError" Тогда
		
		Результат.ИмяОшибки = "ОшибкаСоединения";
		Результат.СообщениеОбОшибке =
			НСтр("es='La falta de la unión con el servicio.';ru='Ошибка соединения с сервисом.';en='Error connecting to service.'")
			+ Символы.ПС
			+ РезультатЗагрузкиСодержимого.СообщениеОбОшибке;
		
	ИначеЕсли  РезультатЗагрузкиСодержимого.КодОшибки = "ConnectError" Тогда
		
		Результат.ИмяОшибки = "ВнутренняяОшибкаСервиса";
		Результат.СообщениеОбОшибке = НСтр("es='En el servicio han surgido los defectos.';ru='В сервисе возникли неполадки.';en='There are problems with the service.'")
			+ Символы.ПС
			+ РезультатЗагрузкиСодержимого.СообщениеОбОшибке;
		
	ИначеЕсли РезультатЗагрузкиСодержимого.КодСостояния = 401
		Или РезультатЗагрузкиСодержимого.КодСостояния = 403 Тогда
		
		Результат.ИмяОшибки = "НекорректныеДанныеАутентификации";
		Если ПустаяСтрока(Результат.СообщениеОбОшибке) Тогда
			Результат.СообщениеОбОшибке = НСтр("es='El login equivocado o la consigna del usuario del Apoyo De Internet.';ru='Неверный логин или пароль пользователя Интернет-поддержки.';en='Invalid username or password for Internet support user.'");
		КонецЕсли;
		
	ИначеЕсли РезультатЗагрузкиСодержимого.КодСостояния = 429 Тогда
		
		Результат.ИмяОшибки = "Ошибка";
		Если ПустаяСтрока(Результат.СообщениеОбОшибке) Тогда
			Результат.СообщениеОбОшибке = НСтр("es='Es superada la cantidad de las tentativas аутентификации con el login incorrecto o la consigna. "
"Comprueben la corrección del login y la consigna y repitan la tentativa en 30 minutos.';ru='Превышено количество попыток аутентификации с некорректным логином или паролем."
"Проверьте правильность логина и пароля и повторите попытку через 30 минут.';en='Exceeded the number of authentication attempts with an incorrect username or password."
"Check the username and password and try again after 30 minutes. '");
		КонецЕсли;
		
	Иначе
		
		Результат.ИмяОшибки = "Ошибка";
		Результат.СообщениеОбОшибке = РезультатЗагрузкиСодержимого.СообщениеОбОшибке;
		
	КонецЕсли;
	
	Результат.ИнформацияОбОшибке = ШапкаИнформацииОбОшибке
		+ Символы.ПС + Результат.СообщениеОбОшибке
		+ Символы.ПС + РезультатЗагрузкиСодержимого.ИнформацияОбОшибке;
	
КонецПроцедуры

Функция НовыйРезультатВызоваОперации()
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяОшибки"         , "");
	Результат.Вставить("СообщениеОбОшибке" , "");
	Результат.Вставить("ИнформацияОбОшибке", "");
	Результат.Вставить("КодСостояния"      , 0);
	Результат.Вставить("Данные"            , Неопределено);
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьДоступностьСервиса(Домен, РезультатОперации)
	
	URLОперацииPing = URLОперацииСервиса("ping", Домен);
	РезультатПроверки = ИнтернетПоддержкаПользователей.ПроверитьURLДоступен(URLОперацииPing);
	
	Если ПустаяСтрока(РезультатПроверки.ИмяОшибки) Тогда
		
		Возврат;
		
	ИначеЕсли РезультатПроверки.ИмяОшибки = "ConnectError" Тогда
		
		РезультатОперации.ИмяОшибки = "ОшибкаСоединения";
		РезультатОперации.СообщениеОбОшибке =
			РезультатПроверки.СообщениеОбОшибке
			+ Символы.ПС
			+ НСтр("es='Comprueben los ajustes de la conexión a la red el Internet.';ru='Проверьте настройки подключения к сети Интернет.';en='Check your Internet connection settings.'");
		
	ИначеЕсли РезультатПроверки.ИмяОшибки = "ServerError" Тогда
		
		РезультатОперации.ИмяОшибки = "СервисВременноНедоступен";
		РезультатОперации.СообщениеОбОшибке = РезультатПроверки.СообщениеОбОшибке;
		
	Иначе
		
		РезультатОперации.ИмяОшибки = "Ошибка"; // Прочие ошибки.
		РезультатОперации.СообщениеОбОшибке =
			НСтр("es='No consiguió conectarse al servicio.';ru='Не удалось подключиться к сервису.';en='Failed to connect to the service.'")
			+ Символы.ПС
			+ РезультатПроверки.СообщениеОбОшибке;
		
	КонецЕсли;
	
	РезультатОперации.ИнформацияОбОшибке = НСтр("es='No consiguió comprobar la accesibilidad del servicio.';ru='Не удалось проверить доступность сервиса.';en='Failed to check service availability.'")
		+ Символы.ПС + РезультатПроверки.ИнформацияОбОшибке;
	
КонецПроцедуры

Функция ХостСервиса(Домен)
	
	
	Возврат ?(Домен = 0, "portal-monitor.1c.ru", "portal-monitor.1c.eu");
	
КонецФункции

Функция URLОперацииСервиса(Операция, Домен)
	
	Возврат "https://"
		+ ХостСервиса(Домен)
		+ "/rest/public/"
		+ Операция;
	
КонецФункции

#КонецОбласти

#КонецОбласти
