#Область ОбработчикиСобытийФормы

// гкс+ [Релиз 1] Куст 17.03.2020
&НаСервере
Процедура ДобавитьНовыеЭлементы()
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "Документторо_ВыявленныеДефекты.Дата,"
		, "Документторо_ВыявленныеДефекты.Дата,
	|	Документторо_ВыявленныеДефекты.гкс_СимптомДефекта КАК гкс_СимптомДефекта,
	// Гкс+[TOIR20-564] Зозуля А.В. от 31.03.2025. Изменено:{
	//|	Документторо_ВыявленныеДефекты.гкс_КатегорияРиска КАК гкс_КатегорияРиска,
	|	Документторо_ВыявленныеДефекты.гкс_СрочностьВоздействия КАК гкс_СрочностьВоздействия,
	// } Гкс-[TOIR20-564] Зозуля А.В. от 31.03.2025.
	|	Документторо_ВыявленныеДефекты.гкс_ОписаниеДефектаСписком КАК гкс_ОписаниеДефектаСписком,
	|	Не гкс_ЕВОБланк.Ссылка Есть Null КАК ЕстьЕВОБланк,");
		
	// Гкс+[TOIR20-454] Зозуля А.В. от 09.10.2024. Добавлено:{
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "Документторо_ВыявленныеДефекты.ДатаОбнаружения,"
		, "Документторо_ВыявленныеДефекты.ДатаОбнаружения,
	|	Документторо_ВыявленныеДефекты.гкс_НомерТАГ КАК гкс_НомерТАГ,");
	// } Гкс-[TOIR20-454] Зозуля А.В. от 09.10.2024.
		
	Список.ТекстЗапроса = "Выбрать Док.ДокументОснование КАК ДокументОснование,
	|	Максимум(Док.Ссылка) КАК Ссылка
	|Поместить ВТ_ЕвоБланки
	|ИЗ
	|Документ.гкс_ЕВОБланк КАК Док
	|Где Док.ПометкаУдаления = Ложь
	|Сгруппировать ПО Док.ДокументОснование
	| ; " 
	+ СтрЗаменить(Список.ТекстЗапроса, "КАК Документторо_ВыявленныеДефекты"
		, "КАК Документторо_ВыявленныеДефекты
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕвоБланки КАК гкс_ЕВОБланк
	|	ПО Документторо_ВыявленныеДефекты.Ссылка = гкс_ЕВОБланк.ДокументОснование");	
	// 
	
	// Гкс+[TOIR20-519] Вялых Д.А. от 29.01.2025. Добавлено:{
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "Документторо_ВыявленныеДефекты.ОбъектРемонта,",
	"Документторо_ВыявленныеДефекты.ОбъектРемонта КАК ФункциональноеМесто,
	|	ВЫРАЗИТЬ("""" КАК Строка(400)) КАК ОбъектРемонтаСтрокой,
	|	ВЫРАЗИТЬ("""" КАК Строка(400)) КАК ТехнологическийНомер,");
	// } Гкс-[TOIR20-519] Вялых Д.А. от 29.01.2025.
	
	НЭлем = Элементы.Добавить("гкс_СимптомДефекта", Тип("ПолеФормы"), Элементы.Список);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Список.гкс_СимптомДефекта";
	//
	// Гкс+[TOIR20-564] Зозуля А.В. от 31.03.2025. Изменено:{
	//НЭлем = Элементы.Добавить("гкс_КатегорияРиска", Тип("ПолеФормы"), Элементы.Список);
	//НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	//НЭлем.ПутьКДанным = "Список.гкс_КатегорияРиска";
	НЭлем = Элементы.Добавить("гкс_СрочностьВоздействия", Тип("ПолеФормы"), Элементы.Список);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Список.гкс_СрочностьВоздействия";
	// } Гкс-[TOIR20-564] Зозуля А.В. от 31.03.2025.
	//
	НЭлем = Элементы.Вставить("ЕстьЕВОБланк", Тип("ПолеФормы"), Элементы.Список, Элементы.Ссылка);
	НЭлем.Заголовок = НСтр("ru='Есть EWO-бланк';en='There is an EWO form'");
	НЭлем.Вид = ВидПоляФормы.ПолеКартинки;
	НЭлем.ПутьКДанным = "Список.ЕстьЕВОБланк";
	НЭлем.КартинкаЗначений = БиблиотекаКартинок.Задача;
	//
	НовыйЭлемент = Элементы.Добавить("список_СтатусСогласования", Тип("ПолеФормы"), Элементы.Список);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Список.СтатусСогласования";
	//
	НовыйЭлемент = Элементы.Добавить("список_гкс_ОписаниеДефектаСписком", Тип("ПолеФормы"), Элементы.Список);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Список.гкс_ОписаниеДефектаСписком";
	//
	// Гкс+[TOIR20-454] Зозуля А.В. от 09.10.2024. Добавлено:{
	НовыйЭлемент = Элементы.Вставить("гкс_НомерТАГ", Тип("ПолеФормы"), Элементы.Список, Элементы.ДефектВыявленВПроцессе);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Список.гкс_НомерТАГ";
	// } Гкс-[TOIR20-454] Зозуля А.В. от 09.10.2024.
	// Гкс+[TOIR20-519] Вялых Д.А. от 29.01.2025. Добавлено:{
	НовыйЭлемент = Элементы.Вставить("ОбъектРемонтаСтрокой", Тип("ПолеФормы"), Элементы.Список, Элементы.Подразделение);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Список.ОбъектРемонтаСтрокой";
	НовыйЭлемент.Заголовок = "Объект ремонта";
	
	НовыйЭлемент = Элементы.Добавить("ТехНомер", Тип("ПолеФормы"), Элементы.Список);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Список.ТехнологическийНомер"; 
	НовыйЭлемент.Заголовок = "Технологический №";
	
	НовыйЭлемент = Элементы.Добавить("ФункциональноеМесто", Тип("ПолеФормы"), Элементы.Список);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Список.ФункциональноеМесто"; 
	НовыйЭлемент.Заголовок = "Функциональное место";
	// } Гкс-[TOIR20-519] Вялых Д.А. от 29.01.2025.
	
КонецПроцедуры

&НаСервере
Процедура Расш_гкс_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ДобавитьНовыеЭлементы();
	// гкс+ [Часовые пояса] Куст 09.04.2020
	Сдвиг = Час(ТекущаяДатаСеанса()) - Час(ТекущаяДата());
	ТекстыЗамены = Новый Массив();
	ТекстыЗамены.Добавить(Новый Структура("До, После", "Документторо_ВыявленныеДефекты.Дата,",
		"ДобавитьКДате(Документторо_ВыявленныеДефекты.Дата, Час, " + Сдвиг + ") КАК Дата,"));
	ТекстыЗамены.Добавить(Новый Структура("До, После", "Документторо_ВыявленныеДефекты.ДатаОбнаружения,",
		"ДобавитьКДате(Документторо_ВыявленныеДефекты.ДатаОбнаружения, Час, " + Сдвиг + ") КАК ДатаОбнаружения,"));
	Список.ТекстЗапроса = гкс_ЧасовыеПоясаВызовСервера.ИзменитьТекстЗапросаФормыСписка(
		Список.ТекстЗапроса, ТекстыЗамены);
	// гкс- [Часовые пояса] Куст 09.04.2020
КонецПроцедуры

&НаСервереБезКонтекста
Процедура гкс_СписокПриПолученииДанныхНаСервереПосле(ИмяЭлемента, Настройки, Строки)
	
	// Гкс+[TOIR20-519] Вялых Д.А. от 29.01.2025. Добавлено:{
	ЗапросДанныхДляДС = Новый Запрос;
	ЗапросДанныхДляДС.Текст ="ВЫБРАТЬ
	|	торо_ВыявленныеДефектыСписокДефектов.Ссылка КАК Ссылка,
	|	ОбъектыРемонтаСсылка.Наименование КАК ОтказавшийЭлементНаименование,
	|	ОбъектыРемонтаСсылка.ТехНомер КАК ОтказавшийЭлементТехНомер
	|ИЗ
	|	Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК ОбъектыРемонтаСсылка
	|		ПО (ОбъектыРемонтаСсылка.Ссылка = торо_ВыявленныеДефектыСписокДефектов.ОтказавшийЭлемент)
	|ГДЕ
	|	торо_ВыявленныеДефектыСписокДефектов.Ссылка В(&Ссылка)
	|ИТОГИ ПО
	|	Ссылка";	
	
	ЗапросДанныхДляДС.УстановитьПараметр("Ссылка", Строки.ПолучитьКлючи()); 
	
	РезультатЗапроса = ЗапросДанныхДляДС.Выполнить();
	
	ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСсылка.Следующий() Цикл
		
		ВыборкаДетальныеЗаписи = ВыборкаСсылка.Выбрать();
		
		ОбъектыРемонта = "";
		ТехнологическийНомер = "";
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ОбъектыРемонта = ОбъектыРемонта + ?(ОбъектыРемонта = "", "", ", ") + ВыборкаДетальныеЗаписи.ОтказавшийЭлементНаименование;	
			ТехнологическийНомер = ТехнологическийНомер + ?(ТехнологическийНомер = "", "", ", ") + ВыборкаДетальныеЗаписи.ОтказавшийЭлементТехНомер;
			
		КонецЦикла;
		
		СтрокаСписка = Строки[ВыборкаСсылка.Ссылка]; 
		
		СтруктураПроверки = Новый Структура; 
		
		Если СтрокаСписка.Данные.Свойство("ОбъектРемонтаСтрокой") Тогда
			СтрокаСписка.Данные.ОбъектРемонтаСтрокой = ОбъектыРемонта;
		КонецЕсли;
		Если СтрокаСписка.Данные.Свойство("ТехнологическийНомер") Тогда
			СтрокаСписка.Данные.ТехнологическийНомер = ТехнологическийНомер; 
		КонецЕсли;
		
	КонецЦикла;
	// } Гкс-[TOIR20-519] Вялых Д.А. от 29.01.2025.
	
КонецПроцедуры

#КонецОбласти