

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НеОчищатьСотрудника			= Истина;
	НеОчищатьКвалификацию		= Истина;
	НеОчищатьДатуНачала			= Ложь;
	НеОчищатьДатуОкончания		= Ложь;
	ЗаполнятьПериодИВремяРабот = Ложь;
	ЗаполнятьКТУИСумму         = Истина;
	
	Если Параметры.Свойство("Наряд") И Параметры.Наряд = Истина Тогда
		Элементы.ДеревоИсполнителейВремяРаботыТекст.Видимость = Ложь;
		Элементы.ДеревоИсполнителейСуммаКНачислению.Видимость = Ложь;
		Элементы.ЗаполнятьКТУИСумму.Видимость = Ложь;
		Элементы.ЗаполнятьПериодИВремяРабот.Видимость = Ложь;
		ЗаполнятьПериодИВремяРабот = Истина;
		ЗаполнятьКТУИСумму = Ложь;
	ИначеЕсли Параметры.Свойство("НарядРегламентный") И Параметры.НарядРегламентный = Истина Тогда
		Элементы.ДеревоИсполнителейВремяРаботыТекст.Видимость = Ложь;
		Элементы.ДеревоИсполнителейКТУ.Видимость = Ложь;
		Элементы.ДеревоИсполнителейСуммаКНачислению.Видимость = Ложь;
		Элементы.ЗаполнятьКТУИСумму.Видимость = Ложь;
		Элементы.ЗаполнятьПериодИВремяРабот.Видимость = Ложь;
		ЗаполнятьПериодИВремяРабот = Истина;
		ЗаполнятьКТУИСумму = Ложь;
	КонецЕсли; 
	
	Элементы.ДеревоИсполнителейДатаНачала.Видимость       = ЗаполнятьПериодИВремяРабот;
	Элементы.ДеревоИсполнителейДатаОкончания.Видимость    = ЗаполнятьПериодИВремяРабот;
	Элементы.ДеревоИсполнителейВремяРаботыТекст.Видимость = ЗаполнятьПериодИВремяРабот;
	
	Если Параметры.Свойство("Ссылка") Тогда
		ДокументАкт = Параметры.Ссылка;
		Элементы.Декорация1.Заголовок = Строка(ДокументАкт);
	КонецЕсли; 
	
	Если Не Параметры.Свойство("МассивИсполнителей") Тогда
		ТекстСообщения = НСтр("es='Es necesario rellenar las Reparaciones de la maquinaria y los trabajos de reparación por ellos.';ru='Необходимо заполнить Ремонты оборудования и ремонтные работы по ним.';en='Required to fill in Equipment repairs and repairs on them.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		Возврат;
	КонецЕсли; 
	
	ТаблицаДанныхДляЗаполненияДерева = ПодготовитьТаблицуДанных(Параметры.МассивИсполнителей);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаДанныхДляЗаполненияДерева.РемонтыОборудования_ID,
	               |	ТаблицаДанныхДляЗаполненияДерева.ID,
	               |	ТаблицаДанныхДляЗаполненияДерева.Родитель_ID,
	               |	ТаблицаДанныхДляЗаполненияДерева.РемонтнаяРабота,
	               |	ТаблицаДанныхДляЗаполненияДерева.ОбъектРемонта,
	               |	ТаблицаДанныхДляЗаполненияДерева.ВидРемонта,
	               |	ТаблицаДанныхДляЗаполненияДерева.Квалификация,
	               |	ТаблицаДанныхДляЗаполненияДерева.ДатаНачала,
	               |	ТаблицаДанныхДляЗаполненияДерева.ДатаОкончания,
	               |	ТаблицаДанныхДляЗаполненияДерева.КТУ,
	               |	ТаблицаДанныхДляЗаполненияДерева.ВремяРаботы,
	               |	ТаблицаДанныхДляЗаполненияДерева.СуммаКНачислению,
	               |	ТаблицаДанныхДляЗаполненияДерева.Сотрудник,
	               |	ТаблицаДанныхДляЗаполненияДерева.ДатаНачалаРемонта,
	               |	ТаблицаДанныхДляЗаполненияДерева.ДатаОкончанияРемонта
	               |ПОМЕСТИТЬ ТаблицаДанных
	               |ИЗ
	               |	&ТаблицаДанныхДляЗаполненияДерева КАК ТаблицаДанныхДляЗаполненияДерева
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаДанных.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	               |	ТаблицаДанных.ID КАК ID,
	               |	ТаблицаДанных.Родитель_ID,
	               |	ТаблицаДанных.РемонтнаяРабота КАК РемонтнаяРабота,
	               |	ТаблицаДанных.ОбъектРемонта КАК ОбъектРемонта,
	               |	ТаблицаДанных.ВидРемонта КАК ВидРемонта,
	               |	ТаблицаДанных.Квалификация,
	               |	ТаблицаДанных.ДатаНачала,
	               |	ТаблицаДанных.ДатаОкончания,
	               |	ТаблицаДанных.КТУ,
	               |	ТаблицаДанных.ВремяРаботы,
	               |	ТаблицаДанных.СуммаКНачислению,
	               |	ТаблицаДанных.Сотрудник,
	               |	ТаблицаДанных.ДатаНачалаРемонта,
	               |	ТаблицаДанных.ДатаОкончанияРемонта
	               |ИЗ
	               |	ТаблицаДанных КАК ТаблицаДанных
	               |ИТОГИ
	               |	МАКСИМУМ(РемонтнаяРабота),
	               |	МАКСИМУМ(ВидРемонта)
	               |ПО
	               |	ОбъектРемонта,
	               |	РемонтыОборудования_ID,
	               |	ID";
				   
	Запрос.УстановитьПараметр("ТаблицаДанныхДляЗаполненияДерева", ТаблицаДанныхДляЗаполненияДерева);
	Если Не ЗаполнятьКТУИСумму Тогда
	    Запрос.Текст = СтрЗаменить(Запрос.Текст, "|	ТаблицаДанныхДляЗаполненияДерева.КТУ,", "|	1 КАК КТУ,");
	КонецЕсли; 
	Результат = Запрос.Выполнить();
	ПостроитьДеревоИсполнителей(Результат);
	
	// << [Деснол] [Ушаков А.Д.] [03.10.2019] 
	Квалификация = дс_ПолучитьОсновнуюКвалификацию();
	//Квалификация = "<основная>";
	// << [Деснол] [Ушаков А.Д.] [03.10.2019] 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Для Каждого Строка Из ДеревоИсполнителей.ПолучитьЭлементы() Цикл
		РазвернутьДеревоРемонтныхРабот(Строка);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КвалификацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокВыбора = Новый СписокЗначений;
	
	// >> [Деснол] [Ушаков А.Д.] [03.10.2019] 
	СписокВыбора.Добавить("<основная>" , дс_ПолучитьОсновнуюКвалификацию());
	СписокВыбора.Добавить("Выбрать..." , НСтр("es='Arbitrario';ru='Произвольная';en='arbitrary'"));
	//СписокВыбора.Добавить("<основная>" ,"Основная");
	//СписокВыбора.Добавить("Выбрать..." ,"Произвольная");
	// << [Деснол] [Ушаков А.Д.] [03.10.2019] 
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораСпособаЗаполненияКвалификации", ЭтаФорма);
	ПоказатьВыборИзСписка(ОписаниеОповещения,СписокВыбора, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура КвалификацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнятьПериодИВремяРаботПриИзменении(Элемент)
	Элементы.ДеревоИсполнителейДатаНачала.Видимость       = ЗаполнятьПериодИВремяРабот;
	Элементы.ДеревоИсполнителейДатаОкончания.Видимость    = ЗаполнятьПериодИВремяРабот;
	Элементы.ДеревоИсполнителейВремяРаботыТекст.Видимость = ЗаполнятьПериодИВремяРабот;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнятьКТУИСуммуПриИзменении(Элемент)
	Элементы.ДеревоИсполнителейКТУ.Видимость              = ЗаполнятьКТУИСумму;
	Элементы.ДеревоИсполнителейСуммаКНачислению.Видимость = ЗаполнятьКТУИСумму;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоИсполнителей

&НаКлиенте
Процедура ДеревоИсполнителейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	
	ТекущиеДанные = Элементы.ДеревоИсполнителей.ТекущиеДанные;
	
	Если Не ТекущиеДанные = Неопределено Тогда
		Если Не (ТекущиеДанные.Уровень = 2
			ИЛИ ТекущиеДанные.Уровень = 3) Тогда
			ТекстСообщения = НСтр("es='De los ejecutores es posible дабавлять solamente para los trabajos de reparación.';ru='Исполнителей можно дабавлять только для ремонтных работ.';en='Executors can be added only for repair work.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Иначе
			
			СтрокаРодитель = ?(ТекущиеДанные.Уровень = 2, ТекущиеДанные, ТекущиеДанные.ПолучитьРодителя());
			
			НовыйИсполнитель = СтрокаРодитель.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(НовыйИсполнитель, СтрокаРодитель, "ID, РемонтыОборудования_ID, Родитель_ID, ДатаНачалаРемонта");

			
			НовыйИсполнитель.Исполнитель_ID = Строка(Новый УникальныйИдентификатор);
			НовыйИсполнитель.Уровень = 3;
			
			ИдентификаторСтроки = НовыйИсполнитель.ПолучитьИдентификатор();
			Элементы.ДеревоИсполнителей.ТекущаяСтрока = ИдентификаторСтроки;
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоИсполнителейПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоИсполнителей.ТекущиеДанные;
	
	РазрешеноДобавление = Ложь;
	
	Если Не ТекущиеДанные = Неопределено И Не (ТекущиеДанные.Уровень = 2 ИЛИ ТекущиеДанные.Уровень = 3) Тогда
		РазрешеноДобавление = Ложь;
	ИначеЕсли Не ТекущиеДанные = Неопределено Тогда
		РазрешеноДобавление = Истина;
	КонецЕсли; 
	
	Элементы.ДеревоИсполнителейДобавить.Доступность                = РазрешеноДобавление;
	Элементы.ДеревоИсполнителейКонтекстноеМенюДобавить.Доступность = РазрешеноДобавление;
	
	РазрешеноУдаление = Ложь;
	
	Если Не ТекущиеДанные = Неопределено И ТекущиеДанные.Уровень = 3 Тогда
		РазрешеноУдаление = Истина;
	ИначеЕсли Не ТекущиеДанные = Неопределено Тогда
		РазрешеноУдаление = Ложь;
	КонецЕсли;	
	
	Элементы.ДеревоИсполнителейУдалить.Доступность                 = РазрешеноУдаление;
	Элементы.ДеревоИсполнителейКонтекстноеМенюУдалить.Доступность  = РазрешеноУдаление;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоИсполнителейВремяРаботыТекстНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ДеревоИсполнителей.ТекущиеДанные;
	
	Если Не ТекущиеДанные = Неопределено Тогда
		
		торо_ЗаполнениеДокументовКлиент.ОткрытьФормуПодбораПродолжительности(ТекущиеДанные.ВремяРаботы, Элемент, Этаформа.УникальныйИдентификатор);

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоИсполнителейВремяРаботыТекстОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ДеревоИсполнителей.ТекущиеДанные;
	
	Если Не ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные.ВремяРаботыТекст = СформироватьПродолжительность(ВыбранноеЗначение);
		ТекущиеДанные.ВремяРаботы      = ВыбранноеЗначение;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДеревоИсполнителейСотрудникОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ДеревоИсполнителей.ТекущиеДанные;
	Если Не ТекДанные = Неопределено И Не ВыбранноеЗначение = Неопределено Тогда
		ТекДанные.Квалификация = торо_ПроцедурыУправленияПерсоналом.ПолучитьОсновнуюКвалификацию(ВыбранноеЗначение);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДеревоИсполнителейДатаНачалаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоИсполнителей.ТекущиеДанные;
	
	Если Не ТекущиеДанные = Неопределено Тогда
		РассчитатьВремя(ТекущиеДанные);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДеревоИсполнителейДатаОкончанияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоИсполнителей.ТекущиеДанные;
	
	Если Не ТекущиеДанные = Неопределено Тогда
		РассчитатьВремя(ТекущиеДанные);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	Массив = Новый Массив;
	
	Для каждого Объекты Из ДеревоИсполнителей.ПолучитьЭлементы() Цикл
		Для каждого Ремонт Из Объекты.ПолучитьЭлементы() Цикл
			Для каждого РемРабота Из Ремонт.ПолучитьЭлементы() Цикл
				Для каждого СтрокаИсполнитель Из РемРабота.ПолучитьЭлементы() Цикл
					
					СтруктураСтроки = Новый Структура;
					СтруктураСтроки = Новый Структура();
					СтруктураСтроки.Вставить("РемонтыОборудования_ID");
					СтруктураСтроки.Вставить("ID"                    );
					СтруктураСтроки.Вставить("Родитель_ID"           );
					СтруктураСтроки.Вставить("РемонтнаяРабота"       );
					СтруктураСтроки.Вставить("ОбъектРемонта"         );
					СтруктураСтроки.Вставить("ВидРемонтныхРабот"     );
					СтруктураСтроки.Вставить("ДатаНачалаРемонта"     );
					СтруктураСтроки.Вставить("ДатаОкончанияРемонта"  );
					СтруктураСтроки.Вставить("Квалификация"          );
					СтруктураСтроки.Вставить("ДатаНачала"            );
					СтруктураСтроки.Вставить("ДатаОкончания"         );
					СтруктураСтроки.Вставить("КТУ"                   );
					СтруктураСтроки.Вставить("ВремяРаботы"           ); 
					СтруктураСтроки.Вставить("ВремяРаботыТекст"      );
					СтруктураСтроки.Вставить("СуммаКНачислению"      );
					СтруктураСтроки.Вставить("Сотрудник"             );
					
					ЗаполнитьЗначенияСвойств(СтруктураСтроки, СтрокаИсполнитель);
					СтруктураСтроки.ВидРемонтныхРабот = СтрокаИсполнитель.ВидРемонта;
					Массив.Добавить(СтруктураСтроки);
				КонецЦикла; 
			КонецЦикла; 
		КонецЦикла; 
	КонецЦикла;
	
	ЭтаФорма.Закрыть(Массив);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	ID_Строки = Элементы.ДеревоИсполнителей.ТекущаяСтрока;
	
	Если ID_Строки <> Неопределено Тогда 
		СтрокаПоз = ДеревоИсполнителей.НайтиПоИдентификатору(ID_Строки);
		
		ЗаполнитьДеревоНаСервере(); 
		
		Для Каждого Строка Из ДеревоИсполнителей.ПолучитьЭлементы() Цикл
			РазвернутьДеревоРемонтныхРабот(Строка, СтрокаПоз);
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьВсе(Команда)
	УстановитьФлаги(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьВыделение(Команда)
	УстановитьФлаги(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура Инвертировать(Команда)
	УстановитьФлаги();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция СформироватьПродолжительность(ПродолжительностьВСекундах)
	
	Если ПродолжительностьВСекундах = 0 Тогда
		
		Возврат "Ввести продолжительность";
		
	Иначе
		
		Часы    = Цел(ПродолжительностьВСекундах / 3600);
		Минуты  = Цел((ПродолжительностьВСекундах - 3600 * Часы) / 60);
		Секунды = ПродолжительностьВСекундах - 3600 * Часы - Минуты * 60;
		
		// >> [Деснол] [Ушаков А.Д.] [26.09.2019] 
		ПродолжительностьСтрокой = СтрШаблон(НСтр("es='%1 h. %2 min. %3 sec.';ru='%1 ч. %2 мин. %3 с.';en='%1 hr.%2 min. %3 s'"), Часы, Минуты, Секунды);
		
		//Возврат "" + Часы + " ч. " + Минуты + " мин. " + Секунды + " с.";
		Возврат ПродолжительностьСтрокой;
		// << [Деснол] [Ушаков А.Д.] [26.09.2019] 		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура РассчитатьВремя(ТекущиеДанные)
	
	ТекущиеДанные.ВремяРаботы = ТекущиеДанные.ДатаОкончания - ТекущиеДанные.ДатаНачала;
	ТекущиеДанные.ВремяРаботыТекст = СформироватьПродолжительность(ТекущиеДанные.ВремяРаботы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораСпособаЗаполненияКвалификации(ВыбранноеЗначение, ДопПараметры) Экспорт
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	// >> [Деснол] [Ушаков А.Д.] [03.10.2019]
	Если ВыбранноеЗначение.Представление = НСтр("es='Arbitrario';ru='Произвольная';en='arbitrary'") Тогда
	//Если ВыбранноеЗначение.Представление = "Произвольная" Тогда
	// << [Деснол] [Ушаков А.Д.] [03.10.2019] 
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораКвалификации", ЭтаФорма);
		
		ОткрытьФорму("Справочник.торо_КвалификацииРемонтногоПерсонала.ФормаВыбора",,ЭтаФорма,,ВариантОткрытияОкна.ОтдельноеОкно,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);		
		
	Иначе
		// >> [Деснол] [Ушаков А.Д.] [03.10.2019] 
		//Квалификация = "<основная>";
		Квалификация = дс_ПолучитьОсновнуюКвалификацию();
		// << [Деснол] [Ушаков А.Д.] [03.10.2019] 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораКвалификации(ВыбраннаяКвалификация, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(ВыбраннаяКвалификация) Тогда
		Квалификация = ВыбраннаяКвалификация;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КвалификацияОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	// >> [Деснол] [Ушаков А.Д.] [03.10.2019] 
	Квалификация = дс_ПолучитьОсновнуюКвалификацию();
	//Квалификация = "<основная>";
	// << [Деснол] [Ушаков А.Д.] [03.10.2019] 
КонецПроцедуры

&НаСервере
Функция ПодготовитьТаблицуДанных(МассивИсполнителей)
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	
	ДобавитьКолонкиВТаблицу(ТаблицаДанных);
	
	Если МассивИсполнителей.Количество() > 0 Тогда
		Для каждого СтруктураДанных Из МассивИсполнителей Цикл
			
			ЗаполнитьЗначенияСвойств(ТаблицаДанных.Добавить(), СтруктураДанных);
			
		КонецЦикла; 
	КонецЕсли; 
	
	Возврат ТаблицаДанных;
	
КонецФункции
 
&НаСервере
Процедура ПостроитьДеревоИсполнителей(Результат)
	
	ДеревоИсполнителей.ПолучитьЭлементы().Очистить();

	ВыборкаОР = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаОР.Следующий() Цикл
		
		СтрокаОР = ДеревоИсполнителей.ПолучитьЭлементы().Добавить();
		СтрокаОР.ОбъектРемонта = ВыборкаОР.ОбъектРемонта;
		СтрокаОР.Уровень = 0;
		
		ВыборкаВР = ВыборкаОР.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаВР.Следующий() Цикл
			
			СтрокаВР = СтрокаОР.ПолучитьЭлементы().Добавить();
			СтрокаВР.ВидРемонта = ВыборкаВР.ВидРемонта;
			СтрокаВР.Уровень = 1;
			
			ВыборкаРР = ВыборкаВР.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаРР.Следующий() Цикл
				
				СтрокаРР = СтрокаВР.ПолучитьЭлементы().Добавить();
				СтрокаРР.РемонтнаяРабота = ВыборкаРР.РемонтнаяРабота;
				СтрокаРР.Уровень = 2;
				
				ВыборкаДетальныеЗаписи = ВыборкаРР.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
					ЗаполнитьЗначенияСвойств(СтрокаРР, ВыборкаДетальныеЗаписи,"ID, РемонтыОборудования_ID, Родитель_ID, ДатаНачалаРемонта");
					СтрокаДетЗаписи = СтрокаРР.ПолучитьЭлементы().Добавить();
					
					ЗаполнитьЗначенияСвойств(СтрокаДетЗаписи,ВыборкаДетальныеЗаписи);
					СтрокаДетЗаписи.Исполнитель_ID = Новый УникальныйИдентификатор;
					СтрокаДетЗаписи.Уровень = 3;
					СтрокаДетЗаписи.ВремяРаботыТекст = СформироватьПродолжительность(СтрокаДетЗаписи.ВремяРаботы);
				КонецЦикла;
				
			КонецЦикла;
			
			СтрокаВР.Ремонт = Строка(ВыборкаВР.ВидРемонта) + " ("+СтрокаДетЗаписи.ДатаНачалаРемонта+" - "+СтрокаДетЗаписи.ДатаОкончанияРемонта+")";
			
			СтрокаВР.ДатаНачалаРемонта = СтрокаДетЗаписи.ДатаНачалаРемонта;
			СтрокаВР.ДатаОкончанияРемонта = СтрокаДетЗаписи.ДатаОкончанияРемонта;
			
		КонецЦикла;
		
	КонецЦикла;
		
КонецПроцедуры

&НаСервере 
Процедура ДобавитьКолонкиВТаблицу(ТаблицаДанных)
	
	// идентификаторы
	МассивТиповСтрока = Новый Массив;
	МассивТиповСтрока.Добавить(Тип("Строка"));
	
	ТипСтрока = Новый ОписаниеТипов(МассивТиповСтрока,,,,Новый КвалификаторыСтроки(36));
	
	// даты
	МассивТиповДата = Новый Массив;
	МассивТиповДата.Добавить(Тип("Дата"));
	
	ТипДата = Новый ОписаниеТипов(МассивТиповДата,,,,,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
	
	
		
	ТаблицаДанных.Колонки.Добавить("РемонтыОборудования_ID", ТипСтрока);
	ТаблицаДанных.Колонки.Добавить("ID"                    , ТипСтрока);
	ТаблицаДанных.Колонки.Добавить("Родитель_ID"           , ТипСтрока);
	ТаблицаДанных.Колонки.Добавить("Исполнитель_ID"        , ТипСтрока);
	//
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.торо_ТехнологическиеОперации"));
	
	Тип = Новый ОписаниеТипов(МассивТипов);
	ТаблицаДанных.Колонки.Добавить("РемонтнаяРабота"       , Тип);
	
	//
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.торо_ОбъектыРемонта"));
	
	Тип = Новый ОписаниеТипов(МассивТипов);
	
	ТаблицаДанных.Колонки.Добавить("ОбъектРемонта"         , Тип);
	
	//
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.торо_ВидыРемонтов"));
	
	Тип = Новый ОписаниеТипов(МассивТипов);

	ТаблицаДанных.Колонки.Добавить("ВидРемонта"            , Тип);
	
	//
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.торо_КвалификацииРемонтногоПерсонала"));
	
	Тип = Новый ОписаниеТипов(МассивТипов);
	ТаблицаДанных.Колонки.Добавить("Квалификация"          , Тип);
	
	//
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.Сотрудники"));
	
	Тип = Новый ОписаниеТипов(МассивТипов);
	ТаблицаДанных.Колонки.Добавить("Сотрудник"             , Тип);

    // Дата
	ТаблицаДанных.Колонки.Добавить("ДатаНачала"            , ТипДата);
	ТаблицаДанных.Колонки.Добавить("ДатаОкончания"         , ТипДата);
	ТаблицаДанных.Колонки.Добавить("ДатаНачалаРемонта"     , ТипДата);
	ТаблицаДанных.Колонки.Добавить("ДатаОкончанияРемонта"  , ТипДата);
	
	// Число
	МассивТиповЧисло = Новый Массив;
	МассивТиповЧисло.Добавить(Тип("Число"));
	
	ТаблицаДанных.Колонки.Добавить("КТУ"                   , Новый ОписаниеТипов(МассивТиповЧисло,,,Новый КвалификаторыЧисла(5 ,2,ДопустимыйЗнак.Неотрицательный)));
	ТаблицаДанных.Колонки.Добавить("ВремяРаботы"           , Новый ОписаниеТипов(МассивТиповЧисло,,,Новый КвалификаторыЧисла(10,0,ДопустимыйЗнак.Неотрицательный)));
	ТаблицаДанных.Колонки.Добавить("СуммаКНачислению"      , Новый ОписаниеТипов(МассивТиповЧисло,,,Новый КвалификаторыЧисла(15,2,ДопустимыйЗнак.Неотрицательный)));
	ТаблицаДанных.Колонки.Добавить("Уровень"               , Новый ОписаниеТипов(МассивТиповЧисло,,,Новый КвалификаторыЧисла(3 ,0,ДопустимыйЗнак.Неотрицательный)));
		
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДеревоРемонтныхРабот(Родитель, СтрокаПоз = Неопределено)
	
	Элементы.ДеревоИсполнителей.Развернуть(Родитель.ПолучитьИдентификатор());
	Для Каждого Строка Из Родитель.ПолучитьЭлементы() Цикл
		Если СтрокаПоз <> Неопределено 
			И Строка.Исполнитель_ID = СтрокаПоз.Исполнитель_ID 
			И Строка.ID = СтрокаПоз.ID
			И Строка.РемонтыОборудования_ID = СтрокаПоз.РемонтыОборудования_ID 
			И Строка.Родитель_ID = СтрокаПоз.Родитель_ID
			И Строка.Уровень = СтрокаПоз.Уровень Тогда
				Элементы.ДеревоИсполнителей.ТекущаяСтрока = Строка.ПолучитьИдентификатор();
		КонецЕсли;
		РазвернутьДеревоРемонтныхРабот(Строка, СтрокаПоз);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоНаСервере()
	
	ДеревоЗначений = РеквизитФормыВЗначение("ДеревоИсполнителей");
	
	МассивСтрокДерева = ДеревоЗначений.Строки.НайтиСтроки(Новый Структура("Уровень, Выбран",3,Истина),Истина);
	
	ТЗИсполнителей = Новый ТаблицаЗначений;
	
	ДобавитьКолонкиВТаблицу(ТЗИсполнителей);
		
	
	Для каждого СтрокаДерева Из МассивСтрокДерева Цикл  // исполнителей из каждой работы переносим в ТЗИсполнителей
		ЗаполнитьЗначенияСвойств(ТЗИсполнителей.Добавить(),СтрокаДерева);
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	//Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТабИсполнителей.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	               |	ТабИсполнителей.ОбъектРемонта КАК ОбъектРемонта,
	               |	ТабИсполнителей.ВидРемонта КАК ВидРемонта,
	               |	ТабИсполнителей.ДатаНачалаРемонта КАК ДатаНачалаРемонта,
	               |	ТабИсполнителей.ДатаОкончанияРемонта КАК ДатаОкончанияРемонта,
	               |	ТабИсполнителей.РемонтнаяРабота КАК РемонтнаяРабота,
	               |	ТабИсполнителей.Сотрудник КАК Сотрудник,
	               |	ТабИсполнителей.ДатаНачала КАК ДатаНачала,
	               |	ТабИсполнителей.ДатаОкончания КАК ДатаОкончания,
	               |	ТабИсполнителей.КТУ КАК КТУ,
	               |	ТабИсполнителей.ВремяРаботы КАК ВремяРаботы,
	               |	ТабИсполнителей.СуммаКНачислению КАК СуммаКНачислению,
	               |	ТабИсполнителей.ID КАК ID,
	               |	ТабИсполнителей.Уровень КАК Уровень,
	               |	ТабИсполнителей.Квалификация КАК Квалификация,
	               |	ТабИсполнителей.Исполнитель_ID КАК Исполнитель_ID
	               |ПОМЕСТИТЬ ТабИсполнителей
	               |ИЗ
	               |	&ТабИсполнителей КАК ТабИсполнителей
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(торо_КвалификацияРемонтногоПерсонала.Период) КАК Период,
	               |	ВЫБОР
	               |		КОГДА &Сотрудник <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	               |				И (ТабИсполнителей.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	               |					ИЛИ НЕ &ТолькоДляНеустановленныхСотрудников)
	               |			ТОГДА &Сотрудник
	               |		ИНАЧЕ ТабИсполнителей.Сотрудник
	               |	КОНЕЦ КАК Сотрудник
	               |ПОМЕСТИТЬ МаксПериоды
	               |ИЗ
	               |	ТабИсполнителей КАК ТабИсполнителей
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_КвалификацияРемонтногоПерсонала КАК торо_КвалификацияРемонтногоПерсонала
	               |		ПО ТабИсполнителей.ДатаНачалаРемонта > торо_КвалификацияРемонтногоПерсонала.Период
	               |			И (НЕ торо_КвалификацияРемонтногоПерсонала.Удаленная)
	               |			И (ВЫБОР
	               |				КОГДА &Сотрудник <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	               |						И (ТабИсполнителей.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	               |							ИЛИ НЕ &ТолькоДляНеустановленныхСотрудников)
	               |					ТОГДА торо_КвалификацияРемонтногоПерсонала.Сотрудник = &Сотрудник
	               |				ИНАЧЕ ТабИсполнителей.Сотрудник = торо_КвалификацияРемонтногоПерсонала.Сотрудник
	               |			КОНЕЦ)
	               |			И (ВЫБОР
	               |				КОГДА ТабИсполнителей.Квалификация = ЗНАЧЕНИЕ(Справочник.торо_КвалификацииРемонтногоПерсонала.ПустаяСсылка)
	               |						ИЛИ НЕ &НеОчищатьКвалификацию
	               |					ТОГДА ВЫБОР
	               |							КОГДА &ЗаполнятьОснКвалификацию
	               |								ТОГДА торо_КвалификацияРемонтногоПерсонала.Основная
	               |							КОГДА &Квалификация <> ЗНАЧЕНИЕ(Справочник.торо_КвалификацииРемонтногоПерсонала.ПустаяСсылка)
	               |								ТОГДА торо_КвалификацияРемонтногоПерсонала.Квалификация = &Квалификация
	               |							ИНАЧЕ ТабИсполнителей.Квалификация = торо_КвалификацияРемонтногоПерсонала.Квалификация
	               |						КОНЕЦ
	               |				ИНАЧЕ ЛОЖЬ
	               |			КОНЕЦ)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВЫБОР
	               |		КОГДА &Сотрудник <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	               |				И (ТабИсполнителей.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	               |					ИЛИ НЕ &ТолькоДляНеустановленныхСотрудников)
	               |			ТОГДА &Сотрудник
	               |		ИНАЧЕ ТабИсполнителей.Сотрудник
	               |	КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	торо_КвалификацияРемонтногоПерсонала.Период КАК Период,
	               |	торо_КвалификацияРемонтногоПерсонала.НомерСтроки КАК НомерСтроки,
	               |	торо_КвалификацияРемонтногоПерсонала.Сотрудник КАК Сотрудник,
	               |	торо_КвалификацияРемонтногоПерсонала.Квалификация КАК Квалификация,
	               |	торо_КвалификацияРемонтногоПерсонала.Основная КАК Основная,
	               |	торо_КвалификацияРемонтногоПерсонала.Удаленная КАК Удаленная
	               |ПОМЕСТИТЬ КвалификацииМаксПериоды
	               |ИЗ
	               |	МаксПериоды КАК МаксПериоды
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_КвалификацияРемонтногоПерсонала КАК торо_КвалификацияРемонтногоПерсонала
	               |		ПО МаксПериоды.Период = торо_КвалификацияРемонтногоПерсонала.Период
	               |			И МаксПериоды.Сотрудник = торо_КвалификацияРемонтногоПерсонала.Сотрудник
	               |			И (ВЫБОР
	               |				КОГДА &ЗаполнятьОснКвалификацию
	               |					ТОГДА торо_КвалификацияРемонтногоПерсонала.Основная
	               |				КОГДА ТИПЗНАЧЕНИЯ(&Квалификация) = ТИП(Справочник.торо_КвалификацииРемонтногоПерсонала)
	               |						И &Квалификация <> ЗНАЧЕНИЕ(Справочник.торо_КвалификацииРемонтногоПерсонала.ПустаяСсылка)
	               |					ТОГДА торо_КвалификацияРемонтногоПерсонала.Квалификация = &Квалификация
	               |				ИНАЧЕ ЛОЖЬ
	               |			КОНЕЦ)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТабИсполнителей.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	               |	ТабИсполнителей.ОбъектРемонта КАК ОбъектРемонта,
	               |	ТабИсполнителей.ВидРемонта КАК ВидРемонта,
	               |	ТабИсполнителей.ДатаНачалаРемонта КАК ДатаНачалаРемонта,
	               |	ТабИсполнителей.ДатаОкончанияРемонта КАК ДатаОкончанияРемонта,
	               |	ТабИсполнителей.РемонтнаяРабота КАК РемонтнаяРабота,
	               |	ВЫБОР
	               |		КОГДА НЕ &ЗаполнятьПериодИВремяРабот
						|			ТОГДА ТабИсполнителей.ДатаНачала
	               |		КОГДА &НеОчищатьДатуНачала ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
						|			ТОГДА ТабИсполнителей.ДатаНачала
		            |		ИНАЧЕ  &ДатаНачала
	               |	КОНЕЦ КАК ДатаНачала,
		            |	ВЫБОР
	               |		КОГДА НЕ &ЗаполнятьПериодИВремяРабот
						|			ТОГДА ТабИсполнителей.ДатаОкончания
	               |		КОГДА &НеОчищатьДатуОкончания ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
						|			ТОГДА ТабИсполнителей.ДатаОкончания
		            |		ИНАЧЕ  &ДатаОкончания
	               |	КОНЕЦ КАК ДатаОкончания,
		            |	ТабИсполнителей.КТУ КАК КТУ,
	               |	ТабИсполнителей.ВремяРаботы КАК ВремяРаботы,
	               |	ТабИсполнителей.СуммаКНачислению КАК СуммаКНачислению,
	               |	ТабИсполнителей.ID КАК ID,
	               |	ТабИсполнителей.Уровень КАК Уровень,
	               |	ВЫБОР
	               |		КОГДА &Сотрудник <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	               |				И (ТабИсполнителей.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	               |					ИЛИ НЕ &ТолькоДляНеустановленныхСотрудников)
	               |			ТОГДА &Сотрудник
	               |		ИНАЧЕ ТабИсполнителей.Сотрудник
	               |	КОНЕЦ КАК Сотрудник,
	               |	ВЫБОР
	               |		КОГДА КвалификацииМаксПериоды.Квалификация ЕСТЬ NULL
	               |			ТОГДА ВЫБОР
	               |					КОГДА &НеОчищатьКвалификацию
	               |						ТОГДА ТабИсполнителей.Квалификация
	               |					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.торо_КвалификацииРемонтногоПерсонала.ПустаяСсылка)
	               |				КОНЕЦ
	               |		ИНАЧЕ КвалификацииМаксПериоды.Квалификация
	               |	КОНЕЦ КАК Квалификация,
	               |	ТабИсполнителей.Исполнитель_ID КАК Исполнитель_ID
	               |ПОМЕСТИТЬ СДатамиНачалаИОкончания
	               |ИЗ
	               |	ТабИсполнителей КАК ТабИсполнителей
	               |		ЛЕВОЕ СОЕДИНЕНИЕ КвалификацииМаксПериоды КАК КвалификацииМаксПериоды
	               |		ПО (ВЫБОР
	               |				КОГДА &Сотрудник <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	               |						И (ТабИсполнителей.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	               |							ИЛИ НЕ &ТолькоДляНеустановленныхСотрудников)
	               |					ТОГДА &Сотрудник = КвалификацииМаксПериоды.Сотрудник
	               |				ИНАЧЕ ТабИсполнителей.Сотрудник = КвалификацииМаксПериоды.Сотрудник
	               |			КОНЕЦ)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СДатамиНачалаИОкончания.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	               |	СДатамиНачалаИОкончания.ОбъектРемонта КАК ОбъектРемонта,
	               |	СДатамиНачалаИОкончания.ВидРемонта КАК ВидРемонта,
	               |	СДатамиНачалаИОкончания.ДатаНачалаРемонта КАК ДатаНачалаРемонта,
	               |	СДатамиНачалаИОкончания.ДатаОкончанияРемонта КАК ДатаОкончанияРемонта,
	               |	СДатамиНачалаИОкончания.РемонтнаяРабота КАК РемонтнаяРабота,
	               |	СДатамиНачалаИОкончания.ДатаНачала КАК ДатаНачала,
	               |	СДатамиНачалаИОкончания.ДатаОкончания КАК ДатаОкончания,
	               |	ВЫБОР
	               |		КОГДА НЕ &ЗаполнятьПериодИВремяРабот
	               |			ТОГДА СДатамиНачалаИОкончания.ВремяРаботы
	               |		КОГДА СДатамиНачалаИОкончания.ДатаНачала <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |				И СДатамиНачалаИОкончания.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |			ТОГДА РАЗНОСТЬДАТ(СДатамиНачалаИОкончания.ДатаНачала, СДатамиНачалаИОкончания.ДатаОкончания, СЕКУНДА)
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ВремяРаботы,
	               |	СДатамиНачалаИОкончания.КТУ КАК КТУ,
	               |	СДатамиНачалаИОкончания.СуммаКНачислению КАК СуммаКНачислению,
	               |	СДатамиНачалаИОкончания.ID КАК ID,
	               |	СДатамиНачалаИОкончания.Уровень КАК Уровень,
	               |	СДатамиНачалаИОкончания.Сотрудник КАК Сотрудник,
	               |	СДатамиНачалаИОкончания.Квалификация КАК Квалификация,
	               |	СДатамиНачалаИОкончания.Исполнитель_ID КАК Исполнитель_ID
	               |ИЗ
	               |	СДатамиНачалаИОкончания КАК СДатамиНачалаИОкончания";
				   	
	Запрос.УстановитьПараметр("ТабИсполнителей"                    , ТЗИсполнителей);
	Запрос.УстановитьПараметр("ТолькоДляНеустановленныхСотрудников", НеОчищатьСотрудника);
	Запрос.УстановитьПараметр("Сотрудник"                          , Сотрудник);
	Запрос.УстановитьПараметр("НеОчищатьКвалификацию"              , НеОчищатьКвалификацию);
	// << [Деснол] [Ушаков А.Д.] [03.10.2019] 
	Запрос.УстановитьПараметр("Квалификация"                       , ?(Квалификация = дс_ПолучитьОсновнуюКвалификацию() ,Справочники.торо_КвалификацииРемонтногоПерсонала.ПустаяСсылка(),Квалификация));
	Запрос.УстановитьПараметр("ЗаполнятьОснКвалификацию"           , Квалификация = дс_ПолучитьОсновнуюКвалификацию());
	//Запрос.УстановитьПараметр("Квалификация"                       , ?(Квалификация = "<основная>",Справочники.торо_КвалификацииРемонтногоПерсонала.ПустаяСсылка(),Квалификация));
	//Запрос.УстановитьПараметр("ЗаполнятьОснКвалификацию"           , Квалификация = "<основная>");
	// << [Деснол] [Ушаков А.Д.] [03.10.2019] 
	Запрос.УстановитьПараметр("ЗаполнятьПериодИВремяРабот"         , ЗаполнятьПериодИВремяРабот);
	Запрос.УстановитьПараметр("ДатаНачала"                         , ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания"                      , ДатаОкончания);
	Запрос.УстановитьПараметр("НеОчищатьДатуНачала"                , НеОчищатьДатуНачала);
	Запрос.УстановитьПараметр("НеОчищатьДатуОкончания"             , НеОчищатьДатуОкончания);
		
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МассивСтрокДерева = ДеревоЗначений.Строки.НайтиСтроки(Новый Структура("ID, РемонтыОборудования_ID,Исполнитель_ID", Выборка.ID,Выборка.РемонтыОборудования_ID,Выборка.Исполнитель_ID), Истина);
		
		Для Каждого СтрокаДерева Из МассивСтрокДерева Цикл
			ЗаполнитьЗначенияСвойств(СтрокаДерева, Выборка);
			СтрокаДерева.ВремяРаботыТекст = СформироватьПродолжительность(СтрокаДерева.ВремяРаботы);
		КонецЦикла;

	КонецЦикла; 
	
	ЗначениеВРеквизитФормы(ДеревоЗначений,"ДеревоИсполнителей");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлаги(НужноУстановить = Неопределено)
	
	Для каждого Объекты Из ДеревоИсполнителей.ПолучитьЭлементы() Цикл
		Для каждого Ремонт Из Объекты.ПолучитьЭлементы() Цикл
			Для каждого РемРабота Из Ремонт.ПолучитьЭлементы() Цикл
				Для каждого СтрокаИсполнитель Из РемРабота.ПолучитьЭлементы() Цикл
					СтрокаИсполнитель.Выбран = ?(НужноУстановить = Неопределено, Не СтрокаИсполнитель.Выбран, НужноУстановить);				
				КонецЦикла; 
			КонецЦикла; 
		КонецЦикла; 
	КонецЦикла;
		
КонецПроцедуры

// >> [Деснол] [Ушаков А.Д.] [03.10.2019]
&НаКлиентеНаСервереБезКонтекста
Функция дс_ПолучитьОсновнуюКвалификацию()
	Возврат НСтр("es='<principal>';ru='<основная>';en='<basic>'");
КонецФункции
// << [Деснол] [Ушаков А.Д.] [03.10.2019] 

#КонецОбласти



 
 
