
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ОткрытИзТК") Тогда 
		НеОбновлятьПриЗаписи = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если НеОбновлятьПриЗаписи = Ложь И Отказ = Ложь Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	гкс_ТехническиеМеста.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.гкс_ТехническиеМеста КАК гкс_ТехническиеМеста
			|ГДЕ
			|	гкс_ТехническиеМеста.Здание = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		ТемпМассив = Новый Массив();
		Пока Выборка.Следующий() Цикл
			ТемпМассив.Добавить(Выборка.Ссылка);
		КонецЦикла;
		Справочники.гкс_ТехническиеМеста.ОбновитьНаименование(ТемпМассив);
	КонецЕсли;
КонецПроцедуры
