#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("РаботаВАвтономномРежиме") Тогда
		ВызватьИсключение НСтр("es='El cambio амортизационных de los grupos OKOF en el régimen ""del puesto de trabajo Autónomo"" es prohíbido';ru='Изменение амортизационных групп ОКОФ в режиме ""Автономного рабочего места"" запрещено';en='Change of OKOF depreciation groups in the ""Autonomous workplace"" mode is prohibited'");
	КонецЕсли;

КонецПроцедуры
#КонецОбласти

#КонецЕсли