#Область СлужебныйПрограммныйИнтерфейс

// ПОлучает Индекст картинки ОР в дереве
Функция гкс_ПолучитьИндексКартинкиДереваНеавтоматическойИерархии(ПометкаУдаления, ЭтоГруппа, ЭтоСоставной, ЭтоФМ = Ложь) Экспорт
	ИндексКартинки = 0;
	
	Если ЭтоГруппа Тогда
		Если ПометкаУдаления Тогда
			ИндексКартинки = 6;
		Иначе
			ИндексКартинки = 5;
		КонецЕсли;
	ИначеЕсли ЭтоФМ Тогда
		Если ПометкаУдаления Тогда
			ИндексКартинки = 12;
		Иначе
			ИндексКартинки = 11;
		КонецЕсли;
	ИначеЕсли ЭтоСоставной Тогда
		Если ПометкаУдаления Тогда
			ИндексКартинки = 3;
		Иначе
			ИндексКартинки = 2;
		КонецЕсли;
	Иначе
		Если ПометкаУдаления Тогда
			ИндексКартинки = 1;
		Иначе
			ИндексКартинки = 0;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ИндексКартинки;
	
КонецФункции

#КонецОбласти