#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НастроитьВыборИсточникаЗначений(Объект, Элементы);
	
	Если ЗначениеЗаполнено(Объект.Ссылка) И АтрибутИспользуется(Объект.Ссылка) Тогда
		Элементы.ТипЗначения.ТолькоПросмотр      = Истина;
		Элементы.ИсточникЗначений.ТолькоПросмотр = Истина;
	Иначе
		Элементы.ФормаРедактироватьАтрибут.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ТекущийОбъект.Ссылка) И АтрибутИспользуется(ТекущийОбъект.Ссылка) Тогда
		Элементы.ТипЗначения.ТолькоПросмотр      = Истина;
		Элементы.ИсточникЗначений.ТолькоПросмотр = Истина;
	Иначе
		Элементы.ФормаРедактироватьАтрибут.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипЗначенияПриИзменении(Элемент)
	НастроитьВыборИсточникаЗначений(Объект, Элементы);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РедактироватьАтрибут(Команда)
	
	ТекстВопроса = НСтр("ru='Внимание! При изменении типа значения атрибута, сохраненные значения атрибута будут потеряны. 
		|Редактировать атрибут?'");
	ПоказатьВопрос(Новый ОписаниеОповещения("РедактироватьАтрибутЗавершение", ЭтаФорма), 
		ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВыборИсточникаЗначений(Объект, Элементы)
	
	ОписаниеТиповСсылка = Новый ОписаниеТипов("СправочникСсылка.Классы, СправочникСсылка.НоменклатураКласса");
	ТипОбъектНоменклатуры = Тип("СправочникСсылка.ОбъектыНоменклатуры");
	ТипКласс              = Тип("СправочникСсылка.Классы");
	
	ПустойКласс = ПредопределенноеЗначение("Справочник.Классы.ПустаяСсылка");
	
	КлассИлиНоменклатура = ОписаниеТиповСсылка.СодержитТип(Объект.ТипЗначения.Типы()[0]);
	ОбъектНоменклатуры = Объект.ТипЗначения.СодержитТип(ТипОбъектНоменклатуры);
	Элементы.ИсточникЗначений.Доступность = (КлассИлиНоменклатура ИЛИ ОбъектНоменклатуры);
	
	Элементы.ИсточникЗначений.ВыбиратьТип = ОбъектНоменклатуры;
	Если КлассИлиНоменклатура И НЕ ОбъектНоменклатуры
			И НЕ ТипЗнч(Объект.ИсточникЗначений) = ТипКласс Тогда
		Объект.ИсточникЗначений = ПустойКласс;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция АтрибутИспользуется(АтрибутСсылка)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("АтрибутКласса", АтрибутСсылка);
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗначенияАтрибутовКласса.АтрибутКласса
		|ИЗ
		|	РегистрСведений.ЗначенияАтрибутовКласса КАК ЗначенияАтрибутовКласса
		|ГДЕ
		|	ЗначенияАтрибутовКласса.АтрибутКласса = &АтрибутКласса
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	МножественныеЗначенияАтрибутов.АтрибутКласса
		|ИЗ
		|	РегистрСведений.МножественныеЗначенияАтрибутов КАК МножественныеЗначенияАтрибутов
		|ГДЕ
		|	МножественныеЗначенияАтрибутов.АтрибутКласса = &АтрибутКласса";
	Результат = Запрос.Выполнить();
	Возврат НЕ Результат.Пустой();
	
КонецФункции

&НаКлиенте
Процедура РедактироватьАтрибутЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ТипЗначения.ТолькоПросмотр      = Ложь;
	Элементы.ИсточникЗначений.ТолькоПросмотр = Ложь;
	
	Элементы.ФормаРедактироватьАтрибут.Пометка     = Истина;
	Элементы.ФормаРедактироватьАтрибут.Доступность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Объект.ИмяДляОбмена = СтрЗаменить(Объект.Наименование, " ", "");
	
КонецПроцедуры

#КонецОбласти

// Раздел «Обработчики событий формы» содержит процедуры-обработчики событий формы: ПриСозданииНаСервере, ПриОткрытии и т.п.
// Раздел «Обработчики событий элементов шапки формы» содержит процедуры-обработчики элементов, расположенных в основной части формы (все, что не связано с таблицами на форме).
// В разделах «Обработчики событий элементов таблицы формы <имя таблицы формы>» размещаются процедуры-обработчики таблиц формы и элементов таблиц. 
// Для процедур-обработчиков каждой таблицы должен быть создан свой раздел.
// Раздел «Обработчики команд формы» содержит процедуры-обработчики команд формы (имена которых задаются в свойстве Действие команд формы).
// Раздел «Служебные процедуры и функции» имеет такое же предназначение, что и в общих модулях.