
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НовыеРеквизиты = Новый Массив;
	
	Языки = ПолучитьЯзыки();
	ЯзыкПоУмолчанию = ТекущийЯзыкИБ();
	
	Для каждого Язык Из Языки Цикл
		НовыйРеквизит = Новый РеквизитФормы(Язык.Код, Новый ОписаниеТипов("Строка"),,
			Метаданные.Языки[Язык.Ссылка.Наименование].Синоним);
		НовыеРеквизиты.Добавить(НовыйРеквизит);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Параметры.ПредставлениеРеквизита) Тогда
		АвтоЗаголовок = Ложь;
		Заголовок = Параметры.ПредставлениеРеквизита;
	КонецЕсли; 
	
	ИзменитьРеквизиты(НовыеРеквизиты);
	
	Для каждого Язык Из Языки Цикл
		НовыйЭлемент = Элементы.Добавить(Язык.Код, Тип("ПолеФормы"), Элементы.ГруппаПереводов);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = Язык.Код;
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
	КонецЦикла;
	
	Для каждого Перевод Из Параметры.Переводы Цикл
		ЭтаФорма[Перевод.Ключ.Код] = Перевод.Значение;
	КонецЦикла; 
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЯзыки()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_Языки.Ссылка КАК Ссылка,
		|	торо_Языки.Код КАК Код
		|ИЗ
		|	Справочник.торо_Языки КАК торо_Языки";
	
	ТаблицаЯзыков = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаЯзыков;
КонецФункции

&НаКлиенте
Процедура СохранитьПеревод(Команда)
	Результат = ПолучитьПереводы();
	Заполнено = ПроверитьЗаполнение();
	
	Если Заполнено Тогда
		ОповеститьОВыборе(Результат);
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	ЯзыкПоУмолчанию = ТекущийЯзыкИБ();
	ПроверяемыеРеквизиты.Добавить(ЯзыкПоУмолчанию.Код);
КонецПроцедуры

&НаСервере
Функция ПолучитьПереводы()
	Результат = Новый Структура("ИмяРеквизита,Переводы,Языки");
	Результат.ИмяРеквизита = Параметры.ИмяРеквизита;
	
	// >> [Деснол] [Ушаков А.Д.] [09.10.2019] 
	сЯзыки = Новый Соответствие;
	// << [Деснол] [Ушаков А.Д.] [09.10.2019] 
	Переводы = Новый Соответствие;
	Языки = ПолучитьЯзыки();
	
	Для каждого Язык Из Языки Цикл
		Переводы.Вставить(Язык.Ссылка, ЭтаФорма[Язык.Код]);
		// >> [Деснол] [Ушаков А.Д.] [09.10.2019] 
		сЯзыки.Вставить(Язык.Ссылка, Язык.Код);
		// << [Деснол] [Ушаков А.Д.] [09.10.2019] 
	КонецЦикла;
	
	Результат.Переводы = Переводы;
	// >> [Деснол] [Ушаков А.Д.] [09.10.2019] 
	Результат.Языки = сЯзыки;
	// << [Деснол] [Ушаков А.Д.] [09.10.2019] 
	
	Возврат Результат;
КонецФункции
 
&НаСервере
Функция ТекущийЯзыкИБ() Экспорт
	торо_Локализация.ТекущийЯзыкИБ();
КонецФункции