
&НаСервере
Процедура Расш_гкс_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// гкс+ [Часовые пояса] Куст 15.04.2020
	Сдвиг = Час(ТекущаяДатаСеанса()) - Час(ТекущаяДата());
	ТекстыЗамены = Новый Массив();
	ТекстыЗамены.Добавить(Новый Структура("До, После", "Документторо_ВнешнееОснованиеДляРабот.Дата КАК Дата,",
		"ДобавитьКДате(Документторо_ВнешнееОснованиеДляРАбот.Дата, Час, " + Сдвиг + ") КАК Дата,"));
	ТекстыЗамены.Добавить(Новый Структура("До, После", "Документторо_ВнешнееОснованиеДляРабот.ДатаСоздания КАК ДатаСоздания,",
		"ДобавитьКДате(Документторо_ВнешнееОснованиеДляРАбот.ДатаСоздания, Час, " + Сдвиг + ") КАК ДатаСоздания,"));
	Список.ТекстЗапроса = гкс_ЧасовыеПоясаВызовСервера.ИзменитьТекстЗапросаФормыСписка(
		Список.ТекстЗапроса, ТекстыЗамены);
	// гкс- [Часовые пояса] Куст 15.04.2020
КонецПроцедуры
