#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Исполнители") Тогда 
		Для Каждого СтрокаМассива Из Параметры.Исполнители Цикл
			НС = Исполнители.Добавить();
			ЗаполнитьЗначенияСвойств(НС, СтрокаМассива);
		КонецЦикла;
	Иначе
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Если Параметры.Свойство("Ремонты") Тогда 
		Для Каждого СтрокаМассива Из Параметры.Ремонты Цикл
			НС = Ремонты.Добавить();
			ЗаполнитьЗначенияСвойств(НС, СтрокаМассива);
		КонецЦикла;
	Иначе
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ИсполнителиВыбранПриИзменении(Элемент)
	ТекДанные = Элементы.Исполнители.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		Если ТекДанные.Выбран Тогда 
			Для Каждого СтрокаТаблицы Из Исполнители Цикл
				Если ТекДанные.ИД_Ремонта = СтрокаТаблицы.ИД_Ремонта
					И Не ТекДанные.Исполнитель = СтрокаТаблицы.Исполнитель Тогда 
					СтрокаТаблицы.Выбран = Ложь;
				КонецЕсли;
			КонецЦикла;
			Для Каждого СтрокаТаблицы Из Ремонты Цикл
				Если ТекДанные.ИД_Ремонта = СтрокаТаблицы.ИД_Ремонта Тогда 
					СтрокаТаблицы.Исполнитель = ТекДанные.Исполнитель;
				КонецЕсли;
			КонецЦикла;
		Иначе
			Для Каждого СтрокаТаблицы Из Ремонты Цикл
				Если ТекДанные.ИД_Ремонта = СтрокаТаблицы.ИД_Ремонта Тогда 
					СтрокаТаблицы.Исполнитель = Неопределено;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РемонтыПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.Ремонты.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		Элементы.Исполнители.ОтборСтрок = Новый ФиксированнаяСтруктура( 
			Новый Структура("ИД_Ремонта", ТекДанные.ИД_Ремонта));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Выбрать(Команда)
	МассивВозврата = Новый Массив();
	НомерПП = 1;
	Для Каждого СтрокаТаблицы Из Ремонты Цикл
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Исполнитель) Тогда 
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Не выбран исполнитель ремонта";
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;
		МассивВозврата.Добавить(Новый Структура("ИД_Ремонта,Исполнитель",
			СтрокаТаблицы.ИД_Ремонта, СтрокаТаблицы.Исполнитель));
		НомерПП = НомерПП + 1;
	КонецЦикла;
	Закрыть(МассивВозврата);
КонецПроцедуры
#КонецОбласти