#Область ОбработчикиСобытийФормы

&НаСервере
Процедура Расш_гкс_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// гкс+ [Интеграция] Куст 17.03.2020
	ДобавитьНовыеЭлементы();
	// гкс- [Интеграция] Куст 17.03.2020
КонецПроцедуры

// гкс+ [Интеграция] Куст 17.03.2020
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.гкс_СписокТегов > 0 Тогда 
		ТекстСообщения = НСтр("ru='Обязательные поля не заполнены!'");
		Сооб = Новый СообщениеПользователю();
		Сооб.Текст = ТекстСообщения;
		ЕстьОшибка = Ложь;
		Если ЗначениеЗаполнено(Объект.гкс_Организация) = Ложь Тогда 
			Сооб.Поле = "Объект.гкс_Организация";
			ЕстьОшибка = Истина;
		ИначеЕсли ЗначениеЗаполнено(Объект.гкс_Подразделение) = Ложь Тогда 
			Сооб.Поле = "Объект.гкс_Подразделение";
			ЕстьОшибка = Истина;
		ИначеЕсли ЗначениеЗаполнено(Объект.гкс_Ответственный) = Ложь Тогда 
			Сооб.Поле = "Объект.гкс_Ответственный";
			ЕстьОшибка = Истина;
		КонецЕсли;
		Если ЕстьОшибка Тогда 
			Отказ = Истина;
			Сооб.Сообщить();
			Возврат;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
// гкс- [Интеграция] Куст 17.03.2020

&НаКлиенте
Процедура Расш_гкс_ПриОткрытииПосле(Отказ)
	// гкс+ [Интеграция] Куст 17.03.2020
	гкс_СписокТеговПриИзменении(Истина);
	// гкс- [Интеграция] Куст 17.03.2020
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// гкс+ [Интеграция] Куст 17.03.2020
&НаСервере
Процедура ДобавитьНовыеЭлементы()
	НЭлем = Элементы.Добавить("гкс_ПорцияДень", Тип("ПолеФормы"));
	НЭлем.Вид = ВидПоляФормы.ПолеФлажка;
	НЭлем.ПутьКДанным = "Объект.гкс_ПорцияДень";
	//
	НЭлем = Элементы.Добавить("гкс_СписокТегов", Тип("ПолеФормы"));
	НЭлем.ПутьКДанным = "Объект.гкс_СписокТегов";
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.РежимВыбораИзСписка = Истина;
	НЭлем.СписокВыбора.Очистить();
	НЭлем.СписокВыбора.Добавить(0, "Не использовать");
	НЭлем.СписокВыбора.Добавить(1, "Наработка");
	НЭлем.СписокВыбора.Добавить(2, "Показатели");
	НЭлем.УстановитьДействие("ПриИзменении", "гкс_СписокТеговПриИзменении");
	//
	НЭлем = Элементы.Добавить("гкс_Организация", Тип("ПолеФормы"));
	НЭлем.ПутьКДанным = "Объект.гкс_Организация";
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.АвтоОтметкаНезаполненного = Истина;
	//
	НЭлем = Элементы.Добавить("гкс_Подразделение", Тип("ПолеФормы"));
	НЭлем.ПутьКДанным = "Объект.гкс_Подразделение";
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.АвтоОтметкаНезаполненного = Истина;
	//
	НЭлем = Элементы.Добавить("гкс_Ответственный", Тип("ПолеФормы"));
	НЭлем.ПутьКДанным = "Объект.гкс_Ответственный";
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.АвтоОтметкаНезаполненного = Истина;
	//
	НЭлем = Элементы.Добавить("гкс_ВидДефекта", Тип("ПолеФормы"));
	НЭлем.ПутьКДанным = "Объект.гкс_ВидДефекта";
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
КонецПроцедуры

&НаКлиенте
Процедура гкс_СписокТеговПриИзменении(Элемент)
	Если Объект.гкс_СписокТегов = 0 Тогда 
		Элементы["гкс_Организация"].Видимость = Ложь;
		Элементы["гкс_Подразделение"].Видимость = Ложь;
		Элементы["гкс_Ответственный"].Видимость = Ложь;
		Элементы["гкс_ВидДефекта"].Видимость = Ложь;
	ИначеЕсли Объект.гкс_СписокТегов = 1 Тогда 
		Элементы["гкс_Организация"].Видимость = Истина;
		Элементы["гкс_Подразделение"].Видимость = Истина;
		Элементы["гкс_Ответственный"].Видимость = Истина;
		Элементы["гкс_ВидДефекта"].Видимость = Ложь;
	ИначеЕсли Объект.гкс_СписокТегов = 2 Тогда 
		Элементы["гкс_Организация"].Видимость = Истина;
		Элементы["гкс_Подразделение"].Видимость = Истина;
		Элементы["гкс_Ответственный"].Видимость = Истина;
		Элементы["гкс_ВидДефекта"].Видимость = Истина;
	КонецЕсли;
КонецПроцедуры
// гкс- [Интеграция] Куст 17.03.2020

#КонецОбласти