
#Область СлужебныеПроцедурыИФункции

// Общее

Функция ВерсияОбмена()
	
	Возврат 2018;
	
КонецФункции

Функция ПроверитьДобавитьРегистрациюУстройства(ИДУстройства, ИмяУстройства, ИмяПользователя)
	УстановитьПривилегированныйРежим(Истина);
	
	СозданНовый = Ложь;
	
	Узел = ПолучитьУзелПланаОбмена(ИДУстройства);
	Если НЕ ЗначениеЗаполнено(Узел) Тогда
		НовыйУзел = ПланыОбмена.mobile.СоздатьУзел();
		НовыйУзел.ИДМобильногоУстройства = ИДУстройства;
		НовыйУзел.Наименование = ИДУстройства;
		НовыйУзел.ИмяУстройства = ИмяУстройства;
		НовыйУзел.ПоследнийПользователь = ИмяПользователя;
		НовыйУзел.ДатаПоследнегоСоединения = ТекущаяДата();
		НовыйУзел.УстановитьНовыйКод();
		НовыйУзел.Записать();
		Узел = НовыйУзел.Ссылка;
		СозданНовый = Истина;
	КонецЕсли;
	
	Если Не ИмяПользователя = Узел.ПоследнийПользователь Тогда
		
		ОбъектУзла = Узел.ПолучитьОбъект();
		ОбъектУзла.ДатаПоследнегоСоединения = ТекущаяДата();
		ОбъектУзла.ПоследнийПользователь = ИмяПользователя;
		
		Попытка
			ОбъектУзла.Записать();
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("es='La excepción';ru='Исключение';en='An exception'"), УровеньЖурналаРегистрации.Предупреждение, 
				Метаданные.WebСервисы.ExchangeMobile20,,ОписаниеОшибки());
		КонецПопытки;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СозданНовый;
	
КонецФункции

Функция ПроверитьДобавитьРегистрациюУстройстваРегистратор(Запрос, ИмяУстройства, ИмяПользователя)
	Возврат Обработки.торо_МобильныеПриложения.ПроверитьДобавитьРегистрациюУстройстваРегистратор_Session(Запрос, ИмяУстройства, ИмяПользователя);
КонецФункции

Функция ПолучитьУзелПланаОбмена(ИДУстройства)
	
	Узел = ПланыОбмена.mobile.НайтиПоРеквизиту("ИДМобильногоУстройства", ИДУстройства);
	Возврат Узел;
	
КонецФункции

Функция Hello()
	
	СисИнфо = Новый СистемнаяИнформация;
	СтрокаВерсии = СисИнфо.ВерсияПриложения;
	ИмяОбработки = ?(Лев(СтрокаВерсии, 3) = "8.2" ИЛИ Лев(СтрокаВерсии, 3) = "8.3", "торо_ЗащитаУправлениеРемонтами82", "торо_ЗащитаУправлениеРемонтами");
	
	УИД = Строка(Новый УникальныйИдентификатор());
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	
	Ч0 = Строка(ГСЧ.СлучайноеЧисло(1,7));
	Ч0 = 3;
	КоличествоДней = Цел((ТекущаяДата() - Дата(2014,1,1,0,0,0))/86400);
		
	КоличествоДнейСтрока = Формат(КоличествоДней, "ЧГ=0");
	Пока СтрДлина(КоличествоДнейСтрока) <4 Цикл
		КоличествоДнейСтрока = "0"+КоличествоДнейСтрока;
	КонецЦикла;
	Ч1 =  Лев(КоличествоДнейСтрока,1);
	Ч2 =  Сред(КоличествоДнейСтрока,2,1);
	Ч3 =  Сред(КоличествоДнейСтрока,3,1);
	Ч4 =  Прав(КоличествоДнейСтрока,1);
	
	Уид = Строка(Ч0)+ Сред(УИД,2,Ч0)+Ч1+Сред(УИД,Ч0+2,Ч0)+Ч2+Сред(УИД,Ч0*2+2,Ч0)+Ч3+Сред(УИД,Ч0*3+2,Ч0)+Ч4+ Прав(УИД,31-Ч0*4);
	
	Возврат Уид;
	
КонецФункции

// Выгрузка данных в МП

Функция ПолучитьОР(Все, ИДУстройства, ИмяПользователя)
	
	Если Все Тогда
		Возврат ПолучитьВсеОР();
	КонецЕсли;
	
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокОР");
	ТипОР = ФабрикаXDTO.Тип("android", "ОР");
	
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	Узел = ПолучитьУзелПланаОбмена(ИДУстройства);
	Выборка = ПланыОбмена.ВыбратьИзменения(Узел,1, Метаданные.Справочники.торо_ОбъектыРемонта);
	
	// Иерархия ++
	Иерархия = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"НастройкиТОиР",
		"ИерархияДляМобильногоПриложения",
		Справочники.торо_СтруктурыОР.ПустаяСсылка(),,
		ИмяПользователя);
		
	Если Не ЗначениеЗаполнено(Иерархия) Тогда
		Возврат Неопределено;
	КонецЕсли;
	// -- Иерархия
	
	Пока Выборка.Следующий() Цикл
		ТекущийОР = Выборка.Получить();
		Если ТекущийОР = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(ТекущийОР) = Тип("УдалениеОбъекта") Тогда
			// Удаление объекта не передаем в основную ИБ.
			ПланыОбмена.УдалитьРегистрациюИзменений(Узел, ТекущийОР);
			Продолжить;
		КонецЕсли;
		
		// Иерархия ++
		СсылкаТекОР = ТекущийОР.Ссылка;
		// -- Иерархия

		ОР = ФабрикаXDTO.Создать(ТипОР);		
		ОР.Код = ТекущийОР.Код;
		ОР.Наименование =ТекущийОР.Наименование;
		ОР.РодительКод = ?(ЗначениеЗаполнено(ТекущийОР.Родитель),ТекущийОР.Родитель.Код,0);
		ОР.Организация    = ?(ЗначениеЗаполнено(ТекущийОР.Организация),ТекущийОР.Организация.Код,0);
		ОР.ЭтоГруппа = ТекущийОР.ЭтоГруппа;
		ОР.ПометкаУдаления = ТекущийОР.ПометкаУдаления;
		Если НЕ ТекущийОР.ЭтоГруппа Тогда
			ОР.ДатаВыпуска = ТекущийОР.ДатаВыпуска;
			ОР.РемонтнаяГруппа =?(ЗначениеЗаполнено(ТекущийОР.ТиповойОР),ТекущийОР.ТиповойОР.Код,0);
			ОР.ИнвентарныйНомер = ТекущийОР.ИнвентарныйНомер;
			ОР.Комментарий    = ТекущийОР.Комментарий;
			ОР.ВнешнийОбъект = ТекущийОР.ВнешнийОбъект;
			ОР.Контрагент   = Строка(ТекущийОР.Контрагент);
			ОР.ДоговорКонтрагента = Строка(ТекущийОР.ДоговорКонтрагента);
			ОР.Подразделение    =?(ЗначениеЗаполнено(ТекущийОР.Подразделение),ТекущийОР.Подразделение.Код,0);
			ОР.ШтрихКод = ТекущийОР.ШтрихКод;
			ОР.ДатаВводаВЭксплуатацию = ТекущийОР.ДатаВводаВЭксплуатацию ;
			ОР.НомерПаспорта    = ТекущийОР.НомерПаспорта ;
			ОР.Направление    = ?(ЗначениеЗаполнено(ТекущийОР.Направление),ТекущийОР.Направление.Код,0);
			ОР.ЗаводскойНомер = ТекущийОР.ЗаводскойНомер;
			ОР.ТехНомер = ТекущийОР.ТехНомер;
			ОР.Широта = ТекущийОР.Широта;
			ОР.Долгота = ТекущийОР.Долгота;
			ОР.Высота = ТекущийОР.Высота;
		КонецЕсли;
		Список.ОР.Добавить(ОР);
		
		ПланыОбмена.УдалитьРегистрациюИзменений(Узел, ТекущийОР);
	КонецЦикла;
	
	Если Список.ОР.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьВсеОР()
	
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокОР");
	ТипОР = ФабрикаXDTO.Тип("android", "ОР");	
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ОбъектыРемонта.Код КАК Код,
		|	торо_ОбъектыРемонта.Ссылка КАК Ссылка,
		|	торо_ОбъектыРемонта.Наименование КАК Наименование,
		|	торо_ОбъектыРемонта.Родитель КАК Родитель,
		|	торо_ОбъектыРемонта.ДатаВыпуска КАК ДатаВыпуска,
		|	торо_ОбъектыРемонта.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	торо_ОбъектыРемонта.Комментарий КАК Комментарий,
		|	торо_ОбъектыРемонта.Контрагент КАК Контрагент,
		|   торо_ОбъектыРемонта.ДоговорКонтрагента КАК ДоговорКонтрагента,
	    |   торо_ОбъектыРемонта.ВнешнийОбъект КАК ВнешнийОбъект,
		|	торо_ОбъектыРемонта.Организация КАК Организация,
		|	торо_ОбъектыРемонта.Подразделение КАК Подразделение,
		|	торо_ОбъектыРемонта.ТиповойОР КАК ТиповойОР,
		|	торо_ОбъектыРемонта.ШтрихКод КАК ШтрихКод,
		|	торо_ОбъектыРемонта.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
		|	торо_ОбъектыРемонта.НомерПаспорта КАК НомерПаспорта,
		|	торо_ОбъектыРемонта.ЭтоГруппа КАК ЭтоГруппа,
		|	торо_ОбъектыРемонта.Направление КАК Направление,
		|	торо_ОбъектыРемонта.ЗаводскойНомер КАК ЗаводскойНомер,
		|	торо_ОбъектыРемонта.ТехНомер КАК ТехНомер,
		|	торо_ОбъектыРемонта.ПометкаУдаления КАК ПометкаУдаления,
		|	торо_ОбъектыРемонта.Широта КАК Широта,
		|	торо_ОбъектыРемонта.Долгота КАК Долгота,
		|	торо_ОбъектыРемонта.Высота КАК Высота
		|ИЗ
		|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|
		|УПОРЯДОЧИТЬ ПО
		|	торо_ОбъектыРемонта.ЭтоГруппа ИЕРАРХИЯ,
		|	торо_ОбъектыРемонта.Наименование";

	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать();

	Пока Выборка.Следующий() Цикл
		ОР = ФабрикаXDTO.Создать(ТипОР);		
		ОР.Код = Выборка.Код;
		ОР.Наименование =Выборка.Наименование;
		ОР.РодительКод = ?(ЗначениеЗаполнено(Выборка.Родитель),Выборка.Родитель.Код,0);
		ОР.Организация    = ?(ЗначениеЗаполнено(Выборка.Организация),Выборка.Организация.Код,0);
		ОР.ЭтоГруппа = Выборка.ЭтоГруппа;
		ОР.ПометкаУдаления = Выборка.ПометкаУдаления;
		Если НЕ Выборка.ЭтоГруппа Тогда
			ОР.ДатаВыпуска = Выборка.ДатаВыпуска;
			ОР.РемонтнаяГруппа = ?(ЗначениеЗаполнено(Выборка.ТиповойОР),Выборка.ТиповойОР.Код,0);
			ОР.ИнвентарныйНомер = Выборка.ИнвентарныйНомер;
			ОР.Комментарий    = Выборка.Комментарий;
			ОР.ВнешнийОбъект = Выборка.ВнешнийОбъект;
			ОР.Контрагент   = Строка(Выборка.Контрагент);
			ОР.ДоговорКонтрагента = Строка(Выборка.ДоговорКонтрагента); 
			ОР.Подразделение    =?(ЗначениеЗаполнено(Выборка.Подразделение),Выборка.Подразделение.Код,0);
			ОР.ШтрихКод = Выборка.ШтрихКод;
			ОР.ДатаВводаВЭксплуатацию = Выборка.ДатаВводаВЭксплуатацию;
			ОР.НомерПаспорта    = Выборка.НомерПаспорта;
			ОР.Направление    = ?(ЗначениеЗаполнено(Выборка.Направление),Выборка.Направление.Код,0);
			ОР.ЗаводскойНомер = Выборка.ЗаводскойНомер;
			ОР.ТехНомер = Выборка.ТехНомер;
			ОР.Широта = Выборка.Широта;
			ОР.Долгота = Выборка.Долгота;
			ОР.Высота = Выборка.Высота;
		КонецЕсли;
		Список.ОР.Добавить(ОР);		
	КонецЦикла;
	
	Если Список.ОР.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьОрганизации(Все, ИДУстройства)
	
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокОрганизаций");
	ТипФабрики = ФабрикаXDTO.Тип("android", "Организации");	
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	ЗаполнитьСписокДаннымиБазовогоСправочника(Все, ИДУстройства, Список.Организации, ТипФабрики, "Организации");
	
	Если Список.Организации.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьВидыДефектов(Все, ИДУстройства)
	
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокВидовДефектов");
	ТипФабрики = ФабрикаXDTO.Тип("android", "ВидыДефектов");	
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	ЗаполнитьСписокДаннымиБазовогоСправочника(Все, ИДУстройства, Список.ВидыДефектов, ТипФабрики, "торо_ВидыДефектов",, Истина);
		
	Если Список.ВидыДефектов.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьЕдиницыИзмерения(Все, ИДУстройства)
	
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокЕдиницИзмерения");
	ТипФабрики = ФабрикаXDTO.Тип("android", "ЕдиницыИзмерения");	
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	ЗаполнитьСписокДаннымиБазовогоСправочника(Все, ИДУстройства, Список.ЕдиницыИзмерения, ТипФабрики, "ЕдиницыИзмерения");
	
	Если Список.ЕдиницыИзмерения.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;

КонецФункции

Функция ПолучитьИзмеряемыеПоказатели(Все, ИДУстройства)
	
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокИзмеряемыхПоказателей");
	ТипФабрики = ФабрикаXDTO.Тип("android", "ИзмеряемыеПоказателиОбъектовРемонта");	
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	ЗаполнитьСписокДаннымиБазовогоСправочника(Все, ИДУстройства, Список.ИзмеряемыеПоказателиОбъектовРемонта, ТипФабрики, "торо_ИзмеряемыеПоказателиОбъектовРемонта");
	
	Если Список.ИзмеряемыеПоказателиОбъектовРемонта.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьЗначенияИзмеряемыхПоказателейОР(Все, ИДУстройства)
	
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокЗначенийИзмеряемыхПоказателей");
	ТипФабрики = ФабрикаXDTO.Тип("android", "ЗначенияИзмеряемыхПоказателейОбъектовРемонта");	
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	ЗаполнитьСписокДаннымиБазовогоСправочника(Все, ИДУстройства, Список.ЗначенияИзмеряемыхПоказателейОбъектовРемонта, ТипФабрики, "торо_ЗначенияИзмеряемыхПоказателейОбъектовРемонта",, Истина);
	
	Если Список.ЗначенияИзмеряемыхПоказателейОбъектовРемонта.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьНоменклатуру(Все, ИДУстройства)
		
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокНоменклатуры");
	ТипФабрики = ФабрикаXDTO.Тип("android", "Номенклатура");	
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	ЗаполнитьСписокДаннымиБазовогоСправочника(Все, ИДУстройства, Список.Номенклатура, ТипФабрики, "Номенклатура", Истина);
		
	Если Список.Номенклатура.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьПричиныДефектов(Все, ИДУстройства)
	
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокПричинДефектов");
	ТипФабрики = ФабрикаXDTO.Тип("android", "ПричиныДефектов");	
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	ЗаполнитьСписокДаннымиБазовогоСправочника(Все, ИДУстройства, Список.ПричиныДефектов, ТипФабрики, "торо_ПричиныДефектов");
		
	Если Список.ПричиныДефектов.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьПричиныПростоев(Все, ИДУстройства)
	
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокПричинПростоев");
	ТипФабрики = ФабрикаXDTO.Тип("android", "ПричиныПростояОборудования");	
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	ЗаполнитьСписокДаннымиБазовогоСправочника(Все, ИДУстройства, Список.ПричиныПростояОборудования, ТипФабрики, "торо_ПричиныПростояОборудования",,Истина);
	
	Если Список.ПричиныПростояОборудования.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьРемонтныеГруппы(Все, ИДУстройства)
	
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокРемонтныхГрупп");
	ТипФабрики = ФабрикаXDTO.Тип("android", "РемонтныеГруппы");	
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	ЗаполнитьСписокДаннымиБазовогоСправочника(Все, ИДУстройства, Список.РемонтныеГруппы, ТипФабрики, "торо_ТиповыеОР",,Истина);
		
	Если Список.РемонтныеГруппы.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;
		
КонецФункции

Функция ПолучитьПараметрыВыработки(Все, ИДУстройства)
	
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокПараметровВыработкиОС");
	ТипФабрики = ФабрикаXDTO.Тип("android", "ПараметрыВыработкиОС");	
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	ЗаполнитьСписокДаннымиБазовогоСправочника(Все, ИДУстройства, Список.ПараметрыВыработкиОС, ТипФабрики, "ПараметрыВыработкиОС");
				
	Если Список.ПараметрыВыработкиОС.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТиповыеДефекты(Все, ИДУстройства)
	
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокТиповыхДефектовОборудования");
	ТипФабрики = ФабрикаXDTO.Тип("android", "ТиповыеДефектыОборудования");	
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	ЗаполнитьСписокДаннымиБазовогоСправочника(Все, ИДУстройства, Список.ТиповыеДефектыОборудования, ТипФабрики, "торо_ТиповыеДефектыОборудования",,Истина);
	
	Если Список.ТиповыеДефектыОборудования.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;
	
КонецФункции

Функция ПередатьКоординатыОР(Код, Широта, Долгота, Высота)
	
	ОбъектРемонта = НайтиОРпоКоду(Код).ПолучитьОбъект();
	
	Успешно = Истина;
	
	Попытка
		ОбъектРемонта.Широта = Число(Широта);
		ОбъектРемонта.Долгота = Число(Долгота);
		ОбъектРемонта.Высота = Число(Высота);
		ОбъектРемонта.Записать();
	Исключение
		Успешно = Ложь;
		ЗаписьЖурналаРегистрации(НСтр("es='La excepción';ru='Исключение';en='An exception'"), УровеньЖурналаРегистрации.Предупреждение, 
			Метаданные.WebСервисы.ExchangeMobile20,,ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Успешно;
	
КонецФункции

Функция ПолучитьКритичностиДефектов(Все, ИДУстройства)
	
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокКритичностейДефекта");
	ТипФабрики = ФабрикаXDTO.Тип("android", "КритичностиДефекта");	
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	ЗаполнитьСписокДаннымиБазовогоСправочника(Все, ИДУстройства, Список.КритичностиДефекта, ТипФабрики, "торо_КритичностьДефекта");
		
	Если Список.КритичностиДефекта.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьУсловияВыявления(Все, ИДУстройства)
	
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокУсловийВыявленияДефекта");
	ТипФабрики = ФабрикаXDTO.Тип("android", "УсловияВыявленияДефекта");	
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	ЗаполнитьСписокДаннымиБазовогоСправочника(Все, ИДУстройства, Список.УсловияВыявленияДефекта, ТипФабрики, "торо_УсловияВыявленияДефекта");
			
	Если Список.УсловияВыявленияДефекта.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьПодразделения(Все, ИДУстройства)
	
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокПодразделений");
	ТипФабрики = ФабрикаXDTO.Тип("android", "Подразделения");	
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	ЗаполнитьСписокДаннымиБазовогоСправочника(Все, ИДУстройства, Список.Подразделения, ТипФабрики, "СтруктураПредприятия",,Истина);
	
	Если Список.Подразделения.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьВидыЭксплуатации(Все, ИДУстройства)
	
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокВидовЭксплуатации");
	ТипФабрики = ФабрикаXDTO.Тип("android", "ВидыЭксплуатации");	
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	ЗаполнитьСписокДаннымиБазовогоСправочника(Все, ИДУстройства, Список.ВидыЭксплуатации, ТипФабрики, "торо_ВидыЭксплуатации");
	
	Если Список.ВидыЭксплуатации.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьНаправления(Все, ИДУстройства)
	
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокНаправления");
	ТипФабрики = ФабрикаXDTO.Тип("android", "Направления");	
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	ЗаполнитьСписокДаннымиБазовогоСправочника(Все, ИДУстройства, Список.Направления, ТипФабрики, "торо_НаправленияОбъектовРемонтныхРабот");
		
	Если Список.Направления.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьПараметрыНаработкиОР_Регистр(Все, ИДУстройства)
	
	ТипСписок = ФабрикаXDTO.Тип("android", "рс_СписокПараметрыНаработки");
	ТипФабрики = ФабрикаXDTO.Тип("android", "рс_ПараметрыНаработки");	
	Список = ФабрикаXDTO.Создать(ТипСписок);	
	
	Если Все Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ПараметрыНаработкиОбъектовРемонтаСрезПоследних.Период КАК Период,
		|	торо_ПараметрыНаработкиОбъектовРемонтаСрезПоследних.ОбъектРемонта КАК ОбъектРемонта,
		|	торо_ПараметрыНаработкиОбъектовРемонтаСрезПоследних.Показатель КАК Показатель,
		|	торо_ПараметрыНаработкиОбъектовРемонтаСрезПоследних.ПлановаяНаработка КАК ПлановаяНаработка,
		|	торо_ПараметрыНаработкиОбъектовРемонтаСрезПоследних.ПериодПлановойНаработки КАК ПериодПлановойНаработки,
		|	торо_ПараметрыНаработкиОбъектовРемонтаСрезПоследних.ПродолжительностьПериодаПлановойНаработки КАК ПродолжительностьПериодаПлановойНаработки,
		|	торо_ПараметрыНаработкиОбъектовРемонтаСрезПоследних.КоэффициентИспользованияОборудования КАК КоэффициентИспользованияОборудования
		|ИЗ
		|	РегистрСведений.торо_ПараметрыНаработкиОбъектовРемонта.СрезПоследних(, ОбъектРемонта ССЫЛКА Справочник.торо_ОбъектыРемонта) КАК торо_ПараметрыНаработкиОбъектовРемонтаСрезПоследних";
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ДобавляемыйОбъект = ФабрикаXDTO.Создать(ТипФабрики); 
			ДобавляемыйОбъект.ОбъектРемонта = ?(ЗначениеЗаполнено(Выборка.ОбъектРемонта),Выборка.ОбъектРемонта.Код, 0);
			ДобавляемыйОбъект.Показатель = ?(ЗначениеЗаполнено(Выборка.Показатель),Выборка.Показатель.Код, 0);
			ДобавляемыйОбъект.ПериодПлановойНаработки = Строка(Выборка.ПериодПлановойНаработки);
			ЗаполнитьЗначенияСвойств(ДобавляемыйОбъект,Выборка,"Период, ПлановаяНаработка, ПродолжительностьПериодаПлановойНаработки,КоэффициентИспользованияОборудования");
			Список.рс_ПараметрыНаработки.Добавить(ДобавляемыйОбъект);							
		КонецЦикла;
		
	Иначе
		Узел = ПолучитьУзелПланаОбмена(ИДУстройства);
		Выборка = ПланыОбмена.ВыбратьИзменения(Узел,1,Метаданные.РегистрыСведений.торо_ПараметрыНаработкиОбъектовРемонта);
		Пока Выборка.Следующий() Цикл
			НаборЗаписей = Выборка.Получить();	
			
			Если ТипЗнч(НаборЗаписей) = Тип("УдалениеОбъекта") Тогда
				ПланыОбмена.УдалитьРегистрациюИзменений(Узел, НаборЗаписей);
				Продолжить;
			КонецЕсли;
			
			Если ТипЗнч(НаборЗаписей) = Тип("РегистрСведенийНаборЗаписей.торо_ПараметрыНаработкиОбъектовРемонта") Тогда
				Для каждого ТекущийОбъект из НаборЗаписей Цикл
					Если ТипЗнч(ТекущийОбъект.ОбъектРемонта) <> Тип("СправочникСсылка.торо_ОбъектыРемонта") Тогда
						Продолжить;
					КонецЕсли;
						
					ДобавляемыйОбъект = ФабрикаXDTO.Создать(ТипФабрики); 
					ДобавляемыйОбъект.ОбъектРемонта = ?(ЗначениеЗаполнено(ТекущийОбъект.ОбъектРемонта),ТекущийОбъект.ОбъектРемонта.Код, 0);
					ДобавляемыйОбъект.Показатель = ?(ЗначениеЗаполнено(ТекущийОбъект.Показатель),ТекущийОбъект.Показатель.Код, 0);
					ДобавляемыйОбъект.ПериодПлановойНаработки = Строка(ТекущийОбъект.ПериодПлановойНаработки);
					ЗаполнитьЗначенияСвойств(ДобавляемыйОбъект,ТекущийОбъект,"Период, ПлановаяНаработка, ПродолжительностьПериодаПлановойНаработки,КоэффициентИспользованияОборудования");
					Список.рс_ПараметрыНаработки.Добавить(ДобавляемыйОбъект);
				КонецЦикла;
				
				ПланыОбмена.УдалитьРегистрациюИзменений(Узел, НаборЗаписей);
			КонецЕсли;
			
		КонецЦикла;	
		
	КонецЕсли;	
	
	Если Список.рс_ПараметрыНаработки.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьИзмеряемыеПоказателиОР_Регистр(Все, ИДУстройства)
	
	ТипСписок = ФабрикаXDTO.Тип("android", "рс_СписокИзмеряемыеПоказателиОР");
	ТипФабрики = ФабрикаXDTO.Тип("android", "рс_ИзмеряемыеПоказателиОР");	
	Список = ФабрикаXDTO.Создать(ТипСписок);	
	
	Если Все Тогда
		Выборка = ПолучитьИзмеряемыеПоказателиОбъектовРемонта();
		Пока Выборка.Следующий() Цикл
			ДобавляемыйОбъект = ФабрикаXDTO.Создать(ТипФабрики);
			ДобавляемыйОбъект.ОбъектРемонта = ?(ЗначениеЗаполнено(Выборка.ОбъектРемонта),Выборка.ОбъектРемонта.Код, 0);
			ДобавляемыйОбъект.Показатель = ?(ЗначениеЗаполнено(Выборка.Показатель),Выборка.Показатель.Код, 0);
			Список.рс_ИзмеряемыеПоказателиОР.Добавить(ДобавляемыйОбъект);							
		КонецЦикла;
	Иначе
		Узел = ПолучитьУзелПланаОбмена(ИДУстройства);
		Выборка = ПланыОбмена.ВыбратьИзменения(Узел,1,Метаданные.РегистрыСведений.торо_ИзмеряемыеПоказателиОбъектовРемонта);
		
		МассивОР = Новый Массив;
		МассивТиповыхОР = Новый Массив;
		
		Пока Выборка.Следующий() Цикл
			НаборЗаписей = Выборка.Получить();
			
			Если ТипЗнч(НаборЗаписей) = Тип("УдалениеОбъекта") Тогда
				ПланыОбмена.УдалитьРегистрациюИзменений(Узел, НаборЗаписей);
				Продолжить;
			КонецЕсли;
			
			Если ТипЗнч(НаборЗаписей) = Тип("РегистрСведенийНаборЗаписей.торо_ИзмеряемыеПоказателиОбъектовРемонта") Тогда
				Для Каждого ТекущийОбъект из НаборЗаписей Цикл
					Если ТипЗнч(ТекущийОбъект.ОбъектРемонта) = Тип("СправочникСсылка.торо_ОбъектыРемонта") Тогда
						Если МассивОР.Найти(ТекущийОбъект.ОбъектРемонта) = Неопределено Тогда
							МассивОР.Добавить(ТекущийОбъект.ОбъектРемонта);
						КонецЕсли;
					Иначе
						МассивТиповыхОР.Добавить(ТекущийОбъект.ОбъектРемонта);
					КонецЕсли;
				КонецЦикла;
				
				ПланыОбмена.УдалитьРегистрациюИзменений(Узел, НаборЗаписей);
			КонецЕсли;
		КонецЦикла;
		
		МассивОРПоТиповым = ПолучитьОбъектыРемонтаПодчиненныеТиповым(МассивТиповыхОР);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивОР, МассивОРПоТиповым, Истина);
		МассивПоказателей = ПланыВидовХарактеристик.торо_ИзмеряемыеПоказателиОбъектовРемонта.ПолучитьСтруктуруИзмеряемыхПоказателейОбъектовРемонта(МассивОР,,Истина);
		
		Для Каждого СтруктураПоказателей из МассивПоказателей Цикл
			ДобавляемыйОбъект = ФабрикаXDTO.Создать(ТипФабрики); 
			ДобавляемыйОбъект.ОбъектРемонта = ?(ЗначениеЗаполнено(СтруктураПоказателей.ИсходныйОР),СтруктураПоказателей.ИсходныйОР.Код, 0);
			ДобавляемыйОбъект.Показатель = ?(ЗначениеЗаполнено(СтруктураПоказателей.Показатель),СтруктураПоказателей.Показатель.Код, 0);
			Список.рс_ИзмеряемыеПоказателиОР.Добавить(ДобавляемыйОбъект);	
		КонецЦикла;
		
	КонецЕсли;
	
	Если Список.рс_ИзмеряемыеПоказателиОР.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьСтруктуруИерархии(ИмяПользователя)
	
	ТипСтруктура = ФабрикаXDTO.Тип("android", "СтруктураИерархии");
	СтруктураИерархии = ФабрикаXDTO.Создать(ТипСтруктура);
	
	ИерархияДляМобильногоПриложения = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"НастройкиТОиР",
		"ИерархияДляМобильногоПриложения",
		Справочники.торо_СтруктурыОР.ПустаяСсылка(),,
		ИмяПользователя);
		
	Если ЗначениеЗаполнено(ИерархияДляМобильногоПриложения) Тогда
		СтруктураИерархии.Ссылка = Строка(ИерархияДляМобильногоПриложения.УникальныйИдентификатор());
		СтруктураИерархии.Наименование = ИерархияДляМобильногоПриложения.Наименование;
	Иначе
		СтруктураИерархии.Ссылка = "";
		СтруктураИерархии.Наименование = "";
	КонецЕсли;	
	
	Возврат СтруктураИерархии;	
		
КонецФункции

Функция ПолучитьИерархиюОР(Все, ИДУстройства, ИДСтруктуры)
	
	СтруктураИерархии = Справочники.торо_СтруктурыОР.ПолучитьСсылку(Новый УникальныйИдентификатор(ИДСтруктуры));
	Если НЕ ЗначениеЗаполнено(СтруктураИерархии) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИзменяетсяДокументами = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураИерархии, "ИзменяетсяДокументами");
	
	ТипСписок = ФабрикаXDTO.Тип("android", "ИерархияОРСписок");
	ТипФабрики = ФабрикаXDTO.Тип("android", "ЭлементИерархииОР");
	ТипОР = ФабрикаXDTO.Тип("android", "ОР");
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	Если Все Тогда
		
		Выборка = ПолучитьВыборкуДанныхИерархииИзРегистра(СтруктураИерархии, ИзменяетсяДокументами);
		
	Иначе
		
		Узел = ПолучитьУзелПланаОбмена(ИДУстройства);
		
		Если ИзменяетсяДокументами = Истина Тогда
			ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(Узел,1,Метаданные.РегистрыСведений.торо_РасположениеОРВСтруктуреИерархии);
			// данные второго регистра не нужны, очищаем сразу
			ПланыОбмена.УдалитьРегистрациюИзменений(Узел, Метаданные.РегистрыСведений.торо_ИерархическиеСтруктурыОР);
		Иначе
			ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(Узел,1,Метаданные.РегистрыСведений.торо_ИерархическиеСтруктурыОР);
			// данные второго регистра не нужны, очищаем сразу
			ПланыОбмена.УдалитьРегистрациюИзменений(Узел, Метаданные.РегистрыСведений.торо_РасположениеОРВСтруктуреИерархии);
		КонецЕсли;
		
		СписокОРДляОбновления = Новый Массив;
		
		Пока ВыборкаИзменений.Следующий() Цикл
			НаборЗаписей = ВыборкаИзменений.Получить();
			
			Если ТипЗнч(НаборЗаписей) = Тип("УдалениеОбъекта") Тогда
				СписокОРДляОбновления.Добавить(НаборЗаписей.Ссылка);
			ИначеЕсли ТипЗнч(НаборЗаписей) = Тип("РегистрСведенийНаборЗаписей.торо_ИерархическиеСтруктурыОР") 
				ИЛИ ТипЗнч(НаборЗаписей) = Тип("РегистрСведенийНаборЗаписей.торо_РасположениеОРВСтруктуреИерархии") Тогда
				Для каждого Запись из НаборЗаписей Цикл
					СписокОРДляОбновления.Добавить(Запись.ОбъектИерархии);
				КонецЦикла;
			КонецЕсли;
			
			ПланыОбмена.УдалитьРегистрациюИзменений(Узел, НаборЗаписей);
		КонецЦикла;	

		Выборка = ПолучитьВыборкуДанныхИерархииИзРегистра(СтруктураИерархии, ИзменяетсяДокументами, СписокОРДляОбновления);
		
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		ДобавляемыйОбъект = ФабрикаXDTO.Создать(ТипФабрики);
		
		ОбъектРемонта = ФабрикаXDTO.Создать(ТипОР);
		ОбъектРемонта.Код = Выборка.ОбъектРемонтаКод;
		ОбъектРемонта.Наименование = Выборка.ОбъектРемонтаНаименование;
		ОбъектРемонта.ЭтоГруппа = Выборка.ОбъектРемонтаЭтоГруппа;
		ДобавляемыйОбъект.ОбъектРемонта = ОбъектРемонта;
		
		Если Выборка.НеВИерархии = Истина Тогда
			ДобавляемыйОбъект.Родитель = Неопределено;
		Иначе
			Родитель = ФабрикаXDTO.Создать(ТипОР);
			Если ЗначениеЗаполнено(Выборка.Родитель) Тогда
				Родитель.Код = Выборка.РодительКод;
				Родитель.Наименование = Выборка.РодительНаименование;
				Родитель.ЭтоГруппа = Выборка.РодительЭтоГруппа;
			Иначе
				Родитель.Код = "";
				Родитель.Наименование = "";
				Родитель.ЭтоГруппа = Ложь;
			КонецЕсли;
			ДобавляемыйОбъект.Родитель = Родитель;
		КонецЕсли;
		
		Список.ИерархияОР.Добавить(ДобавляемыйОбъект);							
	КонецЦикла;
	
	Возврат Список;
	
КонецФункции

Функция ПолучитьСостояниеОР(КодОбъектаРемонта)
	
	ОбъектРемонта = НайтиОРпоКоду(КодОбъектаРемонта);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_ТекущееСостояниеОРСрезПоследних.ВидЭксплуатации КАК ВидЭксплуатации
	               |ИЗ
	               |	РегистрСведений.торо_ТекущееСостояниеОР.СрезПоследних(&ТекущаяДата, ОбъектРемонта = &ОбъектРемонта) КАК торо_ТекущееСостояниеОРСрезПоследних";
	
	Запрос.УстановитьПараметр("ОбъектРемонта", ОбъектРемонта);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Строка(Выборка.ВидЭксплуатации);
		
	Иначе
	
		Возврат "Данные недоступны";
	
	КонецЕсли;
	
КонецФункции

Функция ПолучитьОсобыеОР()
	
	ТипСписок = ФабрикаXDTO.Тип("android", "СписокСсылокОР");
	ТипФабрики = ФабрикаXDTO.Тип("android", "СсылкаОР");	
	
	Список = ФабрикаXDTO.Создать(ТипСписок);
	
	// Получение списка ОР
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	торо_ВыявленныеДефектыСписокДефектов.ОбъектРемонта.Код КАК Код,
	               |	торо_ВыявленныеДефектыСписокДефектов.ОтказавшийЭлемент.Код КАК КодОЭ
	               |ИЗ
	               |	Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов
	               |ГДЕ
	               |	НЕ торо_ВыявленныеДефектыСписокДефектов.ID В
	               |				(ВЫБРАТЬ
	               |					торо_ЗавершенныеРемонтныеРаботы.ID КАК ID
	               |				ИЗ
	               |					РегистрСведений.торо_ЗавершенныеРемонтныеРаботы КАК торо_ЗавершенныеРемонтныеРаботы)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Не Выборка.Код = Null Тогда 
			ОР = ФабрикаXDTO.Создать(ТипФабрики);
			ОР.Код = Выборка.Код;
			ОР.КодОЭ = Выборка.КодОЭ;
			Список.ОбъектыРемонта.Добавить(ОР);
		КонецЕсли;
	КонецЦикла;
	
	Если Список.ОбъектыРемонта.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Список;
	КонецЕсли;
	
КонецФункции

// Загрузка данных из МП

Функция ПередатьДефект(ВыявленныйДефект, ПропуститьПроверки, НезакрытыеДефекты)

	Отказ = Ложь;
	СтруктураОтвета = ПодготовитьПустуюСтруктуруОтвета();

	МетаданныеДокумента = Метаданные.Документы.торо_ВыявленныеДефекты;
	
	Если НЕ ПравоДоступа("Чтение", МетаданныеДокумента) Тогда
		СтруктураОтвета.Успех = Ложь;
		ТекстСообщения = НСтр("es='No hay derechos a la lectura de los documentos ""los defectos Revelados"".';ru='Нет прав на чтение документов ""Выявленные дефекты"".';en='There is no right to read the documents ""Identified defects"".'");
		ДобавитьОшибкуВМассив(СтруктураОтвета.ТекстОшибки, ТекстСообщения);
		Возврат СтруктураОтвета;
	КонецЕсли;
		
	СсылкаНаДокумент = Документы.торо_ВыявленныеДефекты.ПолучитьСсылку(Новый УникальныйИдентификатор(ВыявленныйДефект.Ссылка));
	НовыйДок = СсылкаНаДокумент.ПолучитьОбъект();
	Если НовыйДок <> Неопределено Тогда
		Если НЕ ПравоДоступа("Изменение", МетаданныеДокумента) Тогда
			СтруктураОтвета.Успех = Ложь;
			ТекстСообщения = НСтр("es='No hay derechos al cambio de los documentos ""los defectos Revelados"".';ru='Нет прав на изменение документов ""Выявленные дефекты"".';en='There is no right to change the documents ""Identified defects"".'");
			ДобавитьОшибкуВМассив(СтруктураОтвета.ТекстОшибки, ТекстСообщения);
			Возврат СтруктураОтвета;
		КонецЕсли;
		
		НовыйДок.СписокДефектов.Очистить();
	Иначе
		Если НЕ ПравоДоступа("Добавление", МетаданныеДокумента) Тогда
			СтруктураОтвета.Успех = Ложь;
			ТекстСообщения = НСтр("es='No hay derechos a la adición de los documentos ""los defectos Revelados"".';ru='Нет прав на добавление документов ""Выявленные дефекты"".';en='There is no right to add documents ""Identified defects"".'");
			ДобавитьОшибкуВМассив(СтруктураОтвета.ТекстОшибки, ТекстСообщения);
			Возврат СтруктураОтвета;
		КонецЕсли;
		
		НовыйДок = Документы.торо_ВыявленныеДефекты.СоздатьДокумент();
		НовыйДок.УстановитьСсылкуНового(СсылкаНаДокумент);
	КонецЕсли;
	
	ТаблицаДокумента = Документы.торо_ВыявленныеДефекты.ПустаяСсылка().СписокДефектов.Выгрузить();
	Для каждого Дефект ИЗ ВыявленныйДефект.ТЧВыявленныйДефект Цикл
		НоваяСтрока = ТаблицаДокумента.Добавить();
		НоваяСтрока.ID = Дефект.ID;
		НоваяСтрока.ВидДефекта = Справочники.торо_ВидыДефектов.НайтиПоКоду(Дефект.ВидДефекта);
		НоваяСтрока.ДефектВыявленВПроцессе = Справочники.торо_УсловияВыявленияДефекта.НайтиПоКоду(Дефект.ДефектВыявленВПроцессе);
		НоваяСтрока.ТиповойДефект = Справочники.торо_ТиповыеДефектыОборудования.НайтиПоКоду(Дефект.ТиповойДефект);
		НоваяСтрока.ДефектОписание = Дефект.ДефектОписание;
		НоваяСтрока.ДефектПричина = Справочники.торо_ПричиныДефектов.НайтиПоКоду(Дефект.ДефектПричина);
		НоваяСтрока.НаправлениеНаУстранение = Дефект.НаправлениеНаУстранение;
		НоваяСтрока.ОбъектРемонта = НайтиОРпоКоду(Дефект.ОбъектРемонта);
		НоваяСтрока.ПодразделениеИсполнитель = Справочники.СтруктураПредприятия.НайтиПоКоду(Дефект.ПодразделениеИсполнитель);
		НоваяСтрока.ОтказавшийЭлемент = НайтиОРпоКоду(Дефект.ОтказавшийЭлемент);
		НоваяСтрока.ПоследствияДефекта = Дефект.ПоследствияДефекта;
		НоваяСтрока.КритичностьДефекта = Справочники.торо_КритичностьДефекта.НайтиПоКоду(Дефект.КритичностьДефекта);
	КонецЦикла;	
	
	// Выполнить проверки, установить Отказ, если требуется.
	Если НЕ ПропуститьПроверки Тогда
		Если ВыявленныйДефект.ТЧВыявленныйДефект.Количество() > 0 Тогда
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("ОбъектРемонта", ВыявленныйДефект.ТЧВыявленныйДефект[0].ОбъектРемонта);
			СтруктураПараметров.Вставить("ОтказавшийЭлемент", ВыявленныйДефект.ТЧВыявленныйДефект[0].ОтказавшийЭлемент);
			СтруктураПараметров.Вставить("ВидДефекта", ВыявленныйДефект.ТЧВыявленныйДефект[0].ВидДефекта);
			СтруктураПараметров.Вставить("КритичностьДефекта", ВыявленныйДефект.ТЧВыявленныйДефект[0].КритичностьДефекта);
			СтруктураПараметров.Вставить("ДатаОбнаружения", ВыявленныйДефект.ДатаОбнаружения);
			СтруктураПараметров.Вставить("Ответственный", ВыявленныйДефект.Ответственный);
			СтруктураПараметров.Вставить("Ссылка", ВыявленныйДефект.Ссылка);
			СтруктураПараметров.Вставить("ДефектПричина", ВыявленныйДефект.ТЧВыявленныйДефект[0].ДефектПричина);
			СтруктураПараметров.Вставить("ДефектОписание", ВыявленныйДефект.ТЧВыявленныйДефект[0].ДефектОписание);
			
			НезакрытыеДефекты = ПолучитьНезакрытыеДефекты(СтруктураПараметров);
			Если НезакрытыеДефекты.Элементы <> Неопределено И НезакрытыеДефекты.Элементы.Количество() > 0 Тогда
				Отказ = Истина;
				ТекстСообщения = НСтр("es='En 1С:ТОИР son descubiertos los defectos no cerrados parecidos en registrados.';ru='В 1С:ТОИР обнаружены незакрытые дефекты, похожие на регистрируемый.';en='In 1C: MRO unclosed defects similar to the detected ones were detected.'");
				ДобавитьОшибкуВМассив(СтруктураОтвета.ТекстОшибки, ТекстСообщения, 1);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Отказ Тогда
		СтруктураОтвета.Успех = Ложь;
		Возврат СтруктураОтвета;
	КонецЕсли;
	
	НовыйДок.ИзМобильного = Истина;	
	НовыйДок.Дата = ВыявленныйДефект.Дата;
	НовыйДок.Комментарий = ВыявленныйДефект.Комментарий;
	НовыйДок.Подразделение = Справочники.СтруктураПредприятия.НайтиПоКоду(ВыявленныйДефект.Подразделение);
	НовыйДок.Организация = Справочники.Организации.НайтиПоКоду(ВыявленныйДефект.Организация);
	НовыйДок.ДатаОбнаружения = ВыявленныйДефект.ДатаОбнаружения;
	НовыйДок.ДефектВыявленВПроцессе = Справочники.торо_УсловияВыявленияДефекта.НайтиПоКоду(ВыявленныйДефект.ДефектВыявленВПроцессе);
	НовыйДок.Ответственный = НайтиПользователя(ВыявленныйДефект.Ответственный);
	
	НовыйДок.СписокДефектов.Загрузить(ТаблицаДокумента);
	
	ФОИспользоватьУпрощеннуюФормуДефекта = ПолучитьФункциональнуюОпцию("торо_ИспользоватьУпрощеннуюФормуДефекта");
	Если ФОИспользоватьУпрощеннуюФормуДефекта И ТаблицаДокумента.Количество() > 0 Тогда
		НовыйДок.ОбъектРемонта = ТаблицаДокумента[0].ОбъектРемонта;
	КонецЕсли;
	
	ПопробоватьЗаписатьДокумент(НовыйДок, СтруктураОтвета, "ОбменМП.ЗаписьВыявленныйДефект");
	Возврат СтруктураОтвета;
	
КонецФункции

Функция ПередатьСостояниеОР(СостояниеОР, ПропуститьПроверки)
	
	Отказ = Ложь;
	СтруктураОтвета = ПодготовитьПустуюСтруктуруОтвета();
	
	МетаданныеДокумента = Метаданные.Документы.торо_СостоянияОбъектовРемонта;
	
	Если НЕ ПравоДоступа("Чтение", МетаданныеДокумента) Тогда
		СтруктураОтвета.Успех = Ложь;
		ТекстСообщения = НСтр("es='No hay derechos a la lectura de los documentos ""el Estado de los objetos de la reparación"".';ru='Нет прав на чтение документов ""Состояния объектов ремонта"".';en='There is no right to read the documents “Status of repair objects”.'");
		ДобавитьОшибкуВМассив(СтруктураОтвета.ТекстОшибки, ТекстСообщения);
		Возврат СтруктураОтвета;
	КонецЕсли;
	
	СсылкаНаДокумент = Документы.торо_СостоянияОбъектовРемонта.ПолучитьСсылку(Новый УникальныйИдентификатор(СостояниеОР.Ссылка));
	НовыйДок = СсылкаНаДокумент.ПолучитьОбъект();
	Если НовыйДок <> Неопределено Тогда
		Если НЕ ПравоДоступа("Изменение", МетаданныеДокумента) Тогда
			СтруктураОтвета.Успех = Ложь;
			ТекстСообщения = НСтр("es='No hay derechos al cambio de los documentos ""el Estado de los objetos de la reparación"".';ru='Нет прав на изменение документов ""Состояния объектов ремонта"".';en='There is no right to change the documents “Status of repair objects”.'");
			ДобавитьОшибкуВМассив(СтруктураОтвета.ТекстОшибки, ТекстСообщения);
			Возврат СтруктураОтвета;
		КонецЕсли;
		
		НовыйДок.ОбъектыРемонта.Очистить();
	Иначе
		Если НЕ ПравоДоступа("Добавление", МетаданныеДокумента) Тогда
			СтруктураОтвета.Успех = Ложь;
			ТекстСообщения = НСтр("es='No hay derechos a la adición de los documentos ""el Estado de los objetos de la reparación"".';ru='Нет прав на добавление документов ""Состояния объектов ремонта"".';en='There is no right to add documents “Status of repair objects”.'");
			ДобавитьОшибкуВМассив(СтруктураОтвета.ТекстОшибки, ТекстСообщения);
			Возврат СтруктураОтвета;
		КонецЕсли;
		
		НовыйДок = Документы.торо_СостоянияОбъектовРемонта.СоздатьДокумент();
		НовыйДок.УстановитьСсылкуНового(СсылкаНаДокумент);
	КонецЕсли;

	ТекСтруктураИерархии = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
				"НастройкиТОиР",
				"ИерархияДляМобильногоПриложения",
				Истина);
	
	ТаблицаДокумента = Документы.торо_СостоянияОбъектовРемонта.ПустаяСсылка().ОбъектыРемонта.Выгрузить();
	Для каждого Состояние ИЗ СостояниеОР.ТЧСостояниеОР Цикл
		НоваяСтрока = ТаблицаДокумента.Добавить();
		НоваяСтрока.ОбъектРемонта = НайтиОРпоКоду(Состояние.ОбъектРемонта);
		НоваяСтрока.ДатаОкончания = Состояние.ДатаОкончания;
		НоваяСтрока.ПричинаПростоя  = Справочники.торо_ПричиныПростояОборудования.НайтиПоКоду(Состояние.ПричинаПростоя );
		НоваяСтрока.ВидЭксплуатации = Справочники.торо_ВидыЭксплуатации.НайтиПоКоду(Состояние.ВидЭксплуатации);
		НоваяСтрока.ВидПуска = Состояние.ВидПуска;
		НоваяСтрока.ИзменятьСостояниеПодчиненныхОР = Состояние.РаспространятьНаПодчиненных;
		НоваяСтрока.Иерархия = ТекСтруктураИерархии;
	КонецЦикла;	
	
	// Выполнить проверки, установить Отказ, если требуется.
	Если НЕ ПропуститьПроверки Тогда
		// Tсли между датой изменения состояния из МП и текущей датой зарегистрированы 
		// изменения состояний интересующего нас ОР - ошибка. 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаДокумента.ОбъектРемонта КАК ОбъектРемонта,
		|	ТаблицаДокумента.ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ ТаблицаДокумента
		|ИЗ
		|	&ТаблицаДокумента КАК ТаблицаДокумента
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОбъектРемонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ТекущееСостояниеОРСрезПоследних.Период КАК Период,
		|	торо_ТекущееСостояниеОРСрезПоследних.ОбъектРемонта КАК ОбъектРемонта
		|ПОМЕСТИТЬ ВТ_ПоследниеСостояния
		|ИЗ
		|	РегистрСведений.торо_ТекущееСостояниеОР.СрезПоследних(
		|			&Период,
		|			ОбъектРемонта В
		|					(ВЫБРАТЬ
		|						ТаблицаДокумента.ОбъектРемонта КАК ОбъектРемонта
		|					ИЗ
		|						ТаблицаДокумента КАК ТаблицаДокумента)
		|				И Регистратор <> &Регистратор) КАК торо_ТекущееСостояниеОРСрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОбъектРемонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДокумента.ОбъектРемонта КАК ОбъектРемонта,
		|	ВТ_ПоследниеСостояния.Период КАК Период
		|ИЗ
		|	ТаблицаДокумента КАК ТаблицаДокумента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПоследниеСостояния КАК ВТ_ПоследниеСостояния
		|		ПО ТаблицаДокумента.ОбъектРемонта = ВТ_ПоследниеСостояния.ОбъектРемонта
		|			И ТаблицаДокумента.ДатаОкончания < ВТ_ПоследниеСостояния.Период";
		
		Запрос.УстановитьПараметр("ТаблицаДокумента", ТаблицаДокумента);
		Запрос.УстановитьПараметр("Период", ТекущаяДата());
		Запрос.УстановитьПараметр("Регистратор", СсылкаНаДокумент);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Отказ = Истина;
			ШаблонСообщения = НСтр("es='Para el objeto de la reparación ""%1"" es registrado ya состяние a una fecha más avanzada %2.';ru='Для объекта ремонта ""%1"" уже зарегистрировано состяние на более позднюю дату %2.';en='For repair object ""%1"", a status is already registered at a later date%2.'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, Выборка.ОбъектРемонта, Выборка.Период);
			ДобавитьОшибкуВМассив(СтруктураОтвета.ТекстОшибки, ТекстСообщения, 1);
		КонецЕсли;
	КонецЕсли;
	
	Если Отказ Тогда
		СтруктураОтвета.Успех = Ложь;
		Возврат СтруктураОтвета;
	КонецЕсли;
	
	НовыйДок.ИзМобильного = Истина;
	НовыйДок.Дата = СостояниеОР.Дата;
	НовыйДок.Комментарий = СостояниеОР.Комментарий;
	НовыйДок.Подразделение = Справочники.СтруктураПредприятия.НайтиПоКоду(СостояниеОР.Подразделение);
	НовыйДок.Организация = Справочники.Организации.НайтиПоКоду(СостояниеОР.Организация);
	НовыйДок.ВидЭксплуатации = Справочники.торо_ВидыЭксплуатации.НайтиПоКоду(СостояниеОР.ВидЭксплуатации);
	НовыйДок.Ответственный = НайтиПользователя(СостояниеОР.Ответственный);
	НовыйДок.ВидОперации = Перечисления.торо_ВидыОперацийОтклоненияВРаботеОборудования.ВидЭксплуатации;
	
	НовыйДок.ОбъектыРемонта.Загрузить(ТаблицаДокумента);
	
	ПопробоватьЗаписатьДокумент(НовыйДок, СтруктураОтвета, "ОбменМП.ЗаписьСостояниеОР");
	Возврат СтруктураОтвета;
	
КонецФункции

Функция ПередатьУчетНаработкиОборудования(УчетНаработкиОборудования, ПропуститьПроверки)
	
	Отказ = Ложь;
	СтруктураОтвета = ПодготовитьПустуюСтруктуруОтвета();
		
	МетаданныеДокумента = Метаданные.Документы.торо_УчетНаработкиОборудования;
	
	Если НЕ ПравоДоступа("Чтение", МетаданныеДокумента) Тогда
		СтруктураОтвета.Успех = Ложь;
		ТекстСообщения = НСтр("es='No hay derechos a la lectura de los documentos ""el Recuento de la elaboración de la maquinaria"".';ru='Нет прав на чтение документов ""Учет наработки оборудования"".';en='There is no right to read the documents ""Accounting for equipment operating time""'");
		ДобавитьОшибкуВМассив(СтруктураОтвета.ТекстОшибки, ТекстСообщения);
		Возврат СтруктураОтвета;
	КонецЕсли;
	
	СсылкаСуществующая = Ложь;
	СсылкаНаДокумент = Документы.торо_УчетНаработкиОборудования.ПолучитьСсылку(Новый УникальныйИдентификатор(УчетНаработкиОборудования.Ссылка));
	НовыйДок = СсылкаНаДокумент.ПолучитьОбъект();
	Если НовыйДок <> Неопределено Тогда
		Если НЕ ПравоДоступа("Изменение", МетаданныеДокумента) Тогда
			СтруктураОтвета.Успех = Ложь;
			ТекстСообщения = НСтр("es='No hay derechos al cambio de los documentos ""el Recuento de la elaboración de la maquinaria"".';ru='Нет прав на изменение документов ""Учет наработки оборудования"".';en='There is no right to change the documents ""Accounting for equipment operating time"".'");
			ДобавитьОшибкуВМассив(СтруктураОтвета.ТекстОшибки, ТекстСообщения);
			Возврат СтруктураОтвета;
		КонецЕсли;
		
		СсылкаСуществующая = Истина;
		НовыйДок.НаработкаОбъектов.Очистить();
		НовыйДок.НаработкаПодчиненныхОбъектов.Очистить();
	Иначе
		Если НЕ ПравоДоступа("Добавление", МетаданныеДокумента) Тогда
			СтруктураОтвета.Успех = Ложь;
			ТекстСообщения = НСтр("es='No hay derechos a la adición de los documentos ""el Recuento de la elaboración de la maquinaria"".';ru='Нет прав на добавление документов ""Учет наработки оборудования"".';en='There is no right to add documents ""Accounting for equipment operating time"".'");
			ДобавитьОшибкуВМассив(СтруктураОтвета.ТекстОшибки, ТекстСообщения);
			Возврат СтруктураОтвета;
		КонецЕсли;
		
		НовыйДок = Документы.торо_УчетНаработкиОборудования.СоздатьДокумент();
		НовыйДок.УстановитьСсылкуНового(СсылкаНаДокумент);
	КонецЕсли;
	
	ТекСтруктураИерархии = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
				"НастройкиТОиР",
				"ИерархияДляМобильногоПриложения",
				Истина);
	
	ТаблицаДокумента = Документы.торо_УчетНаработкиОборудования.ПустаяСсылка().НаработкаОбъектов.Выгрузить();
	МассивОР = Новый массив;
	МассивПоказателей = Новый массив;
	Для каждого Наработка ИЗ УчетНаработкиОборудования.ТЧУчетНаработкиОборудования Цикл
		НоваяСтрока = ТаблицаДокумента.Добавить();
		НоваяСтрока.Объект = НайтиОРпоКоду(Наработка.ОбъектРемонта);
		НоваяСтрока.Показатель  = Справочники.ПараметрыВыработкиОС.НайтиПоКоду(Наработка.Показатель);
		НоваяСтрока.ДатаРаботыПо = Наработка.ДатаРаботыПо;
		НоваяСтрока.НовоеЗначение = Наработка.НовоеЗначение;
		НоваяСтрока.Наработка = Наработка.Наработка;
		НоваяСтрока.РаспространятьНаПодчиненных = Наработка.РаспространятьНаПодчиненных;
		НоваяСтрока.Иерархия = ТекСтруктураИерархии;
		
		Если ЗначениеЗаполнено(НоваяСтрока.Объект) Тогда
      	МассивОР.Добавить(НоваяСтрока.Объект);
			МассивПоказателей.Добавить(НоваяСтрока.Показатель);
		КонецЕсли;
	КонецЦикла;	
	
	ТаблицаМаксЗначенийНаработки = ПолучитьМаксимальныеЗначенияНаработки(МассивОР, МассивПоказателей);
	ТаблицаМаксЗначенийНаработки.Индексы.Добавить("ОбъектРемонта, Показатель");
	ТаблицаНаработки = ПолучитьАктуальнуюНаработкуДляОР(МассивОР, МассивПоказателей, ?(СсылкаСуществующая, СсылкаНаДокумент, Неопределено)); 
	ТаблицаНаработки.Индексы.Добавить("ОбъектРемонта, Показатель");

	Для каждого СтрокаТабДокумента из ТаблицаДокумента Цикл
		СтруктураПоиска = Новый Структура("ОбъектРемонта, Показатель", СтрокаТабДокумента.Объект, СтрокаТабДокумента.Показатель);
		СтрокаНаработки = ТаблицаНаработки.НайтиСтроки(СтруктураПоиска);
		Если СтрокаНаработки.Количество() > 0 Тогда
			СтрокаНаработки = СтрокаНаработки[0];
			СтрокаТабДокумента.ДатаРаботыС = СтрокаНаработки.ДатаКон;
			СтрокаТабДокумента.СтароеЗначение = СтрокаНаработки.Наработка;
			
			Если СтрокаТабДокумента.ДатаРаботыС >= СтрокаТабДокумента.ДатаРаботыПо Тогда
				ШаблонСообщения = НСтр("es='¡Para el objeto de la reparación ""%1"" y el índice ""%2"" es introducida ya la elaboración a una fecha más avanzada!';ru='Для объекта ремонта ""%1"" и показателя ""%2"" уже введена наработка на более позднюю дату!';en='Running time for a later date has already been entered for repair object ""%1"" and indicator ""%2""!'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, СтрокаТабДокумента.Объект, СтрокаТабДокумента.Показатель);
				ДобавитьОшибкуВМассив(СтруктураОтвета.ТекстОшибки, ТекстСообщения);
				Отказ = Истина;
			КонецЕсли;
				
		Иначе
			СтрокаТабДокумента.ДатаРаботыС = СтрокаТабДокумента.Объект.ДатаВводаВЭксплуатацию;
			
			Если СтрокаТабДокумента.ДатаРаботыС >= СтрокаТабДокумента.ДатаРаботыПо Тогда
				ШаблонСообщения = НСтр("es='¡Para el objeto de la reparación ""%1"" y el índice ""%2"" fecha de la elaboración es más pequeña que la fecha de la introducción en la explotación!';ru='Для объекта ремонта ""%1"" и показателя ""%2"" дата наработки меньше даты ввода в эксплуатацию!';en='For repair object ""%1"" and indicator ""%2"", the operating time is less than the commissioning date!'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, СтрокаТабДокумента.Объект, СтрокаТабДокумента.Показатель);
				ДобавитьОшибкуВМассив(СтруктураОтвета.ТекстОшибки, ТекстСообщения);
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаТабДокумента.ДатаРаботыС >= СтрокаТабДокумента.ДатаРаботыПо Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТабДокумента.НовоеЗначение <> 0 Тогда
			// Если задан только конечный остаток, то надо вычислить оборот
			
			Если СтрокаТабДокумента.НовоеЗначение >= СтрокаТабДокумента.СтароеЗначение Тогда
				СтрокаТабДокумента.Наработка = СтрокаТабДокумента.НовоеЗначение - СтрокаТабДокумента.СтароеЗначение;
			Иначе
				СтрокаМаксНаработки = ТаблицаМаксЗначенийНаработки.НайтиСтроки(СтруктураПоиска);
				Если СтрокаМаксНаработки.Количество() > 0 Тогда
					СтрокаМаксНаработки = СтрокаМаксНаработки[0];
					СтрокаТабДокумента.Наработка = (СтрокаМаксНаработки.МаксимальноеЗначение - СтрокаТабДокумента.СтароеЗначение)+СтрокаТабДокумента.НовоеЗначение;
				Иначе
					ШаблонСообщения = НСтр("es='¡Para el objeto de la reparación ""%1"" y el índice de ""las %2"" elaboraciones, nuevas el significado, menos que ya introducido en ТОиР!';ru='Для объекта ремонта ""%1"" и показателя ""%2"" новое значение наработки меньше, чем уже введенное в ТОиР!';en='For the repair object ""%1"" and the indicator ""%2"", the new operating time is less than that already entered in the maintenance and repair!'");
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, СтрокаТабДокумента.Объект, СтрокаТабДокумента.Показатель);
					ДобавитьОшибкуВМассив(СтруктураОтвета.ТекстОшибки, ТекстСообщения);
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			// Задан оборот, надо вычислить конечный остаток
			СтрокаТабДокумента.НовоеЗначение = СтрокаТабДокумента.СтароеЗначение + СтрокаТабДокумента.Наработка;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Отказ Тогда
		СтруктураОтвета.Успех = Ложь;
		Возврат СтруктураОтвета;
	КонецЕсли;
	
	НовыйДок.ИзМобильного = Истина;	
	НовыйДок.Дата = УчетНаработкиОборудования.Дата;
	НовыйДок.Комментарий = УчетНаработкиОборудования.Комментарий;
	НовыйДок.Подразделение = Справочники.СтруктураПредприятия.НайтиПоКоду(УчетНаработкиОборудования.Подразделение);
	НовыйДок.Организация = Справочники.Организации.НайтиПоКоду(УчетНаработкиОборудования.Организация);
	НовыйДок.Ответственный = НайтиПользователя(УчетНаработкиОборудования.Ответственный);
	
	НовыйДок.НаработкаОбъектов.Загрузить(ТаблицаДокумента);
	
	Если ЗначениеЗаполнено(ТекСтруктураИерархии) Тогда
		БылиОшибки = Ложь;
		ТаблицаИерархииОР = торо_РаботаСИерархией20.ПолучитьТаблицуИерархии(ТекСтруктураИерархии,НовыйДок.Дата,Истина);
				
		Для каждого ТеСтрокаНаработки из НовыйДок.НаработкаОбъектов Цикл
			Если ТеСтрокаНаработки.РаспространятьНаПодчиненных Тогда
				ТекстОшибки = "";
				РаспространитьНаработкуНаПодчиненныхДляТекущейСтроки(НовыйДок, ТеСтрокаНаработки, ТаблицаИерархииОР, БылиОшибки, ТекстОшибки);
				Если ЗначениеЗаполнено(ТекстОшибки) Тогда
					ДобавитьОшибкуВМассив(СтруктураОтвета.ТекстОшибки, ТекстОшибки);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ПопробоватьЗаписатьДокумент(НовыйДок, СтруктураОтвета, "ОбменМП.ЗаписьНаработки");
	Возврат СтруктураОтвета;
	
КонецФункции

Функция ПередатьУчетКонтролируемыхПоказателей(УчетКонтролируемыхПоказателей, ПропуститьПроверки)
	
	Отказ = Ложь;
	СтруктураОтвета = ПодготовитьПустуюСтруктуруОтвета();
	
	МетаданныеДокумента = Метаданные.Документы.торо_УчетКонтролируемыхПоказателей;
	
	Если НЕ ПравоДоступа("Чтение", МетаданныеДокумента) Тогда
		СтруктураОтвета.Успех = Ложь;
		ТекстСообщения = НСтр("es='No hay derechos a la lectura de los documentos ""el Recuento de los índices controlados"".';ru='Нет прав на чтение документов ""Учет контролируемых показателей"".';en='There is no right to read the documents ""Accounting for controlled indicators.""'");
		ДобавитьОшибкуВМассив(СтруктураОтвета.ТекстОшибки, ТекстСообщения);
		Возврат СтруктураОтвета;
	КонецЕсли;
	
	СсылкаНаДокумент = Документы.торо_УчетКонтролируемыхПоказателей.ПолучитьСсылку(Новый УникальныйИдентификатор(УчетКонтролируемыхПоказателей.Ссылка));
	НовыйДок = СсылкаНаДокумент.ПолучитьОбъект();
	Если НовыйДок <> Неопределено Тогда
		Если НЕ ПравоДоступа("Изменение", МетаданныеДокумента) Тогда
			СтруктураОтвета.Успех = Ложь;
			ТекстСообщения = НСтр("es='No hay derechos al cambio de los documentos ""el Recuento de los índices controlados"".';ru='Нет прав на изменение документов ""Учет контролируемых показателей"".';en='There is no right to change the documents “Accounting for controlled indicators”.'");
			ДобавитьОшибкуВМассив(СтруктураОтвета.ТекстОшибки, ТекстСообщения);
			Возврат СтруктураОтвета;
		КонецЕсли;
		
		НовыйДок.Показатели.Очистить();
	Иначе
		Если НЕ ПравоДоступа("Добавление", МетаданныеДокумента) Тогда
			СтруктураОтвета.Успех = Ложь;
			ТекстСообщения = НСтр("es='No hay derechos a la adición de los documentos ""el Recuento de los índices controlados"".';ru='Нет прав на добавление документов ""Учет контролируемых показателей"".';en='There is no right to add documents ""Accounting for controlled indicators"".'");
			ДобавитьОшибкуВМассив(СтруктураОтвета.ТекстОшибки, ТекстСообщения);
			Возврат СтруктураОтвета;
		КонецЕсли;
		
		НовыйДок = Документы.торо_УчетКонтролируемыхПоказателей.СоздатьДокумент();
		НовыйДок.УстановитьСсылкуНового(СсылкаНаДокумент);
	КонецЕсли;

	ТаблицаДокумента = Документы.торо_УчетКонтролируемыхПоказателей.ПустаяСсылка().Показатели.Выгрузить();
	Для каждого Показатель ИЗ УчетКонтролируемыхПоказателей.ТЧУчетКонтролируемыхПоказателей Цикл
		НоваяСтрока = ТаблицаДокумента.Добавить();
		НоваяСтрока.ОбъектРемонта = НайтиОРпоКоду(Показатель.ОбъектРемонта);
		НоваяСтрока.ДатаКонтроля = Показатель.ДатаКонтроля;
		НоваяСтрока.Показатель  = ПланыВидовХарактеристик.торо_ИзмеряемыеПоказателиОбъектовРемонта.НайтиПоКоду(Показатель.Показатель);
		
		ЗначениеБезПрефикса = Прав(Показатель.Значение, СтрДлина(Показатель.Значение) - 1);
		ПрефиксЗначения = Лев(Показатель.Значение, 1);
		
		Если ПрефиксЗначения = "п" Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	торо_ЗначенияИзмеряемыхПоказателейОбъектовРемонта.Ссылка КАК Ссылка
			               |ИЗ
			               |	Справочник.торо_ЗначенияИзмеряемыхПоказателейОбъектовРемонта КАК торо_ЗначенияИзмеряемыхПоказателейОбъектовРемонта
			               |ГДЕ
			               |	торо_ЗначенияИзмеряемыхПоказателейОбъектовРемонта.Код = &Код";
			
			Запрос.УстановитьПараметр("Код", ЗначениеБезПрефикса);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Выборка.Следующий();
			
			ЗначениеПоказателя = Выборка.Ссылка;
			
		КонецЕсли;
		
		Если ПрефиксЗначения = "ч" Тогда
			ЗначениеПоказателя = Число(ЗначениеБезПрефикса);
		КонецЕсли;
		
		НоваяСтрока.Значение = ЗначениеПоказателя;
	КонецЦикла;
	
	// Выполнить проверки, установить Отказ, если требуется.
	Если НЕ ПропуститьПроверки Тогда
		// ...
	КонецЕсли;
	
	Если Отказ Тогда
		СтруктураОтвета.Успех = Ложь;
		Возврат СтруктураОтвета;
	КонецЕсли;
	
	НовыйДок.ИзМобильного = Истина;
	НовыйДок.Дата = УчетКонтролируемыхПоказателей.Дата;
	НовыйДок.Комментарий = УчетКонтролируемыхПоказателей.Комментарий;
	НовыйДок.Подразделение = Справочники.СтруктураПредприятия.НайтиПоКоду(УчетКонтролируемыхПоказателей.Подразделение);
	НовыйДок.Организация = Справочники.Организации.НайтиПоКоду(УчетКонтролируемыхПоказателей.Организация);
	НовыйДок.Ответственный = НайтиПользователя(УчетКонтролируемыхПоказателей.Ответственный);
	
	НовыйДок.Показатели.Загрузить(ТаблицаДокумента);
	
	ПопробоватьЗаписатьДокумент(НовыйДок, СтруктураОтвета, "ОбменМП.ЗаписьКонтролируемыхПоказателей");
	Возврат СтруктураОтвета;
	
КонецФункции

Процедура ПопробоватьЗаписатьДокумент(НовыйДок, СтруктураОтвета, ИмяСобытияЖурналаРегистрации)
	
	Попытка	
		НовыйДок.Записать(РежимЗаписиДокумента.Проведение);		
		СтруктураОтвета.Успех = Истина;
		СтруктураОтвета.НомерДокумента = НовыйДок.Номер;
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрации,УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки);
		СтруктураОтвета.Успех = Ложь;
		ТекстСообщения = НСтр("es='No consiguió anotar el documento, es más detallado que cm. En la revista del registro en la base ТОиР.';ru='Не удалось записать документ, подробнее см. в журнале регистрации в базе ТОиР.';en='Failed to write the document, for more details, see the registration log in the MRO database.'");
		ДобавитьОшибкуВМассив(СтруктураОтвета.ТекстОшибки, ТекстСообщения);
	КонецПопытки;
	
	МассивСообщений = ПолучитьСообщенияПользователю(Истина);
	Для каждого СообщениеПользователю из МассивСообщений Цикл
		ДобавитьОшибкуВМассив(СтруктураОтвета.ТекстОшибки, СообщениеПользователю.Текст);
	КонецЦикла;

КонецПроцедуры

Функция WriteObjectPhoto(Code, Photo, Comment, Type)
	
	Попытка
		ВладелецФайла = Неопределено;
		НаименованиеФайла = "";
		
		Если Type = "ОР" Тогда // Изображения Объекта ремонта
			
			ВладелецФайла = НайтиОРпоКоду(Code);
			Если ЗначениеЗаполнено(Comment) Тогда
				НаименованиеФайла = Comment;	
			Иначе					
				НаименованиеФайла = ВладелецФайла.Наименование;
			КонецЕсли;
			
		Иначе // изображение дефекта
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	торо_ВыявленныеДефекты.Ссылка
			|ИЗ
			|	Документ.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефекты
			|ГДЕ
			|	торо_ВыявленныеДефекты.Номер = &Номер
			|
			|УПОРЯДОЧИТЬ ПО
			|	торо_ВыявленныеДефекты.Дата УБЫВ";
			
			Запрос.УстановитьПараметр("Номер", Code);
			Результат = Запрос.Выполнить();
			ВыборкаДетальныеЗаписи = Результат.Выбрать();
			
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда
				ВладелецФайла = ВыборкаДетальныеЗаписи.Ссылка;
			КонецЕсли;
			
			НаименованиеФайла = Строка(ВладелецФайла);
			Если ЗначениеЗаполнено(Comment) Тогда
				НаименованиеФайла = Comment;	
			КонецЕсли;
			
		КонецЕсли;
		
		НаименованиеФайла = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(НаименованиеФайла, ".");
		
		ДвоичныеДанные = Base64Значение(Photo);
		Картинка = Новый Картинка(ДвоичныеДанные);
		Расширение = Строка(Картинка.Формат());
		ВрХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
		
		ПараметрыФайла = Новый Структура();
		ПараметрыФайла.Вставить("Автор", Пользователи.ТекущийПользователь());
		ПараметрыФайла.Вставить("ВладелецФайлов", ВладелецФайла);
		ПараметрыФайла.Вставить("ИмяБезРасширения", НаименованиеФайла);
		ПараметрыФайла.Вставить("РасширениеБезТочки", Расширение);
		ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное", Неопределено);
		
		РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, ВрХранилище);  
		
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("ОбменМП.ЗаписьТехническойДокументации",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки);
		Возврат "Error";
	КонецПопытки;
	
	Возврат "Done";
	
КонецФункции

Функция ПередатьФайлыДефекта(ВыявленныйДефект, Файл)
	
	Попытка
		
		НаименованиеФайла = "";	
		ВладелецФайла = Документы.торо_ВыявленныеДефекты.ПолучитьСсылку(Новый УникальныйИдентификатор(ВыявленныйДефект));
		
		Если ВладелецФайла.ПолучитьОбъект() = Неопределено Тогда
			Возврат "Error";
		КонецЕсли;
		
		НаименованиеФайла = ?(ЗначениеЗаполнено(Файл.ИмяФайла), Файл.ИмяФайла, Строка(ВладелецФайла)); 
		НаименованиеФайла = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(НаименованиеФайла, ".");
		
		Описание = "";
		Если ЗначениеЗаполнено(Файл.Комментарий) Тогда
			Описание = Файл.Комментарий;	
		КонецЕсли;
		
		ДвоичныеДанные = Base64Значение(Файл.ДанныеФайла);
		Расширение = Файл.Расширение;

		ВрХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
		
		ПараметрыФайла = Новый Структура();
		ПараметрыФайла.Вставить("Автор", Пользователи.ТекущийПользователь());
		ПараметрыФайла.Вставить("ВладелецФайлов", ВладелецФайла);
		ПараметрыФайла.Вставить("ИмяБезРасширения", НаименованиеФайла);
		ПараметрыФайла.Вставить("РасширениеБезТочки", Расширение);
		ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное", Неопределено);
		
		РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, ВрХранилище, ,Описание); 
		
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("ОбменМП.ЗаписьФайлаДефекта",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки);
		Возврат "Error";
	КонецПопытки;
	
	Возврат "Done";
	
КонецФункции

Функция ПередатьФайлыОР(КодОбъекта, Файл)
	
	Попытка
		
		НаименованиеФайла = "";
		ВладелецФайла = НайтиОРпоКоду(КодОбъекта);
		
		Если ВладелецФайла.ПолучитьОбъект() = Неопределено Тогда
			Возврат "Error";
		КонецЕсли;
		
		НаименованиеФайла = ?(ЗначениеЗаполнено(Файл.ИмяФайла), Файл.ИмяФайла, Строка(ВладелецФайла)); 
		НаименованиеФайла = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(НаименованиеФайла, ".");
		
		Описание = "";
		Если ЗначениеЗаполнено(Файл.Комментарий) Тогда
			Описание = Файл.Комментарий;	
		КонецЕсли;
		
		ДвоичныеДанные = Base64Значение(Файл.ДанныеФайла);
		Расширение = Файл.Расширение;
		
		ВрХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
		
		ПараметрыФайла = Новый Структура();
		ПараметрыФайла.Вставить("Автор", Пользователи.ТекущийПользователь());
		ПараметрыФайла.Вставить("ВладелецФайлов", ВладелецФайла);
		ПараметрыФайла.Вставить("ИмяБезРасширения", НаименованиеФайла);
		ПараметрыФайла.Вставить("РасширениеБезТочки", Расширение);
		ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное", Неопределено);
		
		РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, ВрХранилище, ,Описание); 
		
	Исключение 
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("ОбменМП.ЗаписьТехническойДокументации", УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки);
		Возврат "Error";
	КонецПопытки;
	
	Возврат "Done";
	
КонецФункции

Функция ПередатьФайлыСостоянияОР(СостояниеОР, Файл)
	
	Попытка
		
		НаименованиеФайла = "";	
		ВладелецФайла = Документы.торо_СостоянияОбъектовРемонта.ПолучитьСсылку(Новый УникальныйИдентификатор(СостояниеОР));
		
		Если ВладелецФайла.ПолучитьОбъект() = Неопределено Тогда
			Возврат "Error";
		КонецЕсли;
		
		НаименованиеФайла = ?(ЗначениеЗаполнено(Файл.ИмяФайла), Файл.ИмяФайла, Строка(ВладелецФайла)); 
		НаименованиеФайла = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(НаименованиеФайла, ".");
		
		Описание = "";
		Если ЗначениеЗаполнено(Файл.Комментарий) Тогда
			Описание = Файл.Комментарий;	
		КонецЕсли;
		
		ДвоичныеДанные = Base64Значение(Файл.ДанныеФайла);
		Расширение = Файл.Расширение;
		
		ВрХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
		
		ПараметрыФайла = Новый Структура();
		ПараметрыФайла.Вставить("Автор", Пользователи.ТекущийПользователь());
		ПараметрыФайла.Вставить("ВладелецФайлов", ВладелецФайла);
		ПараметрыФайла.Вставить("ИмяБезРасширения", НаименованиеФайла);
		ПараметрыФайла.Вставить("РасширениеБезТочки", Расширение);
		ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное", Неопределено);
		
		РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, ВрХранилище, ,Описание); 
		
		
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("ОбменМП.ЗаписьФайлаСостоянияОР",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки);
		Возврат "Error";
	КонецПопытки;
	
	Возврат "Done";
	
КонецФункции

Функция WriteZipCode(Code, ZipCode)
	
	Если ЗначениеЗаполнено(ZipCode) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	торо_ОбъектыРемонта.Ссылка
		               |ИЗ
		               |	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		               |ГДЕ
		               |	торо_ОбъектыРемонта.ШтрихКод = &ШтрихКод";
		
		Запрос.УстановитьПараметр("ШтрихКод", ZipCode);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат "Fail";
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		Объект = НайтиОРпоКоду(Code).ПолучитьОбъект();
		Объект.ШтрихКод = ZipCode;
		Объект.Записать();
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("ОбменМП.ЗаписьШтрихкода", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки);
		Возврат "Error";
	КонецПопытки;
	
	Возврат "Done";
	 
КонецФункции

// Отображение доп. информации в МП

Функция ПолучитьНезакрытыеДефекты(ИнформацияОДефекте)
	
	ТипСписка = ФабрикаXDTO.Тип("android", "СписокДефектов");
	ТипСтруктуры = ФабрикаXDTO.Тип("android", "ИнформацияОДефекте");
	СписокДефектов = ФабрикаXDTO.Создать(ТипСписка);
		
	ОбъектРемонта = НайтиОРпоКоду(ИнформацияОДефекте.ОбъектРемонта);
	ОтказавшийЭлемент = НайтиОРпоКоду(ИнформацияОДефекте.ОтказавшийЭлемент);
	ВидДефекта = Справочники.торо_ВидыДефектов.НайтиПоКоду(ИнформацияОДефекте.ВидДефекта);
	
	Если НЕ ЗначениеЗаполнено(ОбъектРемонта) ИЛИ Не ЗначениеЗаполнено(ОтказавшийЭлемент) 
		ИЛИ НЕ ЗначениеЗаполнено(ВидДефекта) Тогда
		Возврат СписокДефектов;
	КонецЕсли;
	
	Если ИнформацияОДефекте.Ссылка <> "" Тогда
		СсылкаНаДокумент = Документы.торо_ВыявленныеДефекты.ПолучитьСсылку(Новый УникальныйИдентификатор(ИнформацияОДефекте.Ссылка));
	Иначе
		СсылкаНаДокумент = Неопределено;
	КонецЕсли;
	
	КритичностьДефекта = Справочники.торо_КритичностьДефекта.НайтиПоКоду(ИнформацияОДефекте.КритичностьДефекта);
	ДатаОбнаружения = ИнформацияОДефекте.ДатаОбнаружения;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ВыявленныеДефектыСрезПоследних.Период КАК ДатаОбнаружения,
	|	торо_ВыявленныеДефектыСрезПоследних.Регистратор КАК Регистратор,
	|	торо_ВыявленныеДефектыСрезПоследних.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_ВыявленныеДефектыСрезПоследних.ОтказавшийЭлемент КАК ОтказавшийЭлемент,
	|	торо_ВыявленныеДефектыСрезПоследних.ID КАК ID,
	|	торо_ВыявленныеДефектыСрезПоследних.ДефектПричина КАК ДефектПричина,
	|	торо_ВыявленныеДефектыСрезПоследних.ВидДефекта КАК ВидДефекта,
	|	торо_ВыявленныеДефектыСрезПоследних.КритичностьДефекта КАК КритичностьДефекта,
	|	торо_ВыявленныеДефектыСрезПоследних.ДефектОписание КАК ДефектОписание
	|ПОМЕСТИТЬ ВТ_ВыявленныеДефекты
	|ИЗ
	|	РегистрСведений.торо_ВыявленныеДефекты.СрезПоследних(
	|			,
	|			ОбъектРемонта = &ОбъектРемонта
	|				И ОтказавшийЭлемент = &ОтказавшийЭлемент
	|				И Регистратор <> &Ссылка) КАК торо_ВыявленныеДефектыСрезПоследних
	|ГДЕ
	|	торо_ВыявленныеДефектыСрезПоследних.ВидДефекта = &ВидДефекта
	|	И торо_ВыявленныеДефектыСрезПоследних.КритичностьДефекта = &КритичностьДефекта
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ЗавершенныеРемонтныеРаботыСрезПоследних.ID КАК ID
	|ПОМЕСТИТЬ ВТ_ЗавершенныеРемонты
	|ИЗ
	|	РегистрСведений.торо_ЗавершенныеРемонтныеРаботы.СрезПоследних(
	|			,
	|			ID В
	|				(ВЫБРАТЬ
	|					ВТ_ВыявленныеДефекты.ID КАК ID
	|				ИЗ
	|					ВТ_ВыявленныеДефекты КАК ВТ_ВыявленныеДефекты)) КАК торо_ЗавершенныеРемонтныеРаботыСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ОтмененныеРемонтыСрезПоследних.ID КАК ID
	|ПОМЕСТИТЬ ВТ_ОтмененныеРемонты
	|ИЗ
	|	РегистрСведений.торо_ОтмененныеРемонты.СрезПоследних(
	|			,
	|			ID В
	|				(ВЫБРАТЬ
	|					ВТ_ВыявленныеДефекты.ID КАК ID
	|				ИЗ
	|					ВТ_ВыявленныеДефекты КАК ВТ_ВыявленныеДефекты)) КАК торо_ОтмененныеРемонтыСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыявленныеДефекты.ДатаОбнаружения КАК ДатаОбнаружения,
	|	ВТ_ВыявленныеДефекты.Регистратор КАК Регистратор,
	|	ВТ_ВыявленныеДефекты.ОбъектРемонта КАК ОбъектРемонта,
	|	ВТ_ВыявленныеДефекты.ОтказавшийЭлемент КАК ОтказавшийЭлемент,
	|	ВТ_ВыявленныеДефекты.ID КАК ID,
	|	ВТ_ВыявленныеДефекты.ДефектПричина КАК ДефектПричина,
	|	ВТ_ВыявленныеДефекты.ВидДефекта КАК ВидДефекта,
	|	ВТ_ВыявленныеДефекты.КритичностьДефекта КАК КритичностьДефекта,
	|	ВТ_ВыявленныеДефекты.ДефектОписание КАК ДефектОписание,
	|	ВТ_ВыявленныеДефекты.Регистратор.Ответственный КАК Ответственный
	|ИЗ
	|	ВТ_ВыявленныеДефекты КАК ВТ_ВыявленныеДефекты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗавершенныеРемонты КАК ВТ_ЗавершенныеРемонты
	|		ПО ВТ_ВыявленныеДефекты.ID = ВТ_ЗавершенныеРемонты.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтмененныеРемонты КАК ВТ_ОтмененныеРемонты
	|		ПО ВТ_ВыявленныеДефекты.ID = ВТ_ОтмененныеРемонты.ID
	|ГДЕ
	|	ВТ_ЗавершенныеРемонты.ID ЕСТЬ NULL
	|	И ВТ_ОтмененныеРемонты.ID ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ОбъектРемонта", ОбъектРемонта);
	Запрос.УстановитьПараметр("ОтказавшийЭлемент", ОтказавшийЭлемент);
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
	Запрос.УстановитьПараметр("ВидДефекта", ВидДефекта);
	
	Если ЗначениеЗаполнено(КритичностьДефекта) Тогда
		Запрос.УстановитьПараметр("КритичностьДефекта", КритичностьДефекта);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "торо_ВыявленныеДефектыСрезПоследних.КритичностьДефекта = &КритичностьДефекта", "ИСТИНА");
	КонецЕсли;

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураДефекта = ФабрикаXDTO.Создать(ТипСтруктуры);
		СтруктураДефекта.ДатаОбнаружения = Выборка.ДатаОбнаружения;
		СтруктураДефекта.ОбъектРемонта = Строка(Выборка.ОбъектРемонта);
		СтруктураДефекта.ОтказавшийЭлемент = Строка(Выборка.ОтказавшийЭлемент);
		СтруктураДефекта.ДефектПричина = Строка(Выборка.ДефектПричина);
		СтруктураДефекта.ВидДефекта = Строка(Выборка.ВидДефекта);
		СтруктураДефекта.КритичностьДефекта = Строка(Выборка.КритичностьДефекта);
		СтруктураДефекта.ДефектОписание = Выборка.ДефектОписание;
		СтруктураДефекта.Ответственный = Строка(Выборка.Ответственный);
		СписокДефектов.Элементы.Добавить(СтруктураДефекта);
	КонецЦикла;
	
	Возврат СписокДефектов;
	
КонецФункции

Функция ПолучитьЗарегистрированныеДефектыОР(ОбъектРемонта)
	
	ТипСписка = ФабрикаXDTO.Тип("android", "СписокДефектов");
	ТипСтруктуры = ФабрикаXDTO.Тип("android", "ИнформацияОДефекте");
	СписокДефектов = ФабрикаXDTO.Создать(ТипСписка);
		
	ОбъектРемонтаСсылка = НайтиОРпоКоду(ОбъектРемонта);
	
	Если НЕ ЗначениеЗаполнено(ОбъектРемонтаСсылка) Тогда
		Возврат СписокДефектов;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ВыявленныеДефектыСрезПоследних.Период КАК ДатаОбнаружения,
	|	торо_ВыявленныеДефектыСрезПоследних.Регистратор КАК Регистратор,
	|	торо_ВыявленныеДефектыСрезПоследних.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_ВыявленныеДефектыСрезПоследних.ОтказавшийЭлемент КАК ОтказавшийЭлемент,
	|	торо_ВыявленныеДефектыСрезПоследних.ID КАК ID,
	|	торо_ВыявленныеДефектыСрезПоследних.ДефектПричина КАК ДефектПричина,
	|	торо_ВыявленныеДефектыСрезПоследних.ВидДефекта КАК ВидДефекта,
	|	торо_ВыявленныеДефектыСрезПоследних.КритичностьДефекта КАК КритичностьДефекта,
	|	торо_ВыявленныеДефектыСрезПоследних.ДефектОписание КАК ДефектОписание
	|ПОМЕСТИТЬ ВТ_ВыявленныеДефекты
	|ИЗ
	|	РегистрСведений.торо_ВыявленныеДефекты.СрезПоследних(
	|			,
	|			ОбъектРемонта = &ОбъектРемонта
	|				ИЛИ ОтказавшийЭлемент = &ОбъектРемонта) КАК торо_ВыявленныеДефектыСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ЗавершенныеРемонтныеРаботыСрезПоследних.ID КАК ID
	|ПОМЕСТИТЬ ВТ_ЗавершенныеРемонты
	|ИЗ
	|	РегистрСведений.торо_ЗавершенныеРемонтныеРаботы.СрезПоследних(
	|			,
	|			ID В
	|				(ВЫБРАТЬ
	|					ВТ_ВыявленныеДефекты.ID КАК ID
	|				ИЗ
	|					ВТ_ВыявленныеДефекты КАК ВТ_ВыявленныеДефекты)) КАК торо_ЗавершенныеРемонтныеРаботыСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ОтмененныеРемонтыСрезПоследних.ID КАК ID
	|ПОМЕСТИТЬ ВТ_ОтмененныеРемонты
	|ИЗ
	|	РегистрСведений.торо_ОтмененныеРемонты.СрезПоследних(
	|			,
	|			ID В
	|				(ВЫБРАТЬ
	|					ВТ_ВыявленныеДефекты.ID КАК ID
	|				ИЗ
	|					ВТ_ВыявленныеДефекты КАК ВТ_ВыявленныеДефекты)) КАК торо_ОтмененныеРемонтыСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыявленныеДефекты.ДатаОбнаружения КАК ДатаОбнаружения,
	|	ВТ_ВыявленныеДефекты.Регистратор КАК Регистратор,
	|	ВТ_ВыявленныеДефекты.ОбъектРемонта КАК ОбъектРемонта,
	|	ВТ_ВыявленныеДефекты.ОтказавшийЭлемент КАК ОтказавшийЭлемент,
	|	ВТ_ВыявленныеДефекты.ID КАК ID,
	|	ВТ_ВыявленныеДефекты.ДефектПричина КАК ДефектПричина,
	|	ВТ_ВыявленныеДефекты.ВидДефекта КАК ВидДефекта,
	|	ВТ_ВыявленныеДефекты.КритичностьДефекта КАК КритичностьДефекта,
	|	ВТ_ВыявленныеДефекты.ДефектОписание КАК ДефектОписание,
	|	ВТ_ВыявленныеДефекты.Регистратор.Ответственный КАК Ответственный
	|ИЗ
	|	ВТ_ВыявленныеДефекты КАК ВТ_ВыявленныеДефекты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗавершенныеРемонты КАК ВТ_ЗавершенныеРемонты
	|		ПО ВТ_ВыявленныеДефекты.ID = ВТ_ЗавершенныеРемонты.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтмененныеРемонты КАК ВТ_ОтмененныеРемонты
	|		ПО ВТ_ВыявленныеДефекты.ID = ВТ_ОтмененныеРемонты.ID
	|ГДЕ
	|	ВТ_ЗавершенныеРемонты.ID ЕСТЬ NULL
	|	И ВТ_ОтмененныеРемонты.ID ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ОбъектРемонта", ОбъектРемонтаСсылка);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураДефекта = ФабрикаXDTO.Создать(ТипСтруктуры);
		СтруктураДефекта.ДатаОбнаружения = Выборка.ДатаОбнаружения;
		СтруктураДефекта.ОбъектРемонта = Строка(Выборка.ОбъектРемонта);
		СтруктураДефекта.ОтказавшийЭлемент = Строка(Выборка.ОтказавшийЭлемент);
		СтруктураДефекта.ДефектПричина = Строка(Выборка.ДефектПричина);
		СтруктураДефекта.ВидДефекта = Строка(Выборка.ВидДефекта);
		СтруктураДефекта.КритичностьДефекта = Строка(Выборка.КритичностьДефекта);
		СтруктураДефекта.ДефектОписание = Выборка.ДефектОписание;
		СтруктураДефекта.Ответственный = Строка(Выборка.Ответственный);
		СписокДефектов.Элементы.Добавить(СтруктураДефекта);
	КонецЦикла;
	
	Возврат СписокДефектов;

КонецФункции

Функция ПолучитьПоследнююНаработку(ОбъектРемонта, Показатель, РегистраторИсключение)
	
	ТипСтруктуры = ФабрикаXDTO.Тип("android", "СтруктураПоследнейНаработки");
	СтруктураВозврата = ФабрикаXDTO.Создать(ТипСтруктуры);
	
	ОбъектРемонтаСсылка = НайтиОРпоКоду(ОбъектРемонта);
	ПоказательСсылка = Справочники.ПараметрыВыработкиОС.НайтиПоКоду(Показатель);
	Если НЕ ЗначениеЗаполнено(ОбъектРемонтаСсылка) ИЛИ НЕ ЗначениеЗаполнено(ПоказательСсылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РегистраторИсключение) Тогда
		СсылкаНаДокумент = Документы.торо_УчетНаработкиОборудования.ПолучитьСсылку(Новый УникальныйИдентификатор(РегистраторИсключение));
	Иначе
		СсылкаНаДокумент = Неопределено;
	КонецЕсли;

	СтруктураВозврата.ПоказательКод = Показатель;
	СтруктураВозврата.ПоказательНаименование = ПоказательСсылка.Наименование;
	
	ТаблицаНаработки = ПолучитьАктуальнуюНаработкуДляОР(ОбъектРемонтаСсылка, ПоказательСсылка, СсылкаНаДокумент);
	Если ТаблицаНаработки.Количество() > 0 Тогда
		СтруктураВозврата.Наработка = ТаблицаНаработки[0].Наработка;
		СтруктураВозврата.Период = ТаблицаНаработки[0].ДатаКон;
	Иначе
		СтруктураВозврата.Наработка = 0;
		СтруктураВозврата.Период = ОбъектРемонтаСсылка.ДатаВводаВЭксплуатацию;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ПолучитьПоследнююНаработкуОР(ОбъектРемонта)
	
	ТипСтруктуры = ФабрикаXDTO.Тип("android", "СтруктураПоследнейНаработки");
	ТипСписка = ФабрикаXDTO.Тип("android", "СписокПоследнейНаработки");
	Список = ФабрикаXDTO.Создать(ТипСписка);
	
	ОбъектРемонтаСсылка = НайтиОРпоКоду(ОбъектРемонта);
	Если НЕ ЗначениеЗаполнено(ОбъектРемонтаСсылка) Тогда
		Возврат Неопределено;
	КонецЕсли;

	МассивПоказателей = ПолучитьСписокПоказателейНаработкиОР(ОбъектРемонтаСсылка);
	
	ТаблицаНаработки = ПолучитьАктуальнуюНаработкуДляОР(ОбъектРемонтаСсылка, МассивПоказателей, Неопределено);
	Для каждого СтрокаНаработки из ТаблицаНаработки Цикл
		Структура = ФабрикаXDTO.Создать(ТипСтруктуры);
		Структура.Наработка = СтрокаНаработки.Наработка;
		Структура.Период = СтрокаНаработки.ДатаКон;
		Структура.ПоказательКод = СтрокаНаработки.Показатель.Код;
		Структура.ПоказательНаименование = СтрокаНаработки.Показатель.Наименование;
		Список.Элементы.Добавить(Структура);
	КонецЦикла;
	
	Возврат Список;
	
КонецФункции

// Обновления
Функция ОбновитьИмяУстройства(ИДУстройства, ИмяУстройства)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Узел = ПолучитьУзелПланаОбмена(ИДУстройства);
	Если Не ЗначениеЗаполнено(Узел) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОбъектУзла = Узел.ПолучитьОбъект();
	ОбъектУзла.ИмяУстройства = ИмяУстройства;
	
	Попытка
		ОбъектУзла.Записать();
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("es='La excepción';ru='Исключение';en='An exception'"), УровеньЖурналаРегистрации.Предупреждение, 
			Метаданные.WebСервисы.ExchangeMobile20,,ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Истина
	
КонецФункции

/////////////////////////////////////////////////////////////////////////
// Служебные процедуры и функции

Функция НайтиПользователя(ИмяПользователяИБ)
	
	Пользователь = Неопределено;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(ИмяПользователяИБ);
	Если ПользовательИБ <> Неопределено Тогда
		Пользователь = Справочники.Пользователи.НайтиПоРеквизиту("ИдентификаторПользователяИБ", ПользовательИБ.УникальныйИдентификатор);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Пользователь;
	
КонецФункции

Функция НайтиОРпоКоду(Код)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_ОбъектыРемонта.Ссылка
	|ИЗ
	|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	|ГДЕ
	|	торо_ОбъектыРемонта.Код = &Код
	|	И торо_ОбъектыРемонта.ЭтоГруппа = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Код", Код);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.торо_ОбъектыРемонта.ПустаяСсылка();
	
КонецФункции

Процедура ЗаполнитьСписокДаннымиБазовогоСправочника(Все, ИДУстройства, СписокXDTO, ТипФабрики, ИмяСправочника, ПропускатьГруппы = Ложь, СИерархией = Ложь)
	
	Если ИмяСправочника = "торо_ИзмеряемыеПоказателиОбъектовРемонта" Тогда
		ТипМетаданных = Метаданные.ПланыВидовХарактеристик[ИмяСправочника];
		Если Все Тогда
			Выборка = ПланыВидовХарактеристик[ИмяСправочника].Выбрать();	
		Иначе
			Узел = ПолучитьУзелПланаОбмена(ИДУстройства);
			Выборка = ПланыОбмена.ВыбратьИзменения(Узел,1,ТипМетаданных);	
		КонецЕсли;
		
	Иначе
		ТипМетаданных = Метаданные.Справочники[ИмяСправочника];
		Если Все Тогда
			Выборка = Справочники[ИмяСправочника].Выбрать();	
		Иначе
			Узел = ПолучитьУзелПланаОбмена(ИДУстройства);
			Выборка = ПланыОбмена.ВыбратьИзменения(Узел,1,ТипМетаданных);	
		КонецЕсли;
	КонецЕсли;
	
	СтрокаИсключений = "";
	Если ИмяСправочника = "торо_ИзмеряемыеПоказателиОбъектовРемонта" 
		ИЛИ ИмяСправочника = "Номенклатура"	
		ИЛИ ИмяСправочника = "ПараметрыВыработкиОС" Тогда
		СтрокаИсключений = "ЕдиницаИзмерения";
		
	ИначеЕсли ИмяСправочника = "торо_ПричиныПростояОборудования" Тогда
		СтрокаИсключений = "ВидПростоя";
		
	ИначеЕсли ИмяСправочника = "торо_ТиповыеДефектыОборудования" Тогда
		СтрокаИсключений = "ВидДефекта, КритичностьДефекта";
		
	ИначеЕсли ИмяСправочника = "торо_ВидыЭксплуатации" Тогда
		СтрокаИсключений = "ТипЭксплуатации";
		
	КонецЕсли;
	
	Если СИерархией Тогда
		СтрокаИсключений = ?(СтрокаИсключений = "", "", СтрокаИсключений+", ") + "Родитель";
	КонецЕсли;
	
	СтрокаИсключенийДляГрупп = СтрокаИсключений;
	Если ИмяСправочника = "торо_ТиповыеДефектыОборудования" Тогда
		СтрокаИсключенийДляГрупп = ?(СтрокаИсключенийДляГрупп = "", "", СтрокаИсключенийДляГрупп+", ") + "ОписаниеДефекта, ПоследствиеДефекта, НаправлениеНаУстранение";
	ИначеЕсли ИмяСправочника = "торо_ВидыДефектов" 
		ИЛИ ИмяСправочника = "торо_ТиповыеОР" Тогда
		СтрокаИсключенийДляГрупп = ?(СтрокаИсключенийДляГрупп = "", "", СтрокаИсключенийДляГрупп+", ") + "Комментарий";
	КонецЕсли;

	ЗначенияПоУмолчанию = Новый Структура("ЭтоГруппа, ПометкаУдаления, Комментарий, ОписаниеДефекта", Истина, Ложь, "", "");
	ЗначенияПоУмолчанию.Вставить("ВидПростоя", "0");
	ЗначенияПоУмолчанию.Вставить("ЕдиницаИзмерения", "0");
	ЗначенияПоУмолчанию.Вставить("ВидДефекта", "0");
	ЗначенияПоУмолчанию.Вставить("КритичностьДефекта", "0");
	ЗначенияПоУмолчанию.Вставить("Направление", "0");
	ЗначенияПоУмолчанию.Вставить("ПоследствиеДефекта", "");
	ЗначенияПоУмолчанию.Вставить("НаправлениеНаУстранение", "");
	ЗначенияПоУмолчанию.Вставить("ТипЭксплуатации", "");
	
	Пока Выборка.Следующий() Цикл
		
		Если Все Тогда
			ТекущийОбъект = Выборка;
		Иначе
			ТекущийОбъект = Выборка.Получить();
			Если ТипЗнч(ТекущийОбъект) = Тип("УдалениеОбъекта") Тогда
				ПланыОбмена.УдалитьРегистрациюИзменений(Узел, ТекущийОбъект);
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если ТекущийОбъект = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПропускатьГруппы И ТекущийОбъект.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		
		ДобавляемыйОбъект = ФабрикаXDTO.Создать(ТипФабрики);
		ЗаполнитьЗначенияСвойств(ДобавляемыйОбъект, ЗначенияПоУмолчанию);
		Если ТекущийОбъект.ЭтоГруппа Тогда
			ЗаполнитьЗначенияСвойств(ДобавляемыйОбъект, ТекущийОбъект,,СтрокаИсключенийДляГрупп);
		Иначе
			ЗаполнитьЗначенияСвойств(ДобавляемыйОбъект, ТекущийОбъект,,СтрокаИсключений);
		КонецЕсли;
				
		Если ИмяСправочника = "торо_ИзмеряемыеПоказателиОбъектовРемонта"
			ИЛИ ИмяСправочника = "Номенклатура"
			ИЛИ ИмяСправочника = "ПараметрыВыработкиОС"	Тогда
			
			Если НЕ ТекущийОбъект.ЭтоГруппа Тогда
				ДобавляемыйОбъект.ЕдиницаИзмерения = ?(ЗначениеЗаполнено(ТекущийОбъект.ЕдиницаИзмерения),ТекущийОбъект.ЕдиницаИзмерения.Код, 0);
			КонецЕсли;
			
		ИначеЕсли ИмяСправочника = "торо_ПричиныПростояОборудования" Тогда
			
			Если НЕ ТекущийОбъект.ЭтоГруппа Тогда
				ДобавляемыйОбъект.ВидПростоя = Строка(ТекущийОбъект.ВидПростоя);
			КонецЕсли;
			
		ИначеЕсли ИмяСправочника = "торо_ТиповыеДефектыОборудования" Тогда
			
			ДобавляемыйОбъект.Направление = ?(ЗначениеЗаполнено(ТекущийОбъект.Владелец),ТекущийОбъект.Владелец.Код, 0);
			Если НЕ ТекущийОбъект.ЭтоГруппа Тогда
				ДобавляемыйОбъект.ВидДефекта =?(ЗначениеЗаполнено(ТекущийОбъект.ВидДефекта),ТекущийОбъект.ВидДефекта.Код, 0);
				ДобавляемыйОбъект.КритичностьДефекта = ?(ЗначениеЗаполнено(ТекущийОбъект.КритичностьДефекта),ТекущийОбъект.КритичностьДефекта.Код, 0);
				Если ТекущийОбъект.ПричиныВозникновенияДефекта.Количество()>0 Тогда
					ДобавляемыйОбъект.ПричинаДефекта = Строка(ТекущийОбъект.ПричиныВозникновенияДефекта[0].Причина.Код);
				КонецЕсли;
				ДобавляемыйОбъект.ПоследствиеДефекта = ТекущийОбъект.ПоследствиеДефекта;
				ДобавляемыйОбъект.НаправлениеНаУстранение = ТекущийОбъект.НаправлениеНаУстранение;
			КонецЕсли;
			
		ИначеЕсли ИмяСправочника = "торо_ВидыЭксплуатации" Тогда
			
			ДобавляемыйОбъект.ТипЭксплуатации = Строка(ТекущийОбъект.ТипЭксплуатации);
			
		КонецЕсли;
		
		Если СИерархией Тогда
			Если НЕ ЗначениеЗаполнено(ТекущийОбъект.Родитель) Тогда
				ДобавляемыйОбъект.Родитель = Неопределено;
			Иначе
				ОбъектРодитель = ФабрикаXDTO.Создать(ТипФабрики);
				ЗаполнитьЗначенияСвойств(ОбъектРодитель, ЗначенияПоУмолчанию);
				ОбъектРодитель.Родитель = Неопределено;
				ОбъектРодитель.Код = ТекущийОбъект.Родитель.Код;
				ОбъектРодитель.Наименование = ТекущийОбъект.Родитель.Наименование;
				ДобавляемыйОбъект.Родитель = ОбъектРодитель;
			КонецЕсли;
		КонецЕсли;
		
		Если ИмяСправочника = "торо_ЗначенияИзмеряемыхПоказателейОбъектовРемонта" Тогда
			ДобавляемыйОбъект.КодВладельца = ТекущийОбъект.Владелец.Код;
		КонецЕсли;
		
		СписокXDTO.Добавить(ДобавляемыйОбъект);
		
		Если НЕ Все Тогда
			ПланыОбмена.УдалитьРегистрациюИзменений(Узел, ТекущийОбъект);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьВыборкуДанныхИерархииИзРегистра(СтруктураИерархии, ИзменяетсяДокументами, СписокОР = Неопределено)
	
	Запрос = Новый Запрос;
	
	Если ИзменяетсяДокументами = Истина Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТабРег.ОбъектИерархии КАК ОбъектИерархии,
		|	ТабРег.РодительИерархии,
		|	ТабРег.Удален
		|ПОМЕСТИТЬ ВТ_СтруктураИерархии
		|ИЗ
		|	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(
		|			,
		|			СтруктураИерархии = &СтруктураИерархии
		|				И ОбъектИерархии В (&СписокОР)) КАК ТабРег
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОбъектИерархии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ОбъектыРемонта.Ссылка КАК ОбъектРемонта,
		|	ЕСТЬNULL(ВТ_СтруктураИерархии.РодительИерархии, НЕОПРЕДЕЛЕНО) КАК Родитель,
		|	ЕСТЬNULL(ВТ_СтруктураИерархии.Удален, ИСТИНА) КАК НеВИерархии
		|ПОМЕСТИТЬ ВТ_Список
		|ИЗ
		|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтруктураИерархии КАК ВТ_СтруктураИерархии
		|		ПО торо_ОбъектыРемонта.Ссылка = ВТ_СтруктураИерархии.ОбъектИерархии
		|ГДЕ
		|	торо_ОбъектыРемонта.Ссылка В(&СписокОР)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Список.ОбъектРемонта,
		|	ВТ_Список.ОбъектРемонта.Код,
		|	ВТ_Список.ОбъектРемонта.Наименование,
		|	ВТ_Список.ОбъектРемонта.ЭтоГруппа,
		|	ВТ_Список.Родитель,
		|	ВТ_Список.Родитель.Код,
		|	ВТ_Список.Родитель.Наименование,
		|	ВТ_Список.Родитель.ЭтоГруппа,
		|	ВТ_Список.НеВИерархии
		|ИЗ
		|	ВТ_Список КАК ВТ_Список";
		
		Если СписокОР = Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ОбъектИерархии В (&СписокОР)", "");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "торо_ОбъектыРемонта.Ссылка В(&СписокОР)", "ИСТИНА");
		КонецЕсли;
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТабРег.ОбъектИерархии,
		|	ТабРег.РодительИерархии
		|ПОМЕСТИТЬ ВТ_СтруктураИерархии
		|ИЗ
		|	РегистрСведений.торо_ИерархическиеСтруктурыОР КАК ТабРег
		|ГДЕ
		|	ТабРег.СтруктураИерархии = &СтруктураИерархии
		|	И ТабРег.ОбъектИерархии В(&СписокОР)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ТабРег.ОбъектИерархии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ОбъектыРемонта.Ссылка КАК ОбъектРемонта,
		|	ЕСТЬNULL(ВТ_СтруктураИерархии.РодительИерархии, НЕОПРЕДЕЛЕНО) КАК Родитель,
		|	ВЫБОР
		|		КОГДА ВТ_СтруктураИерархии.ОбъектИерархии ЕСТЬ NULL 
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК НеВИерархии
		|ПОМЕСТИТЬ ВТ_Список
		|ИЗ
		|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтруктураИерархии КАК ВТ_СтруктураИерархии
		|		ПО торо_ОбъектыРемонта.Ссылка = ВТ_СтруктураИерархии.ОбъектИерархии
		|ГДЕ
		|	торо_ОбъектыРемонта.Ссылка В(&СписокОР)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Список.ОбъектРемонта,
		|	ВТ_Список.ОбъектРемонта.Код,
		|	ВТ_Список.ОбъектРемонта.Наименование,
		|	ВТ_Список.ОбъектРемонта.ЭтоГруппа,
		|	ВТ_Список.Родитель,
		|	ВТ_Список.Родитель.Код,
		|	ВТ_Список.Родитель.Наименование,
		|	ВТ_Список.Родитель.ЭтоГруппа,
		|	ВТ_Список.НеВИерархии
		|ИЗ
		|	ВТ_Список КАК ВТ_Список";
		
		Если СписокОР = Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТабРег.ОбъектИерархии В(&СписокОР)", "");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "торо_ОбъектыРемонта.Ссылка В(&СписокОР)", "ИСТИНА");
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("СтруктураИерархии", СтруктураИерархии);
	Если СписокОР <> Неопределено Тогда
		Запрос.УстановитьПараметр("СписокОР", СписокОР);
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка;
		
КонецФункции

Функция ПолучитьАктуальнуюНаработкуДляОР(СписокОР, СписокПоказателей, РегистраторИсключение)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_НаработкаОбъектовРемонтаОбороты.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_НаработкаОбъектовРемонтаОбороты.Показатель КАК Показатель,
	|	СУММА(торо_НаработкаОбъектовРемонтаОбороты.НаработкаОборот) КАК Наработка
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	РегистрНакопления.торо_НаработкаОбъектовРемонта.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			ОбъектРемонта В (&СписокОР)
	|				И Показатель В (&СписокПоказателей)) КАК торо_НаработкаОбъектовРемонтаОбороты
	|ГДЕ
	|	торо_НаработкаОбъектовРемонтаОбороты.Регистратор <> &Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_НаработкаОбъектовРемонтаОбороты.ОбъектРемонта,
	|	торо_НаработкаОбъектовРемонтаОбороты.Показатель
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектРемонта,
	|	Показатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ПериодыНаработкиОРСрезПоследних.Период КАК ДатаКон,
	|	торо_ПериодыНаработкиОРСрезПоследних.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_ПериодыНаработкиОРСрезПоследних.Показатель КАК Показатель
	|ПОМЕСТИТЬ ВТ_Даты
	|ИЗ
	|	РегистрСведений.торо_ПериодыНаработкиОР.СрезПоследних(
	|			,
	|			ОбъектРемонта В (&СписокОР)
	|				И Показатель В (&СписокПоказателей)
	|				И Регистратор <> &Регистратор) КАК торо_ПериодыНаработкиОРСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектРемонта,
	|	Показатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Даты.ОбъектРемонта КАК ОбъектРемонта,
	|	ВТ_Даты.Показатель КАК Показатель,
	|	ВТ_Даты.ДатаКон КАК ДатаКон,
	|	ЕСТЬNULL(ВТ_Остатки.Наработка, 0) КАК Наработка
	|ИЗ
	|	ВТ_Даты КАК ВТ_Даты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
	|		ПО (ВТ_Остатки.ОбъектРемонта = ВТ_Даты.ОбъектРемонта)
	|			И (ВТ_Остатки.Показатель = ВТ_Даты.Показатель)";
	
	Запрос.УстановитьПараметр("СписокОР", СписокОР);
	Запрос.УстановитьПараметр("СписокПоказателей", СписокПоказателей);
	Запрос.УстановитьПараметр("Регистратор", РегистраторИсключение);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьМаксимальныеЗначенияНаработки(СписокОР, СписокПоказателей)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_МаксимальныеЗначенияНаработкиОР.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_МаксимальныеЗначенияНаработкиОР.Показатель КАК Показатель,
	|	торо_МаксимальныеЗначенияНаработкиОР.МаксимальноеЗначение КАК МаксимальноеЗначение
	|ИЗ
	|	РегистрСведений.торо_МаксимальныеЗначенияНаработкиОР КАК торо_МаксимальныеЗначенияНаработкиОР
	|ГДЕ
	|	торо_МаксимальныеЗначенияНаработкиОР.ОбъектРемонта В(&СписокОР)
	|	И торо_МаксимальныеЗначенияНаработкиОР.Показатель В(&СписокПоказателей)";
	
	Запрос.УстановитьПараметр("СписокОР", СписокОР);
	Запрос.УстановитьПараметр("СписокПоказателей", СписокПоказателей);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьИзмеряемыеПоказателиОбъектовРемонта()
	
	ЗапросТиповых = Новый Запрос;
	ЗапросТиповых.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_ОбъектыРемонта.ТиповойОР
	|ИЗ
	|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	|ГДЕ
	|	торо_ОбъектыРемонта.ТиповойОР <> ЗНАЧЕНИЕ(Справочник.торо_ТиповыеОР.ПустаяСсылка)";
	
	СписокТиповых = ЗапросТиповых.Выполнить().Выгрузить().ВыгрузитьКолонку("ТиповойОР");
	
	ТаблицаРодителейТиповых = торо_ОбщегоНазначения.ПолучитьТаблицуРодителейСпискаОбъектов(СписокТиповых, Тип("СправочникСсылка.торо_ТиповыеОР"), Истина);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаРодителей.Родитель КАК Родитель,
	|	ТаблицаРодителей.Уровень КАК Уровень,
	|	ТаблицаРодителей.Объект КАК Объект
	|ПОМЕСТИТЬ ТаблицаРодителейТиповыхОР
	|ИЗ
	|	&ТаблицаРодителей КАК ТаблицаРодителей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ОбъектыРемонта.Ссылка КАК ОбъектРемонта,
	|	ТаблицаРодителейТиповыхОР.Родитель КАК Родитель,
	|	ТаблицаРодителейТиповыхОР.Объект КАК Объект,
	|	ТаблицаРодителейТиповыхОР.Уровень КАК Уровень
	|ПОМЕСТИТЬ ТаблицаОРиТиповыхОР
	|ИЗ
	|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаРодителейТиповыхОР КАК ТаблицаРодителейТиповыхОР
	|		ПО торо_ОбъектыРемонта.ТиповойОР = ТаблицаРодителейТиповыхОР.Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТиповыхОР.ОбъектРемонта КАК ОбъектРемонта,
	|	ТаблицаТиповыхОР.Родитель КАК ТиповойОР,
	|	ТаблицаТиповыхОР.Уровень КАК Уровень
	|ПОМЕСТИТЬ ТаблицаТиповыхОР
	|ИЗ
	|	ТаблицаОРиТиповыхОР КАК ТаблицаТиповыхОР
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТиповыхОР.ОбъектРемонта КАК ОбъектРемонта,
	|	ТаблицаТиповыхОР.Объект КАК ТиповойОР
	|ПОМЕСТИТЬ ТаблицаТиповыхОР_Краткая
	|ИЗ
	|	ТаблицаОРиТиповыхОР КАК ТаблицаТиповыхОР
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ДопустимыйМинимум КАК ДопустимыйМинимум,
	|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ДопустимыйМаксимум КАК ДопустимыйМаксимум,
	|	торо_ИзмеряемыеПоказателиОбъектовРемонта.КритическийМинимум КАК КритическийМинимум,
	|	торо_ИзмеряемыеПоказателиОбъектовРемонта.КритическийМаксимум КАК КритическийМаксимум,
	|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ЗначенияКонтролируемыхПоказателейИзОР КАК ЗначенияКонтролируемыхПоказателейИзОР,
	|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ТочкаЗамера КАК ТочкаЗамера,
	|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_ИзмеряемыеПоказателиОбъектовРемонта.Показатель КАК Показатель,
	|	ТаблицаТиповыхОР_Краткая.ТиповойОР КАК ТиповойОР,
	|	1 КАК Приоритет,
	|	ЛОЖЬ КАК ИзТиповогоОР,
	|	торо_ИзмеряемыеПоказателиОбъектовРемонта.Удален КАК Удален,
	|	-1 КАК Уровень
	|ПОМЕСТИТЬ ПоказателиОРИТиповогоОР
	|ИЗ
	|	РегистрСведений.торо_ИзмеряемыеПоказателиОбъектовРемонта КАК торо_ИзмеряемыеПоказателиОбъектовРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаТиповыхОР_Краткая КАК ТаблицаТиповыхОР_Краткая
	|		ПО торо_ИзмеряемыеПоказателиОбъектовРемонта.ОбъектРемонта = ТаблицаТиповыхОР_Краткая.ОбъектРемонта
	|ГДЕ
	|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ОбъектРемонта ССЫЛКА Справочник.торо_ОбъектыРемонта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ДопустимыйМинимум,
	|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ДопустимыйМаксимум,
	|	торо_ИзмеряемыеПоказателиОбъектовРемонта.КритическийМинимум,
	|	торо_ИзмеряемыеПоказателиОбъектовРемонта.КритическийМаксимум,
	|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ЗначенияКонтролируемыхПоказателейИзОР,
	|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ТочкаЗамера,
	|	ТаблицаТиповыхОР.ОбъектРемонта,
	|	торо_ИзмеряемыеПоказателиОбъектовРемонта.Показатель,
	|	ТаблицаТиповыхОР.ТиповойОР,
	|	0,
	|	ИСТИНА,
	|	торо_ИзмеряемыеПоказателиОбъектовРемонта.Удален,
	|	ТаблицаТиповыхОР.Уровень
	|ИЗ
	|	РегистрСведений.торо_ИзмеряемыеПоказателиОбъектовРемонта КАК торо_ИзмеряемыеПоказателиОбъектовРемонта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТиповыхОР КАК ТаблицаТиповыхОР
	|		ПО ((ВЫРАЗИТЬ(торо_ИзмеряемыеПоказателиОбъектовРемонта.ОбъектРемонта КАК Справочник.торо_ТиповыеОР)) = ТаблицаТиповыхОР.ТиповойОР)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектРемонта,
	|	Показатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоказателиОРИТиповогоОР.ОбъектРемонта КАК ОбъектРемонта,
	|	ПоказателиОРИТиповогоОР.Показатель КАК Показатель,
	|	МИНИМУМ(ПоказателиОРИТиповогоОР.Уровень) КАК Уровень
	|ПОМЕСТИТЬ ВТ_ПриоритетыПоУровню
	|ИЗ
	|	ПоказателиОРИТиповогоОР КАК ПоказателиОРИТиповогоОР
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоказателиОРИТиповогоОР.ОбъектРемонта,
	|	ПоказателиОРИТиповогоОР.Показатель
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектРемонта,
	|	Показатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоказателиОРИТиповогоОР.ДопустимыйМинимум КАК ДопустимыйМинимум,
	|	ПоказателиОРИТиповогоОР.ДопустимыйМаксимум КАК ДопустимыйМаксимум,
	|	ПоказателиОРИТиповогоОР.КритическийМинимум КАК КритическийМинимум,
	|	ПоказателиОРИТиповогоОР.КритическийМаксимум КАК КритическийМаксимум,
	|	ПоказателиОРИТиповогоОР.ЗначенияКонтролируемыхПоказателейИзОР КАК ЗначенияКонтролируемыхПоказателейИзОР,
	|	ПоказателиОРИТиповогоОР.ТочкаЗамера КАК ТочкаЗамера,
	|	ПоказателиОРИТиповогоОР.ОбъектРемонта КАК ОбъектРемонта,
	|	ПоказателиОРИТиповогоОР.Показатель КАК Показатель,
	|	ПоказателиОРИТиповогоОР.ТиповойОР КАК ТиповойОР,
	|	ПоказателиОРИТиповогоОР.Приоритет КАК Приоритет,
	|	ПоказателиОРИТиповогоОР.ИзТиповогоОР КАК ИзТиповогоОР,
	|	ПоказателиОРИТиповогоОР.Удален КАК Удален,
	|	ПоказателиОРИТиповогоОР.Уровень КАК Уровень
	|ПОМЕСТИТЬ ВТ_ПриоритетныеПоказатели
	|ИЗ
	|	ПоказателиОРИТиповогоОР КАК ПоказателиОРИТиповогоОР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПриоритетыПоУровню КАК ВТ_ПриоритетыПоУровню
	|		ПО ПоказателиОРИТиповогоОР.ОбъектРемонта = ВТ_ПриоритетыПоУровню.ОбъектРемонта
	|			И ПоказателиОРИТиповогоОР.Показатель = ВТ_ПриоритетыПоУровню.Показатель
	|			И ПоказателиОРИТиповогоОР.Уровень = ВТ_ПриоритетыПоУровню.Уровень
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПриоритетовПолная.ОбъектРемонта КАК ОбъектРемонта,
	|	ТаблицаПриоритетовПолная.Показатель КАК Показатель,
	|	МАКСИМУМ(ТаблицаПриоритетовПолная.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ ТаблицаПриоритетов
	|ИЗ
	|	ВТ_ПриоритетныеПоказатели КАК ТаблицаПриоритетовПолная
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПриоритетовПолная.ОбъектРемонта,
	|	ТаблицаПриоритетовПолная.Показатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоказателиОРИТиповогоОР.Показатель КАК Показатель,
	|	ПоказателиОРИТиповогоОР.ОбъектРемонта КАК ОбъектРемонта,
	|	ПоказателиОРИТиповогоОР.ТиповойОР КАК ТиповойОР,
	|	ПоказателиОРИТиповогоОР.ИзТиповогоОР КАК ИзТиповогоОР,
	|	ВЫБОР
	|		КОГДА ПоказателиОРИТиповогоОР.ЗначенияКонтролируемыхПоказателейИзОР
	|			ТОГДА ПоказателиОРИТиповогоОР.ДопустимыйМинимум
	|		ИНАЧЕ торо_ИзмеряемыеПоказателиОбъектовРемонта.ДопустимыйМинимум
	|	КОНЕЦ КАК ДопустимыйМинимум,
	|	ВЫБОР
	|		КОГДА ПоказателиОРИТиповогоОР.ЗначенияКонтролируемыхПоказателейИзОР
	|			ТОГДА ПоказателиОРИТиповогоОР.ДопустимыйМаксимум
	|		ИНАЧЕ торо_ИзмеряемыеПоказателиОбъектовРемонта.ДопустимыйМаксимум
	|	КОНЕЦ КАК ДопустимыйМаксимум,
	|	ВЫБОР
	|		КОГДА ПоказателиОРИТиповогоОР.ЗначенияКонтролируемыхПоказателейИзОР
	|			ТОГДА ПоказателиОРИТиповогоОР.КритическийМинимум
	|		ИНАЧЕ торо_ИзмеряемыеПоказателиОбъектовРемонта.КритическийМинимум
	|	КОНЕЦ КАК КритическийМинимум,
	|	ВЫБОР
	|		КОГДА ПоказателиОРИТиповогоОР.ЗначенияКонтролируемыхПоказателейИзОР
	|			ТОГДА ПоказателиОРИТиповогоОР.КритическийМаксимум
	|		ИНАЧЕ торо_ИзмеряемыеПоказателиОбъектовРемонта.КритическийМаксимум
	|	КОНЕЦ КАК КритическийМаксимум,
	|	ПоказателиОРИТиповогоОР.ЗначенияКонтролируемыхПоказателейИзОР КАК ЗначенияКонтролируемыхПоказателейИзОР,
	|	ПоказателиОРИТиповогоОР.ТочкаЗамера КАК ТочкаЗамера,
	|	ПоказателиОРИТиповогоОР.Удален КАК Удален,
	|	торо_ИзмеряемыеПоказателиОбъектовРемонта.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ИЗ
	|	ВТ_ПриоритетныеПоказатели КАК ПоказателиОРИТиповогоОР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПриоритетов КАК ТаблицаПриоритетов
	|		ПО ПоказателиОРИТиповогоОР.ОбъектРемонта = ТаблицаПриоритетов.ОбъектРемонта
	|			И ПоказателиОРИТиповогоОР.Показатель = ТаблицаПриоритетов.Показатель
	|			И ПоказателиОРИТиповогоОР.Приоритет = ТаблицаПриоритетов.Приоритет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.торо_ИзмеряемыеПоказателиОбъектовРемонта КАК торо_ИзмеряемыеПоказателиОбъектовРемонта
	|		ПО ПоказателиОРИТиповогоОР.Показатель = торо_ИзмеряемыеПоказателиОбъектовРемонта.Ссылка
	|ГДЕ
	|	НЕ ПоказателиОРИТиповогоОР.Удален";
		
	Запрос.УстановитьПараметр("ТаблицаРодителей", ТаблицаРодителейТиповых);
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выбрать();
	
КонецФункции

Функция ПолучитьОбъектыРемонтаПодчиненныеТиповым(МассивТиповыхОР)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_ТиповыеОР.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_СписокТОР
	|ИЗ
	|	Справочник.торо_ТиповыеОР КАК торо_ТиповыеОР
	|ГДЕ
	|	торо_ТиповыеОР.Ссылка В ИЕРАРХИИ(&МассивТОР)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ОбъектыРемонта.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СписокТОР КАК ВТ_СписокТОР
	|		ПО торо_ОбъектыРемонта.ТиповойОР = ВТ_СписокТОР.Ссылка";
	
	Запрос.УстановитьПараметр("МассивТОР", МассивТиповыхОР);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат.ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция ПолучитьСписокПоказателейНаработкиОР(ОбъектРемонта)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ПараметрыНаработкиОбъектовРемонта.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_ПараметрыНаработкиОбъектовРемонта.Показатель КАК Показатель
	|ПОМЕСТИТЬ ПоказателиОР
	|ИЗ
	|	РегистрСведений.торо_ПараметрыНаработкиОбъектовРемонта КАК торо_ПараметрыНаработкиОбъектовРемонта
	|ГДЕ
	|	торо_ПараметрыНаработкиОбъектовРемонта.ОбъектРемонта = &ОбъектРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРодителей.Родитель КАК Родитель
	|ПОМЕСТИТЬ ТаблицаРодителей
	|ИЗ
	|	&ТаблицаРодителей КАК ТаблицаРодителей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	торо_ПараметрыНаработкиОбъектовРемонта.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_ПараметрыНаработкиОбъектовРемонта.Показатель КАК Показатель
	|ПОМЕСТИТЬ ПоказателиГрупп
	|ИЗ
	|	РегистрСведений.торо_ПараметрыНаработкиОбъектовРемонта.СрезПоследних(
	|			,
	|			ОбъектРемонта В
	|				(ВЫБРАТЬ
	|					ТаблицаРодителей.Родитель
	|				ИЗ
	|					ТаблицаРодителей КАК ТаблицаРодителей)) КАК торо_ПараметрыНаработкиОбъектовРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоказателиОР.Показатель КАК Показатель
	|ИЗ
	|	ПоказателиОР КАК ПоказателиОР
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ПоказателиГрупп.Показатель
	|ИЗ
	|	ПоказателиГрупп КАК ПоказателиГрупп";
	
	Запрос.УстановитьПараметр("ОбъектРемонта", ОбъектРемонта);
	
	СписокТиповых = Новый Массив;
	Если ЗначениеЗаполнено(ОбъектРемонта.ТиповойОР) Тогда
		СписокТиповых.Добавить(ОбъектРемонта.ТиповойОР);
	КонецЕсли;
	ТаблицаРодителей = торо_ОбщегоНазначения.ПолучитьТаблицуРодителейСпискаОбъектов(СписокТиповых, Тип("СправочникСсылка.торо_ТиповыеОР"), Истина);
	
	Запрос.УстановитьПараметр("ТаблицаРодителей", ТаблицаРодителей);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса.ВыгрузитьКолонку("Показатель");
	
КонецФункции


Функция ПодготовитьПустуюСтруктуруОтвета()
	
	ТипСтруктуры = ФабрикаXDTO.Тип("android", "СтруктураОтвета");
	СтруктураОтвета = ФабрикаXDTO.Создать(ТипСтруктуры);
	СтруктураОтвета.ДокументПроведен = Ложь;
	СтруктураОтвета.НомерДокумента = "";
	
	Возврат СтруктураОтвета;	
	
КонецФункции

Функция ДобавитьОшибкуВМассив(МассивОшибок, ТекстОшибки, КодОшибки = 0)
	
	ТипСтруктуры = ФабрикаXDTO.Тип("android", "СтруктураТекстаОшибки");
	СтруктураОшибки = ФабрикаXDTO.Создать(ТипСтруктуры);

	СтруктураОшибки.ТекстОшибки = ТекстОшибки;
	СтруктураОшибки.КодОшибки = КодОшибки;
	
	МассивОшибок.Добавить(СтруктураОшибки);
	
КонецФункции

/////////////////////////////////////////////////////////////////////////
// Заполнение наработки

Процедура РаспространитьНаработкуНаПодчиненныхДляТекущейСтроки(Объект, ТекСтрокаНаработкаОбъектов, ТаблицаИерархииОР, мОтказ = Ложь, ТекстОшибки = "")
			
	ТаблицаПодчиненныхОР = торо_РаботаСНаработкой.ПолучитьЗависимыеОР(ТаблицаИерархииОР, ТекСтрокаНаработкаОбъектов.Объект, Неопределено, ТекСтрокаНаработкаОбъектов.ДатаРаботыС, ТекСтрокаНаработкаОбъектов.ДатаРаботыПо, ТекСтрокаНаработкаОбъектов.Показатель);
	
	Для Каждого СтрокаСНаработкой Из Объект.НаработкаОбъектов Цикл
		Если ТаблицаПодчиненныхОР.НайтиСтроки(Новый Структура("ОбъектИерархии,Показатель", СтрокаСНаработкой.Объект,СтрокаСНаработкой.Показатель)).Количество() = 0 Тогда
			Продолжить;
		Иначе
			ШаблонСообщения = НСтр("es='Es imposible difundir la elaboración en los objetos subordinados de la reparación. El objeto de la reparación ""%1"" se encuentra repetidamente entre los objetos subordinados de la reparación del objeto ""%2"".';ru='Невозможно распространить наработку на подчиненные объекты ремонта. Объект ремонта ""%1"" встречается повторно среди подчиненных объектов ремонта объекта ""%2"".';en='Unabble to extend timing to subordinate repair facilities"
"Repair object %1 is encountered repeatedly among subordinate repair objects of object ""%2"".'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, СтрокаСНаработкой.Объект, ТекСтрокаНаработкаОбъектов.Объект);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, мОтказ);
			
		КонецЕсли;
	КонецЦикла; 
	
	Если Не мОтказ Тогда
		ТабЗначенийНаработки = торо_РаботаСНаработкой.ТекущееЗначениеНаработкиТаблица(ТаблицаПодчиненныхОР, Объект.Ссылка);
	
		НеобходимаСинхронизация = Ложь;
		Для Каждого СтрПодчиненнаяНаработка Из ТабЗначенийНаработки Цикл
			Если СтрПодчиненнаяНаработка.НаработаноДата <> СтрПодчиненнаяНаработка.ДатаНачала Тогда
				НеобходимаСинхронизация = Истина;
				//ТекСтрокаНаработкаОбъектов.Синхронизировать = Истина;
				ТекСтрокаНаработкаОбъектов.РаспространятьНаПодчиненных = Ложь;
				мОтказ = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если НеобходимаСинхронизация Тогда
			ШаблонСообщения = НСтр("es='¡Para la difusión de la elaboración en subordinado ""%1"" ОР es necesario cumplir la sincronización de los períodos del registro de la elaboración!';ru='Для распространения наработки на подчиненные ""%1"" ОР необходимо выполнить синхронизацию периодов регистрации наработки!';en='To extend the operating time to the subordinates of the ""%1"" PR, it is necessary to synchronize the operating time registration periods!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, СтрокаСНаработкой.Объект);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Иначе
			СтруктураДляПередачи = Новый Структура("Объект, Показатель, ДатаРаботыС, ДатаРаботыПо, Наработка");
			ЗаполнитьЗначенияСвойств(СтруктураДляПередачи, ТекСтрокаНаработкаОбъектов);
			торо_РаботаСНаработкой.РаспространитьНаработкуНаПодчиненныхДляТекСтроки(СтруктураДляПередачи, ТабЗначенийНаработки, ТаблицаПодчиненныхОР, Объект);
		КонецЕсли;
	КонецЕсли;
	
	Если мОтказ Тогда
		ТекСтрокаНаработкаОбъектов.РаспространятьНаПодчиненных = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
