#Область СлужебныеПроцедурыИФункции

// гкс+ [Релиз 1] Куст 17.03.2020

// Обновляет переводы на форме
//
// Параметры:
//  ЭтаФорма - УправляемаяФорма
//  СтроковыеРеквизиты - Строка - Наименования реквизитов через запятую
Процедура ОбновитьПереводы(ЭтаФорма, СтроковыеРеквизиты) Экспорт
	Языки = торо_Локализация.ПолучитьЯзыки();
	ЯзыкПоУмолчанию = торо_ОбщегоНазначенияПовтИсп.ТекущийЯзыкИБ();
	МассивСтроковыхРеквизитов = СтрРазделить(СтроковыеРеквизиты, ",");
	
	Переводы = ПолучитьПереводыСтроковыхРеквизитов(МассивСтроковыхРеквизитов, ЭтаФорма, Языки, ЯзыкПоУмолчанию);
	ЗаполнитьСтроковыеРеквизиты(Переводы, ЭтаФорма, Языки, ЯзыкПоУмолчанию);
КонецПроцедуры

// Удаляет текущие переводы на форме
//
// Параметры:
//  ЭтаФорма - УправляемаяФорма
//  СтроковыеРеквизиты - Строка - Наименования реквизитов через запятую
Процедура ОчиститьПереводы(ЭтаФорма, СтроковыеРеквизиты) Экспорт
	Языки = торо_Локализация.ПолучитьЯзыки();
	ЯзыкПоУмолчанию = торо_ОбщегоНазначенияПовтИсп.ТекущийЯзыкИБ();
	МассивСтроковыхРеквизитов = СтрРазделить(СтроковыеРеквизиты, ",");
	
	Переводы = Новый ТаблицаЗначений;
	Переводы.Колонки.Добавить("Реквизит", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(250)));
	Переводы.Колонки.Добавить("Язык", Новый ОписаниеТипов("СправочникСсылка.торо_Языки"));
	Переводы.Колонки.Добавить("Значение", Новый ОписаниеТипов("Строка"));
	
	Для каждого Реквизит Из МассивСтроковыхРеквизитов Цикл
		Для каждого Язык Из Языки Цикл
			НоваяСтрока = Переводы.Добавить();
			НоваяСтрока.Язык = Язык.Ссылка;
			НоваяСтрока.Реквизит = Реквизит;
			НоваяСтрока.Значение = "";
		КонецЦикла; 
	КонецЦикла;
	
	ЗаполнитьСтроковыеРеквизиты(Переводы, ЭтаФорма, Языки, ЯзыкПоУмолчанию);
КонецПроцедуры
// гкс- [Релиз 1] Куст 17.03.2020

&ИзменениеИКонтроль("ПолучитьПереводыСтроковыхРеквизитов")
Функция Расш_гкс_ПолучитьПереводыСтроковыхРеквизитов(Реквизиты, ЭтаФорма, Языки, ЯзыкПоУмолчанию)

	#Вставка
	дс_Ссылка = ЭтаФорма.Объект.Ссылка;
	ЭтоПустая = ЗначениеЗаполнено(дс_Ссылка);
	#КонецВставки
	Переводы = Новый ТаблицаЗначений;
	Переводы.Колонки.Добавить("Реквизит", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(250)));
	Переводы.Колонки.Добавить("Язык", Новый ОписаниеТипов("СправочникСсылка.торо_Языки"));
	Переводы.Колонки.Добавить("Значение", Новый ОписаниеТипов("Строка"));

	Для каждого Реквизит Из Реквизиты Цикл
		Для каждого Язык Из Языки Цикл
			НоваяСтрока = Переводы.Добавить();
			НоваяСтрока.Язык = Язык.Ссылка;
			НоваяСтрока.Реквизит = Реквизит;
			#Вставка
			Если ЭтоПустая Тогда 
				НоваяСтрока.Значение = "";
			ИначеЕсли Язык.Ссылка = ЯзыкПоУмолчанию Тогда
			#КонецВставки
			#Удаление
			Если Язык.Ссылка = ЯзыкПоУмолчанию Тогда
			#КонецУдаления
				НоваяСтрока.Значение = ЭтаФорма.Объект[Реквизит];
			Иначе
				НаименованиеРеквизита = СтрШаблон("Объект_%1", Язык.Код);
				НоваяСтрока.Значение = ЭтаФорма[НаименованиеРеквизита][Реквизит];
			КонецЕсли; 
			Если ЗначениеЗаполнено(НоваяСтрока.Значение) = Ложь Тогда 
				НоваяСтрока.Значение = ЭтаФорма.Объект[Реквизит];
			КонецЕсли;
		КонецЦикла; 
	КонецЦикла; 

	Запрос = Новый Запрос;
	Запрос.Текст = 
	#Область ТекстЗапроса
	"ВЫБРАТЬ
	|	тПереводы.Реквизит КАК Реквизит,
	|	тПереводы.Язык КАК Язык,
	|	тПереводы.Значение КАК Значение
	|ПОМЕСТИТЬ тПереводы
	|ИЗ
	|	&тПереводы КАК тПереводы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тПереводы.Реквизит КАК Реквизит,
	|	тПереводы.Язык КАК Язык,
	|	ЕСТЬNULL(торо_Переводы.Текст, тПереводы.Значение) КАК Значение
	|ИЗ
	|	тПереводы КАК тПереводы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_Переводы КАК торо_Переводы
	|		ПО тПереводы.Реквизит = торо_Переводы.Реквизит
	#Удаление
	|			И тПереводы.Язык = торо_Переводы.Язык";
	#КонецУдаления
	#Вставка
	|			И тПереводы.Язык = торо_Переводы.Язык
	|			И (торо_Переводы.ID = &Ссылка)";
	#КонецВставки

	#КонецОбласти 

	Запрос.УстановитьПараметр("тПереводы", Переводы);
	#Вставка
	Запрос.УстановитьПараметр("Ссылка", дс_Ссылка);
	#КонецВставки

	Результат = Запрос.Выполнить().Выгрузить();

	Возврат Результат;
КонецФункции

&ИзменениеИКонтроль("ПриСоздании")
Процедура Расш_гкс_ПриСоздании(ЭтаФорма, СтроковыеРеквизиты)
	Языки = торо_Локализация.ПолучитьЯзыки();
	#Вставка
	ЯзыкПоУмолчанию = торо_ОбщегоНазначенияПовтИсп.ТекущийЯзыкИБ();
	#КонецВставки
	#Удаление
	ЯзыкПоУмолчанию = торо_Локализация.ТекущийЯзыкИБ();
	#КонецУдаления
	МассивСтроковыхРеквизитов = СтрРазделить(СтроковыеРеквизиты, ",");

	ДобавлениеВспомогательныхРеквизитов(МассивСтроковыхРеквизитов, ЭтаФорма, Языки, ЯзыкПоУмолчанию);
	Переводы = ПолучитьПереводыСтроковыхРеквизитов(МассивСтроковыхРеквизитов, ЭтаФорма, Языки, ЯзыкПоУмолчанию);
	ЗаполнитьСтроковыеРеквизиты(Переводы, ЭтаФорма, Языки, ЯзыкПоУмолчанию);
	ЭлементыФормы = ПолучитьЭлелементыСтроковыхРеквизитов(МассивСтроковыхРеквизитов, ЭтаФорма);
	УстановитьДействияВыбора(ЭлементыФормы);
КонецПроцедуры

&ИзменениеИКонтроль("ПередЗаписьюНаСервере")
Процедура Расш_гкс_ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	СтроковыеРеквизиты = СтрРазделить(ЭтаФорма.дс_СписокЛокализованныхРеквизитов, ",");

	Языки = торо_Локализация.ПолучитьЯзыки();
	#Вставка
	ЯзыкПоУмолчанию = торо_ОбщегоНазначенияПовтИсп.ТекущийЯзыкИБ();
	#КонецВставки
	#Удаление
	ЯзыкПоУмолчанию = торо_Локализация.ТекущийЯзыкИБ();
	#КонецУдаления

	Переводы = Новый Массив;

	Для каждого Реквизит Из СтроковыеРеквизиты Цикл
		Для каждого Язык Из Языки Цикл
			Перевод = Новый Структура("Реквизит,Язык,Значение");
			Перевод.Язык = Язык.Ссылка;
			Перевод.Реквизит = Реквизит;

			Если Язык.Ссылка = ЯзыкПоУмолчанию Тогда
				Перевод.Значение = ЭтаФорма.Объект[Реквизит];
			Иначе
				НаименованиеРеквизита = СтрШаблон("Объект_%1", Язык.Код);
				Перевод.Значение = ЭтаФорма[НаименованиеРеквизита][Реквизит];
			КонецЕсли; 

			Переводы.Добавить(Перевод);
		КонецЦикла; 
	КонецЦикла; 

	ПараметрыЗаписи.Вставить("Переводы", Переводы);
КонецПроцедуры

#КонецОбласти