
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаГлобальные;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
	
	УстановитьВидимостьЭлементов();
	
	Если Параметры.Ключ.Пустая() Тогда // ЭтоНовый
		Объект.ВидОперации 
			= ПредопределенноеЗначение("Перечисление.гкс_ВидыОперацииВводДанныхПоТрудовымРесурсам.ВводДанных");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	Объект.Трудозатраты.Очистить();
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Трудозатраты

&НаКлиенте
Процедура ТрудозатратыПриАктивизацииСтроки(Элемент)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ТрудозатратыДолжностьПриИзменении(Элемент)
	ТекущаяСтрока =	Элементы.Трудозатраты.ТекущиеДанные;
	Если ЗначениеЗаполнено(Объект.Организация) 
		И ЗначениеЗаполнено(ТекущаяСтрока.Подразделение) 
		И ЗначениеЗаполнено(ТекущаяСтрока.Должность) Тогда
		ТекущаяСтрока.Квалификация = КвалификацияПоДолжности(Объект.Организация, 
														ТекущаяСтрока.Подразделение, 
														ТекущаяСтрока.Должность);
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	Корректировка = (Объект.ВидОперации 
					= Перечисления.гкс_ВидыОперацииВводДанныхПоТрудовымРесурсам.Корректировка);
	Элементы.ТрудозатратыЗапланировано.Видимость = Корректировка;
	Элементы.ТрудозатратыВидДвижения.Видимость = Корректировка;
	
КонецПроцедуры                          

&НаСервере
Функция КвалификацияПоДолжности(Организация, Подразделение, Должность)
	
	Квалификация = 
	РегистрыСведений.гкс_СоответствияДолжностейИКвалификаций.КвалификацияДолжности(Организация, Подразделение, Должность);
	
	Возврат Квалификация;
	
КонецФункции

#КонецОбласти

