
&НаСервере
Процедура Расш_гкс_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ДобавитьНовыеЭлементы();
КонецПроцедуры

&НаСервере
Процедура ДобавитьНовыеЭлементы()
	НЭлем = Элементы.Добавить("гкс_ГруппаОрганизация", Тип("ГруппаФормы"));
	НЭлем.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НЭлем.ОтображатьЗаголовок = Ложь;
	//
	Элементы.Переместить(Элементы["гкс_ГруппаОрганизация"], ЭтаФорма, Элементы.ГруппаСтраницы);
	//
	НЭлем = Элементы.Добавить("гкс_Организация", Тип("ПолеФормы"), Элементы["гкс_ГруппаОрганизация"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Объект.Организация";
	//
	НЭлем = Элементы.Добавить("гкс_ВидЦены", Тип("ПолеФормы"), Элементы["гкс_ГруппаОрганизация"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Объект.Организация.гкс_ВидЦены";
	//
	НЭлем = Элементы.Добавить("гкс_Валюта", Тип("ПолеФормы"), Элементы["гкс_ГруппаОрганизация"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Объект.Организация.гкс_ВидЦены.ВалютаЦены";
КонецПроцедуры
