
#Область ПрограммныйИнтерфейс

Функция ПолучитьТаблицуРодителей(КлассыДляЧтения, СписокРеквизитов="") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КлассыДляЧтения", КлассыДляЧтения);
	Запрос.Текст = ТекстЗапросаТаблицаРодителей();
	
	ТаблицаРодителей = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.Прямой);
	ТаблицаРодителей.Колонки.Добавить("Уровень", Новый ОписаниеТипов("Число"));
	
	ТекКлассДляЧтения = Неопределено;
	Для Каждого СтрокаТЗ ИЗ ТаблицаРодителей Цикл
		Если НЕ СтрокаТЗ.КлассДляЧтения = ТекКлассДляЧтения Тогда
			М = 0;
			ТекКлассДляЧтения = СтрокаТЗ.КлассДляЧтения;
			ПредКласс = Неопределено;
		КонецЕсли;
		Если НЕ ПредКласс = СтрокаТЗ.Класс Тогда // Не заполняем уровень у дублирующихся строк.
			СтрокаТЗ.Уровень = М;
			Если М > 0 Тогда
				ПредКласс = СтрокаТЗ.Класс;
			КонецЕсли;
			М = М + 1;
		КонецЕсли;
	КонецЦикла;
	
	НайденоУдалить = ТаблицаРодителей.НайтиСтроки(Новый Структура("Уровень", 0));
	Для Каждого СтрокаТЗ ИЗ НайденоУдалить Цикл
		ТаблицаРодителей.Удалить(СтрокаТЗ);
	КонецЦикла;
	
	
	СтандартныеРеквизиты = Новый Структура("Код, Наименование, Родитель, ПометкаУдаления, Предопределенный");
	
	Если ЗначениеЗаполнено(СписокРеквизитов) Тогда
		ВсеКлассы = ТаблицаРодителей.ВыгрузитьКолонку("Класс");
		СтруктураРеквизитов = Новый Структура(СписокРеквизитов);
		МетаданныеРеквизитов = Метаданные.Справочники.Классы.Реквизиты;
		МетаданныеСтандартных = Метаданные.Справочники.Классы.СтандартныеРеквизиты;
		Для Каждого КлючИЗначение ИЗ СтруктураРеквизитов Цикл
			Если СтандартныеРеквизиты.Свойство(КлючИЗначение.Ключ) Тогда
				ТипРеквизита = МетаданныеСтандартных[КлючИЗначение.Ключ].Тип;
			ИначеЕсли НЕ МетаданныеРеквизитов.Найти(КлючИЗначение.Ключ) = Неопределено Тогда
				ТипРеквизита = МетаданныеРеквизитов[КлючИЗначение.Ключ].Тип;
			Иначе
				ВызватьИсключение УправлениеНСИФункцииКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
					НСтр("ru='Ошибка при выполнении функции ПолучитьТаблицуРодителей. Реквизит %1 не найден.'"), КлючИЗначение.Ключ);
			КонецЕсли;
			ТаблицаРодителей.Колонки.Добавить(КлючИЗначение.Ключ, ТипРеквизита);
		КонецЦикла;
		ЗначенияРеквизитов = УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначенияРеквизитовОбъектов(ВсеКлассы, СписокРеквизитов);
		
		Для Каждого СтрокаРодитель ИЗ ТаблицаРодителей Цикл
			ТекЗначения = ЗначенияРеквизитов[СтрокаРодитель.Класс];
			ЗаполнитьЗначенияСвойств(СтрокаРодитель, ТекЗначения);
		КонецЦикла;
	КонецЕсли;
	
	
	Возврат ТаблицаРодителей;
	
КонецФункции

Функция ПолучитьЗначениеРодителя(СписокРодителей, Уровень, ИмяРеквизитаРодителя) Экспорт
	
	ЗначениеРодителя = Неопределено;
	
	Для Н = 1 По Уровень Цикл
		СтрокаРодителя = СписокРодителей[Уровень - Н];
		ЗначениеРодителя = СтрокаРодителя[ИмяРеквизитаРодителя];
		Если ЗначениеЗаполнено(ЗначениеРодителя) Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЗначениеРодителя;
	
КонецФункции

Функция ПолучитьРежимКонтроляДублейПоНаименованию(СписокРодителей) Экспорт
	
	КолВо = СписокРодителей.Количество();
	
	РежимКонтроляДублейПоНаименованию = Неопределено;
	КонтрольДублейВПределахКласса = Неопределено;
	
	Для Н = 1 По КолВо Цикл
		СтрокаРодителя = СписокРодителей[КолВо - Н];
		Если ЗначениеЗаполнено(СтрокаРодителя.РежимКонтроляДублейПоНаименованию) Тогда
			РежимКонтроляДублейПоНаименованию = СтрокаРодителя.РежимКонтроляДублейПоНаименованию;
			КонтрольДублейВПределахКласса     = СтрокаРодителя.КонтрольДублейВПределахКласса;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(РежимКонтроляДублейПоНаименованию) 
			ИЛИ (РежимКонтроляДублейПоНаименованию = Перечисления.РежимыКонтроляДублей.НеИспользовать) Тогда
		РежимКонтроляДублейПредставление = НСтр("ru='Не использовать'");
	ИначеЕсли (РежимКонтроляДублейПоНаименованию = Перечисления.РежимыКонтроляДублей.ВПределахКласса) Тогда
		Если ЗначениеЗаполнено(КонтрольДублейВПределахКласса) Тогда
			РежимКонтроляДублейПредставление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='В пределах класса %1'"), Строка(КонтрольДублейВПределахКласса));
		Иначе
			РежимКонтроляДублейПредставление = НСтр("ru='В пределах текущего класса'");
		КонецЕсли;
	КонецЕсли;
	
	Возврат Новый Структура(
		"РежимКонтроляДублейПоНаименованию, КонтрольДублейВПределахКласса, РежимКонтроляДублейПредставление",
		РежимКонтроляДублейПоНаименованию, КонтрольДублейВПределахКласса, РежимКонтроляДублейПредставление);
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Работа с атрибутами классов.

Функция ТекстЗапросаСписокРодителей() Экспорт
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СписокРодителей.Класс КАК Класс,
		|	СписокРодителей.КлассДляЧтения КАК КлассДляЧтения,
		|	СписокРодителей.Уровень КАК Уровень
		|ПОМЕСТИТЬ ВТ_СписокРодителей
		|ИЗ
		|	&СписокРодителей КАК СписокРодителей";
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаНеНаследуемыеАтрибуты(ТекстУсловияПоНенаследуемым="") Экспорт
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВТ_СписокРодителей.КлассДляЧтения КАК КлассДляЧтения,
		|	НенаследуемыеЗначения.АтрибутКласса КАК АтрибутКласса,
		|	МИНИМУМ(ВЫБОР
		|			КОГДА НенаследуемыеЗначения.Класс = ВТ_СписокРодителей.КлассДляЧтения
		|				ТОГДА 0
		|			ИНАЧЕ 1
		|		КОНЕЦ) КАК УровеньНаследования
		|ПОМЕСТИТЬ ВТ_НеНаследуемыеАтрибуты
		|ИЗ
		|	РегистрСведений.НенаследуемыеЗначения КАК НенаследуемыеЗначения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СписокРодителей КАК ВТ_СписокРодителей
		|		ПО НенаследуемыеЗначения.Класс = ВТ_СписокРодителей.Класс
		|ГДЕ
		|	НенаследуемыеЗначения.Класс В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ВТ_СписокРодителей.Класс
		|			ИЗ
		|				ВТ_СписокРодителей)
		|	И НенаследуемыеЗначения.НеНаследуемыйАтрибут //%1
		|
		|СГРУППИРОВАТЬ ПО
		|	НенаследуемыеЗначения.АтрибутКласса,
		|	ВТ_СписокРодителей.КлассДляЧтения";
	Возврат ?(ПустаяСтрока(ТекстУсловияПоНенаследуемым), ТекстЗапроса,
		УправлениеНСИФункцииКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(ТекстЗапроса, ТекстУсловияПоНенаследуемым));
	
КонецФункции

Функция ТекстЗапросаЗначенияАтрибутов(ТекстУсловияПоЗначениям="") Экспорт
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВТ_СписокРодителей.КлассДляЧтения КАК КлассДляЧтения,
		|	ЗначенияАтрибутовКласса.Класс КАК Класс,
		|	ЗначенияАтрибутовКласса.АтрибутКласса КАК АтрибутКласса,
		|	ЗначенияАтрибутовКласса.ЗначениеАтрибутаКласса КАК ЗначениеАтрибутаКласса,
		|	ВЫБОР
		|		КОГДА ЗначенияАтрибутовКласса.Класс = ВТ_СписокРодителей.КлассДляЧтения
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК УровеньНаследования,
		|	ВТ_СписокРодителей.Уровень КАК Уровень
		|ПОМЕСТИТЬ ВТ_ЗначенияАтрибутов
		|ИЗ
		|	РегистрСведений.ЗначенияАтрибутовКласса КАК ЗначенияАтрибутовКласса
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СписокРодителей КАК ВТ_СписокРодителей
		|		ПО ЗначенияАтрибутовКласса.Класс = ВТ_СписокРодителей.Класс
		|ГДЕ
		|	ЗначенияАтрибутовКласса.Класс В
		|			(ВЫБРАТЬ
		|				ВТ_СписокРодителей.Класс
		|			ИЗ
		|				ВТ_СписокРодителей)
		|	И НЕ (ВТ_СписокРодителей.КлассДляЧтения, ЗначенияАтрибутовКласса.АтрибутКласса)  В
		|				(ВЫБРАТЬ
		|					ВТ_НеНаследуемыеАтрибуты.КлассДляЧтения КАК КлассДляЧтения,
		|					ВТ_НеНаследуемыеАтрибуты.АтрибутКласса КАК АтрибутКласса
		|				ИЗ
		|					ВТ_НеНаследуемыеАтрибуты КАК ВТ_НеНаследуемыеАтрибуты) //%1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗначенияАтрибутов.КлассДляЧтения КАК КлассДляЧтения,
		|	ВТ_ЗначенияАтрибутов.АтрибутКласса КАК АтрибутКласса,
		|	МАКСИМУМ(ВТ_ЗначенияАтрибутов.Уровень) КАК Уровень
		|ПОМЕСТИТЬ ВТ_МаксУровниЗначений
		|ИЗ
		|	ВТ_ЗначенияАтрибутов КАК ВТ_ЗначенияАтрибутов
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЗначенияАтрибутов.АтрибутКласса,
		|	ВТ_ЗначенияАтрибутов.КлассДляЧтения";
	Возврат ?(ПустаяСтрока(ТекстУсловияПоЗначениям), ТекстЗапроса,
		УправлениеНСИФункцииКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(ТекстЗапроса, ТекстУсловияПоЗначениям));
	
КонецФункции

// Считывает значения атрибутов классов, указанных в списке родителей:
//   Параметры:
//    - СписокРодителей - таблица значений с колонками: КлассДляЧтения, Класс, Уровень.
//        Содержит классы, для которых требуется прочитать атрибуты (КлассДляЧтения) 
//        и иерархию родителей классов (Класс, Уровень).
//    - МенеджерВТ - если заполнен, тогда результат функции сохраняется в менеджере врем.таблиц.
//        если МенеджерВТ не заполнен, тогда функция возвращает таблицу значений.
//   Возвращаемое значение:
//    - Если менеджер врем.таблиц не заполнен, то возвращает таблицу значений:
//        КлассДляЧтения, АтрибутКласса, ТипЗначения, ЗначениеАтрибутаКласса, Порядок,
//        СтатусНаследования, УровеньЗначения, РежимИспользования, РежимЗаполнения, РежимЗаполненияРодителя,
//        ИсточникЗначений, КлассТабличнаяЧасть, МножественноеЗначение, МножественноеЗначениеКартинка, 
//        СписокДоступныхЗначений, СписокДоступныхЗначенийПереключатель, 
//        МинЗначение, МаксЗначение, Формат.
//
Функция ПолучитьТаблицуАтрибутов(СписокРодителей, МенеджерВТ=Неопределено, ЧитатьВложенныеАтрибуты=Истина) Экспорт
	
	Запрос = Новый Запрос;
	Если МенеджерВТ = Неопределено Тогда
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Иначе
		Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("СписокРодителей", СписокРодителей);
	Запрос.УстановитьПараметр("ЧитатьВложенныеАтрибуты", ЧитатьВложенныеАтрибуты);
	Запрос.Текст = ТекстЗапросаСписокРодителей() // ВТ_СписокРодителей
			+ УправлениеНСИФункцииВызовСервераПереопределяемый.ТекстРазделителяЗапросовПакета()
		+ ТекстЗапросаВсеНазначения() // ВТ_ВсеНазначения
			+ УправлениеНСИФункцииВызовСервераПереопределяемый.ТекстРазделителяЗапросовПакета()
		+ ТекстЗапросаНеНаследуемыеАтрибуты() // ВТ_НеНаследуемыеАтрибуты   
			+ УправлениеНСИФункцииВызовСервераПереопределяемый.ТекстРазделителяЗапросовПакета()
		+ ТекстЗапросаЗначенияАтрибутов() // ВТ_ЗначенияАтрибутов, ВТ_МаксУровниЗначений
			+ УправлениеНСИФункцииВызовСервераПереопределяемый.ТекстРазделителяЗапросовПакета()
		+ ТекстЗапросаПоТаблицеАтрибутов() // ВТ_ВсеАтрибуты, ВТ_МинМаксУровниАтрибутов, ВТ_ВложенныеАтрибутыКласса, ВТ_ИсточникиЗначенийВложенныхАтрибутов
		;
	
	Запрос.Выполнить();
	
	Если ЧитатьВложенныеАтрибуты Тогда
		Запрос.Текст = ТекстЗапросаЧтенияВложенныхАтрибутов();
		Результаты = Запрос.ВыполнитьПакет();
		
		МассивКлассовЧтенияВложенныхАтрибутов      = Результаты[0].Выгрузить().ВыгрузитьКолонку("ЗначениеАтрибутаКласса");
		МассивНоменклатурыЧтенияВложенныхАтрибутов = Результаты[1].Выгрузить().ВыгрузитьКолонку("ЗначениеАтрибутаКласса");
		
		ВыборкаВложенныхРеквизитовПоТипам          = Результаты[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		ТаблицаВложенныхРеквизитов = Новый ТаблицаЗначений;
		ТаблицаВложенныхРеквизитов.Колонки.Добавить("КлассДляЧтения", 
			Новый ОписаниеТипов("СправочникСсылка.Классы, СправочникСсылка.НоменклатураКласса"));
		ТаблицаВложенныхРеквизитов.Колонки.Добавить("ВложенныйАтрибутКлассаСсылка",
			Новый ОписаниеТипов("СправочникСсылка.ВложенныеАтрибутыКласса"));
		ТаблицаВложенныхРеквизитов.Колонки.Добавить("ТипЗначения", Новый ОписаниеТипов("Строка"));
		ТаблицаВложенныхРеквизитов.Колонки.Добавить("ИсточникВложенногоАтрибутаКласса", 
			Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.АтрибутыКласса"));
		ТаблицаВложенныхРеквизитов.Колонки.Добавить("ЗначениеАтрибутаВложенногоКлассаНТ");
		
		МассивТипов = Новый Массив;
		КвалификаторСтрока = Неопределено;
		
		Пока ВыборкаВложенныхРеквизитовПоТипам.Следующий() Цикл
			ВыборкаВложеныхРеквизитовПоОбъектам = ВыборкаВложенныхРеквизитовПоТипам.Выбрать();
			СоответствиеРеквизитовДляЧтения = Новый Соответствие;
			
			ОбходСоЗначениемИсточником = (ТипЗнч(ВыборкаВложенныхРеквизитовПоТипам.ТипЗначенияИсточника) = Тип("Тип"));
			Если ОбходСоЗначениемИсточником Тогда
				МетаданныеСпр = Метаданные.НайтиПоТипу(ВыборкаВложенныхРеквизитовПоТипам.ТипЗначенияИсточника);
				МассивОбъектовДляЧтения = Новый Массив;
				СписокРеквизитов = "";
				
				Пока ВыборкаВложеныхРеквизитовПоОбъектам.Следующий() Цикл
					Если МассивОбъектовДляЧтения.Найти(
							ВыборкаВложеныхРеквизитовПоОбъектам.ЗначениеИсточникаАтрибутаКласса) = Неопределено Тогда
						МассивОбъектовДляЧтения.Добавить(ВыборкаВложеныхРеквизитовПоОбъектам.ЗначениеИсточникаАтрибутаКласса);
					КонецЕсли;
					Если СоответствиеРеквизитовДляЧтения[
							ВыборкаВложеныхРеквизитовПоОбъектам.АтрибутВложенногоКласса] = Неопределено Тогда
						МетаданныеРеквизита = Перечисления.РеквизитыКлассаНоменклатуры.ПолучитьМетаданныеРеквизита(МетаданныеСпр, 
							ВыборкаВложеныхРеквизитовПоОбъектам.АтрибутВложенногоКласса);
						СоответствиеРеквизитовДляЧтения.Вставить(
							ВыборкаВложеныхРеквизитовПоОбъектам.АтрибутВложенногоКласса, МетаданныеРеквизита);
						СписокРеквизитов = СписокРеквизитов + ?(ПустаяСтрока(СписокРеквизитов), "", ",") + МетаданныеРеквизита.Имя;
					КонецЕсли;
				КонецЦикла;
				
				ЗначенияРеквизитов = УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначенияРеквизитовОбъектов(
					МассивОбъектовДляЧтения, СписокРеквизитов);
				ВыборкаВложеныхРеквизитовПоОбъектам.Сбросить();
				Пока ВыборкаВложеныхРеквизитовПоОбъектам.Следующий() Цикл
					СтрокаВложенныхРеквизитов = ТаблицаВложенныхРеквизитов.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаВложенныхРеквизитов, ВыборкаВложеныхРеквизитовПоОбъектам);
					МетаданныеРеквизита = СоответствиеРеквизитовДляЧтения[ВыборкаВложеныхРеквизитовПоОбъектам.АтрибутВложенногоКласса];
					СтруктураЗначений = ЗначенияРеквизитов[ВыборкаВложеныхРеквизитовПоОбъектам.ЗначениеИсточникаАтрибутаКласса];
					СтрокаВложенныхРеквизитов.ЗначениеАтрибутаВложенногоКлассаНТ = СтруктураЗначений[МетаданныеРеквизита.Имя];
					СтрокаВложенныхРеквизитов.ТипЗначения = ЗначениеВСтрокуВнутр(МетаданныеРеквизита.Тип);
					
					ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивТипов, МетаданныеРеквизита.Тип.Типы(), Истина);
					Если КвалификаторСтрока = Неопределено 
							ИЛИ КвалификаторСтрока.Длина < МетаданныеРеквизита.Тип.КвалификаторыСтроки.Длина Тогда
						КвалификаторСтрока = МетаданныеРеквизита.Тип.КвалификаторыСтроки;
					КонецЕсли;
				КонецЦикла;
			Иначе
				Пока ВыборкаВложеныхРеквизитовПоОбъектам.Следующий() Цикл
					МетаданныеРеквизита = СоответствиеРеквизитовДляЧтения[
							ВыборкаВложеныхРеквизитовПоОбъектам.ВложенныйАтрибутКлассаСсылка];
					Если МетаданныеРеквизита = Неопределено Тогда
						МетаданныеСпр = Метаданные.НайтиПоТипу(ВыборкаВложеныхРеквизитовПоОбъектам.ТипИсточника.Типы()[0]);
						МетаданныеРеквизита = Перечисления.РеквизитыКлассаНоменклатуры.ПолучитьМетаданныеРеквизита(МетаданныеСпр,
							ВыборкаВложеныхРеквизитовПоОбъектам.АтрибутВложенногоКласса);
						СоответствиеРеквизитовДляЧтения.Вставить(
							ВыборкаВложеныхРеквизитовПоОбъектам.ВложенныйАтрибутКлассаСсылка, МетаданныеРеквизита);
					КонецЕсли;
					
					Если МетаданныеРеквизита = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					СтрокаВложенныхРеквизитов = ТаблицаВложенныхРеквизитов.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаВложенныхРеквизитов, ВыборкаВложеныхРеквизитовПоОбъектам);
					СтрокаВложенныхРеквизитов.ТипЗначения = ЗначениеВСтрокуВнутр(МетаданныеРеквизита.Тип);
					
					ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивТипов, МетаданныеРеквизита.Тип.Типы(), Истина);
					Если КвалификаторСтрока = Неопределено 
							ИЛИ КвалификаторСтрока.Длина < МетаданныеРеквизита.Тип.КвалификаторыСтроки.Длина Тогда
						КвалификаторСтрока = МетаданныеРеквизита.Тип.КвалификаторыСтроки;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
		Если МассивТипов.Количество() = 0 Тогда
			МассивТипов.Добавить(Тип("Число"));
		КонецЕсли;
		МассивТипов.Добавить(Тип("Неопределено"));
		
		ТаблицаВложенныхРеквизитов.Колонки.Добавить("ЗначениеАтрибутаВложенногоКласса", Новый ОписаниеТипов(МассивТипов,, КвалификаторСтрока));
		ЗначенияВыгрузка = ТаблицаВложенныхРеквизитов.ВыгрузитьКолонку("ЗначениеАтрибутаВложенногоКлассаНТ");
		ТаблицаВложенныхРеквизитов.ЗагрузитьКолонку(ЗначенияВыгрузка, "ЗначениеАтрибутаВложенногоКласса");
		ТаблицаВложенныхРеквизитов.Колонки.Удалить("ЗначениеАтрибутаВложенногоКлассаНТ");
		
		Запрос.УстановитьПараметр("ТаблицаВложенныхРеквизитов", ТаблицаВложенныхРеквизитов);
		
		Если МассивКлассовЧтенияВложенныхАтрибутов.Количество() > 0 Тогда
			ТаблицаРодителей = ПолучитьТаблицуРодителей(МассивКлассовЧтенияВложенныхАтрибутов);
			ТаблицаВложенныхАтрибутов = ПолучитьТаблицуАтрибутов(ТаблицаРодителей, , Ложь);
		КонецЕсли;
		
		Если МассивНоменклатурыЧтенияВложенныхАтрибутов.Количество() > 0 Тогда
			
			ТаблицаВложенныхАтрибутовНоменклатуры = Справочники.НоменклатураКласса.ПолучитьТаблицуАтрибутов(
				МассивНоменклатурыЧтенияВложенныхАтрибутов,,, Ложь);
			Если ТаблицаВложенныхАтрибутов = Неопределено Тогда
				ТаблицаВложенныхАтрибутов = ТаблицаВложенныхАтрибутовНоменклатуры;
			Иначе
				ТипКолонки = Новый ОписаниеТипов(
					ТаблицаВложенныхАтрибутов.Колонки.Объект.ТипЗначения, "СправочникСсылка.НоменклатураКласса");
				ТаблицаВложенныхАтрибутов.Колонки.Объект.Имя = "ОбъектУдалить";
				ТаблицаВложенныхАтрибутов.Колонки.Добавить("Объект", ТипКолонки);
				ЗначенияКолонки = ТаблицаВложенныхАтрибутов.ВыгрузитьКолонку("ОбъектУдалить");
				ТаблицаВложенныхАтрибутов.ЗагрузитьКолонку(ЗначенияКолонки, "Объект");
				
				Для Каждого СтрокаЗначений ИЗ ТаблицаВложенныхАтрибутовНоменклатуры Цикл
					НоваяСтрока = ТаблицаВложенныхАтрибутов.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗначений);
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ТаблицаАтрибутовВложенных", ТаблицаВложенныхАтрибутов);
		
	КонецЕсли;
	
	Если ЧитатьВложенныеАтрибуты И НЕ ТаблицаВложенныхАтрибутов = Неопределено Тогда
		Запрос.Текст = ТекстЗапросаЗначенияВложенныхАтрибутов(); // ВТ_ЗначенияВложенныхАтрибутов
	Иначе
		Запрос.Текст = ТекстЗапросаПустаяТаблицаЗначенияВложенныхАтрибутов(); // ВТ_ЗначенияВложенныхАтрибутов
	КонецЕсли;
	
	Если ЧитатьВложенныеАтрибуты И НЕ ТаблицаВложенныхРеквизитов = Неопределено Тогда
		Запрос.Текст = Запрос.Текст + УправлениеНСИФункцииВызовСервераПереопределяемый.ТекстРазделителяЗапросовПакета()
			+ ТекстЗапросаЗначенияВложенныхРеквизитов(); // ВТ_ЗначенияВложенныхРеквизитов
	Иначе
		Запрос.Текст = Запрос.Текст + УправлениеНСИФункцииВызовСервераПереопределяемый.ТекстРазделителяЗапросовПакета()
			+ ТекстЗапросаПустаяТаблицаЗначенияВложенныхРеквизитов(); // ВТ_ЗначенияВложенныхРеквизитов
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + УправлениеНСИФункцииВызовСервераПереопределяемый.ТекстРазделителяЗапросовПакета()
		+ ТекстЗапросаТаблицаАтрибутовФинальная();
	
	Результат = Запрос.Выполнить();
	Если МенеджерВТ = Неопределено Тогда
		ТаблицаАтрибутов = Результат.Выгрузить();
		Запрос.МенеджерВременныхТаблиц.Закрыть();
	КонецЕсли;
	
	Возврат ТаблицаАтрибутов;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Работа со списочными атрибутами.

// Возвращает таблицу доступных и используемых значений:
//  - ЗначениеАтрибутаКласса - Класс, НоменклатураКласса или ОбъектНоменклатуры, 
//    выбранное в качестве доступного или используемого значения.
//  - АтрибутКласса.
//  - СтатусНаследования: 
//      2 - определено для тек.класса; 3 - наследуемое значение;
//      4 - запрещено наследование на тек.уровне; 5 - запрещено наследование на уровне выше.
//  - ДоступноеЗначение - возможное, доступное для выбора значение атрибута.
//  - ДоступноеЗначениеНаследуемое - унаследованное значение 
//    признака "Доступное значение" (без учета запрета наследования).
//  - ИспользуемоеЗначение - выбранное значение атрибута.
Функция ПолучитьЗначенияСписочныхАтрибутов(ТаблицаРодителей, АтрибутКласса = Неопределено, МенеджерВТ=Неопределено) Экспорт
	
	ОтборПоАтрибуту = (ЗначениеЗаполнено(АтрибутКласса));
	
	Запрос = Новый Запрос;
	Если МенеджерВТ = Неопределено Тогда
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Иначе
		Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("СписокРодителей", ТаблицаРодителей);
	Запрос.УстановитьПараметр("ОтборПоАтрибуту", ОтборПоАтрибуту);
	Запрос.УстановитьПараметр("АтрибутКласса",   АтрибутКласса);
	
	Запрос.Текст = ТекстЗапросаСписокРодителей() 
			+ УправлениеНСИФункцииВызовСервераПереопределяемый.ТекстРазделителяЗапросовПакета()
		+ ТекстЗапросаЗначенияСписочныхАтрибутов()
		;
	//
	Результат = Запрос.Выполнить();
	Если МенеджерВТ = Неопределено Тогда
		ТаблицаАтрибутов = Результат.Выгрузить();
		Запрос.МенеджерВременныхТаблиц.Закрыть();
	КонецЕсли;
	
	Возврат ТаблицаАтрибутов;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Работа с табличными атрибутами.

Функция ПолучитьСтрокиТабличныхАтрибутов(ТаблицаРодителей, АтрибутыКласса) Экспорт
	
	ОписаниеТиповКлассы  = Новый ОписаниеТипов("СправочникСсылка.Классы");
	ОписаниеТиповАтрибут = Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.АтрибутыКласса");
	ОписаниеТиповЧисло   = Новый ОписаниеТипов("Число");
	ОписаниеТиповБулево  = Новый ОписаниеТипов("Булево");
	
	СоответствиеСтрокАтрибутов = Новый Соответствие;
	
	ТаблицаСтрок = Новый ТаблицаЗначений();
	ТаблицаСтрок.Колонки.Добавить("КлассДляЧтения",         ОписаниеТиповКлассы);
	ТаблицаСтрок.Колонки.Добавить("АтрибутКласса",          ОписаниеТиповАтрибут);
	ТаблицаСтрок.Колонки.Добавить("ЗначениеАтрибутаКласса", ОписаниеТиповКлассы);
	ТаблицаСтрок.Колонки.Добавить("Порядок",                ОписаниеТиповЧисло);
	ТаблицаСтрок.Колонки.Добавить("СтатусНаследования",     ОписаниеТиповЧисло);
	ТаблицаСтрок.Колонки.Добавить("Уровень",                ОписаниеТиповЧисло);
	ТаблицаСтрок.Колонки.Добавить("УровеньТекКласса",       ОписаниеТиповЧисло);
	ТаблицаСтрок.Колонки.Добавить("ИсточникЗначений",       ОписаниеТиповКлассы);
	ТаблицаСтрок.Колонки.Добавить("НоменклатураКласса",     ОписаниеТиповБулево);
	ТаблицаСтрок.Колонки.Добавить("ОбъектыНоменклатуры",    ОписаниеТиповБулево);
	ТаблицаСтрок.Колонки.Добавить("Наименование",
		Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50)));
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("СписокРодителей", ТаблицаРодителей);
	Запрос.УстановитьПараметр("АтрибутыКласса",  АтрибутыКласса);
	Запрос.Текст = ТекстЗапросаСписокРодителей()
			+ УправлениеНСИФункцииВызовСервераПереопределяемый.ТекстРазделителяЗапросовПакета()
		+ ТекстЗапросаСтрокиТабличныхАтрибутов()
		;
	ВыборкаКлассы = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаКлассы.Следующий() Цикл
		ВыборкаАтрибуты = ВыборкаКлассы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаАтрибуты.Следующий() Цикл
			
			ВыборкаСтроки = ВыборкаАтрибуты.Выбрать();
			Пока ВыборкаСтроки.Следующий() Цикл
				НайденоПоРодителю = Истина;
				// Поиск по классу-родителю строки, чтобы склеить наследуемую строку со строкой класса-родителя.
				СтрокаТаблицы = СоответствиеСтрокАтрибутов[ВыборкаСтроки.ЗначениеАтрибутаКлассаУровнемВыше];
				// 
				Если СтрокаТаблицы = Неопределено Тогда
					СтрокаТаблицы = СоответствиеСтрокАтрибутов[ВыборкаСтроки.ЗначениеАтрибутаКласса];
					НайденоПоРодителю = Ложь;
				КонецЕсли;
				
				// Если строка-родитель не существует, добавляем новую.
				Если СтрокаТаблицы = Неопределено Тогда
					СтрокаТаблицы = ТаблицаСтрок.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ВыборкаСтроки);
					Если ВыборкаСтроки.Класс = ВыборкаСтроки.КлассДляЧтения Тогда
						СтрокаТаблицы.ИсточникЗначений = ВыборкаСтроки.ЗначениеАтрибутаКлассаУровнемВыше;
					Иначе
						СтрокаТаблицы.ИсточникЗначений       = ВыборкаСтроки.ЗначениеАтрибутаКласса;
						СтрокаТаблицы.ЗначениеАтрибутаКласса = Справочники.Классы.ПустаяСсылка();
						//СтрокаТаблицы.Наименование           = "";
					КонецЕсли;
					СоответствиеСтрокАтрибутов.Вставить(ВыборкаСтроки.ЗначениеАтрибутаКласса, СтрокаТаблицы);
					
				// Если строка-родитель найдена, и уровень строки выше
				ИначеЕсли ВыборкаСтроки.Уровень > СтрокаТаблицы.Уровень Тогда
					// Запоминаем строку в соответствии.
					Если НайденоПоРодителю Тогда
						СоответствиеСтрокАтрибутов.Вставить(ВыборкаСтроки.ЗначениеАтрибутаКласса, СтрокаТаблицы);
					КонецЕсли;
					
					СтрокаТаблицы.СтатусНаследования = Макс(СтрокаТаблицы.СтатусНаследования, ВыборкаСтроки.СтатусНаследования);
					// Если это строка последнего уровня наследования, заполняем как есть.
					Если ВыборкаСтроки.Класс = ВыборкаСтроки.КлассДляЧтения Тогда
						СтрокаТаблицы.ИсточникЗначений       = ВыборкаСтроки.ЗначениеАтрибутаКлассаУровнемВыше; 
						СтрокаТаблицы.ЗначениеАтрибутаКласса = ВыборкаСтроки.ЗначениеАтрибутаКласса;
						СтрокаТаблицы.Наименование           = ВыборкаСтроки.Наименование;
					Иначе
						// Если это наследуемая строка, отмечаем эту строку как источник значений.
						СтрокаТаблицы.ИсточникЗначений = ВыборкаСтроки.ЗначениеАтрибутаКласса;
						СтрокаТаблицы.ЗначениеАтрибутаКласса = Справочники.Классы.ПустаяСсылка();
						//СтрокаТаблицы.Наименование = "";
					КонецЕсли;
					
					СтрокаТаблицы.Порядок = ВыборкаСтроки.Порядок;
					СтрокаТаблицы.Уровень = ВыборкаСтроки.Уровень;
					
				КонецЕсли;
				
			КонецЦикла;
			
			СоответствиеСтрокАтрибутов.Очистить();
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТаблицаСтрок;
	
КонецФункции

Процедура ВосстановитьНаследованиеТабЧастей(МассивОбъектов) Экспорт
	
	МассивКлассов = Новый Массив;
	МассивНоменклатуры = Новый Массив;
	
	ТипКласс = Тип("СправочникСсылка.Классы");
	ТипНоменклатура = Тип("СправочникСсылка.НоменклатураКласса");
	Для Каждого ЭлементМассива Из МассивОбъектов Цикл
		Если ТипЗнч(ЭлементМассива) = ТипКласс Тогда
			МассивКлассов.Добавить(ЭлементМассива);
		ИначеЕсли ТипЗнч(ЭлементМассива) = ТипНоменклатура Тогда
			МассивНоменклатуры.Добавить(ЭлементМассива);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивНоменклатуры.Количество() > 0 Тогда
		КлассыНоменклатуры = УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначениеРеквизитаОбъектов(МассивНоменклатуры, "Класс");
		Для Каждого КлючИЗначение ИЗ КлассыНоменклатуры Цикл
			Если МассивКлассов.Найти(КлючИЗначение.Значение) = Неопределено Тогда
				МассивКлассов.Добавить(КлючИЗначение.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ТаблицаРодителей = ПолучитьТаблицуРодителей(МассивКлассов);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	РазделительЗапросов = УправлениеНСИФункцииВызовСервераПереопределяемый.ТекстРазделителяЗапросовПакета();
	
	// 0.  ВТ_СписокРодителей - Помещаем таблицу родителей во временную таблицу.
	// 1.  ВТ_СтрокиДляОбработки - Выбираем строки таб.частей всех объектов и их родителей.
	// 2.  ВТ_СтрокиДляПоискаРодителей - Отделяем строки нижнего уровня (без учета родителей).
	
	Запрос.Текст = ТекстЗапросаВосстановитьНаследованиеДанныеДляВосстановления();
	
	Запрос.УстановитьПараметр("СписокРодителей",    ТаблицаРодителей);
	Запрос.УстановитьПараметр("МассивОбъектов",     МассивОбъектов);
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
	
	Результаты = Запрос.ВыполнитьПакет();
	
	Выборка = Результаты[2].Выбрать();
	Выборка.Следующий();
	Если Выборка.Количество = 0 Тогда
		Запрос.МенеджерВременныхТаблиц.Закрыть();
		Возврат;
	КонецЕсли;
	
	// 0.  ВТ_ДанныеДляПоискаВИерархии - Прилепляем к строкам нижнего уровня список классов-родителей с уровнями.
	// 1.  Уничтожаем таблицу ВТ_СтрокиДляПоискаРодителей.
	// 2.  ВТ_НайденныеВИерархииСтроки - Выбираем для строк классов нижнего уровня строки классов-родителей, 
	//     которые являются родителем. Остаются только те строки, у которых есть в иерархии строка-родитель.
	// 3.  ВТ_НовыеРодители - В цепочке иерархии наследования ищем промежуточный класс, у которого есть строка,
	//     у которой тот же родитель, что и у строки нижнего уровня. Эта строка должна быть новым родителем. 
	//     Остаются только строки, у которых должен быть новый родитель.
	// 4.  Уничтожаем таблицу ВТ_НайденныеВИерархииСтроки.
	// 5.  Уничтожаем таблицу ВТ_СписокРодителей.
	// 6.  ВТ_НовыеРодителиСледующийУровень - В цепочке иерархии дальше ищем новый промежуточный класс,
	//     у которого есть строка, у которой родитель - новый родитель.
	
	Запрос.Текст = ТекстЗапросаВосстановитьНаследованиеДанныеВИерархии() + РазделительЗапросов + 
		ТекстЗапросаВосстановитьНаследованиеПоискРодителейСтрок();
	Результаты = Запрос.ВыполнитьПакет();
	
	Выборка = Результаты[3].Выбрать();
	Выборка.Следующий();
	Если Выборка.Количество = 0 Тогда
		Запрос.МенеджерВременныхТаблиц.Закрыть();
		Возврат;
	КонецЕсли;
	
	Выборка = Результаты[6].Выбрать();
	Выборка.Следующий();
	НужнаПроверкаИерархии = (Выборка.Количество > 0);
	
	// 0. ВТ_НовыеРодителиУточненные - Готовим данные для занесения в таблицу ВТ_НовыеРодители.
	// 1. Уничтожаем старую таблицу ВТ_НовыеРодители.
	// 2. ВТ_НовыеРодители - сохраняем таблицу замены родителей.
	// 3. Уничтожаем временную таблицу ВТ_НовыеРодителиУточненные.
	// 4. ВТ_НовыеРодителиВременная - В цепочке иерархии дальше ищем новый промежуточный класс,
	//    у которого есть строка, у которой родитель - новый родитель.
	// 5. Уничтожаем старую таблицу ВТ_НовыеРодителиСледующийУровень.
	// 6. ВТ_НовыеРодителиСледующийУровень - сохраняем таблицу новых родителей для продолжения обработки в цикле.
	// 7. Уничтожаем промежуточную таблицу ВТ_НовыеРодителиВременная.
	
	Запрос.Текст = ТекстЗапросаВосстановитьНаследованиеПроверкаИерархииНаследованияСтрок();
	
	Пока НужнаПроверкаИерархии Цикл
		Результаты = Запрос.ВыполнитьПакет();
		
		Выборка = Результаты[6].Выбрать();
		Выборка.Следующий();
		НужнаПроверкаИерархии = (Выборка.Количество > 0);
	КонецЦикла;
	
	МассивОбъектовНовый = Новый Массив;
	
	Запрос.Текст = ТекстЗапросаВосстановитьНаследованиеДанныеДляЗаменыРодителейСтрок();
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		СпрОбъект = Результат.ЗначениеАтрибутаКласса.ПолучитьОбъект();
		ТипСправочника = ТипЗнч(Результат.ЗначениеАтрибутаКласса);
		Если ТипСправочника = ТипНоменклатура Тогда
			СпрОбъект.Класс = Результат.НовыйРодительСтроки;
		ИначеЕсли ТипСправочника = ТипКласс Тогда
			СпрОбъект.Родитель = Результат.НовыйРодительСтроки;
		КонецЕсли;
		СпрОбъект.Записать();
		
		МассивОбъектовНовый.Добавить(Результат.ЗначениеАтрибутаКласса);
	КонецЦикла;
	
	ВосстановитьНаследованиеТабЧастей(МассивОбъектовНовый);
	
КонецПроцедуры

Процедура ПолучитьОбъектыВосстановленияНаследованияТЧ(МассивОбъектов, МенеджерВТ) Экспорт
	
	МассивКлассов = Новый Массив;
	МассивНоменклатуры = Новый Массив;
	
	ТипКласс = Тип("СправочникСсылка.Классы");
	ТипНоменклатура = Тип("СправочникСсылка.НоменклатураКласса");
	Для Каждого ЭлементМассива Из МассивОбъектов Цикл
		Если ТипЗнч(ЭлементМассива) = ТипКласс Тогда
			МассивКлассов.Добавить(ЭлементМассива);
		ИначеЕсли ТипЗнч(ЭлементМассива) = ТипНоменклатура Тогда
			МассивНоменклатуры.Добавить(ЭлементМассива);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивНоменклатуры.Количество() > 0 Тогда
		КлассыНоменклатуры = УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначениеРеквизитаОбъектов(МассивНоменклатуры, "Класс");
		Для Каждого КлючИЗначение ИЗ КлассыНоменклатуры Цикл
			Если МассивКлассов.Найти(КлючИЗначение.Значение) = Неопределено Тогда
				МассивКлассов.Добавить(КлючИЗначение.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ТаблицаРодителей = ПолучитьТаблицуРодителей(МассивКлассов);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	РазделительЗапросов = УправлениеНСИФункцииВызовСервераПереопределяемый.ТекстРазделителяЗапросовПакета();
	
	// 0.  ВТ_СписокРодителей - Помещаем таблицу родителей во временную таблицу.
	// 1.  ВТ_СтрокиДляОбработки - Выбираем строки таб.частей всех объектов и их родителей.
	// 2.  ВТ_СтрокиДляПоискаРодителей - Отделяем строки нижнего уровня (без учета родителей).
	// 3.  ВТ_ДанныеДляПоискаВИерархии - Прилепляем к строкам нижнего уровня список классов-родителей с уровнями.
	// 4.  Уничтожаем таблицу ВТ_СтрокиДляПоискаРодителей.
	// 5.  ВТ_НайденныеВИерархииСтроки - Выбираем для строк классов нижнего уровня строки классов-родителей, 
	//     которые являются родителем. Остаются только те строки, у которых есть в иерархии строка-родитель.
	// 6.  ВТ_НовыеРодители - В цепочке иерархии наследования ищем промежуточный класс, у которого есть строка,
	//     у которой тот же родитель, что и у строки нижнего уровня. Эта строка должна быть новым родителем. 
	//     Остаются только строки, у которых должен быть новый родитель.
	// 7.  Уничтожаем таблицу ВТ_НайденныеВИерархииСтроки.
	// 8.  Уничтожаем таблицу ВТ_СписокРодителей.
	// 9.  ВТ_НовыеРодителиСледующийУровень - В цепочке иерархии дальше ищем новый промежуточный класс,
	//     у которого есть строка, у которой родитель - новый родитель.
	
	Запрос.Текст = 
		ТекстЗапросаВосстановитьНаследованиеДанныеДляВосстановления() + РазделительЗапросов +
		ТекстЗапросаВосстановитьНаследованиеДанныеВИерархии() + РазделительЗапросов + 
		ТекстЗапросаВосстановитьНаследованиеПоискРодителейСтрок();
	
	Запрос.УстановитьПараметр("СписокРодителей",    ТаблицаРодителей);
	Запрос.УстановитьПараметр("МассивОбъектов",     МассивОбъектов);
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
	
	Результаты = Запрос.ВыполнитьПакет();
	
КонецПроцедуры

Процедура ПолучитьДублиСтрок(МассивОбъектов, МенеджерВТ) Экспорт
	
	МассивКлассов = Новый Массив;
	МассивНоменклатуры = Новый Массив;
	
	ТипКласс = Тип("СправочникСсылка.Классы");
	ТипНоменклатура = Тип("СправочникСсылка.НоменклатураКласса");
	Для Каждого ЭлементМассива Из МассивОбъектов Цикл
		Если ТипЗнч(ЭлементМассива) = ТипКласс Тогда
			МассивКлассов.Добавить(ЭлементМассива);
		ИначеЕсли ТипЗнч(ЭлементМассива) = ТипНоменклатура Тогда
			МассивНоменклатуры.Добавить(ЭлементМассива);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивНоменклатуры.Количество() > 0 Тогда
		КлассыНоменклатуры = УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначениеРеквизитаОбъектов(МассивНоменклатуры, "Класс");
		Для Каждого КлючИЗначение ИЗ КлассыНоменклатуры Цикл
			Если МассивКлассов.Найти(КлючИЗначение.Значение) = Неопределено Тогда
				МассивКлассов.Добавить(КлючИЗначение.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ТаблицаРодителей = ПолучитьТаблицуРодителей(МассивКлассов);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	РазделительЗапросов = УправлениеНСИФункцииВызовСервераПереопределяемый.ТекстРазделителяЗапросовПакета();
	
	// 0.  ВТ_СписокРодителей - Помещаем таблицу родителей во временную таблицу.
	// 1.  ВТ_СтрокиДляОбработки - Выбираем строки таб.частей всех объектов и их родителей.
	// 2.  ВТ_СтрокиДляПоискаРодителей - Отделяем строки нижнего уровня (без учета родителей).
	// 3.  ВТ_ДанныеДляПоискаВИерархии - Прилепляем к строкам нижнего уровня список классов-родителей с уровнями.
	// 4.  Уничтожаем таблицу ВТ_СтрокиДляПоискаРодителей.
	// 5.  ВТ_НайденныеВИерархииСтроки - Выбираем для строк классов нижнего уровня строки классов-родителей, 
	//     которые являются родителем. Остаются только те строки, у которых есть в иерархии строка-родитель.
	Запрос.Текст = 
		ТекстЗапросаВосстановитьНаследованиеДанныеДляВосстановления() + РазделительЗапросов + 
		ТекстЗапросаВосстановитьНаследованиеДанныеВИерархии();
	
	Запрос.УстановитьПараметр("СписокРодителей",    ТаблицаРодителей);
	Запрос.УстановитьПараметр("МассивОбъектов",     МассивОбъектов);
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
	
	Запрос.Выполнить();
	
	// 0. ВТ_РодителиСДублями.
	// 1. ВТ_ДублиСтрок.
	// 2. ВТ_НайденныеВИерархииСтрокиВыше.
	// 3. Уничтожаем таблицу ВТ_НайденныеВИерархииСтроки.
	// 4. Уничтожаем таблицу ВТ_СписокРодителей.
	Запрос.Текст = ТекстЗапросаПолучитьДублиСтрок();
	Результаты = Запрос.ВыполнитьПакет();
	
	Выборка = Результаты[2].Выбрать();
	Выборка.Следующий();
	
	// 0. Уничтожаем таблицу ВТ_РодителиСДублями
	// 1. ВТ_РодителиСДублями - Выбираем из таблицы ВТ_НайденныеВИерархииСтрокиВыше родителей с дублями.
	// 2. ВТ_ДублиСтрокОбъединение - Объединяем новую таблицу дублей строк со старой.
	// 3. Уничтожаем таблицу ВТ_ДублиСтрок.
	// 4. ВТ_ДублиСтрок - Записываем на место прежней таблицы новую таблицу дублей строк.
	// 5. Уничтожаем таблицу ВТ_ДублиСтрокОбъединение.
	// 6. ВТ_НайденныеВИерархииСтрокиВрем - помещаем данные таблицы ВТ_НайденныеВИерархииСтрокиВыше во временную таблицу.
	// 7. Уничтожаем таблицу ВТ_НайденныеВИерархииСтрокиВыше.
	// 8. ВТ_НайденныеВИерархииСтрокиВыше - Находим строки таб.частей, имеющие родителей уровнем выше.
	// 9. Уничтожаем таблицу ВТ_НайденныеВИерархииСтрокиВрем.
	Запрос.Текст = ТекстЗапросаПолучитьДублиСтрокВыше();
	
	Пока Выборка.Количество > 0 Цикл
		Результаты = Запрос.ВыполнитьПакет();
		Выборка = Результаты[8].Выбрать();
		Выборка.Следующий();
	КонецЦикла;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаТаблицаРодителей()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Классы.Ссылка КАК КлассДляЧтения,
		|	Классы.Ссылка КАК Класс
		|ИЗ
		|	Справочник.Классы КАК Классы
		|ГДЕ
		|	Классы.Ссылка В (&КлассыДляЧтения)
		|ИТОГИ
		|	МАКСИМУМ(КлассДляЧтения)
		|ПО
		|	Класс,
		|	Класс ИЕРАРХИЯ";
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВсеНазначения()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НазначениеАтрибутов.АтрибутКласса КАК АтрибутКласса,
		|	НазначениеАтрибутов.Класс КАК Класс,
		|	НазначениеАтрибутов.РежимИспользования,
		|	НазначениеАтрибутов.РежимЗаполнения,
		|	НазначениеАтрибутов.МинЗначение,
		|	НазначениеАтрибутов.МаксЗначение,
		|	НазначениеАтрибутов.ДобавлениеСтрокТабЧастиВНоменклатуреКласса,
		|	НазначениеАтрибутов.ДобавлениеСтрокТабЧастиВОбъектахНоменклатуры,
		|	НазначениеАтрибутов.Формат,
		|	НазначениеАтрибутов.МножественноеЗначение,
		|	НазначениеАтрибутов.СписокДоступныхЗначений,
		|	НазначениеАтрибутов.ИсточникЗначений,
		|	НазначениеАтрибутов.Порядок
		|ПОМЕСТИТЬ ВТ_ВсеНазначения
		|ИЗ
		|	РегистрСведений.НазначениеАтрибутов КАК НазначениеАтрибутов
		|ГДЕ
		|	НазначениеАтрибутов.Класс В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ВТ_СписокРодителей.Класс
		|			ИЗ
		|				ВТ_СписокРодителей)";
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаПоТаблицеАтрибутов()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВТ_СписокРодителей.КлассДляЧтения КАК КлассДляЧтения,
		|	ВТ_ВсеНазначения.АтрибутКласса КАК АтрибутКласса,
		|	ВЫБОР
		|		КОГДА ВТ_НеНаследуемыеАтрибуты.УровеньНаследования ЕСТЬ NULL
		|				И ВТ_СписокРодителей.Класс = ВТ_СписокРодителей.КлассДляЧтения
		|				И ВТ_ВсеНазначения.АтрибутКласса ССЫЛКА ПланВидовХарактеристик.АтрибутыКласса 
		|			ТОГДА 1
		|		КОГДА ВТ_НеНаследуемыеАтрибуты.УровеньНаследования ЕСТЬ NULL
		|				И НЕ ВТ_СписокРодителей.Класс = ВТ_СписокРодителей.КлассДляЧтения
		|			ТОГДА 3
		|		КОГДА ВТ_ВсеНазначения.АтрибутКласса ССЫЛКА Справочник.ВложенныеАтрибутыКласса 
		|			ТОГДА 2
		|		ИНАЧЕ ВТ_НеНаследуемыеАтрибуты.УровеньНаследования + 4
		|	КОНЕЦ КАК СтатусНаследования,
		|	ВТ_СписокРодителей.Уровень КАК Уровень,
		|	ВТ_ВсеНазначения.РежимИспользования,
		|	ВТ_ВсеНазначения.РежимЗаполнения,
		|	ВТ_ВсеНазначения.МинЗначение,
		|	ВТ_ВсеНазначения.МаксЗначение,
		|	ВТ_ВсеНазначения.ДобавлениеСтрокТабЧастиВНоменклатуреКласса,
		|	ВТ_ВсеНазначения.ДобавлениеСтрокТабЧастиВОбъектахНоменклатуры,
		|	ВТ_ВсеНазначения.Формат,
		|	ВТ_ВсеНазначения.МножественноеЗначение,
		|	ВТ_ВсеНазначения.СписокДоступныхЗначений,
		|	ВТ_ВсеНазначения.ИсточникЗначений,
		|	ВТ_ВсеНазначения.Порядок
		|ПОМЕСТИТЬ ВТ_ВсеАтрибуты
		|ИЗ
		|	ВТ_ВсеНазначения КАК ВТ_ВсеНазначения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СписокРодителей КАК ВТ_СписокРодителей
		|		ПО ВТ_ВсеНазначения.Класс = ВТ_СписокРодителей.Класс
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НеНаследуемыеАтрибуты КАК ВТ_НеНаследуемыеАтрибуты
		|		ПО ВТ_СписокРодителей.КлассДляЧтения = ВТ_НеНаследуемыеАтрибуты.КлассДляЧтения
		|			И ВТ_ВсеНазначения.АтрибутКласса = ВТ_НеНаследуемыеАтрибуты.АтрибутКласса
		|ГДЕ
		|	ВТ_ВсеНазначения.АтрибутКласса ССЫЛКА ПланВидовХарактеристик.АтрибутыКласса
		|		ИЛИ ВТ_ВсеНазначения.АтрибутКласса ССЫЛКА Справочник.ВложенныеАтрибутыКласса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВсеАтрибуты.КлассДляЧтения КАК КлассДляЧтения,
		|	ВТ_ВсеАтрибуты.АтрибутКласса КАК АтрибутКласса,
		|	МИНИМУМ(ВТ_ВсеАтрибуты.Уровень) КАК МинУровень,
		|	МАКСИМУМ(ВТ_ВсеАтрибуты.Уровень) КАК МаксУровень
		|ПОМЕСТИТЬ ВТ_МинМаксУровниАтрибутов
		|ИЗ
		|	ВТ_ВсеАтрибуты КАК ВТ_ВсеАтрибуты
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ВсеАтрибуты.АтрибутКласса,
		|	ВТ_ВсеАтрибуты.КлассДляЧтения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ВсеАтрибуты.КлассДляЧтения,
		|	ВТ_ВсеАтрибуты.АтрибутКласса КАК ВложенныйАтрибутКласса,
		|	ВложенныеАтрибутыКласса.Источник,
		|	ВложенныеАтрибутыКласса.АтрибутКласса
		|ПОМЕСТИТЬ ВТ_ВложенныеАтрибутыКласса
		|ИЗ
		|	ВТ_ВсеАтрибуты КАК ВТ_ВсеАтрибуты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВложенныеАтрибутыКласса КАК ВложенныеАтрибутыКласса
		|		ПО ВТ_ВсеАтрибуты.АтрибутКласса = ВложенныеАтрибутыКласса.Ссылка
		|ГДЕ
		|	&ЧитатьВложенныеАтрибуты
		|	И ВТ_ВсеАтрибуты.АтрибутКласса ССЫЛКА Справочник.ВложенныеАтрибутыКласса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_МинМаксУровниАтрибутов.КлассДляЧтения,
		|	ВТ_МинМаксУровниАтрибутов.АтрибутКласса,
		|	ВТ_ЗначенияАтрибутов.ЗначениеАтрибутаКласса
		|ПОМЕСТИТЬ ВТ_ИсточникиЗначенийВложенныхАтрибутов
		|ИЗ
		|	ВТ_МинМаксУровниАтрибутов КАК ВТ_МинМаксУровниАтрибутов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МаксУровниЗначений КАК ВТ_МаксУровниЗначений
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗначенияАтрибутов КАК ВТ_ЗначенияАтрибутов
		|			ПО ВТ_МаксУровниЗначений.КлассДляЧтения = ВТ_ЗначенияАтрибутов.КлассДляЧтения
		|				И ВТ_МаксУровниЗначений.АтрибутКласса = ВТ_ЗначенияАтрибутов.АтрибутКласса
		|				И ВТ_МаксУровниЗначений.Уровень = ВТ_ЗначенияАтрибутов.Уровень
		|		ПО ВТ_МинМаксУровниАтрибутов.КлассДляЧтения = ВТ_МаксУровниЗначений.КлассДляЧтения
		|			И ВТ_МинМаксУровниАтрибутов.АтрибутКласса = ВТ_МаксУровниЗначений.АтрибутКласса
		|ГДЕ
		|	(ВТ_МинМаксУровниАтрибутов.КлассДляЧтения, ВТ_МинМаксУровниАтрибутов.АтрибутКласса) В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ВТ_ВложенныеАтрибутыКласса.КлассДляЧтения,
		|				ВТ_ВложенныеАтрибутыКласса.Источник
		|			ИЗ
		|				ВТ_ВложенныеАтрибутыКласса)";
		
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаЧтенияВложенныхАтрибутов()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ИсточникиЗначенийВложенныхАтрибутов.ЗначениеАтрибутаКласса
		|ИЗ
		|	ВТ_ИсточникиЗначенийВложенныхАтрибутов КАК ВТ_ИсточникиЗначенийВложенныхАтрибутов
		|ГДЕ
		|	ВТ_ИсточникиЗначенийВложенныхАтрибутов.ЗначениеАтрибутаКласса ССЫЛКА Справочник.Классы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ИсточникиЗначенийВложенныхАтрибутов.ЗначениеАтрибутаКласса
		|ИЗ
		|	ВТ_ИсточникиЗначенийВложенныхАтрибутов КАК ВТ_ИсточникиЗначенийВложенныхАтрибутов
		|ГДЕ
		|	ВТ_ИсточникиЗначенийВложенныхАтрибутов.ЗначениеАтрибутаКласса ССЫЛКА Справочник.НоменклатураКласса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВложенныеАтрибутыКласса.КлассДляЧтения,
		|	ВТ_ВложенныеАтрибутыКласса.ВложенныйАтрибутКласса КАК ВложенныйАтрибутКлассаСсылка,
		|	ВТ_ВложенныеАтрибутыКласса.Источник КАК ИсточникВложенногоАтрибутаКласса,
		|	ВТ_ИсточникиЗначенийВложенныхАтрибутов.ЗначениеАтрибутаКласса КАК ЗначениеИсточникаАтрибутаКласса,
		|	ВЫБОР
		|		КОГДА НЕ ВТ_ИсточникиЗначенийВложенныхАтрибутов.ЗначениеАтрибутаКласса ЕСТЬ NULL
		|			ТОГДА ТИПЗНАЧЕНИЯ(ВТ_ИсточникиЗначенийВложенныхАтрибутов.ЗначениеАтрибутаКласса)
		|	КОНЕЦ КАК ТипЗначенияИсточника,
		|	ВЫРАЗИТЬ(ВТ_ВложенныеАтрибутыКласса.Источник КАК ПланВидовХарактеристик.АтрибутыКласса).ТипЗначения КАК ТипИсточника,
		|	ВТ_ВложенныеАтрибутыКласса.АтрибутКласса КАК АтрибутВложенногоКласса
		|ИЗ
		|	ВТ_ВложенныеАтрибутыКласса КАК ВТ_ВложенныеАтрибутыКласса
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсточникиЗначенийВложенныхАтрибутов КАК ВТ_ИсточникиЗначенийВложенныхАтрибутов
		|		ПО ВТ_ВложенныеАтрибутыКласса.КлассДляЧтения = ВТ_ИсточникиЗначенийВложенныхАтрибутов.КлассДляЧтения
		|			И ВТ_ВложенныеАтрибутыКласса.Источник = ВТ_ИсточникиЗначенийВложенныхАтрибутов.АтрибутКласса
		|ГДЕ
		|	ВТ_ВложенныеАтрибутыКласса.АтрибутКласса ССЫЛКА Перечисление.РеквизитыКлассаНоменклатуры
		|ИТОГИ ПО
		|	ТипЗначенияИсточника";
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаЗначенияВложенныхАтрибутов()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТаблицаАтрибутовВложенных.Объект,
		|	ТаблицаАтрибутовВложенных.АтрибутКласса,
		|	ТаблицаАтрибутовВложенных.ЗначениеАтрибутаКласса
		|ПОМЕСТИТЬ ВТ_ТаблицаАтрибутовВложенных
		|ИЗ
		|	&ТаблицаАтрибутовВложенных КАК ТаблицаАтрибутовВложенных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВложенныеАтрибутыКласса.КлассДляЧтения,
		|	ВТ_ВложенныеАтрибутыКласса.ВложенныйАтрибутКласса КАК ВложенныйАтрибутКлассаСсылка,
		|	ВТ_ВложенныеАтрибутыКласса.Источник КАК ИсточникВложенногоАтрибутаКласса,
		|	ВТ_ИсточникиЗначенийВложенныхАтрибутов.ЗначениеАтрибутаКласса КАК ЗначениеИсточникаАтрибутаКласса,
		|	ВТ_ВложенныеАтрибутыКласса.АтрибутКласса КАК АтрибутВложенногоКласса,
		|	ВТ_ТаблицаАтрибутовВложенных.ЗначениеАтрибутаКласса КАК ЗначениеАтрибутаВложенногоКласса
		|ПОМЕСТИТЬ ВТ_ЗначенияВложенныхАтрибутов
		|ИЗ
		|	ВТ_ВложенныеАтрибутыКласса КАК ВТ_ВложенныеАтрибутыКласса
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ИсточникиЗначенийВложенныхАтрибутов КАК ВТ_ИсточникиЗначенийВложенныхАтрибутов
		|		ПО ВТ_ВложенныеАтрибутыКласса.КлассДляЧтения = ВТ_ИсточникиЗначенийВложенныхАтрибутов.КлассДляЧтения
		|			И ВТ_ВложенныеАтрибутыКласса.Источник = ВТ_ИсточникиЗначенийВложенныхАтрибутов.АтрибутКласса
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаАтрибутовВложенных КАК ВТ_ТаблицаАтрибутовВложенных
		|		ПО (ВТ_ИсточникиЗначенийВложенныхАтрибутов.ЗначениеАтрибутаКласса = ВТ_ТаблицаАтрибутовВложенных.Объект)
		|			И ВТ_ВложенныеАтрибутыКласса.АтрибутКласса = ВТ_ТаблицаАтрибутовВложенных.АтрибутКласса
		|ГДЕ 
		|	ВТ_ВложенныеАтрибутыКласса.АтрибутКласса ССЫЛКА ПланВидовХарактеристик.АтрибутыКласса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ТаблицаАтрибутовВложенных";
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаПустаяТаблицаЗначенияВложенныхАтрибутов()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВТ_ВложенныеАтрибутыКласса.КлассДляЧтения,
		|	ВТ_ВложенныеАтрибутыКласса.Источник КАК ИсточникВложенногоАтрибутаКласса,
		|	ВТ_ВложенныеАтрибутыКласса.ВложенныйАтрибутКласса КАК ВложенныйАтрибутКлассаСсылка,
		|	НЕОПРЕДЕЛЕНО КАК ЗначениеАтрибутаВложенногоКласса
		|ПОМЕСТИТЬ ВТ_ЗначенияВложенныхАтрибутов
		|ИЗ
		|	ВТ_ВложенныеАтрибутыКласса КАК ВТ_ВложенныеАтрибутыКласса
		|ГДЕ 
		|	ВТ_ВложенныеАтрибутыКласса.АтрибутКласса ССЫЛКА ПланВидовХарактеристик.АтрибутыКласса";
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаЗначенияВложенныхРеквизитов()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТаблицаВложенныхРеквизитов.КлассДляЧтения,
		|	ТаблицаВложенныхРеквизитов.ВложенныйАтрибутКлассаСсылка,
		|	ТаблицаВложенныхРеквизитов.ТипЗначения,
		|	ТаблицаВложенныхРеквизитов.ИсточникВложенногоАтрибутаКласса,
		|	ТаблицаВложенныхРеквизитов.ЗначениеАтрибутаВложенногоКласса
		|ПОМЕСТИТЬ ВТ_ЗначенияВложенныхРеквизитов
		|ИЗ
		|	&ТаблицаВложенныхРеквизитов КАК ТаблицаВложенныхРеквизитов";
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаПустаяТаблицаЗначенияВложенныхРеквизитов()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВТ_ВложенныеАтрибутыКласса.КлассДляЧтения,
		|	ВТ_ВложенныеАтрибутыКласса.Источник КАК ИсточникВложенногоАтрибутаКласса,
		|	ВТ_ВложенныеАтрибутыКласса.ВложенныйАтрибутКласса КАК ВложенныйАтрибутКлассаСсылка,
		|	НЕОПРЕДЕЛЕНО КАК ТипЗначения,
		|	НЕОПРЕДЕЛЕНО КАК ЗначениеАтрибутаВложенногоКласса
		|ПОМЕСТИТЬ ВТ_ЗначенияВложенныхРеквизитов
		|ИЗ
		|	ВТ_ВложенныеАтрибутыКласса КАК ВТ_ВложенныеАтрибутыКласса
		|ГДЕ 
		|	ВТ_ВложенныеАтрибутыКласса.АтрибутКласса ССЫЛКА Перечисление.РеквизитыКлассаНоменклатуры";
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаАтрибутовФинальная()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВТ_МинМаксУровниАтрибутов.КлассДляЧтения КАК КлассДляЧтения,
		|	ВТ_МинМаксУровниАтрибутов.АтрибутКласса КАК АтрибутКласса,
		|	ВЫБОР
		|		КОГДА ВТ_МинМаксУровниАтрибутов.АтрибутКласса ССЫЛКА ПланВидовХарактеристик.АтрибутыКласса
		|			ТОГДА ВЫРАЗИТЬ(ВТ_МинМаксУровниАтрибутов.АтрибутКласса КАК ПланВидовХарактеристик.АтрибутыКласса).ТипЗначения
		|		КОГДА ВТ_МинМаксУровниАтрибутов.АтрибутКласса ССЫЛКА Справочник.ВложенныеАтрибутыКласса
		|				И ВЫРАЗИТЬ(ВТ_МинМаксУровниАтрибутов.АтрибутКласса КАК Справочник.ВложенныеАтрибутыКласса).АтрибутКласса ССЫЛКА ПланВидовХарактеристик.АтрибутыКласса
		|			ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(ВТ_МинМаксУровниАтрибутов.АтрибутКласса КАК Справочник.ВложенныеАтрибутыКласса).АтрибутКласса КАК ПланВидовХарактеристик.АтрибутыКласса).ТипЗначения
		|	КОНЕЦ КАК ТипЗначения,
		|	ВЫБОР 
		|		КОГДА ВТ_МинМаксУровниАтрибутов.АтрибутКласса ССЫЛКА Справочник.ВложенныеАтрибутыКласса
		|				И ВЫРАЗИТЬ(ВТ_МинМаксУровниАтрибутов.АтрибутКласса КАК Справочник.ВложенныеАтрибутыКласса).АтрибутКласса ССЫЛКА Перечисление.РеквизитыКлассаНоменклатуры
		|			ТОГДА ВТ_ЗначенияВложенныхРеквизитов.ТипЗначения
		|	КОНЕЦ КАК ТипЗначенияРеквизита,
		|	ВТ_ВсеАтрибутыМинУровень.СтатусНаследования КАК СтатусНаследования,
		|	ВЫБОР
		|		КОГДА ВТ_МинМаксУровниАтрибутов.АтрибутКласса ССЫЛКА ПланВидовХарактеристик.АтрибутыКласса
		|			ТОГДА ЕСТЬNULL(ВТ_ЗначенияАтрибутов.ЗначениеАтрибутаКласса, НЕОПРЕДЕЛЕНО)
		|		КОГДА ВТ_МинМаксУровниАтрибутов.АтрибутКласса ССЫЛКА Справочник.ВложенныеАтрибутыКласса
		|				И ВЫРАЗИТЬ(ВТ_МинМаксУровниАтрибутов.АтрибутКласса КАК Справочник.ВложенныеАтрибутыКласса).АтрибутКласса ССЫЛКА ПланВидовХарактеристик.АтрибутыКласса
		|			ТОГДА ЕСТЬNULL(ВТ_ЗначенияВложенныхАтрибутов.ЗначениеАтрибутаВложенногоКласса, НЕОПРЕДЕЛЕНО)
		|		КОГДА ВТ_МинМаксУровниАтрибутов.АтрибутКласса ССЫЛКА Справочник.ВложенныеАтрибутыКласса
		|				И ВЫРАЗИТЬ(ВТ_МинМаксУровниАтрибутов.АтрибутКласса КАК Справочник.ВложенныеАтрибутыКласса).АтрибутКласса ССЫЛКА Перечисление.РеквизитыКлассаНоменклатуры
		|			ТОГДА ЕСТЬNULL(ВТ_ЗначенияВложенныхРеквизитов.ЗначениеАтрибутаВложенногоКласса, НЕОПРЕДЕЛЕНО)
		|	КОНЕЦ КАК ЗначениеАтрибутаКласса,
		|	ВЫБОР
		|		КОГДА НЕ ВТ_МинМаксУровниАтрибутов.АтрибутКласса ССЫЛКА ПланВидовХарактеристик.АтрибутыКласса
		|				ИЛИ ВТ_ЗначенияАтрибутов.УровеньНаследования ЕСТЬ NULL
		|			ТОГДА 0
		|		ИНАЧЕ ВТ_ЗначенияАтрибутов.УровеньНаследования * 2 + 1
		|	КОНЕЦ КАК УровеньЗначения,
		|	ВТ_ВсеАтрибутыМаксУровень.МножественноеЗначение,
		|	ВЫБОР
		|		КОГДА ВТ_ВсеАтрибутыМаксУровень.МножественноеЗначение
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК МножественноеЗначениеКартинка,
		|	ВТ_ВсеАтрибутыМаксУровень.СписокДоступныхЗначений,
		|	ВЫБОР
		|		КОГДА ВТ_ВсеАтрибутыМаксУровень.СписокДоступныхЗначений
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СписокДоступныхЗначенийПереключатель,
		|	ВЫБОР 
		|		КОГДА ВТ_МинМаксУровниАтрибутов.АтрибутКласса ССЫЛКА ПланВидовХарактеристик.АтрибутыКласса
		|			ТОГДА ВТ_ВсеАтрибутыМаксУровень.ИсточникЗначений
		|		КОГДА ВТ_МинМаксУровниАтрибутов.АтрибутКласса ССЫЛКА Справочник.ВложенныеАтрибутыКласса
		|				И ВЫРАЗИТЬ(ВТ_МинМаксУровниАтрибутов.АтрибутКласса КАК Справочник.ВложенныеАтрибутыКласса).АтрибутКласса ССЫЛКА ПланВидовХарактеристик.АтрибутыКласса
		|			ТОГДА ЕСТЬNULL(ВТ_ЗначенияВложенныхАтрибутов.ИсточникВложенногоАтрибутаКласса, НЕОПРЕДЕЛЕНО)
		|		КОГДА ВТ_МинМаксУровниАтрибутов.АтрибутКласса ССЫЛКА Справочник.ВложенныеАтрибутыКласса
		|				И ВЫРАЗИТЬ(ВТ_МинМаксУровниАтрибутов.АтрибутКласса КАК Справочник.ВложенныеАтрибутыКласса).АтрибутКласса ССЫЛКА Перечисление.РеквизитыКлассаНоменклатуры
		|			ТОГДА ЕСТЬNULL(ВТ_ЗначенияВложенныхРеквизитов.ИсточникВложенногоАтрибутаКласса, НЕОПРЕДЕЛЕНО)
		|	КОНЕЦ КАК ИсточникЗначений,
		|	ВЫБОР
		|		КОГДА ВТ_ВсеАтрибутыМаксУровень.ИсточникЗначений ССЫЛКА Справочник.Классы
		|				И НЕ ВТ_ВсеАтрибутыМаксУровень.ИсточникЗначений = ЗНАЧЕНИЕ(Справочник.Классы.ПустаяСсылка)
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ВсеАтрибутыМаксУровень.ИсточникЗначений КАК Справочник.Классы).КлассТабличнаяЧасть
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК КлассТабличнаяЧасть,
		|	ВТ_ВсеАтрибутыМинУровень.РежимИспользования,
		|	ВТ_ВсеАтрибутыМаксУровень.РежимЗаполнения,
		|	ВТ_ВсеАтрибутыРодителя.РежимЗаполнения КАК РежимЗаполненияРодителя,
		|	ВТ_ВсеАтрибутыМаксУровень.МинЗначение,
		|	ВТ_ВсеАтрибутыМаксУровень.МаксЗначение,
		|	ВТ_ВсеАтрибутыМинУровень.ДобавлениеСтрокТабЧастиВНоменклатуреКласса,
		|	ВТ_ВсеАтрибутыМинУровень.ДобавлениеСтрокТабЧастиВОбъектахНоменклатуры,
		|	ВТ_ВсеАтрибутыМаксУровень.Формат,
		|	ВТ_ВсеАтрибутыМаксУровень.Порядок КАК Порядок
		|ПОМЕСТИТЬ ВТ_ТаблицаАтрибутов
		|ИЗ
		|	ВТ_МинМаксУровниАтрибутов КАК ВТ_МинМаксУровниАтрибутов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СписокРодителей КАК ВТ_СписокРодителейТекущийУровень
		|		ПО ВТ_МинМаксУровниАтрибутов.КлассДляЧтения = ВТ_СписокРодителейТекущийУровень.КлассДляЧтения
		|			И ВТ_МинМаксУровниАтрибутов.КлассДляЧтения = ВТ_СписокРодителейТекущийУровень.Класс
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВсеАтрибуты КАК ВТ_ВсеАтрибутыМинУровень
		|		ПО ВТ_МинМаксУровниАтрибутов.КлассДляЧтения = ВТ_ВсеАтрибутыМинУровень.КлассДляЧтения
		|			И ВТ_МинМаксУровниАтрибутов.АтрибутКласса = ВТ_ВсеАтрибутыМинУровень.АтрибутКласса
		|			И ВТ_МинМаксУровниАтрибутов.МинУровень = ВТ_ВсеАтрибутыМинУровень.Уровень
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВсеАтрибуты КАК ВТ_ВсеАтрибутыМаксУровень
		|		ПО ВТ_МинМаксУровниАтрибутов.КлассДляЧтения = ВТ_ВсеАтрибутыМаксУровень.КлассДляЧтения
		|			И ВТ_МинМаксУровниАтрибутов.АтрибутКласса = ВТ_ВсеАтрибутыМаксУровень.АтрибутКласса
		|			И ВТ_МинМаксУровниАтрибутов.МаксУровень = ВТ_ВсеАтрибутыМаксУровень.Уровень
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВсеАтрибуты КАК ВТ_ВсеАтрибутыРодителя
		|		ПО ВТ_МинМаксУровниАтрибутов.КлассДляЧтения = ВТ_ВсеАтрибутыРодителя.КлассДляЧтения
		|			И ВТ_МинМаксУровниАтрибутов.АтрибутКласса = ВТ_ВсеАтрибутыРодителя.АтрибутКласса
		|			И (ВТ_МинМаксУровниАтрибутов.МаксУровень < ВТ_СписокРодителейТекущийУровень.Уровень - 1
		|					И ВТ_МинМаксУровниАтрибутов.МаксУровень = ВТ_ВсеАтрибутыРодителя.Уровень
		|				ИЛИ ВТ_ВсеАтрибутыРодителя.Уровень = ВТ_СписокРодителейТекущийУровень.Уровень - 1)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МаксУровниЗначений КАК ВТ_МаксУровниЗначений
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗначенияАтрибутов КАК ВТ_ЗначенияАтрибутов
		|			ПО ВТ_МаксУровниЗначений.КлассДляЧтения = ВТ_ЗначенияАтрибутов.КлассДляЧтения
		|				И ВТ_МаксУровниЗначений.АтрибутКласса = ВТ_ЗначенияАтрибутов.АтрибутКласса
		|				И ВТ_МаксУровниЗначений.Уровень = ВТ_ЗначенияАтрибутов.Уровень
		|		ПО ВТ_МинМаксУровниАтрибутов.КлассДляЧтения = ВТ_МаксУровниЗначений.КлассДляЧтения
		|			И ВТ_МинМаксУровниАтрибутов.АтрибутКласса = ВТ_МаксУровниЗначений.АтрибутКласса
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗначенияВложенныхАтрибутов КАК ВТ_ЗначенияВложенныхАтрибутов
		|		ПО ВТ_МинМаксУровниАтрибутов.КлассДляЧтения = ВТ_ЗначенияВложенныхАтрибутов.КлассДляЧтения
		|			И ВТ_МинМаксУровниАтрибутов.АтрибутКласса = ВТ_ЗначенияВложенныхАтрибутов.ВложенныйАтрибутКлассаСсылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗначенияВложенныхРеквизитов КАК ВТ_ЗначенияВложенныхРеквизитов
		|		ПО ВТ_МинМаксУровниАтрибутов.КлассДляЧтения = ВТ_ЗначенияВложенныхРеквизитов.КлассДляЧтения
		|			И ВТ_МинМаксУровниАтрибутов.АтрибутКласса = ВТ_ЗначенияВложенныхРеквизитов.ВложенныйАтрибутКлассаСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_СписокРодителей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ВсеНазначения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_НеНаследуемыеАтрибуты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ЗначенияАтрибутов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_МаксУровниЗначений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ВсеАтрибуты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_МинМаксУровниАтрибутов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ВложенныеАтрибутыКласса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ИсточникиЗначенийВложенныхАтрибутов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ЗначенияВложенныхАтрибутов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ЗначенияВложенныхРеквизитов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицаАтрибутов.КлассДляЧтения,
		|	ВТ_ТаблицаАтрибутов.АтрибутКласса КАК АтрибутКласса,
		|	ВТ_ТаблицаАтрибутов.ТипЗначения,
		|	ВТ_ТаблицаАтрибутов.ТипЗначенияРеквизита,
		|	ВТ_ТаблицаАтрибутов.СтатусНаследования,
		|	ВТ_ТаблицаАтрибутов.ЗначениеАтрибутаКласса,
		|	ВТ_ТаблицаАтрибутов.УровеньЗначения,
		|	ВТ_ТаблицаАтрибутов.МножественноеЗначение,
		|	ВТ_ТаблицаАтрибутов.МножественноеЗначениеКартинка,
		|	ВТ_ТаблицаАтрибутов.СписокДоступныхЗначений,
		|	ВТ_ТаблицаАтрибутов.СписокДоступныхЗначенийПереключатель,
		|	ВТ_ТаблицаАтрибутов.ИсточникЗначений,
		|	ВТ_ТаблицаАтрибутов.КлассТабличнаяЧасть,
		|	ВТ_ТаблицаАтрибутов.РежимИспользования,
		|	ВТ_ТаблицаАтрибутов.РежимЗаполнения,
		|	ВТ_ТаблицаАтрибутов.РежимЗаполненияРодителя,
		|	ВТ_ТаблицаАтрибутов.МинЗначение,
		|	ВТ_ТаблицаАтрибутов.МаксЗначение,
		|	ВТ_ТаблицаАтрибутов.ДобавлениеСтрокТабЧастиВНоменклатуреКласса,
		|	ВТ_ТаблицаАтрибутов.ДобавлениеСтрокТабЧастиВОбъектахНоменклатуры,
		|	ВТ_ТаблицаАтрибутов.Формат,
		|	ВТ_ТаблицаАтрибутов.Порядок КАК Порядок
		|ИЗ
		|	ВТ_ТаблицаАтрибутов КАК ВТ_ТаблицаАтрибутов
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ_ТаблицаАтрибутов.КлассДляЧтения,
		|	Порядок,
		|	АтрибутКласса
		|АВТОУПОРЯДОЧИВАНИЕ";
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаЗначенияСписочныхАтрибутов()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВТ_СписокРодителей.КлассДляЧтения,
		|	НенаследуемыеЗначения.АтрибутКласса КАК АтрибутКласса,
		|	НенаследуемыеЗначения.ЗначениеАтрибутаКласса КАК ЗначениеАтрибутаКласса,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ВТ_СписокРодителей.Класс = ВТ_СписокРодителей.КлассДляЧтения
		|				ТОГДА 0
		|			ИНАЧЕ 1
		|		КОНЕЦ) КАК УровеньНаследования
		|ПОМЕСТИТЬ ВТ_НенаследуемыеЗначения
		|ИЗ
		|	ВТ_СписокРодителей КАК ВТ_СписокРодителей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НенаследуемыеЗначения КАК НенаследуемыеЗначения
		|		ПО ВТ_СписокРодителей.Класс = НенаследуемыеЗначения.Класс
		|ГДЕ
		|	НЕ НенаследуемыеЗначения.НеНаследуемыйАтрибут
		|	И НенаследуемыеЗначения.Класс В
		|			(ВЫБРАТЬ
		|				ВТ_СписокРодителей.Класс
		|			ИЗ
		|				ВТ_СписокРодителей)
		|	И (НЕ &ОтборПоАтрибуту
		|			ИЛИ НенаследуемыеЗначения.АтрибутКласса В (&АтрибутКласса))
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СписокРодителей.КлассДляЧтения,
		|	НенаследуемыеЗначения.АтрибутКласса,
		|	НенаследуемыеЗначения.ЗначениеАтрибутаКласса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СписокРодителей.КлассДляЧтения,
		|	МножественныеЗначенияАтрибутов.ЗначениеАтрибутаКласса,
		|	МножественныеЗначенияАтрибутов.АтрибутКласса,
		|	МножественныеЗначенияАтрибутов.Класс,
		|	МножественныеЗначенияАтрибутов.ДоступноеЗначение,
		|	МножественныеЗначенияАтрибутов.ИспользуемоеЗначение,
		|	МножественныеЗначенияАтрибутов.Порядок
		|ПОМЕСТИТЬ ВТ_МножественныеЗначенияАтрибутов
		|ИЗ
		|	ВТ_СписокРодителей КАК ВТ_СписокРодителей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.МножественныеЗначенияАтрибутов КАК МножественныеЗначенияАтрибутов
		|		ПО ВТ_СписокРодителей.Класс = МножественныеЗначенияАтрибутов.Класс
		|ГДЕ
		|	МножественныеЗначенияАтрибутов.Класс В
		|			(ВЫБРАТЬ
		|				ВТ_СписокРодителей.Класс
		|			ИЗ
		|				ВТ_СписокРодителей)
		|	И (НЕ &ОтборПоАтрибуту
		|			ИЛИ МножественныеЗначенияАтрибутов.АтрибутКласса В (&АтрибутКласса))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВТ_МножественныеЗначенияАтрибутов.КлассДляЧтения, ВТ_НенаследуемыеЗначения.КлассДляЧтения) КАК КлассДляЧтения,
		|	ЕСТЬNULL(ВТ_МножественныеЗначенияАтрибутов.ЗначениеАтрибутаКласса, ВТ_НенаследуемыеЗначения.ЗначениеАтрибутаКласса) КАК ЗначениеАтрибутаКласса,
		|	ЕСТЬNULL(ВТ_МножественныеЗначенияАтрибутов.АтрибутКласса, ВТ_НенаследуемыеЗначения.АтрибутКласса) КАК АтрибутКласса,
		|	ВЫБОР
		|		КОГДА НЕ ВТ_НенаследуемыеЗначения.УровеньНаследования ЕСТЬ NULL
		|				И ВТ_НенаследуемыеЗначения.УровеньНаследования > 0
		|			ТОГДА 5
		|		КОГДА НЕ ВТ_НенаследуемыеЗначения.УровеньНаследования ЕСТЬ NULL
		|				И ВТ_НенаследуемыеЗначения.УровеньНаследования = 0
		|			ТОГДА 4
		|		КОГДА НЕ ВТ_МножественныеЗначенияАтрибутов.Класс ЕСТЬ NULL
		|				И ВТ_МножественныеЗначенияАтрибутов.Класс = ВТ_МножественныеЗначенияАтрибутов.КлассДляЧтения
		|			ТОГДА 2
		|		ИНАЧЕ 3
		|	КОНЕЦ КАК СтатусНаследования,
		|	ВЫБОР
		|		КОГДА ВТ_НенаследуемыеЗначения.ЗначениеАтрибутаКласса ЕСТЬ NULL
		|			ТОГДА ВТ_МножественныеЗначенияАтрибутов.ДоступноеЗначение
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ДоступноеЗначение,
		|	ЕСТЬNULL(ВТ_МножественныеЗначенияАтрибутов.ДоступноеЗначение, ЛОЖЬ) КАК ДоступноеЗначениеНаследуемое,
		|	ЕСТЬNULL(ВТ_МножественныеЗначенияАтрибутов.ИспользуемоеЗначение, ЛОЖЬ) КАК ИспользуемоеЗначение,
		|	ЕСТЬNULL(ВТ_СписокРодителей.Уровень, 0) КАК Уровень,
		|	ЕСТЬNULL(ВТ_МножественныеЗначенияАтрибутов.Порядок, 0) КАК Порядок
		|ПОМЕСТИТЬ ВТ_ВсеЗначенияАтрибутов
		|ИЗ
		|	ВТ_МножественныеЗначенияАтрибутов КАК ВТ_МножественныеЗначенияАтрибутов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СписокРодителей КАК ВТ_СписокРодителей
		|		ПО ВТ_МножественныеЗначенияАтрибутов.КлассДляЧтения = ВТ_СписокРодителей.КлассДляЧтения
		|			И ВТ_МножественныеЗначенияАтрибутов.Класс = ВТ_СписокРодителей.Класс
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_НенаследуемыеЗначения КАК ВТ_НенаследуемыеЗначения
		|		ПО ВТ_МножественныеЗначенияАтрибутов.КлассДляЧтения = ВТ_НенаследуемыеЗначения.КлассДляЧтения
		|			И ВТ_МножественныеЗначенияАтрибутов.АтрибутКласса = ВТ_НенаследуемыеЗначения.АтрибутКласса
		|			И ВТ_МножественныеЗначенияАтрибутов.ЗначениеАтрибутаКласса = ВТ_НенаследуемыеЗначения.ЗначениеАтрибутаКласса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВсеЗначенияАтрибутов.КлассДляЧтения КАК КлассДляЧтения,
		|	ВТ_ВсеЗначенияАтрибутов.ЗначениеАтрибутаКласса КАК ЗначениеАтрибутаКласса,
		|	ВТ_ВсеЗначенияАтрибутов.АтрибутКласса КАК АтрибутКласса,
		|	МАКСИМУМ(ВТ_ВсеЗначенияАтрибутов.Уровень) КАК Уровень,
		|	МАКСИМУМ(ВТ_ВсеЗначенияАтрибутов.ДоступноеЗначение) КАК ДоступноеЗначение,
		|	МАКСИМУМ(ВТ_ВсеЗначенияАтрибутов.ДоступноеЗначениеНаследуемое) КАК ДоступноеЗначениеНаследуемое
		|ПОМЕСТИТЬ ВТ_МаксУровеньЗначений
		|ИЗ
		|	ВТ_ВсеЗначенияАтрибутов КАК ВТ_ВсеЗначенияАтрибутов
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ВсеЗначенияАтрибутов.КлассДляЧтения,
		|	ВТ_ВсеЗначенияАтрибутов.ЗначениеАтрибутаКласса,
		|	ВТ_ВсеЗначенияАтрибутов.АтрибутКласса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_МаксУровеньЗначений.КлассДляЧтения,
		|	ВТ_МаксУровеньЗначений.АтрибутКласса КАК АтрибутКласса,
		|	ВТ_МаксУровеньЗначений.ЗначениеАтрибутаКласса КАК ЗначениеАтрибутаКласса,
		|	ВТ_ВсеЗначенияАтрибутов.СтатусНаследования КАК СтатусНаследования,
		|	ВТ_МаксУровеньЗначений.ДоступноеЗначение КАК ДоступноеЗначение,
		|	ВТ_МаксУровеньЗначений.ДоступноеЗначениеНаследуемое КАК ДоступноеЗначениеНаследуемое,
		|	ВТ_ВсеЗначенияАтрибутов.ИспользуемоеЗначение КАК ИспользуемоеЗначение,
		|	ВТ_ВсеЗначенияАтрибутов.Порядок КАК Порядок
		|ПОМЕСТИТЬ ВТ_ЗначенияСписочныхАтрибутов
		|ИЗ
		|	ВТ_МаксУровеньЗначений КАК ВТ_МаксУровеньЗначений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВсеЗначенияАтрибутов КАК ВТ_ВсеЗначенияАтрибутов
		|		ПО ВТ_МаксУровеньЗначений.КлассДляЧтения = ВТ_ВсеЗначенияАтрибутов.КлассДляЧтения
		|			И ВТ_МаксУровеньЗначений.ЗначениеАтрибутаКласса = ВТ_ВсеЗначенияАтрибутов.ЗначениеАтрибутаКласса
		|			И ВТ_МаксУровеньЗначений.АтрибутКласса = ВТ_ВсеЗначенияАтрибутов.АтрибутКласса
		|			И ВТ_МаксУровеньЗначений.Уровень = ВТ_ВсеЗначенияАтрибутов.Уровень
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_НенаследуемыеЗначения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_МножественныеЗначенияАтрибутов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ВсеЗначенияАтрибутов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_МаксУровеньЗначений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗначенияСписочныхАтрибутов.КлассДляЧтения КАК КлассДляЧтения,
		|	ВТ_ЗначенияСписочныхАтрибутов.АтрибутКласса КАК АтрибутКласса,
		|	ВТ_ЗначенияСписочныхАтрибутов.ЗначениеАтрибутаКласса КАК ЗначениеАтрибутаКласса,
		|	ВТ_ЗначенияСписочныхАтрибутов.СтатусНаследования КАК СтатусНаследования,
		|	ВТ_ЗначенияСписочныхАтрибутов.ДоступноеЗначение,
		|	ВТ_ЗначенияСписочныхАтрибутов.ДоступноеЗначениеНаследуемое,
		|	ВТ_ЗначенияСписочныхАтрибутов.ИспользуемоеЗначение,
		|	ВТ_ЗначенияСписочныхАтрибутов.Порядок
		|ИЗ
		|	ВТ_ЗначенияСписочныхАтрибутов КАК ВТ_ЗначенияСписочныхАтрибутов
		|
		|УПОРЯДОЧИТЬ ПО
		|	КлассДляЧтения,
		|	АтрибутКласса,
		|	Порядок,
		|	ЗначениеАтрибутаКласса,
		|	СтатусНаследования
		|АВТОУПОРЯДОЧИВАНИЕ";
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаСтрокиТабличныхАтрибутов()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВТ_СписокРодителей.КлассДляЧтения,
		|	ВТ_СписокРодителей.Класс,
		|	НенаследуемыеЗначения.АтрибутКласса,
		|	НенаследуемыеЗначения.ЗначениеАтрибутаКласса
		|ПОМЕСТИТЬ ВТ_ВсеНенаследуемыеЗначения
		|ИЗ
		|	ВТ_СписокРодителей КАК ВТ_СписокРодителей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НенаследуемыеЗначения КАК НенаследуемыеЗначения
		|		ПО ВТ_СписокРодителей.Класс = НенаследуемыеЗначения.Класс
		|			И (НенаследуемыеЗначения.НеНаследуемыйАтрибут = ЛОЖЬ)
		|			И (НенаследуемыеЗначения.АтрибутКласса В (&АтрибутыКласса))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СписокРодителей.КлассДляЧтения КАК КлассДляЧтения,
		|	ВТ_СписокРодителей.Класс,
		|	ВТ_СписокРодителей.Уровень КАК Уровень,
		|	ВТ_ДанныеТекУровня.Уровень КАК УровеньТекКласса,
		|	МножественныеЗначенияАтрибутов.АтрибутКласса КАК АтрибутКласса,
		|	ВЫРАЗИТЬ(МножественныеЗначенияАтрибутов.ЗначениеАтрибутаКласса КАК Справочник.Классы) КАК ЗначениеАтрибутаКласса,
		|	ВЫРАЗИТЬ(МножественныеЗначенияАтрибутов.ЗначениеАтрибутаКласса КАК Справочник.Классы).Наименование КАК Наименование,
		|	ВЫРАЗИТЬ(МножественныеЗначенияАтрибутов.ЗначениеАтрибутаКласса КАК Справочник.Классы).Родитель КАК ЗначениеАтрибутаКлассаУровнемВыше,
		|	ВЫРАЗИТЬ(МножественныеЗначенияАтрибутов.ЗначениеАтрибутаКласса КАК Справочник.Классы).НоменклатураКласса КАК НоменклатураКласса,
		|	ВЫРАЗИТЬ(МножественныеЗначенияАтрибутов.ЗначениеАтрибутаКласса КАК Справочник.Классы).ОбъектыНоменклатуры КАК ОбъектыНоменклатуры,
		|	МножественныеЗначенияАтрибутов.Порядок,
		|	ВЫБОР
		|		КОГДА НЕ ВТ_ВсеНенаследуемыеЗначения.ЗначениеАтрибутаКласса ЕСТЬ NULL
		|				И ВТ_ВсеНенаследуемыеЗначения.Класс = ВТ_ВсеНенаследуемыеЗначения.КлассДляЧтения
		|			ТОГДА 4
		|		КОГДА НЕ ВТ_ВсеНенаследуемыеЗначения.ЗначениеАтрибутаКласса ЕСТЬ NULL
		|			ТОГДА 5
		|		КОГДА ВТ_СписокРодителей.Класс = ВТ_СписокРодителей.КлассДляЧтения
		|			ТОГДА 1
		|		ИНАЧЕ 3
		|	КОНЕЦ КАК СтатусНаследования
		|ИЗ
		|	ВТ_СписокРодителей КАК ВТ_СписокРодителей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.МножественныеЗначенияАтрибутов КАК МножественныеЗначенияАтрибутов
		|		ПО ВТ_СписокРодителей.Класс = МножественныеЗначенияАтрибутов.Класс
		|			И (МножественныеЗначенияАтрибутов.АтрибутКласса В (&АтрибутыКласса))
		|			И (МножественныеЗначенияАтрибутов.ИспользуемоеЗначение)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СписокРодителей КАК ВТ_ДанныеТекУровня
		|		ПО ВТ_СписокРодителей.КлассДляЧтения = ВТ_ДанныеТекУровня.КлассДляЧтения
		|			И ВТ_СписокРодителей.КлассДляЧтения = ВТ_ДанныеТекУровня.Класс
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВсеНенаследуемыеЗначения КАК ВТ_ВсеНенаследуемыеЗначения
		|		ПО ВТ_СписокРодителей.КлассДляЧтения = ВТ_ВсеНенаследуемыеЗначения.КлассДляЧтения
		|			И (МножественныеЗначенияАтрибутов.АтрибутКласса = ВТ_ВсеНенаследуемыеЗначения.АтрибутКласса)
		|			И (МножественныеЗначенияАтрибутов.ЗначениеАтрибутаКласса = ВТ_ВсеНенаследуемыеЗначения.ЗначениеАтрибутаКласса)
		|
		|УПОРЯДОЧИТЬ ПО
		|	КлассДляЧтения,
		|	АтрибутКласса,
		|	Уровень
		|ИТОГИ ПО
		|	КлассДляЧтения,
		|	АтрибутКласса";
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВосстановитьНаследованиеДанныеДляВосстановления()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СписокРодителей.Класс КАК Класс,
		|	СписокРодителей.КлассДляЧтения КАК КлассДляЧтения,
		|	СписокРодителей.Уровень КАК Уровень
		|ПОМЕСТИТЬ ВТ_СписокРодителей
		|ИЗ
		|	&СписокРодителей КАК СписокРодителей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МножественныеЗначенияАтрибутов.Класс,
		|	ЕСТЬNULL(СпрНоменклатураКласса.Класс, СпрКлассы.Родитель) КАК Родитель,
		|	МножественныеЗначенияАтрибутов.АтрибутКласса,
		|	МножественныеЗначенияАтрибутов.ЗначениеАтрибутаКласса,
		|	ЕСТЬNULL(СпрНоменклатураСтроки.Класс, СпрКлассыСтроки.Родитель) КАК РодительСтроки,
		|	МножественныеЗначенияАтрибутов.Порядок,
		|	ВЫБОР
		|		КОГДА МножественныеЗначенияАтрибутов.Класс В (&МассивОбъектов)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК СтрокаОбъектаПроверки
		|ПОМЕСТИТЬ ВТ_СтрокиДляОбработки
		|ИЗ
		|	РегистрСведений.МножественныеЗначенияАтрибутов КАК МножественныеЗначенияАтрибутов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураКласса КАК СпрНоменклатураКласса
		|		ПО МножественныеЗначенияАтрибутов.Класс = СпрНоменклатураКласса.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Классы КАК СпрКлассы
		|		ПО МножественныеЗначенияАтрибутов.Класс = СпрКлассы.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураКласса КАК СпрНоменклатураСтроки
		|		ПО МножественныеЗначенияАтрибутов.ЗначениеАтрибутаКласса = СпрНоменклатураСтроки.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Классы КАК СпрКлассыСтроки
		|		ПО МножественныеЗначенияАтрибутов.ЗначениеАтрибутаКласса = СпрКлассыСтроки.Ссылка
		|ГДЕ
		|	МножественныеЗначенияАтрибутов.Класс В
		|			(ВЫБРАТЬ
		|				ВТ_СписокРодителей.Класс
		|			ИЗ
		|				ВТ_СписокРодителей КАК ВТ_СписокРодителей
		|		
		|			ОБЪЕДИНИТЬ ВСЕ
		|		
		|			ВЫБРАТЬ
		|				СпрНоменклатура.Ссылка
		|			ИЗ
		|				Справочник.НоменклатураКласса КАК СпрНоменклатура
		|			ГДЕ
		|				СпрНоменклатура.Ссылка В (&МассивНоменклатуры))
		|	И МножественныеЗначенияАтрибутов.ТабличныйАтрибут
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СтрокиДляОбработки.Класс,
		|	ВТ_СтрокиДляОбработки.Родитель,
		|	ВТ_СтрокиДляОбработки.АтрибутКласса,
		|	ВТ_СтрокиДляОбработки.ЗначениеАтрибутаКласса,
		|	ВТ_СтрокиДляОбработки.РодительСтроки,
		|	ВТ_СтрокиДляОбработки.Порядок
		|ПОМЕСТИТЬ ВТ_СтрокиДляПоискаРодителей
		|ИЗ
		|	ВТ_СтрокиДляОбработки КАК ВТ_СтрокиДляОбработки
		|ГДЕ
		|	ВТ_СтрокиДляОбработки.СтрокаОбъектаПроверки";
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВосстановитьНаследованиеДанныеВИерархии()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВТ_СтрокиДляПоискаРодителей.Класс,
		|	ВТ_СтрокиДляПоискаРодителей.Родитель,
		|	ВТ_СтрокиДляПоискаРодителей.АтрибутКласса,
		|	ВТ_СтрокиДляПоискаРодителей.ЗначениеАтрибутаКласса,
		|	ВТ_СтрокиДляПоискаРодителей.РодительСтроки,
		|	ВТ_СтрокиДляПоискаРодителей.Порядок,
		|	ЕСТЬNULL(ВТ_СписокРодителей.Класс, ВТ_СписокРодителейНоменклатуры.Класс) КАК КлассПоИерархии,
		|	ЕСТЬNULL(ВТ_СписокРодителей.Уровень, ВТ_СписокРодителейНоменклатуры.Уровень) КАК Уровень
		|ПОМЕСТИТЬ ВТ_ДанныеДляПоискаВИерархии
		|ИЗ
		|	ВТ_СтрокиДляПоискаРодителей КАК ВТ_СтрокиДляПоискаРодителей
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СписокРодителей КАК ВТ_СписокРодителей
		|		ПО ВТ_СтрокиДляПоискаРодителей.Класс = ВТ_СписокРодителей.КлассДляЧтения
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СписокРодителей КАК ВТ_СписокРодителейНоменклатуры
		|		ПО ВТ_СтрокиДляПоискаРодителей.Родитель = ВТ_СписокРодителейНоменклатуры.КлассДляЧтения
		|			И (ВТ_СписокРодителей.КлассДляЧтения ЕСТЬ NULL)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_СтрокиДляПоискаРодителей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеДляПоискаВИерархии.Класс,
		|	ВТ_ДанныеДляПоискаВИерархии.АтрибутКласса,
		|	ВТ_ДанныеДляПоискаВИерархии.ЗначениеАтрибутаКласса,
		|	ВТ_ДанныеДляПоискаВИерархии.РодительСтроки,
		|	ВТ_СтрокиДляОбработки.РодительСтроки КАК РодительСтрокиВыше,
		|	ВТ_ДанныеДляПоискаВИерархии.КлассПоИерархии,
		|	ВТ_ДанныеДляПоискаВИерархии.Уровень,
		|	ВТ_ДанныеДляПоискаВИерархии.Порядок
		|ПОМЕСТИТЬ ВТ_НайденныеВИерархииСтроки
		|ИЗ
		|	ВТ_ДанныеДляПоискаВИерархии КАК ВТ_ДанныеДляПоискаВИерархии
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СтрокиДляОбработки КАК ВТ_СтрокиДляОбработки
		|		ПО ВТ_ДанныеДляПоискаВИерархии.КлассПоИерархии = ВТ_СтрокиДляОбработки.Класс
		|			И ВТ_ДанныеДляПоискаВИерархии.АтрибутКласса = ВТ_СтрокиДляОбработки.АтрибутКласса
		|			И ВТ_ДанныеДляПоискаВИерархии.РодительСтроки = ВТ_СтрокиДляОбработки.ЗначениеАтрибутаКласса
		|			И (НЕ ВТ_ДанныеДляПоискаВИерархии.КлассПоИерархии = ВТ_ДанныеДляПоискаВИерархии.Класс)";
	Возврат ТекстЗапроса;
	
КонецФункции //

Функция ТекстЗапросаВосстановитьНаследованиеПоискРодителейСтрок()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВТ_НайденныеВИерархииСтроки.Класс,
		|	ВТ_НайденныеВИерархииСтроки.АтрибутКласса,
		|	ВТ_НайденныеВИерархииСтроки.ЗначениеАтрибутаКласса,
		|	ВТ_НайденныеВИерархииСтроки.Порядок,
		|	ВТ_СтрокиДляОбработки.ЗначениеАтрибутаКласса КАК НовыйРодительСтроки,
		|	ВТ_ДанныеДляПоискаВИерархии.КлассПоИерархии КАК КлассПоИерархии,
		|	ВТ_ДанныеДляПоискаВИерархии.Уровень
		|ПОМЕСТИТЬ ВТ_НовыеРодители
		|ИЗ
		|	ВТ_НайденныеВИерархииСтроки КАК ВТ_НайденныеВИерархииСтроки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеДляПоискаВИерархии КАК ВТ_ДанныеДляПоискаВИерархии
		|		ПО ВТ_НайденныеВИерархииСтроки.Класс = ВТ_ДанныеДляПоискаВИерархии.Класс
		|			И ВТ_НайденныеВИерархииСтроки.АтрибутКласса = ВТ_ДанныеДляПоискаВИерархии.АтрибутКласса
		|			И ВТ_НайденныеВИерархииСтроки.ЗначениеАтрибутаКласса = ВТ_ДанныеДляПоискаВИерархии.ЗначениеАтрибутаКласса
		|			И ВТ_НайденныеВИерархииСтроки.Уровень < ВТ_ДанныеДляПоискаВИерархии.Уровень
		|			И НЕ ВТ_ДанныеДляПоискаВИерархии.Класс = ВТ_ДанныеДляПоискаВИерархии.КлассПоИерархии
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СтрокиДляОбработки КАК ВТ_СтрокиДляОбработки
		|		ПО (ВТ_ДанныеДляПоискаВИерархии.КлассПоИерархии = ВТ_СтрокиДляОбработки.Класс)
		|			И ВТ_НайденныеВИерархииСтроки.АтрибутКласса = ВТ_СтрокиДляОбработки.АтрибутКласса
		|			И ВТ_НайденныеВИерархииСтроки.РодительСтроки = ВТ_СтрокиДляОбработки.РодительСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_НайденныеВИерархииСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_СписокРодителей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НовыеРодители.Класс,
		|	ВТ_НовыеРодители.АтрибутКласса,
		|	ВТ_НовыеРодители.ЗначениеАтрибутаКласса,
		|	ВТ_НовыеРодители.Порядок,
		|	ВТ_СтрокиДляОбработки.ЗначениеАтрибутаКласса КАК НовыйРодительСтроки,
		|	ВТ_ДанныеДляПоискаВИерархии.КлассПоИерархии КАК КлассПоИерархии,
		|	ВТ_ДанныеДляПоискаВИерархии.Уровень
		|ПОМЕСТИТЬ ВТ_НовыеРодителиСледующийУровень
		|ИЗ
		|	ВТ_НовыеРодители КАК ВТ_НовыеРодители
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеДляПоискаВИерархии КАК ВТ_ДанныеДляПоискаВИерархии
		|		ПО ВТ_НовыеРодители.Класс = ВТ_ДанныеДляПоискаВИерархии.Класс
		|			И ВТ_НовыеРодители.АтрибутКласса = ВТ_ДанныеДляПоискаВИерархии.АтрибутКласса
		|			И ВТ_НовыеРодители.ЗначениеАтрибутаКласса = ВТ_ДанныеДляПоискаВИерархии.ЗначениеАтрибутаКласса
		|			И ВТ_НовыеРодители.Уровень < ВТ_ДанныеДляПоискаВИерархии.Уровень
		|			И НЕ ВТ_ДанныеДляПоискаВИерархии.Класс = ВТ_ДанныеДляПоискаВИерархии.КлассПоИерархии
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СтрокиДляОбработки КАК ВТ_СтрокиДляОбработки
		|		ПО (ВТ_ДанныеДляПоискаВИерархии.КлассПоИерархии = ВТ_СтрокиДляОбработки.Класс)
		|			И ВТ_НовыеРодители.АтрибутКласса = ВТ_СтрокиДляОбработки.АтрибутКласса
		|			И ВТ_НовыеРодители.НовыйРодительСтроки = ВТ_СтрокиДляОбработки.РодительСтроки";
	Возврат ТекстЗапроса;
	
КонецФункции //

Функция ТекстЗапросаВосстановитьНаследованиеПроверкаИерархииНаследованияСтрок()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВТ_НовыеРодители.Класс,
		|	ВТ_НовыеРодители.АтрибутКласса,
		|	ВТ_НовыеРодители.ЗначениеАтрибутаКласса,
		|	ВТ_НовыеРодители.Порядок,
		|	ЕСТЬNULL(ВТ_НовыеРодителиСледующийУровень.НовыйРодительСтроки, ВТ_НовыеРодители.НовыйРодительСтроки) КАК НовыйРодительСтроки,
		|	ЕСТЬNULL(ВТ_НовыеРодителиСледующийУровень.КлассПоИерархии, ВТ_НовыеРодители.КлассПоИерархии) КАК КлассПоИерархии,
		|	ЕСТЬNULL(ВТ_НовыеРодителиСледующийУровень.Уровень, ВТ_НовыеРодители.Уровень) КАК Уровень
		|ПОМЕСТИТЬ ВТ_НовыеРодителиУточненные
		|ИЗ
		|	ВТ_НовыеРодители КАК ВТ_НовыеРодители
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НовыеРодителиСледующийУровень КАК ВТ_НовыеРодителиСледующийУровень
		|		ПО ВТ_НовыеРодители.Класс = ВТ_НовыеРодителиСледующийУровень.Класс
		|			И ВТ_НовыеРодители.АтрибутКласса = ВТ_НовыеРодителиСледующийУровень.АтрибутКласса
		|			И ВТ_НовыеРодители.ЗначениеАтрибутаКласса = ВТ_НовыеРодителиСледующийУровень.ЗначениеАтрибутаКласса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_НовыеРодители
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НовыеРодителиУточненные.Класс,
		|	ВТ_НовыеРодителиУточненные.АтрибутКласса,
		|	ВТ_НовыеРодителиУточненные.ЗначениеАтрибутаКласса,
		|	ВТ_НовыеРодителиУточненные.Порядок,
		|	ВТ_НовыеРодителиУточненные.НовыйРодительСтроки,
		|	ВТ_НовыеРодителиУточненные.КлассПоИерархии,
		|	ВТ_НовыеРодителиУточненные.Уровень
		|ПОМЕСТИТЬ ВТ_НовыеРодители
		|ИЗ
		|	ВТ_НовыеРодителиУточненные КАК ВТ_НовыеРодителиУточненные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_НовыеРодителиУточненные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НовыеРодителиСледующийУровень.Класс,
		|	ВТ_НовыеРодителиСледующийУровень.АтрибутКласса,
		|	ВТ_НовыеРодителиСледующийУровень.ЗначениеАтрибутаКласса,
		|	ВТ_НовыеРодителиСледующийУровень.Порядок,
		|	ВТ_СтрокиДляОбработки.ЗначениеАтрибутаКласса КАК НовыйРодительСтроки,
		|	ВТ_ДанныеДляПоискаВИерархии.КлассПоИерархии КАК КлассПоИерархии,
		|	ВТ_ДанныеДляПоискаВИерархии.Уровень
		|ПОМЕСТИТЬ ВТ_НовыеРодителиВременная
		|ИЗ
		|	ВТ_НовыеРодителиСледующийУровень КАК ВТ_НовыеРодителиСледующийУровень
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеДляПоискаВИерархии КАК ВТ_ДанныеДляПоискаВИерархии
		|		ПО ВТ_НовыеРодителиСледующийУровень.Класс = ВТ_ДанныеДляПоискаВИерархии.Класс
		|			И ВТ_НовыеРодителиСледующийУровень.АтрибутКласса = ВТ_ДанныеДляПоискаВИерархии.АтрибутКласса
		|			И ВТ_НовыеРодителиСледующийУровень.ЗначениеАтрибутаКласса = ВТ_ДанныеДляПоискаВИерархии.ЗначениеАтрибутаКласса
		|			И ВТ_НовыеРодителиСледующийУровень.Уровень < ВТ_ДанныеДляПоискаВИерархии.Уровень
		|			И НЕ ВТ_ДанныеДляПоискаВИерархии.Класс = ВТ_ДанныеДляПоискаВИерархии.КлассПоИерархии
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СтрокиДляОбработки КАК ВТ_СтрокиДляОбработки
		|		ПО (ВТ_ДанныеДляПоискаВИерархии.КлассПоИерархии = ВТ_СтрокиДляОбработки.Класс)
		|			И ВТ_НовыеРодителиСледующийУровень.АтрибутКласса = ВТ_СтрокиДляОбработки.АтрибутКласса
		|			И ВТ_НовыеРодителиСледующийУровень.НовыйРодительСтроки = ВТ_СтрокиДляОбработки.РодительСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_НовыеРодителиСледующийУровень
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НовыеРодителиВременная.Класс,
		|	ВТ_НовыеРодителиВременная.АтрибутКласса,
		|	ВТ_НовыеРодителиВременная.ЗначениеАтрибутаКласса,
		|	ВТ_НовыеРодителиВременная.Порядок,
		|	ВТ_НовыеРодителиВременная.НовыйРодительСтроки,
		|	ВТ_НовыеРодителиВременная.КлассПоИерархии,
		|	ВТ_НовыеРодителиВременная.Уровень
		|ПОМЕСТИТЬ ВТ_НовыеРодителиСледующийУровень
		|ИЗ
		|	ВТ_НовыеРодителиВременная КАК ВТ_НовыеРодителиВременная
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_НовыеРодителиВременная";
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВосстановитьНаследованиеДанныеДляЗаменыРодителейСтрок()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВТ_НовыеРодители.ЗначениеАтрибутаКласса,
		|	ВТ_НовыеРодители.НовыйРодительСтроки
		|ИЗ
		|	ВТ_НовыеРодители КАК ВТ_НовыеРодители";
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаПолучитьДублиСтрок()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВТ_НайденныеВИерархииСтроки.Класс,
		|	ВТ_НайденныеВИерархииСтроки.АтрибутКласса,
		|	ВТ_НайденныеВИерархииСтроки.РодительСтроки
		|ПОМЕСТИТЬ ВТ_РодителиСДублями
		|ИЗ
		|	ВТ_НайденныеВИерархииСтроки КАК ВТ_НайденныеВИерархииСтроки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_НайденныеВИерархииСтроки.Класс,
		|	ВТ_НайденныеВИерархииСтроки.РодительСтроки,
		|	ВТ_НайденныеВИерархииСтроки.АтрибутКласса
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_НайденныеВИерархииСтроки.ЗначениеАтрибутаКласса) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НайденныеВИерархииСтроки.Класс,
		|	ВТ_НайденныеВИерархииСтроки.АтрибутКласса,
		|	ВТ_НайденныеВИерархииСтроки.ЗначениеАтрибутаКласса,
		|	ВТ_НайденныеВИерархииСтроки.РодительСтроки,
		|	ВТ_НайденныеВИерархииСтроки.Порядок
		|ПОМЕСТИТЬ ВТ_ДублиСтрок
		|ИЗ
		|	ВТ_НайденныеВИерархииСтроки КАК ВТ_НайденныеВИерархииСтроки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РодителиСДублями КАК ВТ_РодителиСДублями
		|		ПО ВТ_НайденныеВИерархииСтроки.Класс = ВТ_РодителиСДублями.Класс
		|			И ВТ_НайденныеВИерархииСтроки.АтрибутКласса = ВТ_РодителиСДублями.АтрибутКласса
		|			И ВТ_НайденныеВИерархииСтроки.РодительСтроки = ВТ_РодителиСДублями.РодительСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НайденныеВИерархииСтроки.Класс,
		|	ВТ_НайденныеВИерархииСтроки.АтрибутКласса,
		|	ВТ_НайденныеВИерархииСтроки.ЗначениеАтрибутаКласса,
		|	ВТ_НайденныеВИерархииСтроки.РодительСтрокиВыше КАК РодительСтроки,
		|	ВТ_СтрокиДляОбработки.РодительСтроки КАК РодительСтрокиВыше,
		|	ВТ_ДанныеДляПоискаВИерархии.КлассПоИерархии,
		|	ВТ_НайденныеВИерархииСтроки.Порядок
		|ПОМЕСТИТЬ ВТ_НайденныеВИерархииСтрокиВыше
		|ИЗ
		|	ВТ_НайденныеВИерархииСтроки КАК ВТ_НайденныеВИерархииСтроки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеДляПоискаВИерархии КАК ВТ_ДанныеДляПоискаВИерархии
		|		ПО ВТ_НайденныеВИерархииСтроки.Класс = ВТ_ДанныеДляПоискаВИерархии.Класс
		|			И ВТ_НайденныеВИерархииСтроки.АтрибутКласса = ВТ_ДанныеДляПоискаВИерархии.АтрибутКласса
		|			И ВТ_НайденныеВИерархииСтроки.ЗначениеАтрибутаКласса = ВТ_ДанныеДляПоискаВИерархии.ЗначениеАтрибутаКласса
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СтрокиДляОбработки КАК ВТ_СтрокиДляОбработки
		|		ПО (ВТ_ДанныеДляПоискаВИерархии.КлассПоИерархии = ВТ_СтрокиДляОбработки.Класс)
		|			И (ВТ_ДанныеДляПоискаВИерархии.АтрибутКласса = ВТ_СтрокиДляОбработки.АтрибутКласса)
		|			И ВТ_НайденныеВИерархииСтроки.РодительСтрокиВыше = ВТ_СтрокиДляОбработки.ЗначениеАтрибутаКласса
		|			И (НЕ ВТ_ДанныеДляПоискаВИерархии.КлассПоИерархии = ВТ_ДанныеДляПоискаВИерархии.Класс)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_НайденныеВИерархииСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_СписокРодителей";
	Возврат ТекстЗапроса;
	
КонецФункции // 

Функция ТекстЗапросаПолучитьДублиСтрокВыше()
	
	ТекстЗапроса = 
		"УНИЧТОЖИТЬ ВТ_РодителиСДублями
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НайденныеВИерархииСтроки.Класс,
		|	ВТ_НайденныеВИерархииСтроки.АтрибутКласса,
		|	ВТ_НайденныеВИерархииСтроки.РодительСтроки
		|ПОМЕСТИТЬ ВТ_РодителиСДублями
		|ИЗ
		|	ВТ_НайденныеВИерархииСтрокиВыше КАК ВТ_НайденныеВИерархииСтроки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_НайденныеВИерархииСтроки.Класс,
		|	ВТ_НайденныеВИерархииСтроки.РодительСтроки,
		|	ВТ_НайденныеВИерархииСтроки.АтрибутКласса
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_НайденныеВИерархииСтроки.ЗначениеАтрибутаКласса) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НайденныеВИерархииСтроки.Класс,
		|	ВТ_НайденныеВИерархииСтроки.АтрибутКласса,
		|	ВТ_НайденныеВИерархииСтроки.ЗначениеАтрибутаКласса,
		|	ВТ_НайденныеВИерархииСтроки.РодительСтроки,
		|	ВТ_НайденныеВИерархииСтроки.Порядок
		|ПОМЕСТИТЬ ВТ_ДублиСтрокОбъединение
		|ИЗ
		|	ВТ_НайденныеВИерархииСтрокиВыше КАК ВТ_НайденныеВИерархииСтроки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РодителиСДублями КАК ВТ_РодителиСДублями
		|		ПО ВТ_НайденныеВИерархииСтроки.Класс = ВТ_РодителиСДублями.Класс
		|			И ВТ_НайденныеВИерархииСтроки.АтрибутКласса = ВТ_РодителиСДублями.АтрибутКласса
		|			И ВТ_НайденныеВИерархииСтроки.РодительСтроки = ВТ_РодителиСДублями.РодительСтроки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ДублиСтрок.Класс,
		|	ВТ_ДублиСтрок.АтрибутКласса,
		|	ВТ_ДублиСтрок.ЗначениеАтрибутаКласса,
		|	ВТ_ДублиСтрок.РодительСтроки,
		|	ВТ_ДублиСтрок.Порядок
		|ИЗ
		|	ВТ_ДублиСтрок КАК ВТ_ДублиСтрок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ДублиСтрок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДублиСтрокОбъединение.Класс,
		|	ВТ_ДублиСтрокОбъединение.АтрибутКласса,
		|	ВТ_ДублиСтрокОбъединение.ЗначениеАтрибутаКласса,
		|	ВТ_ДублиСтрокОбъединение.РодительСтроки,
		|	ВТ_ДублиСтрокОбъединение.Порядок
		|ПОМЕСТИТЬ ВТ_ДублиСтрок
		|ИЗ
		|	ВТ_ДублиСтрокОбъединение КАК ВТ_ДублиСтрокОбъединение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ДублиСтрокОбъединение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НайденныеВИерархииСтрокиВыше.Класс,
		|	ВТ_НайденныеВИерархииСтрокиВыше.АтрибутКласса,
		|	ВТ_НайденныеВИерархииСтрокиВыше.ЗначениеАтрибутаКласса,
		|	ВТ_НайденныеВИерархииСтрокиВыше.РодительСтроки,
		|	ВТ_НайденныеВИерархииСтрокиВыше.РодительСтрокиВыше,
		|	ВТ_НайденныеВИерархииСтрокиВыше.КлассПоИерархии,
		|	ВТ_НайденныеВИерархииСтрокиВыше.Порядок
		|ПОМЕСТИТЬ ВТ_НайденныеВИерархииСтрокиВрем
		|ИЗ
		|	ВТ_НайденныеВИерархииСтрокиВыше КАК ВТ_НайденныеВИерархииСтрокиВыше
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_НайденныеВИерархииСтрокиВыше
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НайденныеВИерархииСтроки.Класс,
		|	ВТ_НайденныеВИерархииСтроки.АтрибутКласса,
		|	ВТ_НайденныеВИерархииСтроки.ЗначениеАтрибутаКласса,
		|	ВТ_НайденныеВИерархииСтроки.РодительСтрокиВыше КАК РодительСтроки,
		|	ВТ_СтрокиДляОбработки.РодительСтроки КАК РодительСтрокиВыше,
		|	ВТ_ДанныеДляПоискаВИерархии.КлассПоИерархии,
		|	ВТ_ДанныеДляПоискаВИерархии.Порядок
		|ПОМЕСТИТЬ ВТ_НайденныеВИерархииСтрокиВыше
		|ИЗ
		|	ВТ_НайденныеВИерархииСтрокиВрем КАК ВТ_НайденныеВИерархииСтроки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеДляПоискаВИерархии КАК ВТ_ДанныеДляПоискаВИерархии
		|		ПО ВТ_НайденныеВИерархииСтроки.Класс = ВТ_ДанныеДляПоискаВИерархии.Класс
		|			И ВТ_НайденныеВИерархииСтроки.АтрибутКласса = ВТ_ДанныеДляПоискаВИерархии.АтрибутКласса
		|			И ВТ_НайденныеВИерархииСтроки.ЗначениеАтрибутаКласса = ВТ_ДанныеДляПоискаВИерархии.ЗначениеАтрибутаКласса
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СтрокиДляОбработки КАК ВТ_СтрокиДляОбработки
		|		ПО (ВТ_ДанныеДляПоискаВИерархии.КлассПоИерархии = ВТ_СтрокиДляОбработки.Класс)
		|			И (ВТ_ДанныеДляПоискаВИерархии.АтрибутКласса = ВТ_СтрокиДляОбработки.АтрибутКласса)
		|			И ВТ_НайденныеВИерархииСтроки.РодительСтрокиВыше = ВТ_СтрокиДляОбработки.ЗначениеАтрибутаКласса
		|			И (НЕ ВТ_ДанныеДляПоискаВИерархии.КлассПоИерархии = ВТ_ДанныеДляПоискаВИерархии.Класс)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_НайденныеВИерархииСтрокиВрем";
	Возврат ТекстЗапроса;
	
КонецФункции // 
	
#КонецОбласти
