#Область СлужебныеПроцедурыИФункции

&ИзменениеИКонтроль("ПриОпределенииОбъектовСКомандамиПечати")
Процедура Расш_гкс_ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов)

	СписокОбъектов.Добавить(Справочники.ДоговорыКонтрагентов);
	СписокОбъектов.Добавить(Справочники.Контрагенты);
	СписокОбъектов.Добавить(Справочники.Номенклатура);
	СписокОбъектов.Добавить(Справочники.Сотрудники);
	СписокОбъектов.Добавить(Справочники.торо_ИдентификаторыТехКарт);
	СписокОбъектов.Добавить(Справочники.торо_ОбъектыРемонта);
	СписокОбъектов.Добавить(Справочники.ФизическиеЛица);
	СписокОбъектов.Добавить(Справочники.торо_СписокОбъектовРегламентногоМероприятия);

	СписокОбъектов.Добавить(Документы.ВнутреннееПотреблениеТоваров);
	СписокОбъектов.Добавить(Документы.ЗаказНаВнутреннееПотребление);
	СписокОбъектов.Добавить(Документы.КадровыйПеревод);
	СписокОбъектов.Добавить(Документы.ОприходованиеИзлишковТоваров);
	СписокОбъектов.Добавить(Документы.ПеремещениеТоваров);
	СписокОбъектов.Добавить(Документы.ПоступлениеТоваровУслуг);
	СписокОбъектов.Добавить(Документы.ПриемНаРаботу);
	СписокОбъектов.Добавить(Документы.СписаниеНедостачТоваров);
	СписокОбъектов.Добавить(Документы.Увольнение);

	СписокОбъектов.Добавить(Документы.торо_АктОВыполненииРегламентногоМероприятия);
	СписокОбъектов.Добавить(Документы.торо_АктОВыполненииЭтапаРабот);
	СписокОбъектов.Добавить(Документы.торо_АктПриемкиОборудования);
	СписокОбъектов.Добавить(Документы.торо_ВводНачальныхДанных);
	СписокОбъектов.Добавить(Документы.торо_ВнешнееОснованиеДляРабот);
	СписокОбъектов.Добавить(Документы.торо_ВыбытиеОбъектаРемонта);
	СписокОбъектов.Добавить(Документы.торо_ВыявленныеДефекты);
	СписокОбъектов.Добавить(Документы.торо_ГрафикРегламентныхМероприятийТОиР);
	СписокОбъектов.Добавить(Документы.торо_ЗакрытиеЗаявокИРемонтов);
	СписокОбъектов.Добавить(Документы.торо_ЗаявкаНаРемонт);
	СписокОбъектов.Добавить(Документы.торо_ИзменениеПоложенияВСтруктуреИерархии);
	СписокОбъектов.Добавить(Документы.торо_ИзменениеСоставаРемонтнойБригады);

	СписокОбъектов.Добавить(Документы.торо_КомиссионноеРассмотрение);
	СписокОбъектов.Добавить(Документы.торо_НарядНаВыполнениеРемонтныхРабот);
	СписокОбъектов.Добавить(Документы.торо_НарядНаРегламентноеМероприятие);
	СписокОбъектов.Добавить(Документы.торо_НастройкаРегистрацииНаработкиЗависимыхОР);
	СписокОбъектов.Добавить(Документы.торо_ОстановочныеРемонты);
	СписокОбъектов.Добавить(Документы.торо_ОценкаРаботыПодрядчика);
	СписокОбъектов.Добавить(Документы.торо_ПланГрафикРемонта);
	СписокОбъектов.Добавить(Документы.торо_ПринятиеОРКУчету);
	СписокОбъектов.Добавить(Документы.торо_ПрисвоениеКвалификацийСотрудникам);
	СписокОбъектов.Добавить(Документы.торо_РегистрацияЗначенийВнешнихПоказателейKPI);
	СписокОбъектов.Добавить(Документы.торо_СостоянияОбъектовРемонта);

	СписокОбъектов.Добавить(Документы.торо_УстановкаАналоговНоменклатурыДляРемонтов);
	СписокОбъектов.Добавить(Документы.торо_УстановкаКоэффициентовПереводаСтоимостейРемонтов);
	СписокОбъектов.Добавить(Документы.торо_УстановкаКоэффициентовРемонтныхОсобенностей);
	СписокОбъектов.Добавить(Документы.торо_УстановкаЛимитаНаПлановыеРемонтныеРаботы);
	СписокОбъектов.Добавить(Документы.торо_УстановкаМинимальногоОстаткаНоменклатуры);
	СписокОбъектов.Добавить(Документы.торо_УстановкаПроизвольногоЗначенияНаработки);
	СписокОбъектов.Добавить(Документы.торо_УстановкаСтоимостейКвалификаций);
	СписокОбъектов.Добавить(Документы.торо_УстановкаЦелевыхЗначенийПоказателейKPI);
	СписокОбъектов.Добавить(Документы.торо_УчетКонтролируемыхПоказателей);
	СписокОбъектов.Добавить(Документы.торо_УчетНаработкиОборудования);

	#Вставка
	СписокОбъектов.Добавить(Документы.гкс_ЕВОБланк);
	#КонецВставки

КонецПроцедуры

#КонецОбласти