
&НаСервере
Процедура Расш_гкс_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// гкс+ [Часовые пояса] Куст 09.04.2020
	Сдвиг = Час(ТекущаяДатаСеанса()) - Час(ТекущаяДата());
	ТекстыЗамены = Новый Массив();
	ТекстыЗамены.Добавить(Новый Структура("До, После", "Документторо_НарядНаВыполнениеРемонтныхРабот.Дата,",
		"ДобавитьКДате(Документторо_НарядНаВыполнениеРемонтныхРабот.Дата, Час, " + Сдвиг + ") КАК Дата,"));
	Список.ТекстЗапроса = гкс_ЧасовыеПоясаВызовСервера.ИзменитьТекстЗапросаФормыСписка(
		Список.ТекстЗапроса, ТекстыЗамены);
	// гкс- [Часовые пояса] Куст 09.04.2020
КонецПроцедуры
