
#Область ОбработчикиСобытий

 &Перед("ОбработкаПолученияФормы")
Процедура гкс_ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	// Гкс+[TOIR20-669] Оселедько В.С. от 31.07.2025. Добавлено:{
	Если ВидФормы = "Форма" Тогда
		
		ВремяНачала = ОценкаПроизводительности.НачатьЗамерВремени();
		Параметры.Вставить("ВремяНачалаОткрытияФормы", ВремяНачала);
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма = Метаданные.Обработки.торо_РабочееМестоТехническогоСпециалиста.ОсновнаяФорма.Имя;		
		
	КонецЕсли;	
	
КонецПроцедуры // Гкс+[TOIR20-669]

#КонецОбласти