
&Вместо("ПолучитьТаблицуСоответствияIDРемонтовIDКорректировок")
Функция гкс_ПолучитьТаблицуСоответствияIDРемонтовIDКорректировок()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Период КАК Период,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Регистратор КАК Регистратор,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Организация КАК Организация,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ID КАК ID,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаНачалаРемонтныхРабот КАК ДатаНачалаРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаОкончанияРемонтныхРабот КАК ДатаОкончанияРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Исполнитель КАК Исполнитель,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.СпособВыполнения КАК СпособВыполнения,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Отменен КАК Отменен,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ID_базы_расчета КАК ID_базы_расчета,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Замещен КАК Замещен,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ID_замещающего КАК ID_замещающего,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаНачалаРасчетная КАК ДатаНачалаРасчетная,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.СтоимостьРемонта КАК СтоимостьРемонта,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Подразделение КАК Подразделение
	|ИЗ
	|	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(
	|			,
	|			ID В (&СписокID)
	|				И Регистратор <> &Ссылка) КАК торо_ПлановыеРемонтныеРаботыСрезПоследних
	|ГДЕ
	|	НЕ торо_ПлановыеРемонтныеРаботыСрезПоследних.Замещен
	|	И НЕ торо_ПлановыеРемонтныеРаботыСрезПоследних.Отменен";
	
	Запрос.УстановитьПараметр("СписокID", ЗакрываемыеРемонты.ВыгрузитьКолонку("ID"));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&После("ОбработкаПроведения")
Процедура гкс_ОбработкаПроведения(Отказ, РежимПроведения)
	// гкс+ [09.22] Деснол 12.09.2022
	// гкс+ [11.22] Деснол 17.11.2022
	МассивПеренесенных = Новый Массив();
	// гкс- [11.22] Деснол 17.11.2022
	МассивЗакрытых = Новый Массив();
	Для Каждого СтрокаТаблицы Из ЗакрываемыеРемонты Цикл
		Если СтрокаТаблицы.Отменен Тогда 
			МассивЗакрытых.Добавить(СтрокаТаблицы.ID);
			// гкс+ [11.22] Деснол 17.11.2022
		ИначеЕсли СтрокаТаблицы.Перенесен Тогда 
			МассивПеренесенных.Добавить(СтрокаТаблицы.ID);
			// гкс- [11.22] Деснол 17.11.2022
		КонецЕсли;
	КонецЦикла;
	Если МассивЗакрытых.Количество() Тогда 
		Запрос = Новый Запрос();
		Запрос.Текст = "Выбрать Различные
		|	РегистрСведенийторо_ВнешниеОснованияДляРабот.ID КАК ИД,
		|	РегистрСведенийторо_ВнешниеОснованияДляРабот.Регистратор КАК Ссылка
		|ИЗ
		|	РегистрСведений.торо_ВнешниеОснованияДляРабот КАК РегистрСведенийторо_ВнешниеОснованияДляРабот
		|Где РегистрСведенийторо_ВнешниеОснованияДляРабот.ID В (&ИД)
		|	И РегистрСведенийторо_ВнешниеОснованияДляРабот.Регистратор ССЫЛКА Документ.торо_ВнешнееОснованиеДляРабот
		|";
		Запрос.УстановитьПараметр("ИД", МассивЗакрытых);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда 
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				НаборЗаписей = РегистрыСведений.торо_СтатусыДокументовВнешнихОснований.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Период = Дата;
				НоваяЗапись.Регистратор = Ссылка;
				НоваяЗапись.ИзменяемыйДокумент = Выборка.Ссылка;
				НоваяЗапись.СтатусДокумента = Перечисления.торо_СтатусыДокументов.Отклонен;
				НоваяЗапись.СтатусУстановлен = Истина;
				НаборЗаписей.Записать();
				//
				НаборЗаписей = РегистрыСведений.торо_СтатусыДокументовВнешнихОснованийУстановленные.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Период = Дата;
				НоваяЗапись.Регистратор = Ссылка;
				НоваяЗапись.ИзменяемыйДокумент = Выборка.Ссылка;
				НоваяЗапись.СтатусДокумента = Перечисления.торо_СтатусыДокументов.Отклонен;
				НаборЗаписей.Записать();
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	// гкс- [09.22] Деснол 12.09.2022
	// гкс+ [11.22] Деснол 17.11.2022
	Если МассивПеренесенных.Количество() Тогда
		СобытиеСсылка = Константы.гкс_СобытиеПереносРемонтаЗаявки.Получить();
		Если ЗначениеЗаполнено(СобытиеСсылка) Тогда 
		// найти заявки по ремонтам и сформировать уведомления
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	РегистрСведенийторо_ЗаявкиПоРемонтам.IDРемонта КАК ИД,
		               |	МАКСИМУМ(РегистрСведенийторо_ЗаявкиПоРемонтам.Регистратор) КАК Ссылка
		               |ИЗ
		               |	РегистрСведений.торо_ЗаявкиПоРемонтам КАК РегистрСведенийторо_ЗаявкиПоРемонтам
		               |ГДЕ
		               |	РегистрСведенийторо_ЗаявкиПоРемонтам.IDРемонта В(&ИД)
		               |	И РегистрСведенийторо_ЗаявкиПоРемонтам.Регистратор ССЫЛКА Документ.торо_ЗаявкаНаРемонт
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РегистрСведенийторо_ЗаявкиПоРемонтам.IDРемонта";
		Запрос.УстановитьПараметр("ИД", МассивПеренесенных);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда 
			
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				МассивСвойств = Новый Массив();
				НайдСтр = ЗакрываемыеРемонты.НайтиСтроки(Новый Структура("ID", Выборка.ИД));
				Если НайдСтр.Количество() > 0 Тогда 
					МассивСвойств.Добавить(Новый Структура("Ключ,Значение", "НоваяДатаНачала", НайдСтр[0].НоваяДатаНачала));
					МассивСвойств.Добавить(Новый Структура("Ключ,Значение", "НоваяДатаОкончания", НайдСтр[0].НоваяДатаОкончания));
				КонецЕсли;
				торо_РаботаСУведомлениями.гкс_ЗаписатьУведомленияСрокаСогласования(Выборка.Ссылка, СобытиеСсылка, Новый Массив(), , МассивСвойств);
			КонецЦикла;
		КонецЕсли;
		//
		КонецЕсли;
	КонецЕсли;
	// гкс- [11.22] Деснол 17.11.2022
КонецПроцедуры

&После("ПередЗаписью")
Процедура гкс_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР", "ОсновнойОтветственный");
		Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
			Ответственный = Пользователи.ТекущийПользователь();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
