#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьДосутпностьЭлементов();
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура торо_ИспользоватьТиповыеОРПриИзменении(Элемент)
	
	Элементы.торо_ИспользоватьКартинкиТиповыхОбъектов.Доступность = Объект.торо_ИспользоватьТиповыеОР;
	
	Если НЕ Объект.торо_ИспользоватьТиповыеОР Тогда 
		Объект.торо_ИспользоватьКартинкиТиповыхОбъектов = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура торо_ИспользоватьГарантииПриИзменении(Элемент)
	
	Элементы.торо_ЗапретитьРемонтГарантийногоОборудованияХозспособом.Доступность = Объект.торо_ИспользоватьГарантии;
	
	Если НЕ Объект.торо_ИспользоватьГарантии Тогда 
		Объект.торо_ЗапретитьРемонтГарантийногоОборудованияХозспособом = Ложь;		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура торо_УчетКонтролируемыхПоказателейПриИзменении(Элемент)
	
	Элементы.торо_ИспользоватьРемонтыПоСостоянию.Доступность = Объект.торо_УчетКонтролируемыхПоказателей;
	Элементы.торо_ИспользоватьСтандартныеОповещенияОПревышенииПоказателей.Доступность = Объект.торо_УчетКонтролируемыхПоказателей;
	
	Если НЕ Объект.торо_УчетКонтролируемыхПоказателей Тогда 
		Объект.торо_ИспользоватьРемонтыПоСостоянию = Ложь;
		Объект.торо_ИспользоватьСтандартныеОповещенияОПревышенииПоказателей = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура торо_УчетСостоянияОборудованияПриИзменении(Элемент)
	
	Элементы.торо_УчетПусковОборудования.Доступность = Объект.торо_УчетСостоянияОборудования;
	Элементы.торо_НапоминатьЗафиксироватьПростой.Доступность = Объект.торо_УчетСостоянияОборудования;
	
	Если НЕ Объект.торо_УчетСостоянияОборудования Тогда 
		Объект.торо_УчетПусковОборудования = Ложь;
		Объект.торо_НапоминатьЗафиксироватьПростой = Ложь;
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура торо_УчетВыявленныхДефектовОборудованияПриИзменении(Элемент)
	
	Элементы.торо_ИспользоватьУпрощеннуюФормуДефекта.Доступность = Объект.торо_УчетВыявленныхДефектовОборудования;
	Элементы.торо_НазначениеНаРемонтСУчетомРисков.Доступность = Объект.торо_УчетВыявленныхДефектовОборудования;
	
	Если НЕ Объект.торо_УчетВыявленныхДефектовОборудования Тогда 
		Объект.торо_ИспользоватьУпрощеннуюФормуДефекта = Ложь;
		Объект.торо_НазначениеНаРемонтСУчетомРисков = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура торо_ИспользоватьППРПриИзменении(Элемент)
	 	
	Элементы.торо_ИспользоватьФоновыйРасчетППР.Доступность = Объект.торо_ИспользоватьППР;
	
	Если НЕ Объект.торо_ИспользоватьППР Тогда 
		Объект.торо_ИспользоватьФоновыйРасчетППР = Ложь;
		Объект.торо_НеПересчитыватьППРВФонеПослеОшибки = Ложь;
		Элементы.торо_НеПересчитыватьППРВФонеПослеОшибки.Доступность = Объект.торо_ИспользоватьФоновыйРасчетППР;
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура торо_ИспользоватьФоновыйРасчетППРПриИзменении(Элемент)
	
	Элементы.торо_НеПересчитыватьППРВФонеПослеОшибки.Доступность = Объект.торо_ИспользоватьФоновыйРасчетППР;
	Если НЕ Объект.торо_ИспользоватьФоновыйРасчетППР Тогда
		Объект.торо_НеПересчитыватьППРВФонеПослеОшибки = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура торо_ИспользованиеЛимитовРемонтовПриИзменении(Элемент)
	
	Элементы.торо_ИспользоватьОценкиРМ.Доступность = Объект.торо_ИспользованиеЛимитовРемонтов;
	
	Если НЕ Объект.торо_ИспользованиеЛимитовРемонтов Тогда 
		Объект.торо_ИспользоватьОценкиРМ = Ложь;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура торо_ИспользоватьНарядыНаВыполнениеРаботПриИзменении(Элемент)
	
	Элементы.торо_ИспользоватьНарядДопускНаРаботыПовышеннойОпасностиОбязательно.Доступность = Объект.торо_ИспользоватьНарядыНаВыполнениеРабот;
	
	Если НЕ Объект.торо_ИспользоватьНарядыНаВыполнениеРабот Тогда 
		Объект.торо_ИспользоватьНарядДопускНаРаботыПовышеннойОпасностиОбязательно = Ложь;
	КонецЕсли; 
		
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере 
Процедура УстановитьДосутпностьЭлементов()
	
	Элементы.торо_ЗапретитьРемонтГарантийногоОборудованияХозспособом.Доступность            = Объект.торо_ИспользоватьГарантии;
	Элементы.торо_ИспользоватьКартинкиТиповыхОбъектов.Доступность                           = Объект.торо_ИспользоватьТиповыеОР;
	Элементы.торо_ИспользоватьРемонтыПоСостоянию.Доступность                                = Объект.торо_УчетКонтролируемыхПоказателей;
	Элементы.торо_ИспользоватьСтандартныеОповещенияОПревышенииПоказателей.Доступность       = Объект.торо_УчетКонтролируемыхПоказателей;
	Элементы.торо_УчетПусковОборудования.Доступность                                        = Объект.торо_УчетСостоянияОборудования;
	Элементы.торо_НапоминатьЗафиксироватьПростой.Доступность                                = Объект.торо_УчетСостоянияОборудования;
	Элементы.торо_ИспользоватьУпрощеннуюФормуДефекта.Доступность                            = Объект.торо_УчетВыявленныхДефектовОборудования;
	Элементы.торо_НазначениеНаРемонтСУчетомРисков.Доступность 								= Объект.торо_УчетВыявленныхДефектовОборудования;
	Элементы.торо_ИспользоватьФоновыйРасчетППР.Доступность                                  = Объект.торо_ИспользоватьППР;
	Элементы.торо_НеПересчитыватьППРВФонеПослеОшибки.Доступность 							= Объект.торо_ИспользоватьФоновыйРасчетППР;
	Элементы.торо_ИспользоватьОценкиРМ.Доступность                                          = Объект.торо_ИспользованиеЛимитовРемонтов;
	Элементы.торо_ИспользоватьНарядДопускНаРаботыПовышеннойОпасностиОбязательно.Доступность = Объект.торо_ИспользоватьНарядыНаВыполнениеРабот;
	
КонецПроцедуры

#КонецОбласти




