#Область ОбработчикиСобытийФормы

&НаСервере
Процедура Расш_гкс_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// гкс+ [Часовые пояса] Куст 15.04.2020
	гкс_ЧасовыеПоясаВызовСервера.ДобавитьНовыеЭлементы(ЭтаФорма, Элементы.ДатаИНомер,
		Новый Структура("гкс_РеквизитыДаты", "Дата,ОбъектыРемонта.ДатаНачала,ОбъектыРемонта.ДатаОкончания"));
	// гкс- [Часовые пояса] Куст 15.04.2020
	// гкс+ [03.23] Деснол 13.03.2023
	Если Не РольДоступна("гкс_РедактированиеЗаявкиНаРемонт") Тогда 
		Элементы.Дата.ТолькоПросмотр = Истина;
	КонецЕсли;
	// гкс- [03.23] Деснол 13.03.2023
КонецПроцедуры

&НаСервере
Процедура Расш_гкс_ПриЧтенииНаСервереПосле(ТекущийОбъект)
	// гкс+ [Часовые пояса] Куст 15.04.2020
	СтруктураПроверки = Новый Структура("гкс_СдвигЧП", Неопределено);
	ЗаполнитьЗначенияСвойств(СтруктураПроверки, ЭтотОбъект);
	Если Не СтруктураПроверки.гкс_СдвигЧП = Неопределено Тогда 
		гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПКлиента(ЭтаФорма,, Объект);
	КонецЕсли;
	// гкс- [Часовые пояса] Куст 15.04.2020
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере(ДатаКлиента)
	Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда 
		Объект.Дата = ТекущаяДата();
	КонецЕсли;
	// гкс+ [Часовые пояса] Куст 14.04.2020
	гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПКлиента(ЭтаФорма,,,);
	// Заголовок формы++
	торо_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(Объект, ЭтаФорма, "");
	// Заголовок формы--
	// гкс- [Часовые пояса] Куст 14.04.2020
КонецПроцедуры

&НаКлиенте
Процедура Расш_гкс_ПриОткрытииПосле(Отказ)
	ПриОткрытииНаСервере(ТекущаяДата());
КонецПроцедуры

&НаСервере
Процедура Расш_гкс_ПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// гкс+ [Часовые пояса] Куст 15.04.2020
	гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПСервера(ЭтаФорма,, ТекущийОбъект);
	// гкс- [Часовые пояса] Куст 15.04.2020
КонецПроцедуры

&НаСервере
Процедура Расш_гкс_ПриЗаписиНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// гкс+ [Часовые пояса] Куст 15.04.2020
	гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПКлиента(ЭтаФорма,, ТекущийОбъект);
	// гкс- [Часовые пояса] Куст 15.04.2020
КонецПроцедуры

#КонецОбласти