#Область ОбработчикиСобытийФормы
&НаСервере
Процедура Расш_гкс_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Наряд") И Параметры.Наряд = Истина
		или Параметры.Свойство("НарядРегламентный") И Параметры.НарядРегламентный = Истина Тогда
		Элементы.ЗаполнятьПериодИВремяРабот.Видимость = Истина;
		ЗаполнятьПериодИВремяРабот = Ложь;
	КонецЕсли;
	// гкс+ [03.23] Деснол 13.03.2023
	дс_ДобавитьНовыеЭлементы();
	// гкс- [03.23] Деснол 13.03.2023
КонецПроцедуры

// гкс+ [03.23] Деснол 13.03.2023
&НаСервере
Процедура дс_ДобавитьНовыеЭлементы()
	НоваяКоманда = Команды.Добавить("гкс_ВыделитьЧерезОдного");
	НоваяКоманда.Действие = "гкс_ВыделитьЧерезОдного";
	НоваяКоманда.Заголовок = "Выделить через строку";
	//
	НоваяКнопка = Элементы.Добавить("гкс_ВыделитьЧерезОдногоКнопка", Тип("КнопкаФормы"), Элементы.ДеревоИсполнителейКоманднаяПанель);
	НоваяКнопка.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НоваяКнопка.ИмяКоманды = "гкс_ВыделитьЧерезОдного";
КонецПроцедуры // гкс- [03.23] Деснол 13.03.2023

// гкс+ [03.23] Деснол 13.03.2023
&НаКлиенте
Процедура гкс_ВыделитьЧерезОдного(Команда)
	Корень = ДеревоИсполнителей.ПолучитьЭлементы();
	Для Каждого Ур0 Из Корень Цикл
		Ветвь0 = Ур0.ПолучитьЭлементы();
		Для Каждого Ур1 Из Ветвь0 Цикл
			Ветвь1 = Ур1.ПолучитьЭлементы();
			Для Каждого Ур2 Из Ветвь1 Цикл
				Включить = Истина;
				Ветвь = Ур2.ПолучитьЭлементы();
				Для Каждого Ур3 Из Ветвь Цикл
					Ур3.Выбран = Включить;
					Включить = Не Включить;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры // гкс- [03.23] Деснол 13.03.2023

#КонецОбласти