#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Перем СписокОтбора;

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПЕРЕМЕННЫЕ

перем СтруктураДанных Экспорт; // Содержит структуру данных о статусе документа (Начальный, СогласованиеЗавершено, ПроводитьДокумент, ШаблонСообщенияЭлектроннойПочты) 
										 // из регистра сведений торо_МатрицаПереходаСтатусовДокументов. 
Перем БезусловнаяЗапись Экспорт; // Отключает проверки при записи документа

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот") Тогда
		
		ДатаОбнаружения = Основание.Дата;
		Инициатор = Основание.Ответственный;
		Организация = Основание.Организация;
		Подразделение = Основание.Подразделение;
		ДокументыОснования.Добавить().ДокументОснование = Основание;
		Комиссия = Основание.Комиссия;
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.торо_СостоянияОбъектовРемонта") Тогда 
		
		ДатаОбнаружения = Основание.Дата;
		Инициатор = Основание.Ответственный;
		Организация = Основание.Организация;
		Подразделение = Основание.Подразделение;
		ДокументыОснования.Добавить().ДокументОснование = Основание;
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.торо_УчетКонтролируемыхПоказателей") Тогда
		
		ДатаОбнаружения = Основание.Дата;
		Инициатор = Основание.Ответственный;
		Организация = Основание.Организация;
		Подразделение = Основание.Подразделение;		
		ДокументыОснования.Добавить().ДокументОснование = Основание;
		
		ДокументОснование = Основание.Ссылка;
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.торо_АктОВыполненииРегламентногоМероприятия") Тогда
		
		ДатаОбнаружения = Основание.Дата;
		Инициатор = Основание.Ответственный;
		Организация = Основание.Организация;
		Подразделение = Основание.Подразделение;        
		ДокументыОснования.Добавить().ДокументОснование = Основание;
		
		ДефектВыявленВПроцессе = Основание.Ссылка;
		
	ИначеЕсли ТипЗнч(Основание) = Тип("Структура") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Основание);
		
		Если Основание.Свойство("ДанныеДокументаПриСозданииПоСостоянию") Тогда
			
			Если Основание.ДанныеДокументаПриСозданииПоСостоянию <> Неопределено Тогда
				ЗаполнитьДокументПараметрамиДефектаПриСозданииПоСостоянию(Основание.ДанныеДокументаПриСозданииПоСостоянию);
			КонецЕсли;
			
		ИначеЕсли Основание.Свойство("ОбъектРемонта") И НЕ Основание.Свойство("МассивСтрокТЧ") Тогда
			
			ОбъектРемонта = Основание.ОбъектРемонта;
			НоваяСтрока = СписокДефектов.Добавить();
			НоваяСтрока.ОбъектРемонта = ОбъектРемонта;
			НоваяСтрока.ПодразделениеИсполнитель = ОбъектРемонта.ПодразделениеИсполнитель;
			НоваяСтрока.ОтказавшийЭлемент = ОбъектРемонта;
			
		КонецЕсли;
		
		Если Основание.Свойство("МассивСтрокТЧ") Тогда
			Для каждого Строка из Основание.МассивСтрокТЧ Цикл
				НоваяСтрока = СписокДефектов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;

	ЗаполнитьРеквизитыШапкиПоУмолчанию();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Для Каждого Дефект Из СписокДефектов Цикл
		Если Не ЗначениеЗаполнено(Дефект.ID) Тогда
			Дефект.ID = Новый УникальныйИдентификатор;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если СписокДефектов.Количество() = 0 Тогда
		ТекстСообщения = НСтр("es='En la parte tabular ""la Lista de los defectos"" no hay líneas.';ru='В табличной части ""Список дефектов"" нет строк.';en='There are no lines in the tabular part of the ""List of defects"".'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
	КонецЕсли;
	
	Для Каждого ТекСтрокаСписокДефектов Из СписокДефектов Цикл
		
		Если ТекСтрокаСписокДефектов.ОбъектРемонта.Пустая() Тогда
			ТекстСообщения = НСтр("es='de la reparación';ru='Не указан объект ремонта';en='Repair object not specified'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЕсли;
		
		Если ТекСтрокаСписокДефектов.ВидДефекта.Пустая() Тогда
			ШаблонСообщения = НСтр("es='2.';ru='Не указан вид дефекта %1/%2.';en='The type of defect%1 /%2 is not specified.'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекСтрокаСписокДефектов.ОбъектРемонта, ТекСтрокаСписокДефектов.ОтказавшийЭлемент);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.торо_ВыявленныеДефекты.Записывать 	= Истина;
	Движения.торо_Ремонты.Записывать 			= Истина;
	
	Для Каждого ТекСтрокаСписокДефектов Из СписокДефектов Цикл
		
		// регистр сведений торо_ВыявленныеДефекты 
        Движение = Движения.торо_ВыявленныеДефекты.Добавить();
        Движение.ОбъектРемонта                          = ТекСтрокаСписокДефектов.ОбъектРемонта;
        Движение.ОтказавшийЭлемент                      = ТекСтрокаСписокДефектов.ОтказавшийЭлемент;
        Движение.Период                                 = ДатаОбнаружения;
        Движение.ДефектПричина                          = ТекСтрокаСписокДефектов.ДефектПричина;
        Движение.ДефектВыявленВПроцессе                 = ДефектВыявленВПроцессе;
        Движение.ВидДефекта                             = ТекСтрокаСписокДефектов.ВидДефекта;
        Движение.ID                                     = ТекСтрокаСписокДефектов.ID;
        Движение.Организация                            = Организация;
        Движение.Подразделение                          = Подразделение;
        Движение.ПодразделениеИсполнитель               = ТекСтрокаСписокДефектов.ПодразделениеИсполнитель;
        Движение.КритичностьДефекта                     = ТекСтрокаСписокДефектов.КритичностьДефекта;
        Движение.ДефектОписание                         = ТекСтрокаСписокДефектов.ДефектОписание;
        Движение.НаправлениеНаУстранение                = ТекСтрокаСписокДефектов.НаправлениеНаУстранение;
        
        // ФО торо_НазначениеНаРемонтСУчетомРисков
        Движение.ДатаНачалаРемонта                      = ТекСтрокаСписокДефектов.ДатаНачалаРемонта;
        Движение.ДатаОкончанияРемонта                   = ТекСтрокаСписокДефектов.ДатаОкончанияРемонта;
        Движение.КрайняяДопустимаяДатаЗавершенияРемонта = ТекСтрокаСписокДефектов.КрайняяДопустимаяДатаЗавершенияРемонта;
		
		// регистр сведений торо_Ремонты
		Движение = Движения.торо_Ремонты.Добавить();
        Движение.Период                                 = МоментВремени().Дата;
        Движение.ID                                     = ТекСтрокаСписокДефектов.ID;
        Движение.ОбъектРемонта                          = ТекСтрокаСписокДефектов.ОтказавшийЭлемент;
        Движение.ГарантийныйРемонт                      = ТекСтрокаСписокДефектов.ГарантийныйРемонт;
        
        // ФО торо_НазначениеНаРемонтСУчетомРисков
        Движение.ДатаНачалаПлан                         = ТекСтрокаСписокДефектов.ДатаНачалаРемонта;
        Движение.ДатаОкончанияПлан                      = ТекСтрокаСписокДефектов.ДатаОкончанияРемонта;
        Движение.КрайняяДопустимаяДатаЗавершенияРемонта = ТекСтрокаСписокДефектов.КрайняяДопустимаяДатаЗавершенияРемонта;

		
	КонецЦикла;
	
	Если НЕ Отказ Тогда
		УстановитьУправляемыеБлокировки();
	КонецЕсли;
	
	ТаблицаВО = СформироватьТаблицуВнешнихОснований();
	ДвиженияПоРегистру_торо_ВнешниеОснованияДляРабот(РежимПроведения, ТаблицаВО, Отказ);
	
	Движения.торо_СтатусыДокументовВыявленныхДефектов.Записывать = Истина;
	торо_РаботаСоСтатусамиДокументовСервер.УстановитьСтатусДокумента(Ссылка, Ссылка, Движения, Перечисления.торо_СтатусыДокументов.Зарегистрирован);
	торо_РаботаСоСтатусамиДокументовСервер.ИзменитьСтатусыДокументовОснований(Ссылка);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	Если Не Отказ Тогда
		торо_РаботаСоСтатусамиДокументовСервер.ОтменаПроведения(Ссылка);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	РезультатыПодбораИзМатрицыОценкиРисков.Очистить();
	
	Для каждого Строка Из СписокДефектов Цикл
        Строка.ДатаНачалаРемонта                      = Дата("00010101");
        Строка.ДатаОкончанияРемонта                   = Дата("00010101");
        Строка.КрайняяДопустимаяДатаЗавершенияРемонта = Дата("00010101");
		  Строка.ID = Новый УникальныйИдентификатор();
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции
Процедура УстановитьУправляемыеБлокировки()
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.торо_ВнешниеОснованияДляРабот");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = СписокДефектов.Выгрузить(Новый Структура("ЗакрываетПредписание",Истина),"ID");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ID", "ID");
	
	Блокировка.Заблокировать();
	
КонецПроцедуры

Функция СформироватьТаблицуВнешнихОснований()

	ТаблицаОснований = ДокументыОснования.Выгрузить();
	ТаблицаДефектов = СписокДефектов.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаОснований.ДокументОснование КАК ДокументОснование
	               |ПОМЕСТИТЬ ВТ_Основания
	               |ИЗ
	               |	&ТаблицаОснований КАК ТаблицаОснований
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаДефектов.ID КАК ID
	               |ПОМЕСТИТЬ ВТ_Дефекты
	               |ИЗ
	               |	&ТаблицаДефектов КАК ТаблицаДефектов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Основания.ДокументОснование КАК ДокументОснование
	               |ПОМЕСТИТЬ ВТ_ВнешниеОснованияИзОснований
	               |ИЗ
	               |	ВТ_Основания КАК ВТ_Основания
	               |ГДЕ
	               |	ТИПЗНАЧЕНИЯ(ВТ_Основания.ДокументОснование) = ТИП(Документ.торо_ВнешнееОснованиеДляРабот)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	торо_ВнешниеОснованияДляРабот.ОбъектРемонта КАК ОбъектРемонта,
	               |	торо_ВнешниеОснованияДляРабот.ID КАК ID,
	               |	торо_ВнешниеОснованияДляРабот.Описание КАК Описание,
	               |	торо_ВнешниеОснованияДляРабот.ПлановаяДатаРемонта КАК ПлановаяДатаРемонта,
	               |	торо_ВнешниеОснованияДляРабот.Организация КАК Организация,
	               |	торо_ВнешниеОснованияДляРабот.Подразделение КАК Подразделение,
	               |	торо_ВнешниеОснованияДляРабот.РемонтыОборудования_id КАК РемонтыОборудования_id
	               |ИЗ
	               |	ВТ_ВнешниеОснованияИзОснований КАК ВТ_ВнешниеОснованияИзОснований
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВнешниеОснованияДляРабот КАК торо_ВнешниеОснованияДляРабот
	               |		ПО ВТ_ВнешниеОснованияИзОснований.ДокументОснование = торо_ВнешниеОснованияДляРабот.Регистратор
	               |ГДЕ
	               |	торо_ВнешниеОснованияДляРабот.ID В
	               |			(ВЫБРАТЬ
	               |				ВТ_Дефекты.ID КАК ID
	               |			ИЗ
	               |				ВТ_Дефекты КАК ВТ_Дефекты)";
					
	Запрос.УстановитьПараметр("ТаблицаОснований",ТаблицаОснований);
	Запрос.УстановитьПараметр("ТаблицаДефектов",ТаблицаДефектов);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Движения по регистру "Внешние основания для работ", простановка Обработано = Истина
Процедура ДвиженияПоРегистру_торо_ВнешниеОснованияДляРабот(РежимПроведения, ТаблицаВО, Отказ)
	
	Движения.торо_ВнешниеОснованияДляРабот.Очистить();
	Движения.торо_ВнешниеОснованияДляРабот.Записывать = Истина;
	Для каждого ВнешнееОснование Из ТаблицаВО Цикл
		Движение = Движения.торо_ВнешниеОснованияДляРабот.Добавить();
		Движение.Период = Дата;
		Движение.Регистратор = Ссылка;
		Движение.ОбъектРемонта = ВнешнееОснование.ОбъектРемонта;
		Движение.ID = ВнешнееОснование.ID;
		Движение.Описание = ВнешнееОснование.Описание;
		Движение.ПлановаяДатаРемонта = ВнешнееОснование.ПлановаяДатаРемонта;
		Движение.Обработано = Истина;
		Движение.Организация = ВнешнееОснование.Организация;
		Движение.Подразделение = ВнешнееОснование.Подразделение;
		Движение.РемонтыОборудования_id = ВнешнееОснование.РемонтыОборудования_id;
	КонецЦикла; 	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыШапкиПоУмолчанию()
	
	торо_ЗаполнениеДокументов.ЗаполнитьСтандартныеРеквизитыШапкиПоУмолчанию(ЭтотОбъект);
	
	Если НЕ ЗначениеЗаполнено(Инициатор) Тогда
		Инициатор = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР", "ОсновнойИнициаторДефекта");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаОбнаружения) И ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"НастройкиТОиР", "ПодставлятьТекущуюДатуВоВнешнееОснованиеИВыявленныеДефекты", Ложь) Тогда
		ДатаОбнаружения = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДокументПараметрамиДефектаПриСозданииПоСостоянию(СтруктураПараметров)
	
	ПараметрыСобытия = СтруктураПараметров.СтруктураДокументаОснования;
	
	ЭтотОбъект.Дата = ТекущаяДата();
	ЭтотОбъект.ДатаОбнаружения = ПараметрыСобытия.ДатаДокументаИсточник;
	
	Для Каждого КлючИЗначение Из СтруктураПараметров.Шапка Цикл
		ЭтотОбъект[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
	КонецЦикла;
	
	СтрокаДокументаОснования = ЭтотОбъект.ДокументыОснования.Добавить();
	СтрокаДокументаОснования.ДокументОснование = ПараметрыСобытия.ДокументИсточник;	
	
	СтрокаДефекта = ЭтотОбъект.СписокДефектов.Добавить();
	СтрокаДефекта.ID = Новый УникальныйИдентификатор;
	СтрокаДефекта.ГарантийныйРемонт = торо_ГарантийноеОбслуживание.ПолучитьЗначениеФлагаГарантийныйРемонтДляОбъектаРемонта(ПараметрыСобытия.ОбъектРемонта, ЭтотОбъект.ДатаОбнаружения, ЭтотОбъект.ДатаОбнаружения);
	СтрокаДефекта.ДокументИсточник 	= ПараметрыСобытия.ДокументИсточник;
	СтрокаДефекта.ОбъектРемонта 	= ПараметрыСобытия.ОбъектРемонта;
	СтрокаДефекта.ОтказавшийЭлемент = ПараметрыСобытия.ОбъектРемонта;
	
	Если ТипЗнч(ПараметрыСобытия.ДокументИсточник) = Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот") Тогда
		СтрокаДефекта.ВидРемонтов   = Константы.торо_ВидРемонтаПриВводеНаОснованииВнешнихОснований.Получить();
	Иначе
		СтрокаДефекта.ВидРемонтов   = Константы.торо_ВидРемонтаПриВводеНаОснованииВыявленныхДефектов.Получить();
	КонецЕсли;
	
	Для Каждого КлючИЗначение Из СтруктураПараметров.Таблица Цикл
		СтрокаДефекта[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
	
#КонецЕсли