#Область ПрограммныйИнтерфейс

Процедура ПрочитатьЗначенияТабличныхАтрибутов(СписокНоменклатуры, 
											  СписокКлассов = Неопределено, 
											  ДанныеТабличныхАтрибутов, 
											  НовыйИДСтроки = 1, 
											  СоответствиеИДСтрок = Неопределено, 
											  СтрокиТабличныхАтрибутов,
											  ЗначенияТабличныхАтрибутов) Экспорт
	
	// Чтение строк табличных атрибутов (строки-номенклатура классов).
	ТаблицаАтрибутов = Справочники.НоменклатураКласса.ПолучитьСтрокиТабличныхАтрибутов(
		СписокНоменклатуры, ДанныеТабличныхАтрибутов);
	ТаблицаАтрибутов.Колонки.Добавить("ИДСтроки");
	
	ПустаяНоменклатура = Справочники.НоменклатураКласса.ПустаяСсылка();
	
	// Строки-классы.
	СписокРодителей = Справочники.Классы.ПолучитьТаблицуРодителей(СписокКлассов);
	ТаблицаАтрибутовКлассов = Справочники.Классы.ПолучитьСтрокиТабличныхАтрибутов(
		СписокРодителей, ДанныеТабличныхАтрибутов);
	Для Каждого СтрокаТЗ ИЗ ТаблицаАтрибутовКлассов Цикл
		СтрокаКласса = ТаблицаАтрибутов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаКласса, СтрокаТЗ);
		СтрокаКласса.Объект = СтрокаТЗ.КлассДляЧтения;
		Если ЗначениеЗаполнено(СтрокаКласса.ЗначениеАтрибутаКласса) Тогда
			СтрокаКласса.ИсточникЗначений = СтрокаКласса.ЗначениеАтрибутаКласса;
			СтрокаКласса.ЗначениеАтрибутаКласса = ПустаяНоменклатура;
		КонецЕсли;
		Если СтрокаКласса.СтатусНаследования = 1 Тогда
			СтрокаКласса.СтатусНаследования = 3;
		КонецЕсли;
	КонецЦикла;
	
	СоответствиеИДСтрокВложенных = Новый Соответствие;
	НоменклатураВложенная        = Новый Массив;
	КлассыВложенные              = Новый Массив;
	
	ТипНоменклатура = Тип("СправочникСсылка.НоменклатураКласса");
	
	Для Каждого СтрокаТЗ ИЗ ТаблицаАтрибутов Цикл
		
		ЗначениеПоиска = ?(ЗначениеЗаполнено(СтрокаТЗ.ЗначениеАтрибутаКласса), 
			СтрокаТЗ.ЗначениеАтрибутаКласса, СтрокаТЗ.ИсточникЗначений);
			
		// СоответствиеИДСтрокВложенных - соответствие класса прочитанной строки и массива строк, добавленных в обработку.
		МассивСтрок = СоответствиеИДСтрокВложенных[ЗначениеПоиска];
		Если МассивСтрок = Неопределено Тогда
			МассивСтрок = Новый Массив;
			СоответствиеИДСтрокВложенных.Вставить(ЗначениеПоиска, МассивСтрок);
			// Использутся для чтения значений вложенных таб.частей.
			Если ТипЗнч(ЗначениеПоиска) = ТипНоменклатура Тогда
				НоменклатураВложенная.Добавить(ЗначениеПоиска);
			Иначе
				КлассыВложенные.Добавить(ЗначениеПоиска);
			КонецЕсли;
		КонецЕсли;
		
		// Соответствие родительских строк (из вызывающей процедуры при рекурсивном вызове).
		Если СоответствиеИДСтрок = Неопределено Тогда
			// Если родительских строк нет - значит ИД родительской строки = 0.
			МассивРодителей = Новый Массив;
			МассивРодителей.Добавить(Новый Структура("ИДСтроки, ЗначениеАтрибутаКласса, СтатусНаследования", 0, Неопределено, 1));
		Иначе
			МассивРодителей = СоответствиеИДСтрок[СтрокаТЗ.Объект];
			Если МассивРодителей = Неопределено Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		// Добавляем строки таб.части с привязкой к родительским строкам.
		Для Каждого СтрокаРодитель ИЗ МассивРодителей Цикл
			СтрокаТЗ.ИДСтроки = НовыйИДСтроки;
			
			СтрокаТЧ = СтрокиТабличныхАтрибутов.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаТЗ);
			
			СтрокаТЧ.ИДСтрокиРодителя   = СтрокаРодитель.ИДСтроки;
			Если СтрокаРодитель.ИДСтроки > 0 И НЕ ЗначениеЗаполнено(СтрокаРодитель.ЗначениеАтрибутаКласса) Тогда
				СтрокаТЧ.СтатусНаследования = Макс(СтрокаТЧ.СтатусНаследования, СтрокаРодитель.СтатусНаследования);
			КонецЕсли;
			МассивСтрок.Добавить(СтрокаТЧ);
			
			НовыйИДСтроки = НовыйИДСтроки + 1;
		КонецЦикла;
	КонецЦикла;
	
	// Чтение значений атрибутов строк (номенклатура классов).
	ЗначенияАтрибутов = Справочники.НоменклатураКласса.ПолучитьТаблицуАтрибутов(НоменклатураВложенная);
	ТипКолонки = Новый ОписаниеТипов(
		ЗначенияАтрибутов.Колонки.Объект.ТипЗначения, "СправочникСсылка.Классы");
	ЗначенияАтрибутов.Колонки.Объект.Имя = "ОбъектУдалить";
	ЗначенияАтрибутов.Колонки.Добавить("Объект", ТипКолонки);
	ЗначенияКолонки = ЗначенияАтрибутов.ВыгрузитьКолонку("ОбъектУдалить");
	ЗначенияАтрибутов.ЗагрузитьКолонку(ЗначенияКолонки, "Объект");
	// Строки-классы.
	СписокРодителей          = Справочники.Классы.ПолучитьТаблицуРодителей(КлассыВложенные);
	ЗначенияАтрибутовКлассов = Справочники.Классы.ПолучитьТаблицуАтрибутов(СписокРодителей);
	
	Для Каждого СтрокаТЗ ИЗ ЗначенияАтрибутовКлассов Цикл
		СтрокаЗначения = ЗначенияАтрибутов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаЗначения, СтрокаТЗ);
		СтрокаЗначения.Объект = СтрокаТЗ.КлассДляЧтения;
		Если НЕ ЗначениеЗаполнено(СтрокаТЗ.ТипЗначения) И ЗначениеЗаполнено(СтрокаТЗ.ТипЗначенияРеквизита) Тогда
			СтрокаЗначения.ТипЗначения = ЗначениеИзСтрокиВнутр(СтрокаТЗ.ТипЗначенияРеквизита);
		КонецЕсли;
	КонецЦикла;
	
	ДанныеТабличныхАтрибутовВложенных = Новый Массив;
	МассивОбъектовДляЧтения = Новый Массив;
	
	Для Каждого СтрокаЗначений ИЗ ЗначенияАтрибутов Цикл
		// Выписываем списочные атрибуты.
		Если СтрокаЗначений.МножественноеЗначение И СтрокаЗначений.КлассТабличнаяЧасть Тогда
			ДанныеТабличныхАтрибутовВложенных.Добавить(СтрокаЗначений.АтрибутКласса);
		КонецЕсли;
		
		МассивСтрок = СоответствиеИДСтрокВложенных[СтрокаЗначений.Объект];
		Если МассивСтрок = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		Для Каждого СтрокаТаб ИЗ МассивСтрок Цикл
			СтрокаТЧ = ЗначенияТабличныхАтрибутов.Добавить();
			СтрокаТЧ.ИДСтрокиРодителя        = СтрокаТаб.ИДСтрокиРодителя;
			СтрокаТЧ.АтрибутКласса           = СтрокаТаб.АтрибутКласса;
			СтрокаТЧ.ИДСтроки                = СтрокаТаб.ИДСтроки;
			СтрокаТЧ.АтрибутТаблицы          = СтрокаЗначений.АтрибутКласса;
			СтрокаТЧ.ЗначениеАтрибутаТаблицы = СтрокаЗначений.ЗначениеАтрибутаКласса;
		КонецЦикла;
	КонецЦикла;
	
	Если ДанныеТабличныхАтрибутовВложенных.Количество() > 0 Тогда
		ПрочитатьЗначенияТабличныхАтрибутов(НоменклатураВложенная, 
											КлассыВложенные, 
											ДанныеТабличныхАтрибутовВложенных, 
											НовыйИДСтроки, 
											СоответствиеИДСтрокВложенных,
											СтрокиТабличныхАтрибутов,
											ЗначенияТабличныхАтрибутов);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий
//Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
//Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//Код процедур и функций
#КонецОбласти
