
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	xmlnsXML                = "http://www.w3.org/XML/1998/namespace";
	xmlnsV8XDTO             = "http://v8.1c.ru/8.1/xdto";
	xmlnsОписанияТиповКлассификаторов = "urn:uuid:101fa9a0-ea86-11dc-afc4-0002a5d5c51b";
	xmlnsКлассификатор      = "urn:uuid:be515360-d4a7-11dc-8abf-0002a5d5c51b";
	
	Предупреждение = НСтр("es='En el fichero indicado no es encontrado los datos para la carga';ru='В указанном файле не найдено данных для загрузки';en='No download data found in the specified file'");

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьИПрочитатьФайл(Команда)
	
	АдресВременногоХранилища = Неопределено;
	
	ОчиститьСообщения();
	Попытка
		НачатьПомещениеФайла(Новый ОписаниеОповещения("ОткрытьИПрочитатьФайлЗавершение", ЭтотОбъект), АдресВременногоХранилища, ИмяФайлаПоУмолчанию, Истина, УникальныйИдентификатор);
	Исключение
		ШаблонСообщения = НСтр("es='A la lectura del fichero ha surgido la falta "
"%1';ru='При чтении файла возникла ошибка"
"%1';en='An error occurred while reading the file"
"%1'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, 
						КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ПоказатьПредупреждение(, ТекстСообщения, , НСтр("es='La falta';ru='Ошибка';en='Error '"));
        Возврат;
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИПрочитатьФайлЗавершение(Результат, Адрес, ИмяВыбранногоФайла, ДополнительныеПараметры) Экспорт
    
    Если НЕ Результат Тогда
        Возврат;
	КонецЕсли;
	
	ШаблонСообщения = НСтр("es='Se cumple la lectura de los datos del clasificador Amortizatsionnye del grupo OKOF del fichero';ru='Выполняется считывание данных классификатора Амортизационные группы ОКОФ из файла';en='Classifier data is read OKOF depreciation groups from file'");
    Состояние(ШаблонСообщения);
	
	АдресВременногоХранилища = Адрес;
	
	ИмяФайла = ИмяВыбранногоФайла;
    
    ПрочитатьВыбранныйФайл();

    
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	
	Если НЕ Объект.Загружать Тогда
		Возврат;
	КонецЕсли;	
	
	ЗагрузитьКлассификатор();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗагрузитьКлассификатор()
	
	ОбъектОбр = РеквизитФормыВЗначение("Объект");
	
	ОбъектОбр.ДобавитьНовыйКлассификатор(ИмяФайла, АдресВременногоХранилища, Неопределено);
	
	ОбъектОбр.ЗаписатьКлассификаторы();
	
	Возврат Истина;	

КонецФункции

&НаСервере
Процедура ПрочитатьПомещенныйФайлНаСервере(Знач ПомещенныйФайл)
	
	Перем ДиспетчерОбновлений;
	
	ДиспетчерОбновлений = РеквизитФормыВЗначение("Объект");
	ДиспетчерОбновлений.ДобавитьНовыйКлассификатор(ПомещенныйФайл.Имя, ПомещенныйФайл.Хранение, УникальныйИдентификатор);
		
	ЗначениеВРеквизитФормы(ДиспетчерОбновлений, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьВыбранныйФайл()
	
	ОписаниеПереданногоФайла = Новый Структура("Имя, Хранение");
	ОписаниеПереданногоФайла.Имя = ИмяФайла;
	ОписаниеПереданногоФайла.Хранение = АдресВременногоХранилища;
	
	ПрочитатьПомещенныйФайлНаСервере(ОписаниеПереданногоФайла);
	
	Если Объект.Загружать Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СраницаКлассификатор;
	Иначе
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаПредупреждение;
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти
