
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Элементы.ТПОтборПечатнойФормыЗначение.ВыбиратьТип=Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НоваяСтрока=ТПОтборПечатнойФормы.Добавить();	
	// >> [Деснол] [Ушаков А.Д.] [26.09.2019] 
	НоваяСтрока.Имя=НСтр("es='Lista de objetos de eventos regulares';ru='Список объектов регламентного мероприятия';en='List of regulatory event objects'");
	//НоваяСтрока.Имя="Список объектов регламентного мероприятия";
	// << [Деснол] [Ушаков А.Д.] [26.09.2019] 
	НоваяСтрока.Значение=Справочники.торо_СписокОбъектовРегламентногоМероприятия.ПустаяСсылка();
	
	НоваяСтрока=ТПОтборПечатнойФормы.Добавить();
	// >> [Деснол] [Ушаков А.Д.] [26.09.2019] 
	НоваяСтрока.Имя=НСтр("es='Tipo de evento';ru='Вид мероприятия';en='Type of event'");
	//НоваяСтрока.Имя="Вид мероприятия";
	// << [Деснол] [Ушаков А.Д.] [26.09.2019] 
	НоваяСтрока.Значение=Справочники.торо_ВидыРемонтов.ПустаяСсылка();
		
	ПланГрафикРемонта=Параметры.ДокППР;
	
	НачПерПоян = ПланГрафикРемонта.ДатаПланирования;
	Если ЗначениеЗаполнено(ПланГрафикРемонта.ПериодичностьДетализации) Тогда		
		КонПерПоян = ОбщегоНазначенияУТКлиентСервер.РассчитатьДатуОкончанияПериода(ПланГрафикРемонта.ДатаПланирования, ПланГрафикРемонта.ПериодичностьДетализации, ПланГрафикРемонта.КоличествоПериодов);
	Иначе
		ТекстСообщения = НСтр("es='de la planificación!';ru='Не выбран период планирования!';en='No planning period selected!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;

	ТекГод = Год(ТекущаяДата());
	// >> [Деснол] [Ушаков А.Д.] [26.09.2019] 
	Элементы.ИнтервалРазбиения.СписокВыбора.Добавить("Год", 	НСтр("es='Año';ru='Год';en='Year'"));
	Элементы.ИнтервалРазбиения.СписокВыбора.Добавить("Месяц", 	НСтр("es='Mes';ru='Месяц';en='Month'"));
	Элементы.ИнтервалРазбиения.СписокВыбора.Добавить("Неделя",	НСтр("es='Semana';ru='Неделя';en='Week'"));
	Элементы.ИнтервалРазбиения.СписокВыбора.Добавить("День",	НСтр("es='Día';ru='День';en='Day'"));

	//Элементы.ИнтервалРазбиения.СписокВыбора.Добавить("Год");
	//Элементы.ИнтервалРазбиения.СписокВыбора.Добавить("Месяц");
	//Элементы.ИнтервалРазбиения.СписокВыбора.Добавить("Неделя");
	//Элементы.ИнтервалРазбиения.СписокВыбора.Добавить("День");
	////ИнтервалРазбиения = "Месяц";
	// << [Деснол] [Ушаков А.Д.] [26.09.2019] 
 	
	ПериодНач=НачПерПоян;
	ПериодКон=КонПерПоян;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ПериодНачПриИзменении(Элемент)
	ПериодНачПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПериодКонПриИзменении(Элемент)
	ПериодКонПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалРазбиенияПриИзменении(Элемент)
	
	Если ИнтервалРазбиения = "Год" Тогда		
	ИначеЕсли ИнтервалРазбиения = "Месяц" Тогда			
	ИначеЕсли ИнтервалРазбиения = "Неделя" Тогда		
	ИначеЕсли ИнтервалРазбиения = "День" Тогда
		Если (НачалоДня(ПериодКон) - НачалоДня(ПериодНач))/(60*60*24)>=31*3 Тогда
			ТекстСообщения = НСтр("es='Los detalles para tal período no son admisible por días.';ru='Детализация для такого периода не допустима по дням.';en='Detailing for such a period is not allowed by the day.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			ИнтервалРазбиения = "Неделя";	
		КонецЕсли;
	Иначе
		ТекстСообщения = НСтр("es='Los detalles para tal período no son admisible.';ru='Детализация для такого периода не допустима.';en='Detailing for such a period is not permissible.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		ИнтервалРазбиения = "Месяц";	
	КонецЕсли;	
	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Печать(Команда)
	
	ПередатьПараметр = Новый Структура;
	ПередатьПараметр.Вставить("ДатаНачала",ПериодНач);
	ПередатьПараметр.Вставить("ДатаКонца",ПериодКон);	
	ПередатьПараметр.Вставить("ИнтервалРазбиения",ИнтервалРазбиения);
	ПередатьПараметр.Вставить("ОтборФормы",ТПОтборПечатнойФормы);
		
	Закрыть(ПередатьПараметр);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТПОтборПечатнойФормы
&НаКлиенте
Процедура ТПОтборПечатнойФормыВидСравненияПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТПОтборПечатнойФормы.ТекущиеДанные;
	Если ТекДанные <> Неопределено И ТекДанные.Значение <> Неопределено Тогда
		НеобходимСписок = (ТекДанные.ВидСравнения = ВидСравнения.ВСписке Или ТекДанные.ВидСравнения = ВидСравнения.НеВСписке Или ТекДанные.ВидСравнения = ВидСравнения.ВСпискеПоИерархии);
		
		Если Не НеобходимСписок И ТипЗнч(ТекДанные.Значение) = Тип("СписокЗначений") Тогда
			Если ТекДанные.Значение.Количество() > 0 Тогда
				ТекДанные.Значение = ТекДанные.Значение[0].Значение;
			Иначе
				ТекДанные.Значение = ПредопределенноеЗначение(?(ТекДанные.Имя = "Список объектов регламентного мероприятия", "Справочник.торо_СписокОбъектовРегламентногоМероприятия.ПустаяСсылка", "Справочник.торо_ВидыРемонтов.ПустаяСсылка"));
			КонецЕсли;
		ИначеЕсли НеобходимСписок И Не ТипЗнч(ТекДанные.Значение) = Тип("СписокЗначений") Тогда
			НеобходимыйСписок = Новый СписокЗначений;
			НеобходимыйСписок.ТипЗначения = ?(ТекДанные.Имя = "Список объектов регламентного мероприятия",Новый ОписаниеТипов("СправочникСсылка.торо_СписокОбъектовРегламентногоМероприятия"), Новый ОписаниеТипов("СправочникСсылка.торо_ВидыРемонтов"));
			Если ЗначениеЗаполнено(ТекДанные.Значение) Тогда
				НеобходимыйСписок.Добавить(ТекДанные.Значение);
			КонецЕсли;
			ТекДанные.Значение = НеобходимыйСписок;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПериодНачПриИзмененииНаСервере()
	Если ПериодНач > ПериодКон Тогда
		ТекстСообщения = НСтр("es='La fecha del comienzo del período no puede ser más de fechas de su comienzo.';ru='Дата начала периода не может быть больше даты его начала.';en='The start date of the period cannot be greater than the start date.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		ПериодНач = НачПерПоян;
		Возврат;
	КонецЕсли;	
	Если ПериодНач < НачПерПоян Или ПериодНач > КонПерПоян Тогда
		ТекстСообщения = НСтр("es='La fecha introducida se encuentra fuera de los límites de la banda posible.';ru='Введенная дата находится за пределами возможного диапазона.';en='The entered date is out of range.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		ПериодНач = НачПерПоян;
		Возврат;
	КонецЕсли;
	Если ((НачалоДня(ПериодКон) - НачалоДня(ПериодНач))/(60*60*24)>=31*3) И
		(ИнтервалРазбиения = Перечисления.Периодичность.День) Тогда
			ТекстСообщения = НСтр("es='¡Los detalles para tal período no son admisible por días!';ru='Детализация для такого периода не допустима по дням!';en='Detailing for such a period is not allowed by the day!'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Элементы.ПолеВыбораИнтервала.Значение = "Неделя";
			ИнтервалРазбиения = Перечисления.Периодичность.Неделя;	
		Возврат;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПериодКонПриИзмененииНаСервере()
	Если ПериодКон < ПериодНач Тогда
		ТекстСообщения = НСтр("es='La fecha del fin del período no puede ser menos de fechas de su comienzo.';ru='Дата конца периода не может быть меньше даты его начала.';en='The end date of a period cannot be less than the start date.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		ПериодКон = КонПерПоян;
		Возврат;
	КонецЕсли;	
	Если ПериодКон < НачПерПоян Или ПериодКон > КонПерПоян Тогда
		ТекстСообщения = НСтр("es='La fecha introducida se encuentra fuera de los límites de la banda posible.';ru='Введенная дата находится за пределами возможного диапазона.';en='The entered date is out of range.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		ПериодКон = КонПерПоян;
		Возврат;
	КонецЕсли;
	Если ((НачалоДня(ПериодКон) - НачалоДня(ПериодНач))/(60*60*24)>=31*3) И
		(ИнтервалРазбиения = Перечисления.Периодичность.День) Тогда
			ТекстСообщения = НСтр("es='¡Los detalles para tal período no son admisible por días!';ru='Детализация для такого периода не допустима по дням!';en='Detailing for such a period is not allowed by the day!'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Элементы.ПолеВыбораИнтервала.Значение = "Неделя";
			ИнтервалРазбиения = Перечисления.Периодичность.Неделя;
			Возврат;
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

