
#Область ОбработчикиСобытийЭлементовШапкиФормы

Процедура ПередЗаписью(Отказ)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧ.Характеристика КАК Характеристика,
		|	ТЧ.ВидСравнения КАК ВидСравнения,
		|	ТЧ.Значение КАК Значение
		|ПОМЕСТИТЬ Старая1
		|ИЗ
		|	Справочник.торо_ОграниченияНаХарактеристикиОбрудования.СписокОграниченийПоказатели КАК ТЧ
		|ГДЕ
		|	ТЧ.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЧ.Характеристика КАК Характеристика,
		|	ТЧ.ВидСравнения КАК ВидСравнения,
		|	ТЧ.Значение КАК Значение
		|ПОМЕСТИТЬ Новая1
		|ИЗ
		|	&ТЧ1 КАК ТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЧ.Характеристика КАК Характеристика,
		|	ТЧ.ВидСравнения КАК ВидСравнения,
		|	ТЧ.Значение КАК Значение
		|ПОМЕСТИТЬ Новая2
		|ИЗ
		|	&ТЧ2 КАК ТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЧ.Характеристика КАК Характеристика,
		|	ТЧ.ВидСравнения КАК ВидСравнения,
		|	ТЧ.Значение КАК Значение
		|ПОМЕСТИТЬ Старая2
		|ИЗ
		|	Справочник.торо_ОграниченияНаХарактеристикиОбрудования.СписокОграничений КАК ТЧ
		|ГДЕ
		|	ТЧ.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Старая1.Характеристика КАК Характеристика,
		|	Новая1.Характеристика КАК Характеристика1
		|ИЗ
		|	Старая1 КАК Старая1
		|		ПОЛНОЕ СОЕДИНЕНИЕ Новая1 КАК Новая1
		|		ПО Старая1.Характеристика = Новая1.Характеристика
		|			И Старая1.ВидСравнения = Новая1.ВидСравнения
		|			И Старая1.Значение = Новая1.Значение
		|ГДЕ
		|	(Новая1.Характеристика ЕСТЬ NULL
		|			ИЛИ Старая1.Характеристика ЕСТЬ NULL)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Новая2.Характеристика,
		|	Старая2.Характеристика
		|ИЗ
		|	Старая2 КАК Старая2
		|		ПОЛНОЕ СОЕДИНЕНИЕ Новая2 КАК Новая2
		|		ПО Старая2.Характеристика = Новая2.Характеристика
		|			И Старая2.ВидСравнения = Новая2.ВидСравнения
		|			И Старая2.Значение = Новая2.Значение
		|ГДЕ
		|	(Новая2.Характеристика ЕСТЬ NULL
		|			ИЛИ Старая2.Характеристика ЕСТЬ NULL)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ТЧ1", СписокОграниченийПоказатели.Выгрузить());
	Запрос.УстановитьПараметр("ТЧ2", СписокОграничений.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() = Ложь Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ Различные
		               |	торо_ОграниченияНаХарактеристикиОборудования.ФункциональноеМесто КАК ФМ
		               |ИЗ
		               |	РегистрСведений.торо_ОграниченияНаХарактеристикиОборудования КАК торо_ОграниченияНаХарактеристикиОборудования
		               |ГДЕ
		               |	торо_ОграниченияНаХарактеристикиОборудования.Ограничение = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			НЗ = РегистрыСведений.торо_ОбъектыДляПроверкиТребованийФМ.СоздатьНаборЗаписей();
			НЗ.Отбор.Объект.Установить(Выборка.ФМ);
			НС = НЗ.Добавить();
			НС.Объект = Выборка.ФМ;
			НС.Период = ТекущаяДата();
			НЗ.Записать();
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти