#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбъектКопирования = Неопределено;
		Если Параметры.Свойство("ЗначениеКопирования", ОбъектКопирования) Тогда
			Цвет = ОбъектКопирования.Цвет.Получить();
		КонецЕсли; 
	КонецЕсли; 
	
	Элементы.Цвет.Доступность = Доступность И (ПравоДоступа("Изменение", Метаданные.Справочники.торо_КатегорииРиска)
											ИЛИ ПравоДоступа("Добавление", Метаданные.Справочники.торо_КатегорииРиска));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПроставитьАвтоотметкиНезаполненного();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЦветИзХранилища = ТекущийОбъект.Цвет.Получить();
	Если Не ЦветИзХранилища = Неопределено Тогда
		Цвет = ЦветИзХранилища;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.Цвет = Новый ХранилищеЗначения(Цвет);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаНачала_КоличествоПериодовПриИзменении(Элемент)
	ПроставитьАвтоотметкиНезаполненного();
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончания_КоличествоПериодовПриИзменении(Элемент)
	ПроставитьАвтоотметкиНезаполненного();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПлановаяКрайняя_КоличествоПериодовПриИзменении(Элемент)
	ПроставитьАвтоотметкиНезаполненного();
КонецПроцедуры
 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте 
Процедура ПроставитьАвтоотметкиНезаполненного()
	
	Элементы.ДатаНачала_Период.АвтоОтметкаНезаполненного          = ЗначениеЗаполнено(Объект.ДатаНачала_КоличествоПериодов); 
	Элементы.ДатаОкончания_Период.АвтоОтметкаНезаполненного       = ЗначениеЗаполнено(Объект.ДатаОкончания_КоличествоПериодов); 
	Элементы.ДатаПлановаяКрайняя_Период.АвтоОтметкаНезаполненного = ЗначениеЗаполнено(Объект.ДатаПлановаяКрайняя_КоличествоПериодов); 
	
КонецПроцедуры

#КонецОбласти

  
