#Область ОбработчикиСобытий

Функция SummaryReport(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	ТелоЗапроса	= Запрос.ПолучитьТелоКакСтроку();
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТелоЗапроса);
	ПараметрыЗапроса = СериализаторXDTO.ПрочитатьJSON(ЧтениеJSON, Тип("Структура"));
	ЧтениеJSON.Закрыть();	
		
	Попытка
		Результат	= гкс_ИнтеграцияERP2.ПолучитьДанныеДляСводногоОтчетаERP2(ПараметрыЗапроса);
	Исключение		
		ТекстОшибки	= ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("Интеграция ТОиР.Получение остатков номенклатуры",
			УровеньЖурналаРегистрации.Ошибка, Метаданные.HTTPСервисы.ERP2IntegrationService,	, ТекстОшибки);
		
		Результат	= ТекстОшибки;
		
		Ответ.КодСостояния = 400;
	КонецПопытки; 
	
	ЗаписьJSON	= Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON, Результат, НазначениеТипаXML.Явное);
	
	Ответ.УстановитьТелоИзСтроки(ЗаписьJSON.Закрыть(), КодировкаТекста.UTF8, 
		ИспользованиеByteOrderMark.НеИспользовать);
			
	Возврат Ответ;
	

КонецФункции

Функция Ping(Запрос)

	Ответ = Новый HTTPСервисОтвет(200);
	
	Заголовки	= Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");

	Ответ.Заголовки	= Заголовки;	
	Ответ.УстановитьТелоИзСтроки("OK", "utf-8");
	
	Возврат Ответ;
	
КонецФункции
#КонецОбласти
