
#Область ПрограммныйИнтерфейс

// Изменяет статус согласования документа.
//
// Параметры:
//		Форма - УправляемаяФорма - форма документа.
//
Процедура УстановитьСтатус(Форма) Экспорт
	
	Объект = Форма.Объект;
	Если Форма.мХранитьИсториюСогласованияВДокументах И Не торо_ОбщегоНазначенияКлиентПовтИсп.ЕстьПраво("Редактирование", "Документы", Сред(Форма.ИмяФормы, 10, Найти(Форма.ИмяФормы, ".Фор") - 10)) Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("es='¡Es insuficientemente derecho para la redacción del documento!';ru='Недостаточно прав для редактирования документа!';en='Not enough rights to edit the document!'"));
	Иначе
		Если Объект.Ссылка.пустая() ИЛИ Форма.Модифицированность Тогда
			ПоказатьВопрос(Новый ОписаниеОповещения("ОбработатьВопрос_ЗаписатьДокумент", ЭтотОбъект, Новый Структура("Форма", Форма)), НСтр("es='¡Ante la ejecución del procedimiento de la coordinación es necesario anotar el documento! ¿Anotar?';ru='Перед выполнением процедуры согласования необходимо записать документ! Записать?';en='Before performing the approval procedure, you must write down a document! To record?'"), РежимДиалогаВопрос.ДаНет, 60); 
		Иначе
			Если Форма.Объект.ПометкаУдаления Тогда
				ПоказатьПредупреждение(Неопределено, НСтр("es='¡El documento es marcado a la desaparición! ¡La coordinación de los documentos, marcados a la desaparición, es prohíbida!';ru='Документ помечен на удаление! Согласование помеченных на удаление документов запрещено!';en='Document marked for deletion! Coordination of documents marked for deletion is prohibited!'"));
				Возврат;	
			КонецЕсли;
			
			ТекущийПользователь = Пользователи.ТекущийПользователь();
			СписокСледующихСтатусов = торо_РаботаССогласованиями.ПолучитьСписокСледующихСтатусовДокумента(Объект.СпособСогласования, Форма.СтатусДокументаРегистр);
			ПоказатьВопрос(Новый ОписаниеОповещения("ВыбратьСтатус", ЭтотОбъект, Новый Структура("СписокСледующихСтатусов, ТекущийПользователь, Форма", СписокСледующихСтатусов, ТекущийПользователь, Форма)), НСтр("es='¿Afirmar el estatus?';ru='Утвердить статус?';en='Approve status?'"), РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьВопрос_ЗаписатьДокумент(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Форма = ДополнительныеПараметры.Форма;
	Объект = Форма.Объект;
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Попытка
			Форма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
		Исключение
			ТекстСообщения = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации(НСтр("es='La excepción';ru='Исключение';en='An exception'"), "Предупреждение", ОписаниеОшибки());
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецПопытки; 
		
		ТекущийПользователь = торо_РаботаСУведомлениями.ПолучитьТекущегоПользователя();
		СписокСледующихСтатусов = торо_РаботаССогласованиями.ПолучитьСписокСледующихСтатусовДокумента(Объект.СпособСогласования, Форма.СтатусДокументаРегистр);
		ПоказатьВопрос(Новый ОписаниеОповещения("ВыбратьСтатус", ЭтотОбъект, Новый Структура("СписокСледующихСтатусов, ТекущийПользователь, Форма", СписокСледующихСтатусов, ТекущийПользователь, Форма)), НСтр("es='¿Afirmar el estatus?';ru='Утвердить статус?';en='Approve status?'"), РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыбратьСтатус(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;	
	КонецЕсли;
	
	СписокСледующихСтатусов = ДополнительныеПараметры.СписокСледующихСтатусов;
	Форма = ДополнительныеПараметры.Форма;

	Если СписокСледующихСтатусов.Количество() > 0 Тогда
		ВыделенныйСтатус = Неопределено;
		ТекущиеДанныеДерева = Форма.Элементы.ДеревоСогласования.ТекущиеДанные;
		Если ТекущиеДанныеДерева <> Неопределено Тогда
			ВыделенныйСтатус = ТекущиеДанныеДерева.СтатусДокумента;
		КонецЕсли;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьСтатусЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ПараметрыФормы = Новый Структура("СписокСледующихСтатусов, ВыделенныйСтатус", СписокСледующихСтатусов, ВыделенныйСтатус);
		ОткрытьФорму("ОбщаяФорма.торо_ФормаВыбораСтатусаСогласования", ПараметрыФормы, Форма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыбратьСтатусЗавершение(ВыбранныйЭлемент,ДополнительныеПараметры) Экспорт

	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;
	Объект = Форма.Объект;
	
	ВыбранныйСтатус = ВыбранныйЭлемент.ВыбранныйСтатус;

	ДанныеСтатуса = торо_РаботаССогласованиями.ПолучитьДанныеПоСтатусуДокумента(Объект.СпособСогласования, ВыбранныйСтатус);
	Если (ДанныеСтатуса.ЗапретитьРедактирование ИЛИ ДанныеСтатуса.ПроводитьДокумент) И НЕ Форма.ПроверитьЗаполнение() Тогда
		ТекстСообщения = "";
		Если ДанныеСтатуса.ЗапретитьРедактирование Тогда
			ТекстСообщения = НСтр("es='Durante la comprobación del relleno del documento son encontradas las faltas. El tránsito en el estatus con la prohibición de la redacción es imposible.';ru='При проверке заполнения документа найдены ошибки. Переход в статус с запретом редактирования невозможен.';en='Errors were found while checking the document filling. The transition to the status with the prohibition of editing is not possible.'");
		Иначе
			ТекстСообщения = НСтр("es='Durante la comprobación del relleno del documento son encontradas las faltas. El tránsito en el estatus con el permiso de la realización es imposible.';ru='При проверке заполнения документа найдены ошибки. Переход в статус с разрешением проведения невозможен.';en='Errors were found while checking the document filling. Transition to the status with permission to conduct is not possible.'");
		КонецЕсли;
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ПроставитьГалочкиЗаТекущегоПользователя(ВыбранныйЭлемент, ДополнительныеПараметры);
	торо_РаботаССогласованиямиКлиентСервер.ЗаписатьДеревоСогласования(Форма);
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("Документ", Объект.Ссылка);
	ПараметрыОповещения.Вставить("ВыбранныйСтатус", ВыбранныйСтатус);
		
	Оповестить("УтверждениеСтатусаСогласования", ПараметрыОповещения);
	
КонецПроцедуры

Процедура ПроставитьГалочкиЗаТекущегоПользователя(ВыбранныйЭлемент, ДополнительныеПараметры) 
	
	Форма = ДополнительныеПараметры.Форма;
	
	ВыбранныйСтатус = ВыбранныйЭлемент.ВыбранныйСтатус;
	КомментарийКСтатусу = ВыбранныйЭлемент.Комментарий;
	ТекущийПользователь = ДополнительныеПараметры.ТекущийПользователь;
	
	МассивСтрокСогласования = Новый Массив;
	МассивСтрокДереваСогласования = Новый Массив;			
	ЗаполнитьМассивИзДерева(МассивСтрокДереваСогласования, 	Форма.ДеревоСогласования.ПолучитьЭлементы());
	
	// отбор строк, где пользователь является согласующим
	Для каждого Строка Из МассивСтрокДереваСогласования Цикл
		Если (Строка.Согласующий = ТекущийПользователь)
			И Строка.Замещающий = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка")
			И Строка.Согласовано = Ложь 
			Тогда
			МассивСтрокСогласования.Добавить(Строка);
		КонецЕсли; 
	КонецЦикла; 
	
	// отбор строк, где пользователь является замещающим
	МассивСтрокЗамещения = Новый Массив;
	
	Для каждого Строка Из МассивСтрокДереваСогласования Цикл
		Если Строка.Замещающий  = ТекущийПользователь
			И Строка.Согласовано = Ложь 
			Тогда
			МассивСтрокЗамещения.Добавить(Строка);
		КонецЕсли; 
	КонецЦикла;
	
	// отбор строк, где пользователь является замещающим (но не согласующим при этом)
	МассивОсновнойНеЗамещающий = Новый Массив; 
	Для Каждого Строка Из МассивСтрокЗамещения Цикл
		Если Строка.Согласующий <> ТекущийПользователь Тогда
			МассивОсновнойНеЗамещающий.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;
	
	СогласующийИлиЗамещающий = Ложь;
	
	// Обработка строк, где пользователь является согласующим
	Попытка
		Для Каждого СтрокаДЗ Из МассивСтрокСогласования Цикл
			Для Каждого СтрокаДЗП Из СтрокаДЗ.ПолучитьЭлементы() Цикл
				СтрокаДЗП.Согласовано = Ложь;
			КонецЦикла; 
			
			СтрокаДЗ.Согласовано = (СтрокаДЗ.СтатусДокумента = ВыбранныйСтатус);
			
			Если СтрокаДЗ.СтатусДокумента = ВыбранныйСтатус Тогда
				СогласующийИлиЗамещающий = Истина;
				торо_РаботаССогласованиямиКлиентСервер.ДобавитьСтрокуВИсториюСтатусов(Форма, ВыбранныйСтатус, ТекущийПользователь,,КомментарийКСтатусу);
            КонецЕсли; 
		КонецЦикла; 
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеОшибки);
	КонецПопытки;
	
	// Обработка строк, где пользователь является замещающим, но не согласующим
	Попытка
		Для Каждого СтрокаДЗ Из МассивОсновнойНеЗамещающий Цикл
			СтрокаДЗ.Согласовано = (СтрокаДЗ.СтатусДокумента = ВыбранныйСтатус);
			Если СтрокаДЗ.СтатусДокумента = ВыбранныйСтатус Тогда
				СогласующийИлиЗамещающий = Истина;
				торо_РаботаССогласованиямиКлиентСервер.ДобавитьСтрокуВИсториюСтатусов(Форма, ВыбранныйСтатус, СтрокаДЗ.Согласующий,,КомментарийКСтатусу);
				
				// поднимаем галочку и за согласующего тоже
				Для каждого Строка Из МассивСтрокДереваСогласования Цикл
					Если (Строка.Согласующий = СтрокаДЗ.Согласующий)
						И Строка.Замещающий = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка")
						И Строка.СтатусДокумента = ВыбранныйСтатус
						Тогда
						Строка.Согласовано = Истина;
					КонецЕсли; 
				КонецЦикла;
			КонецЕсли; 
		КонецЦикла; 
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеОшибки);
	КонецПопытки;
	
	Если НЕ СогласующийИлиЗамещающий Тогда 
		ТекстСообщения = НСтр("es='¡El usuario corriente no es ni ß«ú½áßÒ¯Ú¡¿¼, ni que sustituye para el estatus escogido!';ru='Текущий пользователь не является ни согласующим, ни замещающим для выбранного статуса!';en='The current user is neither matching nor substituting for the selected status!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
		
КонецПроцедуры

Процедура ЗаполнитьМассивИзДерева(Массив, ЭлементыДерева)
	
	Для каждого Элемент Из ЭлементыДерева Цикл
		Массив.Добавить(Элемент);
		Если Элемент.ПолучитьЭлементы().Количество() > 0 Тогда
			ЗаполнитьМассивИзДерева(Массив, Элемент.ПолучитьЭлементы());
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

// Открывает форму для посмотра и редактирования комментария к статусу.
Процедура ОткрытьЗаписьИсторииСтатусов(Форма, ДанныеСтроки) Экспорт
	
	СтруктураКлюча = Новый Структура("СогласуемыйДокумент, Пользователь, ЗаКого, Период");
	ЗаполнитьЗначенияСвойств(СтруктураКлюча, ДанныеСтроки);
	
	Если НЕ ЗначениеЗаполнено(СтруктураКлюча.СогласуемыйДокумент) Тогда
		Возврат;
	КонецЕсли;
	
	НачальныйСтатус = торо_РаботаССогласованиями.ПолучитьНачальныйСтатус(Форма.Объект.СпособСогласования);
	Если ДанныеСтроки.СтатусДокумента = НачальныйСтатус Тогда
		Возврат;
	КонецЕсли;
		
	КлючЗаписи = торо_РаботаССогласованиями.ПолучитьКлючЗаписиИсторииСтатусовДокументов(СтруктураКлюча);
	ПараметрыФормы = Новый Структура("Ключ", КлючЗаписи);
	
	ДопПараметры = Новый Структура("Форма, СтруктураКлюча", Форма, СтруктураКлюча);
	Оповещение = Новый ОписаниеОповещения("ПослеРедактированияКомментарияКСтатусу", ЭтотОбъект, ДопПараметры); 
	
	ОткрытьФорму("РегистрСведений.торо_ИсторияСтатусовСогласованияДокументов.ФормаЗаписи", ПараметрыФормы, Форма,,,,Оповещение);
	
КонецПроцедуры

Процедура ПослеРедактированияКомментарияКСтатусу(Результат, ДополнительныеПараметры) Экспорт
	
	Форма = ДополнительныеПараметры.Форма;
	СтруктураКлюча = ДополнительныеПараметры.СтруктураКлюча;
	
	ТекущаяСтрока = Неопределено;
	Для каждого Строка из Форма.ИсторияСтатусовРегистр Цикл
		Если Строка.Период = СтруктураКлюча.Период
			И Строка.Пользователь = СтруктураКлюча.Пользователь
			И Строка.ЗаКого = СтруктураКлюча.ЗаКого Тогда
			ТекущаяСтрока = Строка;
		КонецЕсли;
	КонецЦикла;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		Форма.Элементы.ИсторияСтатусов.ТекущаяСтрока = ТекущаяСтрока.ПолучитьИдентификатор();
		ТекущаяСтрока.Комментарий = торо_РаботаССогласованиями.ПолучитьКомментарийКСтатусуСогласования(СтруктураКлюча);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
