#Область ОбработчикиСобытий

&После("ОбработкаПроведения")
Процедура Расш_гкс_ОбработкаПроведения(Отказ, РежимПроведения)
	Если Не Отказ Тогда 
		ИзменитьСтатусДефекта();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// гкс+ [Релиз 1] Куст 17.03.2020
Процедура ИзменитьСтатусДефекта()
	ТекущаяСсылка = Неопределено;
	ТекущийПриоритет = 0;
	Для Каждого СТ Из ДокументыОснования Цикл
		Если ТипЗнч(Ст.ДокументОснование) = Тип("ДокументСсылка.торо_ВыявленныеДефекты") Тогда 
			ТекущийПриоритет = 1;
			ТекущаяСсылка = Ст.ДокументОснование;
		ИначеЕсли ТипЗнч(Ст.ДокументОснование) = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") Тогда 
			ТекущийПриоритет = 2;
			ТекущаяСсылка = Ст.ДокументОснование;
		ИначеЕсли ТипЗнч(Ст.ДокументОснование) = Тип("ДокументСсылка.торо_АктОВыполненииЭтапаРабот") Тогда 
			ТекущийПриоритет = 3;
			ТекущаяСсылка = Ст.ДокументОснование;
		КонецЕсли;
	КонецЦикла;
	Если ТекущийПриоритет = 0 Тогда 
		Возврат;
	КонецЕсли;
	Если ТекущийПриоритет = 1 Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	торо_ЗаявкаНаРемонтДокументыОснования.Ссылка КАК Заявка,
			|	торо_ЗаявкаНаРемонтДокументыОснования.ДокументОснование КАК Дефект
			|ПОМЕСТИТЬ Заявки
			|ИЗ
			|	Документ.торо_ЗаявкаНаРемонт.ДокументыОснования КАК торо_ЗаявкаНаРемонтДокументыОснования
			|ГДЕ
			|	торо_ЗаявкаНаРемонтДокументыОснования.ДокументОснование = &Ссылка
			|	И торо_ЗаявкаНаРемонтДокументыОснования.Ссылка.гкс_НуженИспытание = ""Да""
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Заявки.Заявка КАК Заявка,
			|	Заявки.Дефект КАК Дефект,
			|	торо_АктОВыполненииЭтапаРаботДокументыОснования.Ссылка КАК Акт
			|ИЗ
			|	Заявки КАК Заявки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.ДокументыОснования КАК торо_АктОВыполненииЭтапаРаботДокументыОснования
			|		ПО Заявки.Заявка = торо_АктОВыполненииЭтапаРаботДокументыОснования.ДокументОснование
			|			И (торо_АктОВыполненииЭтапаРаботДокументыОснования.Ссылка.Проведен = ИСТИНА)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	Заявки.Заявка,
			|	Заявки.Дефект,
			|	ОснованияАкта.Ссылка
			|ИЗ
			|	Заявки КАК Заявки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_НарядНаВыполнениеРемонтныхРабот.ДокументыОснования КАК ОснованияНаряда
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.ДокументыОснования КАК ОснованияАкта
			|			ПО ОснованияНаряда.Ссылка = ОснованияАкта.ДокументОснование
			|				И (ОснованияАкта.Ссылка.Проведен = ИСТИНА)
			|		ПО Заявки.Заявка = ОснованияНаряда.ДокументОснование";
	ИначеЕсли ТекущийПриоритет = 2 Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	торо_АктОВыполненииЭтапаРаботДокументыОснования.Ссылка КАК Акт
			|ИЗ
			|	Документ.торо_АктОВыполненииЭтапаРабот.ДокументыОснования КАК торо_АктОВыполненииЭтапаРаботДокументыОснования
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт КАК торо_ЗаявкаНаРемонт
			|		ПО (торо_ЗаявкаНаРемонт.гкс_НуженИспытание = ""Да"")
			|			И (торо_ЗаявкаНаРемонт.Ссылка = &Ссылка)
			|			И (торо_АктОВыполненииЭтапаРаботДокументыОснования.Ссылка.Проведен = ИСТИНА)
			|			И торо_АктОВыполненииЭтапаРаботДокументыОснования.ДокументОснование = торо_ЗаявкаНаРемонт.Ссылка
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ОснованияАкта.Ссылка
			|ИЗ
			|	Документ.торо_АктОВыполненииЭтапаРабот.ДокументыОснования КАК ОснованияАкта
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_НарядНаВыполнениеРемонтныхРабот.ДокументыОснования КАК ОснованияНаряда
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт КАК торо_ЗаявкаНаРемонт
			|			ПО (торо_ЗаявкаНаРемонт.гкс_НуженИспытание = ""Да"")
			|				И (торо_ЗаявкаНаРемонт.Ссылка = &Ссылка)
			|				И ОснованияНаряда.ДокументОснование = торо_ЗаявкаНаРемонт.Ссылка
			|		ПО ОснованияАкта.ДокументОснование = ОснованияНаряда.Ссылка
			|			И (ОснованияАкта.Ссылка.Проведен = ИСТИНА)";
	ИначеЕсли ТекущийПриоритет = 3 Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	торо_АктОВыполненииЭтапаРаботДокументыОснования.Ссылка КАК Акт
			|ИЗ
			|	Документ.торо_АктОВыполненииЭтапаРабот.ДокументыОснования КАК торо_АктОВыполненииЭтапаРаботДокументыОснования
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт КАК торо_ЗаявкаНаРемонт
			|		ПО (торо_ЗаявкаНаРемонт.гкс_НуженИспытание = ""Да"")
			|			И (торо_АктОВыполненииЭтапаРаботДокументыОснования.Ссылка = &Ссылка)
			|			И (торо_АктОВыполненииЭтапаРаботДокументыОснования.Ссылка.Проведен = ИСТИНА)
			|			И торо_АктОВыполненииЭтапаРаботДокументыОснования.ДокументОснование = торо_ЗаявкаНаРемонт.Ссылка
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ОснованияАкта.Ссылка
			|ИЗ
			|	Документ.торо_АктОВыполненииЭтапаРабот.ДокументыОснования КАК ОснованияАкта
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_НарядНаВыполнениеРемонтныхРабот.ДокументыОснования КАК ОснованияНаряда
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт КАК торо_ЗаявкаНаРемонт
			|			ПО (торо_ЗаявкаНаРемонт.гкс_НуженИспытание = ""Да"")
			|				И ОснованияНаряда.ДокументОснование = торо_ЗаявкаНаРемонт.Ссылка
			|		ПО ОснованияАкта.ДокументОснование = ОснованияНаряда.Ссылка
			|			И (ОснованияАкта.Ссылка = &Ссылка)
			|			И (ОснованияАкта.Ссылка.Проведен = ИСТИНА)";
	КонецЕсли;
	Запрос.УстановитьПараметр("Ссылка", ТекущаяСсылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() = Ложь Тогда 
		Выборка = РезультатЗапроса.Выбрать();
		// Гкс+[TOIR20-558] Вялых Д.А. от 06.03.2025. Добавлено и закомментировано:{
		//Если Выборка.Следующий() Тогда
		Пока Выборка.Следующий() Цикл
		// } Гкс-[TOIR20-537] Вялых Д.А. от 05.03.2025.
			торо_РаботаСоСтатусамиДокументовСервер.ИзменитьСтатусыДокументовОснований(Выборка.Акт);
		// Гкс+[TOIR20-558] Вялых Д.А. от 06.03.2025. Добавлено и закомментировано:{	
		//КонецЕсли;
		КонецЦикла;
		// } Гкс-[TOIR20-537] Вялых Д.А. от 05.03.2025.
	КонецЕсли;
КонецПроцедуры

&После("ПередЗаписью")
Процедура Расш_гкс_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда 
		ДополнительныеСвойства.Вставить("ЭтоОтменаПроведения",Истина);
	КонецЕсли;
	// гкс+ [разработка 2021] Куст 28.04.2021
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		гкс_ПроверитьВозможностьВвода(Отказ);
		Если Отказ Тогда 
			Возврат;
		КонецЕсли;
		гкс_ЗакрытьАкты();
	Иначе
		Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения ИЛИ Проведен = Ложь Тогда 
			гкс_ОтменитьЗакрытиеАктов();
		КонецЕсли;
	КонецЕсли;
	// гкс- [разработка 2021] Куст 28.04.2021
КонецПроцедуры

&После("ПриЗаписи")
Процедура Расш_гкс_ПриЗаписи(Отказ)
	Если Не Отказ И ДополнительныеСвойства.Свойство("ЭтоОтменаПроведения") Тогда 
		ИзменитьСтатусДефекта();
	КонецЕсли;
КонецПроцедуры
// гкс- [Релиз 1] Куст 17.03.2020

// гкс+ [разработка 2021] Куст 28.04.2021
Процедура гкс_ЗакрытьАкты(Флаг = Истина)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧ.ID КАК ИД
		|ПОМЕСТИТЬ НужныеРемонты
		|ИЗ
		|	&ТЧ1 КАК ТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокТЧ.Ссылка КАК Ссылка
		|ИЗ
		|	НужныеРемонты КАК НужныеРемонты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК ДокТЧ
		|		ПО НужныеРемонты.ИД = ДокТЧ.ID И ДокТЧ.Ссылка.Проведен = Истина
		|
		|СГРУППИРОВАТЬ ПО
		|	ДокТЧ.Ссылка";
		
    ТаблицаРемонтов = РемонтыОборудования.Выгрузить(,"ID");
	ТаблицаРемонтов.Свернуть("ID");
	Запрос.УстановитьПараметр("ТЧ1", ТаблицаРемонтов);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокОбъект.ЗавершитьРемонтныеРаботы = Флаг;
		Для Каждого СтрокаТаблицы ИЗ ДокОбъект.РемонтыОборудования Цикл
			СтрокаТаблицы.ЗавершитьРемонт = Флаг;
		КонецЦикла;
		ДокОбъект.БезусловнаяЗапись = Истина;
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	
КонецПроцедуры
// гкс- [разработка 2021] Куст 28.04.2021

// гкс+ [разработка 2021] Куст 28.04.2021
Процедура гкс_ПроверитьВозможностьВвода(Отказ)
	Запрос = Новый Запрос;
	// гкс+ [] Деснол 10.10.2022
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧ.ID КАК ИД
		|ПОМЕСТИТЬ НужныеРемонты
		|ИЗ
		|	&ТЧ1 КАК ТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокТЧ.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.торо_АктПриемкиОборудования.РемонтыОборудования КАК ДокТЧ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НужныеРемонты КАК НужныеРемонты
		|		ПО ДокТЧ.ID = НужныеРемонты.ИД
		|			И (ДокТЧ.Ссылка.ПометкаУдаления = ЛОЖЬ)
		|Где Не &Ссылка = ДокТЧ.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокТЧ.Ссылка КАК Ссылка, 
		|	Минимум(ДокТЧ.Ссылка.гкс_РаботыВыполнены) КАК гкс_РаботыВыполнены,
		|	ДокТЧ.Ссылка.СпособСогласования КАК Способ
		|	,РегистрСведенийторо_ТекущиеСтатусыСогласованияДокументов.СтатусДокумента КАК Статус
		|Поместить ВТ_ТекущийСтатус
		|ИЗ
		|	НужныеРемонты КАК НужныеРемонты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК ДокТЧ
		|	Левое соединение РегистрСведений.торо_ТекущиеСтатусыСогласованияДокументов КАК РегистрСведенийторо_ТекущиеСтатусыСогласованияДокументов
		|	ПО РегистрСведенийторо_ТекущиеСтатусыСогласованияДокументов.СогласуемыйДокумент = ДокТЧ.Ссылка
		|		ПО НужныеРемонты.ИД = ДокТЧ.ID И ДокТЧ.Ссылка.ПометкаУдаления = Ложь
		|Сгруппировать по ДокТЧ.Ссылка,
		|	ДокТЧ.Ссылка.СпособСогласования
		|	,РегистрСведенийторо_ТекущиеСтатусыСогласованияДокументов.СтатусДокумента
		|;
		|Выбрать
		|ВТ.Ссылка КАК Ссылка,
		|ВТ.Статус КАК Статус,
		|ВТ.гкс_РаботыВыполнены КАК гкс_РаботыВыполнены,
		|ЕстьNULL(РегистрСведенийторо_НастройкиСтатусовСогласованияДокументов.СогласованиеЗавершено, Ложь) КАК СогласованиеЗавершено
		|ИЗ ВТ_ТекущийСтатус КАК ВТ
		|Левое соединение  РегистрСведений.торо_НастройкиСтатусовСогласованияДокументов КАК РегистрСведенийторо_НастройкиСтатусовСогласованияДокументов
		|	ПО РегистрСведенийторо_НастройкиСтатусовСогласованияДокументов.Статус = ВТ.Статус
		|	И РегистрСведенийторо_НастройкиСтатусовСогласованияДокументов.СпособСогласования = ВТ.Способ
		|
		|
		|";
	// гкс- [] Деснол 10.10.2022
	Запрос.УстановитьПараметр("ТЧ1", РемонтыОборудования.Выгрузить());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Пакет1 = 1;
	Пакет2 = Пакет1 + 2;
	Если РезультатЗапроса[Пакет1].Пустой() = Ложь Тогда 
		Выборка = РезультатЗапроса[Пакет1].Выбрать();
		Выборка.Следующий();
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='По ремонту уже есть акт приемки ';
		|en='Repair equipment acceptance certificate exists'") + Строка(Выборка.Ссылка);
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	//
	Если РезультатЗапроса[Пакет2].Пустой() Тогда 
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='По ремонту нет выполненных актов';
		|en='Repair equipment acceptance certificate exists'");
		Сообщение.Сообщить();
		Возврат;
	Иначе
		Выборка = РезультатЗапроса[Пакет2].Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.гкс_РаботыВыполнены = Ложь Тогда 
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = НСтр("ru='Не все акты по ремонту выполнены';
				|en='Repair equipment acceptance certificate exists'");
				Сообщение.Сообщить();
				Отказ = Истина;
				Возврат;
			// гкс+ [] Деснол 24.08.2022
			Иначе
				Если Не ЗначениеЗаполнено(Выборка.Статус) 
					ИЛИ (Не Выборка.Статус = Справочники.торо_СтатусыСогласованияДокументовРемонтныхРабот.Согласован
					И Не Выборка.СогласованиеЗавершено ) Тогда 
					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = НСтр("ru='Не все акты по ремонту согласованы';
					|en='Repair equipment acceptance certificate exists'");
					Сообщение.Сообщить();
					Отказ = Истина;
					Возврат;
				КонецЕсли;
			// гкс- [] Деснол 24.08.2022
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
// гкс- [разработка 2021] Куст 28.04.2021

// гкс+ [разработка 2021] Куст 28.04.2021
Процедура гкс_ОтменитьЗакрытиеАктов()
	гкс_ЗакрытьАкты(Ложь);
КонецПроцедуры
// гкс- [разработка 2021] Куст 28.04.2021
#КонецОбласти