

#Область ОбработчикиСобытий
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Идентификатор = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ИерархияТип")).ИдентификаторПользовательскойНастройки;
	СтрокаПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Идентификатор);
	
	Если СтрокаПараметр.Значение.СтроитсяАвтоматически Тогда
		СхемаКомпоновкиДанных.НаборыДанных.Объекты.Запрос = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	торо_ОбъектыРемонта.Ссылка КАК ОбъектРемонта,
			|	торо_ОбъектыРемонта." + СтрокаПараметр.Значение.РеквизитОР + "  КАК ОбъектИерархии,
			|	торо_ОбъектыРемонта.ДатаВводаВЭксплуатацию,
			|	торо_ОбъектыРемонта.СрокПолезногоИспользования,
			|	ВЫБОР
			|		КОГДА торо_ОбъектыРемонта.СрокПолезногоИспользования ЕСТЬ NULL 
			|				ИЛИ торо_ОбъектыРемонта.СрокПолезногоИспользования = 0
			|			ТОГДА 0
			|		ИНАЧЕ РАЗНОСТЬДАТ(торо_ОбъектыРемонта.ДатаВводаВЭксплуатацию, &Дата, МЕСЯЦ) / торо_ОбъектыРемонта.СрокПолезногоИспользования * 100
			|	КОНЕЦ КАК ПроцентИспользования,
			|	ВЫБОР
			|		КОГДА торо_ОбъектыРемонта.СрокПолезногоИспользования ЕСТЬ NULL 
			|				ИЛИ торо_ОбъектыРемонта.СрокПолезногоИспользования = 0
			|			ТОГДА 0
			|		ИНАЧЕ торо_ОбъектыРемонта.СрокПолезногоИспользования - РАЗНОСТЬДАТ(торо_ОбъектыРемонта.ДатаВводаВЭксплуатацию, &Дата, МЕСЯЦ)
			|	КОНЕЦ КАК ОстаточныйСрокПолезногоИспользования
			|ПОМЕСТИТЬ ВТ_ОР
			|ИЗ
			|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
			|ГДЕ НЕ торо_ОбъектыРемонта.ЭтоГруппа;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ 
			|	ВТ_ОР.ОбъектРемонта,
			|	ВТ_ОР.ОбъектИерархии,
			|	ВТ_ОР.ДатаВводаВЭксплуатацию,
			|	ВТ_ОР.СрокПолезногоИспользования,
			|	ВТ_ОР.ПроцентИспользования,
			|	ВТ_ОР.ОстаточныйСрокПолезногоИспользования,
			|	ВЫБОР
			|		КОГДА ВТ_ОР.ПроцентИспользования <= 20
			|			ТОГДА ""Износ менее 20%""
			|		КОГДА ВТ_ОР.ПроцентИспользования > 20
			|				И ВТ_ОР.ПроцентИспользования <= 40
			|			ТОГДА ""Износ от 20% до 40%""
			|		КОГДА ВТ_ОР.ПроцентИспользования > 40
			|				И ВТ_ОР.ПроцентИспользования <= 60
			|			ТОГДА ""Износ от 40% до 60%""
			|		КОГДА ВТ_ОР.ПроцентИспользования > 60
			|				И ВТ_ОР.ПроцентИспользования <= 80
			|			ТОГДА ""Износ от 60% до 80%""
			|		ИНАЧЕ ""Износ более 80%""
			|	КОНЕЦ КАК ИзносОбъектаРемонта
			|ИЗ
			|	ВТ_ОР КАК ВТ_ОР";

			
		Если Метаданные.Справочники[СтрокаПараметр.Значение.ТипРеквизитаОР].Иерархический Тогда
			
			СхемаКомпоновкиДанных.НаборыДанных.Иерархия.Запрос = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СправочникСсылка.Ссылка КАК ОбъектИерархии,
			|	СправочникСсылка.Родитель КАК РодительИерархии
			|ИЗ
			|	Справочник." + СтрокаПараметр.Значение.ТипРеквизитаОР + " КАК СправочникСсылка
			|ГДЕ
			|	СправочникСсылка.Ссылка В (&Элемент)";
			
			СхемаКомпоновкиДанных.НаборыДанных.Контроль.Запрос = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СправочникСсылка.Ссылка КАК ЭлементКонтроль,
			|	СправочникСсылка.Родитель КАК РодительКонтроль
			|ИЗ
			|	Справочник." + СтрокаПараметр.Значение.ТипРеквизитаОР + " КАК СправочникСсылка
			|ГДЕ
			|	СправочникСсылка.Родитель В(&Родитель)";
			
		Иначе
			
			СхемаКомпоновкиДанных.НаборыДанных.Иерархия.Запрос = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СправочникСсылка.Ссылка КАК ОбъектИерархии,
			|	Значение(Справочник." + СтрокаПараметр.Значение.ТипРеквизитаОР + ".ПустаяСсылка) КАК РодительИерархии
			|ИЗ
			|	Справочник." + СтрокаПараметр.Значение.ТипРеквизитаОР + " КАК СправочникСсылка"; 
			
			СхемаКомпоновкиДанных.НаборыДанных.Контроль.Запрос = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СправочникСсылка.Ссылка КАК ЭлементКонтроль,
			|	Значение(Справочник." + СтрокаПараметр.Значение.ТипРеквизитаОР + ".ПустаяСсылка) КАК РодительКонтроль
			|ИЗ
			|	Справочник." + СтрокаПараметр.Значение.ТипРеквизитаОР + " КАК СправочникСсылка"; 
						
		КонецЕсли;
		ПолеИерархия = СхемаКомпоновкиДанных.НаборыДанных.Объекты.Поля.Найти("ОбъектИерархии");
		ПолеИерархия.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка."+СтрокаПараметр.Значение.ТипРеквизитаОР);
		
		Структура = КомпоновщикНастроек.Настройки.Структура;
		Если Структура.Количество() > 0 И ТипЗнч(Структура[0]) = Тип("ГруппировкаКомпоновкиДанных") Тогда
			ЭлементыГруппировки = Структура[0].ПоляГруппировки.Элементы;
			Для каждого Элемент из ЭлементыГруппировки Цикл
				Если Элемент.Поле = Новый ПолеКомпоновкиДанных("ОбъектИерархии") Тогда
					Элемент.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Иерархия;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	Иначе

		Структура = КомпоновщикНастроек.Настройки.Структура;
		Если Структура.Количество() > 0 И ТипЗнч(Структура[0]) = Тип("ГруппировкаКомпоновкиДанных") Тогда
			ЭлементыГруппировки = Структура[0].ПоляГруппировки.Элементы;
			Для каждого Элемент из ЭлементыГруппировки Цикл
				Если Элемент.Поле = Новый ПолеКомпоновкиДанных("ОбъектИерархии") Тогда
					Элемент.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.ТолькоИерархия;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если СтрокаПараметр.Значение.ИзменяетсяДокументами Тогда
			СхемаКомпоновкиДанных.НаборыДанных.Объекты.Запрос = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Документами.ОбъектИерархии КАК ОбъектРемонта,
			|	Документами.ОбъектИерархии КАК ОбъектИерархии,
			|	Документами.РодительИерархии КАК РодительИерархии,
			|	торо_ОбъектыРемонта.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
			|	торо_ОбъектыРемонта.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
			|	ВЫБОР
			|		КОГДА торо_ОбъектыРемонта.СрокПолезногоИспользования ЕСТЬ NULL
			|				ИЛИ торо_ОбъектыРемонта.СрокПолезногоИспользования = 0
			|			ТОГДА 0
			|		ИНАЧЕ РАЗНОСТЬДАТ(торо_ОбъектыРемонта.ДатаВводаВЭксплуатацию, &Дата, МЕСЯЦ) / торо_ОбъектыРемонта.СрокПолезногоИспользования * 100
			|	КОНЕЦ КАК ПроцентИспользования,
			|	ВЫБОР
			|		КОГДА торо_ОбъектыРемонта.СрокПолезногоИспользования ЕСТЬ NULL
			|				ИЛИ торо_ОбъектыРемонта.СрокПолезногоИспользования = 0
			|			ТОГДА 0
			|		ИНАЧЕ торо_ОбъектыРемонта.СрокПолезногоИспользования - РАЗНОСТЬДАТ(торо_ОбъектыРемонта.ДатаВводаВЭксплуатацию, &Дата, МЕСЯЦ)
			|	КОНЕЦ КАК ОстаточныйСрокПолезногоИспользования
			|ПОМЕСТИТЬ ВТ_ОР
			|ИЗ
			|	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(&Дата, СтруктураИерархии = &ИерархияТип) КАК Документами
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
			|		ПО Документами.ОбъектИерархии = торо_ОбъектыРемонта.Ссылка
			|ГДЕ
			|	НЕ Документами.Удален
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ОР.ОбъектРемонта КАК ОбъектРемонта,
			|	ВТ_ОР.ОбъектИерархии КАК ОбъектИерархии,
			|	ВТ_ОР.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
			|	ВТ_ОР.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
			|	ВТ_ОР.ПроцентИспользования КАК ПроцентИспользования,
			|	ВТ_ОР.ОстаточныйСрокПолезногоИспользования КАК ОстаточныйСрокПолезногоИспользования,
			|	ВЫБОР
			|		КОГДА ВТ_ОР.ПроцентИспользования <= 20
			|			ТОГДА ""Износ менее 20%""
			|		КОГДА ВТ_ОР.ПроцентИспользования > 20
			|				И ВТ_ОР.ПроцентИспользования <= 40
			|			ТОГДА ""Износ от 20% до 40%""
			|		КОГДА ВТ_ОР.ПроцентИспользования > 40
			|				И ВТ_ОР.ПроцентИспользования <= 60
			|			ТОГДА ""Износ от 40% до 60%""
			|		КОГДА ВТ_ОР.ПроцентИспользования > 60
			|				И ВТ_ОР.ПроцентИспользования <= 80
			|			ТОГДА ""Износ от 60% до 80%""
			|		ИНАЧЕ ""Износ более 80%""
			|	КОНЕЦ КАК ИзносОбъектаРемонта
			|ИЗ
			|	ВТ_ОР КАК ВТ_ОР";
			
			СхемаКомпоновкиДанных.НаборыДанных.Иерархия.Запрос = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Документами.ОбъектИерархии КАК ОбъектИерархии,
			|	Документами.РодительИерархии КАК РодительИерархии
			|ИЗ
			|	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(&Дата, СтруктураИерархии = &ИерархияТип) КАК Документами
			|ГДЕ
			|	Документами.ОбъектИерархии В(&Элемент)
			|	И НЕ Документами.Удален";
			
			СхемаКомпоновкиДанных.НаборыДанных.Контроль.Запрос = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Документами.ОбъектИерархии КАК ЭлементКонтроль,
			|	Документами.РодительИерархии КАК РодительКонтроль
			|ИЗ
			|	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(&Дата, СтруктураИерархии = &ИерархияТип) КАК Документами
			|ГДЕ
			|	Документами.РодительИерархии В(&Родитель)
			|	И НЕ Документами.Удален";
			
		Иначе
			СхемаКомпоновкиДанных.НаборыДанных.Объекты.Запрос = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	БезДокументов.ОбъектИерархии КАК ОбъектРемонта,
			|	БезДокументов.ОбъектИерархии КАК ОбъектИерархии,
			|	БезДокументов.РодительИерархии КАК РодительИерархии,
			|	торо_ОбъектыРемонта.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
			|	торо_ОбъектыРемонта.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
			|	ВЫБОР
			|		КОГДА торо_ОбъектыРемонта.СрокПолезногоИспользования ЕСТЬ NULL
			|				ИЛИ торо_ОбъектыРемонта.СрокПолезногоИспользования = 0
			|			ТОГДА 0
			|		ИНАЧЕ РАЗНОСТЬДАТ(торо_ОбъектыРемонта.ДатаВводаВЭксплуатацию, &Дата, МЕСЯЦ) / торо_ОбъектыРемонта.СрокПолезногоИспользования * 100
			|	КОНЕЦ КАК ПроцентИспользования,
			|	ВЫБОР
			|		КОГДА торо_ОбъектыРемонта.СрокПолезногоИспользования ЕСТЬ NULL
			|				ИЛИ торо_ОбъектыРемонта.СрокПолезногоИспользования = 0
			|			ТОГДА 0
			|		ИНАЧЕ торо_ОбъектыРемонта.СрокПолезногоИспользования - РАЗНОСТЬДАТ(торо_ОбъектыРемонта.ДатаВводаВЭксплуатацию, &Дата, МЕСЯЦ)
			|	КОНЕЦ КАК ОстаточныйСрокПолезногоИспользования
			|ПОМЕСТИТЬ ВТ_ОР
			|ИЗ
			|	РегистрСведений.торо_ИерархическиеСтруктурыОР КАК БезДокументов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
			|		ПО БезДокументов.ОбъектИерархии = торо_ОбъектыРемонта.Ссылка
			|ГДЕ
			|	БезДокументов.СтруктураИерархии = &ИерархияТип
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ОР.ОбъектРемонта КАК ОбъектРемонта,
			|	ВТ_ОР.ОбъектИерархии КАК ОбъектИерархии,
			|	ВТ_ОР.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
			|	ВТ_ОР.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
			|	ВТ_ОР.ПроцентИспользования КАК ПроцентИспользования,
			|	ВТ_ОР.ОстаточныйСрокПолезногоИспользования КАК ОстаточныйСрокПолезногоИспользования,
			|	ВЫБОР
			|		КОГДА ВТ_ОР.ПроцентИспользования <= 20
			|			ТОГДА ""Износ менее 20%""
			|		КОГДА ВТ_ОР.ПроцентИспользования > 20
			|				И ВТ_ОР.ПроцентИспользования <= 40
			|			ТОГДА ""Износ от 20% до 40%""
			|		КОГДА ВТ_ОР.ПроцентИспользования > 40
			|				И ВТ_ОР.ПроцентИспользования <= 60
			|			ТОГДА ""Износ от 40% до 60%""
			|		КОГДА ВТ_ОР.ПроцентИспользования > 60
			|				И ВТ_ОР.ПроцентИспользования <= 80
			|			ТОГДА ""Износ от 60% до 80%""
			|		ИНАЧЕ ""Износ более 80%""
			|	КОНЕЦ КАК ИзносОбъектаРемонта
			|ИЗ
			|	ВТ_ОР КАК ВТ_ОР";
			
			СхемаКомпоновкиДанных.НаборыДанных.Иерархия.Запрос = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	БезДокументов.ОбъектИерархии КАК ОбъектИерархии,
				|	БезДокументов.РодительИерархии КАК РодительИерархии
				|ИЗ
				|	РегистрСведений.торо_ИерархическиеСтруктурыОР КАК БезДокументов
				|ГДЕ
				|	БезДокументов.СтруктураИерархии = &ИерархияТип
				|	И БезДокументов.ОбъектИерархии В(&Элемент)";
				
			СхемаКомпоновкиДанных.НаборыДанных.Контроль.Запрос = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	БезДокументов.ОбъектИерархии КАК ЭлементКонтроль,
				|	БезДокументов.РодительИерархии КАК РодительКонтроль
				|ИЗ
				|	РегистрСведений.торо_ИерархическиеСтруктурыОР КАК БезДокументов
				|ГДЕ
				|	БезДокументов.СтруктураИерархии = &ИерархияТип
				|	И БезДокументов.РодительИерархии В(&Родитель)";
				
		КонецЕсли;
		ПолеИерархия = СхемаКомпоновкиДанных.НаборыДанных.Объекты.Поля.Найти("ОбъектИерархии");
		ПолеИерархия.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта");
		
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - УправляемаяФорма - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - Структура - см. возвращаемое значение ФункцииОтчетовКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	Настройки.ВыводитьСуммуВыделенныхЯчеек = Ложь;
	Настройки.События.ПослеЗаполненияПанелиБыстрыхНастроек = Истина;
КонецПроцедуры

Процедура ПослеЗаполненияПанелиБыстрыхНастроек(Форма, ПараметрыЗаполнения) Экспорт
	
	ПараметрыФормы = Форма.Параметры;
	
	ЭлементыНастроек = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	
	Параметр = Неопределено;
	
	Для каждого Элемент Из ЭлементыНастроек Цикл
		Если ТипЗнч(Элемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			Если Строка(Элемент.Параметр) = "ИерархияТип" Тогда
				Параметр = Элемент;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Параметр <> Неопределено
		И ПараметрыФормы.Свойство("ИерархияТип") 
		И ЗначениеЗаполнено(ПараметрыФормы.ИерархияТип) Тогда
		
		Параметр.Значение = ПараметрыФормы.ИерархияТип;
		Параметр.Использование = Истина;
			
	КонецЕсли;
	
	Если Не Параметр = Неопределено
		И Не ЗначениеЗаполнено(Параметр.Значение) Тогда
		
		ТекСтруктураИерархии = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"НастройкиТОиР",
		"ОсновнаяСтруктураИерархии",
		Справочники.торо_СтруктурыОР.ПустаяСсылка());
		Если не ТекСтруктураИерархии = Неопределено Тогда
			Параметр.Значение = ТекСтруктураИерархии;
			параметр.Использование = Истина;
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры
 
#КонецОбласти

#КонецЕсли