///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ФайлыБольшие = Параметры.ФайлыБольшие;
	
	МаксимальныйРазмерФайла = Цел(РаботаСФайлами.МаксимальныйРазмерФайла() / (1024 * 1024));
	
	Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	    НСтр("es='Algunos ficheros superan la dimensión máxima (%1 Mb) y no serán añadido en el depósito. "
"¿Continuar la importación?';ru='Некоторые файлы превышают предельный размер (%1 Мб) и не будут добавлены в хранилище."
"Продолжить импорт?';en='Some files exceed the size limit (%1 Mb) and will not be added to the repository."
"Continue importing? '"),
	    Строка(МаксимальныйРазмерФайла) );
	
	Заголовок = Параметры.Заголовок;
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Верх;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
