#Область ОбработчикиСобытийЭлементовТаблицыФормыОбъектыРемонта

&НаКлиенте
&ИзменениеИКонтроль("ОбъектыРемонтаОбъектРемонтаНачалоВыбора")
Процедура Расш_гкс_ОбъектыРемонтаОбъектРемонтаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ТекДанные = Элементы.ОбъектыРемонта.ТекущиеДанные;

	ОбъектыРемонтаПриАктивизацииСтроки(Элементы.ОбъектыРемонта);

	Если НЕ ТекДанные = Неопределено Тогда
		Если ТипЗнч(ТекДанные.ОбъектРемонта) = Тип("СправочникСсылка.торо_ОбъектыРемонта") Тогда
			СтандартнаяОбработка = Ложь;     
			СписокДоступныхСтатусов = торо_СтатусыОРВУчете.СписокСтатусовДляПодбора();
			СтарыйОР = ТекДанные.ОбъектРемонта;

			ПараметрыОтбора = Новый Структура("СписокСтатусов", СписокДоступныхСтатусов);
			ПараметрыОтбора.Вставить("СтруктураИерархии", ТекСтруктураИерархии);
			ПараметрыОтбора.Вставить("ТекущаяСтрока", СтарыйОР);
			#Вставка
			ТемпМассив = Новый Массив();
			ПараметрыОтбора.Вставить("ОтборТипОбъекта",торо_ОбщегоНазначенияКлиентПовтИсп.ПолучитьПеречисление("торо_ТипыОбъектовRCM","ФункциональноеМесто"));
			ПараметрыОтбора.Вставить("ИспользоватьОтборТипОбъекта",Истина);
			ПараметрыОтбора.Вставить("ОтборТипОбъектаУсловиеРавно",Ложь);
			#КонецВставки

			ОткрытьФорму("Справочник.торо_ОбъектыРемонта.ФормаВыбора",ПараметрыОтбора,Элемент,,ВариантОткрытияОкна.ОтдельноеОкно,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

		ИначеЕсли ТекДанные.ОбъектРемонта = Неопределено Тогда 
			СтандартнаяОбработка = Ложь;

			СписокВыбора = ЗаполнитьСписокЗначение();

			Если СписокВыбора.Количество() = 1 Тогда     

				ОбъектыРемонтаОбъектРемонтаНачалоВыбораЗавершение(СписокВыбора[0], Новый Структура("Элемент", Элемент));

			Иначе
				СписокВыбора.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ОбъектыРемонтаОбъектРемонтаНачалоВыбораЗавершение",ЭтотОбъект, Новый Структура("Элемент",Элемент)),НСтр("es='La elección del tipo de datos';ru='Выбор типа данных';en='Data type selection'"));
			КонецЕсли;

		Иначе
			СтандартнаяОбработка = Ложь; 
			СтарыйОР = ТекДанные.ОбъектРемонта;
			ФормаВыбора = ПолучитьФорму("Справочник.торо_СписокОбъектовРегламентногоМероприятия.ФормаВыбора",, Элемент, Объект.Ссылка);
			ФормаВыбора.Открыть();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти