
&НаСервере
Процедура Расш_гкс_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// гкс+ [Часовые пояса] Куст 09.04.2020
	Сдвиг = Час(ТекущаяДатаСеанса()) - Час(ТекущаяДата());
	ТекстыЗамены = Новый Массив();
	ТекстыЗамены.Добавить(Новый Структура("До, После", "торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала",
		" Выбор когда ЕстьNull(торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала, ДатаВремя(1,1,1)) = ДатаВремя(1,1,1) Тогда ДатаВремя(1,1,1) иначе
		| ДобавитьКДате(торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала, Час, " + Сдвиг + ") Конец"));
	ТекстыЗамены.Добавить(Новый Структура("До, После", "торо_АктуальныеПлановыеДатыРемонтов.ДатаОкончания",
		" Выбор когда ЕстьNull(торо_АктуальныеПлановыеДатыРемонтов.ДатаОкончания, ДатаВремя(1,1,1)) = ДатаВремя(1,1,1) Тогда ДатаВремя(1,1,1) иначе
		| ДобавитьКДате(торо_АктуальныеПлановыеДатыРемонтов.ДатаОкончания, Час, " + Сдвиг + ") Конец"));
	Ремонты.ТекстЗапроса = гкс_ЧасовыеПоясаВызовСервера.ИзменитьТекстЗапросаФормыСписка(
		Ремонты.ТекстЗапроса, ТекстыЗамены);
	// гкс- [Часовые пояса] Куст 09.04.2020
КонецПроцедуры
