
// Переводит реквизиты формы на часовой пояс клиента
Процедура гкс_ПеревестиНаЧПКлиента(ЭтаФорма, Реквизиты = Неопределено,
								Объект = Неопределено, 
								ДатаКлиента = Неопределено)Экспорт
	// Гкс+[TOIR20-608] Вялых Д.А. от 21.07.2025. Добавлено:{							
	Если Не ДатаКлиента = Неопределено Тогда 
		ДатаСервера = ТекущаяДата();
		Если Секунда(ДатаСервера) >= Секунда(ДатаКлиента) Тогда 
			Разница = Час(ДатаКлиента) - Час(ДатаСервера) ;
		Иначе
			Разница = Час(ДатаКлиента) - Час(ДатаСервера) + 1;
		КонецЕсли;
		ЭтаФорма["гкс_СдвигЧП"] = Разница;
		ЭтаФорма["гкс_РеквизитыДаты"] = Реквизиты;
	КонецЕсли;
	
	Если Реквизиты = Неопределено Тогда 
		Реквизиты = ЭтаФорма["гкс_РеквизитыДаты"];
	КонецЕсли;
	
	Если Объект = Неопределено Тогда 
		Объект = ЭтаФорма.Объект;
	КонецЕсли;
	
	гкс_ПеревестиРеквизиты(Объект, Реквизиты, (ЭтаФорма["гкс_СдвигЧП"] * 3600));
	// } Гкс-[TOIR20-558] Вялых Д.А. от 21.07.2025.
КонецПроцедуры 

// Переводит реквизиты-даты объекта по сдвигу
Процедура гкс_ПеревестиРеквизиты(Объект, Реквизиты, Сдвиг)
	// Гкс+[TOIR20-608] Вялых Д.А. от 21.07.2025. Добавлено :{
	Если Сдвиг = 0 Тогда 
		Возврат;
	КонецЕсли;
	МассивИменРеквизитов = СтрРазделить(Реквизиты, ",", Ложь);
	Для Каждого ИмяРеквизита Из МассивИменРеквизитов Цикл
		ЧастиИмени = СтрРазделить(ИмяРеквизита, ".", Ложь);
		Если ЧастиИмени.Количество() = 1 Тогда 
			Если ЗначениеЗаполнено(Объект[ИмяРеквизита]) Тогда 
				
				Объект[ИмяРеквизита] = Объект[ИмяРеквизита] + Сдвиг;
				
			КонецЕсли;
		Иначе
			Для Каждого СтрокаТаблицы Из Объект[ЧастиИмени[0]] Цикл
				СтруктураПроверки = Новый Структура(ЧастиИмени[1], Неопределено);
				ЗаполнитьЗначенияСвойств(СтруктураПроверки, СтрокаТаблицы);
				Если Не СтруктураПроверки[ЧастиИмени[1]] = Неопределено И ЗначениеЗаполнено(СтрокаТаблицы[ЧастиИмени[1]]) Тогда 
					
					СтрокаТаблицы[ЧастиИмени[1]] = СтрокаТаблицы[ЧастиИмени[1]] + Сдвиг;
					
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	// } Гкс-[TOIR20-558] Вялых Д.А. от 21.07.2025.
КонецПроцедуры
