
&ИзменениеИКонтроль("ВызватьИсключениеЕслиНетПраваАдминистрирования")
Процедура гкс_ВызватьИсключениеЕслиНетПраваАдминистрирования()

	ПроверятьПраваАдминистрированияСистемы = Истина;
	Если ОбщегоНазначения.РазделениеВключено()
		И ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		ПроверятьПраваАдминистрированияСистемы = Ложь;
	КонецЕсли;

	#Вставка
	// Гкс+[TOIR20-290] Пономарев от 17.12.2021. Добавлено:{
	Попытка
		Если РольДоступна("гкс_НастройкиПараметровПодсистемыТОИР") Тогда
			Возврат;
		КонецЕсли;
	Исключение
	КонецПопытки;
	// } Гкс-[TOIR20-290]
	#КонецВставки
	Если НЕ Пользователи.ЭтоПолноправныйПользователь(, ПроверятьПраваАдминистрированияСистемы) Тогда
		ВызватьИсключение НСтр("es='La infracción de los derechos de admisión.';ru='Нарушение прав доступа.';en='Access violation.'");
	КонецЕсли;

КонецПроцедуры
