
#Область Прочее
// гкс+ [разработка 2021] Куст 05.05.2021
&НаСервере
&ИзменениеИКонтроль("ЗаполнитьДеревоПланаГрафикаППРСУчетомПозиции")
Процедура гкс_ЗаполнитьДеревоПланаГрафикаППРСУчетомПозиции()

	ТаблицаОбъектовРемонта = Объект.ОбъектыРемонта.Выгрузить();
	ДеревоПланаГрафикаППРСУчетомПозиции.ПолучитьЭлементы().Очистить();

	ТаблицаОбъектовРемонта.Колонки.Добавить("Положение", Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта"));

	Если мОтображатьПоложение Тогда
		МассивОР = ТаблицаОбъектовРемонта.ВыгрузитьКолонку("ОбъектРемонтныхРабот");
		СоответствиеПоложений = торо_РаботаСИерархией20.ПолучитьТекущихРодителейВИерархии(МассивОР, СтруктураИерархии,,Истина,Истина);

		Для каждого СтрокаТаблицы из ТаблицаОбъектовРемонта Цикл
			СтрокаТаблицы.Положение = СоответствиеПоложений[СтрокаТаблицы.ОбъектРемонтныхРабот];
		КонецЦикла;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаОбъектов.Положение КАК Положение,
	|	ТаблицаОбъектов.ОбъектРемонтныхРабот КАК ОбъектРемонта,
	|	ТаблицаОбъектов.ВидРемонтныхРабот КАК ВидРемонта
	|ПОМЕСТИТЬ ТаблицаОбъектов
	|ИЗ
	|	&ТаблицаОбъектов КАК ТаблицаОбъектов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОбъектов.Положение КАК Положение,
	|	ТаблицаОбъектов.ОбъектРемонта КАК ОбъектРемонта,
	|	ТаблицаОбъектов.ВидРемонта КАК ВидРемонта
	|ИЗ
	|	ТаблицаОбъектов КАК ТаблицаОбъектов
	|ИТОГИ ПО
	|	Положение,
	|	ОбъектРемонта";

	Запрос.УстановитьПараметр("ТаблицаОбъектов", ТаблицаОбъектовРемонта);
	ВыборкаПоложение = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	СтрокиДерева = СоздатьКореньДерева();

	Пока ВыборкаПоложение.Следующий() Цикл

		Если ЗначениеЗаполнено(ВыборкаПоложение.Положение) Тогда
			#Удаление
			СтрокаПоложения = ДобавитьСтрокуПоложенияВДерево(СтрокиДерева.ПолучитьЭлементы(), ВыборкаПоложение.Положение);
			#КонецУдаления
			#Вставка
			СтрокаПоложения = гкс_ДобавитьСтрокуПоложенияВДерево(СтрокиДерева.ПолучитьЭлементы(), ВыборкаПоложение.Положение);
			#КонецВставки
		Иначе
			СтрокаПоложения = СтрокиДерева;
		КонецЕсли;

		ВыборкаОР = ВыборкаПоложение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

		Пока ВыборкаОР.Следующий() Цикл
			СтрокаОР = ДобавитьСтрокуОРВДерево(СтрокаПоложения, ВыборкаОР.ОбъектРемонта);
			ВыборкаВидовРемонта = ВыборкаОР.Выбрать(ОбходРезультатаЗапроса.Прямой);
			Пока ВыборкаВидовРемонта.Следующий() Цикл
				ДобавитьСтрокуВидаРемонтаВДерево(СтрокаОР, ВыборкаВидовРемонта.ВидРемонта);
			КонецЦикла;
		КонецЦикла;

	КонецЦикла;

КонецПроцедуры
// гкс- [разработка 2021] Куст 05.05.2021

// гкс+ [разработка 2021] Куст 05.05.2021
&НаКлиентеНаСервереБезКонтекста
Функция гкс_ДобавитьСтрокуПоложенияВДерево(СтрокиДерева, ПоложениеОР, НомерКартинки = Неопределено)
		
	СтрокаПоложения = СтрокиДерева.Добавить();
	СтрокаПоложения.Ремонты = ПоложениеОР;
	СтрокаПоложения.Положение = ПоложениеОР;
	НомерКартинки4 = 4;
	НомерКартинки2 = 2;
	Если НомерКартинки = Неопределено Тогда 
		Если ПоложениеОР = ПредставлениеПустогоРодителя() Тогда 
			СтрокаПоложения.НомерКартинки = ?(ПоложениеОР = ПредставлениеПустогоРодителя(), НомерКартинки4, НомерКартинки2);
		Иначе
			СтрокаПоложения.НомерКартинки = гкс_ПолучитьКартинкуПоСсылке(ПоложениеОР);
		КонецЕсли;
	Иначе
		СтрокаПоложения.НомерКартинки = НомерКартинки;
	КонецЕсли;
	
	Возврат СтрокаПоложения;
	
КонецФункции
// гкс- [разработка 2021] Куст 05.05.2021

// гкс+ [разработка 2021] Куст 05.05.2021
&НаСервереБезКонтекста
Функция гкс_ПолучитьКартинкуПоСсылке(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Спр.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто) КАК ЭтоФМ,
		|	Спр.ЭтоГруппа КАК ЭтоГруппа,
		|	Спр.ПометкаУдаления КАК ПометкаУдаления
		|ИЗ
		|	Справочник.торо_ОбъектыРемонта КАК Спр
		|ГДЕ
		|	Спр.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() = Ложь Тогда 
		НомерКартинки11 = 11;
		НомерКартинки5 = 5;
		НомерКартинки2 = 2;
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Если Выборка.ЭтоГруппа Тогда 
			Возврат НомерКартинки5 + ?(Выборка.ПометкаУдаления, 1, 0);
		Иначе
			Если Выборка.ЭтоФМ Тогда 
				Возврат НомерКартинки11 + ?(Выборка.ПометкаУдаления, 1, 0);
			Иначе
				Возврат НомерКартинки2 + ?(Выборка.ПометкаУдаления, 1, 0);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат 0;
КонецФункции
// гкс- [разработка 2021] Куст 05.05.2021

// гкс+ [разработка 2021] Куст 05.05.2021
&НаКлиенте
&ИзменениеИКонтроль("НайтиИлиДобавитьСтрокуОРВДереве")
Функция гкс_НайтиИлиДобавитьСтрокуОРВДереве(Родитель, ОбъектРемонта, РодителиОР, СтрокиОРВДереве)

	СтрокаОР = СтрокиОРВДереве.Получить(ОбъектРемонта);

	Если СтрокаОР = Неопределено Тогда
		Если мОтображатьПоложение Тогда
			ПоложениеОР = РодителиОР.Получить(ОбъектРемонта);
			Если ПоложениеОР = Неопределено ИЛИ ПоложениеОР = ПредопределенноеЗначение("Справочник.торо_ОбъектыРемонта.ПустаяСсылка") Тогда
				ПоложениеОР = ПредставлениеПустогоРодителя();
			КонецЕсли;

			СтрокиРодителя = торо_ДанныеФормыДеревоКлиентСервер.НайтиСтроки(
			Родитель,
			Новый Структура("Положение", ПоложениеОР),
			УровеньПоложенияВДереве,УровеньПоложенияВДереве,1
			);

			Если СтрокиРодителя.Количество() = 0 И ПоложениеОР = ПредставлениеПустогоРодителя() Тогда
				СтрокаРодителя = Родитель;
			ИначеЕсли СтрокиРодителя.Количество() = 0 И Не ПоложениеОР = ПредставлениеПустогоРодителя() Тогда
				#Удаление
				СтрокаРодителя = ДобавитьСтрокуПоложенияВДерево(Родитель.ПолучитьЭлементы(), ПоложениеОР);
				#КонецУдаления
				#Вставка
				СтрокаРодителя = гкс_ДобавитьСтрокуПоложенияВДерево(Родитель.ПолучитьЭлементы(), ПоложениеОР);
				#КонецВставки
			Иначе
				СтрокаРодителя = СтрокиРодителя[0];
			КонецЕсли;

			СтрокаОР = ДобавитьСтрокуОРВДерево(СтрокаРодителя, ОбъектРемонта);
		Иначе
			СтрокаОР = ДобавитьСтрокуОРВДерево(Родитель, ОбъектРемонта);
		КонецЕсли;
	КонецЕсли;

	Возврат СтрокаОР;

КонецФункции
// гкс- [разработка 2021] Куст 05.05.2021

&НаСервере
Процедура гкс_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	гкс_ПересчетППР.ДобавитьЭлементыНаФорму(ЭтаФорма, Элементы.Группа7);
КонецПроцедуры

&НаКлиенте
Процедура гкс_ПродлеватьАвтоматическиПриИзменении(Элемент)
	гкс_ПересчетППР.ВключитьПролонгациюППР(Объект.Ссылка, ЭтотОбъект["гкс_ПродлеватьАвтоматически"]);
КонецПроцедуры

#КонецОбласти