
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	ДатаНачала = НачалоГода(ТекущаяДата());
	ДатаОкончания = КонецГода(ТекущаяДата());
	Организация = Неопределено;
	
	ПараметрНачала = Новый ПараметрКомпоновкиДанных("ДатаНачала");
	ПараметрОкончания = Новый ПараметрКомпоновкиДанных("ДатаОкончания");
	ПараметрМесяцОтбора = Новый ПараметрКомпоновкиДанных("МесяцОтбора");
	ПараметрОрганизация = Новый ПараметрКомпоновкиДанных("Организация");
	
	Для Каждого СМ Из Настройки.ПараметрыДанных.Элементы Цикл
		Если СМ.Использование = Истина Тогда
			Если СМ.Параметр = ПараметрМесяцОтбора Тогда 
				ДатаНачала = НачалоМесяца(СМ.Значение.Дата);
				ДатаОкончания = КонецМесяца(СМ.Значение.Дата);
			КонецЕсли;
			Если СМ.Параметр = ПараметрОрганизация Тогда 
				Организация = СМ.Значение;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
		
	НастройкиОсновнойСхемы = КомпоновщикНастроек.ПолучитьНастройки();
	ВнешниеНаборыДанных = Новый Структура;
	ТЧРезультат = ПолучитьТаблицуДанных(ДатаНачала, ДатаОкончания, Организация);
	ВнешниеНаборыДанных.Вставить("ВТ_Данные", ТЧРезультат);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОсновнойСхемы, ДанныеРасшифровки);	
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	
	ПроцессорВыводаВТабличныйДокумент = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВыводаВТабличныйДокумент.УстановитьДокумент(ДокументРезультат);	
	ПроцессорВыводаВТабличныйДокумент.Вывести(ПроцессорКомпоновкиДанных);

КонецПроцедуры

Функция ПолучитьТаблицуДанных(ДатаНачала, ДатаОкончания, Организация)
	
	Запрос = Новый Запрос();
	Запрос.Текст = ПолучитьТекстЗапроса();
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаКПИ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ТЧ_Результат = Новый ТаблицаЗначений();
	ТЧ_Результат.Колонки.Добавить("ПроцентКПИ", Новый ОписаниеТипов("Число",,, 
		Новый КвалификаторыЧисла(15,2)));
		ТЧ_Результат.Колонки.Добавить("ПорядокКолонки", Новый ОписаниеТипов("Число",,, 
		Новый КвалификаторыЧисла(10)));
	ТЧ_Результат.Колонки.Добавить("КлючевыеПоказатели", Новый ОписаниеТипов("Строка",,,,
		Новый КвалификаторыСтроки(50)));
	ТЧ_Результат.Колонки.Добавить("ИмяКолонки", Новый ОписаниеТипов("Строка",,,,
		Новый КвалификаторыСтроки(50)));

	Пока ВыборкаКПИ.Следующий() Цикл
		СуммаПроцент = 0;
		Количество = 0;
		Выборка = ВыборкаКПИ.Выбрать();
		Пока Выборка.Следующий() Цикл
			НС = ТЧ_Результат.Добавить();
			НС.КлючевыеПоказатели = ВыборкаКПИ.КлючевыеПоказатели;
			НС.ИмяКолонки = НеделяГода(Выборка.ДатаНедели);
			НС.ПорядокКолонки = НеделяГода(Выборка.ДатаНедели);
			НС.ПроцентКПИ = Выборка.Процент;
			СуммаПроцент = СуммаПроцент + Выборка.Процент;
			Количество = Количество + 1;
		КонецЦикла;
		СреднееЗаМесяц = СуммаПроцент / Количество;
		//
		НС = ТЧ_Результат.Добавить();
		НС.КлючевыеПоказатели = ВыборкаКПИ.КлючевыеПоказатели;
		НС.ИмяКолонки = "Цель";
		НС.ПроцентКПИ = ВыборкаКПИ.Цель;
		НС.ПорядокКолонки = 9997;
		//
		НС = ТЧ_Результат.Добавить();
		НС.КлючевыеПоказатели = ВыборкаКПИ.КлючевыеПоказатели;
		НС.ИмяКолонки = "Отклонение";
		НС.ПроцентКПИ = СреднееЗаМесяц - ВыборкаКПИ.Цель;
		НС.ПорядокКолонки = 9998;
		//
		НС = ТЧ_Результат.Добавить();
		НС.КлючевыеПоказатели = ВыборкаКПИ.КлючевыеПоказатели;
		НС.ИмяКолонки = "Среднее за месяц";
		НС.ПроцентКПИ = СреднееЗаМесяц;
		НС.ПорядокКолонки = 9999;
	КонецЦикла;
	
	Возврат ТЧ_Результат;
КонецФункции

Функция ПолучитьТекстЗапроса()
	Возврат "ВЫБРАТЬ
	        |	ВЫБОР
	        |		КОГДА ТЧ.ЗавершенВовремя
	        |			ТОГДА ТЧ.ВремяРаботы
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК ВремяРаботы,
	        |	ВЫБОР
	        |		КОГДА ТЧ.ЗавершенВовремя
	        |				И ТЧ.ПланВНужномПериоде
	        |			ТОГДА ТЧ.ВремяРаботы
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК ВремяРаботы2,
	        |	ТЧ.Ссылка.ДатаНедели КАК ДатаНедели,
	        |	ТЧ.ВремяРаботыПлан КАК ВремяРаботыПлан,
	        |	ТЧ.ИД_Ремонта КАК ИД_Ремонта,
	        |	ТЧ.ОбъектРемонта КАК ОбъектРемонта,
	        |	ТЧ.ТипРабот КАК ТипРабот,
	        |	ТЧ.Ссылка.ВремяРаботыПлан КАК ВесьПлан,
	        |	ТЧ.ОбъектРемонта.Подразделение КАК Подразделение,
	        |	ЕСТЬNULL(ТЧ.ОбъектРемонта.Направление.гкс_Служба, """") КАК Служба,
	        |	ТЧ.Ссылка.Организация КАК Организация,
	        |	ТЧ.ПланВНужномПериоде КАК ПланВНужномПериоде,
	        |	ТЧ.ЗавершенВовремя КАК ЗавершенВовремя
	        |ПОМЕСТИТЬ ДанныеПериода
	        |ИЗ
	        |	Документ.гкс_РегистрацияЗначенийВнешнихПоказателей.Показатели КАК ТЧ
	        |ГДЕ
	        |	ТЧ.Ссылка.ДатаНедели >= &ДатаНачала
	        |	И ТЧ.Ссылка.ДатаНедели < &ДатаОкончания
	        |	И ТЧ.Ссылка.Проведен
	        |	И ТЧ.Ссылка.Организация = &Организация
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ДанныеПериода.Организация КАК Организация,
	        |	СУММА(ДанныеПериода.ВремяРаботыПлан) КАК ВремяРаботыПлан,
	        |	СУММА(ДанныеПериода.ВремяРаботы) КАК ВремяРаботыФакт,
	        |	ДанныеПериода.ДатаНедели КАК ДатаНедели
	        |ПОМЕСТИТЬ ВесьПланОрганизации
	        |ИЗ
	        |	ДанныеПериода КАК ДанныеПериода
	        |ГДЕ
	        |	ДанныеПериода.ЗавершенВовремя
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ДанныеПериода.Организация,
	        |	ДанныеПериода.ДатаНедели
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ДанныеПериода.Организация КАК Организация,
	        |	СУММА(ДанныеПериода.ВремяРаботыПлан) КАК ВремяРаботыПлан,
	        |	СУММА(ДанныеПериода.ВремяРаботы2) КАК ВремяРаботы2Факт,
	        |	ДанныеПериода.ДатаНедели КАК ДатаНедели
	        |ПОМЕСТИТЬ ВесьПланОрганизации2
	        |ИЗ
	        |	ДанныеПериода КАК ДанныеПериода
	        |ГДЕ
	        |	ДанныеПериода.ПланВНужномПериоде
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ДанныеПериода.Организация,
	        |	ДанныеПериода.ДатаНедели
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ДанныеПериода.ОбъектРемонта КАК ОбъектРемонта,
	        |	ДанныеПериода.Организация КАК Организация,
	        |	ДанныеПериода.Подразделение КАК Подразделение,
	        |	ДанныеПериода.Служба КАК Служба,
	        |	ДанныеПериода.ТипРабот КАК ТипРабот,
	        |	ДанныеПериода.ИД_Ремонта КАК ИД_Ремонта,
	        |	""Эффективность планирования работ"" КАК КлючевыеПоказатели,
	        |	ВЫБОР
	        |		КОГДА ВесьПланОрганизации.ВремяРаботыПлан = 0
	        |			ТОГДА 0
	        |		ИНАЧЕ ДанныеПериода.ВремяРаботы / ВесьПланОрганизации.ВремяРаботыПлан * 100
	        |	КОНЕЦ КАК ПроцентКПИ,
	        |	ДанныеПериода.ДатаНедели КАК ДатаНедели,
	        |	РегЦель.Значение КАК Цель
	        |ПОМЕСТИТЬ СуммаРезультат
	        |ИЗ
	        |	ДанныеПериода КАК ДанныеПериода
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВесьПланОрганизации КАК ВесьПланОрганизации
	        |		ПО ДанныеПериода.Организация = ВесьПланОрганизации.Организация
	        |			И (ДанныеПериода.ЗавершенВовремя)
	        |			И (ВесьПланОрганизации.ДатаНедели = ДанныеПериода.ДатаНедели)
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЦелевыеЗначенияKPI.СрезПоследних(
	        |				&ДатаОкончания,
	        |				Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	        |					И ОбъектРемонта = ЗНАЧЕНИЕ(Справочник.торо_ОбъектыРемонта.ПустаяСсылка)) КАК РегЦель
	        |		ПО ДанныеПериода.Организация = РегЦель.Организация
	        |			И (РегЦель.Показатель.Наименование = ""Эффективность планирования работ"")
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ДанныеПериода.ОбъектРемонта,
	        |	ДанныеПериода.Организация,
	        |	ДанныеПериода.Подразделение,
	        |	ДанныеПериода.Служба,
	        |	ДанныеПериода.ТипРабот,
	        |	ДанныеПериода.ИД_Ремонта,
	        |	""Выполнение плана"",
	        |	ВЫБОР
	        |		КОГДА ВесьПланОрганизации2.ВремяРаботыПлан = 0
	        |			ТОГДА 0
	        |		ИНАЧЕ ДанныеПериода.ВремяРаботы2 / ВесьПланОрганизации2.ВремяРаботыПлан * 100
	        |	КОНЕЦ,
	        |	ДанныеПериода.ДатаНедели,
	        |	РегЦель.Значение
	        |ИЗ
	        |	ДанныеПериода КАК ДанныеПериода
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВесьПланОрганизации2 КАК ВесьПланОрганизации2
	        |		ПО ДанныеПериода.Организация = ВесьПланОрганизации2.Организация
	        |			И (ДанныеПериода.ПланВНужномПериоде)
	        |			И ДанныеПериода.ДатаНедели = ВесьПланОрганизации2.ДатаНедели
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЦелевыеЗначенияKPI.СрезПоследних(
	        |				&ДатаОкончания,
	        |				Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	        |					И ОбъектРемонта = ЗНАЧЕНИЕ(Справочник.торо_ОбъектыРемонта.ПустаяСсылка)) КАК РегЦель
	        |		ПО ДанныеПериода.Организация = РегЦель.Организация
	        |			И (РегЦель.Показатель.Наименование = ""Выполнение плана"")
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ДанныеПериода.ОбъектРемонта,
	        |	ДанныеПериода.Организация,
	        |	ДанныеПериода.Подразделение,
	        |	ДанныеПериода.Служба,
	        |	ДанныеПериода.ТипРабот,
	        |	ДанныеПериода.ИД_Ремонта,
	        |	""Эффективность исполнения работ"",
	        |	ВЫБОР
	        |		КОГДА ВесьПланОрганизации.ВремяРаботыФакт = 0
	        |			ТОГДА 0
	        |		ИНАЧЕ ДанныеПериода.ВремяРаботыПлан / ВесьПланОрганизации.ВремяРаботыФакт * 100
	        |	КОНЕЦ,
	        |	ДанныеПериода.ДатаНедели,
	        |	РегЦель.Значение
	        |ИЗ
	        |	ДанныеПериода КАК ДанныеПериода
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВесьПланОрганизации КАК ВесьПланОрганизации
	        |		ПО ДанныеПериода.Организация = ВесьПланОрганизации.Организация
	        |			И (ДанныеПериода.ЗавершенВовремя)
	        |			И ДанныеПериода.ДатаНедели = ВесьПланОрганизации.ДатаНедели
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЦелевыеЗначенияKPI.СрезПоследних(
	        |				&ДатаОкончания,
	        |				Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	        |					И ОбъектРемонта = ЗНАЧЕНИЕ(Справочник.торо_ОбъектыРемонта.ПустаяСсылка)) КАК РегЦель
	        |		ПО ДанныеПериода.Организация = РегЦель.Организация
	        |			И (РегЦель.Показатель.Наименование = ""Эффективность исполнения работ"")
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	СуммаРезультат.КлючевыеПоказатели КАК КлючевыеПоказатели,
	        |	СУММА(ЕСТЬNULL(СуммаРезультат.ПроцентКПИ, 0)) КАК Процент,
	        |	СуммаРезультат.ДатаНедели КАК ДатаНедели,
	        |	МАКСИМУМ(ЕСТЬNULL(СуммаРезультат.Цель, 0)) КАК Цель
	        |ИЗ
	        |	СуммаРезультат КАК СуммаРезультат
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	СуммаРезультат.КлючевыеПоказатели,
	        |	СуммаРезультат.ДатаНедели
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	ДатаНедели
	        |ИТОГИ
	        |	МАКСИМУМ(Цель)
	        |ПО
	        |	КлючевыеПоказатели";
КонецФункции
