
&ИзменениеИКонтроль("ПолучитьПолеСПереводами")
Функция Расш_гкс_ПолучитьПолеСПереводами(ЭтаФорма, ТекущаяСтрока)
	Результат = Новый Структура("ИмяРеквизита,Переводы");

	ИмяРеквизита = ПолучитьИмяРеквизитаТекущегоПоля(ЭтаФорма);
	Результат.ИмяРеквизита = ИмяРеквизита;

	Языки = торо_Локализация.ПолучитьЯзыкиМассивом();
	#Вставка
	ЯзыкПоУмолчанию = торо_ОбщегоНазначенияПовтИсп.ТекущийЯзыкИБ();
	#КонецВставки
	#Удаление
	ЯзыкПоУмолчанию = торо_Локализация.ТекущийЯзыкИБ();
	#КонецУдаления
	Переводы = Новый Соответствие();

	Для каждого Язык Из Языки Цикл
		ЯзыкСсылка = Язык.Ссылка;

		Если ЯзыкСсылка = ЯзыкПоУмолчанию Тогда
			Значение = ТекущаяСтрока;
		Иначе
			НаименованиеРеквизита = СтрШаблон("Объект_%1", Язык.Код);
			Значение = ЭтаФорма[НаименованиеРеквизита][ИмяРеквизита];
		КонецЕсли;

		Переводы.Вставить(ЯзыкСсылка, Значение);
	КонецЦикла;

	Результат.Переводы = Переводы;

	Возврат Результат;
КонецФункции

&ИзменениеИКонтроль("УстановитьПереводы")
Процедура Расш_гкс_УстановитьПереводы(ЭтаФорма, ВыбранноеЗначение, Элемент)
	ИмяРеквизита 	= ВыбранноеЗначение.ИмяРеквизита;
	Переводы 		= ВыбранноеЗначение.Переводы;
	Языки 			= ВыбранноеЗначение.Языки;

	#Вставка
	ЯзыкПоУмолчанию = торо_ОбщегоНазначенияПовтИсп.ТекущийЯзыкИБ();
	#КонецВставки
	#Удаление
	ЯзыкПоУмолчанию = торо_Локализация.ТекущийЯзыкИБ();
	#КонецУдаления

	Для каждого Перевод Из Переводы Цикл
		Язык = Перевод.Ключ;
		Если Язык = ЯзыкПоУмолчанию Тогда
			ЭтаФорма.Объект[ИмяРеквизита] = Перевод.Значение;
		Иначе
			НаименованиеРеквизита = СтрШаблон("Объект_%1", Языки[Язык]);
			ЭтаФорма[НаименованиеРеквизита][ИмяРеквизита] = Перевод.Значение;
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры
