
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораПользователяПриЗагрузкеКлассификатора", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, НСтр("es='¿Cargar el clasificador de los objetos tipo de la reparación?';ru='Загрузить классификатор типовых объектов ремонта?';en='Download the classifier of typical repair objects?'"), РежимДиалогаВопрос.ДаНет,,,НСтр("es='La carga del clasificador';ru='Загрузка классификатора';en='Classifier loading'"));

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработкаВыбораПользователяПриЗагрузкеКлассификатора(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьТиповыеОРИзКлассификатораНаСервере();
		ОповеститьОбИзменении(Тип("СправочникСсылка.торо_ТиповыеОР"));
	КонецЕсли; 
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТиповыеОРИзКлассификатораНаСервере()
	
	МакетСписокСтандартныхТиповОбъектов = Справочники.торо_ТиповыеОР.ПолучитьМакет("СписокСтандартныхТиповОбъектов");
	ОбластьСтандартныеТипы = МакетСписокСтандартныхТиповОбъектов.ПолучитьОбласть("СтандартныеТипыОбъектов");
	Для Сч = 1 По ОбластьСтандартныеТипы.ВысотаТаблицы Цикл
		ИмяКласса = ОбластьСтандартныеТипы.Область(Сч, 1, Сч, 1).Текст;
		ЭлементСправочника = Справочники.торо_ТиповыеОР.НайтиПоНаименованию(ИмяКласса, Истина);
		Если ЭлементСправочника = Неопределено 
			ИЛИ ЭлементСправочника = Справочники.торо_ТиповыеОР.ПустаяСсылка() Тогда
			НовыйЭлемент = Справочники.торо_ТиповыеОР.СоздатьГруппу();
			НовыйЭлемент.Наименование = ИмяКласса;
			Попытка
				НовыйЭлемент.Записать();
			Исключение
				ОписаниеОшибки = ОписаниеОшибки();
				ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки);
				Возврат;
			КонецПопытки;
		КонецЕсли;		
	КонецЦикла;	
	
	Для Сч=1 По ОбластьСтандартныеТипы.ВысотаТаблицы Цикл
		ИмяКласса = ОбластьСтандартныеТипы.Область(Сч, 1, Сч, 1).Текст;
		ИмяПодкласса = ОбластьСтандартныеТипы.Область(Сч, 2, Сч, 2).Текст;
		РодительЭлемента = Справочники.торо_ТиповыеОР.НайтиПоНаименованию(ИмяКласса, Истина);
		ЭлементВторогоУровня = Справочники.торо_ТиповыеОР.НайтиПоНаименованию(ИмяПодкласса, Истина, РодительЭлемента);
		Если ЭлементВторогоУровня = Неопределено 
			ИЛИ ЭлементВторогоУровня = Справочники.торо_ТиповыеОР.ПустаяСсылка() Тогда
			НовыйЭлементВторогоУровня = Справочники.торо_ТиповыеОР.СоздатьГруппу();
			НовыйЭлементВторогоУровня.Наименование = ИмяПодкласса;
			НовыйЭлементВторогоУровня.Родитель = РодительЭлемента; 
			Попытка
				НовыйЭлементВторогоУровня.Записать();
			Исключение
				ОписаниеОшибки = ОписаниеОшибки();
				ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки);
				Возврат;
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

