

&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура Расш_гкс_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТаблицаИсполнителей.Параметры.УстановитьЗначениеПараметра("НачалоПериода", ТекущаяДата());

	ЭлементОтбора = ТаблицаБригады.Отбор.Элементы.Добавить(тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Подразделение");
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Параметры.Подразделение;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Таб.Квалификация КАК Квалификация,
	|	Таб.Сотрудник КАК Сотрудник,
	|	Таб.ID КАК ID,
	|	Таб.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	Таб.ДатаНачала КАК ДатаНачала,
	|	Таб.ДатаОкончания КАК ДатаОкончания
	|ПОМЕСТИТЬ Вт_Данные
	|ИЗ
	|	&Таб КАК Таб
	|ГДЕ
	|	&Парам1
	|	И &Парам2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вт_Данные.Квалификация КАК Квалификация,
	|	МАКСИМУМ(Вт_Данные.Сотрудник) КАК Сотрудник
	|ИЗ
	|	Вт_Данные КАК Вт_Данные
	|
	|СГРУППИРОВАТЬ ПО
	|	Вт_Данные.Квалификация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вт_Данные.Квалификация КАК Квалификация,
	|	Вт_Данные.ID КАК ID,
	|	Вт_Данные.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	Вт_Данные.ДатаНачала КАК ДатаНачала,
	|	Вт_Данные.ДатаОкончания КАК ДатаОкончания,
	|	Вт_Данные.Сотрудник КАК Сотрудник
	|ИЗ
	|	Вт_Данные КАК Вт_Данные";

	ТаблицаКвалификаций = Параметры.НеобходимыеКвалификации.Выгрузить();

	Если ТаблицаКвалификаций.Колонки.Найти("ВремяРаботы") <> Неопределено И  ТаблицаКвалификаций.Колонки.Найти("ВремяРаботыТекст") <> Неопределено Тогда 
		тз = Параметры.НеобходимыеКвалификации.Выгрузить(,"Квалификация, Сотрудник, ID, РемонтыОборудования_ID, КТУ, ДатаНачала, ДатаОкончания, ВремяРаботы, СуммаКНачислению");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Таб.ДатаОкончания КАК ДатаОкончания", "Таб.ДатаОкончания КАК ДатаОкончания, Таб.ВремяРаботы КАК ВремяРаботы, Таб.СуммаКНачислению КАК СуммаКНачислению");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Вт_Данные.Сотрудник КАК Сотрудник", "Вт_Данные.Сотрудник КАК Сотрудник, Вт_Данные.ВремяРаботы КАК ВремяРаботы, Вт_Данные.СуммаКНачислению КАК СуммаКНачислению");
		#Вставка
	ИначеЕсли ТаблицаКвалификаций.Колонки.Найти("гкс_ВремяРаботы") <> Неопределено И  ТаблицаКвалификаций.Колонки.Найти("гкс_ВремяРаботыТекст") <> Неопределено Тогда 
		тз = Параметры.НеобходимыеКвалификации.Выгрузить(,"Квалификация, Сотрудник, ID, РемонтыОборудования_ID, ДатаНачала, ДатаОкончания, гкс_ВремяРаботы");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Таб.ДатаОкончания КАК ДатаОкончания", "Таб.ДатаОкончания КАК ДатаОкончания, Таб.гкс_ВремяРаботы КАК ВремяРаботы");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Вт_Данные.Сотрудник КАК Сотрудник", "Вт_Данные.Сотрудник КАК Сотрудник, Вт_Данные.ВремяРаботы КАК ВремяРаботы");
		#КонецВставки
	Иначе
		тз = Параметры.НеобходимыеКвалификации.Выгрузить(,"Квалификация, Сотрудник, ID, РемонтыОборудования_ID, ДатаНачала, ДатаОкончания");
	КонецЕсли;

	Запрос.УстановитьПараметр("Таб", тз);

	Если Параметры.ID = Неопределено Тогда
		Запрос.УстановитьПараметр("Парам1", Истина);
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Парам1", "Таб.ID В (&ID)");
		Запрос.УстановитьПараметр("ID", Параметры.ID);
	КонецЕсли;

	Если Параметры.РемонтыОборудования_ID = Неопределено Тогда
		Запрос.УстановитьПараметр("Парам2", Истина);
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Парам2", "Таб.РемонтыОборудования_ID = &РемонтыОборудования_ID");
		Запрос.УстановитьПараметр("РемонтыОборудования_ID", Параметры.РемонтыОборудования_ID);
	КонецЕсли;

	Результат = Запрос.ВыполнитьПакет();

	//НужныеКвалификации = Результат[1].Выгрузить();
	ИсходныеДанные.Загрузить(Результат[2].Выгрузить());

	ТаблицаВыбранныеИсполнители.Загрузить(Результат[2].Выгрузить());
	//ТаблицаВыбранныеИсполнители.Загрузить(НужныеКвалификации);

КонецПроцедуры

