#Область ПрограммныйИнтерфейс

// Возвращает макет печатной формы по полному пути к макету.
//
// Параметры:
//  ПутьКМакету - Строка - полный путь к макету в формате:
//                         "Документ.<ИмяДокумента>.<ИмяМакета>"
//                         "Обработка.<ИмяОбработки>.<ИмяМакета>"
//                         "ОбщийМакет.<ИмяМакета>".
// Возвращаемое значение:
//  ТабличныйДокумент - для макета типа MXL.
//  ДвоичныеДанные    - для макетов офисных документов.
//
Функция МакетПечатнойФормы(ПутьКМакету) Экспорт
	ЛокализованныеФормы = торо_Локализация.ЛокализуемыеПечатныеФормы();
	
	Если ЛокализованныеФормы.Найти(ПутьКМакету) <> Неопределено Тогда
		КодЯзыка = ТекущийЯзык().КодЯзыка;
		ПутьКМакету = СтрШаблон("%1_%2", ПутьКМакету, КодЯзыка);
	КонецЕсли; 

	Макет = УправлениеПечатью.МакетПечатнойФормы(ПутьКМакету);
	
	Возврат Макет;
КонецФункции

// >> [Деснол] [Ушаков А.Д.] [06.11.2019]
Процедура ОбработкаПолученияПредставленияОбработкаПолученияПредставления(Источник, Данные, Представление, СтандартнаяОбработка) Экспорт
	
	Возврат;
		
КонецПроцедуры
// << [Деснол] [Ушаков А.Д.] [06.11.2019] 

Процедура СохранитьЯзыкТекущегоПользователя(Язык) Экспорт
	ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	НовыйЯзык = Неопределено;
	
	Для каждого ЯзыкМетаданных Из Метаданные.Языки Цикл
		Если ЯзыкМетаданных.КодЯзыка = Язык.Код Тогда
			НовыйЯзык = ЯзыкМетаданных;
			Прервать;
		КонецЕсли; 
	КонецЦикла; 

	// >> [Деснол] [Ушаков А.Д.] [25.10.2019] 
	УстановитьПривилегированныйРежим(Истина);
	// << [Деснол] [Ушаков А.Д.] [25.10.2019] 
	Если НовыйЯзык <> Неопределено Тогда
		ТекущийПользователь.Язык = НовыйЯзык;
		ТекущийПользователь.Записать();
	КонецЕсли; 
КонецПроцедуры

// Заглушка. Не используется
Процедура ОбработкаПолученияДанныхВыбораОбработкаПолученияДанныхВыбора(Источник, ДанныеВыбора, Параметры, СтандартнаяОбработка) Экспорт
	Возврат;
	Если Не ЭтоЯзыкПоУмолчанию() Тогда
		Слова = СтрРазделить(Источник, ".");
		Тип = Слова[0];
		ОбъектИБ = Слова[1];
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;
		
		Если Тип = "СправочникМенеджер" Тогда
			Запрос = Новый Запрос;
			#Область ТекстЗапроса
			Запрос.Текст = СтрШаблон(
				"ВЫБРАТЬ
				|	СправочникИБ.Ссылка КАК Ссылка,
				|	торо_Переводы.Текст КАК Представление
				|ИЗ
				|	РегистрСведений.торо_Переводы КАК торо_Переводы
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.%1 КАК СправочникИБ
				|		ПО торо_Переводы.ID = СправочникИБ.Ссылка
				|			И (торо_Переводы.Реквизит = ""Наименование"")
				|			И (торо_Переводы.Язык.Код = &Язык)
				|ГДЕ
				|	торо_Переводы.Текст ПОДОБНО &Наименование", ОбъектИБ);
			#КонецОбласти 
			
			Запрос.УстановитьПараметр("Язык", ТекущийЯзык().КодЯзыка);
			Запрос.УстановитьПараметр("Наименование", "%" + Параметры.СтрокаПоиска + "%");
			РезультатЗапроса = Запрос.Выполнить();
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				ДанныеВыбора.Добавить(Выборка.Ссылка, Выборка.Представление);
			КонецЦикла;
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

Процедура ОбработкаПолученияФормыОбработкаПолученияФормы(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	Возврат;
	Если Не ЭтоЯзыкПоУмолчанию() Тогда
		Если ЭтоПользовательскаяФорма(Источник, ВидФормы) Тогда
			Возврат;
		КонецЕсли;

		Параметры.Вставить("ВидФормы", ВидФормы);
		
		Если ВидФормы = "ФормаОбъекта" Тогда
			#Область ФормаОбъекта
			СтандартнаяОбработка = Ложь;
			ДополнительнаяИнформация.ПовторноеИспользование = Истина;
			ВыбраннаяФорма = "ОбщаяФорма.торо_Автоформа";
			
			Ключ = Неопределено;
			Если Параметры.Свойство("Ключ", Ключ) Тогда
				Параметры.Вставить("Ключ", Ключ.ПолучитьОбъект());
			Иначе
				МетаданныеИсточника = ПолучитьМетаданныеИсточника(Источник);
				ТипОбъектаИБ = МетаданныеИсточника.ТипОбъектаИБ;
				ТипМетаданных = МетаданныеИсточника.ТипМетаданных;
				
				Если ТипМетаданных = "Справочники" Тогда
					НовыйЭлемент = Справочники[ТипОбъектаИБ].СоздатьЭлемент();
				ИначеЕсли ТипМетаданных = "Документы" Тогда
					НовыйЭлемент = Документы[ТипОбъектаИБ].СоздатьДокумент();
				КонецЕсли;
				
				Параметры.Вставить("Ключ", НовыйЭлемент);
			КонецЕсли; 
			#КонецОбласти 
		ИначеЕсли ВидФормы = "ФормаСписка" ИЛИ ВидФормы = "ФормаВыбора" Тогда
			#Область ФормаСписка
			МетаданныеИсточника = ПолучитьМетаданныеИсточника(Источник);
			ТипОбъектаИБ = МетаданныеИсточника.ТипОбъектаИБ;
			ТипМетаданных = МетаданныеИсточника.ТипМетаданных;
			Если СтрНайти(ТипМетаданных,"Документ") = 0 И СтрНайти(ТипМетаданных,"Справочник") = 0 Тогда 
				Возврат;
			ИначеЕсли СтрНайти(ТипМетаданных,"Регистр") > 0 Тогда 
				Возврат;
			КонецЕсли;
			Параметры.Вставить("ТипОбъектаИБ", ТипОбъектаИБ);
			Параметры.Вставить("ТипМетаданных", ТипМетаданных);
			
			СтандартнаяОбработка = Ложь;
			ДополнительнаяИнформация.ПовторноеИспользование = Истина;
			ВыбраннаяФорма = "ОбщаяФорма.торо_Автоформа";
			#КонецОбласти 
		ИначеЕсли ВидФормы = "ФормаЗаписи" Тогда
			#Область ФормаЗаписи
			Возврат;
			МетаданныеИсточника = ПолучитьМетаданныеИсточника(Источник);
			ТипОбъектаИБ = МетаданныеИсточника.ТипОбъектаИБ;
			ТипМетаданных = МетаданныеИсточника.ТипМетаданных;
			МассивИзмерений = Новый Массив();
			МассивРесурсов = Новый Массив();
			МассивРеквизитов = Новый Массив();
			Параметры.Вставить("ТипМетаданных", ТипМетаданных);
			
			Если ТипМетаданных = "РегистрыСведений" Тогда
				НовыйЭлемент = РегистрыСведений[ТипОбъектаИБ].СоздатьМенеджерЗаписи();
			Иначе
				Возврат;
			КонецЕсли;
			
			СтандартнаяОбработка = Ложь;
			ДополнительнаяИнформация.ПовторноеИспользование = Истина;
			ВыбраннаяФорма = "ОбщаяФорма.торо_Автоформа";
			
			Для Каждого Измерение Из Метаданные[ТипМетаданных][ТипОбъектаИБ].Измерения Цикл
				МассивИзмерений.Добавить(Измерение.Имя);
			КонецЦикла;
			Для Каждого Измерение Из Метаданные[ТипМетаданных][ТипОбъектаИБ].Ресурсы Цикл
				МассивРесурсов.Добавить(Измерение.Имя);
			КонецЦикла;
			Для Каждого Измерение Из Метаданные[ТипМетаданных][ТипОбъектаИБ].Реквизиты Цикл
				МассивРесурсов.Добавить(Измерение.Имя);
			КонецЦикла;
			Параметры.Вставить("МассивИзмерений", МассивИзмерений);
			Параметры.Вставить("МассивРесурсов", МассивРесурсов);
			Параметры.Вставить("МассивРеквизитов", МассивРеквизитов);
			Параметры.Вставить("ТипОбъектаИБ", ТипОбъектаИБ);
			
			Ключ = Неопределено;
			Если Параметры.Свойство("Ключ", Ключ) Тогда
				Если Не ТипЗнч(Ключ.Регистратор) = Тип("Неопределено") Тогда 
					НовыйЭлемент.Регистратор = Ключ.Регистратор;
				Иначе
					Для Каждого Измерение Из МассивИзмерений Цикл
						НовыйЭлемент[Измерение] = Ключ[Измерение];
					КонецЦикла;
				КонецЕсли;
				НовыйЭлемент.Прочитать();
				Параметры.Вставить("Ключ", НовыйЭлемент);
			Иначе
				Параметры.Вставить("Ключ", НовыйЭлемент);
			КонецЕсли;
			#КонецОбласти 
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

// [Возвращает результаты полнотекстового поиска] 
Функция ПолучитьРезультатыПоиска(СтрокаПоиска, РезультатПоиска, ТочноеСовпадение = Ложь) Экспорт
	Язык = Справочники.торо_Языки.НайтиПоКоду(ТекущийЯзык().КодЯзыка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_Переводы.ID КАК Номенклатура
		|ИЗ
		|	РегистрСведений.торо_Переводы КАК торо_Переводы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
		|		ПО (Номенклатура.Ссылка = торо_Переводы.ID)
		|ГДЕ
		|	торо_Переводы.Текст ПОДОБНО &Текст
		|	И торо_Переводы.Язык = &Язык
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Номенклатура.Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Наименование ПОДОБНО &Текст";
	
	//Если ТочноеСовпадение Тогда
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПОДОБНО", "=");
	//КонецЕсли; 
	
	Запрос.УстановитьПараметр("Текст", ?(ТочноеСовпадение, СтрокаПоиска, "%" + СтрокаПоиска + "%"));
	Запрос.УстановитьПараметр("Язык", Язык);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		РезультатПоиска.КодОшибки = "НичегоНеНайдено";
	ИначеЕсли Выборка.Количество() > 1000 Тогда
		РезультатПоиска.КодОшибки = "СлишкомМногоРезультатов";
	Иначе
		Пока Выборка.Следующий() Цикл
			РезультатПоиска.Номенклатура.Добавить(Выборка.Номенклатура);
		КонецЦикла;
	КонецЕсли;
	
	Возврат РезультатПоиска;
КонецФункции

#Область Вспомогательное

Функция ПолучитьЯзыки() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_Языки.Ссылка КАК Ссылка,
		|	торо_Языки.Код КАК Код
		|ИЗ
		|	Справочник.торо_Языки КАК торо_Языки";
	
	ТаблицаЯзыков = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаЯзыков;
КонецФункции  

Функция ПолучитьЯзыкиМассивом() Экспорт
	ТаблицаЯзыков = ПолучитьЯзыки();
	МассивЯзыков = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаЯзыков);
	
	Возврат МассивЯзыков;
КонецФункции  

Функция ПолучитьЗначениеИзСтроки(Строка) Экспорт
	Возврат ЗначениеИзСтрокиВнутр(Строка);
КонецФункции // ПолучитьЗначениеИзСтроки()

#КонецОбласти 

#КонецОбласти 

#Область ФормыВспомогательное

Функция ЭтоПользовательскаяФорма(Источник, ВидФормы)
	ЭтоПользовательскаяФорма = Ложь;
	
	МетаданныеИсточника = ПолучитьМетаданныеИсточника(Источник);
	Формы = Метаданные[МетаданныеИсточника.ТипМетаданных][МетаданныеИсточника.ТипОбъектаИБ].Формы;
	
	СоответствиеФорм = Новый Соответствие;
	// >> [Деснол] [Ушаков А.Д.] [20.09.2019] 
	СоответствиеФорм.Вставить("ФормаОбъекта", 	СтрРазделить("ФормаЭлемента,ФормаДокумента", ","));
	СоответствиеФорм.Вставить("ФормаВыбора", 	СтрРазделить("ФормаВыбора", ","));
	// << [Деснол] [Ушаков А.Д.] [20.09.2019] 
	СоответствиеФорм.Вставить("ФормаСписка", 	СтрРазделить("ФормаСписка", ","));
	
	НазваниеВидаФормы = СоответствиеФорм[ВидФормы];
	
	Если НазваниеВидаФормы <> Неопределено Тогда
		Для каждого Форма Из Формы Цикл
			Если НазваниеВидаФормы.Найти(Форма.Имя) <> Неопределено Тогда
				ЭтоПользовательскаяФорма = Истина;
				Прервать;
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 
	
	Возврат ЭтоПользовательскаяФорма;
КонецФункции

// [Недоработана] 
Функция ПолучитьМетаданныеИсточника(Источник)
	ПодстрокиТипа = СтрРазделить(Источник, ".");
	
	СоответствиеТипов = Новый Соответствие;
	СоответствиеТипов.Вставить("СправочникМенеджер", 		"Справочники");
	СоответствиеТипов.Вставить("ДокументМенеджер", 			"Документы");
	СоответствиеТипов.Вставить("РегистрСведенийМенеджер", 	"РегистрыСведений");
	
	ТипМетаданных = СоответствиеТипов[ПодстрокиТипа[0]];
	ТипОбъектаИБ = ПодстрокиТипа[1];
	
	МетаданныеИсточника = Новый Структура("ТипМетаданных,ТипОбъектаИБ", ТипМетаданных, ТипОбъектаИБ);
	
	Возврат МетаданныеИсточника;
КонецФункции

// Возвращает масиив имен макетов, доступных к локализации
Функция ЛокализуемыеПечатныеФормы() Экспорт
	ПечатныеФормы = Новый Массив;
	
	ПечатныеФормы.Добавить("Документ.торо_ВыявленныеДефекты.ПФ_MXL_ДефектнаяВедомость");
	
	Возврат ПечатныеФормы;
КонецФункции

Функция ТекущийЯзыкИБ() Экспорт
	Язык = Справочники.торо_Языки.НайтиПоКоду(ТекущийЯзык().КодЯзыка);
	Возврат Язык;
КонецФункции

// Проверяет, является ли текущий язык языком по умолчанию 
Функция ЭтоЯзыкПоУмолчанию() Экспорт
	ТекущийЯзыкЭтоЯзыкПоУмолчанию = ПараметрыСеанса.торо_ТекущийЯзыкЭтоЯзыкПоУмолчанию;
	Возврат ТекущийЯзыкЭтоЯзыкПоУмолчанию;
КонецФункции
#КонецОбласти 
