
&ИзменениеИКонтроль("ВвестиДокументДефектНаОсновании")
Процедура гкс_ВвестиДокументДефектНаОсновании(Выборка, СтруктураДанных, ДокументыВДКОткрытию, МассивКолонок)

	Если ЗначениеЗаполнено(Выборка.ПараметрыВводаДефекта) Тогда

		СтруктураПараметров = ПолучитьСтруктуруНовогоДокумента(Выборка.ПараметрыВводаДефекта);
		Если СтруктураПараметров = Неопределено Тогда
			Возврат;
		КонецЕсли;

		СтруктураДокументаОснования = Новый Структура;
		Для Каждого ИмяКолонки Из МассивКолонок Цикл
			СтруктураДокументаОснования.Вставить(ИмяКолонки,Выборка[ИмяКолонки]);
		КонецЦикла;

		СтруктураПараметров.Вставить("СтруктураДокументаОснования", СтруктураДокументаОснования);

		СсылкаНаДокумент = Неопределено;

		Если СтруктураПараметров.Общее.ЗаписыватьДокумент Тогда
			НовДокумент = Документы.торо_ВыявленныеДефекты.СоздатьДокумент();
			НовДокумент.Заполнить(Новый Структура("ДанныеДокументаПриСозданииПоСостоянию", СтруктураПараметров));
			#Вставка
			// гкс+ [02.23] Деснол 28.02.2023
			Если Не ЗначениеЗаполнено(НовДокумент.ОбъектРемонта) И НовДокумент.СписокДефектов.Количество() > 0 Тогда 
				СТ = НовДокумент.СписокДефектов[0];
				НовДокумент.ОбъектРемонта = СТ.ОбъектРемонта;
			КонецЕсли;
			// гкс- [02.23] Деснол 28.02.2023
			#КонецВставки

			Попытка
				НовДокумент.Записать(?(СтруктураПараметров.Общее.ПроводитьДокумент, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
				СсылкаНаДокумент = НовДокумент.Ссылка;
			Исключение
				ОписаниеОшибки = ОписаниеОшибки();
				ЗаписьЖурналаРегистрации(НСтр("es='La excepción';ru='Исключение';en='An exception'"), УровеньЖурналаРегистрации.Предупреждение,, ОписаниеОшибки);
				ТекстСообщения = НСтр("es='No consiguió crear el documento ""el defecto Revelado"" automáticamente: ';ru='Не удалось создать документ ""Выявленный дефект"" автоматически: ';en='Failed to create the document ""Identified defect"" automatically: '") + ОписаниеОшибки;
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			КонецПопытки;
		КонецЕсли;

		Если СтруктураПараметров.Общее.ОткрыватьФорму Тогда
			Если СсылкаНаДокумент <> Неопределено Тогда
				СтруктураПараметров.Вставить("СсылкаНаДокумент", СсылкаНаДокумент);
			КонецЕсли;

			ДокументыВДКОткрытию.Добавить(СтруктураПараметров);
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры
