#Область СлужебныеПроцедурыИФункции

// гкс+ [Релиз 1] Куст 17.03.2020
Процедура ДобавитьНаборыРодителей(Ссылка,НаборыСвойств)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТОР_Родитель1.НаборСвойствОР КАК Набор1,
		|	ТОР_Родитель1.Родитель.НаборСвойствОР КАК Набор2
		|ИЗ
		|	Справочник.торо_ТиповыеОР КАК торо_ТиповыеОР
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТиповыеОР КАК ТОР_Родитель1
		|		ПО торо_ТиповыеОР.Родитель = ТОР_Родитель1.Ссылка
		|			И (торо_ТиповыеОР.Ссылка = &Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() = Ложь Тогда 
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Строка = НаборыСвойств.Добавить();
			Строка.Набор = Выборка.Набор1;
			
			Если ЗначениеЗаполнено(Выборка.Набор2) Тогда 
				Строка = НаборыСвойств.Добавить();
				Строка.Набор = Выборка.Набор2;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
// гкс- [Релиз 1] Куст 17.03.2020

&ИзменениеИКонтроль("ЗаполнитьНаборСвойствДляОР")
Процедура Расш_гкс_ЗаполнитьНаборСвойствДляОР(торо_ОР, ТипСсылки, НаборыСвойств)

	Если торо_ОР.ЭтоГруппа = Ложь Тогда
		Если ЗначениеЗаполнено(торо_ОР.Направление) Тогда	
			Строка = НаборыСвойств.Добавить();
			Строка.Набор = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_торо_НаправленияОбъектовРемонтныхРабот_Общие;

			Строка = НаборыСвойств.Добавить();
			Строка.Набор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(торо_ОР.Направление, "НаборСвойствОР");
		КонецЕсли;

		// Общие реквизиты и сведения типового ОР для ОР будем добавлять если выбран хоть какой то типовой ОР.
		Если ЗначениеЗаполнено(торо_ОР.ТиповойОР) Тогда
			Строка = НаборыСвойств.Добавить();
			Строка.Набор = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_торо_ТиповыеОР_Общие;

			Строка = НаборыСвойств.Добавить();
			Строка.Набор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(торо_ОР.ТиповойОР, "НаборСвойствОР");
			#Вставка
			ДобавитьНаборыРодителей(торо_ОР.ТиповойОР,НаборыСвойств);
			#КонецВставки
		КонецЕсли;

		Строка = НаборыСвойств.Добавить();
		Строка.Набор = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_торо_ОбъектыРемонта_Общие;
	КонецЕсли;		

КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьНаборСвойствПоВидуНаправленийДляТиповыхОР")
Процедура Расш_гкс_ЗаполнитьНаборСвойствПоВидуНаправленийДляТиповыхОР(ТиповойОР, ТипСсылки, НаборыСвойств)

	#Удаление
	Если ТиповойОР.ЭтоГруппа = Ложь Тогда	
	#КонецУдаления
		Если ЗначениеЗаполнено(ТиповойОР.Направление) Тогда
			Строка = НаборыСвойств.Добавить();
			Строка.Набор = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_торо_НаправленияОбъектовРемонтныхРабот_Общие;

			Строка = НаборыСвойств.Добавить();
			Строка.Набор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТиповойОР.Направление, "НаборСвойствОР");
		КонецЕсли;

		Строка = НаборыСвойств.Добавить();
		Строка.Набор = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_торо_ТиповыеОР_Общие;

		Строка = НаборыСвойств.Добавить();
		Строка.Набор = ТиповойОР.НаборСвойствОР;
	#Удаление
	КонецЕсли;
	#КонецУдаления

КонецПроцедуры

#КонецОбласти