
&ИзменениеИКонтроль("РезультатыПроверкиУникальностиФизическогоЛица")
Функция гкс_РезультатыПроверкиУникальностиФизическогоЛица(ФизическоеЛицоСсылка, ИНН, СтраховойНомерПФР, ДокументВид, ДокументСерия, ДокументНомер)

	СтруктураВозврат = Новый Структура("ФизическоеЛицоУникально,СообщенияПроверки", Истина, Новый Массив);

	ТаблицаСовпадений = ТаблицаСовпаденийФизическихЛицПоИННСНИЛСДокументаУдостоверяющегоЛичность(
	ФизическоеЛицоСсылка,
	ИНН,
	СтраховойНомерПФР,
	ДокументВид,
	ДокументСерия,
	ДокументНомер);

	Если ТаблицаСовпадений.Количество() > 0 Тогда

		СтруктураВозврат.ФизическоеЛицоУникально = Ложь;

		МассивФизическихЛиц = ТаблицаСовпадений.ВыгрузитьКолонку("ФизическоеЛицо");

		ЗаполнитьДанныеФизическиеЛиц(СтруктураВозврат, МассивФизическихЛиц);

		Если ЗначениеЗаполнено(ИНН) Тогда
			СтрокиСИНН = ТаблицаСовпадений.НайтиСтроки(Новый Структура("ИНН", ИНН));
			Если СтрокиСИНН.Количество() > 0 Тогда
				СтруктураСообщения = Новый Структура("ИмяПоля,ИмяОбъекта,ТекстСообщенияОбОшибке", "ИНН", "ФизическоеЛицо", "");
				СтруктураСообщения.ТекстСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("es='Es encontrada la anotación sobre persona que tiene el mismo INN (%1)';ru='Найдена запись о человеке, имеющем такой же ИНН (%1)';en='A record was found about a person having the same TIN (%1)'"),
				ИНН);
				СтруктураВозврат.СообщенияПроверки.Добавить(СтруктураСообщения);
			КонецЕсли;
		КонецЕсли; 

		Если ЗначениеЗаполнено(СтраховойНомерПФР) Тогда
			СтрокиССтраховойНомерПФР = ТаблицаСовпадений.НайтиСтроки(Новый Структура("СтраховойНомерПФР", СтраховойНомерПФР));
			Если СтрокиССтраховойНомерПФР.Количество() > 0 Тогда
				СтруктураСообщения = Новый Структура("ИмяПоля,ИмяОбъекта,ТекстСообщенияОбОшибке", "СтраховойНомерПФР", "ФизическоеЛицо", "");
				СтруктураСообщения.ТекстСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("es='Es encontrada la anotación sobre persona que tiene misma СНИЛС (%1)';ru='Найдена запись о человеке, имеющем такой же СНИЛС (%1)';en='A record was found about a person having the same SNILS (%1)'"),
				СтраховойНомерПФР);
				СтруктураВозврат.СообщенияПроверки.Добавить(СтруктураСообщения);
			КонецЕсли;
		КонецЕсли; 

		Если ЗначениеЗаполнено(ДокументВид) Тогда
			СтрокиСДокументом = ТаблицаСовпадений.НайтиСтроки(Новый Структура("ДокументВид,ДокументСерия,ДокументНомер", 
			ДокументВид,
			ДокументСерия,
			ДокументНомер));
			Если СтрокиСДокументом.Количество() > 0 Тогда
				СтруктураСообщения = Новый Структура("ИмяПоля,ИмяОбъекта,ТекстСообщенияОбОшибке", "Документ", "ДокументыФизическихЛиц", "");
				СтруктураСообщения.ТекстСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("es='Es encontrada la anotación sobre la persona que tiene el mismo documento, que certifica la persona (%1 № %2 %3)';ru='Найдена запись о человеке, имеющем такой же документ, удостоверяющий личность (%1 №%2 %3)';en='A record was found of a person who has the same identity document (%1 No.%2%3)'"),
				ДокументВид,
				?(ПустаяСтрока(ДокументСерия), "", " " + ДокументСерия),
				ДокументНомер);
				СтруктураВозврат.СообщенияПроверки.Добавить(СтруктураСообщения);
			КонецЕсли;
		КонецЕсли; 
		
		#Удаление
		СтруктураВозврат.Вставить("ДоступнаРольСохранениеДанныхЗадвоенныхФизическихЛиц", Пользователи.РолиДоступны("СохранениеДанныхЗадвоенныхФизическихЛиц"));
		#КонецУдаления
		#Вставка
		СтруктураВозврат.Вставить("ДоступнаРольСохранениеДанныхЗадвоенныхФизическихЛиц", Истина);
		#КонецВставки

	КонецЕсли;

	Возврат СтруктураВозврат;

КонецФункции
