
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокСтатусов.ЗагрузитьЗначения(Параметры.СписокСледующихСтатусов.ВыгрузитьЗначения());
	ВыделенныйСтатус = Параметры.ВыделенныйСтатус;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(ВыделенныйСтатус) Тогда
		НайденноеЗначение = СписокСтатусов.НайтиПоЗначению(ВыделенныйСтатус);
		Если НайденноеЗначение <> Неопределено Тогда
			Элементы.СписокСтатусов.ТекущаяСтрока = НайденноеЗначение.ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	ВыбранныйСтатус = Неопределено;
	Если СписокСтатусов.Количество() = 1 Тогда
		ВыбранныйСтатус = СписокСтатусов[0].Значение;
	Иначе
		ТекущиеДанные = Элементы.СписокСтатусов.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			ВыбранныйСтатус = ТекущиеДанные.Значение;
		КонецЕсли;
	КонецЕсли;
	
	Если ВыбранныйСтатус = Неопределено Тогда
		ТекстСообщения = НСтр("es='el estatus!';ru='Не выбран статус!';en='No status selected!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Закрыть(Новый Структура("ВыбранныйСтатус, Комментарий", ВыбранныйСтатус, Комментарий));
	
КонецПроцедуры

#КонецОбласти