#Область ОбработчикиСобытийЭлементовТаблицыФормыОповещаемые

&НаКлиенте
&ИзменениеИКонтроль("ОповещаемыеПриНачалеРедактирования")
Процедура Расш_гкс_ОповещаемыеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	#Удаление
	Если Элемент.ТекущийЭлемент.Имя = Элементы.ОповещаемыеПользователь.Имя Тогда
		ВыбратьТипПолучателя();
	КонецЕсли;
	#КонецУдаления
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ВыбратьТипПолучателя")
Процедура гкс_ВыбратьТипПолучателя()

	СписокДоступныхТипов = Новый СписокЗначений;

	СписокДоступныхТипов.Добавить("Пользователи");
	СписокДоступныхТипов.Добавить("Ответственный по документу");
	#Вставка
	СписокДоступныхТипов.Добавить("Оповещаемые о сроке согласования");
	#КонецВставки

	Если торо_РаботаССогласованиями.ПроверитьИспользованиеСогласованияДокументов() Тогда

		СписокДоступныхТипов.Добавить("Согласующие");
		СписокДоступныхТипов.Добавить("Оповещаемые");

	КонецЕсли;

	СписокДоступныхТипов.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ВыбратьТипПолучателяЗавершение", ЭтотОбъект), НСтр("en='To whom to form notices';es='A quien formar los avisos';ru='Кому формировать уведомления'"));

КонецПроцедуры

#КонецОбласти