////////////////////////////////////////////////////////////////////////////////
// Подсистема "Обмен данными"
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Процедура ОбменТОиР20ЕРП20_ЗарегистрироватьИзменениеПередЗаписью(Источник, Отказ) Экспорт
	
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.торо_ОбъектыРемонта") Тогда
		
		Если Источник.ЭтоГруппа или Источник.ПометкаУдаления или НЕ Источник.ЭтоАктив Тогда 
			Возврат; 
		КонецЕсли;
		
		УзелДляОтправки = торо_ОбменДаннымиПовтИсп.ПолучитьУзелДляРегистрацииИзменений("ОбменТОиР20ЕРП20");
		Если УзелДляОтправки = Неопределено или УзелДляОтправки.ПереноситьАктивыВУПП = Ложь Тогда 
			Возврат; 
		КонецЕсли;
		
		Источник.ОбменДанными.Получатели.Добавить(УзелДляОтправки);	
	ИначеЕсли ТипЗнч(Источник) = Тип("СправочникОбъект.торо_ТиповыеОР") Тогда
		Если Источник.ЭтоГруппа или Источник.ПометкаУдаления Тогда 
			Возврат; 
		КонецЕсли;
		
		УзелДляОтправки = торо_ОбменДаннымиПовтИсп.ПолучитьУзелДляРегистрацииИзменений("ОбменТОиР20ЕРП20");
		Если УзелДляОтправки = Неопределено или УзелДляОтправки.ПереноситьАктивыВУПП = Ложь Тогда 
			Возврат; 
		КонецЕсли;
		
		Источник.ОбменДанными.Получатели.Добавить(УзелДляОтправки);	
	Иначе
		ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью("ОбменТОиР20ЕРП20", Источник, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбменТОиР20ЕРП20_ЗарегистрироватьИзменениеДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Источник.ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	УзелДляОтправки = торо_ОбменДаннымиПовтИсп.ПолучитьУзелДляРегистрацииИзменений("ОбменТОиР20ЕРП20");
	Если УзелДляОтправки = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Источник.ОбменДанными.Получатели.Добавить(УзелДляОтправки);	
	
КонецПроцедуры

Процедура ОбменТОиР20ЕРП20_ЗарегистрироватьИзменениеНабораЗаписейПередЗаписью(Источник, Отказ, Замещение) Экспорт
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюРегистра("ОбменТОиР20ЕРП20", Источник, Отказ,Замещение);
КонецПроцедуры

Процедура ОбменТОиР20ЕРП20_ЗарегистрироватьУдалениеДокументаПередУдалением(Источник, Отказ) Экспорт
	УзелДляОтправки = торо_ОбменДаннымиПовтИсп.ПолучитьУзелДляРегистрацииИзменений("ОбменТОиР20ЕРП20");
	Если УзелДляОтправки = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Источник.ОбменДанными.Получатели.Добавить(УзелДляОтправки);	
	
КонецПроцедуры

#КонецОбласти
