
&НаКлиенте
Процедура ВыбратьРемонт(Команда)
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		Результат = Новый Структура("ИД,ОР,ВР", ТекДанные.ИД, ТекДанные.ОР, ТекДанные.ВР);
		Результат.Вставить("ДокументОснование", ТекДанные.ДокументОснование);
		Результат.Вставить("Заявка", ТекДанные.Заявка);
		Результат.Вставить("ДатаНачала", ТекДанные.ДатаНачала);
		Результат.Вставить("ДатаОкончания", ТекДанные.ДатаОкончания);
		Оповестить("гкс_ПодборРемонта", Результат);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыбратьРемонт(Неопределено);
КонецПроцедуры

&НаСервере
Функция ПолучитьИсходныйТекстЗапроса()
	// гкс+ [07.23] Деснол 21.09.2023
	Возврат "ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	Заявки.Регистратор КАК Регистратор,
	        |	Заявки.IDРемонта КАК IDРемонта,
	        |	ЕСТЬNULL(Даты.ДатаНачала, Заявки.ДатаНачалаРемонтныхРабот) КАК ДатаНачала,
	        |	ЕСТЬNULL(Даты.ДатаОкончания, Заявки.ДатаОкончанияРемонтныхРабот) КАК ДатаОкончания
	        |ПОМЕСТИТЬ ВТ_ВсеЗаявки_0
	        |ИЗ
	        |	РегистрСведений.торо_ЗаявкиПоРемонтам КАК Заявки
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК Даты
	        |		ПО Заявки.IDРемонта = Даты.IDРемонта
	        |ГДЕ
	        |	ЕСТЬNULL(Даты.ДатаНачала, Заявки.ДатаНачалаРемонтныхРабот) >= &ДатаНачала
	        |	И ЕСТЬNULL(Даты.ДатаНачала, Заявки.ДатаНачалаРемонтныхРабот) < &ДатаОкончания  И &Отбор1
	        |;
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	Заявки.Регистратор КАК Заявка,
	        |	Заявки.IDРемонта КАК ИД,
	        |	Заявки.ДатаНачала КАК ДатаНачала,
	        |	Заявки.ДатаОкончания КАК ДатаОкончания
	        |ПОМЕСТИТЬ ВТ_ВсеЗаявки
	        |ИЗ
	        |	ВТ_ВсеЗаявки_0 КАК Заявки
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗавершенныеРемонтныеРаботы.СрезПоследних(, ID В (выбрать ТЧ.IDРемонта ИЗ ВТ_ВсеЗаявки_0 КАК ТЧ)) КАК Завершенные
	        |		ПО Заявки.IDРемонта = Завершенные.ID
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОтмененныеРемонты.СрезПоследних(, ID В (выбрать ТЧ.IDРемонта ИЗ ВТ_ВсеЗаявки_0 КАК ТЧ)) КАК Отмененные
	        |		ПО Заявки.IDРемонта = Отмененные.ID
	        |ГДЕ
	        |	Завершенные.ID ЕСТЬ NULL
	        |	И Отмененные.Регистратор ЕСТЬ NULL
			|;
			|УНИЧТОЖИТЬ ВТ_ВсеЗаявки_0
	        |;
			|ВЫБРАТЬ
	        |	ВТ_ВсеЗаявки.Заявка КАК Заявка,
	        |	ВТ_ВсеЗаявки.ИД КАК ИД,
	        |	ВТ_ВсеЗаявки.ДатаНачала КАК ДатаНачала,
	        |	ВТ_ВсеЗаявки.ДатаОкончания КАК ДатаОкончания,
	        |	Дефекты.Регистратор КАК ДокументОснование,
	        |	Дефекты.ОбъектРемонта КАК ОР
			|Поместить ВТ_ИзДефектов
	        |ИЗ
	        |	ВТ_ВсеЗаявки КАК ВТ_ВсеЗаявки
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВыявленныеДефекты.СрезПоследних(, ID В (выбрать ТЧ.ИД ИЗ ВТ_ВсеЗаявки КАК ТЧ)) КАК Дефекты
	        |		ПО ВТ_ВсеЗаявки.ИД = Дефекты.ID
			|;
			|ВЫБРАТЬ
	        |	ВТ_ВсеЗаявки.Заявка КАК Заявка,
	        |	ВТ_ВсеЗаявки.ИД КАК ИД,
	        |	ВТ_ВсеЗаявки.ДатаНачала КАК ДатаНачала,
	        |	ВТ_ВсеЗаявки.ДатаОкончания КАК ДатаОкончания,
	        |	Внешнее.Регистратор КАК ДокументОснование,
	        |	Внешнее.ОбъектРемонта КАК ОР
			|Поместить ВТ_ИзВО
	        |ИЗ
	        |	ВТ_ВсеЗаявки КАК ВТ_ВсеЗаявки
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВнешниеОснованияДляРабот.СрезПоследних(, Регистратор ССЫЛКА Документ.торо_ВнешнееОснованиеДляРабот
			|И ID В (выбрать ТЧ.ИД ИЗ ВТ_ВсеЗаявки КАК ТЧ)) КАК Внешнее
	        |		ПО ВТ_ВсеЗаявки.ИД = Внешнее.ID
			|;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ВсеЗаявки.Заявка КАК Заявка,
	        |	ВТ_ВсеЗаявки.ИД КАК ИД,
	        |	ВТ_ВсеЗаявки.ДатаНачала КАК ДатаНачала,
	        |	ВТ_ВсеЗаявки.ДатаОкончания КАК ДатаОкончания,
	        |	ВТ_ВсеЗаявки.ДокументОснование КАК ДокументОснование,
	        |	ВТ_ВсеЗаявки.ОР КАК ОР,
	        |	ДокТЧ.ВидРемонтныхРабот КАК ВР
	        |ИЗ
	        |	ВТ_ИзДефектов КАК ВТ_ВсеЗаявки
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК ДокТЧ
	        |		ПО ВТ_ВсеЗаявки.Заявка = ДокТЧ.Ссылка
	        |			И ВТ_ВсеЗаявки.ИД = ДокТЧ.ID
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ВТ_ВсеЗаявки.Заявка,
	        |	ВТ_ВсеЗаявки.ИД,
	        |	ВТ_ВсеЗаявки.ДатаНачала,
	        |	ВТ_ВсеЗаявки.ДатаОкончания,
	        |	ППР.Регистратор,
	        |	ППР.ОбъектРемонтныхРабот,
	        |	ППР.ВидРемонтныхРабот
	        |ИЗ
	        |	ВТ_ВсеЗаявки КАК ВТ_ВсеЗаявки
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(, Регистратор ССЫЛКА Документ.торо_ПланГрафикРемонта
			|И ID В (выбрать ТЧ.ИД ИЗ ВТ_ВсеЗаявки КАК ТЧ)) КАК ППР
	        |		ПО ВТ_ВсеЗаявки.ИД = ППР.ID
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ВТ_ВсеЗаявки.Заявка,
	        |	ВТ_ВсеЗаявки.ИД,
	        |	ВТ_ВсеЗаявки.ДатаНачала,
	        |	ВТ_ВсеЗаявки.ДатаОкончания,
	        |	ВТ_ВсеЗаявки.ДокументОснование,
	        |	ВТ_ВсеЗаявки.ОР,
	        |	ДокТЧ.ВидРемонтныхРабот
	        |ИЗ
	        |	ВТ_ИзВО КАК ВТ_ВсеЗаявки
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК ДокТЧ
	        |		ПО ВТ_ВсеЗаявки.Заявка = ДокТЧ.Ссылка
	        |			И ВТ_ВсеЗаявки.ИД = ДокТЧ.ID";
	// гкс- [07.23] Деснол 21.09.2023
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПериодРемонта.ДатаНачала = НачалоМесяца(ТекущаяДата());
	ПериодРемонта.ДатаОкончания = КонецМесяца(ПериодРемонта.ДатаНачала);
	Список.ТекстЗапроса = ПолучитьИсходныйТекстЗапроса();
	Если ф_ОстановочныйИсп Тогда 
		Если р_Остановочный Тогда 
			Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "И &Отбор1", "Заявки.Регистратор.гкс_НуженОстанов И &Отбор1");
		Иначе
			Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "И &Отбор1", "Не Заявки.Регистратор.гкс_НуженОстанов И &Отбор1");
		КонецЕсли;
	КонецЕсли;
	Если ф_ОтвИсп Тогда 
		Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "И &Отбор1", "Заявки.Регистратор.Ответственный В (&Ответственный) И &Отбор1");
		Список.Параметры.УстановитьЗначениеПараметра("Ответственный", р_Ответственный);
	КонецЕсли;
	Если ф_ПодрИсп Тогда 
		Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "И &Отбор1", "Заявки.Регистратор.Подразделение В (&Подразделение) И &Отбор1");
		Список.Параметры.УстановитьЗначениеПараметра("Подразделение", р_Подразделение);
	КонецЕсли;
	Если ф_СпособИсп Тогда 
		Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "И &Отбор1", "Заявки.Регистратор.СпособСогласования В (&Способ) И &Отбор1");
		Список.Параметры.УстановитьЗначениеПараметра("Способ", СпособСогласования);
	КонецЕсли;
	Если ф_ИспИсп Тогда 
		Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "И &Отбор1", "Заявки.Исполнитель В (&Исполнитель) И &Отбор1");
		Список.Параметры.УстановитьЗначениеПараметра("Исполнитель", р_Исполнитель);
	КонецЕсли;
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ПериодРемонта.ДатаНачала);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", ПериодРемонта.ДатаОкончания);
	
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "И &Отбор1", "");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтборыВСписке()
	
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ПериодРемонта.ДатаНачала);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", ПериодРемонта.ДатаОкончания);
КонецПроцедуры

&НаКлиенте
Процедура ПериодРемонтаПриИзменении(Элемент)
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ПериодРемонта.ДатаНачала);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", ПериодРемонта.ДатаОкончания);
КонецПроцедуры

&НаКлиенте
Процедура р_ОтветственныйПриИзменении(Элемент)
	ОбновитьОтборыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтборыНаСервере()
	Список.ТекстЗапроса = ПолучитьИсходныйТекстЗапроса();
	Если ф_ОстановочныйИсп Тогда 
		Если р_Остановочный Тогда 
			Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "И &Отбор1", "И Заявки.Регистратор.гкс_НуженОстанов = ""Да"" И &Отбор1");
		Иначе
			Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "И &Отбор1", "И Заявки.Регистратор.гкс_НуженОстанов = ""Нет"" И &Отбор1");
		КонецЕсли;
	КонецЕсли;
	Если ф_ОтвИсп Тогда 
		Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "И &Отбор1", "И Заявки.Регистратор.Ответственный В (&Ответственный) И &Отбор1");
		Список.Параметры.УстановитьЗначениеПараметра("Ответственный", р_Ответственный);
	КонецЕсли;
	Если ф_ПодрИсп Тогда 
		Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "И &Отбор1", "И Заявки.Регистратор.Подразделение В (&Подразделение) И &Отбор1");
		Список.Параметры.УстановитьЗначениеПараметра("Подразделение", р_Подразделение);
	КонецЕсли;
	Если ф_СпособИсп Тогда 
		Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "И &Отбор1", "И Заявки.Регистратор.СпособСогласования В (&Способ) И &Отбор1");
		Список.Параметры.УстановитьЗначениеПараметра("Способ", СпособСогласования);
	КонецЕсли;
	Если ф_ИспИсп Тогда 
		Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "И &Отбор1", "И Заявки.Исполнитель В (&Исполнитель) И &Отбор1");
		Список.Параметры.УстановитьЗначениеПараметра("Исполнитель", р_Исполнитель);
	КонецЕсли;
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ПериодРемонта.ДатаНачала);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", ПериодРемонта.ДатаОкончания);
	
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "И &Отбор1", "");
КонецПроцедуры
