
&НаСервере
&После("ЗаполнитьТаблицыПолей")
Процедура гкс_ЗаполнитьТаблицыПолей()
	ЗаполнениеТаблицы = Объект.ЗаполнениеТабличнойЧасти;
	НС = ЗаполнениеТаблицы.Добавить();
	НС.ТаблицаИмяПоля	   = "гкс_СимптомДефекта";
	НС.ТаблицаСинонимПоля  = "Симптом дефекта";
	НС.ТаблицаЗначениеПоля = Справочники.гкс_СимптомыДефектов.ПустаяСсылка();
КонецПроцедуры

&НаСервере
Процедура гкс_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	НайдСтр = Объект.ЗаполнениеТабличнойЧасти.НайтиСтроки(Новый Структура("ТаблицаИмяПоля", "гкс_СимптомДефекта"));
	Если НайдСтр.Количество() = 0 Тогда 
		ЗаполнениеТаблицы = Объект.ЗаполнениеТабличнойЧасти;
		НС = ЗаполнениеТаблицы.Добавить();
		НС.ТаблицаИмяПоля	   = "гкс_СимптомДефекта";
		НС.ТаблицаСинонимПоля  = "Симптом дефекта";
		НС.ТаблицаЗначениеПоля = Справочники.гкс_СимптомыДефектов.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры
