#Область ОбработчикиСобытийФормы

&НаСервере
Процедура гкс_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// гкс+ [Релиз16] Деснол
	гкс_ДобавитьНовыеЭлементы();
	// гкс- [Релиз16]
	
	// гкс+ [Часовые пояса] Куст 
	гкс_ЧасовыеПоясаВызовСервера.ДобавитьНовыеЭлементы(ЭтаФорма, Элементы.ДатаИНомер,
		Новый Структура("гкс_РеквизитыДаты", "Дата,ДатаСоздания"));
	// гкс+ [Релиз 1] Куст 
	Элементы.СпособСогласования.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПередЗаписью")
Процедура гкс_ПередЗаписью(Отказ, ПараметрыЗаписи)

	#Вставка
	// гкс+ [Перед записью] Куст
	МассивСтруктур = новый Массив();
	МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "Организация", НСтр("ru='Организация';en='Organization'")));
	МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "Подразделение", НСтр("ru='Подразделение';en='Subdivision'")));
	МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "ДатаСоздания", Элементы.ДатаСоздания.Заголовок));
	МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "Ответственный", НСтр("ru='Ответственный';en='Responsible'")));
	Для Каждого СтрокаМассива Из МассивСтруктур Цикл
		Если Не ЗначениеЗаполнено(Объект[СтрокаМассива.Имя]) Тогда 
			Сообщение = Новый СообщениеПользователю();
			ШаблонСообщения = НСтр("ru='Поле ""%1"" не заполнено';en='Field %1 is empty'");
			Сообщение.Текст = СтрШаблон(ШаблонСообщения, СтрокаМассива.Текст);
			Сообщение.Поле = "Объект." + СтрокаМассива.Имя;
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	//
	Если Объект.ОбследованноеОборудование.Количество() = 0 Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='В документе не указан ОР';en='The document does not specify an OR'");
		Сообщение.Сообщить();
		Отказ = Истина;
	Иначе
		МассивСтруктур = новый Массив();
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "ОбъектРемонта", НСтр("ru='Объект ремонта';en='Object of repair'")));
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "Исполнитель", НСтр("ru='Исполнитель';en='Executor'")));
		// гкс+ [Релиз16] Деснол
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "ПлановаяДатаРемонта",
			НСтр("ru='Плановая дата начала';en='Scheduled start date'")));
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "гкс_ДатаОкончания",
			НСтр("ru='Плановая дата начала';en='Scheduled end date'")));
		// гкс- [Релиз16]
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "Описание", НСтр("ru='Описание';en='Description'")));
		Для Каждого СтрокаМассива Из МассивСтруктур Цикл
			НомерПП = 0;
			Для Каждого СтрокаТаблицы Из Объект.ОбследованноеОборудование Цикл
				Если Не ЗначениеЗаполнено(СтрокаТаблицы[СтрокаМассива.Имя]) Тогда 
					Сообщение = Новый СообщениеПользователю();
					ШаблонСообщения = НСтр("ru='Поле ""%1"" не заполнено';en='Field %1 is empty'");
					Сообщение.Текст = СтрШаблон(ШаблонСообщения, СтрокаМассива.Текст);
					Сообщение.Поле = "Объект.ОбследованноеОборудование[" + НомерПП + "]." + СтрокаМассива.Имя;
					Сообщение.Сообщить();
					Отказ = Истина;
				КонецЕсли;
				НомерПП = НомерПП + 1;
			КонецЦикла;
		КонецЦикла;
		// гкс+ [Релиз16] Деснол
		НомерПП = 0;
		Для Каждого СтрокаТаблицы Из Объект.ОбследованноеОборудование Цикл
			Если ЗначениеЗаполнено(СтрокаТаблицы.гкс_ДатаОкончания) И
				СтрокаТаблицы.ПлановаяДатаРемонта > СтрокаТаблицы.гкс_ДатаОкончания Тогда 
				Отказ = Истина;
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = НСтр("ru='Дата начала больше даты окончания';
				|en='Start date is greater than end date'");
				Сообщение.Поле = "Объект.ОбследованноеОборудование[" + НомерПП + "].гкс_ДатаОкончания";
				Сообщение.Сообщить();
			КонецЕсли;
		КонецЦикла;
		НомерПП = НомерПП + 1;
		// гкс- [Релиз16]
	КонецЕсли;
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	#КонецВставки
КонецПроцедуры

&НаСервере
Процедура гкс_ПриЧтенииНаСервереПосле(ТекущийОбъект)
	// гкс+ [Часовые пояса] Куст
	СтруктураПроверки = Новый Структура("гкс_СдвигЧП", Неопределено);
	ЗаполнитьЗначенияСвойств(СтруктураПроверки, ЭтотОбъект);
	Если Не СтруктураПроверки.гкс_СдвигЧП = Неопределено Тогда 
		гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПКлиента(ЭтаФорма,, Объект);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере(ДатаКлиента)
	Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда 
		Объект.Дата = ТекущаяДата();
	КонецЕсли;
	// гкс+ [Часовые пояса] Куст
	гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПКлиента(ЭтаФорма,,,);
	// Заголовок формы++
	торо_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(Объект, ЭтаФорма, "");
	// Заголовок формы--
КонецПроцедуры

&НаКлиенте
Процедура гкс_ПриОткрытииПосле(Отказ)
	ПриОткрытииНаСервере(ТекущаяДата());
КонецПроцедуры

&НаСервере
Процедура гкс_ПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// гкс+ [Часовые пояса] Куст
	гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПСервера(ЭтаФорма,, ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура гкс_ПриЗаписиНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// гкс+ [Часовые пояса] Куст 
	гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПКлиента(ЭтаФорма,, ТекущийОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
&ИзменениеИКонтроль("СпособСогласованияНачалоВыбора")
Процедура гкс_СпособСогласованияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	Если СогласующиеРегистр.Количество() > 0 Тогда

		СтандартнаяОбработка = Ложь;
		ОписаниеОповещения = Новый ОписаниеОповещения("СпособСогласованияНачалоВыбораЗавершение",ЭтотОбъект,Новый Структура("Элемент",Элемент));
		ПоказатьВопрос(ОписаниеОповещения, НСтр("es='¡Los datos de los estatus establecidos del documento serán limpiados! ¿Continuar?';ru='Данные по установленным статусам документа будут очищены! Продолжить?';en='Data on the established statuses of the document will be cleared! Continue?'"), РежимДиалогаВопрос.ДаНет);

	КонецЕсли;
	#Вставка
	// гкс+ [Релиз 1] Куст 
	СтандартнаяОбработка = Ложь;
	ДопПараметры = Новый Структура("Отбор", Новый Структура("ПометкаУдаления", Ложь));
	ОткрытьФорму("Справочник.торо_СпособыСогласованияДокументов.ФормаВыбора",ДопПараметры,
	Элемент, , , , , РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	#КонецВставки

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("СпособСогласованияНачалоВыбораЗавершение")
Процедура гкс_СпособСогласованияНачалоВыбораЗавершение(РезультатВопроса, ДополнительныеПараметры)

	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		СогласующиеРегистр.Очистить();
		Если мХранитьИсториюСогласованияВДокументах Тогда
			Объект.Согласующие.Очистить();
		КонецЕсли;
		#Вставка
		// гкс+ [Релиз 1] Куст 
		ДопПараметры = Новый Структура("Отбор", Новый Структура("ПометкаУдаления", Ложь));
		ОткрытьФорму("Справочник.торо_СпособыСогласованияДокументов.ФормаВыбора",ДопПараметры,
		ДополнительныеПараметры.Элемент, , , , , РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		#КонецВставки
		#Удаление
		ОткрытьФорму("Справочник.торо_СпособыСогласованияДокументов.ФормаВыбора",,ДополнительныеПараметры.Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		#КонецУдаления
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("СпособСогласованияПриИзменении")
Процедура гкс_СпособСогласованияПриИзменении(Элемент)

	Если фПослеОчистки = Ложь Тогда
		ОбновитьДеревоСогласующих(Истина);
		#Удаление
		торо_РаботаССогласованиямиКлиентСервер.ДобавитьСтрокуВИсториюСтатусов(ЭтаФорма, СтатусДокументаРегистр,, Истина);
		#КонецУдаления
		#Вставка
		торо_РаботаССогласованиямиКлиентСервер.ДобавитьСтрокуВИсториюСтатусов(ЭтаФорма, СтатусДокументаРегистр,,);
		#КонецВставки
	Иначе
		фПослеОчистки = Ложь;
	КонецЕсли;

	УправлениеВидимостью(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	Если ЭтотОбъект["мИспользоватьСогласованиеДокументов"] И Элементы["СпособСогласования"].ТолькоПросмотр
		И Не СтатусДокументаРегистр = ЭтаФорма["гкс_СтатусЧерновик"] Тогда 
		Возврат;
	КонецЕсли;
	//
	Если Объект.ОбследованноеОборудование.Количество() > 0 Тогда 
		Способ = гкс_ПолучитьСпособСогласования(Объект.Организация, Объект.ОбследованноеОборудование[0].ОбъектРемонта, Объект.Ссылка);
		Если ЗначениеЗаполнено(Способ) И Не Объект.СпособСогласования = Способ Тогда 
			Объект.СпособСогласования = Способ;
			СпособСогласованияПриИзменении(Неопределено);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура гкс_ОрганизацияПриИзмененииПосле(Элемент)
	ПодразделениеПриИзменении(Неопределено);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// гкс+ [Релиз16] Деснол
&НаСервере
Процедура гкс_ДобавитьНовыеЭлементы()
	// гкс+ [03.23] Деснол 13.03.2023
	Если Не РольДоступна("гкс_РедактированиеЗаявкиНаРемонт") Тогда 
		Элементы.Дата.ТолькоПросмотр = Истина;
	КонецЕсли;
	// гкс- [03.23] Деснол 13.03.2023
	// гкс+ [Перед записью] Куст 
	Элементы.ДеревоРемонтныхРабот.Видимость = Ложь;
	Элементы.ОбследованноеОборудованиеОписание.АвтоОтметкаНезаполненного = Истина;
	Элементы.ОбследованноеОборудованиеИсполнитель.АвтоОтметкаНезаполненного = Истина;
	Элементы.ОбследованноеОборудованиеТиповойДефект.Видимость = Ложь;
	// гкс+ [Релиз19] Деснол
	Если Не (РольДоступна("ПолныеПрава") 
		ИЛИ РольДоступна("гкс_РедактированиеЗаявкиНаРемонт")
		ИЛИ РольДоступна("Администрирование")) Тогда 
	// гкс- [Релиз19]
		Элементы.Ответственный.ТолькоПросмотр = Истина;
	КонецЕсли; // гкс- [Перед записью]
	//
	Элементы.Подразделение.УстановитьДействие("ПриИзменении","ПодразделениеПриИзменении");
	//
	МассивРеквизитов = Новый Массив();
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_СтатусЧерновик", Новый ОписаниеТипов("СправочникСсылка.торо_СтатусыСогласованияДокументовРемонтныхРабот")));
	ИзменитьРеквизиты(МассивРеквизитов);
	ЭтаФорма["гкс_СтатусЧерновик"] = справочники.торо_СтатусыСогласованияДокументовРемонтныхРабот.Черновик;
	//
	НКом = Команды.Добавить("дс_ОтправитьНаСогласование");
	НКом.Действие = "дс_ОтправитьНаСогласование";
	НКом.Заголовок = НСтр("ru='Отправить на согласование';en='Send for approval'");
	//
	НКноп = Элементы.Добавить("дс_ОтправитьНаСогласование",Тип("КнопкаФормы"),Элементы.ФормаКоманднаяПанель);
	НКноп.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НКноп.ИмяКоманды = "дс_ОтправитьНаСогласование";
	Элементы.Переместить(Элементы["дс_ОтправитьНаСогласование"],Элементы.ФормаКоманднаяПанель,Элементы.ФормаПроведение);
	дс_ИзменитьВидимостьКнопкиОтправкиНаСогласование();
	//
	НовыйЭлемент = Элементы.Добавить("гкс_ДатаОкончания", Тип("ПолеФормы"), Элементы.ОбъектРемонтаИДатаОбработки);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ОбследованноеОборудование.гкс_ДатаОкончания";
	НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;
	// гкс+ [11.22] Деснол 03.11.2022
	НовыйЭлемент = Элементы.Вставить("гкс_ОРТехНомер", Тип("ПолеФормы"), Элементы.ОбъектРемонтаИДатаОбработки, Элементы.ОбследованноеОборудованиеПлановаяДатаРемонта);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ОбследованноеОборудование.ОбъектРемонта.ТехНомер";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	// гкс- [11.22] Деснол 03.11.2022
	// гкс+ [Релиз18] Деснол
	НоваяКомандаФормы = Команды.Добавить("ОткрытьЗакрытиеЗаявокИРемонтов");
	НоваяКомандаФормы.Действие = "ОткрытьЗакрытиеЗаявокИРемонтов";
	НоваяКомандаФормы.Заголовок = НСтр("ru='Закрытие заявок и ремонтов';en='Closing applications and repairs'");
	//
	НоваяКнопкаФормы = Элементы.Добавить("гкс_ОткрытьЗакрытиеЗаявокИРемонтов",Тип("КнопкаФормы"), Элементы.ФормаКоманднаяПанель);
	НоваяКнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НоваяКнопкаФормы.ИмяКоманды = "ОткрытьЗакрытиеЗаявокИРемонтов";
	Элементы.Переместить(Элементы["гкс_ОткрытьЗакрытиеЗаявокИРемонтов"],
		Элементы.ФормаКоманднаяПанель, Элементы.ФормаОбщаяКомандаДополнительныеСведенияКоманднаяПанель);
	// гкс- [Релиз18]
КонецПроцедуры
// гкс- [Релиз16]

&НаСервере
Функция гкс_ПолучитьСпособСогласования(Организация, ОбъектРемонта, ОбъектСсылка = Неопределено)
	Если торо_РаботаССогласованиями.гкс_ПоДокументуЕстьИстория(ОбъектСсылка) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	Подр = Справочники.СтруктураПредприятия.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ОбъектыРемонта.Подразделение КАК Подразделение
		|ИЗ
		|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|ГДЕ
		|	торо_ОбъектыРемонта.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ОбъектРемонта);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда 
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Подр = Выборка.Подразделение;
	КонецЕсли;
	ПодрИсп = Справочники.СтруктураПредприятия.ПустаяСсылка();
	Для Каждого СтрокаТаблицы Из Объект.ОбследованноеОборудование Цикл
		Если ТипЗнч(СтрокаТаблицы.Исполнитель) = Тип("СправочникСсылка.СтруктураПредприятия") Тогда 
			ПодрИсп = СтрокаТаблицы.Исполнитель;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат торо_РаботаССогласованиями.гкс_ПолучитьСпособСогласованияПоУмолчанию(
		Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_ВнешнееОснованиеДляРабот,
		Организация, Подр, ПодрИсп);
КонецФункции

&НаКлиенте
Процедура гкс_ОбследованноеОборудованиеИсполнительПриИзмененииПосле(Элемент)
	ПодразделениеПриИзменении(Истина);
КонецПроцедуры

&НаКлиенте
Процедура гкс_ОбследованноеОборудованиеОбъектРемонтаПриИзмененииПосле(Элемент)
	ПодразделениеПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура гкс_ОбследованноеОборудованиеПослеУдаленияПосле(Элемент)
	ПодразделениеПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура гкс_ОбследованноеОборудованиеПриОкончанииРедактированияПосле(Элемент, НоваяСтрока, ОтменаРедактирования)
	ПодразделениеПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура дс_ОтправитьНаСогласование(Команда)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Параметры1 = Новый Структура("дс_Выполнить", Истина);
		Параметры2 = Новый Структура();
		
		гкс_ОбщегоНазначенияСервер.ОтправитьНаСогласованиеНаСервере(Параметры1, Параметры2);
		Если Параметры1.дс_Выполнить Тогда 
			Параметры2.Вставить("Форма", ЭтаФорма);
			торо_РаботаССогласованиямиКлиент.ВыбратьСтатусЗавершение(Параметры1, Параметры2);
			дс_ИзменитьВидимостьКнопкиОтправкиНаСогласование();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура дс_ИзменитьВидимостьКнопкиОтправкиНаСогласование()
	гкс_ОбщегоНазначенияСервер.ИзменитьВидимостьКнопкиОтправкиНаСогласование(Элементы["дс_ОтправитьНаСогласование"],СтатусДокументаРегистр);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
// гкс+ [Релиз18] Деснол
&НаКлиенте
Процедура ОткрытьЗакрытиеЗаявокИРемонтов(Команда)
	Если Объект.Проведен = Ложь Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Необходимо провести документ';en='you need to post a document'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ВыбранныеРемонты = Новый Массив;
	Для каждого Ремонт Из Объект.ОбследованноеОборудование Цикл
		ВыбранныеРемонты.Добавить(Ремонт.ID);
	КонецЦикла; 
	
	Отбор = Новый Структура;
	Отбор.Вставить("ID", ВыбранныеРемонты);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОтборРемонтов", Отбор);
	ПараметрыФормы.Вставить("ТекущаяСтраница", "ГруппаАварийныеРемонты");
	
	ОткрытьФорму("Обработка.торо_ЗакрытиеЗаявокИРемонтов.Форма.Форма", ПараметрыФормы,,,,,,);
	
КонецПроцедуры
// гкс- [Релиз18]
#КонецОбласти
