
Функция ПолучитьПустыеЗначения() Экспорт
	
	МассивПустых = Новый Массив;
	Типы = Метаданные.ПланыВидовХарактеристик.АтрибутыКласса.Тип.Типы();
	Для Каждого Тип ИЗ Типы Цикл
		ПустоеЗначение = Неопределено;
		МетаданныеПоТипу = Метаданные.НайтиПоТипу(Тип);
		Если НЕ МетаданныеПоТипу = Неопределено Тогда
			Если Справочники.ТипВсеСсылки().СодержитТип(Тип) Тогда
				ПустоеЗначение = Справочники[МетаданныеПоТипу.Имя].ПустаяСсылка();
			ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(Тип) Тогда
				ПустоеЗначение = Документы[МетаданныеПоТипу.Имя].ПустаяСсылка();
			ИначеЕсли ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(Тип) Тогда
				ПустоеЗначение = ПланыВидовХарактеристик[МетаданныеПоТипу.Имя].ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
		Если НЕ ПустоеЗначение = Неопределено Тогда
			МассивПустых.Добавить(ПустоеЗначение);
		КонецЕсли;
	КонецЦикла;
	
	МассивПустых.Добавить(ПустоеЗначение);
	
	Возврат МассивПустых;
	
КонецФункции