
#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСтруктуруДанныхРемонтовОборудования(СсылкаНаДок, ИмяТЧ) Экспорт
	
	РемонтыОборудования = Новый Массив;
	
	Для каждого Стр Из СсылкаНаДок[ИмяТЧ] Цикл
		СтруктураТЧ = Новый Структура("ID, ОбъектРемонта, ВидРемонтныхРабот, ДатаНачала, ДатаОкончания, ДокументИсточник");
		ЗаполнитьЗначенияСвойств(СтруктураТЧ, Стр);
		РемонтыОборудования.Добавить(СтруктураТЧ);
	КонецЦикла;
	
	Возврат РемонтыОборудования;
	
КонецФункции

Функция ПолучитьСтруктуруДанныхГарантийнхРемонтов(СсылкаНаДок, ИмяТЧ) Экспорт
	
	РемонтыОборудования = Новый Массив;
	
	Для каждого Стр Из СсылкаНаДок[ИмяТЧ] Цикл
		СтруктураТЧ = Новый Структура("ID, ОбъектРемонта, ВидРемонтныхРабот, ДатаНачала, ДатаОкончания, ДокументИсточник");
		Если Стр.ГарантийныйРемонт Тогда
			ЗаполнитьЗначенияСвойств(СтруктураТЧ, Стр);
			РемонтыОборудования.Добавить(СтруктураТЧ);
		КонецЕсли;
	КонецЦикла;
	
	Возврат РемонтыОборудования;
	
КонецФункции

Функция ПолучитьСтруктуруДанныхРемонтовОборудованияСПодрядчиками(СсылкаНаДок) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтыОборудования_ID КАК ID,
	|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Исполнитель КАК Контрагент
	|ПОМЕСТИТЬ ТаблицаПодрядчиков
	|ИЗ
	|	Документ.торо_АктОВыполненииЭтапаРабот.РемонтныеРаботы КАК торо_АктОВыполненииЭтапаРаботРемонтныеРаботы
	|ГДЕ
	|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Ссылка = &Ссылка
	|	И торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Исполнитель ССЫЛКА Справочник.Контрагенты
	|	И торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Исполнитель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ID КАК ID,
	|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ДатаНачала КАК ДатаНачала,
	|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ДатаОкончания КАК ДатаОкончания,
	|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ДокументИсточник КАК ДокументИсточник
	|ИЗ
	|	Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК торо_АктОВыполненииЭтапаРаботРемонтыОборудования
	|ГДЕ
	|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка = &Ссылка
	|	И торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ID В
	|			(ВЫБРАТЬ
	|				ТаблицаПодрядчиков.ID КАК ID
	|			ИЗ
	|				ТаблицаПодрядчиков КАК ТаблицаПодрядчиков)";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДок);
	Выборка = Запрос.Выполнить().Выбрать();
	
	РемонтыОборудования = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		СтруктураТЧ = Новый Структура("ID, ОбъектРемонта, ВидРемонтныхРабот, ДатаНачала, ДатаОкончания, ДокументИсточник");
		ЗаполнитьЗначенияСвойств(СтруктураТЧ, Выборка);
		РемонтыОборудования.Добавить(СтруктураТЧ);
	КонецЦикла;
	
	Возврат РемонтыОборудования;

КонецФункции

Функция ПолучитьСтруктуруДанныхРегламентныхМероприятий(СсылкаНаДок, ИмяТЧ) Экспорт
	
	мас = Новый Массив;
	Для каждого Стр Из СсылкаНаДок[ИмяТЧ] Цикл
		СтруктураТЧ = Новый Структура("ID, ОбъектРемонта, ВидРемонтныхРабот, ДатаНачала, ДатаОкончания");
		ЗаполнитьЗначенияСвойств(СтруктураТЧ, Стр);
		мас.Добавить(СтруктураТЧ);
	КонецЦикла;
	
	Возврат мас;
	
КонецФункции

Функция ПолучитьСтруктуруДанныхРемонтовОборудованияДляСпискаДокументов(Документ, ИмяТЧ) Экспорт
	
	РемонтыОборудования = Документ[ИмяТЧ].ВыгрузитьКолонку("ID");
	
	Возврат РемонтыОборудования;
	
КонецФункции

Функция ПолучитьСтруктуруДанныхРегламентныхМероприятийДляСпискаДокументов(Документ, ИмяТЧ) Экспорт
	мас = Документ[ИмяТЧ].ВыгрузитьКолонку("ID");
	Возврат мас;
КонецФункции

Функция ПолучитьСписокПодрядчиков(Акт) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Исполнитель КАК Контрагент
	|ИЗ
	|	Документ.торо_АктОВыполненииЭтапаРабот.РемонтныеРаботы КАК торо_АктОВыполненииЭтапаРаботРемонтыОборудования
	|ГДЕ
	|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка = &Ссылка
	|	И торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Исполнитель ССЫЛКА Справочник.Контрагенты";
	
	Запрос.УстановитьПараметр("Ссылка", Акт);
	
	МассивПодрядчиков = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Контрагент");
	
	Возврат МассивПодрядчиков; 	
	
КонецФункции

Функция ПолучитьСписокПодрядчиковПоРемонтам(Документ, СписокIDРемонта) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Исполнитель КАК Контрагент
	|ИЗ
	|	Документ.торо_АктОВыполненииЭтапаРабот.РемонтныеРаботы КАК торо_АктОВыполненииЭтапаРаботРемонтыОборудования
	|ГДЕ
	|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.РемонтыОборудования_ID В(&РемонтыОборудования_ID)
	|	И торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка = &Ссылка
	|	И торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Исполнитель ССЫЛКА Справочник.Контрагенты
	|	И НЕ торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Исполнитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	Запрос.УстановитьПараметр("РемонтыОборудования_ID", СписокIDРемонта);
	
	МассивПодрядчиков = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Контрагент");
	
	Возврат МассивПодрядчиков; 	
	
КонецФункции


Функция СтруктураПараметровППР(Документ) Экспорт
	
	Если ЗначениеЗаполнено(Документ.ПериодичностьДетализации) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ДОБАВИТЬКДАТЕ(&ДатаНачала, " + Строка(Документ.ПериодичностьДетализации) + ", "+?(Документ.КоличествоПериодов=0,1,Документ.КоличествоПериодов)+") КАК ДатаОкончания";
		
		Запрос.УстановитьПараметр("ДатаНачала", Документ.ДатаПланирования);
		
		Попытка
			Выборка = Запрос.Выполнить().Выбрать();
		Исключение
			Возврат Дата(3999,12,31,23,59,59);
		КонецПопытки;
		
		Если Выборка.Следующий() Тогда
			
			ДатаОкончанияПланирования = ?(Документ.ПериодичностьДетализации = Перечисления.Периодичность.День, Выборка.ДатаОкончания-1, НачалоДня(Выборка.ДатаОкончания)-1);
			
		КонецЕсли;
		
	Иначе 	
		
		ТекстСообщения = НСтр("es='de la planificación!';ru='Не выбран период планирования!';en='No planning period selected!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	ОтборПечатнойФормы = Новый Структура;
	ОтборПечатнойФормы.Вставить("Имя", "Список объектов регламентного мероприятия");
	ОтборПечатнойФормы.Вставить("Значение");
	ОтборПечатнойФормы.Вставить("Использование", Ложь);
	ОтборПечатнойФормы.Вставить("ВидСравнения");
	
	МассивОтборПечатнойФормы = Новый Массив;
	МассивОтборПечатнойФормы.Добавить(ОтборПечатнойФормы);
	МассивОтборПечатнойФормы.Добавить(ОтборПечатнойФормы);
	
	ПередаваемыйПараметр = Новый Структура;
	ПередаваемыйПараметр.Вставить("ДатаНачала",Документ.ДатаПланирования);
	ПередаваемыйПараметр.Вставить("ДатаКонца",ДатаОкончанияПланирования);	
	ПередаваемыйПараметр.Вставить("ИнтервалРазбиения","Месяц");
	ПередаваемыйПараметр.Вставить("ОтборФормы", МассивОтборПечатнойФормы);
	
	Возврат ПередаваемыйПараметр;
	
КонецФункции

// Возвращает дату окончания планирования документа План-график ППР
Функция ДатаОкончанияПланированияПланГрафикППР(Ссылка) Экспорт
	
	Если ЗначениеЗаполнено(Ссылка.ПериодичностьДетализации) Тогда		
		Возврат ОбщегоНазначенияУТКлиентСервер.РассчитатьДатуОкончанияПериода(Ссылка.ДатаПланирования, Ссылка.ПериодичностьДетализации, Ссылка.КоличествоПериодов);
	Иначе
		ТекстСообщения = НСтр("es='de la planificación!';ru='Не выбран период планирования!';en='No planning period selected!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецФункции

#КонецОбласти
