
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	Если Не ЭтоГруппа Тогда
		Если Не ПланГрафикППР и Не Непериодический и Не ГрафикМероприятий Тогда
			ТекстСообщения = НСтр("es='¡Por lo menos una de las banderas de la selección debe ser establecido!';ru='Хотя бы один из флагов отбора должен быть установлен!';en='At least one of the selection flags must be set!'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти