#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс


// Возвращает ссылку на произвольный предопределенный объект по имени.
//
// Параметры:
//	ИмяПредопределенного - Строка - Имя предопределенного элемента в конфигурации.
//
// Возвращаемое значение:
//  ЛюбаяСсылка - ссылка на предопределенный элемент.
//  Неопределено - если предопределенный элемент есть в метаданных, но не создан в ИБ.
//
Функция ПроизвольныйПредопределенныйОбъект(ИмяПредопределенного) Экспорт
    
	ПолноеИмяПредопределенного = "ПланВидовХарактеристик.гкс_ПроизвольныеПредопределенныеОбъекты."
		+ ИмяПредопределенного;

	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПредопределенноеЗначение(ПолноеИмяПредопределенного),
		"СсылкаНаОбъект");
    
КонецФункции

#КонецОбласти 

#КонецЕсли