
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЭтотОб = РеквизитФормыВЗначение("Объект");
	ДопСвойства = Справочники.гкс_ПроизвольныеНастройкиИнтеграций.ПолучитьСвойства(Объект.Ссылка, "ДопСвойства");
	Если ДопСвойства <> Неопределено Тогда
		ТЧДопСвойства.Загрузить(ДопСвойства);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ДопСвойства = Новый ХранилищеЗначения(ТЧДопСвойства.Выгрузить());	
	
КонецПроцедуры

#КонецОбласти

