
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.НоменклатураКласса.Доступность    = НЕ Объект.КлассТабличнаяЧасть;
	Элементы.ЗначениеАтрибута.Доступность      = НЕ Объект.КлассТабличнаяЧасть;
	Элементы.ОбъектыНоменклатуры.Доступность   = Объект.НоменклатураКласса;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураКлассаПриИзменении(Элемент)
	
	Элементы.ОбъектыНоменклатуры.Доступность = Объект.НоменклатураКласса;
	
КонецПроцедуры

&НаКлиенте
Процедура КлассТабличнаяЧастьПриИзменении(Элемент)
	
	Элементы.НоменклатураКласса.Доступность    = НЕ Объект.КлассТабличнаяЧасть;
	Элементы.ЗначениеАтрибута.Доступность      = НЕ Объект.КлассТабличнаяЧасть;
	Если Объект.КлассТабличнаяЧасть Тогда
		Объект.ЗначениеАтрибута   = Ложь;
		Объект.НоменклатураКласса = Истина;
		Элементы.ОбъектыНоменклатуры.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры
