#Область ОбработчикиСобытийФормы

&НаСервере
&После("ПриСозданииНаСервере")
Процедура Расш_гкс_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДобавитьНовыеЭлементы();
	// Гкс+[TOIR20-563] Зозуля А.В. от 01.04.2025. Добавлено:{
	Если Параметры.Свойство("Организация") И Параметры.Свойство("Подразделение") Тогда
		ЭтотОбъект["гкс_Организация"] = Параметры.Организация;
		ЭтотОбъект["гкс_Подразделение"] = Параметры.Подразделение;		
		ЭтотОбъект["гкс_ОтборПоОрганизацииИПодразделению"] = Истина;
		УстановитьОтборыСпискаНаСервере();			
	КонецЕсли;
	// } Гкс-[TOIR20-563] Зозуля А.В. от 01.04.2025.
	торо_ЛокализацияМодификацияФорм.ПеревестиДинамическийСписок(ЭтаФорма, Список, "Наименование,Комментарий", Метаданные.Справочники.торо_ОбъектыРемонта);
	дс_УстановитьЗаголовкиЭлементов();
КонецПроцедуры

// Гкс+[TOIR20-563] Зозуля А.В. от 01.04.2025. Добавлено:{
&НаКлиенте
Процедура гкс_ОтборПоОрганизацииИПодразделению(Элемент)
	
	//ОтборВключен = ЭтотОбъект["гкс_ОтборПоОрганизацииИПодразделению"];
	//
	//Если ЭтотОбъект["гкс_ОтборПоОрганизацииИПодразделению"] Тогда 
	//	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	//		Список, "Организация", ЭтотОбъект["гкс_Организация"], ВидСравненияКомпоновкиДанных.Равно, , ОтборВключен);
	//	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	//		Список, "Подразделение", ЭтотОбъект["гкс_Подразделение"], ВидСравненияКомпоновкиДанных.Равно, , ОтборВключен);		
	//КонецЕсли;	
	УстановитьОтборыСпискаНаСервере();			
	
КонецПроцедуры // } Гкс-[TOIR20-563] Зозуля А.В. от 01.04.2025.	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьНовыеЭлементы()
	МассивРеквизитов = Новый Массив();
	
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ИспользоватьОтборТипОбъекта",Новый ОписаниеТипов("Булево")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ОтборТипОбъектаУсловиеРавно",Новый ОписаниеТипов("Булево")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ОтборТипОбъекта",Новый ОписаниеТипов("ПеречислениеСсылка.торо_ТипыОбъектовRCM")));
	// Гкс+[TOIR20-563] Зозуля А.В. от 01.04.2025. Добавлено:{
	Если Параметры.Свойство("Организация") И Параметры.Свойство("Подразделение") Тогда
		МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ОтборПоОрганизацииИПодразделению", Новый ОписаниеТипов("Булево")
			,,НСтр("ru='Отбор по организации и подразделению'")));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_Организация", Новый ОписаниеТипов("СправочникСсылка.Организации")));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_Подразделение", Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия")));
	КонецЕсли;	
	// } Гкс-[TOIR20-563] Зозуля А.В. от 01.04.2025.
	ИзменитьРеквизиты(МассивРеквизитов);
	//
	ЭтотОбъект["ОтборТипОбъектаУсловиеРавно"] = Истина;
	Если Параметры.Свойство("ИспользоватьОтборТипОбъекта") И Параметры.ИспользоватьОтборТипОбъекта = Истина Тогда 
		ЭтотОбъект["ОтборТипОбъекта"] = ?(ЗначениеЗаполнено(Параметры.ОтборТипОбъекта),Параметры.ОтборТипОбъекта,Перечисления.торо_ТипыОбъектовRCM.Объект);
		ЭтотОбъект["ИспользоватьОтборТипОбъекта"] = Параметры.ИспользоватьОтборТипОбъекта;
	КонецЕсли;
	Если Параметры.Свойство("ОтборТипОбъектаУсловиеРавно") Тогда 
		ЭтотОбъект["ОтборТипОбъектаУсловиеРавно"] = Параметры.ОтборТипОбъектаУсловиеРавно;
	КонецЕсли;
	
	// гкс+ [8220] Тарасов 19.10.2020
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "Код КАК Код", 
																"Код КАК Код,
																|	торо_ОбъектыРемонта.гкс_КатегорияРиска КАК гкс_ПриоритетОР");
	
	НЭлем = Элементы.Вставить("гкс_ПриоритетОР", Тип("ПолеФормы"), Элементы.Список, Элементы.Код);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Список.гкс_ПриоритетОР";
	// гкс+ [] Деснол 16.08.2022
	НЭлем.Заголовок = НСтр("ru='Категория риска';
	// гкс- [] Деснол 16.08.2022
							|en='Repair object priority';
							|es='Prioridad de objeto de reparación'");
	
	гкс_УстановитьУсловноеОформлениеНаПриоритетОР(Список);
	// гкс- [8220] Тарасов 19.10.2020
	
	// Гкс+[TOIR20-563] Зозуля А.В. от 01.04.2025. Добавлено:{
	Если Параметры.Свойство("Организация") И Параметры.Свойство("Подразделение") Тогда
		НЭлем = Элементы.Вставить("гкс_ОтборПоОрганизацииИПодразделению", Тип("ПолеФормы"));
		НЭлем.Вид = ВидПоляФормы.ПолеФлажка;
		НЭлем.ВидФлажка = ВидФлажка.Выключатель;
		НЭлем.ПутьКДанным = "гкс_ОтборПоОрганизацииИПодразделению";
		//НЭлем.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет; 
		НЭлем.УстановитьДействие("ПриИзменении", "гкс_ОтборПоОрганизацииИПодразделению");
		
	КонецЕсли;
	// } Гкс-[TOIR20-563] Зозуля А.В. от 01.04.2025.

КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтобратьПоТипуОбъета(МассивОР, ОтборТип, СравнениеРавно = Истина)
	МассивВозврата = Новый Массив();
	МассивТолькоОР = Новый Массив();
	Для Каждого СтрокаМассива Из МассивОР Цикл
		Если типЗнч(СтрокаМассива.Ссылка) = Тип("СправочникСсылка.торо_ОбъектыРемонта") Тогда 
			МассивТолькоОР.Добавить(СтрокаМассива.Ссылка);
		КонецЕсли;
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_ОбъектыРемонта.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|ГДЕ
		|	торо_ОбъектыРемонта.Ссылка В(&Ссылка)
		|	И "+?(СравнениеРавно=Ложь," Не ","")+" торо_ОбъектыРемонта.ТипОбъекта В (&ТипОбъекта)";
	
	Запрос.УстановитьПараметр("Ссылка", МассивТолькоОР);
	МассивОтборТип = Новый Массив();
	МассивОтборТип.Добавить(ОтборТип);
	Если ОтборТип = Перечисления.торо_ТипыОбъектовRCM.Объект Тогда 
		МассивОтборТип.Добавить(Перечисления.торо_ТипыОбъектовRCM.ПустаяСсылка());
	КонецЕсли;
	Запрос.УстановитьПараметр("ТипОбъекта", МассивОтборТип);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат МассивВозврата;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	СтрПоиска = Новый Структура("Ссылка");
	Для Каждого СтрокаМассива Из МассивОР Цикл
		СтрПоиска.Ссылка = СтрокаМассива.Ссылка;
		Если типЗнч(СтрокаМассива.Ссылка) = Тип("СправочникСсылка.торо_ОбъектыРемонта") Тогда 
			Если Выборка.НайтиСледующий(СтрПоиска) Тогда 
				МассивВозврата.Добавить(СтрокаМассива);
			КонецЕсли;
			Выборка.Сбросить();
		КонецЕсли;
	КонецЦикла;

	Возврат МассивВозврата;
КонецФункции

&НаКлиенте
&ИзменениеИКонтроль("ВыборЗначения")
Процедура Расш_гкс_ВыборЗначения()

	УчтываетсяИерархияЭлементов = ИспользоватьВариантУчетаИерархииЭлементов И ЗначениеЗаполнено(ВариантУчетаИерархииЭлементов)
	И ВариантУчетаИерархииЭлементов <> ПредопределенноеЗначение("Перечисление.торо_ВариантыУчетаИерархииЭлементовПриПодборе.НеУчитыватьИерархию");

	РазрешитьВыборНеОР = (Параметры.КлючНазначенияИспользования = "ДобавлениеВИерархию");
	МассивВыбранныхСтрок = торо_РаботаСИерархией20Клиент.ПолучитьМассивДанныхВыделенныхСтрок(ЭтаФорма,,РазрешитьВыборКорняИерархии,РазрешитьВыборНеОР ИЛИ УчтываетсяИерархияЭлементов);

	Если МассивВыбранныхСтрок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	РазрешитьВыборГрупп = (Элементы.Список.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Группы
	ИЛИ Элементы.Список.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.ГруппыИЭлементы);

	Если УчтываетсяИерархияЭлементов Тогда

		МассивВыбранныхСтрок = торо_РаботаСИерархией20.ДополнитьОтобратьМассивВыбранныхСтрок(МассивВыбранныхСтрок, ВариантУчетаИерархииЭлементов, ТекСтруктураИерархии, РазрешитьВыборГрупп);
	КонецЕсли;

	#Вставка
	Если ЭтотОбъект["ИспользоватьОтборТипОбъекта"] Тогда 
		МассивВыбранныхСтрок = ОтобратьПоТипуОбъета(МассивВыбранныхСтрок, ЭтотОбъект["ОтборТипОбъекта"],ЭтотОбъект["ОтборТипОбъектаУсловиеРавно"]);
		Если МассивВыбранныхСтрок.Количество() = 0 Тогда 
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Выбранные объекты не подходят по типу";
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;
	КонецЕсли;
	#КонецВставки

	НаличиеДанныхПомеченныхНаУдаление = Ложь;

	Для Каждого ДанныеСтр Из МассивВыбранныхСтрок Цикл

		Если торо_РаботаСИерархией20КлиентСервер.ЭтоОбычнаяГруппаПоКартинке(ДанныеСтр.ИндексКартинки) И НЕ РазрешитьВыборГрупп Тогда
			ТекстСообщения = НСтр("es='¡No es posible escoger el grupo!';ru='Нельзя выбрать группу!';en='Can not choose a group!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Возврат;
		ИначеЕсли типЗнч(ДанныеСтр.Ссылка) = Тип("СправочникСсылка.торо_СтруктурыОР") Тогда
			Если РазрешитьВыборКорняИерархии Тогда
				ЭтаФорма.ЗакрыватьПриВыборе = Истина;
				ОповеститьОВыборе(ПустойРодитель);
				Возврат;
			Иначе
				ТекстСообщения = НСтр("es='¡No es posible escoger la raíz!';ru='Нельзя выбирать корень!';en='Can not choose a root!'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
				Возврат;
			КонецЕсли;
		ИначеЕсли ДанныеСтр.ПометкаУдаления = Истина Тогда
			НаличиеДанныхПомеченныхНаУдаление = Истина;
			Прервать;
		КонецЕсли;

	КонецЦикла;

	ДопПараметры = Новый Структура("МассивВыбранныхСтрок", МассивВыбранныхСтрок);

	Если НаличиеДанныхПомеченныхНаУдаление Тогда

		ОписаниеОповещения = Новый ОписаниеОповещения("ВыборЗначенияПослеПроверкиПометкиУдаления", ЭтотОбъект, ДопПараметры);
		ТекстВопроса = НСтр("es='Los datos escogidos son marcados a la desaparición. "
		"¿Cumplir la elección de estos datos?';ru='Выбранные данные помечены на удаление."
		"Выполнить выбор этих данных?';en='The selected data is marked for deletion."
		"Select this data?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);

	Иначе

		ВыборЗначенияПослеПроверкиПометкиУдаления(КодВозвратаДиалога.Да, ДопПараметры);

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура дс_УстановитьЗаголовкиЭлементов()
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("СтатусВУчете", НСтр("es='El estado de la contabilidad';
	|ru='Статус в учете';en='Status in accounting'"));

	Для каждого ЗаголовокЭлемента Из Заголовки Цикл
		ИмяЭлемента = ЗаголовокЭлемента.Ключ;
		ПереводЗаголовка = ЗаголовокЭлемента.Значение;
		
		Элементы[ИмяЭлемента].Заголовок = ПереводЗаголовка;
	КонецЦикла; 
КонецПроцедуры

// гкс+ [8220] Тарасов 19.10.2020
&НаСервереБезКонтекста
Процедура гкс_УстановитьУсловноеОформлениеНаПриоритетОР(Список)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_КатегорииРиска.Ссылка КАК КатегорииРиска,
	|	торо_КатегорииРиска.Представление КАК Представление,
	|	торо_КатегорииРиска.Цвет КАК Цвет
	|ИЗ
	|	Справочник.торо_КатегорииРиска КАК торо_КатегорииРиска";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЭлементУсловногоОформления = Список.УсловноеОформление.Элементы.Добавить();
		ЭлементУсловногоОформления.Представление = ""+Выборка.Представление;
		
		ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("гкс_ПриоритетОР"); 
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
		ЭлементОтбора.ПравоеЗначение = Выборка.КатегорииРиска;
		
		ЦветФона = Выборка.Цвет.Получить();
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФона);
		
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить(); 
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("гкс_ПриоритетОР");
		
	КонецЦикла;
	
КонецПроцедуры// гкс- [8220] Тарасов 19.10.2020

&НаСервере
Процедура УстановитьОтборыСпискаНаСервере()
	
	ОтборВключен = ЭтотОбъект["гкс_ОтборПоОрганизацииИПодразделению"];
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "Организация", ЭтотОбъект["гкс_Организация"], ВидСравненияКомпоновкиДанных.Равно, , ОтборВключен);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "Подразделение", ЭтотОбъект["гкс_Подразделение"], ВидСравненияКомпоновкиДанных.Равно, , ОтборВключен);
			
КонецПроцедуры	

#КонецОбласти