#Область ОбработчикиСобытийФормы

&НаСервере
&После("ПриСозданииНаСервере")
Процедура Расш_гкс_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ОтборСтатусУстранен") Тогда 
		Список.ТекстЗапроса = Список.ТекстЗапроса + 
		" Где 	торо_СтатусыДокументов.СтатусДокумента = Значение(Перечисление.торо_СтатусыДокументов.Устранен)";
	КонецЕсли;
	// гкс+ [Часовые пояса] Куст 09.04.2020
	Сдвиг = Час(ТекущаяДатаСеанса()) - Час(ТекущаяДата());
	ТекстыЗамены = Новый Массив();
	ТекстыЗамены.Добавить(Новый Структура("До, После", "Документторо_ВыявленныеДефекты.Дата,",
		" ДобавитьКДате(Документторо_ВыявленныеДефекты.Дата, Час, " + Сдвиг + ") КАК Дата,"));
	ТекстыЗамены.Добавить(Новый Структура("До, После", "Документторо_ВыявленныеДефекты.ДатаОбнаружения,",
		" ДобавитьКДате(Документторо_ВыявленныеДефекты.ДатаОбнаружения, Час, " + Сдвиг + ") КАК ДатаОбнаружения,"));
	Список.ТекстЗапроса = гкс_ЧасовыеПоясаВызовСервера.ИзменитьТекстЗапросаФормыСписка(
		Список.ТекстЗапроса, ТекстыЗамены);
	// гкс- [Часовые пояса] Куст 09.04.2020
КонецПроцедуры

#КонецОбласти