#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Строки") Тогда 
		Для Каждого СтрокаМассива Из Параметры.Строки Цикл
			Если ТипЗнч(СтрокаМассива.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда 
				Продолжить;
			КонецЕсли;
			НСтрока = Список.Добавить();
			ЗаполнитьЗначенияСвойств(НСтрока, СтрокаМассива);
		КонецЦикла;
	Иначе
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	КоэфУмолчание = Справочники.гкс_ПКоэффициентыРабот.ПоУмолчанию;
	ПроверитьСписок();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ПроверитьСписок()
	Для Каждого СтрокаСписка ИЗ Список Цикл
		Если ЗначениеЗаполнено(СтрокаСписка.гкс_ПовКоэф) = Ложь Тогда 
			СтрокаСписка.гкс_ПовКоэф = Справочники.гкс_ПКоэффициентыРабот.ПоУмолчанию;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
	ПроверитьСписок();
	МассСтрок = Новый Массив();
	Для Каждого СтрокаСписка Из Список Цикл
		МассСтрок.Добавить(Новый Структура("ИД,гкс_ПовКоэф", СтрокаСписка.ИД, СтрокаСписка.гкс_ПовКоэф));
	КонецЦикла;
	Закрыть(МассСтрок);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВыбранным(Команда)
	Для Каждого СтрокаСписка Из Список Цикл
		Если СтрокаСписка.Выбран Тогда 
			Если ПропускатьЗаполненные = Ложь 
				ИЛИ КоэфУмолчание = СтрокаСписка.гкс_ПовКоэф Тогда 
				СтрокаСписка.гкс_ПовКоэф = ВыбранныйКоэф;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВыбраннымПослеВыбора(Результат, ДопПараметры)Экспорт
	// вариант 2
	ОписаниеОп = Новый ОписаниеОповещения("УстановитьВыбраннымПослеВыбора", ЭтотОбъект);
	ОткрытьФорму("Справочник.гкс_ПКоэффициентыРабот.ФормаВыбора",, ЭтотОбъект,,,, 
		ОписаниеОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Возврат;
			
	Если Не Результат = Неопределено Тогда 
		Для Каждого СтрокаСписка Из Список Цикл
			Если СтрокаСписка.Выбран Тогда 
				СтрокаСписка.гкс_ПовКоэф = Результат;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьВсе(Команда)
	Для Каждого СтрокаТаблицы Из Список Цикл
		СтрокаТаблицы.Выбран = Истина;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура СнятьВсе(Команда)
	Для Каждого СтрокаТаблицы Из Список Цикл
		СтрокаТаблицы.Выбран = Ложь;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти