
&НаСервереБезКонтекста
&ИзменениеИКонтроль("ПолучитьЗадачиПроцесса")
Функция гкс_ПолучитьЗадачиПроцесса(Прокси, Выполненные, БизнесПроцессТип, БизнесПроцессID)

	СписокУсловий = ИнтеграцияС1СДокументооборот.СоздатьОбъект(Прокси, "DMObjectListQuery");

	Условие = ИнтеграцияС1СДокументооборот.СоздатьОбъект(Прокси, "DMObjectListCondition");
	Условие.property = "byUser";
	Условие.value = Ложь;
	СписокУсловий.conditions.Добавить(Условие);
	#Вставка
	Условие = ИнтеграцияС1СДокументооборот.СоздатьОбъект(Прокси, "DMObjectListCondition");
	Условие.property = "byUserName";
	Условие.value = гкс_Интеграция1СДокументооборотПовтИсп.ПолучитьИмяПользователяИБ();
	СписокУсловий.conditions.Добавить(Условие);
	#КонецВставки

	Условие = ИнтеграцияС1СДокументооборот.СоздатьОбъект(Прокси, "DMObjectListCondition");
	Условие.property = "withExecuted";
	Условие.value = Истина;
	СписокУсловий.conditions.Добавить(Условие);

	Условие = ИнтеграцияС1СДокументооборот.СоздатьОбъект(Прокси, "DMObjectListCondition");
	Условие.property = "businessProcess";
	Условие.value = ИнтеграцияС1СДокументооборот.СоздатьObjectID(Прокси, БизнесПроцессID, БизнесПроцессТип);
	СписокУсловий.conditions.Добавить(Условие);

	Условие = ИнтеграцияС1СДокументооборот.СоздатьОбъект(Прокси, "DMObjectListCondition");
	Условие.property = "typed";
	Условие.value = Истина;
	СписокУсловий.conditions.Добавить(Условие);

	Запрос = ИнтеграцияС1СДокументооборот.СоздатьОбъект(Прокси, "DMGetObjectListRequest");
	Запрос.type = "DMBusinessProcessTask";
	Запрос.query = СписокУсловий;

	Результат = Прокси.execute(Запрос);
	ИнтеграцияС1СДокументооборот.ПроверитьВозвратВебСервиса(Прокси, Результат);

	Ответ = Прокси.execute(Запрос);
	ИнтеграцияС1СДокументооборот.ПроверитьВозвратВебСервиса(Прокси, Ответ);

	Возврат Ответ.items;

КонецФункции
