#Область ОбработчикиСобытий

&После("ПриЗаписи")
Процедура Расш_гкс_ПриЗаписи(Отказ, Замещение)
	Если ДополнительныеСвойства.Свойство("ТолькоОР") И ДополнительныеСвойства.ТолькоОР.Количество() Тогда 
		ТолькоОР = ДополнительныеСвойства.ТолькоОР;
	Иначе
		ТолькоОР = Новый Массив();
	КонецЕсли;
	
	Иерархия = Константы.торо_ИерархияДляВводаНовыхОР.Получить();
	//
	Если ЭтотОбъект.Количество() > 0 Тогда 
		Для Каждого СтрокаНабораЗаписей Из ЭтотОбъект Цикл
			Если СтрокаНабораЗаписей.СтруктураИерархии = Иерархия И ТолькоОР.Найти(СтрокаНабораЗаписей.ОбъектИерархии) = Неопределено Тогда 
				ТолькоОР.Добавить(СтрокаНабораЗаписей.ОбъектИерархии);
			КонецЕсли;
		КонецЦикла;
	Иначе
		
	КонецЕсли;
	//
	Для Каждого ОбъектРемонтаИзМассива Из ТолькоОР Цикл
		гкс_ПроверкаФункциональныхМест.ОбновитьТекущийОР(ОбъектРемонтаИзМассива);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти