
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПутьКЗагружаемомуФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.Фильтр = ФильтрЗагружаемыхФайлов();
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = НСтр("es='Escojan el proyecto cargado:';ru='Выберите загружаемый проект:';en='Select a downloadable project:'");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПутьКЗагружаемомуФайлуНачалоВыбораЗавершение", ЭтотОбъект);
	ДиалогОткрытияФайла.Показать(ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Загрузить(Команда)
	Если ПутьКЗагружаемомуФайлу <> "" Тогда
		ЭтотОбъект.Закрыть(ПутьКЗагружаемомуФайлу);
	Иначе
		ТекстСообщения = НСтр("es='El fichero no es escogido.';ru='Файл не выбран.';en='No file selected.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "ПутьКЗагружаемомуФайлу");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ФильтрЗагружаемыхФайлов()
	
	Возврат НСтр("es='Todos los ficheros (*.mpp; *.xml) | *.mpp; *.xml |';ru='Все файлы (*.mpp; *.xml)|*.mpp;*.xml|';en='All files (* .mpp; * .xml) | * .mpp; *. Xml |'")
	      + НСтр("ru='Файлы MS Project (*.mpp)|*.mpp|';en='MS Project files (*.mpp)|*.mpp|'")
	      + НСтр("es='Los ficheros del cambio XML (*.xml) | *.xml |';ru='Файлы обмена XML (*.xml)|*.xml|';en='XML Interchange Files (* .xml) | * .xml |'");
	
КонецФункции

&НаКлиенте
Процедура ПутьКЗагружаемомуФайлуНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранныеФайлы.Количество() > 0 Тогда
		ПутьКЗагружаемомуФайлу = ВыбранныеФайлы[0];
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

