#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&Вместо("ОбработкаПроведения")
Процедура гкс_ОбработкаПроведения(Отказ, РежимПроведения)
	
	ВыполнитьДвиженияРНТрудовыеРесурсы();
	КонтрольОстатков(Отказ);	
		
КонецПроцедуры

&Вместо("ОбработкаЗаполнения")
Процедура гкс_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ЗаполнитьСтандартныеРеквизитыШапкиПоУмолчанию();
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда		
		ЗаполнитьДокументНаОснованииСтруктуры(ДанныеЗаполнения);		
	КонецЕсли;
КонецПроцедуры

&Вместо("ПриКопировании")
Процедура гкс_ПриКопировании(ОбъектКопирования)
	ЗаполнитьСтандартныеРеквизитыШапкиПоУмолчанию();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВыполнитьДвиженияРНТрудовыеРесурсы()
	
	// ТрудовыеРесурсы
	Движения.гкс_ТрудовыеРесурсы.Записывать = Истина;
	Для Каждого ТекСтрокаТрудозатраты Из Трудозатраты Цикл

		Движение = Движения.гкс_ТрудовыеРесурсы.Добавить();
		Если ТекСтрокаТрудозатраты.ВидДвижения = ПредопределенноеЗначение("Перечисление.гкс_ВидДвижения.Расход") Тогда
			Движение.ВидДвижения 		= ВидДвиженияНакопления.Расход;   						
		Иначе
			Движение.ВидДвижения 		= ВидДвиженияНакопления.Приход;   					
		КонецЕсли; 
		Движение.Период         	= Дата;
		Движение.Организация	   	= Организация;
		Движение.Подразделение   	= ТекСтрокаТрудозатраты.Подразделение;
		Движение.Квалификация   	= ТекСтрокаТрудозатраты.Квалификация;
		Движение.Должность   		= ТекСтрокаТрудозатраты.Должность;
		Движение.Сотрудник   		= ТекСтрокаТрудозатраты.Сотрудник;
		Движение.ПериодПланирования = НачалоДня(ТекСтрокаТрудозатраты.ПериодПланирования);
		Движение.Доступно   		= ТекСтрокаТрудозатраты.Доступно;
		Движение.Запланировано   	= ТекСтрокаТрудозатраты.Запланировано;

	КонецЦикла;
	Движения.Записать();
	
КонецПроцедуры

Процедура КонтрольОстатков(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Трудозатраты.ВидДвижения КАК ВидДвижения,
	               |	&Организация КАК Организация,
	               |	Трудозатраты.Подразделение КАК Подразделение,
	               |	Трудозатраты.Квалификация КАК Квалификация,
	               |	Трудозатраты.Должность КАК Должность,
	               |	Трудозатраты.Сотрудник КАК Сотрудник,
	               |	Трудозатраты.ПериодПланирования КАК ПериодПланирования
	               |ПОМЕСТИТЬ ТабТрудозатраты
	               |ИЗ
	               |	&Трудозатраты КАК Трудозатраты";
	
	Запрос.УстановитьПараметр("Трудозатраты", Трудозатраты.Выгрузить());	
	Запрос.УстановитьПараметр("Организация", Организация);	
	Запрос.Выполнить();
	
    Запрос.Текст = ТекстЗапросаКонтрольОстатков_ТрудовыеЗатраты();
	 			
	Запрос.УстановитьПараметр("Дата", Новый Граница(Дата, ВидГраницы.Включая));
	
	Результат = Запрос.ВыполнитьПакет();
	
	Выборка = Результат[0].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ШаблонСообщения = НСтр("ru='Превышен лимит: Организация %1, Подразделение %2," 
								"Квалификация %3, Должность %4, Сотрудник %5, ПериодПланирования %6,'");
		
		ШаблонСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения,
		                                                        Выборка.Организация,
																Выборка.Подразделение,
																Выборка.Квалификация,
																Выборка.Должность,
																Выборка.Сотрудник,
																Формат(Выборка.ПериодПланирования,"ДФ=dd.MM.yyyy"));
		
	
		ОбщегоНазначения.СообщитьПользователю(ШаблонСообщения, ЭтотОбъект, , , );//Отказ);
		
	КонецЦикла;
	
КонецПроцедуры      

Процедура ЗаполнитьСтандартныеРеквизитыШапкиПоУмолчанию()
	Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР", "ОсновнойОтветственный");
		Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
			Ответственный = Пользователи.ТекущийПользователь();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ТекстЗапросаКонтрольОстатков_ТрудовыеЗатраты()
	
	Возврат "ВЫБРАТЬ
	        |	ТабТрудозатраты.Организация КАК Организация,
	        |	ТабТрудозатраты.Подразделение КАК Подразделение,
		    |	ТабТрудозатраты.Квалификация КАК Квалификация,
	        |	ТабТрудозатраты.Должность КАК Должность,
	        |	ТабТрудозатраты.Сотрудник КАК Сотрудник,
	        |	ТабТрудозатраты.ПериодПланирования КАК ПериодПланирования,
	        |	СУММА(ЕСТЬNULL(гкс_ТрудовыеРесурсыОстатки.ДоступноОстаток, 0)) КАК ДоступноОстаток
	        |ИЗ
	        |	ТабТрудозатраты КАК ТабТрудозатраты
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.гкс_ТрудовыеРесурсы.Остатки(
	        |				&Дата,
	        |				(Организация, Подразделение, Квалификация, Должность, Сотрудник, ПериодПланирования) В
	        |					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |						ТабТрудозатраты.Организация КАК Организация,
	        |						ТабТрудозатраты.Подразделение КАК Подразделение,
		    |						ТабТрудозатраты.Квалификация КАК Квалификация,
	        |						ТабТрудозатраты.Должность КАК Должность,
	        |						ТабТрудозатраты.Сотрудник КАК Сотрудник,
	        |						ТабТрудозатраты.ПериодПланирования КАК ПериодПланирования
	        |					ИЗ
	        |						ТабТрудозатраты КАК ТабТрудозатраты)) КАК гкс_ТрудовыеРесурсыОстатки
	        |		ПО ТабТрудозатраты.Организация = гкс_ТрудовыеРесурсыОстатки.Организация
	        |			И ТабТрудозатраты.Подразделение = гкс_ТрудовыеРесурсыОстатки.Подразделение
		    |			И ТабТрудозатраты.Квалификация = гкс_ТрудовыеРесурсыОстатки.Квалификация
	        |			И ТабТрудозатраты.Должность = гкс_ТрудовыеРесурсыОстатки.Должность
	        |			И ТабТрудозатраты.Сотрудник = гкс_ТрудовыеРесурсыОстатки.Сотрудник
	        |			И ТабТрудозатраты.ПериодПланирования = гкс_ТрудовыеРесурсыОстатки.ПериодПланирования
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ТабТрудозатраты.Организация,
	        |	ТабТрудозатраты.Подразделение,
		    |	ТабТрудозатраты.Квалификация,
	        |	ТабТрудозатраты.Должность,
	        |	ТабТрудозатраты.Сотрудник,
	        |	ТабТрудозатраты.ПериодПланирования
	        |
	        |ИМЕЮЩИЕ
	        |	СУММА(ЕСТЬNULL(гкс_ТрудовыеРесурсыОстатки.ДоступноОстаток, 0)) < 0";
		
КонецФункции

Процедура ЗаполнитьДокументНаОснованииСтруктуры(ДанныеЗаполнения) 	
	Дата = ДанныеЗаполнения.Дата;	
	Организация = ДанныеЗаполнения.Организация;	
	ВидОперации = ДанныеЗаполнения.ВидОперации;
	СтрокаТрудозатрат = Трудозатраты.Добавить();	
	ЗаполнитьЗначенияСвойств(СтрокаТрудозатрат, ДанныеЗаполнения);		
КонецПроцедуры   

#КонецОбласти

#КонецЕсли
