#Область ОбработчикиСобытийФормы

&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура гкс_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("Основание") И ТипЗнч(Параметры.Основание) <> Тип("Соответствие") Тогда
		торо_ЗаполнениеДокументов.ПроверитьВозможностьВводаНаОсновании(Параметры.Основание, Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли;

	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаГлобальные;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	

	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

	Если Параметры.Свойство("Основание") И Параметры.Свойство("ВыделенныеСтроки") Тогда
		ДокОснованиеППР = Параметры.Основание;
		МассивIDИзППР.ЗагрузитьЗначения(Параметры.ВыделенныеСтроки);
	КонецЕсли;

	Если ЭтаФорма.Параметры.Свойство("ДекомпиляцияЭлементов") Тогда
		ВнешниеОбработки.Создать(ЭтаФорма.Параметры.ДекомпиляцияЭлементов.ИмяПодключеннойОбработки,Ложь).ОпределитьВнутренниеСвойстваЭлементов(ЭтаФорма);
	КонецЕсли;

	Если Параметры.Свойство("ФильтрПоИсполнителю") Тогда
		Если ТипЗнч(Параметры.ФильтрПоИсполнителю) = Тип("СписокЗначений") Тогда
			МассивИсполнителейДляФильтра = Параметры.ФильтрПоИсполнителю;
		КонецЕсли;
	Иначе
		МассивИсполнителейДляФильтра = Неопределено;
	КонецЕсли; 

	Если Параметры.Свойство("АктивироватьСтроку") Тогда
		ТекСтрокаИзВнеID = Параметры.ТекСтрокаИзОбработкиID;		
	КонецЕсли;

	// Функциональные опции.
	ФОУчетЗапчастей                                      = ПолучитьФункциональнуюОпцию("торо_УчетЗапчастей");
	ФОИспользоватьГарантии                               = ПолучитьФункциональнуюОпцию("торо_ИспользоватьГарантии");
	ФОЗапретитьРемонтГарантийногоОборудованияХозспособом = ПолучитьФункциональнуюОпцию("торо_ЗапретитьРемонтГарантийногоОборудованияХозспособом");
	ФОИспользоватьАналоги                                = ПолучитьФункциональнуюОпцию("торо_ИспользоватьАналогиНоменклатурыДляРемонтов");
	ФОИспользоватьОстановочные                           = ПолучитьФункциональнуюОпцию("торо_ИспользоватьОстановочныеРемонты");
	ФОНазначениеНаРемонтСУчетомРисков                    = ПолучитьФункциональнуюОпцию("торо_НазначениеНаРемонтСУчетомРисков");
	ФОИспользоватьСкользящееПланирование                 = ПолучитьФункциональнуюОпцию("торо_ИспользоватьСкользящееПланирование");

	ПравоИнтерактивнаяПометкаУдаленияЗаказовНаВнутреннееПотребление = ПравоДоступа("ИнтерактивнаяПометкаУдаления", Метаданные.Документы.ЗаказНаВнутреннееПотребление);
	ПравоИнтерактивноеДобавлениеЗаказовНаВнутреннееПотребление = ПравоДоступа("ИнтерактивноеДобавление", Метаданные.Документы.ЗаказНаВнутреннееПотребление);
	ПравоРедактирование = ПравоДоступа("Редактирование", Метаданные.Документы.торо_ЗаявкаНаРемонт);

	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда

		ОбновитьДобавленныеКолонкиТаблиц();

	КонецЕсли;

	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	ЭтоПервыйДокументВЦепочке = ЭтоПервыйДокументВЦепочке();
	ЭтоПоследнийДокументВЦепочке = ЭтоПоследнийДокументВЦепочке(); 

	// Заголовок формы++
	торо_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(Объект, ЭтаФорма, "");
	// Заголовок формы--

	// Согласование++
	ВидДокумента = Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_ЗаявкаНаРемонт;
	торо_РаботаССогласованиями.ПриСозданииНаСервере(ЭтаФорма, ВидДокумента);
	УправлениеВидимостьюСогласование(ЭтотОбъект);
	// Согласование --

	// Ограничение ввода на основании
	торо_СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка, Новый Структура("ОграничитьВводНаОсновании, УстановитьСвойствоЭлементовФормыОтПрав",Истина, Истина));

	Элементы.ГруппаЗапчасти.Видимость = ФОУчетЗапчастей;  
	Элементы.АктульныеДатыРемонта.Видимость = ФОИспользоватьОстановочные;
	Элементы.РемонтыОборудованияВернутьРемонтВРаботу.Видимость = Ложь;

	УстановитьУсловноеОформление();
	ОбновитьДоступностьДляРедактирования();

	ОбновитьДокументыЗаказНаВнПотреблениеСервер();
	ОбновитьЗависимыеЛоты();

	#Вставка       	
		// гкс+ [Релиз16] Деснол
	торо_ЗаполнениеДокументов.гкс_ПроверитьВозможностьВводаОтСтатуса(Объект, Отказ);
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	// гкс- [Релиз16]	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		гкс_ПроверитьДубльРемонта(Отказ);
	КонецЕсли;
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;   
	
	гкс_ДобавитьИзменитьРеквизитыФормы();
	гкс_ДобавитьИзменитьКомандыФормы();
	гкс_ИнициализироватьРеквизитыФормы();
	гкс_ДобавитьИзменитьЭлементыФормы();
	гкс_ИнициализироватьЭлементыФормы();
	гкс_УстановитьВидимостьДоступностьЭлементовФормы();  	
	#КонецВставки
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПриОткрытии")
Процедура гкс_ПриОткрытии(Отказ)

	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И Объект.РемонтыОборудования.Количество() = 0 И Объект.ДокументыОснования.Количество() > 0 Тогда

		Если МассивIDИзППР.Количество() = 0 Тогда
			ПодключитьОбработчикОжидания("ПодборРемонтовОбработчикОжидания",0.5,Истина);
		Иначе
			ВыбранноеЗначение = ЗаполнитьДанныеНаОснованииППРВыделенныеСтроки();
			РемонтыОборудованияОбработкаВыбора(Элементы.РемонтыОборудования, ВыбранноеЗначение, Ложь);
		КонецЕсли;

	КонецЕсли; 	

	Если ТекСтрокаИзВнеID<>"" Тогда
		ВыделитьСтрокуРемонтовОборудования(ТекСтрокаИзВнеID);
	КонецЕсли;	

	// Имена элементов формы типа ТаблицаФормы, в которых необходимо обрабатывать события изменения строк.
	Массив = Новый Массив;
	Массив.Добавить("ДокументыОснования");
	Массив.Добавить("ДеревоРемонтныхРабот");
	торо_СобытияФормКлиент.ЗаполнитьСтруктуруДанныхДоРедактирования(СтруктураДанныхДоРедактирования,Массив);

	Если МассивИсполнителейДляФильтра.Количество() > 0 Тогда
		ВыборИсполнителейДляФильтраЗавершение(Неопределено, Неопределено);
		ФильтрПоИсполнителямАктивирован = Истина;
	Иначе
		ФильтрПоИсполнителямАктивирован = Ложь;
	КонецЕсли;
	#Вставка
	ПриОткрытииНаСервере(ТекущаяДата());
	Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда 
		гкс_ПодразделениеПриИзмененииПосле(Неопределено);
	КонецЕсли;
	// гкс+ [] Деснол 12.09.2022
	ЭтотОбъект["гкс_ВыборРемонтов"] = Истина;
	гкс_РежимПроецирования(Неопределено);
	// гкс- [] Деснол 12.09.2022
	#КонецВставки

КонецПроцедуры

&НаКлиенте
Процедура гкс_ПриОткрытииПосле(Отказ)

	гкс_ЗавершитьЗамерОткрытияФормы(ЭтотОбъект.гкс_ВремяНачалаЗамера);
	
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ОбработкаВыбора")
Процедура гкс_ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)

	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура")
		И ВыбранноеЗначение.Свойство("ВыполняемаяОперация")
		И ВыбранноеЗначение.ВыполняемаяОперация = "ВыборАналогаНоменклатурыДляРемонта" Тогда

		ЗаменитьМатериалыНаАналоги(ВыбранноеЗначение.АдресВХранилище);
		ТекДанныеРемРаб = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
		МассивID = Новый Массив;
		ЗаполнитьМассивID(МассивID,ТекДанныеРемРаб);
		ОтметитьНаличиеАналогов(МассивID);
		Модифицированность = Истина;

	ИначеЕсли ИсточникВыбора.Имяформы = "Обработка.торо_ПодборНоменклатуры.Форма.Форма" Тогда

		ТекДанныеРемРаб = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
		ТекДанныеРемонты = Элементы.РемонтыОборудования.ТекущиеДанные;

		Если ТекДанныеРемРаб = Неопределено ИЛИ ТекДанныеРемонты = Неопределено Тогда 
			Возврат;
		КонецЕсли;

		Если Элементы.ПанельЗатрат.ТекущаяСтраница = Элементы.ПанельЗатрат.ПодчиненныеЭлементы.ГруппаМатериальныеЗатраты Тогда
			ИмяТЧ = "МатериальныеЗатраты";
			ИмяРеквизита = "Номенклатура";
		ИначеЕсли Элементы.ПанельЗатрат.ТекущаяСтраница = Элементы.ПанельЗатрат.ПодчиненныеЭлементы.ГруппаИнструменты Тогда
			ИмяТЧ = "Инструменты";
			ИмяРеквизита = "Инструмент";
		Иначе
			ИмяТЧ = "ЗапчастиРемонта";
			ИмяРеквизита = "Номенклатура";
		КонецЕсли;

		СтруктураСтрокиОпераций = Новый Структура("РемонтыОборудования_ID, ID, Количество", ТекДанныеРемонты.ID, ТекДанныеРемРаб.ID, ТекДанныеРемРаб.Количество);
		ДобавитьНоменклатуруИзПодбора(ВыбранноеЗначение, СтруктураСтрокиОпераций, ИмяТЧ, ИмяРеквизита);
		ОтметитьНаличиеАналогов(ТекДанныеРемРаб.ID);
		Модифицированность = Истина;
		#Вставка
		ОбновитьЦеныНоменклатуры();
		#КонецВставки

	КонецЕсли;

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПриЧтенииНаСервере")
Процедура гкс_ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	ФОИспользоватьГарантии                               = ПолучитьФункциональнуюОпцию("торо_ИспользоватьГарантии");
	ФОИспользоватьАналоги                                = ПолучитьФункциональнуюОпцию("торо_ИспользоватьАналогиНоменклатурыДляРемонтов");
	ФОИспользоватьОстановочные                           = ПолучитьФункциональнуюОпцию("торо_ИспользоватьОстановочныеРемонты");
	ФОИспользоватьСкользящееПланирование                 = ПолучитьФункциональнуюОпцию("торо_ИспользоватьСкользящееПланирование");

	ОбновитьДобавленныеКолонкиТаблиц();
	#Вставка
	СтруктураПроверки = Новый Структура("гкс_СдвигЧП", Неопределено);
	ЗаполнитьЗначенияСвойств(СтруктураПроверки, ЭтотОбъект);
	Если Не СтруктураПроверки.гкс_СдвигЧП = Неопределено Тогда 
		гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПКлиента(ЭтотОбъект,
		"Дата,РемонтыОборудования.ДатаНачала,РемонтыОборудования.ДатаОкончания," +
		"РемонтыОборудования.КрайняяДопустимаяДатаЗавершенияРемонта", Объект);
		ОбновитьСимптомДефекта();
		ОбновитьЦеныНоменклатуры();
	КонецЕсли;
	гкс_ОбщегоНазначенияСервер.ДобавитьУОКатегорииРиска(ЭтотОбъект);
	Если РольДоступна("гкс_ИзменениеПроведеннойЗаявки") Тогда 
		ОткрытьДоступностьПолейДляРоли();
	КонецЕсли;
	#КонецВставки

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПередЗаписьюНаСервере")
Процедура гкс_ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

	// Согласование++
	торо_РаботаССогласованиями.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	// Согласование--

	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение
		И ФОИспользоватьГарантии Тогда
		торо_ГарантийноеОбслуживание.СформироватьПредупрежденияОРекламационныхАктах(Объект, "РемонтыОборудования");
	КонецЕсли; 
	#Вставка
	Для Каждого СтрокаТаблицы ИЗ ТекущийОбъект.РемонтныеРаботы Цикл
		Если ТипЗнч(СтрокаТаблицы.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда 
			СтрокаТаблицы.гкс_ПовКоэф = Неопределено;
		ИначеЕсли ЗначениеЗаполнено(СтрокаТаблицы.гкс_ПовКоэф) = Ложь Тогда 
			СтрокаТаблицы.гкс_ПовКоэф = Справочники.гкс_ПКоэффициентыРабот.ПоУмолчанию;
		КонецЕсли;
	КонецЦикла;
	гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПСервера(ЭтотОбъект,, ТекущийОбъект);
	#КонецВставки

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПриЗаписиНаСервере")
Процедура гкс_ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	// Согласование++
	торо_РаботаССогласованиями.ПриЗаписиНаСервере(ЭтаФорма, ТекущийОбъект);
	// Согласование--
	#Вставка
	гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПКлиента(ЭтотОбъект,
		"Дата,РемонтыОборудования.ДатаНачала,РемонтыОборудования.ДатаОкончания," +
		"РемонтыОборудования.КрайняяДопустимаяДатаЗавершенияРемонта", ТекущийОбъект);
	#КонецВставки

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПослеЗаписиНаСервере")
Процедура гкс_ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// Заголовок формы++
	торо_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(Объект, ЭтаФорма, "");
	// Заголовок формы--

	ОбновитьДобавленныеКолонкиТаблиц();
	ОбновитьЗависимыеЛоты();
	#Вставка
	Если Объект.РемонтыОборудования.Количество() > 0 Тогда 
		СтруктураПроверки = Новый Структура("гкс_СимптомДефекта",Неопределено);
		ЗаполнитьЗначенияСвойств(СтруктураПроверки,Объект.РемонтыОборудования[0]);
		Если Не СтруктураПроверки["гкс_СимптомДефекта"] = Неопределено Тогда 
			ОбновитьСимптомДефекта();
			ОбновитьЦеныНоменклатуры();
		КонецЕсли;
	КонецЕсли;
	гкс_ОбщегоНазначенияСервер.ДобавитьУОКатегорииРиска(ЭтотОбъект);
	Если РольДоступна("гкс_ИзменениеПроведеннойЗаявки") Тогда 
		ОткрытьДоступностьПолейДляРоли();
	КонецЕсли;
	// Гкс+[TOIR20-532] Вялых Д.А. от 10.02.2025. Добавлено:{
	УстановитьИспользованиеУОДляДанныхЕРП(Ложь); 
	// } Гкс-[TOIR20-532] Вялых Д.А. от 10.02.2025.
	#КонецВставки

КонецПроцедуры   

&НаКлиенте
&ИзменениеИКонтроль("ПередЗаписью")
Процедура гкс_ПередЗаписью(Отказ, ПараметрыЗаписи)
	#Вставка
	МассивСтруктур = Новый Массив();
	
	РеквизитыДляПроверки(МассивСтруктур);
	ПроверитьЗаполнениеРеквизитовШапки(МассивСтруктур, Отказ);
	ПроверитьЗаполнениеРемонтовОборудования(МассивСтруктур, Отказ);
	ПроверитьЗаполнениеМатериальныхЗатрат(МассивСтруктур, Отказ);
	ПроверитьЗаполнениеТрудовыхЗатрат(МассивСтруктур, Отказ);
	ПроверитьЗаполнениеРемонтныхРабот(МассивСтруктур, Отказ);
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	#КонецВставки

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПослеЗаписи")
Процедура гкс_ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("СозданДокументЧерезРМТехСпец", Объект.Ссылка);
	#Вставка
	гкс_ИзменитьВидимостьКнопкиОтправкиНаСогласование();
	ОбновитьЗаливкуЗаголовка();
	#КонецВставки
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ОбработкаПроверкиЗаполненияНаСервере")
Процедура гкс_ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)

	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства

	#Вставка
	// Гкс+[TOIR20-158] Селимов
	ВнешнееОснованиеДляРабот = СозданНаОснованииВнешнегоОснованияДляРабот(); // } Гкс-[TOIR20-158] 
	#КонецВставки
	Для Каждого Строка Из Объект.РемонтыОборудования Цикл
		Если Строка.ДатаНачала > Строка.ДатаОкончания Тогда
			ШаблонСообщения = НСтр("es='En la línea el número %1 listas de las reparaciones de la maquinaria la fecha del comienzo del período de los trabajos de reparación es más grande que la fecha de la terminación (%2 - %3).';ru='В строке номер %1 списка ремонтов оборудования дата начала периода ремонтных работ больше даты окончания (%2 - %3).';en='In line number%1 of the equipment repair list, the start date of the repair period is greater than the end date (%2 -%3).'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения,	Строка.НомерСтроки,Строка.ДатаНачала,Строка.ДатаОкончания);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЕсли;

		Если ФОНазначениеНаРемонтСУчетомРисков
			И ЗначениеЗаполнено(Строка.КрайняяДопустимаяДатаЗавершенияРемонта)
			И Строка.ДатаОкончания > Строка.КрайняяДопустимаяДатаЗавершенияРемонта Тогда
			ШаблонСообщения = НСтр("es='En la línea el número %1 listas de las reparaciones de la maquinaria la fecha de la terminación del período de los trabajos de reparación más de fecha extrema admisible заверешния de la reparación (%2 - %3).';ru='В строке номер %1 списка ремонтов оборудования дата окончания периода ремонтных работ больше крайней допустимой даты заверешния ремонта (%2 - %3).';en='In line number%1 of the list of equipment repairs, the end date of the repair period is greater than the extreme permissible date of completion of repairs (%2 -%3).'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения,	Строка.НомерСтроки,Строка.ДатаОкончания,Строка.КрайняяДопустимаяДатаЗавершенияРемонта);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЕсли; 
		#Вставка
		// гкс+ [02.23] Деснол 06.02.2023
		//// Гкс+[TOIR20-158] Селимов
		//Если ВнешнееОснованиеДляРабот И Не ЗначениеЗаполнено(Строка.КритичностьДефекта) Тогда
		//	ШаблонСообщения = НСтр("es='%1';ru='Не указана критичность дефекта в строке %1';en='Defect criticality not filled in line%1'");
		//	ТекстСообщения = СтрШаблон(ШаблонСообщения,	Строка.НомерСтроки);
		//	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Объект.РемонтыОборудования["+ Строка(Строка.НомерСтроки - 1) +"].КритичностьДефекта",,Отказ);			
		//КонецЕсли; // } Гкс-[TOIR20-158] 
		// гкс- [02.23] Деснол 06.02.2023
		#КонецВставки
	КонецЦикла;

	Если ФОИспользоватьГарантии И ФОЗапретитьРемонтГарантийногоОборудованияХозспособом Тогда
		торо_ГарантийноеОбслуживание.ПроверитьНаличиеКонтрагентов(Объект, "ИсполнителиПоРемонтам","Исполнитель", Отказ);
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура гкс_ОрганизацияПриИзмененииПосле(Элемент)
	гкс_ПодразделениеПриИзмененииПосле(Неопределено);
	Объект.гкс_Валюта = гкс_ВалютаОрганизации(Объект.Организация);
КонецПроцедуры

&НаКлиенте
Процедура гкс_ПодразделениеПриИзмененииПосле(Элемент)
	Если ЗначениеЗаполнено(Объект.СпособСогласования) Тогда 
		Возврат;
	КонецЕсли;
	Если ЭтотОбъект["мИспользоватьСогласованиеДокументов"] И Элементы["СпособСогласования"].ТолькоПросмотр
		И Не СтатусДокументаРегистр = ЭтотОбъект["гкс_СтатусЧерновик"] Тогда 
		Возврат;
	КонецЕсли;
	Если Объект.РемонтыОборудования.Количество() > 0 Тогда 
		Способ = гкс_ПолучитьСпособСогласования(Объект.Организация, Объект.РемонтыОборудования[0].ОбъектРемонта);
		Если Не Объект.СпособСогласования = Способ И Не Способ = Неопределено Тогда 
			Объект.СпособСогласования = Способ;
			СпособСогласованияПриИзменении(Неопределено);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте 
&ИзменениеИКонтроль("СпособСогласованияПриИзменении")
Процедура гкс_СпособСогласованияПриИзменении(Элемент)

	Если фПослеОчистки = Ложь Тогда
		ОбновитьДеревоСогласующих(Истина);
		#Удаление
		торо_РаботаССогласованиямиКлиентСервер.ДобавитьСтрокуВИсториюСтатусов(ЭтаФорма, СтатусДокументаРегистр,, Истина);
		#КонецУдаления
		#Вставка
		торо_РаботаССогласованиямиКлиентСервер.ДобавитьСтрокуВИсториюСтатусов(ЭтотОбъект, СтатусДокументаРегистр,,);
		#КонецВставки
	Иначе
		фПослеОчистки = Ложь;
	КонецЕсли;

	УправлениеВидимостьюСогласование(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("СпособСогласованияНачалоВыбора")
Процедура гкс_СпособСогласованияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	Если СогласующиеРегистр.Количество() > 0 Тогда

		СтандартнаяОбработка = Ложь;

		ПоказатьВопрос(Новый ОписаниеОповещения("СпособСогласованияНачалоВыбораЗавершение", ЭтаФорма, Новый Структура("Элемент",Элемент)),
		НСтр("es='¡Los datos de los estatus establecidos del documento serán limpiados! ¿Continuar?';ru='Данные по установленным статусам документа будут очищены! Продолжить?';en='Data on the established statuses of the document will be cleared! Continue?'"),
		РежимДиалогаВопрос.ДаНет, 60);		

		Возврат;

	КонецЕсли;
	#Вставка
	СтандартнаяОбработка = Ложь;
	ДопПараметры = Новый Структура("Отбор", Новый Структура("ПометкаУдаления", Ложь));
	ОткрытьФорму("Справочник.торо_СпособыСогласованияДокументов.ФормаВыбора",ДопПараметры,
	Элемент, , , , , РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	#КонецВставки

КонецПроцедуры

&НаКлиенте
Процедура гкс_СпособВыполненияДеревоПриИзменении(Элемент)
	ТекСтрока = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	
	ID = ТекСтрока.ID;
	МассивСтрТЧ = Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("ID", ID));
	
	Если МассивСтрТЧ.Количество() Тогда
		СтрТЧ = МассивСтрТЧ[0];
		СтрТЧ.гкс_СпособВыполнения = ТекСтрока.гкс_СпособВыполнения;
	Иначе
		ТекСтрока.гкс_СпособВыполнения = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("СпособСогласованияНачалоВыбораЗавершение")
Процедура гкс_СпособСогласованияНачалоВыбораЗавершение(РезультатВопроса, ДополнительныеПараметры)

	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		СогласующиеРегистр.Очистить();
		Если мХранитьИсториюСогласованияВДокументах Тогда
			Объект.Согласующие.Очистить();
		КонецЕсли;
		#Вставка
		// гкс+ [Релиз 1] Куст 22.03.2021
		ДопПараметры = Новый Структура("Отбор", Новый Структура("ПометкаУдаления", Ложь));
		ОткрытьФорму("Справочник.торо_СпособыСогласованияДокументов.ФормаВыбора",ДопПараметры,
		ДополнительныеПараметры.Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		// гкс- [Релиз 1] Куст 22.03.2021
		#КонецВставки
		#Удаление
		ОткрытьФорму("Справочник.торо_СпособыСогласованияДокументов.ФормаВыбора",,ДополнительныеПараметры.Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		#КонецУдаления
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ДеревоРемонтныхРаботПриАктивизацииСтроки")
Процедура гкс_ДеревоРемонтныхРаботПриАктивизацииСтроки(Элемент)

	ТекДанные = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;

	Если НЕ ТекДанные = Неопределено Тогда

		УстановитьОтборСтрокПоЗатратам();

		#Удаление
		Если ТекДанные.РемонтнаяРабота = "Ремонтные работы" Тогда
		#КонецУдаления
		#Вставка
		Если ТекДанные.РемонтнаяРабота = дс_ПолучитьПредставлениеКорневойРемонтнойРаботы() Тогда
		#КонецВставки
			Элементы.ДеревоРемонтныхРаботКоличество.ТолькоПросмотр = Истина;			
		Иначе
			Элементы.ДеревоРемонтныхРаботКоличество.ТолькоПросмотр = Ложь;
		КонецЕсли; 

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ДеревоРемонтныхРаботПередУдалением")
Процедура гкс_ДеревоРемонтныхРаботПередУдалением(Элемент, Отказ)

	ТекСтрокаДРР = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные; 

	СтруктураСвязанныхТЧ = Новый Структура();
	СтруктураСвязанныхТЧ.Вставить("МатериальныеЗатраты");
	СтруктураСвязанныхТЧ.Вставить("Инструменты");
	СтруктураСвязанныхТЧ.Вставить("ТрудовыеЗатраты");
	СтруктураСвязанныхТЧ.Вставить("РемонтныеРаботы");
	СтруктураСвязанныхТЧ.Вставить("МерыБезопасности");
	#Удаление
	Если НЕ ЗначениеЗаполнено(ТекСтрокаДРР.Родитель_ID) И ТекСтрокаДРР.РемонтнаяРабота = "Ремонтные работы" Тогда
	#КонецУдаления
	#Вставка
	Если НЕ ЗначениеЗаполнено(ТекСтрокаДРР.Родитель_ID) И ТекСтрокаДРР.РемонтнаяРабота = дс_ПолучитьПредставлениеКорневойРемонтнойРаботы() Тогда
	#КонецВставки

		ТекСтрокаДРР.ПолучитьЭлементы().Очистить();

		Для Каждого КлючИЗначение Из СтруктураСвязанныхТЧ Цикл

			ТабличнаяЧасть = Объект[КлючИЗначение.Ключ];

			ПараметрыПоиска = Новый Структура;
			ПараметрыПоиска.Вставить("РемонтыОборудования_ID", Элементы.РемонтыОборудования.ТекущиеДанные.ID);

			СтрокиКУдалению = ТабличнаяЧасть.НайтиСтроки(ПараметрыПоиска);

			Для Каждого Строка Из СтрокиКУдалению Цикл

				ТабличнаяЧасть.Удалить(Строка);

			КонецЦикла;		    

		КонецЦикла;

		Модифицированность = Истина;

		Отказ = Истина;

	Иначе

		ВыделенныеСтроки = Элементы.ДеревоРемонтныхРабот.ВыделенныеСтроки;
		МассивСтрокДляУдаления = Новый Массив;

		Для каждого Стр Из ВыделенныеСтроки Цикл 
			Строка = ДеревоРемонтныхРабот.НайтиПоИдентификатору(Стр);
			#Удаление
			Если Строка <> Неопределено И Строка.РемонтнаяРабота <> "Ремонтные работы" Тогда 
			#КонецУдаления
			#Вставка
			Если Строка <> Неопределено И Строка.РемонтнаяРабота <> дс_ПолучитьПредставлениеКорневойРемонтнойРаботы() Тогда
			#КонецВставки
				МассивСтрокДляУдаления.Добавить(Строка);
			КонецЕсли;
		КонецЦикла;		

		Для каждого Элемент Из МассивСтрокДляУдаления Цикл
			СтруктурыДляПередачи = Новый Структура("ID, РемонтыОборудования_ID, Родитель_ID, РемонтнаяРабота",
			Элемент.ID, Элемент.РемонтыОборудования_ID, Элемент.Родитель_ID, Элемент.РемонтнаяРабота);
			УдалитьДанныеТЧПоIDСтрокиДереваНаСервере(СтруктурыДляПередачи, СтруктураСвязанныхТЧ);

			СтрокаРодителя = Элемент.ПолучитьРодителя();
			Если СтрокаРодителя <> Неопределено Тогда 
				СтрокаРодителя.ПолучитьЭлементы().Удалить(Элемент); 
			КонецЕсли; 
		КонецЦикла;


		Модифицированность = Истина;
		Отказ = Истина;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ДеревоРемонтныхРабот

&НаКлиенте
&ИзменениеИКонтроль("ДеревоРемонтныхРаботОбработкаВыбора")
Процедура гкс_ДеревоРемонтныхРаботОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	ТекСтрокаДерева = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;

	Если ТекСтрокаДерева = Неопределено Тогда
		СтрокаРодитель = Новый Структура("ID, РемонтыОборудования_ID, Родитель_ID", "", "", "");
		ИДВыбраннойСтроки = "";
	Иначе
		СтрокаРодитель = ТекСтрокаДерева;
		ИДВыбраннойСтроки = ТекСтрокаДерева.ID;
	КонецЕсли;

	ТекРемонт = Элементы.РемонтыОборудования.ТекущиеДанные;

	Если ТекРемонт <> Неопределено Тогда
		РемонтыОборудования_ID = ТекРемонт.ID;
		ДатаНачалаРемонта      = ТекРемонт.ДатаНачала;
	Иначе
		РемонтыОборудования_ID = "";
		ДатаНачалаРемонта      = Неопределено;       
	КонецЕсли;

	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") И ВыбранноеЗначение.Количество()>0 И ТипЗнч(ВыбранноеЗначение[0]) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда
		#Вставка
		Массивпроверки = Новый Массив();
		Массивпроверки.Добавить(ВыбранноеЗначение[0]);
		Если ПроверитьТКНаСервере(Массивпроверки).Количество() Тогда 
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru='Запрещено выбирать шаблоны техкарт';
			|en='It is forbidden to choose patterns standard maintenance plans'");
			Сообщение.Сообщить();
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
		#КонецВставки
		ТекущийРемонт = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
		Пока ТекущийРемонт <> Неопределено И ТипЗнч(ТекущийРемонт.РемонтнаяРабота) <> Тип("Строка") Цикл
			Если ТекущийРемонт.РемонтнаяРабота = ВыбранноеЗначение[0] Тогда
				ШаблонСообщения = НСтр("es='El significado escogido ""%1"" no puede ser incluido en la composición.';ru='Выбранное значение ""%1"" не может быть включено в состав самого себя.';en='The selected value ""%1"" cannot be included in itself.'");
				ТекстСообщения = СтрШаблон(ШаблонСообщения, ВыбранноеЗначение[0]);
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
				Возврат;
			КонецЕсли; 
			ТекущийРемонт = ТекущийРемонт.ПолучитьРодителя();	
		КонецЦикла;
	КонецЕсли;

	ТекущиеДанные = Новый Структура("ТекущийРемонт_ID, СтрокаРодитель_ID, СтрокаРодительРемонтыОборудования_ID, СтрокаРодительРодитель_ID, ДатаНачалаРемонта"
	, РемонтыОборудования_ID
	, СтрокаРодитель.ID
	, СтрокаРодитель.РемонтыОборудования_ID
	, СтрокаРодитель.Родитель_ID
	, ДатаНачалаРемонта);

	ДеревоРемонтныхРаботОбработкаВыбораСервер(ВыбранноеЗначение, ТекущиеДанные);

	РемонтыОборудованияПриАктивизацииСтроки(Элементы.РемонтыОборудования);
	ВыделитьСтрокуДереваРемонтныхРабот(ИДВыбраннойСтроки);

	Модифицированность = Истина;

КонецПроцедуры

// гкс+ [Релиз16] Деснол
&НаКлиенте
&ИзменениеИКонтроль("ДеревоРемонтныхРаботИсполнительПриИзменении")
Процедура гкс_ДеревоРемонтныхРаботИсполнительПриИзменении(Элемент)

	ТекущиеДанные = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.ДоговорБригада = Неопределено;
		УстановитьПараметрыВыбораДоговораБригады_ДляРемонтныхРабот(ТекущиеДанные.Исполнитель, ТекущиеДанные.РемонтыОборудования_ID);
		#Вставка
		Если ЗначениеЗаполнено(ТекущиеДанные.Исполнитель) Тогда 
			Ветвь = ТекущиеДанные.ПолучитьЭлементы();
			Для Каждого СтрокаДерева Из Ветвь Цикл
				СтрокаДерева.Исполнитель = ТекущиеДанные.Исполнитель;
				Ветвь2 = СтрокаДерева.ПолучитьЭлементы();
				Для Каждого СтрокаДерева2 Из Ветвь2 Цикл
					СтрокаДерева2.Исполнитель = ТекущиеДанные.Исполнитель;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		#КонецВставки
	КонецЕсли;

	Если ФильтрПоИсполнителямАктивирован Тогда
		ДеревоРРЗаполнитьПолеДляФильтраПриИзмененииИсполнителяНаКлиенте();
	КонецЕсли;

КонецПроцедуры // гкс- [Релиз16]

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_МатериальныеЗатраты

&НаКлиенте
&ИзменениеИКонтроль("МатериальныеЗатратыПередОкончаниемРедактирования")
Процедура гкс_МатериальныеЗатратыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)

	Если НоваяСтрока И Не ОтменаРедактирования Тогда 
		ТекСтрокаДереваРемонтныхРабот = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
		Элемент.ТекущиеДанные.ID = ТекСтрокаДереваРемонтныхРабот.ID;
		Элемент.ТекущиеДанные.РемонтыОборудования_ID = ТекСтрокаДереваРемонтныхРабот.РемонтыОборудования_ID;
		Элемент.ТекущиеДанные.Качество = ПредопределенноеЗначение("Перечисление.ГрадацииКачества.Новый");
	КонецЕсли;

	Если НЕ ОтменаРедактирования Тогда
		#Вставка
		Если Объект.МатериальныеЗатраты.НайтиСтроки(Новый Структура("ID,РемонтыОборудования_ID,Номенклатура,ХарактеристикаНоменклатуры,гкс_Давальческие",Элемент.ТекущиеДанные.ID,Элемент.ТекущиеДанные.РемонтыОборудования_ID,Элемент.ТекущиеДанные.Номенклатура,Элемент.ТекущиеДанные.ХарактеристикаНоменклатуры,Элемент.ТекущиеДанные.гкс_Давальческие)).Количество() > 1 Тогда
		#КонецВставки
		ТекстСообщения = НСтр("es='La nomenclatura dada es añadida ya.';ru='Данная номенклатура уже добавлена.';en='This item has already been added.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		#Вставка
		КонецЕсли;
		#КонецВставки
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("МатериальныеЗатратыНоменклатураПриИзменении")
Процедура гкс_МатериальныеЗатратыНоменклатураПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.МатериальныеЗатраты.ТекущиеДанные;

	ТекущаяСтрока.ХарактеристикиИспользуются = торо_НоменклатураСервер.ПолучитьХарактеристикиИспользуются(ТекущаяСтрока.Номенклатура);

	Если Не ТекущаяСтрока.ХарактеристикиИспользуются Тогда
		ТекущаяСтрока.ХарактеристикаНоменклатуры = Неопределено;
	КонецЕсли;
	#Вставка
	ТекущаяСтрока = Элементы.МатериальныеЗатраты.ТекущиеДанные;
	ОбновитьЦеныНоменклатуры(ТекущаяСтрока.Номенклатура);
	#КонецВставки

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ТрудовыеЗатраты

&НаКлиенте
&ИзменениеИКонтроль("ТрудовыеЗатратыПередОкончаниемРедактирования")
Процедура гкс_ТрудовыеЗатратыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)

	Если НоваяСтрока И Не ОтменаРедактирования Тогда 

		ТекТрудовыеЗатраты = Элементы.ТрудовыеЗатраты.ТекущиеДанные;
		ТекСтрокаДереваРемонтныхРабот = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
		ТекТрудовыеЗатраты.ID = ТекСтрокаДереваРемонтныхРабот.ID;
		ТекТрудовыеЗатраты.РемонтыОборудования_ID = ТекСтрокаДереваРемонтныхРабот.РемонтыОборудования_ID;

	КонецЕсли;

	Если НЕ ОтменаРедактирования Тогда
	#Вставка
	Если СредиИсполнителейЕстьКонтрагент() = Ложь Тогда 
	#КонецВставки
		Если Объект.ТрудовыеЗатраты.НайтиСтроки(Новый Структура("Квалификация,ID,РемонтыОборудования_ID",Элемент.ТекущиеДанные.Квалификация,Элемент.ТекущиеДанные.ID,Элемент.ТекущиеДанные.РемонтыОборудования_ID)).Количество() > 1 Тогда
			ТекстСообщения = НСтр("es='La calificación dada es añadida ya.';ru='Данная квалификация уже добавлена.';en='This qualification has already been added.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЕсли;
	#Вставка
	КонецЕсли;
	#КонецВставки
	КонецЕсли;

	ТекДанные = Элементы.ТрудовыеЗатраты.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда
		ТекДанные.ВремяРаботыТекст = торо_ОбщегоНазначенияКлиентСервер.СформироватьЗаголовокПоПродолжительности(ТекДанные.ВремяРаботы);
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИсполнителиПоРемонтам

&НаКлиенте
&ИзменениеИКонтроль("ИсполнителиПоРемонтамИсполнительПриИзменении")
Процедура гкс_ИсполнителиПоРемонтамИсполнительПриИзменении(Элемент)

	ТекущиеДанные = Элементы.ИсполнителиПоРемонтам.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.УточнениеИсполнителя = Неопределено;
		УстановитьПараметрыВыбораДоговораБригады(ТекущиеДанные.Исполнитель, Элементы.ИсполнителиПоРемонтамУточнениеИсполнителя);

		СтрокаРемонта = Элементы.РемонтыОборудования.ТекущиеДанные;
		РемонтыОборудованияПроверитьФильтрПоИсполнителюДляРемонта(ЭтаФорма, СтрокаРемонта);
	КонецЕсли;
	#Вставка
	гкс_ПодразделениеПриИзмененииПосле(Неопределено);
	#КонецВставки

КонецПроцедуры

&НаКлиенте
Процедура гкс_ИсполнителиПоРемонтамПриИзмененииПосле(Элемент)
	гкс_ПодразделениеПриИзмененииПосле(Неопределено);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_РемонтыОборудования

&НаКлиенте
&ИзменениеИКонтроль("РемонтыОборудованияПриАктивизацииСтроки")
Процедура гкс_РемонтыОборудованияПриАктивизацииСтроки(Элемент)

	ТекущиеДанные = Элементы.РемонтыОборудования.ТекущиеДанные;

	Если Не ТекущиеДанные = Неопределено Тогда
		Структура = Новый Структура();
		Структура.Вставить(	"ИмяТЧ"                    , "РемонтныеРаботы");
		Структура.Вставить(	"Текущий_ID"               , ТекущиеДанные.ID);
		Структура.Вставить(	"Наименование_Ремонты"     , "РемонтыОборудования_ID");
		Структура.Вставить(	"Наименование_ПолеРодитель", "Родитель_ID");
		Структура.Вставить(	"Наименование_ПолеЭлемент" , "ID");

		торо_ЗаполнениеДокументовКлиент.ЗаполнитьДеревоРемонтов(Структура, ДеревоРемонтныхРабот, Объект);

		ЗаполнитьЕдиницыИзмерения(ДеревоРемонтныхРабот); 

		УстановитьОтборыСвязанныхТаблицРемонты(Элементы.РемонтыОборудования.ТекущиеДанные.ID);
		ВыделитьСтрокуДереваРемонтныхРабот(Неопределено);
		Элементы.ДеревоРемонтныхРабот.Развернуть(ДеревоРемонтныхРабот.ПолучитьЭлементы()[0].ПолучитьИдентификатор(),Истина);

		УстановитьВидимостьКнопокДляТекРемонта(ТекущиеДанные);
		УстановитьДоступностьДляРедактированияПоТекРемонту(ТекущиеДанные.БлокироватьДляИзменения, ТекущиеДанные.ОбъектРемонта);

		Найденный = МассивIDЛотов.НайтиПоЗначению(ТекущиеДанные.ID);
		Если Найденный <> Неопределено Тогда
			Элементы.ИсполнителиПоРемонтамЗаполнитьИзЛотов.Доступность = Истина;
		Иначе
			Элементы.ИсполнителиПоРемонтамЗаполнитьИзЛотов.Доступность = Ложь;
		КонецЕсли;

		Если ФильтрПоИсполнителямАктивирован Тогда
			ДеревоРРЗаполнитьПолеДляФильтраНаКлиенте(ДеревоРемонтныхРабот, Истина);
		КонецЕсли; 
	КонецЕсли;

	УстановитьПараметрыВыбораНоменклатуры();
	#Вставка
	ОбновитьЗаливкуЗаголовка();
	#КонецВставки

КонецПроцедуры

&НаКлиенте
Процедура гкс_РемонтыОборудованияПриОкончанииРедактированияПосле(Элемент, НоваяСтрока, ОтменаРедактирования)
	гкс_ПодразделениеПриИзмененииПосле(Неопределено);
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("РемонтыОборудованияОбработкаВыбора")
Процедура гкс_РемонтыОборудованияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Если ТипЗнч (ВыбранноеЗначение) = Тип ("Число") Тогда 

		НормаВремени = ВыбранноеЗначение;

		МассивРемонтов = Новый Массив;		
		Для каждого ТекСтрока Из Элементы.РемонтыОборудования.ВыделенныеСтроки Цикл 
			МассивРемонтов.Добавить(Объект.РемонтыОборудования.НайтиПоИдентификатору(ТекСтрока));
		КонецЦикла; 

		Для каждого ТекРемонт Из МассивРемонтов Цикл 
			ТекРемонт.ДатаОкончания = ТекРемонт.ДатаНачала + НормаВремени;
		КонецЦикла;

		Модифицированность = Истина;

	Иначе

		РемонтУжеДобавлен = Ложь;
		ЭтоРемонтнаяРабота = Ложь;
		МассивИДДобавленныхРемонтов = Новый Массив;
		Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") И ВыбранноеЗначение.Количество() > 0 Тогда 
			Для каждого ЭлементМассива Из ВыбранноеЗначение Цикл
				Если ТипЗнч(ЭлементМассива) = Тип("Структура") И ЭлементМассива.Свойство("СтрокаРемонтовОборудования") Тогда 
					НайденныеРемонты = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", ЭлементМассива.СтрокаРемонтовОборудования.ID));
					Если НайденныеРемонты.Количество() > 0 Тогда
						РемонтУжеДобавлен = Истина;
						МассивИДДобавленныхРемонтов.Добавить(ЭлементМассива.СтрокаРемонтовОборудования.ID);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;

			Если РемонтУжеДобавлен Тогда 
				Вопрос = НСтр("es='Algunos de las reparaciones escogidas son añadidos ya. Los trabajos de reparación vinculados serán limpiados y añadidos de nuevo. ¿Continuar?';ru='Некоторые из выбранных ремонтов уже добавлены. Связанные ремонтные работы будут очищены и добавлены заново. Продолжить?';en='Some of the selected repairs have already been added. Associated repairs will be cleaned and re-added. Continue?'");
			КонецЕсли;
		КонецЕсли;

		Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") И ВыбранноеЗначение.Свойство("СтрокаРемонтовОборудования") 
			И ВыбранноеЗначение.Количество() > 0 Тогда
			ЭтоРемонтнаяРабота = ВыбранноеЗначение.ЭтоРемонтнаяРабота;
			НайденныеРемонты = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", ВыбранноеЗначение.СтрокаРемонтовОборудования.ID));
			Если НайденныеРемонты.Количество() > 0 Тогда
				РемонтУжеДобавлен = Истина;
				МассивИДДобавленныхРемонтов.Добавить(ВыбранноеЗначение.СтрокаРемонтовОборудования.ID);
			КонецЕсли;

			Если РемонтУжеДобавлен Тогда 
				Вопрос = НСтр("es='Esta reparación es añadida ya. Los trabajos de reparación vinculados serán limpiados y añadidos de nuevo. ¿Continuar?';ru='Этот ремонт уже добавлен. Связанные ремонтные работы будут очищены и добавлены заново. Продолжить?';en='This repair has already been added. Associated repairs will be cleaned and re-added. Continue?'");
			КонецЕсли;
		КонецЕсли;

		// ФО торо_НазначениеНаРемонтСУчетомРисков.
		Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") И ВыбранноеЗначение.Свойство("КрайняяДопустимаяДатаЗавершенияРемонта") Тогда
			ТекущиеДанные = Элементы.РемонтыОборудования.ТекущиеДанные;
			Если Не ТекущиеДанные = Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ТекущиеДанные, ВыбранноеЗначение);
				ТекущиеДанные.ДатаНачала     = ВыбранноеЗначение.ДатаНачалаРемонта;

				ТекущиеДанные.ДатаОкончания  = ВыбранноеЗначение.ДатаОкончанияРемонта;

				МассивСтрок = Объект.РезультатыПодбораИзМатрицыОценкиРисков.НайтиСтроки(Новый Структура("РемонтыОборудования_ID",ТекущиеДанные.ID));

				Для каждого Строка Из МассивСтрок Цикл
					Объект.РезультатыПодбораИзМатрицыОценкиРисков.Удалить(Строка);
				КонецЦикла; 

				Если ВыбранноеЗначение.Свойство("РезультатыПодбораИзМатрицыОценкиРисков") Тогда
					Для каждого Строка Из ВыбранноеЗначение.РезультатыПодбораИзМатрицыОценкиРисков Цикл
						ЗаполнитьЗначенияСвойств(Объект.РезультатыПодбораИзМатрицыОценкиРисков.Добавить(), Строка);
					КонецЦикла; 
				КонецЕсли; 

				Модифицированность = Истина;

			КонецЕсли;
		Иначе

			Если РемонтУжеДобавлен И НЕ ЭтоРемонтнаяРабота Тогда
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("ВыбранноеЗначение", ВыбранноеЗначение);
				СтруктураПараметров.Вставить("МассивИДДобавленныхРемонтов", МассивИДДобавленныхРемонтов);
				ПоказатьВопрос(Новый ОписаниеОповещения("РемонтыОборудованияОбработкаВыбораПослеВопроса", ЭтотОбъект, СтруктураПараметров),
				Вопрос, РежимДиалогаВопрос.ДаНет);
			Иначе
				ОбработкаВыбораЗавершение(ВыбранноеЗначение);
			КонецЕсли;

		КонецЕсли; 


	КонецЕсли;
	#Вставка
	ДобавитьУОКатегорииРискаНаСервере();
	ОбновитьЗаливкуЗаголовка();
	#КонецВставки

КонецПроцедуры


&НаСервере
&ИзменениеИКонтроль("РемонтыОборудованияОбработкаВыбораСервер")
Функция гкс_РемонтыОборудованияОбработкаВыбораСервер(ВыбранноеЗначение)

	IDРемонтаДляАктивизации = Неопределено;

	МассивСтруктурВозврата = Новый Массив;
	#Вставка
	// гкс+ [03.23] Деснол 13.03.2023
	РемонтыДо = Новый Массив();
	Для Каждого СтрокаТЧ Из Объект.РемонтыОборудования Цикл
		РемонтыДо.Добавить(СтрокаТЧ.ID);
	КонецЦикла;
	// гкс- [03.23] Деснол 13.03.2023
	#КонецВставки

	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		Для Каждого ЭлементМассива Из ВыбранноеЗначение Цикл
			СтруктураВозврата = торо_Ремонты.ОбработкаВыбораРемонта(Неопределено, ЭлементМассива, Объект, Объект.РемонтыОборудования, Объект.РемонтныеРаботы, Объект.ДокументыОснования, Неопределено);
			Если ТипЗнч(СтруктураВозврата) <> Тип("Структура") Тогда
				МассивСтруктурВозврата.Добавить(СтруктураВозврата);
			КонецЕсли;
		КонецЦикла;	
	Иначе
		СтруктураВозврата = торо_Ремонты.ОбработкаВыбораРемонта(Неопределено, ВыбранноеЗначение, Объект, Объект.РемонтыОборудования, Объект.РемонтныеРаботы, Объект.ДокументыОснования, Неопределено);
		Если ТипЗнч(СтруктураВозврата) <> Тип("Структура") Тогда
			МассивСтруктурВозврата.Добавить(СтруктураВозврата);
		КонецЕсли;
		IDРемонтаДляАктивизации = ВыбранноеЗначение.СтрокаРемонтовОборудования.ID;
	КонецЕсли;

	Для Каждого ЭлементМассива Из МассивСтруктурВозврата Цикл
		Если ТипЗнч(ЭлементМассива) = Тип("Строка") Тогда
			ОбщегоНазначения.СообщитьПользователю(ЭлементМассива);
		КонецЕсли;
	КонецЦикла;

	ЭтоПервыйДокументВЦепочке = ЭтоПервыйДокументВЦепочке();
	ЭтоПоследнийДокументВЦепочке = ЭтоПоследнийДокументВЦепочке();

	ОбновитьДобавленныеКолонкиТаблиц();
	ОбновитьЗависимыеЛоты();
	ОбновитьДокументыЗаказНаВнПотреблениеСервер();
	#Вставка
	// гкс+ [03.23] Деснол 13.03.2023
	РемонтыНовые = Новый Массив();
	Для Каждого СтрокаТЧ Из Объект.РемонтыОборудования Цикл
		Если РемонтыДо.Найти(СтрокаТЧ.ID) = Неопределено Тогда 
			РемонтыНовые.Добавить(СтрокаТЧ.ID);
		КонецЕсли;
	КонецЦикла;
	Если РемонтыНовые.Количество() Тогда 
		гкс_ДобавитьВДеревоРеквизитыИзППР(РемонтыНовые);
	КонецЕсли;
	// гкс- [03.23] Деснол 13.03.2023
	#КонецВставки

	Возврат Новый Структура("IDРемонтаДляАктивизации", IDРемонтаДляАктивизации);

КонецФункции

// гкс+ [04.23] Деснол 13.04.2023
&НаКлиенте
Процедура гкс_РемонтыОборудованияПриАктивизацииСтрокиПосле(Элемент)
	ТекДанные = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		Элементы["гкс_МежремонтныйПериод"].ТолькоПросмотр = (ЭтотОбъект["гкс_ВР_06"] = ТекДанные.ВидРемонтныхРабот);
	КонецЕсли;
КонецПроцедуры // гкс- [04.23] Деснол 13.04.2023

// гкс+ [04.23] Деснол 20.04.2023
&НаКлиенте
Процедура гкс_РемонтыОборудованияВидРемонтныхРаботПриИзмененииПосле(Элемент)
	ТекДанные = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		Элементы["гкс_МежремонтныйПериод"].ТолькоПросмотр = (ЭтотОбъект["гкс_ВР_06"] = ТекДанные.ВидРемонтныхРабот);
	КонецЕсли;
КонецПроцедуры // гкс- [04.23] Деснол 20.04.2023

#КонецОбласти
 
#Область ОбработчикиСобытийЭлементовТаблицыФормы_СИЗ

&НаКлиенте
Процедура гкс_СИЗПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если Не ОтменаРедактирования Тогда 
		ТекДанные = Элементы.РемонтыОборудования.ТекущиеДанные;
		Если ТекДанные = Неопределено Тогда 
			Отказ = Истина;
		КонецЕсли;
		ТекДанные2 = Элементы["гкс_СИЗ"].ТекущиеДанные;
		ТекДанные2.РемонтыОборудования_ID = ТекДанные.ID;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура гкс_СИЗПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	ТекДанные = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда 
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// гкс+ [] Деснол 12.09.2022
&НаКлиенте
Процедура гкс_РежимПроецирования(Команда)
	ЭтотОбъект["гкс_ВыборРемонтов"] = Не ЭтотОбъект["гкс_ВыборРемонтов"];
	Элементы["гкс_ВыбранРО"].Видимость = ЭтотОбъект["гкс_ВыборРемонтов"];
	Элементы["гкс_ПроецироватьКнопка"].Видимость = ЭтотОбъект["гкс_ВыборРемонтов"];
	Элементы["гкс_ВыбратьВсеРемонтыКнопка"].Видимость = ЭтотОбъект["гкс_ВыборРемонтов"];
	Элементы["гкс_ОтменитьВыборВсехРемонтыКнопка"].Видимость = ЭтотОбъект["гкс_ВыборРемонтов"];
	Если ЭтотОбъект["гкс_ВыборРемонтов"] Тогда 
		Элементы["гкс_РежимПроецированияКнопка"].Заголовок = "Режим выбора (вкл)";
	Иначе
		Элементы["гкс_РежимПроецированияКнопка"].Заголовок = "Режим выбора (выкл)";
	КонецЕсли;
КонецПроцедуры // гкс- [] Деснол 12.09.2022

// гкс+ [] Деснол 12.09.2022
&НаКлиенте
Процедура гкс_Проецировать(Команда)
	МассивИД = Новый Массив();
	ТекДанные = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Выберите строку источник";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	Для Каждого СтрокаТаблицы Из Объект.РемонтыОборудования Цикл
		Если СтрокаТаблицы.гкс_Выбран И Не ТекДанные.ID = СтрокаТаблицы.ID Тогда 
			МассивИД.Добавить(СтрокаТаблицы.ID);
		КонецЕсли;
	КонецЦикла;
	Если МассивИД.Количество() > 0 Тогда 
		ПараметрыПослеВыбора = Новый Структура("МассивИД,Источник", МассивИД, ТекДанные.ID);
		ТекОписаниеОповещения = Новый ОписаниеОповещения("гкс_ПроецироватьПослеВопроса", ЭтотОбъект, ПараметрыПослеВыбора);
		СписокТекста = Новый СписокЗначений();
		// Гкс+[TOIR20-464] Зозуля А.В. от 14.11.2024. Добавлено:{
		СписокТекста.Добавить("Описание", "Описание ремонта");
		// } Гкс-[TOIR20-464] Зозуля А.В. от 14.11.2024.
		СписокТекста.Добавить("ВР", "Вид ремонта");
		СписокТекста.Добавить("Даты", "Даты ремонта");
		СписокТекста.Добавить("Операции", "Список операций");
		СписокТекста.Добавить("Критичность", "Критичность");
		СписокТекста.Добавить("Исполнители", "Исполнители по ремонту");
		СписокТекста.Добавить("Межремонтный", "Межремонтный период");
		ПоказатьВопрос(ТекОписаниеОповещения, "Выберите реквизиты для проецирования", СписокТекста);
	Иначе
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Выберите строки для проецирования";
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры // гкс- [] Деснол 12.09.2022

// гкс+ [] Деснол 14.09.2022
&НаКлиенте
Процедура гкс_ВыбратьВсеРемонты(Команда)
	Для Каждого СтрокаТаблицы Из Объект.РемонтыОборудования Цикл
		СтрокаТаблицы.гкс_Выбран = Истина;
	КонецЦикла;
КонецПроцедуры // гкс- [] Деснол 14.09.2022

// гкс+ [] Деснол 14.09.2022
&НаКлиенте
Процедура гкс_ОтменитьВыборВсехРемонты(Команда)
	Для Каждого СтрокаТаблицы Из Объект.РемонтыОборудования Цикл
		СтрокаТаблицы.гкс_Выбран = Ложь;
	КонецЦикла;
КонецПроцедуры // гкс- [] Деснол 14.09.2022

// гкс+ [Релиз15] Деснол
&НаКлиенте
Процедура ОткрытьЗакрытиеЗаявокИРемонтов(Команда)
	Если Объект.Проведен = Ложь Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Необходимо провести документ';en='you need to post a document'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ВыбранныеРемонты = Новый Массив;
	Для каждого Ремонт Из Объект.РемонтыОборудования Цикл
		ВыбранныеРемонты.Добавить(Ремонт.ID);
	КонецЦикла; 
	
	Отбор = Новый Структура;
	Отбор.Вставить("ID", ВыбранныеРемонты);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОтборРемонтов", Отбор);
	
	ОткрытьФорму("Обработка.торо_ЗакрытиеЗаявокИРемонтов.Форма.Форма", ПараметрыФормы,,,,,,);
	
КонецПроцедуры // гкс- [Релиз15]

// гкс+ [Релиз15] Деснол
&НаКлиенте
Процедура гкс_ЗаполнитьСпособВыполнения(Команда)
	ТекДанные = Элементы.РемонтыОборудования.ТекущиеДанные;
	СтрПараметры = Новый Структура("Ремонт", ТекДанные.ID);
	ОписаниеОп = Новый ОписаниеОповещения("гкс_ПослеВыбораСпособа", ЭтотОбъект, СтрПараметры);
	ПоказатьВводЗначения(ОписаниеОп, Неопределено, "Способ выполнения", гкс_ТипСпособВыполнения());
КонецПроцедуры // гкс- [Релиз15]

&НаКлиенте
Процедура ОбновитьПлановуюСтоимостьРемонта(Команда)
	ОбновитьПлановуюСтоимостьРемонтаНаСервере();
	Модифицированность = Истина;
КонецПроцедуры

// Гкс+[TOIR20-97] Борисов 
&НаКлиенте
Процедура СоздатьЗаявкуНаПеремещение(Команда)
	
	// Гкс+[TOIR20-144] Селимов
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("Команда", "СоздатьЗаявкуНаПеремещение"); // } Гкс-[TOIR20-144] 
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОСоздании", ЭтотОбъект, ПараметрыОповещения);
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Создать документ ""Заказ на перемещение"" в базе ERP?'"), Режим);
	
КонецПроцедуры // } Гкс-[TOIR20-97] 

// Гкс+[TOIR20-144] Селимов 
&НаКлиенте
Процедура СоздатьЗаказПоставщику(Команда)
	
	ФайлДОСуществует = ФайлДОСуществует();
	
	Если Не ФайлДОСуществует Тогда
		ТекстСообщения = нСтр("ru='Нет прикрепленных файлов в Документообороте. Документ в ERP не создан!'", "ru");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , , , );
		Возврат;	
	КонецЕсли; 
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("Команда", "СоздатьЗаказПоставщику");
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОСоздании", ЭтотОбъект, ПараметрыОповещения);
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Создать документ ""Заказ поставщику"" в базе ERP?'"), Режим);
	
КонецПроцедуры // } Гкс-[TOIR20-144] 

// Гкс+[TOIR20-97] Борисов 
&НаКлиенте
Процедура ОткрытьФормуСпискаЗаказовНаПеремещение(Команда)
	
	// Гкс+[TOIR20-523] Вялых Д.А. от 29.01.2025. Добавлено и закомментировано:{
	Если Объект.МатериальныеЗатраты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	ТекущаяНоменклатура = Элементы.МатериальныеЗатраты.ТекущиеДанные.Номенклатура;
	
	НавигационнаяСсылкаФормыСпискаЗаказовНаПеремещение = ПолучитьНавигационнуюСсылкуФормыСпискаЗаказовНаПеремещение(ТекущаяНоменклатура);
	Если ЗначениеЗаполнено(НавигационнаяСсылкаФормыСпискаЗаказовНаПеремещение) Тогда 
		ПерейтиПоНавигационнойСсылке(НавигационнаяСсылкаФормыСпискаЗаказовНаПеремещение);	
	КонецЕсли;
	
	//НавигационнаяСсылкаФормыСпискаЗаказовНаПеремещение = ПолучитьНавигационнуюСсылкуФормыСпискаЗаказовНаПеремещение();
	//Если ЗначениеЗаполнено(НавигационнаяСсылкаФормыСпискаЗаказовНаПеремещение) Тогда
	//	ПерейтиПоНавигационнойСсылке(НавигационнаяСсылкаФормыСпискаЗаказовНаПеремещение);
	//Иначе
	//	ТекстПредупреждения = НСтр( "ru = 'Не заполнена константа: 
	//								|	""Навигационная ссылка на список ""Заказов на перемещение"" ERP (ГКС)""!'");
	//	ПоказатьПредупреждение( , ТекстПредупреждения);
	//КонецЕсли; 
	// } Гкс-[TOIR20-523] Вялых Д.А. от 29.01.2025.
	
КонецПроцедуры // } Гкс-[TOIR20-97]

&НаКлиенте
Процедура гкс_ОтправитьНаСогласование(Команда)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Параметры1 = Новый Структура("дс_Выполнить", Истина);
		Параметры2 = Новый Структура();
		
		гкс_ОбщегоНазначенияСервер.ОтправитьНаСогласованиеНаСервере(Параметры1, Параметры2);
		Если Параметры1.дс_Выполнить Тогда 
			Параметры2.Вставить("Форма", ЭтотОбъект);
			торо_РаботаССогласованиямиКлиент.ВыбратьСтатусЗавершение(Параметры1, Параметры2);
			гкс_ИзменитьВидимостьКнопкиОтправкиНаСогласование();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ДобавитьТехКарту")
Процедура гкс_ДобавитьТехКарту(Команда)

	ТекущиеДанные = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("es='¡Indiquen la disposición de la reparación!';ru='Укажите расположение ремонта!';en='Specify  the location of the repair!'"), 10); 
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ТекущиеДанные.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("es='¡La reparación no es posible incluir en la composición de la operación tecnológica!';ru='Ремонт нельзя включать в состав технологической операции!';en='Repair can not be included in the technological operation!'"), 10); 
		Возврат;
	КонецЕсли;

	#Удаление
	ОткрытьФорму("Справочник.торо_ИдентификаторыТехКарт.ФормаВыбора", Новый Структура("ОтборПоСтатусам, МножественныйВыбор", ПредопределенноеЗначение("Перечисление.торо_СтатусыНормативныхРемонтовИТехКарт.Действует"), Истина), Элементы.ДеревоРемонтныхРабот);
	#КонецУдаления
	#Вставка
	ПараметрыФормы = Новый Структура("ОтборПоСтатусам, МножественныйВыбор",
		ПредопределенноеЗначение("Перечисление.торо_СтатусыНормативныхРемонтовИТехКарт.Действует"), Истина);
	ТекРемонт = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если Не ТекРемонт = Неопределено Тогда 
		ПараметрыФормы.Вставить("ОтборПоТОРИзОР", ТекРемонт.ОбъектРемонта);
	КонецЕсли;
	ОткрытьФорму("Справочник.торо_ИдентификаторыТехКарт.ФормаВыбора",
	ПараметрыФормы, Элементы.ДеревоРемонтныхРабот);
	#КонецВставки

КонецПроцедуры

&НаКлиенте
Процедура гкс_УстановитьПКоэф(Команда)
	ТекДанные = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если не ТекДанные = Неопределено Тогда 
		МассивПередачи = Новый Массив();
		Для Каждого СтрокаТаблицы Из Объект.РемонтныеРаботы Цикл
			Если ТекДанные.ID = СтрокаТаблицы.РемонтыОборудования_ID Тогда 
				МассивПередачи.Добавить(Новый Структура("ИД,гкс_ПовКоэф,РемонтнаяРабота"
					, СтрокаТаблицы.ID, СтрокаТаблицы.гкс_ПовКоэф, СтрокаТаблицы.РемонтнаяРабота));
			КонецЕсли;
		КонецЦикла;
		ОписаниеОп = Новый ОписаниеОповещения("гкс_УстановитьПКоэфОбработкаВыбора",
			ЭтотОбъект, Новый Структура("ИдРемонта", ТекДанные.ID) );
			ОткрытьФорму("Справочник.гкс_ПКоэффициентыРабот.Форма.ПодборПКоэфВСписок", Новый Структура("Строки", МассивПередачи), ЭтотОбъект,,,, 
				ОписаниеОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

// гкс+ [03.23] Деснол 13.03.2023
&НаКлиенте
Процедура гкс_УстановитьДавальческийРемонту(Команда)
	ТекДанные = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		НайдСтр = Объект.МатериальныеЗатраты.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", ТекДанные.ID));
		Для Каждого СтрокаТЧ Из НайдСтр Цикл
			СтрокаТЧ.гкс_Давальческие = Истина;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры // гкс- [03.23] Деснол 13.03.2023

// гкс+ [03.23] Деснол 13.03.2023
&НаКлиенте
Процедура гкс_УстановитьДавальческийДокументу(Команда)
	
	ОпОп = Новый ОписаниеОповещения("гкс_УстановитьДавальческийДокументуПослеВопроса", ЭтотОбъект);
		ПоказатьВопрос(ОпОп, "Вся номенклатура документа будет отмечена как ""давальческая"". Продолжить?", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры // гкс- [03.23] Деснол 13.03.2023

// гкс+ [03.23] Деснол 13.03.2023
&НаКлиенте
Процедура гкс_ОбновитьТехкартыРемонта(Команда)
	ТекДанные = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		ОпОп = Новый ОписаниеОповещения("гкс_ОбновитьТехкартыРемонтаПослеВопроса", ЭтотОбъект);
		ПоказатьВопрос(ОпОп, "Дерево ремонтных работ и связанные таблицы будут обновлены. Продолжить?", РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры // гкс- [03.23] Деснол 13.03.2023

// гкс+ [05.23] Деснол 05.05.2023
&НаКлиенте
Процедура гкс_СкрытьНиз(Команда)
	ЭтотОбъект["гкс_НизСвернут"] = Истина;
	Элементы["гкс_СкрытьНизКнопка"].Видимость = Ложь;
	Элементы["гкс_ПоказатьНизКнопка"].Видимость = Истина;
	Элементы.Подвал.Видимость = Ложь;
КонецПроцедуры // гкс- [05.23] Деснол 05.05.2023

// гкс+ [05.23] Деснол 05.05.2023
&НаКлиенте
Процедура гкс_ПоказатьНиз(Команда)
	ЭтотОбъект["гкс_НизСвернут"] = Ложь;
	Элементы["гкс_СкрытьНизКнопка"].Видимость = Истина;
	Элементы["гкс_ПоказатьНизКнопка"].Видимость = Ложь;
	Элементы.Подвал.Видимость = Истина;
КонецПроцедуры // гкс- [05.23] Деснол 05.05.2023

// Гкс+[TOIR20-490] Зозуля А.В. от 22.01.2024. Добавлено:{
&НаКлиенте
Процедура гкс_ОбновитьОстатки(Команда)
	гкс_ОбновитьОстаткиНаСервере();		
КонецПроцедуры // } Гкс-[TOIR20-490] Зозуля А.В. от 22.01.2024.

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура гкс_ДобавитьИзменитьРеквизитыФормы()
	
	МассивРеквизитов = Новый Массив();	
	
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_Цена", Новый ОписаниеТипов("Число", , , 
		Новый КвалификаторыЧисла(15, 2)), "Объект.МатериальныеЗатраты"));	
		
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ПлановаяСтоимостьТекст", Новый ОписаниеТипов("Строка", , , , 
		Новый КвалификаторыСтроки(30))));
		
	// гкс+ [Релиз17] Деснол
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ПлановаяСтоимостьБезДавальческихМатериаловТекст", Новый ОписаниеТипов("Строка",,,, 
		Новый КвалификаторыСтроки(30))));
	// гкс- [Релиз17]
		
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_СимптомДефекта",
		Новый ОписаниеТипов("СправочникСсылка.гкс_СимптомыДефектов"), "Объект.РемонтыОборудования"));
		
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_Примечание", Новый ОписаниеТипов("Строка",,,, 
		Новый КвалификаторыСтроки(100)), "ДеревоРемонтныхРабот"));
		
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_СтатусЧерновик", 
		Новый ОписаниеТипов("СправочникСсылка.торо_СтатусыСогласованияДокументовРемонтныхРабот")));
		
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_СпособВыполнения", 
		Новый ОписаниеТипов("ПеречислениеСсылка.СпособыСтроительства"), "ДеревоРемонтныхРабот",
		НСтр("ru='Способ выполнения';en='Execution method';es='El modo de la ejecución'")));
		
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ПовКоэф", 
		Новый ОписаниеТипов("СправочникСсылка.гкс_ПКоэффициентыРабот"), "ДеревоРемонтныхРабот",
		НСтр("ru='Пов.коэф.';en='coef.';es=''")));
		
	// гкс+ [] Деснол 12.09.2022
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_Выбран",
		Новый ОписаниеТипов("Булево"), "Объект.РемонтыОборудования", " "));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ВыборРемонтов", Новый ОписаниеТипов("Булево")));
	// гкс- [] Деснол 12.09.2022
	// гкс+ [04.23] Деснол 13.04.2023
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ВР_06", Новый ОписаниеТипов("СправочникСсылка.торо_ВидыРемонтов")));
	// гкс- [04.23] Деснол 13.04.2023
	
	// Гкс+[TOIR20-490] Зозуля А.В. от 22.01.2024. Добавлено:{
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ВНаличии", ОбщегоНазначения.ОписаниеТипаЧисло(15, 3), 
    	"Объект.МатериальныеЗатраты", НСтр("ru='В наличии'")));

	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ИнформацияОбОстатках", ОбщегоНазначения.ОписаниеТипаСтрока(300), 
    	"Объект.МатериальныеЗатраты", НСтр("ru='Информация об остатках'")));								  
								  
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_СрокПоставки", ОбщегоНазначения.ОписаниеТипаЧисло(10), 
    	"Объект.МатериальныеЗатраты", НСтр("ru='Срок поставки'")));							  
								  
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ДатаСогласованияДО", Новый ОписаниеТипов("Дата"), 
		"Объект.МатериальныеЗатраты", НСтр("ru='Дата согласования ДО'")));							  
	
	// Гкс+[TOIR20-528] Вялых Д.А. от 05.02.2025. Добавлено:{
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_Отгрузить", Новый ОписаниеТипов("Булево"), 
    	"Объект.МатериальныеЗатраты", НСтр("ru='Отгрузить'")));
	// } Гкс-[TOIR20-528] Вялых Д.А. от 05.02.2025.
	// Гкс+[TOIR20-532] Вялых Д.А. от 10.02.2025. Добавлено:{
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ВключенВЗаказ", Новый ОписаниеТипов("Булево"), 
    	"Объект.МатериальныеЗатраты", НСтр("ru='Включен в заказ'")));
	
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_КоличествоВПеремещении", ОбщегоНазначения.ОписаниеТипаЧисло(15, 3), 
    	"Объект.МатериальныеЗатраты", НСтр("ru='Количество в перемещении'")));
	// } Гкс-[TOIR20-532] Вялых Д.А. от 10.02.2025.
							  
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ВРаботеУОМТС", Новый ОписаниеТипов("Булево"), 
    	"Объект.МатериальныеЗатраты", НСтр("ru='В работе у ОМТС'")));							  
								  
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ДатаЗаказаПоставщику", Новый ОписаниеТипов("Дата"), 
    	"Объект.МатериальныеЗатраты",  НСтр("ru='Дата заказа поставщику'")));							  
								  
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_КоличествоВЗаказе", ОбщегоНазначения.ОписаниеТипаЧисло(15, 3), 
    	"Объект.МатериальныеЗатраты", НСтр("ru='Кол-во в заказе'")));							  
								  
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ДатаПоставки",  Новый ОписаниеТипов("Дата"), 
    	"Объект.МатериальныеЗатраты", НСтр("ru='Дата поставки'")));
	
	// Гкс+[TOIR20-510] Зозуля А.В. от 29.01.2025. Добавлено:{
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ТМЦВПути", ОбщегоНазначения.ОписаниеТипаСтрока(200), 
    	"Объект.МатериальныеЗатраты", НСтр("ru='ТМЦ в пути'")));
	// } Гкс-[TOIR20-510] Зозуля А.В. от 29.01.2025.
	
	// Гкс+[TOIR20-677] Оселедько В.С. от 01.08.2025. Добавлено:{
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ВремяНачалаЗамера", Новый ОписаниеТипов("Число",,,,Новый КвалификаторыЧисла(15))));
	// Гкс+[TOIR20-677] Оселедько В.С. от 01.08.2025
	
	// } Гкс-[TOIR20-490] Зозуля А.В. от 22.01.2024.
	
	ИзменитьРеквизиты(МассивРеквизитов);
	// Гкс+[TOIR20-677] Оселедько В.С. от 01.08.2025. Добавлено:{
	Если Параметры.Свойство("ВремяНачалаОткрытияФормы") Тогда
		ЭтотОбъект.гкс_ВремяНачалаЗамера = Параметры.ВремяНачалаОткрытияФормы;		
	КонецЕсли;
	// Гкс+[TOIR20-677] Оселедько В.С. от 01.08.2025.	
	// гкс+ [04.23] Деснол 13.04.2023
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Спр.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.торо_ВидыРемонтов КАК Спр
		|ГДЕ
		|	Спр.Код = &Код ИЛИ Спр.Код = &Код2";
	
	Запрос.УстановитьПараметр("Код", "PM-06");
	Запрос.УстановитьПараметр("Код2", "РМ-06");
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда 
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЭтотОбъект["гкс_ВР_06"] = Выборка.Ссылка;
	КонецЕсли;
	// гкс- [04.23] Деснол 13.04.2023
	
КонецПроцедуры       

&НаСервере
Процедура гкс_ДобавитьИзменитьКомандыФормы()
	
	// Гкс+[TOIR20-97] Борисов 
	НоваяКоманда = Команды.Добавить("СоздатьЗаявкуНаПеремещение");
	НоваяКоманда.Действие = "СоздатьЗаявкуНаПеремещение";
	НоваяКоманда.Заголовок = НСтр("ru='Создать заказ на перемещение в ERP'");
	
	НоваяКоманда = Команды.Добавить("ОткрытьФормуСпискаЗаказовНаПеремещение");
	НоваяКоманда.Действие = "ОткрытьФормуСпискаЗаказовНаПеремещение";
	НоваяКоманда.Заголовок = НСтр("ru='Смотреть заказ'");
	
	// Гкс+[TOIR20-144] Селимов 
	НоваяКоманда = Команды.Добавить("СоздатьЗаказПоставщику");
	НоваяКоманда.Действие = "СоздатьЗаказПоставщику";
	НоваяКоманда.Заголовок = НСтр("ru='Создать заказ на выполнение работ подрядчиком в ERP'");
	
	НоваяКоманда = Команды.Добавить("ОбновитьПлановуюСтоимостьРемонта");
	НоваяКоманда.Действие = "ОбновитьПлановуюСтоимостьРемонта";
	НоваяКоманда.Заголовок = НСтр("ru='Обновить плановую стоимость ремонта';en='Update the planned cost of repairs'");
	
	НоваяКоманда = Команды.Добавить("гкс_ОтправитьНаСогласование");
	НоваяКоманда.Действие = "гкс_ОтправитьНаСогласование";
	НоваяКоманда.Заголовок = НСтр("ru='Отправить на согласование';en='Send for approval'");
	
	НоваяКоманда = Команды.Добавить("ОткрытьЗакрытиеЗаявокИРемонтов");
	НоваяКоманда.Действие = "ОткрытьЗакрытиеЗаявокИРемонтов";
	НоваяКоманда.Заголовок = НСтр("ru='Закрытие заявок и ремонтов';en='Closing applications and repairs'");

	НоваяКоманда = Команды.Добавить("гкс_ЗаполнитьСпособВыполнения");
	НоваяКоманда.Действие = "гкс_ЗаполнитьСпособВыполнения";

	НоваяКоманда = Команды.Добавить("гкс_УстановитьПКоэф");
	НоваяКоманда.Действие = "гкс_УстановитьПКоэф";
	НоваяКоманда.Заголовок = "Установить повышающий коэффициент";
	// гкс+ [03.23] Деснол 13.03.2023
	НоваяКоманда = Команды.Добавить("гкс_УстановитьДавальческийРемонту");
	НоваяКоманда.Действие = "гкс_УстановитьДавальческийРемонту";
	НоваяКоманда.Заголовок = "Установить Давальческий всем";
	//
	НоваяКоманда = Команды.Добавить("гкс_УстановитьДавальческийДокументу");
	НоваяКоманда.Действие = "гкс_УстановитьДавальческийДокументу";
	НоваяКоманда.Заголовок = "Установить Давальческий во всем документе";
	//
	НоваяКоманда = Команды.Добавить("гкс_ОбновитьТехкартыРемонта");
	НоваяКоманда.Действие = "гкс_ОбновитьТехкартыРемонта";
	НоваяКоманда.Заголовок = "Обновить техкарты ремонта";
	// гкс- [03.23] Деснол 13.03.2023 
	
	// Гкс+[TOIR20-490] Зозуля А.В. от 22.01.2024. Добавлено:{
	НоваяКоманда = Команды.Добавить("гкс_ОбновитьОстатки");
	НоваяКоманда.Действие = "гкс_ОбновитьОстатки";
	НоваяКоманда.Заголовок = НСтр("ru='Обновить остатки'");	
	// } Гкс-[TOIR20-490] Зозуля А.В. от 22.01.2024.
	
КонецПроцедуры 

&НаСервере
Процедура гкс_ИнициализироватьРеквизитыФормы()
		
	ЭтотОбъект["гкс_СтатусЧерновик"] = Справочники.торо_СтатусыСогласованияДокументовРемонтныхРабот.Черновик;
	
	Если ЗначениеЗаполнено(Объект.гкс_Валюта) = Ложь Тогда 
		Объект.гкс_Валюта = гкс_ВалютаОрганизации(Объект.Организация);
	КонецЕсли;
	
	ВывестиПлановуюСтоимость();
	ОбновитьЦеныНоменклатуры();

КонецПроцедуры 

&НаСервере
Процедура гкс_ДобавитьИзменитьЭлементыФормы()
	
	ДобавитьЭлементыСимптомДефекта();
	ДобавитьЭлементыФлажки(); 
	ДобавитьЭлементыДереваРемонтныхРабот();
	ДобавитьЭлементыКнопкиФормы();
	ДобавитьИзменитьОстальныеЭлементыФормы();
	ДобавитьЭлементыСИЗ();
	ДобавитьЭлементыЧасовыеПояса();
	ДобавитьЭлементыКатегорияРиска();
		
КонецПроцедуры 

&НаСервере
Процедура гкс_ИнициализироватьЭлементыФормы()
	
	Элементы.СпособСогласования.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
	// Гкс+[TOIR20-505] Зозуля А.В. от 16.01.2025. Добавлено:{
	Если  ЗначениеЗаполнено(Объект.Номер) И ЗначениеЗаполнено(Объект.Организация)
			И ЗначениеЗаполнено(Объект.Подразделение) Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаРемонтныеРаботы;
	КонецЕсли;
	// } Гкс-[TOIR20-505] Зозуля А.В. от 16.01.2025.
КонецПроцедуры                                

&НаСервере
Процедура гкс_УстановитьВидимостьДоступностьЭлементовФормы()
	
	Элементы.ДеревоРемонтныхРаботДобавитьТехОперацию.Видимость = Ложь;
	Элементы.ДеревоРемонтныхРаботДобавитьТехОперацию.Доступность = Ложь;
	Элементы.ДеревоРемонтныхРаботПодборОпераций.Видимость = Ложь;
	Элементы.ДеревоРемонтныхРаботПодборОпераций.Доступность = Ложь; 
	// гкс+ [Релиз19] Деснол
	Если Не (РольДоступна("ПолныеПрава") 
		Или РольДоступна("гкс_РедактированиеЗаявкиНаРемонт")
		Или РольДоступна("Администрирование")
		// Гкс-[TOIR20-303] Пономарёв С.О. от 20.01.2022. Добавлено:{
		Или РольДоступна("гкс_КлючевойПользователь") 
		// } Гкс-[TOIR20-303] Пономарёв С.О. от 20.01.2022.
		) Тогда
	// гкс- [Релиз19]
		Элементы.Ответственный.ТолькоПросмотр = Истина;
	КонецЕсли;    	
		
	Если РольДоступна("гкс_ИзменениеПроведеннойЗаявки") Тогда 
		ОткрытьДоступностьПолейДляРоли();
	КонецЕсли;

КонецПроцедуры                                             

&НаСервере
Процедура ДобавитьЭлементыСимптомДефекта()
	
	Если Объект.РемонтыОборудования.Количество() > 0 Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ТЧ.ID КАК ИД
			|ПОМЕСТИТЬ Исходные
			|ИЗ
			|	&ТЧ КАК ТЧ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	торо_ВыявленныеДефектыСписокДефектов.гкс_СимптомДефекта КАК Симптом,
			|	Исходные.ИД КАК ИД
			|ИЗ
			|	Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Исходные КАК Исходные
			|		ПО торо_ВыявленныеДефектыСписокДефектов.ID = Исходные.ИД";
		Запрос.УстановитьПараметр("ТЧ",Объект.РемонтыОборудования.Выгрузить(,"ID"));
		РезультатЗапроса = Запрос.Выполнить();	
		Если РезультатЗапроса.Пустой() = Ложь Тогда 
			Выборка = РезультатЗапроса.Выбрать();	
			
			НовыйЭлемент = Элементы.Добавить("РемонтыОборудованиягкс_СимптомДефекта", Тип("ПолеФормы"),
				Элементы.РемонтыОборудования);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.РемонтыОборудования.гкс_СимптомДефекта";
			НовыйЭлемент.ТолькоПросмотр = Истина;
			НовыйЭлемент.Заголовок = НСтр("ru='Симптом дефекта';en='Симптом дефекта'");
			Элементы.Переместить(Элементы["РемонтыОборудованиягкс_СимптомДефекта"], 
				Элементы.РемонтыОборудования, Элементы.РемонтыОборудованияОписаниеРемонта);
			
			Для Каждого СтрокаТаблицы Из Объект.РемонтыОборудования Цикл
				Если Выборка.НайтиСледующий(Новый Структура("ИД", СтрокаТаблицы.ID)) Тогда 
					СтрокаТаблицы.гкс_СимптомДефекта = Выборка.Симптом;
				КонецЕсли;
				Выборка.Сбросить();
			КонецЦикла;
		КонецЕсли;
	КонецЕсли; 	
		
КонецПроцедуры                                  

&НаСервере
Процедура ДобавитьЭлементыФлажки()
		
	НовыйЭлемент = Элементы.Добавить("гкс_ГруппаНовыеФлажки", Тип("ГруппаФормы"));
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь;
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	
	// Гкс+[TOIR20-505] Зозуля А.В. от 16.01.2025. Удалено:{
	//Элементы.Переместить(Элементы["гкс_ГруппаНовыеФлажки"], ЭтотОбъект,Элементы.ГруппаНадписиСогласование);
	// } Гкс-[TOIR20-505] Зозуля А.В. от 16.01.2025.
	НовыйЭлемент = Элементы.Добавить("гкс_ГруппаНовыеФлажки1", Тип("ГруппаФормы"), Элементы["гкс_ГруппаНовыеФлажки"]);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь;
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	НовыйЭлемент = Элементы.Добавить("гкс_ГруппаНовыеФлажки2", Тип("ГруппаФормы"), Элементы["гкс_ГруппаНовыеФлажки"]);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь;
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	НовыйЭлемент = Элементы.Добавить("гкс_ГруппаНовыеФлажки3", Тип("ГруппаФормы"), Элементы["гкс_ГруппаНовыеФлажки"]);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь;
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	НовыйЭлемент = Элементы.Добавить("гкс_НуженОстанов", Тип("ПолеФормы"), Элементы["гкс_ГруппаНовыеФлажки1"]);
	НовыйЭлемент.ПутьКДанным = "Объект.гкс_НуженОстанов";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;
	НовыйЭлемент.РежимВыбораИзСписка = Истина;
	НовыйЭлемент.СписокВыбора.Очистить();
	НовыйЭлемент.СписокВыбора.Добавить("Да", "Да");
	НовыйЭлемент.СписокВыбора.Добавить("Нет", "Нет");
	НовыйЭлемент.СписокВыбора.Добавить("", "");
	
	НовыйЭлемент = Элементы.Добавить("гкс_НуженПодготовка", Тип("ПолеФормы"), Элементы["гкс_ГруппаНовыеФлажки2"]);
	НовыйЭлемент.ПутьКДанным = "Объект.гкс_НуженПодготовка";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;
	НовыйЭлемент.РежимВыбораИзСписка = Истина;
	НовыйЭлемент.СписокВыбора.Очистить();
	НовыйЭлемент.СписокВыбора.Добавить("Да", "Да");
	НовыйЭлемент.СписокВыбора.Добавить("Нет", "Нет");
	НовыйЭлемент.СписокВыбора.Добавить("", "");
	
	НовыйЭлемент = Элементы.Добавить("гкс_РаботаПовышеннойОпасности", Тип("ПолеФормы"), Элементы["гкс_ГруппаНовыеФлажки1"]);
	НовыйЭлемент.ПутьКДанным = "Объект.гкс_РаботаПовышеннойОпасности";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;
	НовыйЭлемент.РежимВыбораИзСписка = Истина;
	НовыйЭлемент.СписокВыбора.Очистить();
	НовыйЭлемент.СписокВыбора.Добавить("Да", "Да");
	НовыйЭлемент.СписокВыбора.Добавить("Нет", "Нет");
	НовыйЭлемент.СписокВыбора.Добавить("", "");
	
	НовыйЭлемент = Элементы.Добавить("гкс_НуженИспытание", Тип("ПолеФормы"), Элементы["гкс_ГруппаНовыеФлажки2"]);
	НовыйЭлемент.ПутьКДанным = "Объект.гкс_НуженИспытание";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;
	НовыйЭлемент.РежимВыбораИзСписка = Истина;
	НовыйЭлемент.СписокВыбора.Очистить();
	НовыйЭлемент.СписокВыбора.Добавить("Да", "Да");
	НовыйЭлемент.СписокВыбора.Добавить("Нет", "Нет");
	НовыйЭлемент.СписокВыбора.Добавить("", "");
	НовыйЭлемент.Видимость = Ложь;
	
	// гкс+ [10.23] Деснол 28.02.2024
	НовыйЭлемент = Элементы.Добавить("гкс_РаботыТСПожаротушения", Тип("ПолеФормы"), Элементы["гкс_ГруппаНовыеФлажки2"]);
	НовыйЭлемент.ПутьКДанным = "Объект.гкс_РаботыТСПожаротушения";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;
	НовыйЭлемент.РежимВыбораИзСписка = Истина;
	НовыйЭлемент.СписокВыбора.Очистить();
	НовыйЭлемент.СписокВыбора.Добавить("Да", "Да");
	НовыйЭлемент.СписокВыбора.Добавить("Нет", "Нет");
	НовыйЭлемент.СписокВыбора.Добавить("", "");
	// гкс- [10.23] Деснол 28.02.2024 
	
КонецПроцедуры                        

&НаСервере
Процедура ДобавитьЭлементыДереваРемонтныхРабот()
	
	НовыйЭлемент = Элементы.Добавить("РемонтныеРаботыгкс_Примечание", Тип("ПолеФормы"), Элементы.ДеревоРемонтныхРабот);
	НовыйЭлемент.ПутьКДанным = "ДеревоРемонтныхРабот.гкс_Примечание";
	НовыйЭлемент.Заголовок = НСтр("ru='Примечание';en='Note'");
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ТолькоПросмотр = Истина;
	Элементы.Переместить(Элементы["РемонтныеРаботыгкс_Примечание"], Элементы.ДеревоРемонтныхРабот,
			Элементы.ДеревоРемонтныхРаботКоличество);
	
	НовыйЭлемент = Элементы.Вставить("ДеревоРемонтныхРаботгкс_СпособВыполнения", Тип("ПолеФормы"), 
		Элементы["ДеревоРемонтныхРабот"], Элементы.ДеревоРемонтныхРаботИсполнитель);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ДеревоРемонтныхРабот.гкс_СпособВыполнения";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "гкс_СпособВыполненияДеревоПриИзменении");

	НоваяКнопкаФормы = Элементы.Добавить("гкс_ЗаполнитьСпособВыполненияКнопка", Тип("КнопкаФормы"),
		Элементы.ДеревоРемонтныхРаботКоманднаяПанель);
	НоваяКнопкаФормы.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НоваяКнопкаФормы.ИмяКоманды = "гкс_ЗаполнитьСпособВыполнения";
	НоваяКнопкаФормы.Заголовок = "Заполнить способ выполнения";
	
	НоваяГруппа = Элементы.Вставить("гкс_ГруппаДеревоРР", Тип("ГруппаФормы"), Элементы.Подвал, Элементы.ДеревоРемонтныхРабот);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.ОтображатьЗаголовок = Ложь;
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	Элементы.Переместить(Элементы.ДеревоРемонтныхРабот,Элементы["гкс_ГруппаДеревоРР"],);

	НовыйЭлемент = Элементы.Добавить("гкс_ПовКоэф", Тип("ПолеФормы"),Элементы["гкс_ГруппаДеревоРР"]);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ДеревоРемонтныхРабот.гкс_ПовКоэф.Описание";
	НовыйЭлемент.ТолькоПРосмотр = Истина;
	НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
	НовыйЭлемент.МногострочныйРежим = Истина;

	НовыйЭлемент = Элементы.Вставить("Деревогкс_ПовКоэф", Тип("ПолеФормы"),
		Элементы.ДеревоРемонтныхРабот, Элементы["ДеревоРемонтныхРаботгкс_СпособВыполнения"]);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ДеревоРемонтныхРабот.гкс_ПовКоэф.Коэффициент";
	НовыйЭлемент.ТолькоПРосмотр = Истина;
	НовыйЭлемент.Заголовок = "Пов.коэф.";

	НоваяКнопка = Элементы.Добавить("гкс_УстановитьПКоэфКнопка", Тип("КнопкаФормы"), Элементы.ДеревоРемонтныхРаботКоманднаяПанель);
	НоваяКнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НоваяКнопка.ИмяКоманды = "гкс_УстановитьПКоэф";

	Элементы.ДеревоРемонтныхРабот.УстановитьДействие("Выбор", "гкс_РемонтныеРаботыВыбор"); 		
		
КонецПроцедуры        

&НаСервере
Процедура ДобавитьЭлементыКнопкиФормы()
	// гкс+ [03.23] Деснол 24.03.2023
	гкс_СкрытьСтоимостьРемонта = Константы.гкс_СкрытьСтоимостьРемонта.Получить();
	// гкс- [03.23] Деснол 24.03.2023
	НоваяКнопкаФормы = Элементы.Добавить("гкс_ОбновитьПлановуюСтоимостьРемонта",Тип("КнопкаФормы"),Элементы["гкс_ГруппаНовыеФлажки3"]);
	НоваяКнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НоваяКнопкаФормы.ИмяКоманды = "ОбновитьПлановуюСтоимостьРемонта";
	НоваяКнопкаФормы.Видимость = Не гкс_СкрытьСтоимостьРемонта;
	
	НоваяКнопкаФормы = Элементы.Добавить("гкс_ОтправитьНаСогласование",Тип("КнопкаФормы"),Элементы.ФормаКоманднаяПанель);
	НоваяКнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НоваяКнопкаФормы.ИмяКоманды = "гкс_ОтправитьНаСогласование";
	Элементы.Переместить(Элементы["гкс_ОтправитьНаСогласование"],Элементы.ФормаКоманднаяПанель,Элементы.ФормаПроведение);
	гкс_ИзменитьВидимостьКнопкиОтправкиНаСогласование();
	
	НоваяКнопкаФормы = Элементы.Добавить("гкс_ОткрытьЗакрытиеЗаявокИРемонтов",Тип("КнопкаФормы"),Элементы.ФормаКоманднаяПанель);
	НоваяКнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НоваяКнопкаФормы.ИмяКоманды = "ОткрытьЗакрытиеЗаявокИРемонтов";
	Элементы.Переместить(Элементы["гкс_ОткрытьЗакрытиеЗаявокИРемонтов"], Элементы.ФормаКоманднаяПанель,
		Элементы.ФормаОбщаяКомандаДополнительныеСведенияКоманднаяПанель);
		
	НовыйЭлемент = Элементы.Добавить("ЭлементСоздатьЗаказПоставщику",
										Тип("КнопкаФормы"),
										Элементы.ИсполнителиПоРемонтам.КоманднаяПанель);
	НовыйЭлемент.ИмяКоманды = "СоздатьЗаказПоставщику";  
	
	НовыйЭлемент = Элементы.Добавить("ОткрытьФормуСпискаЗаказовНаПеремещение",
										Тип("КнопкаФормы"),
										Элементы.МатериальныеЗатраты.КоманднаяПанель);
	НовыйЭлемент.ИмяКоманды = "ОткрытьФормуСпискаЗаказовНаПеремещение"; 
	
	НовыйЭлемент = Элементы.Добавить("ЭлементСоздатьЗаявкуНаПеремещение",
										Тип("КнопкаФормы"),
										Элементы.МатериальныеЗатраты.КоманднаяПанель);
	НовыйЭлемент.ИмяКоманды = "СоздатьЗаявкуНаПеремещение";

	// гкс+ [03.23] Деснол 13.03.2023
	НоваяКнопкаФормы = Элементы.Добавить("гкс_УстановитьДавальческийРемонтуКнопка",Тип("КнопкаФормы"),Элементы.МатериальныеЗатратыКоманднаяПанель);
	НоваяКнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НоваяКнопкаФормы.ИмяКоманды = "гкс_УстановитьДавальческийРемонту";
	//
	НоваяКнопкаФормы = Элементы.Добавить("гкс_УстановитьДавальческийДокументуКнопка",Тип("КнопкаФормы"),Элементы.ФормаКоманднаяПанель);
	НоваяКнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НоваяКнопкаФормы.ИмяКоманды = "гкс_УстановитьДавальческийДокументу";
	//
	НоваяКнопкаФормы = Элементы.Добавить("гкс_ОбновитьТехкартыРемонтаКнопка",Тип("КнопкаФормы"),Элементы.ДеревоРемонтныхРаботКоманднаяПанель);
	НоваяКнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НоваяКнопкаФормы.ИмяКоманды = "гкс_ОбновитьТехкартыРемонта";
	// гкс- [03.23] Деснол 13.03.2023
	// гкс+ [05.23] Деснол 05.05.2023
	#Область КнопкаСворачиванияНиз
	МассРекв = Новый Массив();
	МассРекв.Добавить(Новый РеквизитФормы("гкс_НизСвернут", Новый ОписаниеТипов("Булево")));
	ИзменитьРеквизиты(МассРекв);
	//
	НоваяКоманда = Команды.Добавить("гкс_СкрытьНиз");
	НоваяКоманда.Действие = "гкс_СкрытьНиз";
	НоваяКоманда.Заголовок = "Свернуть подвал";
	//
	НоваяКнопка = Элементы.Добавить("гкс_СкрытьНизКнопка", Тип("КнопкаФормы"), Элементы.РемонтыОборудованияКоманднаяПанель);
	НоваяКнопка.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НоваяКнопка.ИмяКоманды = "гкс_СкрытьНиз";
	//
	НоваяКоманда = Команды.Добавить("гкс_ПоказатьНиз");
	НоваяКоманда.Действие = "гкс_ПоказатьНиз";
	НоваяКоманда.Заголовок = "Развернуть подвал";
	//
	НоваяКнопка = Элементы.Добавить("гкс_ПоказатьНизКнопка", Тип("КнопкаФормы"), Элементы.РемонтыОборудованияКоманднаяПанель);
	НоваяКнопка.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НоваяКнопка.ИмяКоманды = "гкс_ПоказатьНиз";
	НоваяКнопка.Видимость = ЭтотОбъект["гкс_НизСвернут"];
	НоваяКнопка.ЦветФона = WebЦвета.СветлоЖелтый;
	#КонецОбласти
	// гкс- [05.23] Деснол 05.05.2023 
	
	// Гкс+[TOIR20-490] Зозуля А.В. от 22.01.2024. Добавлено:{
	НовыйЭлемент = Элементы.Добавить("гкс_ОбновитьОстатки", Тип("КнопкаФормы"), Элементы.МатериальныеЗатраты.КоманднаяПанель);
	НовыйЭлемент.ИмяКоманды = "гкс_ОбновитьОстатки";
	// } Гкс-[TOIR20-490] Зозуля А.В. от 22.01.2024.
	
КонецПроцедуры                          

&НаСервере
Процедура ДобавитьИзменитьОстальныеЭлементыФормы()
	// гкс+ [03.23] Деснол 13.03.2023
	Если Не РольДоступна("гкс_РедактированиеЗаявкиНаРемонт") Тогда 
		Элементы.Дата.ТолькоПросмотр = Истина;
	КонецЕсли;
	// гкс- [03.23] Деснол 13.03.2023
	// гкс+ [03.23] Деснол 24.03.2023
	гкс_СкрытьСтоимостьРемонта = Константы.гкс_СкрытьСтоимостьРемонта.Получить();
	// гкс- [03.23] Деснол 24.03.2023
	
	НовыйЭлемент = Элементы.Добавить("гкс_Давальческие", Тип("ПолеФормы"), Элементы.МатериальныеЗатраты);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.МатериальныеЗатраты.гкс_Давальческие";
	
	НовыйЭлемент = Элементы.Добавить("гкс_Цена",Тип("ПолеФормы"), Элементы.МатериальныеЗатраты);
	НовыйЭлемент.ПутьКДанным = "Объект.МатериальныеЗатраты.гкс_Цена";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.Заголовок = НСтр("ru='Цена';en='Price'");;
	Элементы.Переместить(Элементы["гкс_Цена"], Элементы.МатериальныеЗатраты, Элементы.МатериальныеЗатратыКачество);
	
	НовыйЭлемент = Элементы.Добавить("гкс_ПлановаяСтоимостьРемонта", Тип("ПолеФормы"), Элементы["гкс_ГруппаНовыеФлажки3"]);
	НовыйЭлемент.ПутьКДанным = "гкс_ПлановаяСтоимостьТекст";
	НовыйЭлемент.Заголовок = НСтр("ru='Плановая стоимость ремонта';en='Planned repair cost'");
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.РедактированиеТекста = Ложь;
	НовыйЭлемент.ТолькоПросмотр = Истина;
	// гкс+ [03.23] Деснол 24.03.2023
	НовыйЭлемент.Видимость = Не гкс_СкрытьСтоимостьРемонта;
	// гкс- [03.23] Деснол 24.03.2023
	
	НовыйЭлемент = Элементы.Добавить("гкс_Валюта", Тип("ПолеФормы"), Элементы["гкс_ГруппаНовыеФлажки3"]);
	НовыйЭлемент.ПутьКДанным = "Объект.гкс_Валюта";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Видимость = Ложь;
	
	// гкс+ [Релиз17] Деснол
	НовыйЭлемент = Элементы.Добавить("гкс_ПлановаяСтоимостьБезДавальческихМатериалов", Тип("ПолеФормы"), Элементы["гкс_ГруппаНовыеФлажки3"]);
	НовыйЭлемент.ПутьКДанным = "гкс_ПлановаяСтоимостьБезДавальческихМатериаловТекст";
	НовыйЭлемент.Заголовок = НСтр("ru='Плановая стоимость (без давальческих материалов)';en='Planned cost'");
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.РедактированиеТекста = Ложь;
	НовыйЭлемент.ТолькоПросмотр = Истина;
	// гкс- [Релиз17]
	// гкс+ [03.23] Деснол 24.03.2023
	НовыйЭлемент.Видимость = Не гкс_СкрытьСтоимостьРемонта;
	// гкс- [03.23] Деснол 24.03.2023

	НовыйЭлемент = Элементы.Добавить("гкс_СрочностьВоздействия", Тип("ПолеФормы"), Элементы["гкс_ГруппаНовыеФлажки1"]);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гкс_СрочностьВоздействия";
	НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
	НовыйЭлемент.ТолькоПросмотр = Истина;

	НоваяГруппаФормы = Элементы.Добавить("гкс_ЦенаГруппа", Тип("ГруппаФормы"), Элементы.ИсполнителиПоРемонтам);
	НоваяГруппаФормы.Вид = ВидГруппыФормы.ГруппаКолонок;
	НоваяГруппаФормы.Группировка = ГруппировкаКолонок.Горизонтальная;
	НоваяГруппаФормы.ОтображатьВШапке = Истина;
	НоваяГруппаФормы.Заголовок = НСтр("ru='Плановая стоимость работы ПО';en='Planned cost of software'");
	
	НовыйЭлемент = Элементы.Добавить("ИсполнителиПоРемонтамгкс_Цена", Тип("ПолеФормы"), Элементы["гкс_ЦенаГруппа"]);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ИсполнителиПоРемонтам.гкс_Цена";
	
	НовыйЭлемент = Элементы.Добавить("ИсполнителиПоРемонтамгкс_Валюта", Тип("ПолеФормы"), Элементы["гкс_ЦенаГруппа"]);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ИсполнителиПоРемонтам.гкс_Валюта";

	// гкс+ [] Деснол 12.09.2022
	НовыйЭлемент = Элементы.Добавить("гкс_ГруппаСкрытаяРабота", Тип("ГруппаФормы"));
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь;
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	
	Элементы.Переместить(Элементы["гкс_ГруппаСкрытаяРабота"], ЭтотОбъект,Элементы.ГруппаНадписиСогласование);
	
	НовыйЭлемент = Элементы.Добавить("гкс_СкрытаяРабота", Тип("ПолеФормы"), Элементы["гкс_ГруппаСкрытаяРабота"]);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.гкс_СкрытаяРабота";
	//
	НовыйЭлемент = Элементы.Добавить("гкс_СкрытаяСмета", Тип("ПолеФормы"), Элементы["гкс_ГруппаСкрытаяРабота"]);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гкс_СкрытаяСмета";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	//
	НовыйЭлемент = Элементы.Вставить("гкс_ВыбранРО", Тип("ПолеФормы"), Элементы.РемонтыОборудования, Элементы.НомерИГарантия);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.РемонтыОборудования.гкс_Выбран";
	//
	НоваяКоманда = команды.Добавить("гкс_РежимПроецирования");
	НоваяКоманда.Действие = "гкс_РежимПроецирования";
	НоваяКоманда.Заголовок = "Режим выбора (выкл)";
	//
	НоваяКоманда = команды.Добавить("гкс_Проецировать");
	НоваяКоманда.Действие = "гкс_Проецировать";
	НоваяКоманда.Заголовок = "Проецировать";
	//
	НоваяКнопка = Элементы.Добавить("гкс_РежимПроецированияКнопка", Тип("КнопкаФормы"), Элементы.РемонтыОборудования.КоманднаяПанель);
	НоваяКнопка.ИмяКоманды = "гкс_РежимПроецирования";
	//
	НоваяКнопка = Элементы.Добавить("гкс_ПроецироватьКнопка", Тип("КнопкаФормы"), Элементы.РемонтыОборудования.КоманднаяПанель);
	НоваяКнопка.ИмяКоманды = "гкс_Проецировать";
	//
	НоваяКоманда = команды.Добавить("гкс_ВыбратьВсеРемонты");
	НоваяКоманда.Действие = "гкс_ВыбратьВсеРемонты";
	НоваяКоманда.Заголовок = "Установить флажки";
	НоваяКоманда.Картинка = БиблиотекаКартинок.УстановитьФлажки;
	//
	НоваяКнопка = Элементы.Добавить("гкс_ВыбратьВсеРемонтыКнопка", Тип("КнопкаФормы"), Элементы.РемонтыОборудования.КоманднаяПанель);
	НоваяКнопка.ИмяКоманды = "гкс_ВыбратьВсеРемонты";
	//
	НоваяКоманда = команды.Добавить("гкс_ОтменитьВыборВсехРемонты");
	НоваяКоманда.Действие = "гкс_ОтменитьВыборВсехРемонты";
	НоваяКоманда.Заголовок = "Снять флажки";
	НоваяКоманда.Картинка = БиблиотекаКартинок.СнятьФлажки;
	//
	НоваяКнопка = Элементы.Добавить("гкс_ОтменитьВыборВсехРемонтыКнопка", Тип("КнопкаФормы"), Элементы.РемонтыОборудования.КоманднаяПанель);
	НоваяКнопка.ИмяКоманды = "гкс_ОтменитьВыборВсехРемонты";
	//
	// гкс- [] Деснол 12.09.2022
	// гкс+ [11.22] Деснол 03.11.2022
	НовыйЭлемент = Элементы.Вставить("гкс_ОРТехНомер", Тип("ПолеФормы"), Элементы["ОРиВР"], Элементы.РемонтыОборудованияВидРемонтныхРабот);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.РемонтыОборудования.ОбъектРемонта.ТехНомер";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	// гкс- [11.22] Деснол 03.11.2022
	// гкс+ [12.22] Деснол 12.12.2022
	НовыйЭлемент = Элементы.Вставить("гкс_МежремонтныйПериод", Тип("ПолеФормы"), Элементы.РемонтыОборудования);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.РемонтыОборудования.гкс_МежремонтныйПериод";
	// гкс- [12.22] Деснол 12.12.2022
	// гкс+ [03.23] Деснол 13.03.2023
	// создание на основании ППР
	Если Не ЗначениеЗаполнено(Параметры.Ключ) И Объект.РемонтыОборудования.Количество() Тогда 
		Запрос = Новый Запрос();
		// Гкс+[TOIR20-382] Лебедев Н.А. от 12.07.2023. Изменено:{
		//Запрос.Текст = "ВЫБРАТЬ
		//               |	ТЧ.ID КАК ИД
		//               |ПОМЕСТИТЬ Исходные
		//               |ИЗ
		//               |	&ТЧ1 КАК ТЧ
		//               |
		//               |ИНДЕКСИРОВАТЬ ПО
		//               |	ИД
		//               |;
		//               |
		//               |////////////////////////////////////////////////////////////////////////////////
		//               |ВЫБРАТЬ
		//               |	Плановые.Исполнитель КАК Исполнитель,
		//               |	Плановые.СпособВыполнения КАК СпособВыполнения,
		//               |	Исходные.ИД КАК ИД
		//               |ИЗ
		//               |	Исходные КАК Исходные
		//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних КАК Плановые
		//               |		ПО Исходные.ИД = Плановые.ID";
	  	// }На:{
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТЧ.ID КАК ИД
		|ПОМЕСТИТЬ Исходные
		|ИЗ
		|	&ТЧ1 КАК ТЧ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ИД
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ПлановыеРемонтныеРаботы.Период) КАК Период,
		|	ПлановыеРемонтныеРаботы.ID КАК ID
		|ПОМЕСТИТЬ ВТ_Отбор
		|ИЗ
		|	РегистрСведений.торо_ПлановыеРемонтныеРаботы КАК ПлановыеРемонтныеРаботы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Исходные КАК Исходные
		|		ПО ПлановыеРемонтныеРаботы.ID = Исходные.ИД
		|
		|СГРУППИРОВАТЬ ПО
		|	ПлановыеРемонтныеРаботы.ID
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID,
		|	Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Отбор.ID КАК ИД,
		|	ПлановыеРемонтныеРаботы.Исполнитель КАК Исполнитель,
		|	ПлановыеРемонтныеРаботы.СпособВыполнения КАК СпособВыполнения
		|ИЗ
		|	ВТ_Отбор КАК Отбор
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ПлановыеРемонтныеРаботы КАК ПлановыеРемонтныеРаботы
		|		ПО Отбор.ID = ПлановыеРемонтныеРаботы.ID";
        // } Гкс-[TOIR20-382] Лебедев Н.А. от 12.07.2023.
		
		Запрос.УстановитьПараметр("ТЧ1", Объект.РемонтыОборудования.Выгрузить());
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда 
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				НайдСтр = Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", Выборка.ИД));
				Для Каждого СтрокаТЧ Из НайдСтр Цикл
					СтрокаТЧ.гкс_СпособВыполнения = Выборка.СпособВыполнения;
					СтрокаТЧ.Исполнитель = Выборка.Исполнитель;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	// гкс- [03.23] Деснол 13.03.2023
	// гкс+ [04.23] Деснол 24.04.2023
	// Гкс+[TOIR20-505] Зозуля А.В. от 16.01.2025. Удалено:{
	//Элементы.Переместить(Элементы.Организация, Элементы.ДатаИНомер);
	//Элементы.Переместить(Элементы.Подразделение, Элементы.ДатаИНомер);
	// } Гкс-[TOIR20-505] Зозуля А.В. от 16.01.2025.
	Элементы.Переместить(Элементы["гкс_СрочностьВоздействия"], Элементы["гкс_ГруппаНовыеФлажки3"]);
	Элементы.Переместить(Элементы["гкс_ГруппаСкрытаяРабота"], Элементы["гкс_ГруппаНовыеФлажки3"]);
	Элементы["гкс_НуженОстанов"].Ширина = 5;
	Элементы["гкс_НуженПодготовка"].Ширина = 5;
	Элементы["гкс_РаботаПовышеннойОпасности"].Ширина = 5;
	Элементы["гкс_НуженИспытание"].Ширина = 5;
	Элементы["гкс_НуженПодготовка"].МаксимальнаяШирина = 5;
	Элементы.ГруппаЗаказыНаВнутреннееПотребление.Скрыть();
	// гкс- [04.23] Деснол 24.04.2023
	
	// Гкс+[TOIR20-490] Зозуля А.В. от 22.01.2024. Добавлено:{
	Элемент	= Элементы.Вставить("гкс_ВНаличии", Тип("ПолеФормы"), Элементы.МатериальныеЗатраты);	
	Элемент.Вид	= ВидПоляФормы.ПолеНадписи; 
	Элемент.ПутьКДанным	= "Объект.МатериальныеЗатраты.гкс_ВНаличии";
	
	Элемент	= Элементы.Вставить("гкс_ИнформацияОбОстатках", Тип("ПолеФормы"), Элементы.МатериальныеЗатраты);	
	Элемент.Вид	= ВидПоляФормы.ПолеНадписи; 
	Элемент.ПутьКДанным	= "Объект.МатериальныеЗатраты.гкс_ИнформацияОбОстатках";
	
	// Гкс+[TOIR20-510] Зозуля А.В. от 29.01.2025. Добавлено:{
	Элемент	= Элементы.Вставить("гкс_ТМЦВПути", Тип("ПолеФормы"), Элементы.МатериальныеЗатраты);	
	Элемент.Вид	= ВидПоляФормы.ПолеНадписи; 
	Элемент.ПутьКДанным	= "Объект.МатериальныеЗатраты.гкс_ТМЦВПути";
	// } Гкс-[TOIR20-510] Зозуля А.В. от 29.01.2025.
	
	Элемент	= Элементы.Вставить("гкс_СрокПоставки", Тип("ПолеФормы"), Элементы.МатериальныеЗатраты);	
	Элемент.Вид	= ВидПоляФормы.ПолеНадписи; 
	Элемент.ПутьКДанным	= "Объект.МатериальныеЗатраты.гкс_СрокПоставки";

	Элемент	= Элементы.Вставить("гкс_ДатаСогласованияДО", Тип("ПолеФормы"), Элементы.МатериальныеЗатраты);	
	Элемент.Вид	= ВидПоляФормы.ПолеНадписи; 
	Элемент.ПутьКДанным	= "Объект.МатериальныеЗатраты.гкс_ДатаСогласованияДО";
	
	// Гкс+[TOIR20-528] Вялых Д.А. от 05.02.2025. Добавлено:{	
	Элемент	= Элементы.Вставить("гкс_Отгрузить", Тип("ПолеФормы"), Элементы.МатериальныеЗатраты);	
	Элемент.Вид	= ВидПоляФормы.ПолеФлажка;
	Элемент.ТолькоПросмотр = Истина;
	Элемент.ПутьКДанным	= "Объект.МатериальныеЗатраты.гкс_Отгрузить";
	// } Гкс-[TOIR20-528] Вялых Д.А. от 05.02.2025.
	
	// Гкс+[TOIR20-532] Вялых Д.А. от 10.02.2025. Добавлено:{
	Элемент	= Элементы.Вставить("гкс_ВключенВЗаказ", Тип("ПолеФормы"), Элементы.МатериальныеЗатраты);	
	Элемент.Вид	= ВидПоляФормы.ПолеФлажка;
	//Элемент.Видимость = Истина;
	Элемент.ТолькоПросмотр = Истина;
	Элемент.ПутьКДанным	= "Объект.МатериальныеЗатраты.гкс_ВключенВЗаказ";
	
	Элемент	= Элементы.Вставить("гкс_КоличествоВПеремещении", Тип("ПолеФормы"), Элементы.МатериальныеЗатраты);	
	Элемент.Вид	= ВидПоляФормы.ПолеНадписи;
	Элемент.Видимость = Ложь;
	Элемент.ПутьКДанным	= "Объект.МатериальныеЗатраты.гкс_КоличествоВПеремещении";
	// } Гкс-[TOIR20-532] Вялых Д.А. от 10.02.2025.
	
	Элемент	= Элементы.Вставить("гкс_ВРаботеУОМТС", Тип("ПолеФормы"), Элементы.МатериальныеЗатраты);	
	Элемент.Вид	= ВидПоляФормы.ПолеФлажка;
	Элемент.ТолькоПросмотр = Истина;
	Элемент.ПутьКДанным	= "Объект.МатериальныеЗатраты.гкс_ВРаботеУОМТС";

	Элемент	= Элементы.Вставить("гкс_ДатаЗаказаПоставщику", Тип("ПолеФормы"), Элементы.МатериальныеЗатраты);	
	Элемент.Вид	= ВидПоляФормы.ПолеНадписи; 
	Элемент.ПутьКДанным	= "Объект.МатериальныеЗатраты.гкс_ДатаЗаказаПоставщику";
	
	Элемент	= Элементы.Вставить("гкс_КоличествоВЗаказе", Тип("ПолеФормы"), Элементы.МатериальныеЗатраты);	
	Элемент.Вид	= ВидПоляФормы.ПолеНадписи; 
	Элемент.ПутьКДанным	= "Объект.МатериальныеЗатраты.гкс_КоличествоВЗаказе";
	
	Элемент	= Элементы.Вставить("гкс_ДатаПоставки", Тип("ПолеФормы"), Элементы.МатериальныеЗатраты);	
	Элемент.Вид	= ВидПоляФормы.ПолеНадписи; 
	Элемент.ПутьКДанным	= "Объект.МатериальныеЗатраты.гкс_ДатаПоставки";	
	// } Гкс-[TOIR20-490] Зозуля А.В. от 22.01.2024.
	
	// Гкс+[TOIR20-505] Зозуля А.В. от 16.01.2025. Добавлено:{ 
	НЭлем = Элементы.Добавить("гкс_ГруппаОсновное", Тип("ГруппаФормы"), Элементы.Страницы);
	НЭлем.Вид = ВидГруппыФормы.Страница;
	НЭлем.Заголовок = "Основное";
	Элементы["гкс_ГруппаОсновное"].Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	Элементы.Переместить(Элементы["гкс_ГруппаОсновное"], Элементы.Страницы, Элементы.ГруппаРемонтныеРаботы);	
	// Гкс+[TOIR20-546] Зозуля А.В. от 24.02.2025. Изменено:{
	//Элементы.Переместить(Элементы.ДатаИНомер, Элементы["гкс_ГруппаОсновное"]);
	Элементы.Переместить(Элементы.ДатаИНомер, ЭтотОбъект, Элементы.ГруппаНадписиСогласование);
	// } Гкс-[TOIR20-546] Зозуля А.В. от 24.02.2025.
	Элементы.Переместить(Элементы["гкс_ГруппаНовыеФлажки"], Элементы["гкс_ГруппаОсновное"]);
	Элементы.Переместить(Элементы["гкс_ГруппаНовыеФлажки3"], Элементы["гкс_ГруппаОсновное"]);	
	Элементы.Переместить(Элементы.Организация, Элементы["гкс_ГруппаНовыеФлажки1"], Элементы["гкс_НуженОстанов"]);
	Элементы.Переместить(Элементы.Подразделение, Элементы["гкс_ГруппаНовыеФлажки2"], Элементы["гкс_НуженПодготовка"]);

    Элементы["гкс_СрочностьВоздействия"].МаксимальнаяШирина = 40;
	Элементы["гкс_ПлановаяСтоимостьРемонта"].МаксимальнаяШирина = 5;
	Элементы["гкс_ПлановаяСтоимостьБезДавальческихМатериалов"].МаксимальнаяШирина = 5;
	Элементы["гкс_НуженОстанов"].Заголовок = "Необходима остановка производства";	
	// } Гкс-[TOIR20-505] Зозуля А.В. от 16.01.2025.

КонецПроцедуры
 
&НаСервере
Процедура ДобавитьЭлементыСИЗ()
	
	НовыйЭлемент = Элементы.Добавить("гкс_СИЗСтраница", Тип("ГруппаФормы"), Элементы.ПанельЗатрат);
	НовыйЭлемент.Вид = ВидГруппыФормы.Страница;
	НовыйЭлемент.Заголовок = "СИЗ";
	Элементы.Переместить(Элементы["гкс_СИЗСтраница"], Элементы.ПанельЗатрат, Элементы.ГруппаЗапчасти);
	
	НовыйЭлемент = Элементы.Добавить("гкс_СИЗ", Тип("ТаблицаФормы"), Элементы["гкс_СИЗСтраница"]);
	НовыйЭлемент.ПутьКДАнным = "Объект.гкс_СИЗ";
	НовыйЭлемент.УстановитьДействие("ПередОкончаниемРедактирования", "гкс_СИЗПередОкончаниемРедактирования");
	НовыйЭлемент.УстановитьДействие("ПередНачаломДобавления", "гкс_СИЗПередНачаломДобавления");
	
	НовыйЭлемент = Элементы.Добавить("гкс_СИЗНоменклатура", Тип("ПолеФормы"), Элементы["гкс_СИЗ"]);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДАнным = "Объект.гкс_СИЗ.Номенклатура";
	
	НовыйЭлемент = Элементы.Добавить("гкс_СИЗКоличество", Тип("ПолеФормы"), Элементы["гкс_СИЗ"]);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДАнным = "Объект.гкс_СИЗ.Количество";

КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементыЧасовыеПояса()
	
	гкс_ЧасовыеПоясаВызовСервера.ДобавитьНовыеЭлементы(ЭтотОбъект, Элементы.ДатаИНомер,
	Новый Структура("гкс_РеквизитыДаты", "Дата,РемонтыОборудования.ДатаНачала,РемонтыОборудования.ДатаОкончания" +
	",РемонтыОборудования.КрайняяДопустимаяДатаЗавершенияРемонта"));
	
КонецПроцедуры                         

&НаСервере
Процедура ДобавитьЭлементыКатегорияРиска()
	
	гкс_ОбщегоНазначенияСервер.ДобавитьКатегориюРискаВТЧ(ЭтотОбъект, "РемонтыОборудования", "ДатыНачалаИОкончания");
		
КонецПроцедуры                           

&НаСервере
Процедура ПриОткрытииНаСервере(ДатаКлиента)
	Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда 
		Объект.Дата = ТекущаяДата();
	КонецЕсли;
	гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПКлиента(ЭтотОбъект, 
		"Дата,РемонтыОборудования.ДатаНачала,РемонтыОборудования.ДатаОкончания" +
		",РемонтыОборудования.ДатаНачалаАктуальная,РемонтыОборудования.ДатаОкончанияАктуальная" +
		",РемонтыОборудования.КрайняяДопустимаяДатаЗавершенияРемонтаАктуальная"+
		",РемонтыОборудования.КрайняяДопустимаяДатаЗавершенияРемонта" , , );
		торо_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(Объект, ЭтотОбъект, "");
	
КонецПроцедуры

&НаСервере
Процедура ОткрытьДоступностьПолейДляРоли()
	Элементы.РемонтыОборудованияВидРемонтныхРабот.Доступность = Истина;
	Элементы.РемонтыОборудованияВидРемонтныхРабот.ТолькоПросмотр = Ложь;
	Элементы.РемонтыОборудования.Доступность = Истина;
	Элементы.РемонтыОборудования.ТолькоПросмотр = Ложь;
	Элементы.Страницы.ТолькоПросмотр = Ложь;
	Элементы.ГруппаРемонтныеРаботы.ТолькоПросмотр = Ложь;
	Элементы.ГоризонтальнаяГруппа.ТолькоПросмотр = Ложь;
	Элементы.ОРиВР.ТолькоПросмотр = Ложь;
	Элементы.Подвал.ТолькоПросмотр = Ложь;
	Элементы.ВертикальнаяГруппа.ТолькоПросмотр = Ложь;
	Элементы.ГруппаИсполнителиСтраницы.ТолькоПросмотр = Ложь;
	Элементы.ГруппаИсполнители.ТолькоПросмотр = Ложь;
	Элементы.ИсполнителиПоРемонтамИсполнитель.ТолькоПросмотр = Ложь;
	Элементы.ИсполнителиПоРемонтамУточнениеИсполнителя.ТолькоПросмотр = Ложь;
	Элементы.ГруппаИсполнителиРемонтныхРабот.ТолькоПросмотр = Ложь;
	Элементы.ИсполнителиПоРемонтам.ТолькоПросмотр = Ложь;
КонецПроцедуры

&НаСервере
Процедура гкс_ПроверитьДубльРемонта(Отказ)
	Запрос = Новый Запрос();
	Запрос.Текст = ТекстЗапроса_ДублиРемонта();
	Запрос.УстановитьПараметр("ТЧ1", Объект.РемонтыОборудования.Выгрузить());
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() = Ложь Тогда 
		Отказ = Истина;
		МассивСсылок = Новый Массив();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивСсылок.Добавить(Строка(Выборка.Ссылка));
		КонецЦикла;
		ТекстСообщения = "По ремонту уже есть проведенные заявки: " + СтрСоединить(МассивСсылок, ", ");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция гкс_ТипСпособВыполнения()
	Возврат Тип("ПеречислениеСсылка.СпособыСтроительства");
КонецФункции

&НаКлиенте
Процедура гкс_ПослеВыбораСпособа(Результат, ДопПараметры)Экспорт
	Если Не Результат = Неопределено Тогда 
		гкс_ПослеВыбораСпособаНаСервере(Результат, ДопПараметры);
		РемонтыОборудованияПриАктивизацииСтроки(Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура гкс_ПослеВыбораСпособаНаСервере(Результат, ДопПараметры)
	Для Каждого СтрокаТаблицы ИЗ Объект.РемонтныеРаботы Цикл
		Если СтрокаТаблицы.РемонтыОборудования_ID = ДопПараметры.Ремонт
			И ТипЗнч(СтрокаТаблицы.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда 
			СтрокаТаблицы.гкс_СпособВыполнения = Результат;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбновитьЦеныНоменклатуры(ОтборНоменклатура = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЧ.Номенклатура КАК Номенклатура,
		|	ТЧ.РемонтыОборудования_ID КАК ИД_Ремонта
		|ПОМЕСТИТЬ Исходные
		|ИЗ
		|	&ТЧ КАК ТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Организации.гкс_ВидЦены КАК ВидЦены,
		|	Организации.гкс_ВидЦены.ВалютаЦены КАК Валюта
		|ПОМЕСТИТЬ ОргВидЦены
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.Ссылка = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	ОргВидЦены КАК ОргВидЦены
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|				&Дата,
		|				Номенклатура В
		|					(ВЫБРАТЬ
		|						ТЧ.Номенклатура
		|					ИЗ
		|						Исходные КАК ТЧ)) КАК ЦеныНоменклатурыСрезПоследних
		|		ПО ОргВидЦены.ВидЦены = ЦеныНоменклатурыСрезПоследних.ВидЦены
		|			И ОргВидЦены.Валюта = ЦеныНоменклатурыСрезПоследних.Валюта";
	
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ТЧ", Объект.МатериальныеЗатраты.Выгрузить());
	Если Не ОтборНоменклатура = Неопределено Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТЧ КАК ТЧ","&ТЧ КАК ТЧ Где ТЧ.Номенклатура = &Номенклатура");
		Запрос.УстановитьПараметр("Номенклатура", ОтборНоменклатура);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	СоотНомЦена = Новый Соответствие();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СоотНомЦена.Вставить(Выборка.Номенклатура, Выборка.Цена);
	КонецЦикла;
	
	Если ОтборНоменклатура = Неопределено Тогда 
		Для Каждого СтрокаМатЗатрат Из Объект.МатериальныеЗатраты Цикл
			СтрокаМатЗатрат.гкс_Цена = СоотНомЦена.Получить(СтрокаМатЗатрат.Номенклатура);
		КонецЦикла;
	Иначе
		Для Каждого СтрокаМатЗатрат Из Объект.МатериальныеЗатраты Цикл
			Если СтрокаМатЗатрат.Номенклатура = ОтборНоменклатура Тогда 
				СтрокаМатЗатрат.гкс_Цена = СоотНомЦена.Получить(СтрокаМатЗатрат.Номенклатура);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// гкс+ [] Деснол 12.09.2022
&НаКлиенте
Процедура гкс_ПроецироватьПослеВопроса(Результат, ДопПараметры) Экспорт
	Если Не Результат = Неопределено Тогда 
		Если Результат = "ВР" Тогда 
			СтрокаИсточник = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", ДопПараметры.Источник))[0];
			Для Каждого ИДРемонта Из ДопПараметры.МассивИД Цикл
				СтрокаПриемник = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", ИДРемонта))[0];
				СтрокаПриемник.ВидРемонтныхРабот = СтрокаИсточник.ВидРемонтныхРабот;
			КонецЦикла;
		ИначеЕсли Результат = "Даты" Тогда 
			СтрокаИсточник = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", ДопПараметры.Источник))[0];
			Для Каждого ИДРемонта Из ДопПараметры.МассивИД Цикл
				СтрокаПриемник = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", ИДРемонта))[0];
				СтрокаПриемник.ДатаНачала = СтрокаИсточник.ДатаНачала;
				СтрокаПриемник.ДатаОкончания = СтрокаИсточник.ДатаОкончания;
			КонецЦикла;
		ИначеЕсли Результат = "Операции" Тогда 
			МассивТЧ = Новый Массив();
			МассивТЧ.Добавить("РемонтныеРаботы");
			МассивТЧ.Добавить("МатериальныеЗатраты");
			МассивТЧ.Добавить("ТрудовыеЗатраты");
			МассивТЧ.Добавить("Инструменты");
			МассивТЧ.Добавить("ЗапчастиРемонта");
			МассивТЧ.Добавить("гкс_СИЗ");
			Для Каждого ИмяТЧ Из МассивТЧ Цикл
				Для Каждого ИДРемонта Из ДопПараметры.МассивИД Цикл
					СтрокиРемонта = Объект[ИмяТЧ].НайтиСтроки(Новый Структура("РемонтыОборудования_ID", ИДРемонта));
					Для Каждого СтрокаТаблицы Из СтрокиРемонта Цикл
						Объект[ИмяТЧ].Удалить(Объект[ИмяТЧ].Индекс(СтрокаТаблицы));
					КонецЦикла;
				КонецЦикла;
				СтрокиИсточника = Объект[ИмяТЧ].НайтиСтроки(Новый Структура("РемонтыОборудования_ID", ДопПараметры.Источник));
				Для Каждого ИДРемонта Из ДопПараметры.МассивИД Цикл
					Для Каждого СтрокаИсточника Из СтрокиИсточника Цикл
						НоваяСтрока = Объект[ИмяТЧ].Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаИсточника);
						НоваяСтрока.РемонтыОборудования_ID = ИДРемонта;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла; 
			// гкс+ [12.22] Деснол 13.12.2022
		ИначеЕсли Результат = "Критичность" Тогда 
			СтрокаИсточник = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", ДопПараметры.Источник))[0];
			Для Каждого ИДРемонта Из ДопПараметры.МассивИД Цикл
				СтрокаПриемник = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", ИДРемонта))[0];
				СтрокаПриемник.КритичностьДефекта = СтрокаИсточник.КритичностьДефекта;
			КонецЦикла;
		ИначеЕсли Результат = "Межремонтный" Тогда 
			СтрокаИсточник = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", ДопПараметры.Источник))[0];
			Для Каждого ИДРемонта Из ДопПараметры.МассивИД Цикл
				СтрокаПриемник = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", ИДРемонта))[0];
				СтрокаПриемник.гкс_МежремонтныйПериод = СтрокаИсточник.гкс_МежремонтныйПериод;
			КонецЦикла;
		ИначеЕсли Результат = "Исполнители" Тогда 
			МассивТЧ = Новый Массив();
			МассивТЧ.Добавить("ИсполнителиПоРемонтам");
			Для Каждого ИмяТЧ Из МассивТЧ Цикл
				Для Каждого ИДРемонта Из ДопПараметры.МассивИД Цикл
					СтрокиРемонта = Объект[ИмяТЧ].НайтиСтроки(Новый Структура("РемонтыОборудования_ID", ИДРемонта));
					Для Каждого СтрокаТаблицы Из СтрокиРемонта Цикл
						Объект[ИмяТЧ].Удалить(Объект[ИмяТЧ].Индекс(СтрокаТаблицы));
					КонецЦикла;
				КонецЦикла;
				СтрокиИсточника = Объект[ИмяТЧ].НайтиСтроки(Новый Структура("РемонтыОборудования_ID", ДопПараметры.Источник));
				Для Каждого ИДРемонта Из ДопПараметры.МассивИД Цикл
					Для Каждого СтрокаИсточника Из СтрокиИсточника Цикл
						НоваяСтрока = Объект[ИмяТЧ].Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаИсточника);
						НоваяСтрока.РемонтыОборудования_ID = ИДРемонта;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
			// гкс- [12.22] Деснол 13.12.2022
		// Гкс+[TOIR20-464] Зозуля А.В. от 14.11.2024. Добавлено:{
		ИначеЕсли Результат = "Описание" Тогда 
			СтрокаИсточник = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", ДопПараметры.Источник))[0];
			Для Каждого ИДРемонта Из ДопПараметры.МассивИД Цикл
				СтрокаПриемник = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", ИДРемонта))[0];
				СтрокаПриемник.ОписаниеРемонта = СтрокаИсточник.ОписаниеРемонта;
			КонецЦикла;
		// } Гкс-[TOIR20-464] Зозуля А.В. от 14.11.2024.
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры // гкс- [] Деснол 12.09.2022

&НаСервере
Процедура ОбновитьПлановуюСтоимостьРемонтаНаСервере()
	ОбновитьЦеныНоменклатуры();
	СуммаДавальческие = 0;
	ОбщаяСумма = 0;
	Для Каждого СтрокаТаблицы Из Объект.МатериальныеЗатраты Цикл
		КоэфРемонтнойРаботы = 1;
		СуммаСтроки = СтрокаТаблицы.гкс_Цена * СтрокаТаблицы.Количество * КоэфРемонтнойРаботы;
		ОбщаяСумма = ОбщаяСумма + СуммаСтроки;
		// гкс+ [Релиз17] Деснол
		Если СтрокаТаблицы.гкс_Давальческие Тогда 
			СуммаДавальческие = СуммаДавальческие + СуммаСтроки;
		КонецЕсли;
		// гкс- [Релиз17]
	КонецЦикла;
	

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВнешняяТаблицаИсполнителейРемонтныхРабот0.ВремяРаботы КАК ВремяРаботы,
		|	ВнешняяТаблицаИсполнителейРемонтныхРабот0.Количество КАК Количество,
		|	ВнешняяТаблицаИсполнителейРемонтныхРабот0.Квалификация КАК Квалификация,
		|	ВнешняяТаблицаИсполнителейРемонтныхРабот0.ID КАК ИД
		|ПОМЕСТИТЬ ВнешняяТаблицаИсполнителейРемонтныхРабот
		|ИЗ
		|	&ВнешняяТаблицаИсполнителейРемонтныхРабот0 КАК ВнешняяТаблицаИсполнителейРемонтныхРабот0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВнешняяТаблицаКоэффициентовРемонтныхРабот0.ID КАК ИД,
		|	ВЫРАЗИТЬ(ВнешняяТаблицаКоэффициентовРемонтныхРабот0.гкс_ПовКоэф КАК Справочник.гкс_ПКоэффициентыРабот) КАК гкс_ПовКоэф
		|ПОМЕСТИТЬ ВнешняяТаблицаКоэффициентовРемонтныхРабот
		|ИЗ
		|	&ВнешняяТаблицаКоэффициентовРемонтныхРабот0 КАК ВнешняяТаблицаКоэффициентовРемонтныхРабот0
		|ГДЕ
		|	НЕ ВнешняяТаблицаКоэффициентовРемонтныхРабот0.гкс_ПовКоэф = ЗНАЧЕНИЕ(Справочник.гкс_ПКоэффициентыРабот.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВнешняяТаблицаИсполнителейРемонтныхРабот.ВремяРаботы * 
		|	ЕСТЬNULL(ВнешняяТаблицаКоэффициентовРемонтныхРабот.гкс_ПовКоэф.Коэффициент, 1) КАК ВремяРаботы,
		|	ВнешняяТаблицаИсполнителейРемонтныхРабот.Количество КАК Количество,
		|	ВнешняяТаблицаИсполнителейРемонтныхРабот.Квалификация КАК Квалификация,
		|	ВнешняяТаблицаКоэффициентовРемонтныхРабот.ИД КАК ИД
		|ПОМЕСТИТЬ Исходные
		|ИЗ
		|	ВнешняяТаблицаИсполнителейРемонтныхРабот КАК ВнешняяТаблицаИсполнителейРемонтныхРабот
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВнешняяТаблицаКоэффициентовРемонтныхРабот КАК ВнешняяТаблицаКоэффициентовРемонтныхРабот
		|		ПО ВнешняяТаблицаИсполнителейРемонтныхРабот.ИД = ВнешняяТаблицаКоэффициентовРемонтныхРабот.ИД
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Организации.гкс_ВидЦены КАК ВидЦены,
		|	Организации.гкс_ВидЦены.ВалютаЦены КАК Валюта
		|ПОМЕСТИТЬ ОргВидЦены
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.Ссылка = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_СтоимостьЧасаКвалификацииСрезПоследних.Квалификация КАК Квалификация,
		|	торо_СтоимостьЧасаКвалификацииСрезПоследних.Стоимость КАК Стоимость
		|ПОМЕСТИТЬ ИзРегистра
		|ИЗ
		|	РегистрСведений.торо_СтоимостьЧасаКвалификации.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|				И Квалификация В
		|					(ВЫБРАТЬ
		|						ТЧ.Квалификация
		|					ИЗ
		|						Исходные КАК ТЧ)) КАК торо_СтоимостьЧасаКвалификацииСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОргВидЦены КАК ОргВидЦены
		|		ПО (ОргВидЦены.Валюта = торо_СтоимостьЧасаКвалификацииСрезПоследних.Валюта)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИзРегистра.Стоимость * Исходные.Количество * (Исходные.ВремяРаботы / 3600) КАК Стоимость
		|ИЗ
		|	Исходные КАК Исходные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИзРегистра КАК ИзРегистра
		|		ПО Исходные.Квалификация = ИзРегистра.Квалификация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КурсыВалютСрезПоследних.Кратность КАК Кратность,
		|	КурсыВалютСрезПоследних.Курс КАК Курс
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &ВалютаВывода) КАК КурсыВалютСрезПоследних";

	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ВалютаВывода", Объект.гкс_Валюта);
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("ВнешняяТаблицаИсполнителейРемонтныхРабот0", Объект.ТрудовыеЗатраты.Выгрузить());
	Запрос.УстановитьПараметр("ВнешняяТаблицаКоэффициентовРемонтныхРабот0", Объект.РемонтныеРаботы.Выгрузить());
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ПакетПервый = 5;
	ПакетВторой = ПакетПервый + 1;
	Выборка = РезультатЗапроса[ПакетПервый].Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбщаяСумма = ОбщаяСумма + Выборка.Стоимость;
	КонецЦикла;
	
	Выборка = РезультатЗапроса[ПакетВторой].Выбрать();
	// Теперь на курс не смотрим
	Если Выборка.Следующий() И Не Выборка.Курс = 0 И Ложь Тогда 
		Объект.гкс_ПлановаяСтоимостьРемонта = (ОбщаяСумма / Выборка.Курс) * Выборка.Кратность;
		ВывестиПлановуюСтоимость(Объект.гкс_Валюта);
	Иначе
		Объект.гкс_ПлановаяСтоимостьРемонта = ОбщаяСумма;
		// гкс+ [Релиз17] Деснол
		Объект.гкс_ПлановаяСтоимостьБезДавальческихМатериалов = ОбщаяСумма - СуммаДавальческие;
		// гкс- [Релиз17]
		ВывестиПлановуюСтоимость(Объект.гкс_Валюта);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиПлановуюСтоимость(Валюта = Неопределено)
	Если Валюта = Неопределено Тогда 
		Валюта = Константы.торо_ВалютаРегламентированногоУчета.Получить();
	КонецЕсли;
	ЭтотОбъект["гкс_ПлановаяСтоимостьТекст"] = Строка(Объект.гкс_ПлановаяСтоимостьРемонта) + " " + Валюта.Наименование;
	ЭтотОбъект["гкс_ПлановаяСтоимостьБезДавальческихМатериаловТекст"] = Строка(Объект.гкс_ПлановаяСтоимостьБезДавальческихМатериалов) + " " + Валюта.Наименование;
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("УстановитьУсловноеОформление")
Процедура гкс_УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	// Чтобы не отображалась единица измерения в Материальных затратах, когда заполнена Упаковка.
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.МатериальныеЗатратыНоменклатураЕдиницаИзмерения.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.МатериальныеЗатраты.ЕдиницаИзмерения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("Отображать", Ложь);
	Элемент.Использование = Истина;

	// Чтобы не отображалась единица измерения в Запчастях ремонта, когда заполнена Упаковка.
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗапчастиРемонтаНоменклатураЕдиницаИзмерения.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ЗапчастиРемонта.ЕдиницаИзмерения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("Отображать", Ложь);
	Элемент.Использование = Истина;

	// Чтобы не отображалась единица измерения в Инструментах, когда заполнена Упаковка.
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ИнструментыИнструментЕдиницаИзмерения.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Инструменты.ЕдиницаИзмерения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("Отображать", Ложь);
	Элемент.Использование = Истина;

	//
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.МатериальныеЗатратыХарактеристикаНоменклатуры.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.МатериальныеЗатраты.ХарактеристикиИспользуются");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.НейтральноСерый);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("es='<las características no se usan>';
	|ru='<характеристики не используются>';en='<характеристики не используются>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного",Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность",Ложь);
	Элемент.Использование = Истина;

	//
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗапчастиРемонтаХарактеристикаНоменклатуры.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ЗапчастиРемонта.ХарактеристикиИспользуются");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.НейтральноСерый);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("es='<las características no se usan>';
	|ru='<характеристики не используются>';en='<характеристики не используются>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного",Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность",Ложь);
	Элемент.Использование = Истина;


	// Доступость вида ремонта для редактирования.
	// Доступен если ЭтоПервыйДокументВЦепочке ИЛИ (ЭтоПоследнийДокументВЦепочке И (Докуммент-основание = ВО или ВД)).
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РемонтыОборудованияВидРемонтныхРабот.Имя);

	ГруппаНЕ = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаНЕ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаНе;

	ГруппаЭлементов = ГруппаНЕ.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементов.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	//
	ОтборЭлемента = ГруппаЭлементов.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЭтоПервыйДокументВЦепочке");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;


	//// ИЛИ (	
	ГруппаЭлементовВложенная = ГруппаЭлементов.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовВложенная.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ОтборЭлемента = ГруппаЭлементовВложенная.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.РемонтыОборудования.ТипДокументаОснования");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "торо_ВнешнееОснованиеДляРабот";
	///( И	
	ОтборЭлемента = ГруппаЭлементовВложенная.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЭтоПоследнийДокументВЦепочке");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	//) ИЛИ

	ГруппаЭлементовВложенная = ГруппаЭлементов.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовВложенная.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ОтборЭлемента = ГруппаЭлементовВложенная.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.РемонтыОборудования.ТипДокументаОснования");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "торо_ВыявленныеДефекты";
	///( И	
	ОтборЭлемента = ГруппаЭлементовВложенная.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЭтоПоследнийДокументВЦепочке");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина); 

	//
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоСогласованияСтатусДокумента.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоСогласования.Уровень");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = 0;

	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);

	//
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоСогласованияСогласующий.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоСогласования.Уровень");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = 1;

	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);

	//
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоСогласованияЗамещающий.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоСогласования.Уровень");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = 2;

	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);

	// ТолькоПросмотр корня дерева ремонтных работ 
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоРемонтныхРаботРемонтнаяРабота.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоРемонтныхРабот.РемонтнаяРабота");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	#Удаление
	ОтборЭлемента.ПравоеЗначение = "Ремонтные работы";
	#КонецУдаления
	#Вставка
	ОтборЭлемента.ПравоеЗначение = дс_ПолучитьПредставлениеКорневойРемонтнойРаботы();
	#КонецВставки

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	//
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РемонтыОборудования.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.РемонтыОборудования.ПодходитПодОтбор");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Представление = "ВидимостьРемонта";
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Серый);
	Элемент.Использование = Ложь;

	//
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоРемонтныхРабот.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоРемонтныхРаботРемонтнаяРабота.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоРемонтныхРаботТехОперацияБазоваяЕдиницаИзмерения.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();       	
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоРемонтныхРаботИсполнитель.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоРемонтныхРабот.ПодходитПодОтбор");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Представление = "ВидимостьРемонтнойРаботы";
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Серый);
	Элемент.Использование = Ложь;

	//
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоРемонтныхРаботИсполнитель.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоРемонтныхРаботДоговорБригада.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоРемонтныхРабот.ЭтоТехКарта");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Представление = "ДоступностьИсполнителяДляТехОперации";
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр",Истина);
	#Удаление
	Элемент.Использование = Истина;
	#КонецУдаления
	#Вставка
	// гкс+ [Релиз16] Деснол
	Элемент.Использование = Ложь; // гкс- [Релиз16]
	гкс_ОбщегоНазначенияСервер.ДобавитьУОКатегорииРиска(ЭтотОбъект);
	гкс_ОбщегоНазначенияСервер.гкс_ДобавитьУсловноеОформлениеДереваРР(ЭтотОбъект);
	
	// Гкс+[TOIR20-532] Вялых Д.А. от 10.02.2025. Добавлено:{ 
	Элемент = УсловноеОформление.Элементы.Добавить();
    //Элемент.Использование = Истина;
	Элемент.Использование = Ложь;
	Элемент.Представление = "УО_ДляДанныхЕРП2";
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
    ПолеЭлемента.Использование = Истина;
    ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.МатериальныеЗатратыКоличество.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.МатериальныеЗатраты.Количество"); 
    ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
    ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект.МатериальныеЗатраты.гкс_КоличествоВПеремещении");
    ОтборЭлемента.Использование = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(175, 0, 0)); // темно-красный
 	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255, 235, 222)); // светло-розовый 
	
	Элемент = УсловноеОформление.Элементы.Добавить();
    //Элемент.Использование = Истина;
	Элемент.Использование = Ложь;
	Элемент.Представление = "УО_ДляДанныхЕРП2";
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
    ПолеЭлемента.Использование = Истина;
    ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.МатериальныеЗатратыНоменклатура.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.МатериальныеЗатраты.гкс_ВключенВЗаказ"); 
    ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
    ОтборЭлемента.ПравоеЗначение = Истина;
    ОтборЭлемента.Использование = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(175, 0, 0)); // темно-красный
 	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255, 235, 222)); // светло-розовый
	// } Гкс-[TOIR20-532] Вялых Д.А. от 10.02.2025.
	
	#КонецВставки

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ЗаполнитьДеревоРемонтныхРаботНаСервере")
Процедура гкс_ЗаполнитьДеревоРемонтныхРаботНаСервере(РемонтыОборудования_ID)

	ДеревоСФормы = РеквизитФормыВЗначение("ДеревоРемонтныхРабот");

	ДеревоСФормы.Строки.Очистить();

	КорневаяСтрока = ДеревоСФормы.Строки.Добавить();
	#Удаление
	КорневаяСтрока.РемонтнаяРабота = "Ремонтные работы";	
	#КонецУдаления
	#Вставка
	КорневаяСтрока.РемонтнаяРабота = дс_ПолучитьПредставлениеКорневойРемонтнойРаботы();
	#КонецВставки
	КорневаяСтрока.Картинка = 4;

	Если Не РемонтыОборудования_ID = Неопределено Тогда
		ТЗРемонтныеРаботы = Объект.РемонтныеРаботы.Выгрузить(Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", РемонтыОборудования_ID)));
	Иначе
		ТЗРемонтныеРаботы = Неопределено;
	КонецЕсли;                                                       

	СоздатьВетвьДереваПоТЧ(КорневаяСтрока, ТЗРемонтныеРаботы);

	ЗначениеВРеквизитФормы(ДеревоСФормы, "ДеревоРемонтныхРабот");

КонецПроцедуры

&НаСервере
Процедура ОбновитьСимптомДефекта()
	Если Объект.РемонтыОборудования.Количество() > 0 Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ТЧ.ID КАК ИД
			|ПОМЕСТИТЬ Исходные
			|ИЗ
			|	&ТЧ КАК ТЧ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	торо_ВыявленныеДефектыСписокДефектов.гкс_СимптомДефекта КАК Симптом,
			|	Исходные.ИД КАК ИД
			|ИЗ
			|	Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Исходные КАК Исходные
			|		ПО торо_ВыявленныеДефектыСписокДефектов.ID = Исходные.ИД";
		Запрос.УстановитьПараметр("ТЧ",Объект.РемонтыОборудования.Выгрузить(,"ID"));
		РезультатЗапроса = Запрос.Выполнить();	
		Если РезультатЗапроса.Пустой() = Ложь Тогда 
			Выборка = РезультатЗапроса.Выбрать();				
			Для Каждого СтрокаТаблицы Из Объект.РемонтыОборудования Цикл
				Если Выборка.НайтиСледующий(Новый Структура("ИД", СтрокаТаблицы.ID)) Тогда 
					СтрокаТаблицы.гкс_СимптомДефекта = Выборка.Симптом;
				КонецЕсли;
				Выборка.Сбросить();
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ОбновитьОстановочные")
Процедура гкс_ОбновитьОстановочные(IDРемонта)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	торо_АктуальныеПлановыеДатыРемонтов.IDРемонта КАК ID,
	|	торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала КАК ДатаНачала,
	|	торо_АктуальныеПлановыеДатыРемонтов.ДатаОкончания КАК ДатаОкончания,
	|	торо_АктуальныеПлановыеДатыРемонтов.КрайняяДатаЗавершения КАК КрайняяДатаЗавершения,
	|	торо_АктуальныеПлановыеДатыРемонтов.ДокументОснование КАК ДокументОснование
	|ПОМЕСТИТЬ ВТ_АктуальныеДаты
	|ИЗ
	|	РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК торо_АктуальныеПлановыеДатыРемонтов
	|ГДЕ
	|	торо_АктуальныеПлановыеДатыРемонтов.IDРемонта В(&ID)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ОстановочныеРемонтыСрезПоследних.IDЗависимого КАК ID,
	|	торо_ОстановочныеРемонтыСрезПоследних.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТ_Остановочные
	|ИЗ
	|	РегистрСведений.торо_ОстановочныеРемонты.СрезПоследних(, IDЗависимого В (&ID)) КАК торо_ОстановочныеРемонтыСрезПоследних
	|ГДЕ
	|	НЕ торо_ОстановочныеРемонтыСрезПоследних.Отвязан
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ID КАК ID
	|ПОМЕСТИТЬ ВТ_ОтмененныеРемонты
	|ИЗ
	|	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(
	|			,
	|			ID В
	|				(ВЫБРАТЬ
	|					ВТ_АктуальныеДаты.ID КАК ID
	|				ИЗ
	|					ВТ_АктуальныеДаты КАК ВТ_АктуальныеДаты)) КАК торо_ПлановыеРемонтныеРаботыСрезПоследних
	|ГДЕ
	|	(торо_ПлановыеРемонтныеРаботыСрезПоследних.Отменен
	|			ИЛИ торо_ПлановыеРемонтныеРаботыСрезПоследних.Замещен)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	торо_ОтмененныеРемонтыСрезПоследних.ID
	|ИЗ
	|	РегистрСведений.торо_ОтмененныеРемонты.СрезПоследних(
	|			,
	|			ID В
	|				(ВЫБРАТЬ
	|					ВТ_АктуальныеДаты.ID КАК ID
	|				ИЗ
	|					ВТ_АктуальныеДаты КАК ВТ_АктуальныеДаты)) КАК торо_ОтмененныеРемонтыСрезПоследних
	|ГДЕ
	|	торо_ОтмененныеРемонтыСрезПоследних.Отменен
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_АктуальныеДаты.ID КАК ID,
	|	ВТ_АктуальныеДаты.ДатаНачала КАК ДатаНачалаАктуальная,
	|	ВТ_АктуальныеДаты.ДатаОкончания КАК ДатаОкончанияАктуальная,
	|	ВТ_АктуальныеДаты.КрайняяДатаЗавершения КАК КрайняяДопустимаяДатаЗавершенияРемонтаАктуальная,
	|	ВТ_АктуальныеДаты.ДокументОснование КАК ДокументОснование,
	|	ВТ_Остановочные.Регистратор КАК ВРамкахОстановочного
	|ИЗ
	|	ВТ_АктуальныеДаты КАК ВТ_АктуальныеДаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остановочные КАК ВТ_Остановочные
	|		ПО ВТ_АктуальныеДаты.ID = ВТ_Остановочные.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтмененныеРемонты КАК ВТ_ОтмененныеРемонты
	|		ПО ВТ_АктуальныеДаты.ID = ВТ_ОтмененныеРемонты.ID
	|ГДЕ
	|	ВТ_ОтмененныеРемонты.ID ЕСТЬ NULL";

	Запрос = Новый Запрос(ТекстЗапроса);

	Если IDРемонта = Неопределено Тогда
		Запрос.УстановитьПараметр("ID", Объект.РемонтыОборудования.Выгрузить().ВыгрузитьКолонку("ID"));
	Иначе
		Запрос.УстановитьПараметр("ID", IDРемонта);
	КонецЕсли;

	Выборка = Запрос.Выполнить().Выбрать();

	Для каждого Строка Из Объект.РемонтыОборудования Цикл

		Если Выборка.НайтиСледующий(Новый Структура("ID", Строка.ID)) Тогда
			ЗаполнитьЗначенияСвойств(Строка, Выборка);
		Иначе
			Строка.ДатаНачалаАктуальная    = Неопределено;
			Строка.ДатаОкончанияАктуальная = Неопределено;
			Строка.КрайняяДопустимаяДатаЗавершенияРемонтаАктуальная = Неопределено;
			Строка.ВРамкахОстановочного = Неопределено;
		КонецЕсли; 

		Выборка.Сбросить();

	КонецЦикла; 
	#Вставка
	СтруктураПроверки = Новый Структура("гкс_СдвигЧП", Неопределено);
	ЗаполнитьЗначенияСвойств(СтруктураПроверки, ЭтотОбъект);
	Если Не СтруктураПроверки.гкс_СдвигЧП = Неопределено Тогда 
		гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПКлиента(ЭтотОбъект,
			"РемонтыОборудования.ДатаНачалаАктуальная,РемонтыОборудования.ДатаОкончанияАктуальная," +
			"РемонтыОборудования.КрайняяДопустимаяДатаЗавершенияРемонтаАктуальная", Объект);
	КонецЕсли;
	#КонецВставки 
	
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("РасчетОкончанияРемонта")
Функция гкс_РасчетОкончанияРемонта(мГрафикРаботы, мДатаНачала, мПродолжительностьРемонта)

	ТекущаяДатаРемонта = мДатаНачала;
	ОставшаясяПродолжительность=мПродолжительностьРемонта;
	пВремяНачалаБлокаРемонтныхРабот = ТекущаяДатаРемонта - НачалоДня(ТекущаяДатаРемонта);

	Пока ОставшаясяПродолжительность > 0 Цикл
		МассивДат = Новый Массив;
		МассивДат.Добавить(ТекущаяДатаРемонта);
		ДатыРабочихДней = КалендарныеГрафики.ДатыБлижайшихРабочихДней(мГрафикРаботы, МассивДат);

		Если ДатыРабочихДней.Количество() >0 Тогда

			// Если рабочий день
			Если ДатыРабочихДней[НачалоДня(ТекущаяДатаРемонта)] = НачалоДня(ТекущаяДатаРемонта) Тогда 

				Выборка = ПолучитьСменыНаУказанныйДень(ТекущаяДатаРемонта,мГрафикРаботы).Выбрать();
				КоличествоОставшихсяСмен = Выборка.Количество();
				#Вставка
				ПроверкаОкончанияСмены = Ложь;
				#КонецВставки

				Пока КоличествоОставшихсяСмен <> 0 Цикл
					Выборка.Следующий();
					ПроверкаОкончанияСмены = Выборка.ВремяОкончания - '00010101'=86400;

					Если пВремяНачалаБлокаРемонтныхРабот < (Выборка.ВремяНачала - '00010101') Тогда
						// Сдвигаем текущую дату на начало этой смены.
						ТекущаяДатаРемонта = ТекущаяДатаРемонта + (Выборка.ВремяНачала - '00010101' - пВремяНачалаБлокаРемонтныхРабот);
						пВремяНачалаБлокаРемонтныхРабот = ТекущаяДатаРемонта - НачалоДня(ТекущаяДатаРемонта);
					КонецЕсли;

					Если пВремяНачалаБлокаРемонтныхРабот < (Выборка.ВремяОкончания - '00010101') Тогда

						пДлительностьБлока = Выборка.ВремяОкончания - '00010101' - пВремяНачалаБлокаРемонтныхРабот;

						Если ОставшаясяПродолжительность > пДлительностьБлока Тогда
							// Уменьшаем оставшуюся продолжительность на время смены и сдвигаем текущую дату на конец текущей смены.
							ОставшаясяПродолжительность = ОставшаясяПродолжительность - пДлительностьБлока;
							ТекущаяДатаРемонта = ТекущаяДатаРемонта + (Выборка.ВремяОкончания - '00010101' - пВремяНачалаБлокаРемонтныхРабот);
							пВремяНачалаБлокаРемонтныхРабот = ТекущаяДатаРемонта - НачалоДня(ТекущаяДатаРемонта);
						Иначе
							ТекущаяДатаРемонта = ТекущаяДатаРемонта + ОставшаясяПродолжительность;
							ОставшаясяПродолжительность = 0;
							Прервать;
						КонецЕсли;

					КонецЕсли;
					КоличествоОставшихсяСмен = КоличествоОставшихсяСмен - 1;
				КонецЦикла;
				Если КоличествоОставшихсяСмен = 0 и НЕ ПроверкаОкончанияСмены Тогда
					// Берем следующий день
					ТекущаяДатаРемонта = КонецДня(ТекущаяДатаРемонта) + 1;
					пВремяНачалаБлокаРемонтныхРабот = ТекущаяДатаРемонта - НачалоДня(ТекущаяДатаРемонта);
				КонецЕсли;

				// Если выходной
			Иначе  
				// Берем ближайший рабочий день
				ТекущаяДатаРемонта = ДатыРабочихДней[НачалоДня(ТекущаяДатаРемонта)]; 
				пВремяНачалаБлокаРемонтныхРабот = ТекущаяДатаРемонта - НачалоДня(ТекущаяДатаРемонта);
			КонецЕсли;

			// Если график не заполнен	
		Иначе 
			ТекущаяДатаРемонта = '00010101';
			Прервать;

		КонецЕсли;
	КонецЦикла; 
	Возврат ТекущаяДатаРемонта;
КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьТКНаСервере(МассивТК)
	МассивВозврата = Новый Массив();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Проверяемые.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.торо_ИдентификаторыТехКарт КАК Проверяемые
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ИдентификаторыТехКарт КАК торо_ИдентификаторыТехКарт
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ИдентификаторыТехКарт КАК Родитель1
		|			ПО торо_ИдентификаторыТехКарт.Родитель = Родитель1.Ссылка
		|		ПО Проверяемые.Родитель = торо_ИдентификаторыТехКарт.Ссылка
		|ГДЕ
		|	Проверяемые.Ссылка В(&Родитель)
		|	И Родитель1.Родитель = ЗНАЧЕНИЕ(Справочник.торо_ИдентификаторыТехКарт.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Родитель", МассивТК);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() = Ложь Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивВозврата.Добавить(Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивВозврата;
КонецФункции

&НаСервере
Функция гкс_ПолучитьСпособСогласования(Орг, ОР)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ОбъектыРемонта.Подразделение КАК Подразделение
		|ИЗ
		|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|ГДЕ
		|	торо_ОбъектыРемонта.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ОР);
	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() 
		ИЛИ торо_РаботаССогласованиями.гкс_ПоДокументуЕстьИстория(Объект.Ссылка) Тогда 

		Возврат Неопределено;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
		
	ПодрИсп = Справочники.СтруктураПредприятия.ПустаяСсылка();
	Если Объект.ИсполнителиПоРемонтам.Количество() 
		И ТипЗнч(Объект.ИсполнителиПоРемонтам[0].Исполнитель) = Тип("СправочникСсылка.СтруктураПредприятия") Тогда 
		ПодрИсп = Объект.ИсполнителиПоРемонтам[0].Исполнитель;
	КонецЕсли;
	Возврат торо_РаботаССогласованиями.гкс_ПолучитьСпособСогласованияПоУмолчанию(
		Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_ЗаявкаНаРемонт,
		Орг, Выборка.Подразделение, ПодрИсп);
КонецФункции

// Гкс+[TOIR20-144] Селимов 
&НаСервере
Функция ФайлДОСуществует()
	ВнешнийОбъект = Объект.Ссылка.ПолучитьОбъект();
	Файлы = ИнтеграцияС1СДокументооборотВызовСервера.ФайлыПоОбъектуПотребителю(
			Объект.Ссылка.УникальныйИдентификатор(),
			Строка(ВнешнийОбъект),
			ВнешнийОбъект.Метаданные().ПолноеИмя());
			
	ФайлыСуществуют = ТипЗнч(Файлы) = Тип("ОбъектXDTO") И Файлы.files.Количество() > 0;
			
	Возврат ФайлыСуществуют;		
	
КонецФункции // } Гкс-[TOIR20-144] 

// Гкс+[TOIR20-142] Борисов 
&НаКлиенте
Процедура ПослеЗакрытияВопросаОСоздании(Результат, ОписаниеОповещения) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Если ОписаниеОповещения.Команда = "СоздатьЗаказПоставщику" Тогда
		СоздатьДокументВЕРП2("Документ_ЗаказПоставщику_Отправка_mdm");	
	ИначеЕсли ОписаниеОповещения.Команда = "СоздатьЗаявкуНаПеремещение" Тогда
		СоздатьДокументВЕРП2("Документ_ЗаказНаПеремещение_Отправка_mdm");	
	КонецЕсли; // } Гкс-[TOIR20-144]
	ПоказатьОповещениеПользователя(НСтр("ru = 'Документ отправлен в базу ERP'"),
								, , , СтатусОповещенияПользователя.Информация);
								
КонецПроцедуры // } Гкс-[TOIR20-142] 

// Гкс+[TOIR20-144] Селимов 
&НаСервере
Процедура СоздатьДокументВЕРП2(ИмяПКО)
	
	ДокументОбъект = Объект.Ссылка.ПолучитьОбъект();
	ДокументОбъект.ДополнительныеСвойства.Вставить("ИспользованиеПКО", ИмяПКО);
	гкс_ОчередьСообщенийRMQ.ПриЗаписиДокументовСинхронизацииRMQ(ДокументОбъект, Ложь);
	
КонецПроцедуры // } Гкс-[TOIR20-144] 

// Гкс+[TOIR20-140] Борисов 
&НаСервере
Функция ПолучитьНавигационнуюСсылкуФормыСпискаЗаказовНаПеремещение(ТекущаяНоменклатура)
	
	// Гкс+[TOIR20-523] Вялых Д.А. от 29.01.2025. Добавлено и закомментировано:{  
	НавигационнаяСсылкаНаДокумент = гкс_ИнтеграцияERP2.ПолучитьНавигационнуюСсылкуЗаказаНаПеремещение(Объект.Ссылка, ТекущаяНоменклатура);
	
	Если ЗначениеЗаполнено(НавигационнаяСсылкаНаДокумент) Тогда 
		ГлобальнаяНавигационнаяСсылка = Константы.гкс_НавигационнаяСсылкаСписокЗаказовНаПеремещениеERP.Получить();
		ИтоговаяНавигационнаяСсылка = Лев(ГлобальнаяНавигационнаяСсылка, СтрНайти(ГлобальнаяНавигационнаяСсылка, "#")) + НавигационнаяСсылкаНаДокумент; 
	Иначе
		Сообщить("Не удалось получить навигационную ссылку по причине:" + Символы.ПС +
		"Документ не найден на стороне ERP2");	
	КонецЕсли;
	
	Возврат ИтоговаяНавигационнаяСсылка;
	
	//УстановитьПривилегированныйРежим(Истина);
	//Возврат Константы.гкс_НавигационнаяСсылкаСписокЗаказовНаПеремещениеERP.Получить();
	// } Гкс-[TOIR20-523] Вялых Д.А. от 29.01.2025.
	
КонецФункции // } Гкс-[TOIR20-140]

&НаСервере
Функция СредиИсполнителейЕстьКонтрагент()
	Для Каждого СТ Из Объект.ИсполнителиПоРемонтам Цикл
		Если ТипЗнч(СТ.Исполнитель) = Тип("СправочникСсылка.Контрагенты") Тогда 
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

&НаСервере
Процедура гкс_ИзменитьВидимостьКнопкиОтправкиНаСогласование()
	гкс_ОбщегоНазначенияСервер.ИзменитьВидимостьКнопкиОтправкиНаСогласование(Элементы["гкс_ОтправитьНаСогласование"],СтатусДокументаРегистр);
КонецПроцедуры

&НаСервере
Процедура ДобавитьУОКатегорииРискаНаСервере()
	гкс_ОбщегоНазначенияСервер.ДобавитьУОКатегорииРиска(ЭтотОбъект);	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаливкуЗаголовка()
	ТекДанные = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если НЕ ТекДанные = Неопределено И ТекДанные.гкс_ЦветКР > 0 Тогда 
		Элементы["гкс_КатегорияРиска"].ЦветФонаЗаголовка = ТекДанные.гкс_КатегорияРискаЦвет;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("УстановитьОтборыСвязанныхТаблицРемонты")
Процедура гкс_УстановитьОтборыСвязанныхТаблицРемонты(ID)

	Элементы.ЗапчастиРемонта.ОтборСтрок = Новый ФиксированнаяСтруктура("РемонтыОборудования_ID",ID);
	Элементы.ДокументыЗаказНаВнПотребление.ОтборСтрок = Новый ФиксированнаяСтруктура("ID",ID);
	Элементы.ИсполнителиПоРемонтам.ОтборСтрок = Новый ФиксированнаяСтруктура("РемонтыОборудования_ID", ID);
	#Вставка
	Элементы["гкс_СИЗ"].ОтборСтрок = Новый ФиксированнаяСтруктура("РемонтыОборудования_ID",ID);
	#КонецВставки

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("УстановитьДоступностьДляРедактированияПоТекРемонту")
Процедура гкс_УстановитьДоступностьДляРедактированияПоТекРемонту(БлокироватьДляИзменения, ОбъектРемонта)

	ПризнакВестиУчетСерийныхЗапчастей = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектРемонта, "ВестиУчетСерийныхЗапчастей");

	Элементы.ДеревоРемонтныхРабот.ТолькоПросмотр			= БлокироватьДляИзменения Или Не ПравоРедактирование ИЛИ ЭтаФорма["СогласованиеТолькоПросмотр"];
	Элементы.МатериальныеЗатраты.ТолькоПросмотр				= БлокироватьДляИзменения Или Не ПравоРедактирование ИЛИ ЭтаФорма["СогласованиеТолькоПросмотр"];
	Элементы.ДокументыЗаказНаВнПотребление.ТолькоПросмотр	= БлокироватьДляИзменения Или Не ПравоРедактирование;
	Элементы.ТрудовыеЗатраты.ТолькоПросмотр					= БлокироватьДляИзменения Или Не ПравоРедактирование ИЛИ ЭтаФорма["СогласованиеТолькоПросмотр"];
	Элементы.Инструменты.ТолькоПросмотр						= БлокироватьДляИзменения Или Не ПравоРедактирование ИЛИ ЭтаФорма["СогласованиеТолькоПросмотр"];
	Элементы.ИсполнителиПоРемонтам.ТолькоПросмотр		= БлокироватьДляИзменения Или Не ПравоРедактирование ИЛИ ЭтаФорма["СогласованиеТолькоПросмотр"];
	Элементы.ЗапчастиРемонта.ТолькоПросмотр					= БлокироватьДляИзменения Или Не ПравоРедактирование ИЛИ ЭтаФорма["СогласованиеТолькоПросмотр"] 
	ИЛИ НЕ ПризнакВестиУчетСерийныхЗапчастей;
	Элементы.МерыБезопасности.ТолькоПросмотр				= БлокироватьДляИзменения Или Не ПравоРедактирование ИЛИ ЭтаФорма["СогласованиеТолькоПросмотр"];

	Элементы.ДокументыЗаказНаВнПотребелениеДобавитьЗаказ.Доступность				= Не БлокироватьДляИзменения И ПравоРедактирование И ПравоИнтерактивноеДобавлениеЗаказовНаВнутреннееПотребление;
	Элементы.ДокументыЗаказНаВнПотребелениеУдалитьЗаказНаВнПотребление.Доступность	= Не БлокироватьДляИзменения И ПравоРедактирование И ПравоИнтерактивнаяПометкаУдаленияЗаказовНаВнутреннееПотребление;
	Элементы.ДокументыЗаказНаВнПотреблениеСводныйДокументВнутреннееПотребление.Доступность = Не БлокироватьДляИзменения И ПравоРедактирование И ПравоИнтерактивноеДобавлениеЗаказовНаВнутреннееПотребление;
	Элементы.ДеревоРемонтныхРаботДобавитьТехКарту.Доступность						= Не БлокироватьДляИзменения И ПравоРедактирование И НЕ ЭтаФорма["СогласованиеТолькоПросмотр"];
	Элементы.ДеревоРемонтныхРаботДобавитьТехОперацию.Доступность					= Не БлокироватьДляИзменения И ПравоРедактирование И НЕ ЭтаФорма["СогласованиеТолькоПросмотр"];

	ДоступностьПодбораЗапчастей = НЕ Элементы.ЗапчастиРемонта.ТолькоПросмотр;
	Элементы.ЗапчастиРемонтаПодборНоменклатуры.Доступность = ДоступностьПодбораЗапчастей;
	#Вставка
	Элементы["гкс_ОбновитьТехкартыРемонтаКнопка"].Доступность						= Не БлокироватьДляИзменения И ПравоРедактирование И НЕ ЭтаФорма["СогласованиеТолькоПросмотр"];
	Если РольДоступнаНаСервере("гкс_ИзменениеПроведеннойЗаявки") Тогда 
		Элементы.ИсполнителиПоРемонтам.ТолькоПросмотр = Ложь;
	КонецЕсли;
	#КонецВставки

КонецПроцедуры

&НаСервереБезКонтекста
Функция РольДоступнаНаСервере(Имя)
	Возврат РольДоступна(Имя);
КонецФункции

// Гкс+[TOIR20-158] Селимов 
&НаСервере
Функция СозданНаОснованииВнешнегоОснованияДляРабот()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ИСТИНА КАК Поле1
		|ИЗ
		|	Документ.торо_ЗаявкаНаРемонт.ДокументыОснования КАК ДокОснования
		|ГДЕ
		|	ДокОснования.Ссылка = &Ссылка
		|	И ДокОснования.ДокументОснование ССЫЛКА Документ.торо_ВнешнееОснованиеДляРабот";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции // } Гкс-[TOIR20-158] 

&НаСервереБезКонтекста
Функция гкс_ВалютаОрганизации(Ссылка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Организации.гкс_ВидЦены.ВалютаЦены КАК Валюта
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() = ложь Тогда 
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Валюта;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура гкс_УстановитьПКоэфОбработкаВыбора(Результат, ДопПараметры)Экспорт
	Если Не Результат = Неопределено Тогда 
		Для Каждого СтрокаМассива Из Результат Цикл
			Для Каждого СтрокаТаблицы Из Объект.РемонтныеРаботы Цикл
				Если ДопПараметры.ИдРемонта = СтрокаТаблицы.РемонтыОборудования_ID
					И СтрокаМассива.ИД = СтрокаТаблицы.ID Тогда 
					СтрокаТаблицы.гкс_ПовКоэф = СтрокаМассива.гкс_ПовКоэф;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;

		РемонтыОборудованияПриАктивизацииСтроки(Элементы.РемонтыОборудования);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура гкс_РемонтныеРаботыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "Деревогкс_ПовКоэф" Тогда 
		ТекДанные = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
		Если Не ТекДанные = Неопределено 
		И гкс_ЭтоТО(ТекДанные.РемонтнаяРабота) Тогда 
		ОписаниеОп = Новый ОписаниеОповещения("УстановитьВыбраннымПослеВыбора", ЭтотОбъект);
		ОткрытьФорму("Справочник.гкс_ПКоэффициентыРабот.ФормаВыбора",, ЭтотОбъект,,,, 
				ОписаниеОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция гкс_ЭтоТО(Ссылка)
	Возврат ТипЗнч(Ссылка) = Тип("СправочникСсылка.торо_ТехнологическиеОперации");
КонецФункции

&НаКлиенте
Процедура УстановитьВыбраннымПослеВыбора(Результат, ДопПараметры)Экспорт
	Если ЗначениеЗаполнено(Результат) Тогда 
		ТекДанные = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
		Если Не ТекДанные = Неопределено Тогда 
			НайдСтроки = Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("ID,РемонтыОборудования_ID"
				, ТекДанные.ID, ТекДанные.РемонтыОборудования_ID));
			Если НайдСтроки.Количество() Тогда 
				Модифицированность = Истина;
				ТекДанные.гкс_ПовКоэф = Результат;
				Для Каждого СТрокаМассива Из НайдСтроки Цикл
					СТрокаМассива.гкс_ПовКоэф = Результат;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыДляПроверки(МассивСтруктур)
	
	МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "Организация", НСтр("ru='Организация';en='Organization'")));
	МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "Подразделение", НСтр("ru='Подразделение';en='Subdivision'")));
	МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "Ответственный", НСтр("ru='Ответственный';en='Responsible'")));
	
	МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "гкс_НуженОстанов",
		НСтр("ru='Необходим останов производства';en='Production shutdown required'")));
	МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "гкс_НуженПодготовка",
		НСтр("ru='Необходима подготовка (чистка, дренирование, отключение) ОР к ремонту';
		|en='Preparation is required (cleaning, drainage, shutdown) of OR for repair'")));
	МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "гкс_РаботаПовышеннойОпасности",
		НСтр("ru='Работа повышенной опасности (необходим наряд допуск)';
		|en='High-risk work (special work order)'")));
			
	// Гкс+[TOIR20-527] Вялых Д.А. от 06.02.2025. Добавлено:{
	МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "гкс_РаботыТСПожаротушения",
		"Работы связанные с техническими средствами пожаротушения"));
	// } Гкс-[TOIR20-527] Вялых Д.А. от 06.02.2025.
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнениеРеквизитовШапки(МассивСтруктур, Отказ)
	
	Для Каждого СтрокаМассива Из МассивСтруктур Цикл
		Если Не ЗначениеЗаполнено(Объект[СтрокаМассива.Имя]) Тогда 
			Сообщение = Новый СообщениеПользователю();
			ШаблонСообщения = НСтр("ru='Поле ""%1"" не заполнено';en='Field %1 is empty'");
			Сообщение.Текст = СтрШаблон(ШаблонСообщения, СтрокаМассива.Текст);
			Сообщение.Поле = "Объект." + СтрокаМассива.Имя;
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;	

КонецПроцедуры 

&НаКлиенте
Процедура ПроверитьЗаполнениеРемонтовОборудования(МассивСтруктур, Отказ)
	
	Если Объект.РемонтыОборудования.Количество() = 0 Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='В документе не указан ОР';en='The document does not specify an OR'");
		Сообщение.Сообщить();
		Отказ = Истина;
	Иначе
		МассивСтруктур = новый Массив();
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "ОбъектРемонта",
			НСтр("ru='Объект ремонта';en='Object of repair'")));
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "ВидРемонтныхРабот", 
			НСтр("ru='Вид ремонтных работ';en='Type of repair work'")));
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "ДатаНачала",
			НСтр("ru='Дата начала';en='Start date'")));
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "ДатаОкончания",
			НСтр("ru='Дата окончания';en='End date'")));
		Для Каждого СтрокаМассива Из МассивСтруктур Цикл
			НомерПП = 0;
			Для Каждого СтрокаТаблицы Из Объект.РемонтыОборудования Цикл
				Если Не ЗначениеЗаполнено(СтрокаТаблицы[СтрокаМассива.Имя]) Тогда 
					Сообщение = Новый СообщениеПользователю();
					ШаблонСообщения = НСтр("ru='Поле ""%1"" не заполнено';en='Field %1 is empty'");
					Сообщение.Текст = СтрШаблон(ШаблонСообщения, СтрокаМассива.Текст);
					Сообщение.Поле = "Объект.РемонтыОборудования[" + НомерПП + "]." + СтрокаМассива.Имя;
					Сообщение.Сообщить();
					Отказ = Истина;
				КонецЕсли;
				НомерПП = НомерПП + 1;
			КонецЦикла;
		КонецЦикла;
		НомерПП = 0;
		Для Каждого СтрокаТаблицы Из Объект.РемонтыОборудования Цикл
			Если СтрокаТаблицы.ДатаНачала > СтрокаТаблицы.ДатаОкончания Тогда 
				Сообщение = Новый СообщениеПользователю();
				ШаблонСообщения = НСтр("ru='Дата окончания должна быть больше даты начала';en='The end date must be greater than the start date'");
				Сообщение.Текст = ШаблонСообщения;
				Сообщение.Поле = "Объект.РемонтыОборудования[" + НомерПП + "].ДатаОкончания";
				Сообщение.Сообщить();
				Отказ = Истина;
			КонецЕсли;
			НомерПП = НомерПП + 1;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры   

&НаКлиенте
Процедура ПроверитьЗаполнениеМатериальныхЗатрат(МассивСтруктур, Отказ)
	
	Если Объект.МатериальныеЗатраты.Количество() Тогда 
		МассивСтруктур = новый Массив();
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "Количество",
			НСтр("ru='Количество';en='Count'")));
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "Номенклатура", 
			НСтр("ru='Номенклатура';en='Nomenclature'")));
		Для Каждого СтрокаМассива Из МассивСтруктур Цикл
			НомерПП = 0;
			Для Каждого СтрокаТаблицы Из Объект.МатериальныеЗатраты Цикл
				Если Не ЗначениеЗаполнено(СтрокаТаблицы[СтрокаМассива.Имя]) Тогда 
					Сообщение = Новый СообщениеПользователю();
					ШаблонСообщения = НСтр("ru='Поле ""%1"" не заполнено';en='Field %1 is empty'");
					Сообщение.Текст = СтрШаблон(ШаблонСообщения, СтрокаМассива.Текст);
					Сообщение.Поле = "Объект.МатериальныеЗатраты[" + НомерПП + "]." + СтрокаМассива.Имя;
					Сообщение.Сообщить();
					Отказ = Истина;
				КонецЕсли;
				НомерПП = НомерПП + 1;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;   	
	
КонецПроцедуры 

&НаКлиенте
Процедура ПроверитьЗаполнениеТрудовыхЗатрат(МассивСтруктур, Отказ)
	
	Если Объект.ТрудовыеЗатраты.Количество() Тогда 
		МассивСтруктур = новый Массив();
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "ВремяРаботы",
			НСтр("ru='Время работы';en='Working hours'")));
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "Количество", 
			НСтр("ru='Количество';en='Count'")));
		Для Каждого СтрокаМассива Из МассивСтруктур Цикл
			НомерПП = 0;
			Для Каждого СтрокаТаблицы Из Объект.ТрудовыеЗатраты Цикл
				Если Не ЗначениеЗаполнено(СтрокаТаблицы[СтрокаМассива.Имя]) Тогда 
					Сообщение = Новый СообщениеПользователю();
					ШаблонСообщения = НСтр("ru='Поле ""%1"" не заполнено';en='Field %1 is empty'");
					Сообщение.Текст = СтрШаблон(ШаблонСообщения, СтрокаМассива.Текст);
					Сообщение.Поле = "Объект.ТрудовыеЗатраты[" + НомерПП + "]." + СтрокаМассива.Имя;
					Сообщение.Сообщить();
					Отказ = Истина;
				КонецЕсли;
				НомерПП = НомерПП + 1;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;	

КонецПроцедуры   

&НаКлиенте
Процедура ПроверитьЗаполнениеРемонтныхРабот(МассивСтруктур, Отказ)
	
	Если Объект.РемонтныеРаботы.Количество() = 0 Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='В документе не указана ремонтная работа';en='The document does not specify repairs'");
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры   

&НаКлиенте
&ИзменениеИКонтроль("УстановитьПараметрыВыбораИсполнителя_ДляРемонтныхРабот")
Процедура гкс_УстановитьПараметрыВыбораИсполнителя_ДляРемонтныхРабот(РемонтыОборудования_ID)

	СтруктураПоиска = Новый Структура("РемонтыОборудования_ID", РемонтыОборудования_ID);
	#Вставка
	// гкс+ [Релиз16] Деснол
	Если ЗначениеЗаполнено(РемонтыОборудования_ID) = Ложь Тогда 
		ТекДанные = Элементы.РемонтыОборудования.ТекущиеДанные;
		Если Не ТекДанные = Неопределено Тогда 
			СтруктураПоиска = Новый Структура("РемонтыОборудования_ID", ТекДанные.ID);
		КонецЕсли;
	КонецЕсли;
	// гкс- [Релиз16]
	#КонецВставки
	СтрокиИсполнителей = Объект.ИсполнителиПоРемонтам.НайтиСтроки(СтруктураПоиска);

	ОтборПоСсылке = Новый Массив;
	Для каждого Строка из СтрокиИсполнителей Цикл
		ОтборПоСсылке.Добавить(Строка.Исполнитель);
	КонецЦикла;

	ПараметрыВыбораМассив = Новый Массив;
	ПараметрыВыбораМассив.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(ОтборПоСсылке)));
	ПараметрыВыбораМассив.Добавить(Новый ПараметрВыбора("РежимОтображенияСписка", "Список"));
	Элементы.ДеревоРемонтныхРаботИсполнитель.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораМассив);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекстЗапроса_ПлановаяСтоимость()
	
	Возврат "ВЫБРАТЬ
	        |	ВнешняяТаблицаИсполнителейРемонтныхРабот0.ВремяРаботы КАК ВремяРаботы,
	        |	ВнешняяТаблицаИсполнителейРемонтныхРабот0.Количество КАК Количество,
	        |	ВнешняяТаблицаИсполнителейРемонтныхРабот0.Квалификация КАК Квалификация,
	        |	ВнешняяТаблицаИсполнителейРемонтныхРабот0.ID КАК ИД
	        |ПОМЕСТИТЬ ВнешняяТаблицаИсполнителейРемонтныхРабот
	        |ИЗ
	        |	&ВнешняяТаблицаИсполнителейРемонтныхРабот0 КАК ВнешняяТаблицаИсполнителейРемонтныхРабот0
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВнешняяТаблицаКоэффициентовРемонтныхРабот0.ID КАК ИД,
	        |	ВЫРАЗИТЬ(ВнешняяТаблицаКоэффициентовРемонтныхРабот0.гкс_ПовКоэф КАК Справочник.гкс_ПКоэффициентыРабот) КАК гкс_ПовКоэф
	        |ПОМЕСТИТЬ ВнешняяТаблицаКоэффициентовРемонтныхРабот
	        |ИЗ
	        |	&ВнешняяТаблицаКоэффициентовРемонтныхРабот0 КАК ВнешняяТаблицаКоэффициентовРемонтныхРабот0
	        |ГДЕ
	        |	НЕ ВнешняяТаблицаКоэффициентовРемонтныхРабот0.гкс_ПовКоэф = ЗНАЧЕНИЕ(Справочник.гкс_ПКоэффициентыРабот.ПустаяСсылка)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВнешняяТаблицаИсполнителейРемонтныхРабот.ВремяРаботы * ЕСТЬNULL(ВнешняяТаблицаКоэффициентовРемонтныхРабот.гкс_ПовКоэф.Коэффициент, 1) КАК ВремяРаботы,
	        |	ВнешняяТаблицаИсполнителейРемонтныхРабот.Количество КАК Количество,
	        |	ВнешняяТаблицаИсполнителейРемонтныхРабот.Квалификация КАК Квалификация,
	        |	ВнешняяТаблицаКоэффициентовРемонтныхРабот.ИД КАК ИД
	        |ПОМЕСТИТЬ Исходные
	        |ИЗ
	        |	ВнешняяТаблицаИсполнителейРемонтныхРабот КАК ВнешняяТаблицаИсполнителейРемонтныхРабот
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВнешняяТаблицаКоэффициентовРемонтныхРабот КАК ВнешняяТаблицаКоэффициентовРемонтныхРабот
	        |		ПО ВнешняяТаблицаИсполнителейРемонтныхРабот.ИД = ВнешняяТаблицаКоэффициентовРемонтныхРабот.ИД
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	Организации.гкс_ВидЦены КАК ВидЦены,
	        |	Организации.гкс_ВидЦены.ВалютаЦены КАК Валюта
	        |ПОМЕСТИТЬ ОргВидЦены
	        |ИЗ
	        |	Справочник.Организации КАК Организации
	        |ГДЕ
	        |	Организации.Ссылка = &Организация
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	торо_СтоимостьЧасаКвалификацииСрезПоследних.Квалификация КАК Квалификация,
	        |	торо_СтоимостьЧасаКвалификацииСрезПоследних.Стоимость КАК Стоимость
	        |ПОМЕСТИТЬ ИзРегистра
	        |ИЗ
	        |	РегистрСведений.торо_СтоимостьЧасаКвалификации.СрезПоследних(
	        |			&Дата,
	        |			Организация = &Организация
	        |				И Квалификация В
	        |					(ВЫБРАТЬ
	        |						ТЧ.Квалификация
	        |					ИЗ
	        |						Исходные КАК ТЧ)) КАК торо_СтоимостьЧасаКвалификацииСрезПоследних
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОргВидЦены КАК ОргВидЦены
	        |		ПО (ОргВидЦены.Валюта = торо_СтоимостьЧасаКвалификацииСрезПоследних.Валюта)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ИзРегистра.Стоимость * Исходные.Количество * (Исходные.ВремяРаботы / 3600) КАК Стоимость
	        |ИЗ
	        |	Исходные КАК Исходные
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИзРегистра КАК ИзРегистра
	        |		ПО Исходные.Квалификация = ИзРегистра.Квалификация
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	КурсыВалютСрезПоследних.Кратность КАК Кратность,
	        |	КурсыВалютСрезПоследних.Курс КАК Курс
	        |ИЗ
	        |	РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &ВалютаВывода) КАК КурсыВалютСрезПоследних"; 
		
КонецФункции

&НаСервереБезКонтекста
Функция ТекстЗапроса_ДублиРемонта()
	
	Возврат "ВЫБРАТЬ
	        |	ТЧ.ID КАК ID
	        |ПОМЕСТИТЬ Исходные
	        |ИЗ
	        |	&ТЧ1 КАК ТЧ
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	Рег.Регистратор КАК Ссылка
	        |ИЗ
	        |	РегистрСведений.торо_ЗаявкиПоРемонтам.СрезПоследних(
	        |			,
	        |			IDРемонта В
	        |					(ВЫБРАТЬ
	        |						ТЧ.ID
	        |					ИЗ
	        |						Исходные КАК ТЧ)
	        |				И НЕ Регистратор = &Ссылка
	        |				И Регистратор ССЫЛКА Документ.торо_ЗаявкаНаРемонт) КАК Рег"; 
		
КонецФункции 

// гкс+ [03.23] Деснол 13.03.2023
&НаСервере
Процедура гкс_ДобавитьВДеревоРеквизитыИзППР(РемонтыНовые)
	Запрос = Новый Запрос();
	Запрос.Текст = "
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Плановые.Исполнитель КАК Исполнитель,
	               |	Плановые.СпособВыполнения КАК СпособВыполнения,
	               |	Плановые.ID КАК ИД
	               |ИЗ
	               |	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(, ID В (&ИД)) КАК Плановые";
	Запрос.УстановитьПараметр("ИД", РемонтыНовые);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда 
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			НайдСтр = Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", Выборка.ИД));
			Для Каждого СтрокаТЧ Из НайдСтр Цикл
				СтрокаТЧ.гкс_СпособВыполнения = Выборка.СпособВыполнения;
				СтрокаТЧ.Исполнитель = Выборка.Исполнитель;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры // гкс- [03.23] Деснол 13.03.2023

// гкс+ [03.23] Деснол 13.03.2023
&НаСервере
Процедура гкс_ОбновитьТехкартыРемонтаНаСервере(ИД_Ремонта, ТекущиеДанные)
	СтруктураДоОбновления = Новый Структура();
	МассивТО = Новый Массив();
	ВыбранноеЗначение = Новый Массив();
	СоотИТК = Новый Соответствие();
	НайдСтр = Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("РемонтыОборудования_ID,Родитель_ID", ИД_Ремонта, ""));
	Для Каждого СТ Из НайдСтр Цикл
		Если ТипЗнч(СТ.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда 
			ВыбранноеЗначение.Добавить(СТ.РемонтнаяРабота);
			СоотИТК.Вставить(СТ.ID, СТ.РемонтнаяРабота);
		КонецЕсли;
	КонецЦикла;
	СоотТО = Новый Соответствие();
	НайдСтр = Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", ИД_Ремонта));
	Для Каждого СТ Из НайдСтр Цикл
		СтруктСтроки = Новый Структура("Операция,Родитель", СТ.РемонтнаяРабота, Неопределено);
		СтруктСтроки.Вставить("гкс_СпособВыполнения", СТ.гкс_СпособВыполнения);
		СтруктСтроки.Вставить("Исполнитель", СТ.Исполнитель);
		Если ЗначениеЗаполнено(СТ.Родитель_ID) Тогда 
			СтруктСтроки.Родитель = СоотИТК.Получить(СТ.Родитель_ID);
		КонецЕсли;
		МассивТО.Добавить(СтруктСтроки);
		СоотТО.Вставить(СТ.ID, СтруктСтроки);
	КонецЦикла;
	МассивМЗ = Новый Массив();
	НайдСтр = Объект.МатериальныеЗатраты.НайтиСтроки(Новый Структура("РемонтыОборудования_ID,гкс_Давальческие", ИД_Ремонта, Истина));
	Для Каждого СТ Из НайдСтр Цикл
		СтруктСтроки = Новый Структура("ЕдиницаИзмерения,Количество,Номенклатура,ХарактеристикаНоменклатуры,Качество,КоличествоЕдиниц");
		ЗаполнитьЗначенияСвойств(СтруктСтроки, СТ);
		СтрТО = СоотТО.Получить(СТ.ID);
		Если Не СтрТО = Неопределено Тогда 
			СтруктСтроки.Вставить("Операция", СтрТО.Операция);
			СтруктСтроки.Вставить("Родитель", СтрТО.Родитель);
			МассивМЗ.Добавить(СтруктСтроки);
		КонецЕсли;
	КонецЦикла;
	// Удаление
	НайдСтр = Объект.МатериальныеЗатраты.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", ИД_Ремонта));
	Для Каждого СМ Из НайдСтр Цикл
		Объект.МатериальныеЗатраты.Удалить(СМ);
	КонецЦикла;
	НайдСтр = Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", ИД_Ремонта));
	Для Каждого СМ Из НайдСтр Цикл
		Объект.РемонтныеРаботы.Удалить(СМ);
	КонецЦикла;
	НайдСтр = Объект.ТрудовыеЗатраты.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", ИД_Ремонта));
	Для Каждого СМ Из НайдСтр Цикл
		Объект.ТрудовыеЗатраты.Удалить(СМ);
	КонецЦикла;
	НайдСтр = Объект.Инструменты.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", ИД_Ремонта));
	Для Каждого СМ Из НайдСтр Цикл
		Объект.Инструменты.Удалить(СМ);
	КонецЦикла;
	НайдСтр = Объект.ЗапчастиРемонта.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", ИД_Ремонта));
	Для Каждого СМ Из НайдСтр Цикл
		Объект.ЗапчастиРемонта.Удалить(СМ);
	КонецЦикла;
	НайдСтр = Объект.МерыБезопасности.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", ИД_Ремонта));
	Для Каждого СМ Из НайдСтр Цикл
		Объект.МерыБезопасности.Удалить(СМ);
	КонецЦикла;
	НайдСтр = Объект.ИсполнителиПоРемонтам.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", ИД_Ремонта));
	Для Каждого СМ Из НайдСтр Цикл
		Объект.ИсполнителиПоРемонтам.Удалить(СМ);
	КонецЦикла;
	НайдСтр = Объект.гкс_СИЗ.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", ИД_Ремонта));
	Для Каждого СМ Из НайдСтр Цикл
		Объект.гкс_СИЗ.Удалить(СМ);
	КонецЦикла;
	// Перевыбор
	ДеревоРемонтныхРаботОбработкаВыбораСервер(ВыбранноеЗначение, ТекущиеДанные);
	// Восстановление
	СоотИТК = Новый Соответствие();
	НайдСтр = Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("РемонтыОборудования_ID,Родитель_ID", ИД_Ремонта, ""));
	Для Каждого СТ Из НайдСтр Цикл
		Если ТипЗнч(СТ.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда 
			ВыбранноеЗначение.Добавить(СТ.РемонтнаяРабота);
			СоотИТК.Вставить(СТ.ID, СТ.РемонтнаяРабота);
		КонецЕсли;
	КонецЦикла;
	МассивНовыхТО = Новый Массив();
	НайдСтр = Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", ИД_Ремонта));
	Для Каждого СТ Из НайдСтр Цикл
		ТекРодитель = СоотИТК.Получить(СТ.Родитель_ID);
		Для Каждого СМ Из МассивТО Цикл
			Если СМ.Операция = СТ.РемонтнаяРабота И СМ.Родитель = ТекРодитель Тогда 
				ЗаполнитьЗначенияСвойств(СТ, СМ);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		СтруктСтроки = Новый Структура("Операция,Родитель,ИД", СТ.РемонтнаяРабота, ТекРодитель, СТ.ID);
		МассивНовыхТО.Добавить(СтруктСтроки);
	КонецЦикла;
	Для Каждого СМ Из МассивМЗ Цикл
		Для Каждого НоваяТО Из МассивНовыхТО Цикл
			Если НоваяТО.Операция = СМ.Операция И НоваяТО.Родитель = СМ.Родитель Тогда 
				НайдСтр = Объект.МатериальныеЗатраты.НайтиСтроки(Новый Структура("РемонтыОборудования_ID,ID,Номенклатура", ИД_Ремонта, НоваяТО.ИД, СМ.Номенклатура));
				Если НайдСтр.Количество() Тогда 
					Для Каждого СТ Из НайдСтр Цикл
						СТ.гкс_Давальческие = Истина;
					КонецЦикла;
				Иначе
					НоваяСтрокаМЗ = Объект.МатериальныеЗатраты.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаМЗ, СМ);
					НоваяСтрокаМЗ.ID = НоваяТО.ИД;
					НоваяСтрокаМЗ.РемонтыОборудования_ID = ИД_Ремонта;
					НоваяСтрокаМЗ.гкс_Давальческие = Истина;
				КонецЕсли;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры // гкс- [03.23] Деснол 13.03.2023

// гкс+ [03.23] Деснол 14.03.2023
&НаКлиенте
Процедура гкс_ОбновитьТехкартыРемонтаПослеВопроса(Результат, ДопПараметры) Экспорт
	Если Не Результат = КодВозвратаДиалога.Да Тогда 
		Возврат;
	КонецЕсли;
	ТекДанные = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		ТекСтрокаДерева = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
		
		
		СтрокаРодитель = Новый Структура("ID, РемонтыОборудования_ID, Родитель_ID", "", "", "");
		ИДВыбраннойСтроки = "";
		
	
		ТекущиеДанные = Новый Структура("ТекущийРемонт_ID, СтрокаРодитель_ID, СтрокаРодительРемонтыОборудования_ID, СтрокаРодительРодитель_ID, ДатаНачалаРемонта"
		, ТекДанные.ID
		, СтрокаРодитель.ID
		, СтрокаРодитель.РемонтыОборудования_ID
		, СтрокаРодитель.Родитель_ID
		, ТекДанные.ДатаНачала);
		
		
		гкс_ОбновитьТехкартыРемонтаНаСервере(ТекДанные.ID, ТекущиеДанные);
		
		РемонтыОборудованияПриАктивизацииСтроки(Элементы.РемонтыОборудования);
		ВыделитьСтрокуДереваРемонтныхРабот(ИДВыбраннойСтроки);
			
		Модифицированность = Истина;
			
		КонецЕсли;
КонецПроцедуры // гкс- [03.23] Деснол 14.03.2023

// гкс+ [03.23] Деснол 14.03.2023
&НаКлиенте
Процедура гкс_УстановитьДавальческийДокументуПослеВопроса(Результат, ДопПараметры) Экспорт
	Если Не Результат = КодВозвратаДиалога.Да Тогда 
		Возврат;
	КонецЕсли;
	Для Каждого СтрокаТЧ Из Объект.МатериальныеЗатраты Цикл
		СтрокаТЧ.гкс_Давальческие = Истина;
	КонецЦикла;
КонецПроцедуры // гкс- [03.23] Деснол 14.03.2023

// Гкс+[TOIR20-490] Зозуля А.В. от 22.01.2024. Добавлено:{
&НаСервере
Процедура гкс_ОбновитьОстаткиНаСервере()
	
	Если Объект.МатериальныеЗатраты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	СписокНоменклатуры	= Новый СписокЗначений;
	Для Каждого ТекСтрока Из Объект.МатериальныеЗатраты Цикл
		СписокНоменклатуры.Добавить(ТекСтрока.Номенклатура);
	КонецЦикла;
	
	// Гкс+[TOIR20-510] Зозуля А.В. от 29.01.2025. Изменено:{
	//ТаблицаДанных = гкс_ИнтеграцияERP2.ПолучитьДанныеПоНоменклатуре(Объект.Ссылка, СписокНоменклатуры); 
	ТаблицаДанных = гкс_ИнтеграцияERP2.ПолучитьДанныеПоНоменклатуре(Объект.Ссылка, Объект.Организация, СписокНоменклатуры);
    // } Гкс-[TOIR20-510] Зозуля А.В. от 29.01.2025.
   
	//заполнение ТЧ МатериальныеЗатраты
	ОтборТовара	= Новый Структура("Номенклатура");
	Для Каждого ТекСтрока Из Объект.МатериальныеЗатраты Цикл		
		ОтборТовара.Номенклатура	= ТекСтрока.Номенклатура;
		НайденныеСтроки	= ТаблицаДанных.НайтиСтроки(ОтборТовара);
		Если НайденныеСтроки.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(ТекСтрока, НайденныеСтроки[0]);
		КонецЕсли;	
	КонецЦикла;
	
	//Зозуля 497+
	Если ТаблицаДанных.Количество() > 0 Тогда 
		ТаблицаДанных.Сортировать("гкс_ДатаПоставки УБЫВ");            
		НаибольшаяДатаПоставки = ТаблицаДанных[0].гкс_ДатаПоставки;
		НаименованиеНоменклатуры = ТаблицаДанных[0].Наименование;
		Для Каждого ТекСтрока Из Объект.РемонтыОборудования Цикл			
			Если ТекСтрока.ДатаНачала < НаибольшаяДатаПоставки Тогда 
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = СтрШаблон("В строке %1: Дата начала ремонта меньше даты поставки номенклатуры %2", 
					ТекСтрока.НомерСтроки, НаименованиеНоменклатуры);
				Сообщение.Поле = "Объект.РемонтыОборудования["+(ТекСтрока.НомерСтроки-1)+"].ДатаНачала"; 
				Сообщение.Сообщить();
			КонецЕсли;
		КонецЦикла;
		
	// Гкс+[TOIR20-532] Вялых Д.А. от 10.02.2025. Добавлено:{
	УстановитьИспользованиеУОДляДанныхЕРП(Истина); 
	// } Гкс-[TOIR20-532] Вялых Д.А. от 10.02.2025.
	КонецЕсли;
	//Зозуля 497-	
	
КонецПроцедуры // } Гкс-[TOIR20-490] Зозуля А.В. от 22.01.2024.

Процедура УстановитьИспользованиеУОДляДанныхЕРП(ЗначениеВидимости)
	
	// Гкс+[TOIR20-532] Вялых Д.А. от 10.02.2025. Добавлено:{
	Для Каждого ЭлементУО ИЗ УсловноеОформление.Элементы Цикл
		Если ЭлементУО.Представление = "УО_ДляДанныхЕРП2" Тогда
			ЭлементУО.Использование = ЗначениеВидимости;	
		КонецЕсли;
	КонецЦикла; 
	// } Гкс-[TOIR20-532] Вялых Д.А. от 10.02.2025.
	
КонецПроцедуры

// Гкс+[TOIR20-677] Оселедько В.С. от 01.08.2025. Добавлено:{
&НаСервереБезКонтекста
Процедура гкс_ЗавершитьЗамерОткрытияФормы(ВремяНачалаЗамера)
	
    ОценкаПроизводительности.ЗакончитьЗамерВремени("Документ.торо_ЗаявкаНаРемонт.ОткрытиеФормы", ВремяНачалаЗамера); 
	
КонецПроцедуры // Гкс+[TOIR20-677] 

#КонецОбласти
