#Область ОбработчикиСобытийФормы

&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура гкс_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("ИзменятьВТранзакции",    ИзменятьВТранзакции);
	Параметры.Свойство("ОбрабатыватьРекурсивно", ОбрабатыватьРекурсивно);
	Параметры.Свойство("НастройкаПорции",        НастройкаПорции);
	Параметры.Свойство("ПроцентОбъектовВПорции", ПроцентОбъектовВПорции);
	Параметры.Свойство("ЧислоОбъектовВПорции",   ЧислоОбъектовВПорции);
	Параметры.Свойство("РежимРазработчика",     РежимРазработчика);
	Параметры.Свойство("ОтключитьСвязиПараметровВыбора",     ОтключитьСвязиПараметровВыбора);
	Параметры.Свойство("ПрерыватьПриОшибке",     ПрерыватьПриОшибке);
	#Вставка
	// Гкс+[TOIR20-87] Селимов от 15.04.2020. Добавлено:{
	РедактированиеОР = Ложь;
	Параметры.Свойство("РедактированиеОР",     РедактированиеОР);
	Если РедактированиеОР Тогда
		ДобавитьФлагДляРедактированияОР();
	КонецЕсли; 	// } Гкс-[TOIR20-87] 	 
	#КонецВставки 

	ЕстьПравоАдминистрированияДанных = ПравоДоступа("АдминистрированиеДанных", Метаданные);
	КлючСохраненияПоложенияОкна = ?(ЕстьПравоАдминистрированияДанных, "ЕстьПравоАдминистрированияДанных", "НетПраваАдминистрированияДанных");

	МожноПоказыватьСлужебныеРеквизиты = Не Параметры.КонтекстныйВызов И ЕстьПравоАдминистрированияДанных;
	Элементы.ГруппаПоказыватьСлужебныеРеквизиты.Видимость = МожноПоказыватьСлужебныеРеквизиты;
	Элементы.РежимРазработчика.Видимость = МожноПоказыватьСлужебныеРеквизиты;
	Элементы.ОтключитьСвязиПараметровВыбора.Видимость = МожноПоказыватьСлужебныеРеквизиты;

	Если МожноПоказыватьСлужебныеРеквизиты Тогда
		Параметры.Свойство("ПоказыватьСлужебныеРеквизиты", ПоказыватьСлужебныеРеквизиты);
	КонецЕсли;

	Элементы.ГруппаОбрабатыватьРекурсивно.Видимость = Параметры.КонтекстныйВызов И Параметры.УчитыватьИерархию;

КонецПроцедуры   

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Гкс+[TOIR20-87] Селимов от 15.04.2020. Добавлено:{
&НаСервере
Процедура ДобавитьФлагДляРедактированияОР()
	
	НовыеРеквизиты = Новый Массив;

	гкс_ЗаполнятьИзОбъектаРемонта = Новый РеквизитФормы("гкс_ЗаполнятьИзОбъектаРемонта", 
											Новый ОписаниеТипов("Булево"), , " ");
														
	НовыеРеквизиты.Добавить(гкс_ЗаполнятьИзОбъектаРемонта);
	ИзменитьРеквизиты(НовыеРеквизиты);  			
	
	ГруппаЗаполнениеОР = Элементы.Добавить("гкс_ГруппаЗаполнениеОР", Тип("ГруппаФормы"));
	ГруппаЗаполнениеОР.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаЗаполнениеОР.ОтображатьЗаголовок = Ложь;
	Элементы.Переместить(Элементы["гкс_ГруппаЗаполнениеОР"], ЭтаФорма, Элементы.СпециальныеВозможности);
	
	ЭлементЗначениеИзОбъектаРемонта = Элементы.Добавить("гкс_ЗаполнятьИзОбъектаРемонта", 
															Тип("ПолеФормы"), 
															Элементы["гкс_ГруппаЗаполнениеОР"]);
	ЭлементЗначениеИзОбъектаРемонта.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементЗначениеИзОбъектаРемонта.ПутьКДанным = "гкс_ЗаполнятьИзОбъектаРемонта";
	ЭлементЗначениеИзОбъектаРемонта.Заголовок = "Заполнять реквизиты из объекта ремонта";
	ЭлементЗначениеИзОбъектаРемонта.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	ЭлементЗначениеИзОбъектаРемонта.РасширеннаяПодсказка.Заголовок 
		= "Используется только для изменения реквизитов функциональных мест " +
		"Заполнять выбранные реквизиты из подчиненного объекта ремонта";
	ЭлементЗначениеИзОбъектаРемонта.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
	
КонецПроцедуры // } Гкс-[TOIR20-87] 

// Гкс+[TOIR20-87] Селимов от 15.04.2020. Добавлено:{
&НаКлиенте
&ИзменениеИКонтроль("ОК")
Процедура гкс_ОК(Команда)

	РезультатВыбора = Новый Структура;
	РезультатВыбора.Вставить("ИзменятьВТранзакции",    ИзменятьВТранзакции);
	РезультатВыбора.Вставить("ОбрабатыватьРекурсивно", ОбрабатыватьРекурсивно);
	РезультатВыбора.Вставить("НастройкаПорции",        НастройкаПорции);
	РезультатВыбора.Вставить("ПроцентОбъектовВПорции", ПроцентОбъектовВПорции);
	РезультатВыбора.Вставить("ЧислоОбъектовВПорции",   ЧислоОбъектовВПорции);
	РезультатВыбора.Вставить("ПрерыватьПриОшибке",     ИзменятьВТранзакции Или ПрерыватьПриОшибке);
	РезультатВыбора.Вставить("ПоказыватьСлужебныеРеквизиты", ПоказыватьСлужебныеРеквизиты);
	РезультатВыбора.Вставить("РежимРазработчика", РежимРазработчика);
	РезультатВыбора.Вставить("ОтключитьСвязиПараметровВыбора", ОтключитьСвязиПараметровВыбора);
	#Вставка
	РезультатВыбора.Вставить("гкс_ЗаполнятьИзОбъектаРемонта", ЭтаФорма.гкс_ЗаполнятьИзОбъектаРемонта);
	#КонецВставки 

	ОповеститьОВыборе(РезультатВыбора);

КонецПроцедуры // } Гкс-[TOIR20-87] 

#КонецОбласти
