#Область СлужебныеПроцедурыИФункции

&ИзменениеИКонтроль("ПолучитьТекстЗапросаРемонтныхРаботПоОснованию")
Процедура Расш_гкс_ПолучитьТекстЗапросаРемонтныхРаботПоОснованию(Запрос, ТипЗначенияДокументаОснования, Владелец, Дата)

	Если 	  ТипЗначенияДокументаОснования = Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот") Тогда
		#Область Запрос_ВО
		Запрос.Текст = "ВЫБРАТЬ
		|	ТаблицаДокументовОснований.ID КАК РемонтыОборудования_ID,
		|	ТаблицаДокументовОснований.Ссылка КАК Ссылка,
		|	торо_ОперацииВнешнихОснованийДляРабот.РемонтнаяРабота КАК РемонтнаяРабота,
		|	торо_ОперацииВнешнихОснованийДляРабот.ID КАК ID,
		|	торо_ОперацииВнешнихОснованийДляРабот.Родитель_ID КАК Родитель_ID,
		|	торо_ОперацииВнешнихОснованийДляРабот.Количество КАК Количество,
		|	2 КАК Картинка
		|ПОМЕСТИТЬ ВТ_ОперацииВнешнегоОснования
		|ИЗ
		|	ТаблицаДокументовОснований КАК ТаблицаДокументовОснований
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОперацииВнешнихОснованийДляРабот КАК торо_ОперацииВнешнихОснованийДляРабот
		|		ПО ТаблицаДокументовОснований.ID = торо_ОперацииВнешнихОснованийДляРабот.Предписание_ID
		|			И (ТИПЗНАЧЕНИЯ(ТаблицаДокументовОснований.Ссылка) = ТИП(Документ.торо_ВнешнееОснованиеДляРабот))
		|ГДЕ 
		|  ТаблицаДокументовОснований.ID В (&МассивID)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	РемонтыОборудования_ID,
		|	ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ПроцентВыполненныхРаботОбороты.IDРемонта КАК IDРемонта,
		|	торо_ПроцентВыполненныхРаботОбороты.IDОперации КАК IDОперации,
		|	торо_ПроцентВыполненныхРаботОбороты.Операция КАК Операция,
		|	торо_ПроцентВыполненныхРаботОбороты.IDРодителя КАК IDРодителя,
		|	торо_ПроцентВыполненныхРаботОбороты.ВидДокумента КАК ВидДокумента,
		|	торо_ПроцентВыполненныхРаботОбороты.ПроцентОборот КАК ПроцентОборот
		|ПОМЕСТИТЬ ВТ_ПроцентыВнешнегоОснования
		|ИЗ
		|	РегистрНакопления.торо_ПроцентВыполненныхРабот.Обороты(
		|			,
		|			,
		|			,
		|			IDРемонта В
		|					(ВЫБРАТЬ
		|						ВТ_ОперацииВнешнегоОснования.РемонтыОборудования_ID КАК РемонтыОборудования_ID
		|					ИЗ
		|						ВТ_ОперацииВнешнегоОснования КАК ВТ_ОперацииВнешнегоОснования)
		|				И IDОперации В
		|					(ВЫБРАТЬ
		|						ВТ_ОперацииВнешнегоОснования.ID КАК ID
		|					ИЗ
		|						ВТ_ОперацииВнешнегоОснования КАК ВТ_ОперацииВнешнегоОснования)) КАК торо_ПроцентВыполненныхРаботОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Операции.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		|	ВТ_Операции.Ссылка КАК Ссылка,
		|	ВТ_Операции.РемонтнаяРабота КАК РемонтнаяРабота,
		|	ВТ_Операции.ID КАК ID,
		|	ВТ_Операции.Родитель_ID КАК Родитель_ID,
		|	ВТ_Операции.Количество КАК Количество,
		|	ВТ_Операции.Картинка КАК Картинка,
		|	100 + ЕСТЬNULL(ВТ_Проценты.ПроцентОборот, 0) / ВТ_Операции.Количество КАК ПроцентВыполненияРабот,
		|	ВТ_Проценты.IDРемонта ЕСТЬ NULL КАК НоваяОперация
		|ИЗ
		|	ВТ_ОперацииВнешнегоОснования КАК ВТ_Операции
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПроцентыВнешнегоОснования КАК ВТ_Проценты
		|		ПО ВТ_Операции.РемонтыОборудования_ID = ВТ_Проценты.IDРемонта
		|			И ВТ_Операции.ID = ВТ_Проценты.IDОперации
		|ГДЕ
		|	100 + ЕСТЬNULL(ВТ_Проценты.ПроцентОборот, 0) / ВТ_Операции.Количество > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ОперацииВнешнегоОснования
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ПроцентыВнешнегоОснования";		
		#КонецОбласти
	ИначеЕсли ТипЗначенияДокументаОснования = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") Тогда
		#Область Запрос_Заявка
		Запрос.Текст = "ВЫБРАТЬ
		|	ТаблицаДокументовОснований.ID КАК РемонтыОборудования_ID,
		|	ТаблицаДокументовОснований.Ссылка КАК Ссылка,
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтнаяРабота КАК РемонтнаяРабота,
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.ID КАК ID,
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.Родитель_ID КАК Родитель_ID,
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.Количество КАК Количество,
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.Исполнитель КАК Исполнитель,
		#Вставка
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.НомерСтроки КАК НомерСтроки,
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.гкс_Примечание КАК гкс_Примечание,
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.гкс_СпособВыполнения КАК гкс_СпособВыполнения,
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.гкс_ПовКоэф КАК гкс_ПовКоэф,
		#КонецВставки
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.ДоговорБригада КАК ДоговорБригада,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтнаяРабота) = ТИП(Справочник.торо_ТехнологическиеОперации)
		|			ТОГДА 2
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Картинка
		|ПОМЕСТИТЬ ВТ_ТаблицаРемонтовОборудования
		|ИЗ
		|	ТаблицаДокументовОснований КАК ТаблицаДокументовОснований
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтныеРаботы КАК торо_ЗаявкаНаРемонтРемонтныеРаботы
		|		ПО ТаблицаДокументовОснований.ID = торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтыОборудования_ID
		|			И ТаблицаДокументовОснований.Ссылка = торо_ЗаявкаНаРемонтРемонтныеРаботы.Ссылка
		|ГДЕ 
		|  ТаблицаДокументовОснований.ID В (&МассивID)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	РемонтыОборудования_ID,
		|	РемонтнаяРабота";

		#КонецОбласти
		ДополнитьЗапросПроцентами(Запрос, Перечисления.торо_ВидДокумента.ЗаявкаНаРемонт, Владелец);  		
	ИначеЕсли ТипЗначенияДокументаОснования = Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот") Тогда
		#Область Запрос_Наряд
		Запрос.Текст = "ВЫБРАТЬ
		|	ТаблицаДокументовОснований.ID КАК РемонтыОборудования_ID,
		|	ТаблицаДокументовОснований.Ссылка КАК Ссылка,
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.РемонтнаяРабота КАК РемонтнаяРабота,
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.ID КАК ID,
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.Родитель_ID КАК Родитель_ID,
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.Количество КАК Количество,
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.Исполнитель КАК Исполнитель,
		#Вставка
		|  торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.НомерСтроки КАК НомерСтроки,
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.гкс_Примечание КАК гкс_Примечание,
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.гкс_СпособВыполнения КАК гкс_СпособВыполнения,
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.гкс_ПовКоэф КАК гкс_ПовКоэф,
		#КонецВставки
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.ДоговорБригада КАК ДоговорБригада,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.РемонтнаяРабота) = ТИП(Справочник.торо_ТехнологическиеОперации)
		|			ТОГДА 2
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Картинка
		|ПОМЕСТИТЬ ВТ_ТаблицаРемонтовОборудования
		|ИЗ
		|	ТаблицаДокументовОснований КАК ТаблицаДокументовОснований
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтныеРаботы КАК торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы
		|		ПО ТаблицаДокументовОснований.ID = торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.РемонтыОборудования_ID
		|			И ТаблицаДокументовОснований.Ссылка = торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.Ссылка
		|ГДЕ 
		|  ТаблицаДокументовОснований.ID В (&МассивID)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	РемонтыОборудования_ID,
		|	РемонтнаяРабота";

		#КонецОбласти
		ДополнитьЗапросПроцентами(Запрос, Перечисления.торо_ВидДокумента.НарядНаВыполнениеРемонтныхРабот, Владелец);  
	ИначеЕсли ТипЗначенияДокументаОснования = Тип("ДокументСсылка.торо_ПланГрафикРемонта") Тогда
		#Область Запрос_ППР
		Запрос.Текст = "ВЫБРАТЬ
		|	ТаблицаДокументовОснований.ID КАК РемонтыОборудования_ID,
		|	ТаблицаДокументовОснований.Ссылка КАК Ссылка,
		|	торо_НормативныеРемонтыОборудования.НормативныйРемонт КАК РемонтнаяРабота,
		|	"""" КАК ID,
		|	"""" КАК Родитель_ID,
		|	1 КАК Количество,
		|	0 КАК Картинка,
		|	ВЫБОР
		|		КОГДА торо_НормативныеРемонтыОборудования.ТиповойОР = ЗНАЧЕНИЕ(Справочник.торо_ТиповыеОР.ПустаяСсылка)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ТиповойОР,
		|	Ремонты.ДатаНачала КАК ДатаНачала,
		|	торо_НормативныеРемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта,
		|	торо_НормативныеРемонтыОборудования.ВидРемонта КАК ВидРемонта
		|ПОМЕСТИТЬ ВТ_ВсеНормативыБезID
		|ИЗ
		|	ТаблицаДокументовОснований КАК ТаблицаДокументовОснований
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Ремонты КАК Ремонты
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_НормативныеРемонтыОборудования КАК торо_НормативныеРемонтыОборудования
		|			ПО (ТИПЗНАЧЕНИЯ(Ремонты.ДокументИсточник) = ТИП(Документ.торо_ПланГрафикРемонта))
		|				И Ремонты.ОбъектРемонта = торо_НормативныеРемонтыОборудования.ОбъектРемонта
		|				И Ремонты.ВидРемонтныхРабот = торо_НормативныеРемонтыОборудования.ВидРемонта
		|		ПО ТаблицаДокументовОснований.ID = Ремонты.ID
		|			И ТаблицаДокументовОснований.Ссылка = Ремонты.ДокументИсточник
		|ГДЕ 
		|  ТаблицаДокументовОснований.ID В (&МассивID)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	РемонтыОборудования_ID,
		|	РемонтнаяРабота
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВсеНормативыБезID.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		|	ВТ_ВсеНормативыБезID.Ссылка КАК Ссылка,
		|	ВТ_ВсеНормативыБезID.РемонтнаяРабота КАК РемонтнаяРабота,
		|	ЕСТЬNULL(торо_ПлановыеЗатратыТехКарты.ТехКарта_ID, ВТ_ВсеНормативыБезID.ID) КАК ID,
		|	ВТ_ВсеНормативыБезID.Родитель_ID КАК Родитель_ID,
		|	ВТ_ВсеНормативыБезID.Количество КАК Количество,
		|	ВТ_ВсеНормативыБезID.Картинка КАК Картинка,
		|	ВТ_ВсеНормативыБезID.ТиповойОР КАК ТиповойОР,
		|	ВТ_ВсеНормативыБезID.ОбъектРемонта КАК ОбъектРемонта,
		|	ВТ_ВсеНормативыБезID.ВидРемонта КАК ВидРемонта,
		|	ВТ_ВсеНормативыБезID.ДатаНачала КАК ДатаНачала
		|ПОМЕСТИТЬ ВТ_ВсеНормативы
		|ИЗ
		|	ВТ_ВсеНормативыБезID КАК ВТ_ВсеНормативыБезID
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ПлановыеЗатраты.ТехКарты КАК торо_ПлановыеЗатратыТехКарты
		|		ПО ВТ_ВсеНормативыБезID.РемонтыОборудования_ID = торо_ПлановыеЗатратыТехКарты.Ссылка.РемонтыОборудования_ID
		|			И ВТ_ВсеНормативыБезID.РемонтнаяРабота = торо_ПлановыеЗатратыТехКарты.ТехКарта
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	РемонтыОборудования_ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВсеНормативы.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		|	МАКСИМУМ(ВТ_ВсеНормативы.ТиповойОР) КАК ТиповойОР,
		|	ВТ_ВсеНормативы.ОбъектРемонта КАК ОбъектРемонта,
		|	ВТ_ВсеНормативы.ВидРемонта КАК ВидРемонта
		|ПОМЕСТИТЬ ВТ_Максимумы
		|ИЗ
		|	ВТ_ВсеНормативы КАК ВТ_ВсеНормативы
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ВсеНормативы.РемонтыОборудования_ID,
		|	ВТ_ВсеНормативы.ОбъектРемонта,
		|	ВТ_ВсеНормативы.ВидРемонта
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	РемонтыОборудования_ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ВсеНормативы.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		|	ВТ_ВсеНормативы.Ссылка КАК Ссылка,
		|	ВТ_ВсеНормативы.РемонтнаяРабота КАК РемонтнаяРабота,
		|	ВТ_ВсеНормативы.ID КАК ID,
		|	ВТ_ВсеНормативы.Родитель_ID КАК Родитель_ID,
		|	ВТ_ВсеНормативы.Количество КАК Количество,
		|	ВТ_ВсеНормативы.Картинка КАК Картинка,
		|	ВТ_ВсеНормативы.ДатаНачала КАК ДатаНачала
		|ПОМЕСТИТЬ ВТ_НормативыРемонта
		|ИЗ
		|	ВТ_ВсеНормативы КАК ВТ_ВсеНормативы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Максимумы КАК ВТ_Максимумы
		|		ПО ВТ_ВсеНормативы.РемонтыОборудования_ID = ВТ_Максимумы.РемонтыОборудования_ID
		|			И ВТ_ВсеНормативы.ТиповойОР = ВТ_Максимумы.ТиповойОР
		|			И ВТ_ВсеНормативы.ОбъектРемонта = ВТ_Максимумы.ОбъектРемонта
		|			И ВТ_ВсеНормативы.ВидРемонта = ВТ_Максимумы.ВидРемонта
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаДокументовОснований.ID,
		|	ТаблицаДокументовОснований.Ссылка,
		|	торо_ЦепочкиРемонтаПоследовательностьРемонтов.НормативныйРемонт,
		|	"""",
		|	"""",
		|	1,
		|	0,
		|	Ремонты.ДатаНачала
		|ИЗ
		|	ТаблицаДокументовОснований КАК ТаблицаДокументовОснований
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Ремонты КАК Ремонты
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_РемонтныеЦиклыОборудования КАК торо_РемонтныеЦиклыОборудования
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ЦепочкиРемонта.ПоследовательностьРемонтов КАК торо_ЦепочкиРемонтаПоследовательностьРемонтов
		|				ПО торо_РемонтныеЦиклыОборудования.ВидЦепочки = торо_ЦепочкиРемонтаПоследовательностьРемонтов.Ссылка
		|			ПО Ремонты.ОбъектРемонта = торо_РемонтныеЦиклыОборудования.ГруппаОбъектовРемонтов
		|				И (Ремонты.ВидРемонтныхРабот = торо_ЦепочкиРемонтаПоследовательностьРемонтов.ВидРемонта)
		|		ПО ТаблицаДокументовОснований.ID = Ремонты.ID
		|			И ТаблицаДокументовОснований.Ссылка = Ремонты.ДокументИсточник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ВсеНормативыБезID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ВсеНормативы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_Максимумы";
		#КонецОбласти
		ДополнитьЗапросРемонтнымиРаботамиИзНормативов(Запрос);
		Запрос.УстановитьПараметр("Период", Дата);
	ИначеЕсли ТипЗначенияДокументаОснования = Тип("ДокументСсылка.торо_ВыявленныеДефекты") Тогда
		#Область Запрос_ВД
		Запрос.Текст = "ВЫБРАТЬ
		|	ТаблицаДокументовОснований.ID КАК РемонтыОборудования_ID,
		|	ТаблицаДокументовОснований.Ссылка КАК Ссылка,
		|	торо_НормативныеРемонтыОборудования.НормативныйРемонт КАК РемонтнаяРабота,
		|	"""" КАК Родитель_ID,
		|	1 КАК Количество,
		|	0 КАК Картинка,
		|	ВЫБОР
		|		КОГДА Ремонты.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА &Период
		|		ИНАЧЕ Ремонты.ДатаНачала
		|	КОНЕЦ КАК ДатаНачала,
		|	ВЫБОР
		|		КОГДА торо_НормативныеРемонтыОборудования.ТиповойОР = ЗНАЧЕНИЕ(Справочник.торо_ТиповыеОР.ПустаяСсылка)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Приоритет
		|ПОМЕСТИТЬ ВТ_ВсеНормативы
		|ИЗ
		|	ТаблицаДокументовОснований КАК ТаблицаДокументовОснований
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Ремонты КАК Ремонты
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_НормативныеРемонтыОборудования КАК торо_НормативныеРемонтыОборудования
		|			ПО (ТИПЗНАЧЕНИЯ(Ремонты.ДокументИсточник) = ТИП(Документ.торо_ВыявленныеДефекты))
		|				И Ремонты.ОбъектРемонта = торо_НормативныеРемонтыОборудования.ОбъектРемонта
		|				И Ремонты.ВидРемонтныхРабот = торо_НормативныеРемонтыОборудования.ВидРемонта
		|		ПО ТаблицаДокументовОснований.ID = Ремонты.ID
		|			И ТаблицаДокументовОснований.Ссылка = Ремонты.ДокументИсточник
		|ГДЕ 
		|  ТаблицаДокументовОснований.ID В (&МассивID)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВсеНормативы.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		|	ВТ_ВсеНормативы.Ссылка КАК Ссылка,
		|	ВТ_ВсеНормативы.РемонтнаяРабота КАК РемонтнаяРабота,
		|	ВТ_ВсеНормативы.Родитель_ID КАК Родитель_ID,
		|	ВТ_ВсеНормативы.Количество КАК Количество,
		|	ВТ_ВсеНормативы.Картинка КАК Картинка,
		|	ВТ_ВсеНормативы.ДатаНачала КАК ДатаНачала,
		|	ВТ_ВсеНормативы.Приоритет КАК Приоритет,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ВсеНормативы1.РемонтнаяРабота) КАК ID
		|ПОМЕСТИТЬ ВТ_НормативыСНумерацией
		|ИЗ
		|	ВТ_ВсеНормативы КАК ВТ_ВсеНормативы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВсеНормативы КАК ВТ_ВсеНормативы1
		|		ПО ВТ_ВсеНормативы.РемонтнаяРабота > ВТ_ВсеНормативы1.РемонтнаяРабота
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ВсеНормативы.РемонтнаяРабота,
		|	ВТ_ВсеНормативы.ДатаНачала,
		|	ВТ_ВсеНормативы.РемонтыОборудования_ID,
		|	ВТ_ВсеНормативы.Родитель_ID,
		|	ВТ_ВсеНормативы.Ссылка,
		|	ВТ_ВсеНормативы.Количество,
		|	ВТ_ВсеНормативы.Картинка,
		|	ВТ_ВсеНормативы.Приоритет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НормативыСНумерацией.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		|	ВТ_НормативыСНумерацией.Ссылка КАК Ссылка,
		|	МАКСИМУМ(ВТ_НормативыСНумерацией.Приоритет) КАК Приоритет
		|ПОМЕСТИТЬ ВТ_МаксимумПриоритетов
		|ИЗ
		|	ВТ_НормативыСНумерацией КАК ВТ_НормативыСНумерацией
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_НормативыСНумерацией.РемонтыОборудования_ID,
		|	ВТ_НормативыСНумерацией.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НормативыСНумерацией.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		|	ВТ_НормативыСНумерацией.Ссылка КАК Ссылка,
		|	ВТ_НормативыСНумерацией.РемонтнаяРабота КАК РемонтнаяРабота,
		|	(ВЫРАЗИТЬ(ВТ_НормативыСНумерацией.ID КАК ЧИСЛО(15, 0))) + 500 КАК ID,
		|	ВТ_НормативыСНумерацией.Родитель_ID КАК Родитель_ID,
		|	ВТ_НормативыСНумерацией.Количество КАК Количество,
		|	ВТ_НормативыСНумерацией.Картинка КАК Картинка,
		|	ВТ_НормативыСНумерацией.ДатаНачала КАК ДатаНачала
		|ПОМЕСТИТЬ ВТ_НормативыРемонта
		|ИЗ
		|	ВТ_НормативыСНумерацией КАК ВТ_НормативыСНумерацией
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МаксимумПриоритетов КАК ВТ_МаксимумПриоритетов
		|		ПО ВТ_НормативыСНумерацией.РемонтыОборудования_ID = ВТ_МаксимумПриоритетов.РемонтыОборудования_ID
		|			И ВТ_НормативыСНумерацией.Ссылка = ВТ_МаксимумПриоритетов.Ссылка
		|			И ВТ_НормативыСНумерацией.Приоритет = ВТ_МаксимумПриоритетов.Приоритет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ВсеНормативы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_НормативыСНумерацией
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_МаксимумПриоритетов";
		#КонецОбласти
		ДополнитьЗапросРемонтнымиРаботамиИзНормативов(Запрос);
		Запрос.УстановитьПараметр("Период", Дата);  
	ИначеЕсли ТипЗначенияДокументаОснования = Тип("ДокументСсылка.торо_ГрафикРегламентныхМероприятийТОиР") Тогда
		#Область Запрос_График_РМ
		Запрос.Текст = "ВЫБРАТЬ
		|	ТаблицаДокументовОснований.ID КАК РемонтыОборудования_ID,
		|	ТаблицаДокументовОснований.Ссылка КАК Ссылка,
		|	торо_НормативныеРемонтыОборудования.НормативныйРемонт КАК РемонтнаяРабота,
		|	ЕСТЬNULL(торо_ПлановыеЗатратыТехКарты.ТехКарта_ID, """") КАК ID,
		|	"""" КАК Родитель_ID,
		|	Ремонты.ДатаНачала КАК ДатаНачала,
		|	1 КАК Количество,
		|	0 КАК Картинка
		|ПОМЕСТИТЬ ВТ_НормативыРемонта
		|ИЗ
		|	ТаблицаДокументовОснований КАК ТаблицаДокументовОснований
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Ремонты КАК Ремонты
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_РегламентныеМероприятияИСпискиОбъектов КАК торо_НормативныеРемонтыОборудования
		|			ПО (ТИПЗНАЧЕНИЯ(Ремонты.ДокументИсточник) = ТИП(Документ.торо_ГрафикРегламентныхМероприятийТОиР))
		|				И Ремонты.ОбъектРемонта = торо_НормативныеРемонтыОборудования.СписокОбъектов
		|				И Ремонты.ВидРемонтныхРабот = торо_НормативныеРемонтыОборудования.ВидМероприятия
		|		ПО ТаблицаДокументовОснований.ID = Ремонты.ID
		|			И ТаблицаДокументовОснований.Ссылка = Ремонты.ДокументИсточник
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ПлановыеЗатраты.ТехКарты КАК торо_ПлановыеЗатратыТехКарты
		|		ПО ТаблицаДокументовОснований.ID = торо_ПлановыеЗатратыТехКарты.Ссылка.РемонтыОборудования_ID
		|			И (торо_НормативныеРемонтыОборудования.НормативныйРемонт = торо_ПлановыеЗатратыТехКарты.ТехКарта)
		|ГДЕ 
		|  ТаблицаДокументовОснований.ID В (&МассивID)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	РемонтыОборудования_ID,
		|	РемонтнаяРабота";

		#КонецОбласти
		ДополнитьЗапросРемонтнымиРаботамиИзНормативов(Запрос);
		Запрос.УстановитьПараметр("Период", Дата);
	ИначеЕсли ТипЗначенияДокументаОснования = Тип("ДокументСсылка.торо_НарядНаРегламентноеМероприятие") Тогда
		#Область Запрос_Наряд_РМ
		Запрос.Текст = "ВЫБРАТЬ
		|	ТаблицаДокументовОснований.ID КАК РемонтыОборудования_ID,
		|	ТаблицаДокументовОснований.Ссылка КАК Ссылка,
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.РемонтнаяРабота КАК РемонтнаяРабота,
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.ID КАК ID,
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.Родитель_ID КАК Родитель_ID,
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.Количество КАК Количество,
		#Вставка
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.НомерСтроки КАК НомерСтроки,
		#КонецВставки
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.РемонтнаяРабота) = ТИП(Справочник.торо_ТехнологическиеОперации)
		|			ТОГДА 2
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Картинка
		|ПОМЕСТИТЬ ВТ_ТаблицаРемонтовОборудования
		|ИЗ
		|	ТаблицаДокументовОснований КАК ТаблицаДокументовОснований
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_НарядНаРегламентноеМероприятие.РемонтныеРаботы КАК торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы
		|		ПО ТаблицаДокументовОснований.ID = торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.РемонтыОборудования_ID
		|			И ТаблицаДокументовОснований.Ссылка = торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.Ссылка
		|ГДЕ 
		|  ТаблицаДокументовОснований.ID В (&МассивID)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	РемонтыОборудования_ID,
		|	РемонтнаяРабота";
		#КонецОбласти
		ДополнитьЗапросПроцентами(Запрос, Перечисления.торо_ВидДокумента.НарядНаВыполнениеРегламентногоМероприятия, Владелец);  
	КонецЕсли;

КонецПроцедуры

&ИзменениеИКонтроль("ДополнитьЗапросПроцентами")
Процедура Расш_гкс_ДополнитьЗапросПроцентами(Запрос, ТипДокумента, Владелец)
	#Вставка
	Если СтрНайти(Запрос.Текст, "гкс_Примечание") > 0 Тогда 
		ЕстьПримечание = Истина;
	Иначе
		ЕстьПримечание = Ложь;
	КонецЕсли;
	#КонецВставки

	Запрос.Текст = Запрос.Текст + "
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|" + "ВЫБРАТЬ
	|	ТаблицаРемонтовОборудования.РемонтыОборудования_ID КАК ID
	|ПОМЕСТИТЬ ВТ_РемонтыОборудованияID
	|ИЗ
	|	ВТ_ТаблицаРемонтовОборудования КАК ТаблицаРемонтовОборудования
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ПроцентВыполненныхРабот.IDРемонта КАК IDРемонта,
	|	торо_ПроцентВыполненныхРабот.IDОперации КАК IDОперации,
	|	торо_ПроцентВыполненныхРабот.Операция КАК Операция,
	|	торо_ПроцентВыполненныхРабот.IDРодителя КАК IDРодителя,
	|	МАКСИМУМ(торо_ПроцентВыполненныхРабот.Процент) КАК Процент
	|ПОМЕСТИТЬ ВТ_ПроцентыПлан
	|ИЗ
	|	РегистрНакопления.торо_ПроцентВыполненныхРабот КАК торо_ПроцентВыполненныхРабот
	|ГДЕ
	|	торо_ПроцентВыполненныхРабот.ВидДокумента В(&МассивДокументовПлана)
	|	И торо_ПроцентВыполненныхРабот.IDРемонта В
	|			(ВЫБРАТЬ
	|				РО.ID
	|			ИЗ
	|				ВТ_РемонтыОборудованияID КАК РО)
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_ПроцентВыполненныхРабот.IDРемонта,
	|	торо_ПроцентВыполненныхРабот.IDОперации,
	|	торо_ПроцентВыполненныхРабот.Операция,
	|	торо_ПроцентВыполненныхРабот.IDРодителя
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта,
	|	IDОперации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ПроцентВыполненныхРабот.IDРемонта КАК IDРемонта,
	|	торо_ПроцентВыполненныхРабот.IDОперации КАК IDОперации,
	|	торо_ПроцентВыполненныхРабот.Операция КАК Операция,
	|	торо_ПроцентВыполненныхРабот.IDРодителя КАК IDРодителя,
	|	СУММА(торо_ПроцентВыполненныхРабот.Процент) КАК Процент
	|ПОМЕСТИТЬ ВТ_ПроцентыФакт
	|ИЗ
	|	РегистрНакопления.торо_ПроцентВыполненныхРабот КАК торо_ПроцентВыполненныхРабот
	|ГДЕ
	|	торо_ПроцентВыполненныхРабот.ВидДокумента В(&МассивДокументовФакта)
	|	И торо_ПроцентВыполненныхРабот.IDРемонта В
	|			(ВЫБРАТЬ
	|				РО.ID
	|			ИЗ
	|				ВТ_РемонтыОборудованияID КАК РО)
	|	И торо_ПроцентВыполненныхРабот.Регистратор <> &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_ПроцентВыполненныхРабот.IDРемонта,
	|	торо_ПроцентВыполненныхРабот.IDОперации,
	|	торо_ПроцентВыполненныхРабот.Операция,
	|	торо_ПроцентВыполненныхРабот.IDРодителя
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта,
	|	IDОперации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_ПроцентыФакт.IDРемонта, ВТ_ПроцентыПлан.IDРемонта) КАК IDРемонта,
	|	ЕСТЬNULL(ВТ_ПроцентыФакт.IDОперации, ВТ_ПроцентыПлан.IDОперации) КАК IDОперации,
	|	ЕСТЬNULL(ВТ_ПроцентыФакт.Операция, ВТ_ПроцентыПлан.Операция) КАК Операция,
	|	ЕСТЬNULL(ВТ_ПроцентыФакт.IDРодителя, ВТ_ПроцентыПлан.IDРодителя) КАК IDРодителя,
	|	ЕСТЬNULL(ВТ_ПроцентыФакт.Процент, 0) + ЕСТЬNULL(ВТ_ПроцентыПлан.Процент, 0) КАК Процент
	|ПОМЕСТИТЬ ВТ_Проценты
	|ИЗ
	|	ВТ_ПроцентыФакт КАК ВТ_ПроцентыФакт
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ПроцентыПлан КАК ВТ_ПроцентыПлан
	|		ПО ВТ_ПроцентыФакт.IDРемонта = ВТ_ПроцентыПлан.IDРемонта
	|			И ВТ_ПроцентыФакт.IDОперации = ВТ_ПроцентыПлан.IDОперации
	|			И ВТ_ПроцентыФакт.Операция = ВТ_ПроцентыПлан.Операция
	|			И ВТ_ПроцентыФакт.IDРодителя = ВТ_ПроцентыПлан.IDРодителя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРемонтныхРабот.ID КАК ID,
	|	ТаблицаРемонтныхРабот.РемонтнаяРабота КАК РемонтнаяРабота,
	|	ТаблицаРемонтныхРабот.Родитель_ID КАК Родитель_ID,
	|	ТаблицаРемонтныхРабот.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	ТаблицаРемонтныхРабот.Количество КАК Количество,
	|	ТаблицаРемонтныхРабот.Картинка КАК Картинка,
	#Вставка
	|	";
	Если ЕстьПримечание ИЛИ ТипДокумента = Перечисления.торо_ВидДокумента.ЗаявкаНаРемонт 
		ИЛИ ТипДокумента = Перечисления.торо_ВидДокумента.НарядНаВыполнениеРемонтныхРабот Тогда
		Запрос.Текст = Запрос.Текст + "
		|	ТаблицаРемонтныхРабот.гкс_Примечание КАК гкс_Примечание, 
		|	ТаблицаРемонтныхРабот.гкс_ПовКоэф КАК гкс_ПовКоэф, 
		|	ТаблицаРемонтныхРабот.гкс_СпособВыполнения КАК гкс_СпособВыполнения, ";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|	ТаблицаРемонтныхРабот.НомерСтроки КАК НомерСтроки,
	#КонецВставки
	|	ТаблицаРемонтныхРабот.Исполнитель КАК Исполнитель,
	|	ТаблицаРемонтныхРабот.ДоговорБригада КАК ДоговорБригада,
	|	ЕСТЬNULL(РодителиТехОпераций.РемонтнаяРабота, ЗНАЧЕНИЕ(Справочник.торо_ИдентификаторыТехКарт.ПустаяСсылка)) КАК ТехКартаРемонта
	|ПОМЕСТИТЬ ВТ_РемонтныеРаботы
	|ИЗ
	|	ВТ_ТаблицаРемонтовОборудования КАК ТаблицаРемонтныхРабот
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаРемонтовОборудования КАК РодителиТехОпераций
	|		ПО ТаблицаРемонтныхРабот.Родитель_ID = РодителиТехОпераций.ID
	|			И ТаблицаРемонтныхРабот.РемонтыОборудования_ID = РодителиТехОпераций.РемонтыОборудования_ID
	|			И (ВЫРАЗИТЬ(РодителиТехОпераций.РемонтнаяРабота КАК Справочник.торо_ИдентификаторыТехКарт) ССЫЛКА Справочник.торо_ИдентификаторыТехКарт)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	#Вставка
	| Различные
	#КонецВставки
	|	ВТ_РемонтныеРаботы.ID КАК ID,
	|	ВТ_РемонтныеРаботы.РемонтнаяРабота КАК РемонтнаяРабота,
	|	ВТ_РемонтныеРаботы.Родитель_ID КАК Родитель_ID,
	|	ВТ_РемонтныеРаботы.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	ВТ_РемонтныеРаботы.ТехКартаРемонта КАК ТехКартаРемонта,
	|	ВТ_РемонтныеРаботы.Картинка КАК Картинка,
	|	ВТ_РемонтныеРаботы.Количество КАК Количество,
	|	ВТ_РемонтныеРаботы.Исполнитель КАК Исполнитель,
	#Вставка
	|	ВТ_РемонтныеРаботы.НомерСтроки КАК НомерСтроки,
	|	";
	Если ЕстьПримечание ИЛИ ТипДокумента = Перечисления.торо_ВидДокумента.ЗаявкаНаРемонт 
		ИЛИ ТипДокумента = Перечисления.торо_ВидДокумента.НарядНаВыполнениеРемонтныхРабот Тогда
		Запрос.Текст = Запрос.Текст + "
		|	ВТ_РемонтныеРаботы.гкс_Примечание КАК гкс_Примечание, 
		|	ВТ_РемонтныеРаботы.гкс_ПовКоэф КАК гкс_ПовКоэф, 
		|	ВТ_РемонтныеРаботы.гкс_СпособВыполнения КАК гкс_СпособВыполнения, ";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	#КонецВставки
	|	ВТ_РемонтныеРаботы.ДоговорБригада КАК ДоговорБригада,
	|	ВЫБОР
	|		КОГДА ВТ_Проценты.Процент ЕСТЬ NULL
	|			ТОГДА 100
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТ_РемонтныеРаботы.Количество = 0
	|					ТОГДА 0
	|				ИНАЧЕ ВТ_Проценты.Процент / ВТ_РемонтныеРаботы.Количество
	|			КОНЕЦ
	|	КОНЕЦ КАК ПроцентВыполненияРабот,
	|	ВЫБОР
	|		КОГДА ВТ_Проценты.Процент ЕСТЬ NULL
	|				И ТИПЗНАЧЕНИЯ(ВТ_РемонтныеРаботы.РемонтнаяРабота) = ТИП(Справочник.торо_ТехнологическиеОперации)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НоваяОперация
	|ИЗ
	|	ВТ_РемонтныеРаботы КАК ВТ_РемонтныеРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Проценты КАК ВТ_Проценты
	|		ПО ВТ_РемонтныеРаботы.РемонтыОборудования_ID = ВТ_Проценты.IDРемонта
	|			И ВТ_РемонтныеРаботы.РемонтнаяРабота = ВТ_Проценты.Операция
	|			И ВТ_РемонтныеРаботы.ID = ВТ_Проценты.IDОперации
	|ГДЕ
	|	(ВТ_Проценты.Процент ЕСТЬ NULL
	|			ИЛИ ВТ_Проценты.Процент > 0)
	#Вставка
	| Упорядочить ПО ВТ_РемонтныеРаботы.НомерСтроки
	#КонецВставки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_РемонтыОборудованияID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ПроцентыПлан
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ПроцентыФакт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Проценты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_РемонтныеРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ТаблицаРемонтовОборудования
	|";

	МассивДокументовПлана = Новый Массив;
	МассивДокументовФакта = Новый Массив;
	Если ТипДокумента = Перечисления.торо_ВидДокумента.ЗаявкаНаРемонт Тогда
		МассивДокументовПлана.Добавить(Перечисления.торо_ВидДокумента.ЗаявкаНаРемонт);
		МассивДокументовФакта.Добавить(Перечисления.торо_ВидДокумента.ЗакрытиеЗаявокИРемонтов);
		МассивДокументовФакта.Добавить(Перечисления.торо_ВидДокумента.АктОВыполненииЭтапаРабот);
	ИначеЕсли ТипДокумента = Перечисления.торо_ВидДокумента.ПлановыеЗатраты Тогда
		МассивДокументовПлана.Добавить(Перечисления.торо_ВидДокумента.ПлановыеЗатраты);
		МассивДокументовПлана.Добавить(Перечисления.торо_ВидДокумента.ЗаявкаНаРемонт);
		МассивДокументовФакта.Добавить(Перечисления.торо_ВидДокумента.АктОВыполненииЭтапаРабот);
		МассивДокументовФакта.Добавить(Перечисления.торо_ВидДокумента.АктОВыполненииРегламентногоМероприятия);
	ИначеЕсли ТипДокумента = Перечисления.торо_ВидДокумента.НарядНаВыполнениеРемонтныхРабот Тогда
		МассивДокументовПлана.Добавить(Перечисления.торо_ВидДокумента.НарядНаВыполнениеРемонтныхРабот);
		МассивДокументовФакта.Добавить(Перечисления.торо_ВидДокумента.АктОВыполненииЭтапаРабот);
	ИначеЕсли ТипДокумента = Перечисления.торо_ВидДокумента.НарядНаВыполнениеРегламентногоМероприятия Тогда
		МассивДокументовПлана.Добавить(Перечисления.торо_ВидДокумента.НарядНаВыполнениеРегламентногоМероприятия);
		МассивДокументовФакта.Добавить(Перечисления.торо_ВидДокумента.АктОВыполненииРегламентногоМероприятия);
	КонецЕсли;

	Если ТипДокумента <> Перечисления.торо_ВидДокумента.НарядНаВыполнениеРемонтныхРабот И ТипДокумента <> Перечисления.торо_ВидДокумента.ЗаявкаНаРемонт Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТ_РемонтныеРаботы.Исполнитель КАК Исполнитель,", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТ_РемонтныеРаботы.ДоговорБригада КАК ДоговорБригада,", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаРемонтныхРабот.Исполнитель КАК Исполнитель,", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаРемонтныхРабот.ДоговорБригада КАК ДоговорБригада,", "");
	КонецЕсли;

	Если Владелец = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "	И торо_ПроцентВыполненныхРабот.Регистратор <> &Ссылка", "");
	Иначе
		Запрос.УстановитьПараметр("Ссылка", Владелец);
	КонецЕсли; 

	Запрос.УстановитьПараметр("МассивДокументовПлана", МассивДокументовПлана);
	Запрос.УстановитьПараметр("МассивДокументовФакта", МассивДокументовФакта);

КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьПоНормативам")
Процедура Расш_гкс_ЗаполнитьПоНормативам(ДокументОбъект, ДанныеДляЗаполнения)

	ТипЗначенияДокумента = ТипЗнч(ДокументОбъект.Ссылка);

	Для каждого СтрокаРР Из ДанныеДляЗаполнения Цикл

		Для каждого ТабЧасть Из СтрокаРР.СтруктураТаблиц Цикл

			Если ТабЧасть.Ключ = "МатериальныеЗатраты" 
				И (ТипЗначенияДокумента = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") 
				ИЛИ ТипЗначенияДокумента = Тип("ДокументСсылка.торо_АктОВыполненииЭтапаРабот")
				ИЛИ ТипЗначенияДокумента = Тип("ДокументСсылка.торо_АктОВыполненииРегламентногоМероприятия")) Тогда

				ЕстьУпаковка = Ложь;
				Если ТабЧасть.Значение.Колонки.Найти("Упаковка") <> Неопределено Тогда
					ЕстьУпаковка = Истина;
				КонецЕсли;

				Для каждого СтрокаЗатраты Из ТабЧасть.Значение Цикл

					НоваяСтрока = ДокументОбъект.МатериальныеЗатраты.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗатраты);
					НоваяСтрока.ID = СтрокаРР.ID;
					НоваяСтрока.РемонтыОборудования_ID = СтрокаРР.РемонтыОборудования_ID;	
					НоваяСтрока.ХарактеристикаНоменклатуры = СтрокаЗатраты.Характеристика;
					Если ЕстьУпаковка И ЗначениеЗаполнено(СтрокаЗатраты.Упаковка) Тогда 
						НоваяСтрока.ЕдиницаИзмерения = СтрокаЗатраты.Упаковка;
					КонецЕсли;

					Если ТипЗнч(СтрокаРР.ДокументОснование) = Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот") Тогда
						НоваяСтрока.Количество = НоваяСтрока.Количество * СтрокаРР.Количество;
					КонецЕсли; 

				КонецЦикла; 
			КонецЕсли; 

			Если ТабЧасть.Ключ = "ИнструментыИТехника" 
				И ТипЗначенияДокумента = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") Тогда

				Для каждого СтрокаЗатраты Из ТабЧасть.Значение Цикл

					НоваяСтрока = ДокументОбъект.Инструменты.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗатраты);
					НоваяСтрока.ID = СтрокаРР.ID;
					НоваяСтрока.РемонтыОборудования_ID = СтрокаРР.РемонтыОборудования_ID;	

				КонецЦикла; 
			КонецЕсли; 			

			Если ТабЧасть.Ключ = "ТрудовыеЗатраты" 
				И ТипЗначенияДокумента = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") Тогда

				Для каждого СтрокаЗатраты Из ТабЧасть.Значение Цикл

					НоваяСтрока = ДокументОбъект.ТрудовыеЗатраты.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗатраты);
					НоваяСтрока.ID = СтрокаРР.ID;
					НоваяСтрока.РемонтыОборудования_ID = СтрокаРР.РемонтыОборудования_ID;	

					Если ТипЗнч(СтрокаРР.ДокументОснование) = Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот") Тогда
						НоваяСтрока.ВремяРаботы = НоваяСтрока.ВремяРаботы * СтрокаРР.Количество;
					КонецЕсли;				

				КонецЦикла;
			ИначеЕсли ТабЧасть.Ключ = "ТрудовыеЗатраты" Тогда

				Для каждого СтрокаЗатраты Из ТабЧасть.Значение Цикл

					Счетчик = СтрокаЗатраты.Количество;

					Пока Счетчик > 0 Цикл
						Если ТипЗначенияДокумента = Тип("ДокументСсылка.торо_АктОВыполненииЭтапаРабот") 
							ИЛИ ТипЗначенияДокумента = Тип("ДокументСсылка.торо_АктОВыполненииРегламентногоМероприятия") Тогда

							НоваяСтрока = ДокументОбъект.ТрудовыеЗатраты.Добавить();
						Иначе
							НоваяСтрока = ДокументОбъект.Исполнители.Добавить();
						КонецЕсли; 

						Если Не ТипЗначенияДокумента = Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот") 
							И Не ТипЗначенияДокумента = Тип("ДокументСсылка.торо_НарядНаРегламентноеМероприятие") Тогда
							НоваяСтрока.КТУ = 1;
						КонецЕсли; 

						ИсключаемыеСвойства = "";
						Если ТипЗнч(СтрокаРР.ДокументОснование) = Тип("ДокументСсылка.торо_ВыявленныеДефекты") Тогда
							ИсключаемыеСвойства = "ДатаНачала";
						КонецЕсли;

						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗатраты);
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРР,, ИсключаемыеСвойства);
						Счетчик = Счетчик - 1;

						Если ТипЗнч(СтрокаРР.ДокументОснование) = Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот") 
							И ТипЗначенияДокумента = Тип("ДокументСсылка.торо_АктОВыполненииЭтапаРабот") Тогда
							НоваяСтрока.ВремяРаботы = НоваяСтрока.ВремяРаботы * СтрокаРР.Количество;
						КонецЕсли;
						#Вставка
						Если ТипЗначенияДокумента = Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот")
							и ТипЗнч(СтрокаРР.ДокументОснование) = Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот") Тогда 
							НоваяСтрока.гкс_ВремяРаботы = СтрокаЗатраты.ВремяРаботы * СтрокаРР.Количество;
						КонецЕсли;
						#КонецВставки

					КонецЦикла; 

				КонецЦикла;

			КонецЕсли; 

			Если ТабЧасть.Ключ = "МерыБезопасности" 
				И ТипЗначенияДокумента = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт")
				И ТабЧасть.Значение <> Неопределено Тогда

				Для каждого СтрокаЗатраты Из ТабЧасть.Значение Цикл

					НоваяСтрока = ДокументОбъект.МерыБезопасности.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗатраты);
					НоваяСтрока.ID = СтрокаРР.ID;
					НоваяСтрока.РемонтыОборудования_ID = СтрокаРР.РемонтыОборудования_ID;	

				КонецЦикла; 
			КонецЕсли;

		КонецЦикла; 

	КонецЦикла;

	Если ТипЗначенияДокумента = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") 
		ИЛИ ТипЗначенияДокумента = Тип("ДокументСсылка.торо_АктОВыполненииЭтапаРабот") Тогда

		ТаблицаРемонтов = ДокументОбъект.РемонтыОборудования.Выгрузить(, "ОбъектРемонта, ВидРемонтныхРабот, ID");
		ТаблицаРемонтов.Колонки["ID"].Имя = "РемонтыОборудования_ID";
		ТаблицаЗапчастей = торо_Ремонты.ПолучитьДанныеДляЗаполненияЗапчастейПоНормам(ТаблицаРемонтов);	
		Если ТипЗначенияДокумента = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") Тогда
			Для каждого Строка Из ТаблицаЗапчастей Цикл
				НовСтр = ДокументОбъект.ЗапчастиРемонта.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, Строка);
			КонецЦикла;		
		Иначе
			Для каждого Строка Из ТаблицаЗапчастей Цикл
				НовСтр = ДокументОбъект.СерийныеЗапчасти.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, Строка);
			КонецЦикла;		
		КонецЕсли; 

	КонецЕсли; 
КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьРемонтныеРаботы")
Процедура Расш_гкс_ЗаполнитьРемонтныеРаботы(Основание, ДокументОбъект, Владелец)

	ИмяТЧРемонтов = торо_Ремонты.ПолучитьИмяТЧРемонтов(ДокументОбъект.Ссылка);

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ТабОснований = ПолучитьТаблицуДокументовОснований(Основание);
	Запрос.УстановитьПараметр("ТаблицаДокументовОснований", ТабОснований);
	Запрос.УстановитьПараметр("Ремонты", ДокументОбъект[ИмяТЧРемонтов].Выгрузить());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДокументовОснований.Ключ КАК ID,
	|	ТаблицаДокументовОснований.Значение КАК Ссылка
	|ПОМЕСТИТЬ ТаблицаДокументовОснований
	|ИЗ
	|	&ТаблицаДокументовОснований КАК ТаблицаДокументовОснований
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ремонты.ID КАК ID,
	|	Ремонты.ОбъектРемонта КАК ОбъектРемонта,
	|	Ремонты.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	Ремонты.ДокументИсточник КАК ДокументИсточник,
	|	Ремонты.ДатаНачала КАК ДатаНачала,
	|	Ремонты.ДатаОкончания КАК ДатаОкончания
	|ПОМЕСТИТЬ Ремонты
	|ИЗ
	|	&Ремонты КАК Ремонты";

	Запрос.Выполнить();

	ТабОснованийКопия = ТабОснований.Скопировать();
	ТабОснованийКопия.Свернуть("Значение");
	МассивОснований = ТабОснованийКопия.ВыгрузитьКолонку("Значение");

	Для каждого Элемент Из МассивОснований Цикл

		ТипЗначенияДокументаОснования = ТипЗнч(Элемент);

		Если ТипЗначенияДокументаОснования = Тип("ДокументСсылка.торо_ВыявленныеДефекты") Тогда
			ПолучитьТекстЗапросаРемонтныхРаботПоОснованию(Запрос, ТипЗначенияДокументаОснования, Владелец, Элемент.ДатаОбнаружения);
		Иначе
			ПолучитьТекстЗапросаРемонтныхРаботПоОснованию(Запрос, ТипЗначенияДокументаОснования, Владелец, ДокументОбъект.Дата);	
		КонецЕсли; 

		Если ДокументОбъект[ИмяТЧРемонтов].Количество() > 0 Тогда

			НайдСтр = ТабОснований.НайтиСтроки(Новый Структура("Значение", Элемент));
			МассивID = ТабОснований.Скопировать(НайдСтр, "Ключ");
			Запрос.УстановитьПараметр("МассивID", МассивID);

			ТаблицаРемонтыхРабот = Запрос.Выполнить().Выгрузить();

			// Устанавливаем ID с учетом подчиненности для нормативных ремонтов. 
			// Намеренно заполняем все поля вне зависимости их наличия в приемнике.
			Если ТипЗначенияДокументаОснования = Тип("ДокументСсылка.торо_ПланГрафикРемонта")
				ИЛИ ТипЗначенияДокументаОснования = Тип("ДокументСсылка.торо_ВыявленныеДефекты") 
				ИЛИ ТипЗначенияДокументаОснования = Тип("ДокументСсылка.торо_ГрафикРегламентныхМероприятийТОиР") Тогда

				Если ТипЗначенияДокументаОснования <> Тип("ДокументСсылка.торо_ВыявленныеДефекты") Тогда
					ТаблицаРемонтыхРабот = ПолучитьIDТК(ТаблицаРемонтыхРабот);
				Иначе 
					ТаблицаРемонтыхРабот.Колонки.Добавить("ID");
				КонецЕсли;

				ОписаниеТипаСтроки = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(36));

				ТаблицаРемонтыхРабот.Колонки.Добавить("Родитель_ID", ОписаниеТипаСтроки);
				ТаблицаРемонтыхРабот.Колонки.Добавить("ПроцентВыполненияРабот", Новый ОписаниеТипов("Число"));
				ТаблицаРемонтыхРабот.Колонки.Добавить("НоваяОперация", Новый ОписаниеТипов("Булево"));
				ТаблицаРемонтыхРабот.ЗаполнитьЗначения(100, "ПроцентВыполненияРабот");

				ТаблицаРемонтыхРабот.Индексы.Добавить("Родитель_IDЧисло");

				Для каждого СтрокаРемРабот Из ТаблицаРемонтыхРабот Цикл
					Если ЗначениеЗаполнено(СтрокаРемРабот.IDСтрока) Тогда
						Идентификатор = СтрокаРемРабот.IDСтрока;
					ИначеЕсли ЗначениеЗаполнено(СтрокаРемРабот.ID) Тогда
						Идентификатор = СтрокаРемРабот.ID;
					Иначе
						Идентификатор = Строка(Новый УникальныйИдентификатор());
					КонецЕсли;
					Если ТипЗнч(СтрокаРемРабот.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации")
						И ТипЗначенияДокументаОснования = Тип("ДокументСсылка.торо_ВыявленныеДефекты") Тогда
						СтрокаРемРабот.НоваяОперация = Истина;
						Идентификатор = Строка(Новый УникальныйИдентификатор());
					КонецЕсли; 

					Если СтрокаРемРабот.IDЧисло <> 0 И СтрокаРемРабот.IDЧисло <> "" Тогда

						ПараметрыОтбора = Новый Структура("Родитель_IDЧисло, РемонтыОборудования_ID", СтрокаРемРабот.IDЧисло, СтрокаРемРабот.РемонтыОборудования_ID); 
						НайденныеСтроки = ТаблицаРемонтыхРабот.НайтиСтроки(ПараметрыОтбора);
						Для каждого ПодчиненнаяСтрока Из НайденныеСтроки Цикл
							ПодчиненнаяСтрока.Родитель_ID = Идентификатор; 
							ПодчиненнаяСтрока.Количество = ПодчиненнаяСтрока.Количество * СтрокаРемРабот.Количество; 
						КонецЦикла; 

					КонецЕсли;
					СтрокаРемРабот.ID = Идентификатор;
				КонецЦикла; 

				Если ТипЗначенияДокументаОснования <> Тип("ДокументСсылка.торо_ВыявленныеДефекты") Тогда
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ТаблицаРемонтыхРабот.ID КАК ID,
					|	ТаблицаРемонтыхРабот.РемонтнаяРабота КАК РемонтнаяРабота,
					|	ТаблицаРемонтыхРабот.Родитель_ID КАК Родитель_ID,
					|	ТаблицаРемонтыхРабот.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
					|	ТаблицаРемонтыхРабот.Количество КАК Количество,
					|	ТаблицаРемонтыхРабот.Картинка КАК Картинка
					#Вставка
					| ";
					Если ТаблицаРемонтыхРабот.Колонки.Найти("НомерСтроки") = Неопределено Тогда 
						Запрос.Текст = Запрос.Текст + "
						|, 0 КАК НомерСтроки";
					Иначе
						Запрос.Текст = Запрос.Текст + "
						|, ТаблицаРемонтыхРабот.НомерСтроки КАК НомерСтроки";
					КонецЕсли;
					// гкс+ [] Деснол 16.08.2022
					Если ТаблицаРемонтыхРабот.Колонки.Найти("гкс_Примечание") = Неопределено Тогда 
						Запрос.Текст = Запрос.Текст + "
						|, """" КАК гкс_Примечание
						|, """" КАК гкс_СпособВыполнения";
					Иначе
						Запрос.Текст = Запрос.Текст + "
						|, ТаблицаРемонтыхРабот.гкс_Примечание КАК гкс_Примечание
						|, ТаблицаРемонтыхРабот.гкс_СпособВыполнения КАК гкс_СпособВыполнения";
					КонецЕсли;
					Если ТаблицаРемонтыхРабот.Колонки.Найти("гкс_ПовКоэф") = Неопределено Тогда 
						Запрос.Текст = Запрос.Текст + "
						|, """" КАК гкс_ПовКоэф";
					Иначе
						Запрос.Текст = Запрос.Текст + "
						|, ТаблицаРемонтыхРабот.гкс_ПовКоэф КАК гкс_ПовКоэф";
					КонецЕсли;
					// гкс- [] Деснол 16.08.2022
					Запрос.Текст = Запрос.Текст + "
					#КонецВставки
					|ПОМЕСТИТЬ ВТ_ТаблицаРемонтовОборудования
					|ИЗ
					|	&ТаблицаРемонтыхРабот КАК ТаблицаРемонтыхРабот";

					ДополнитьЗапросПроцентами(Запрос, Перечисления.торо_ВидДокумента.ПлановыеЗатраты, Владелец);
					Запрос.УстановитьПараметр("ТаблицаРемонтыхРабот", ТаблицаРемонтыхРабот);

					ТаблицаРемонтыхРабот = Запрос.Выполнить().Выгрузить();

				КонецЕсли; 

			КонецЕсли; 

			Для каждого СтрокаРемРабот Из ТаблицаРемонтыхРабот Цикл
				НоваяРемонтнаяРабота = ДокументОбъект.РемонтныеРаботы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяРемонтнаяРабота, СтрокаРемРабот);
			КонецЦикла;			
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

// гкс+ [] Деснол 16.08.2022
&ИзменениеИКонтроль("ДополнитьЗапросРемонтнымиРаботамиИзНормативов")
Процедура гкс_ДополнитьЗапросРемонтнымиРаботамиИзНормативов(Запрос)

	Запрос.Текст = Запрос.Текст + "
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|" + "ВЫБРАТЬ
	|	ВТ_НормативыРемонта.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	торо_ВерсииТехКарт.ТехКарта КАК ТехКарта,
	|	торо_ВерсииТехКарт.Период КАК Период,
	|	ВТ_НормативыРемонта.Ссылка КАК Ссылка,
	|	ВТ_НормативыРемонта.Родитель_ID КАК Родитель_ID,
	|	ВТ_НормативыРемонта.Количество КАК Количество,
	|	ВТ_НормативыРемонта.Картинка КАК Картинка,
	|	ВТ_НормативыРемонта.РемонтнаяРабота КАК РемонтнаяРабота
	|ПОМЕСТИТЬ ВТ_ВерсииТК
	|ИЗ
	|	ВТ_НормативыРемонта КАК ВТ_НормативыРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВерсииТехКарт КАК торо_ВерсииТехКарт
	|		ПО ВТ_НормативыРемонта.РемонтнаяРабота = торо_ВерсииТехКарт.ИдентификаторТехКарты
	|ГДЕ
	|	торо_ВерсииТехКарт.Период <= ВТ_НормативыРемонта.ДатаНачала
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВерсииТК.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	МАКСИМУМ(ВТ_ВерсииТК.Период) КАК Период,
	|	ВТ_ВерсииТК.РемонтнаяРабота КАК РемонтнаяРабота
	|ПОМЕСТИТЬ ВТ_МаксимумыПериодовТК
	|ИЗ
	|	ВТ_ВерсииТК КАК ВТ_ВерсииТК
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВерсииТК.РемонтыОборудования_ID,
	|	ВТ_ВерсииТК.РемонтнаяРабота
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РемонтнаяРабота
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВерсииТК.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ВерсииТК.ТехКарта) КАК ID,
	|	ВТ_ВерсииТК.Период КАК Период,
	|	ВТ_ВерсииТК.Ссылка КАК Ссылка,
	|	ВТ_ВерсииТК.Родитель_ID КАК Родитель_ID,
	|	ВТ_ВерсииТК.Количество КАК Количество,
	|	ВТ_ВерсииТК.Картинка КАК Картинка,
	|	ВТ_ВерсииТК.РемонтнаяРабота КАК РемонтнаяРабота,
	|	ВТ_ВерсииТК.ТехКарта КАК ТехКарта
	|ПОМЕСТИТЬ ВТ_НумерацияСтрокТК
	|ИЗ
	|	ВТ_ВерсииТК КАК ВТ_ВерсииТК
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВерсииТК КАК ВТ_ВерсииТК1
	|		ПО ВТ_ВерсииТК.ТехКарта > ВТ_ВерсииТК1.ТехКарта
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВерсииТК.РемонтыОборудования_ID,
	|	ВТ_ВерсииТК.Период,
	|	ВТ_ВерсииТК.Ссылка,
	|	ВТ_ВерсииТК.Родитель_ID,
	|	ВТ_ВерсииТК.Количество,
	|	ВТ_ВерсииТК.Картинка,
	|	ВТ_ВерсииТК.РемонтнаяРабота,
	|	ВТ_ВерсииТК.ТехКарта
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РемонтыОборудования_ID,
	|	Период,
	|	РемонтнаяРабота
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НумерацияСтрокТК.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	ВТ_НумерацияСтрокТК.ТехКарта КАК РемонтнаяРабота,
	|	ВТ_НумерацияСтрокТК.Ссылка КАК Ссылка,
	|	ВТ_НумерацияСтрокТК.ID + 500 КАК ID,
	|	ВТ_НумерацияСтрокТК.Родитель_ID КАК Родитель_ID,
	|	ВТ_НумерацияСтрокТК.Количество КАК Количество,
	|	ВТ_НумерацияСтрокТК.Картинка КАК Картинка
	|ПОМЕСТИТЬ ВТ_ВерсияТК
	|ИЗ
	|	ВТ_НумерацияСтрокТК КАК ВТ_НумерацияСтрокТК
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МаксимумыПериодовТК КАК ВТ_МаксимумыПериодовТК
	|		ПО ВТ_НумерацияСтрокТК.РемонтыОборудования_ID = ВТ_МаксимумыПериодовТК.РемонтыОборудования_ID
	|			И ВТ_НумерацияСтрокТК.Период = ВТ_МаксимумыПериодовТК.Период
	|			И (ВТ_МаксимумыПериодовТК.РемонтнаяРабота = ВТ_НумерацияСтрокТК.РемонтнаяРабота)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РемонтнаяРабота
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВерсияТК.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	ВТ_ВерсияТК.Ссылка КАК Ссылка,
	|	ВТ_ВерсияТК.ID КАК Родитель_ID,
	|	ВТ_ВерсияТК.Картинка КАК Картинка,
	|	торо_СоставИерархическихТехКартРемонтов.Количество КАК Количество,
	|	торо_СоставИерархическихТехКартРемонтов.Состав КАК РемонтнаяРабота,
	|	торо_СоставИерархическихТехКартРемонтов.ТехКарта КАК ТехКарта
	|ПОМЕСТИТЬ ВТ_ПодчиненныеТК
	|ИЗ
	|	ВТ_ВерсияТК КАК ВТ_ВерсияТК
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_СоставИерархическихТехКартРемонтов КАК торо_СоставИерархическихТехКартРемонтов
	|		ПО ВТ_ВерсияТК.РемонтнаяРабота = торо_СоставИерархическихТехКартРемонтов.ТехКарта
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РемонтнаяРабота
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ПодчиненныеТК1.РемонтнаяРабота) КАК ID,
	|	ВТ_ПодчиненныеТК.РемонтнаяРабота КАК РемонтнаяРабота,
	|	ВТ_ПодчиненныеТК.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	ВТ_ПодчиненныеТК.Ссылка КАК Ссылка,
	|	ВТ_ПодчиненныеТК.Родитель_ID КАК Родитель_ID,
	|	ВТ_ПодчиненныеТК.Картинка КАК Картинка,
	|	ВТ_ПодчиненныеТК.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_НумерацияСтрокВложенныхТК
	|ИЗ
	|	ВТ_ПодчиненныеТК КАК ВТ_ПодчиненныеТК
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПодчиненныеТК КАК ВТ_ПодчиненныеТК1
	|		ПО ВТ_ПодчиненныеТК.РемонтнаяРабота >= ВТ_ПодчиненныеТК1.РемонтнаяРабота
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПодчиненныеТК.РемонтнаяРабота,
	|	ВТ_ПодчиненныеТК.РемонтыОборудования_ID,
	|	ВТ_ПодчиненныеТК.Ссылка,
	|	ВТ_ПодчиненныеТК.Родитель_ID,
	|	ВТ_ПодчиненныеТК.Картинка,
	|	ВТ_ПодчиненныеТК.Количество
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВерсияТК.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	ВТ_ВерсияТК.Ссылка КАК Ссылка,
	|	ВТ_ВерсияТК.ID КАК ID,
	|	ВТ_ВерсияТК.Родитель_ID КАК Родитель_ID,
	|	ВТ_ВерсияТК.Картинка КАК Картинка,
	|	ВТ_ВерсияТК.Количество КАК Количество,
	|	ВТ_ВерсияТК.РемонтнаяРабота КАК РемонтнаяРабота
	|ПОМЕСТИТЬ ВТ_ИерархияТК
	|ИЗ
	|	ВТ_ВерсияТК КАК ВТ_ВерсияТК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_НумерацияСтрокВложенныхТК.РемонтыОборудования_ID,
	|	ВТ_НумерацияСтрокВложенныхТК.Ссылка,
	|	ВТ_НумерацияСтрокВложенныхТК.ID,
	|	ВТ_НумерацияСтрокВложенныхТК.Родитель_ID,
	|	ВТ_НумерацияСтрокВложенныхТК.Картинка,
	|	ВТ_НумерацияСтрокВложенныхТК.Количество,
	|	ВТ_НумерацияСтрокВложенныхТК.РемонтнаяРабота
	|ИЗ
	|	ВТ_НумерацияСтрокВложенныхТК КАК ВТ_НумерацияСтрокВложенныхТК
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РемонтнаяРабота
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИерархияТК.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	ВТ_ИерархияТК.Ссылка КАК Ссылка,
	|	0 КАК ID,
	|	ВТ_ИерархияТК.ID КАК Родитель_ID,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(торо_ТехКартыСписокОпераций.Операция) = ТИП(Справочник.торо_ТехнологическиеОперации)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Картинка,
	|	торо_ТехКартыСписокОпераций.Операция КАК РемонтнаяРабота,
	|	СУММА(торо_ТехКартыСписокОпераций.Количество) КАК Количество,
	|	торо_ТехКартыСписокОпераций.ID КАК IDСтрока,
	|	торо_ТехКартыСписокОпераций.НомерСтроки КАК НомерСтроки
	#Вставка
	|	,торо_ТехКартыСписокОпераций.гкс_Примечание КАК гкс_Примечание
	|	,торо_ТехКартыСписокОпераций.СпособВыполнения КАК гкс_СпособВыполнения
	#КонецВставки
	|ПОМЕСТИТЬ ВТ_ВложенныеИдентификаторы
	|ИЗ
	|	ВТ_ИерархияТК КАК ВТ_ИерархияТК
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ТехКарты.СписокОпераций КАК торо_ТехКартыСписокОпераций
	|		ПО ВТ_ИерархияТК.РемонтнаяРабота = торо_ТехКартыСписокОпераций.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ИерархияТК.РемонтыОборудования_ID,
	|	ВТ_ИерархияТК.Ссылка,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(торо_ТехКартыСписокОпераций.Операция) = ТИП(Справочник.торо_ТехнологическиеОперации)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	торо_ТехКартыСписокОпераций.Операция,
	|	ВТ_ИерархияТК.ID,
	|	торо_ТехКартыСписокОпераций.ID,
	|	торо_ТехКартыСписокОпераций.НомерСтроки
	#Вставка
	|	,торо_ТехКартыСписокОпераций.гкс_Примечание
	|	,торо_ТехКартыСписокОпераций.СпособВыполнения
	#КонецВставки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВложенныеИдентификаторы.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	ВТ_ВложенныеИдентификаторы.Ссылка КАК Ссылка,
	|	ВТ_ВложенныеИдентификаторы.ID КАК ID,
	|	ВТ_ВложенныеИдентификаторы.Родитель_ID КАК Родитель_ID,
	|	ВТ_ВложенныеИдентификаторы.Картинка КАК Картинка,
	|	ВТ_ВложенныеИдентификаторы.Количество КАК Количество,
	|	ВТ_ВложенныеИдентификаторы.РемонтнаяРабота КАК РемонтнаяРабота,
	|	ВТ_ВложенныеИдентификаторы.IDСтрока КАК IDСтрока,
	|	ВТ_ВложенныеИдентификаторы.НомерСтроки КАК НомерСтроки
	#Вставка
	|	,ВТ_ВложенныеИдентификаторы.гкс_Примечание КАК гкс_Примечание
	|	,ВТ_ВложенныеИдентификаторы.гкс_СпособВыполнения КАК гкс_СпособВыполнения
	#КонецВставки
	|ПОМЕСТИТЬ ВТ_БезИерархии
	|ИЗ
	|	ВТ_ВложенныеИдентификаторы КАК ВТ_ВложенныеИдентификаторы
	|ГДЕ
	|	ВТ_ВложенныеИдентификаторы.Картинка = 0
	|	И НЕ ВТ_ВложенныеИдентификаторы.Количество ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ИерархияТК.РемонтыОборудования_ID,
	|	ВТ_ИерархияТК.Ссылка,
	|	ВТ_ИерархияТК.ID,
	|	ВТ_ИерархияТК.Родитель_ID,
	|	ВТ_ИерархияТК.Картинка,
	|	ВТ_ИерархияТК.Количество,
	|	торо_ВерсииТехКартСрезПоследних.ИдентификаторТехКарты,
	|	"""",
	|	0
	#Вставка
	|	,""""
	|	,NULL
	#КонецВставки
	|ИЗ
	|	ВТ_ИерархияТК КАК ВТ_ИерархияТК
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВерсииТехКарт КАК торо_ВерсииТехКартСрезПоследних
	|		ПО ВТ_ИерархияТК.РемонтнаяРабота = торо_ВерсииТехКартСрезПоследних.ТехКарта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_БезИерархии.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	ВТ_БезИерархии.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ВТ_БезИерархии.ID) КАК IDЧисло,
	|	МИНИМУМ(ВТ_БезИерархии.Родитель_ID) КАК Родитель_IDЧисло,
	|	ВТ_БезИерархии.Картинка КАК Картинка,
	|	ВТ_БезИерархии.РемонтнаяРабота КАК РемонтнаяРабота,
	|	МАКСИМУМ(ВТ_БезИерархии.Количество) КАК Количество,
	|	МАКСИМУМ(ВТ_БезИерархии.IDСтрока) КАК IDСтрока,
	|	МАКСИМУМ(ВТ_БезИерархии.НомерСтроки) КАК НомерСтроки
	#Вставка
	|	,ВТ_БезИерархии.гкс_Примечание КАК гкс_Примечание
	|	,ВТ_БезИерархии.гкс_СпособВыполнения КАК гкс_СпособВыполнения
	#КонецВставки
	|ПОМЕСТИТЬ ВТ_БезСортировки
	|ИЗ
	|	ВТ_БезИерархии КАК ВТ_БезИерархии
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_БезИерархии.РемонтыОборудования_ID,
	|	ВТ_БезИерархии.Ссылка,
	|	ВТ_БезИерархии.Картинка,
	|	ВТ_БезИерархии.РемонтнаяРабота,
	|	ВТ_БезИерархии.Количество
	#Вставка
	|	,ВТ_БезИерархии.гкс_Примечание
	|	,ВТ_БезИерархии.гкс_СпособВыполнения
	#КонецВставки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ВложенныеИдентификаторы.РемонтыОборудования_ID,
	|	ВТ_ВложенныеИдентификаторы.Ссылка,
	|	ВТ_ВложенныеИдентификаторы.ID,
	|	ВТ_ВложенныеИдентификаторы.Родитель_ID,
	|	ВТ_ВложенныеИдентификаторы.Картинка,
	|	ВТ_ВложенныеИдентификаторы.РемонтнаяРабота,
	|	ВТ_ВложенныеИдентификаторы.Количество,
	|	ВТ_ВложенныеИдентификаторы.IDСтрока,
	|	ВТ_ВложенныеИдентификаторы.НомерСтроки
	#Вставка
	|	,ВТ_ВложенныеИдентификаторы.гкс_Примечание КАК гкс_Примечание
	|	,ВТ_ВложенныеИдентификаторы.гкс_СпособВыполнения КАК гкс_СпособВыполнения
	#КонецВставки
	|ИЗ
	|	ВТ_ВложенныеИдентификаторы КАК ВТ_ВложенныеИдентификаторы
	|ГДЕ
	|	ВТ_ВложенныеИдентификаторы.Картинка = 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_БезСортировки.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	ВТ_БезСортировки.Ссылка КАК Ссылка,
	|	ВТ_БезСортировки.IDЧисло КАК IDЧисло,
	|	ВТ_БезСортировки.Родитель_IDЧисло КАК Родитель_IDЧисло,
	|	ВТ_БезСортировки.Картинка КАК Картинка,
	|	ВТ_БезСортировки.РемонтнаяРабота КАК РемонтнаяРабота,
	|	ВТ_БезСортировки.Количество КАК Количество,
	|	ВТ_БезСортировки.IDСтрока КАК IDСтрока,
	|	ВТ_БезСортировки.НомерСтроки КАК НомерСтроки
	#Вставка
	|	,ВТ_БезСортировки.гкс_Примечание КАК гкс_Примечание
	|	,ВТ_БезСортировки.гкс_СпособВыполнения КАК гкс_СпособВыполнения
	#КонецВставки
	|ИЗ
	|	ВТ_БезСортировки КАК ВТ_БезСортировки
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки"
	+ ";
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ВерсииТК
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_МаксимумыПериодовТК
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_НумерацияСтрокТК
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ВерсияТК
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ПодчиненныеТК
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_НумерацияСтрокВложенныхТК
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИерархияТК
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ВложенныеИдентификаторы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_БезИерархии
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_НормативыРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_БезСортировки			  
	|" 
	+ "; "; 
КонецПроцедуры // гкс- [] Деснол 16.08.2022

// гкс+ [] Деснол 16.08.2022
&ИзменениеИКонтроль("ПолучитьIDТК")
Функция гкс_ПолучитьIDТК(ТаблицаБезID)
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТаблицаБезID.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	ТаблицаБезID.Ссылка КАК Ссылка,
	|	ТаблицаБезID.IDЧисло КАК IDЧисло,
	|	ТаблицаБезID.Родитель_IDЧисло КАК Родитель_IDЧисло,
	|	ТаблицаБезID.Картинка КАК Картинка,
	|	ТаблицаБезID.РемонтнаяРабота КАК РемонтнаяРабота,
	|	ТаблицаБезID.Количество КАК Количество,
	|	ТаблицаБезID.IDСтрока КАК IDСтрока,
	|	ТаблицаБезID.НомерСтроки КАК НомерСтроки,
	#Вставка
	| ";
	Если ТаблицаБезID.Колонки.Найти("гкс_Примечание") = Неопределено Тогда 
		Запрос.Текст = Запрос.Текст + "
		|	"""" КАК гкс_Примечание
		|	,NULL КАК гкс_СпособВыполнения, ";
	Иначе
		Запрос.Текст = Запрос.Текст + "
		|	ТаблицаБезID.гкс_Примечание КАК гкс_Примечание
		|	,ТаблицаБезID.гкс_СпособВыполнения КАК гкс_СпособВыполнения, ";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	#КонецВставки
	|	"""" КАК ID
	|ПОМЕСТИТЬ ВТ_ТаблицаБезID
	|ИЗ
	|	&ТаблицаБезID КАК ТаблицаБезID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТаблицаБезID.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	ВТ_ТаблицаБезID.Ссылка КАК Ссылка,
	|	ВТ_ТаблицаБезID.IDЧисло КАК IDЧисло,
	|	ВТ_ТаблицаБезID.Родитель_IDЧисло КАК Родитель_IDЧисло,
	|	ВТ_ТаблицаБезID.Картинка КАК Картинка,
	|	ВТ_ТаблицаБезID.РемонтнаяРабота КАК РемонтнаяРабота,
	|	ВТ_ТаблицаБезID.Количество КАК Количество,
	|	ВТ_ТаблицаБезID.IDСтрока КАК IDСтрока,
	|	ВТ_ТаблицаБезID.НомерСтроки КАК НомерСтроки,
	#Вставка
	|	ВТ_ТаблицаБезID.гкс_Примечание КАК гкс_Примечание
	|	,ВТ_ТаблицаБезID.гкс_СпособВыполнения КАК гкс_СпособВыполнения,
	#КонецВставки
	|	ВЫБОР
	|		КОГДА НЕ торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.ID ЕСТЬ NULL
	|			ТОГДА торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.ID
	|		КОГДА НЕ торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.ID ЕСТЬ NULL
	|			ТОГДА торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.ID
	|		КОГДА НЕ торо_ЗаявкаНаРемонтРемонтныеРаботы.ID ЕСТЬ NULL
	|			ТОГДА торо_ЗаявкаНаРемонтРемонтныеРаботы.ID
	|		КОГДА НЕ торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.ID ЕСТЬ NULL
	|			ТОГДА торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.ID
	|		КОГДА НЕ торо_НарядНаРегламентноеМероприятиеРемонтныеРаботы.ID ЕСТЬ NULL
	|			ТОГДА торо_НарядНаРегламентноеМероприятиеРемонтныеРаботы.ID
	|		ИНАЧЕ ВТ_ТаблицаБезID.ID
	|	КОНЕЦ КАК ID
	|ПОМЕСТИТЬ ВТ_ТаблицаСЛишнимиID
	|ИЗ
	|	ВТ_ТаблицаБезID КАК ВТ_ТаблицаБезID
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтныеРаботы КАК торо_АктОВыполненииЭтапаРаботРемонтныеРаботы
	|		ПО ВТ_ТаблицаБезID.РемонтыОборудования_ID = торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтыОборудования_ID
	|			И ВТ_ТаблицаБезID.РемонтнаяРабота = торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтнаяРабота
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииРегламентногоМероприятия.РемонтныеРаботы КАК торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы
	|		ПО ВТ_ТаблицаБезID.РемонтыОборудования_ID = торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.РемонтыОборудования_ID
	|			И ВТ_ТаблицаБезID.РемонтнаяРабота = торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.РемонтнаяРабота
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтныеРаботы КАК торо_ЗаявкаНаРемонтРемонтныеРаботы
	|		ПО ВТ_ТаблицаБезID.РемонтыОборудования_ID = торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтыОборудования_ID
	|			И ВТ_ТаблицаБезID.РемонтнаяРабота = торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтнаяРабота
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтныеРаботы КАК торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы
	|		ПО ВТ_ТаблицаБезID.РемонтыОборудования_ID = торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.РемонтыОборудования_ID
	|			И ВТ_ТаблицаБезID.РемонтнаяРабота = торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.РемонтнаяРабота
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_НарядНаРегламентноеМероприятие.РемонтныеРаботы КАК торо_НарядНаРегламентноеМероприятиеРемонтныеРаботы
	|		ПО ВТ_ТаблицаБезID.РемонтыОборудования_ID = торо_НарядНаРегламентноеМероприятиеРемонтныеРаботы.РемонтыОборудования_ID
	|			И ВТ_ТаблицаБезID.РемонтнаяРабота = торо_НарядНаРегламентноеМероприятиеРемонтныеРаботы.РемонтнаяРабота
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаСЛишнимиID.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	ВТ_ТаблицаСЛишнимиID.Ссылка КАК Ссылка,
	|	ВТ_ТаблицаСЛишнимиID.IDЧисло КАК IDЧисло,
	|	ВТ_ТаблицаСЛишнимиID.Родитель_IDЧисло КАК Родитель_IDЧисло,
	|	ВТ_ТаблицаСЛишнимиID.Картинка КАК Картинка,
	|	ВТ_ТаблицаСЛишнимиID.РемонтнаяРабота КАК РемонтнаяРабота,
	|	ВТ_ТаблицаСЛишнимиID.Количество КАК Количество,
	|	ВТ_ТаблицаСЛишнимиID.IDСтрока КАК IDСтрока,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ТаблицаСЛишнимиID.ID) КАК КоличествоID,
	|	ВТ_ТаблицаСЛишнимиID.НомерСтроки КАК НомерСтроки
	#Вставка
	|	,ВТ_ТаблицаСЛишнимиID.гкс_Примечание КАК гкс_Примечание
	|	,ВТ_ТаблицаСЛишнимиID.гкс_СпособВыполнения КАК гкс_СпособВыполнения
	#КонецВставки
	|ПОМЕСТИТЬ ВТ_КоличествоПрисоединенныхТО
	|ИЗ
	|	ВТ_ТаблицаСЛишнимиID КАК ВТ_ТаблицаСЛишнимиID
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаСЛишнимиID.РемонтыОборудования_ID,
	|	ВТ_ТаблицаСЛишнимиID.Ссылка,
	|	ВТ_ТаблицаСЛишнимиID.IDЧисло,
	|	ВТ_ТаблицаСЛишнимиID.Родитель_IDЧисло,
	|	ВТ_ТаблицаСЛишнимиID.Картинка,
	|	ВТ_ТаблицаСЛишнимиID.РемонтнаяРабота,
	|	ВТ_ТаблицаСЛишнимиID.Количество,
	|	ВТ_ТаблицаСЛишнимиID.IDСтрока,
	|	ВТ_ТаблицаСЛишнимиID.НомерСтроки
	#Вставка
	|	,ВТ_ТаблицаСЛишнимиID.гкс_Примечание
	|	,ВТ_ТаблицаСЛишнимиID.гкс_СпособВыполнения
	#КонецВставки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаСЛишнимиID.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	ВТ_ТаблицаСЛишнимиID.Ссылка КАК Ссылка,
	|	ВТ_ТаблицаСЛишнимиID.IDЧисло КАК IDЧисло,
	|	ВТ_ТаблицаСЛишнимиID.Родитель_IDЧисло КАК Родитель_IDЧисло,
	|	ВТ_ТаблицаСЛишнимиID.Картинка КАК Картинка,
	|	ВТ_ТаблицаСЛишнимиID.РемонтнаяРабота КАК РемонтнаяРабота,
	|	ВТ_ТаблицаСЛишнимиID.Количество КАК Количество,
	|	ВТ_ТаблицаСЛишнимиID.IDСтрока КАК IDСтрока,
	|	ВТ_ТаблицаСЛишнимиID.ID КАК ID,
	|	ВТ_ТаблицаСЛишнимиID.НомерСтроки КАК НомерСтроки
	#Вставка
	|	,ВТ_ТаблицаСЛишнимиID.гкс_Примечание КАК гкс_Примечание
	|	,ВТ_ТаблицаСЛишнимиID.гкс_СпособВыполнения КАК гкс_СпособВыполнения
	#КонецВставки
	|ПОМЕСТИТЬ ВТ_ЕдиничныеТО
	|ИЗ
	|	ВТ_ТаблицаСЛишнимиID КАК ВТ_ТаблицаСЛишнимиID
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КоличествоПрисоединенныхТО КАК ВТ_КоличествоПрисоединенныхТО
	|		ПО ВТ_ТаблицаСЛишнимиID.РемонтыОборудования_ID = ВТ_КоличествоПрисоединенныхТО.РемонтыОборудования_ID
	|			И ВТ_ТаблицаСЛишнимиID.Ссылка = ВТ_КоличествоПрисоединенныхТО.Ссылка
	|			И ВТ_ТаблицаСЛишнимиID.IDЧисло = ВТ_КоличествоПрисоединенныхТО.IDЧисло
	|			И ВТ_ТаблицаСЛишнимиID.Родитель_IDЧисло = ВТ_КоличествоПрисоединенныхТО.Родитель_IDЧисло
	|			И ВТ_ТаблицаСЛишнимиID.РемонтнаяРабота = ВТ_КоличествоПрисоединенныхТО.РемонтнаяРабота
	|			И ВТ_ТаблицаСЛишнимиID.Количество = ВТ_КоличествоПрисоединенныхТО.Количество
	|			И ВТ_ТаблицаСЛишнимиID.IDСтрока = ВТ_КоличествоПрисоединенныхТО.IDСтрока
	|ГДЕ
	|	ВТ_КоличествоПрисоединенныхТО.КоличествоID = 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаСЛишнимиID.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	ВТ_ТаблицаСЛишнимиID.Ссылка КАК Ссылка,
	|	ВТ_ТаблицаСЛишнимиID.IDЧисло КАК IDЧисло,
	|	ВТ_ТаблицаСЛишнимиID.Родитель_IDЧисло КАК Родитель_IDЧисло,
	|	ВТ_ТаблицаСЛишнимиID.Картинка КАК Картинка,
	|	ВТ_ТаблицаСЛишнимиID.РемонтнаяРабота КАК РемонтнаяРабота,
	|	ВТ_ТаблицаСЛишнимиID.Количество КАК Количество,
	|	ВТ_ТаблицаСЛишнимиID.IDСтрока КАК IDСтрока,
	|	ВТ_ТаблицаСЛишнимиID.ID КАК ID,
	|	ВТ_ТаблицаСЛишнимиID.НомерСтроки КАК НомерСтроки
	#Вставка
	|	,ВТ_ТаблицаСЛишнимиID.гкс_Примечание КАК гкс_Примечание
	|	,ВТ_ТаблицаСЛишнимиID.гкс_СпособВыполнения КАК гкс_СпособВыполнения
	#КонецВставки
	|ПОМЕСТИТЬ ВТ_БезСортировки
	|ИЗ
	|	ВТ_ТаблицаСЛишнимиID КАК ВТ_ТаблицаСЛишнимиID
	|ГДЕ
	|	(ВТ_ТаблицаСЛишнимиID.IDСтрока = ВТ_ТаблицаСЛишнимиID.ID
	|			ИЛИ ВТ_ТаблицаСЛишнимиID.IDСтрока = """"
	|			ИЛИ ВТ_ТаблицаСЛишнимиID.ID = """")
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_ЕдиничныеТО.РемонтыОборудования_ID,
	|	ВТ_ЕдиничныеТО.Ссылка,
	|	ВТ_ЕдиничныеТО.IDЧисло,
	|	ВТ_ЕдиничныеТО.Родитель_IDЧисло,
	|	ВТ_ЕдиничныеТО.Картинка,
	|	ВТ_ЕдиничныеТО.РемонтнаяРабота,
	|	ВТ_ЕдиничныеТО.Количество,
	|	ВТ_ЕдиничныеТО.IDСтрока,
	|	ВТ_ЕдиничныеТО.ID,
	|	ВТ_ЕдиничныеТО.НомерСтроки
	#Вставка
	|	,ВТ_ЕдиничныеТО.гкс_Примечание КАК гкс_Примечание
	|	,ВТ_ЕдиничныеТО.гкс_СпособВыполнения КАК гкс_СпособВыполнения
	#КонецВставки
	|ИЗ
	|	ВТ_ЕдиничныеТО КАК ВТ_ЕдиничныеТО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_БезСортировки.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	ВТ_БезСортировки.Ссылка КАК Ссылка,
	|	ВТ_БезСортировки.IDЧисло КАК IDЧисло,
	|	ВТ_БезСортировки.Родитель_IDЧисло КАК Родитель_IDЧисло,
	|	ВТ_БезСортировки.Картинка КАК Картинка,
	|	ВТ_БезСортировки.РемонтнаяРабота КАК РемонтнаяРабота,
	|	ВТ_БезСортировки.Количество КАК Количество,
	|	ВТ_БезСортировки.IDСтрока КАК IDСтрока,
	|	ВТ_БезСортировки.ID КАК ID,
	|	ВТ_БезСортировки.НомерСтроки КАК НомерСтроки
	#Вставка
	|	,ВТ_БезСортировки.гкс_Примечание КАК гкс_Примечание
	|	,ВТ_БезСортировки.гкс_СпособВыполнения КАК гкс_СпособВыполнения
	#КонецВставки
	|ИЗ
	|	ВТ_БезСортировки КАК ВТ_БезСортировки
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";

	Запрос.УстановитьПараметр("ТаблицаБезID", ТаблицаБезID);
	РезультатЗапроса = Запрос.Выполнить();

	Возврат РезультатЗапроса.Выгрузить();
КонецФункции // гкс- [] Деснол 16.08.2022

&ИзменениеИКонтроль("ПолучитьЗатратыИзТехОперации")
Функция гкс_ПолучитьЗатратыИзТехОперации(ТехОперация, Знач СтруктураТаблиц, ИдентификаторТехКарты, ТехКарта, ДатаНачалаРемонта, ИдентификаторТехОперации)

	Если СтруктураТаблиц = Неопределено Тогда
		СтруктураТаблиц = Новый Структура("МатериальныеЗатраты, ТрудовыеЗатраты, ИнструментыИТехника, МерыБезопасности");
	КонецЕсли;

	СтруктураРезультата = Новый Структура;
	Для каждого КлючИЗначение Из СтруктураТаблиц Цикл
		СтруктураРезультата.Вставить(КлючИЗначение.Ключ, Неопределено);
	КонецЦикла;

	СтрокаОперацииВТехКарте = Неопределено;
	БратьИзТехКарты = Ложь;

	Если НЕ ЗначениеЗаполнено(ТехКарта) И ЗначениеЗаполнено(ИдентификаторТехКарты) Тогда
		ТехКарта = РегистрыСведений.торо_ВерсииТехКарт.ПолучитьВерсиюТехКарты(ИдентификаторТехКарты, ДатаНачалаРемонта);
	КонецЕсли;

	Если ЗначениеЗаполнено(ТехКарта) Тогда
		#Вставка
		Если Не ИдентификаторТехОперации = Неопределено Тогда 
			НайдСтр = ТехКарта.СписокОпераций.НайтиСтроки(Новый Структура("Операция,ID", ТехОперация, ИдентификаторТехОперации));
			Если НайдСтр.Количество() Тогда
				СтрокаОперацииВТехКарте = НайдСтр[0];
			Иначе
				СтрокаОперацииВТехКарте = ТехКарта.СписокОпераций.Найти(ТехОперация);
			КонецЕсли;
		Иначе
		#КонецВставки
		СтрокаОперацииВТехКарте = ТехКарта.СписокОпераций.Найти(ТехОперация);
		#Вставка
		КонецЕсли;
		#КонецВставки
		Если СтрокаОперацииВТехКарте <> Неопределено Тогда
			БратьИзТехКарты = Истина;
		КонецЕсли;
	КонецЕсли;

	Если БратьИзТехКарты Тогда

		Для каждого КлючИЗначение Из СтруктураТаблиц Цикл
			МассивСтрок = ТехКарта[КлючИЗначение.Ключ].НайтиСтроки(Новый Структура("ID", СтрокаОперацииВТехКарте.ID));
			МассивСтрокДляИзменения = ТехКарта[КлючИЗначение.Ключ].Выгрузить(МассивСтрок);
			Для каждого Строка Из МассивСтрокДляИзменения Цикл
				Если ЗначениеЗаполнено(ИдентификаторТехОперации) Тогда
					Строка.ID = ИдентификаторТехОперации;
				КонецЕсли;
			КонецЦикла;
			СтруктураРезультата[КлючИЗначение.Ключ] = МассивСтрокДляИзменения;
		КонецЦикла;

	Иначе

		Для каждого КлючИЗначение Из СтруктураТаблиц Цикл
			Если КлючИЗначение.Ключ = "МерыБезопасности" Тогда
				Продолжить;
			КонецЕсли;
			ТаблицаТО = ТехОперация[КлючИЗначение.Ключ].Выгрузить();
			ТаблицаТО.Колонки.Добавить("ID");
			ТаблицаТО.Колонки.Добавить("Операция");
			ТаблицаТО.ЗаполнитьЗначения(ИдентификаторТехОперации, "ID");
			ТаблицаТО.ЗаполнитьЗначения(ТехОперация, "Операция");
			Если КлючИЗначение.Ключ = "ТрудовыеЗатраты" ИЛИ КлючИЗначение.Ключ = "ИнструментыИТехника" Тогда
				ТаблицаТО.Колонки.Добавить("ВремяРаботыНаЕдиницу");
				ТаблицаТО.ЗагрузитьКолонку(ТаблицаТО.ВыгрузитьКолонку("ВремяРаботы"), "ВремяРаботыНаЕдиницу");
			ИначеЕсли КлючИЗначение.Ключ = "МатериальныеЗатраты" Тогда
				ТаблицаТО.Колонки.Добавить("КоличествоНаЕдиницу");
				ТаблицаТО.Колонки.Добавить("КоличествоУпаковокНаЕдиницу");
				ТаблицаТО.ЗагрузитьКолонку(ТаблицаТО.ВыгрузитьКолонку("Количество"), "КоличествоНаЕдиницу");
				ТаблицаТО.ЗагрузитьКолонку(ТаблицаТО.ВыгрузитьКолонку("КоличествоУпаковок"), "КоличествоУпаковокНаЕдиницу");
			КонецЕсли;
			СтруктураРезультата[КлючИЗначение.Ключ] = ТаблицаТО;
		КонецЦикла;

	КонецЕсли;

	Возврат СтруктураРезультата;

КонецФункции

#КонецОбласти

