
&НаКлиенте
Процедура ТЧ_НастройкиПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.ТЧ_Настройки.ТекущиеДанные;
	Если НЕ ТекДанные = Неопределено Тогда 
		Элементы.ТЧ_НастройкиЗначение.ОграничениеТипа = ТекДанные.ТипыСтроки;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("МассивНастроек") Тогда 
		Для Каждого СМ Из Параметры.МассивНастроек Цикл
			НС = ТЧ_Настройки.Добавить();
			ЗаполнитьЗначенияСвойств(НС, СМ);
			Если СМ.Параметр = "Организация" Тогда 
				НС.ТипыСтроки = Новый ОписаниеТипов("СправочникСсылка.Организации");
			ИначеЕсли СМ.Параметр = "Подразделение" Тогда 
				НС.ТипыСтроки = Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия");
			ИначеЕсли СМ.Параметр = "Объект ремонта" Тогда 
				НС.ТипыСтроки = Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта");
			КонецЕсли;
		КонецЦикла;
	Иначе
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	ТемпМассив = Новый Массив();
	Для Каждого СТ Из ТЧ_Настройки Цикл
		ТемпСтрукт = Новый Структура("Показатель,Параметр,Значение", Неопределено, Неопределено, Неопределено);
		Если ЗначениеЗаполнено(СТ.Показатель) Тогда 
			ЗаполнитьЗначенияСвойств(ТемпСтрукт, СТ);
			ТемпМассив.Добавить(ТемпСтрукт);
		КонецЕсли;
	КонецЦикла;
	Закрыть(ТемпМассив);
КонецПроцедуры
