#Область СлужебныеПроцедурыИФункции

&ИзменениеИКонтроль("ПечатьНарядДопускДляРаботыВЭлектроустановках")
Функция Расш_гкс_ПечатьНарядДопускДляРаботыВЭлектроустановках(МассивОбъектов, ПараметрыПечати)

	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "торо_НарядНаВыполнениеРемонтныхРабот";
	#Вставка
	СдвигЧП = Час(ТекущаяДатаСеанса()) - Час(ТекущаяДата());
	#КонецВставки

	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_НарядДопускДляРаботыВЭлектроустановках");

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка КАК Ссылка,
	#Удаление
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Номер КАК Номер,
	#КонецУдаления
	#Вставка
	|	ЕстьNull(ННД.НомерТекст, торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Номер) КАК Номер,
	#КонецВставки
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Дата КАК Дата,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Организация КАК Организация,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Подразделение КАК Подразделение,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Ответственный КАК Ответственный,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID КАК ID,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ДатаНачала КАК ДатаНачала,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ДатаОкончания КАК ДатаОкончания,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОпаснаяРабота КАК ОпаснаяРабота,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.МестоПроведенияРабот КАК МестоПроведенияРабот
	|ИЗ
	|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтыОборудования КАК торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования
	#Вставка
	|		левое соединение РегистрСведений.гкс_НомераНарядДопусков КАК ННД
	|		ПО ННД.Документ = торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка
	#КонецВставки
	|ГДЕ
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка В(&Ссылка)
	|	И торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID В(&ID)
	|ИТОГИ
	|	МАКСИМУМ(Номер),
	|	МАКСИМУМ(Дата),
	|	МАКСИМУМ(Организация),
	|	МАКСИМУМ(Подразделение),
	|	МАКСИМУМ(Ответственный)
	|ПО
	|	Ссылка";

	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	Если ПараметрыПечати.Свойство("МассивID") Тогда
		Запрос.УстановитьПараметр("ID", ПараметрыПечати.МассивID);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID В(&ID)", "");
	КонецЕсли;

	ВыборкаДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
	ЭтоПервый = Истина;

	Пока ВыборкаДокументов.Следующий() Цикл

		ВыборкаРемонтов = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока ВыборкаРемонтов.Следующий() Цикл

			Если НЕ ЭтоПервый Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ЭтоПервый = Ложь;

			Шапка = Макет.ПолучитьОбласть("ШапкаДокумента");
			Шапка.Параметры.Организация = ВыборкаДокументов.Организация;
			Шапка.Параметры.ПодразделениеОрганизации = ВыборкаДокументов.Подразделение;
			#Вставка
			Шапка.Параметры.Дата = Формат(ВыборкаДокументов.Дата + (СдвигЧП * 3600), "ДФ=dd.MM.yyyy");
			#КонецВставки
			#Удаление
			Шапка.Параметры.Дата = Формат(ВыборкаДокументов.Дата,"ДФ=dd.MM.yyyy");
			#КонецУдаления
			Шапка.Параметры.Номер = ВыборкаДокументов.Номер;
			ТабДок.Вывести(Шапка);

			#Удаление
			ТЗ = ВыборкаДокументов.Ссылка.Исполнители.Выгрузить(, "Сотрудник, Квалификация");
			ТЗ.Свернуть("Сотрудник, Квалификация");
			#КонецУдаления
			#Вставка
			ТЗ = ВыборкаДокументов.Ссылка.Исполнители.Выгрузить(, "Сотрудник, Квалификация, гкс_СотрудникКонтрагента");
			ТЗ.Свернуть("Сотрудник, Квалификация, гкс_СотрудникКонтрагента");
			#КонецВставки

			ПервыйЧленБригады = Макет.ПолучитьОбласть("ПервыйЧленБригады");
			ЧленБригады       = Макет.ПолучитьОбласть("ЧленБригады");

			ЭтоПервыйСотрудник = Истина;

			Для Каждого Стр Из ТЗ Цикл

				Если ЭтоПервыйСотрудник Тогда 
					#Удаление
					ПервыйЧленБригады.Параметры.СоставБригады = Стр.Сотрудник.Наименование + " (" + Стр.Квалификация + ")";
					#КонецУдаления
					#Вставка
					ПервыйЧленБригады.Параметры.СоставБригады = ?(ЗначениеЗаполнено(Стр.Сотрудник),
					Стр.Сотрудник.Наименование, Стр.гкс_СотрудникКонтрагента)
					+ " (" + Стр.Квалификация + ")";
					#КонецВставки

					ЭтоПервыйСотрудник = Ложь;
					ТабДок.Вывести(ПервыйЧленБригады);
				Иначе 

					#Удаление
					ЧленБригады.Параметры.СоставБригады = Стр.Сотрудник.Наименование + " (" + Стр.Квалификация + ")";
					#КонецУдаления
					#Вставка
					ЧленБригады.Параметры.СоставБригады = ?(ЗначениеЗаполнено(Стр.Сотрудник),
					Стр.Сотрудник.Наименование, Стр.гкс_СотрудникКонтрагента) 
					+ " (" + Стр.Квалификация + ")";
					#КонецВставки
					ТабДок.Вывести(ЧленБригады);
				КонецЕсли;

			КонецЦикла;

			ПерваяРемонтнаяРабота = Макет.ПолучитьОбласть("ПерваяРемонтнаяРабота");
			РемонтнаяРабота       = Макет.ПолучитьОбласть("РемонтнаяРабота");

			Отбор = Новый Структура;
			Отбор.Вставить("РемонтыОборудования_ID", ВыборкаРемонтов.ID);
			СтрокиТекущегоОтбора = ВыборкаДокументов.Ссылка.РемонтныеРаботы.НайтиСтроки(Отбор);		

			ПерваяРабота = Истина;
			Для Каждого СтрокаОтбора Из СтрокиТекущегоОтбора Цикл
				Если ТипЗнч(СтрокаОтбора.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
					Если СтрокаОтбора.РемонтнаяРабота.НаименованиеДляПечати = "" Тогда
						НаименованиеРаботы = СтрокаОтбора.РемонтнаяРабота.Наименование;
					Иначе
						НаименованиеРаботы = СтрокаОтбора.РемонтнаяРабота.НаименованиеДляПечати;
					КонецЕсли;
					#Вставка
					НаименованиеРаботы = НаименованиеРаботы + " " + СтрокаОтбора.гкс_Примечание;
					#КонецВставки

					Если ПерваяРабота Тогда 
						ПерваяРемонтнаяРабота.Параметры.РемонтнаяРабота = НаименованиеРаботы;
						ПерваяРабота = Ложь;
						ТабДок.Вывести(ПерваяРемонтнаяРабота);
					Иначе
						РемонтнаяРабота.Параметры.РемонтнаяРабота = НаименованиеРаботы;
						ТабДок.Вывести(РемонтнаяРабота);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;	

			Часть0 = Макет.ПолучитьОбласть("Часть0");
			#Вставка
			ДатаНачала = ВыборкаРемонтов.ДатаНачала + (СдвигЧП * 3600);
			ДатаОкончания = ВыборкаРемонтов.ДатаОкончания + (СдвигЧП * 3600);
			#КонецВставки
			#Удаление
			ДатаНачала = ВыборкаРемонтов.ДатаНачала;
			ДатаОкончания = ВыборкаРемонтов.ДатаОкончания;
			#КонецУдаления
			Часть0.Параметры.ВремяНачало	=  Формат(ДатаНачала,"ДЛФ=T");
			Часть0.Параметры.ДатаНачало     =  Формат(ДатаНачала,"ДФ=dd.MM.yyyy");
			Часть0.Параметры.ВремяОкончание =  Формат(ДатаОкончания ,"ДЛФ=T");
			Часть0.Параметры.ДатаОкончание  =  Формат(ДатаОкончания,"ДФ=dd.MM.yyyy");
			ТабДок.Вывести(Часть0);

			Часть1 = Макет.ПолучитьОбласть("Часть1");
			ТабДок.Вывести(Часть1);

			Часть2 = Макет.ПолучитьОбласть("Часть2");
			ТабДок.Вывести(Часть2);

			Часть3 = Макет.ПолучитьОбласть("Часть3");
			ТабДок.Вывести(Часть3);

		КонецЦикла;
	КонецЦикла;

	ТабДок.ТолькоПросмотр = Истина;
	Возврат ТабДок;

КонецФункции

&ИзменениеИКонтроль("ПечатьНарядНаВыполнениеОгневыхРабот")
Функция Расш_гкс_ПечатьНарядНаВыполнениеОгневыхРабот(МассивОбъектов, ПараметрыПечати)

	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "торо_НарядНаВыполнениеРемонтныхРабот";
	#Вставка
	СдвигЧП = Час(ТекущаяДатаСеанса()) - Час(ТекущаяДата());
	#КонецВставки

	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_НарядНаВыполнениеОгневыхРабот");

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка КАК Ссылка,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Номер КАК Номер,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Дата КАК Дата,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Организация КАК Организация,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Подразделение КАК Подразделение,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Ответственный КАК Ответственный,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID КАК ID,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ДатаНачала КАК ДатаНачала,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ДатаОкончания КАК ДатаОкончания,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОпаснаяРабота КАК ОпаснаяРабота,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.МестоПроведенияРабот КАК МестоПроведенияРабот
	|ИЗ
	|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтыОборудования КАК торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования
	|ГДЕ
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка В(&Ссылка)
	|	И торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID В(&ID)
	|ИТОГИ
	|	МАКСИМУМ(Номер),
	|	МАКСИМУМ(Дата),
	|	МАКСИМУМ(Организация),
	|	МАКСИМУМ(Подразделение),
	|	МАКСИМУМ(Ответственный)
	|ПО
	|	Ссылка";

	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	Если ПараметрыПечати.Свойство("МассивID") Тогда
		Запрос.УстановитьПараметр("ID", ПараметрыПечати.МассивID);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID В(&ID)", "");
	КонецЕсли;

	ВыборкаДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
	ЭтоПервый = Истина;

	Пока ВыборкаДокументов.Следующий() Цикл

		ВыборкаРемонтов = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока ВыборкаРемонтов.Следующий() Цикл

			Если НЕ ЭтоПервый Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ЭтоПервый = Ложь;

			Шапка = Макет.ПолучитьОбласть("ШапкаДокумента");
			Шапка.Параметры.Организация = ВыборкаДокументов.Организация;
			Шапка.Параметры.ПодразделениеОрганизации = ВыборкаДокументов.Подразделение;
			ТабДок.Вывести(Шапка);

			ПерваяРемонтнаяРабота = Макет.ПолучитьОбласть("ПерваяРемонтнаяРабота");
			РемонтнаяРабота       = Макет.ПолучитьОбласть("РемонтнаяРабота");

			Отбор = Новый Структура;
			Отбор.Вставить("РемонтыОборудования_ID", ВыборкаРемонтов.ID);
			СтрокиТекущегоОтбора = ВыборкаДокументов.Ссылка.РемонтныеРаботы.НайтиСтроки(Отбор);

			ПерваяРабота = Истина;
			Для Каждого СтрокаОтбора Из СтрокиТекущегоОтбора Цикл
				Если ТипЗнч(СтрокаОтбора.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
					Если СтрокаОтбора.РемонтнаяРабота.НаименованиеДляПечати = "" Тогда
						НаименованиеРаботы = СтрокаОтбора.РемонтнаяРабота.Наименование;
					Иначе
						НаименованиеРаботы = СтрокаОтбора.РемонтнаяРабота.НаименованиеДляПечати;
					КонецЕсли; 

					Если ПерваяРабота Тогда 
						ПерваяРемонтнаяРабота.Параметры.РемонтнаяРабота = НаименованиеРаботы;
						ПерваяРабота = Ложь;
						ТабДок.Вывести(ПерваяРемонтнаяРабота);
					Иначе
						РемонтнаяРабота.Параметры.РемонтнаяРабота = НаименованиеРаботы;
						ТабДок.Вывести(РемонтнаяРабота);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;	

			ШапкаТаблицыИсполнители = Макет.ПолучитьОбласть("ШапкаТаблицыИсполнители");
			ТабДок.Вывести(ШапкаТаблицыИсполнители);       	

			СтрокаТаблицыИсполнители = Макет.ПолучитьОбласть("СтрокаТаблицыИсполнители");

			#Удаление
			ТЗ = ВыборкаДокументов.Ссылка.Исполнители.Выгрузить(, "Сотрудник,Квалификация");
			ТЗ.Свернуть("Сотрудник,Квалификация");
			#КонецУдаления
			#Вставка
			ТЗ = ВыборкаДокументов.Ссылка.Исполнители.Выгрузить(, "Сотрудник,Квалификация,гкс_СотрудникКонтрагента");
			ТЗ.Свернуть("Сотрудник,Квалификация,гкс_СотрудникКонтрагента");
			#КонецВставки
			ПП = 0;

			Для Каждого Стр Из ТЗ Цикл
				ПП = ПП+1;
				СтрокаТаблицыИсполнители.Параметры.Заполнить(Стр);
				СтрокаТаблицыИсполнители.Параметры.ПП = ПП;
				#Вставка
				Если ЗначениеЗаполнено(Стр.Сотрудник) = Ложь Тогда 
					СтрокаТаблицыИсполнители.Параметры.Сотрудник = Стр.гкс_СотрудникКонтрагента;
				КонецЕсли;
				#КонецВставки
				ТабДок.Вывести(СтрокаТаблицыИсполнители);
			КонецЦикла;

			Пункт5_10 = Макет.ПолучитьОбласть("Пункт5_10");
			#Вставка
			ДатаНачала = ВыборкаРемонтов.ДатаНачала + (СдвигЧП * 3600);
			ДатаОкончания = ВыборкаРемонтов.ДатаОкончания + (СдвигЧП * 3600);
			#КонецВставки
			#Удаление
			ДатаНачала = ВыборкаРемонтов.ДатаНачала;
			ДатаОкончания = ВыборкаРемонтов.ДатаОкончания;
			#КонецУдаления

			Пункт5_10.Параметры.ВремяНачало	 =	Формат(ДатаНачала,"ДФ=чч:мм");
			Пункт5_10.Параметры.ДатаНачало     =  Формат(ДатаНачала,"ДФ=dd.MM.yyyy");
			Пункт5_10.Параметры.ВремяОкончание =  Формат(ДатаОкончания ,"ДФ=чч:мм");
			Пункт5_10.Параметры.ДатаОкончание  =  Формат(ДатаОкончания,"ДФ=dd.MM.yyyy");

			ТабДок.Вывести(Пункт5_10);
			Пункт11_12 = Макет.ПолучитьОбласть("Пункт11_12");
			ТабДок.Вывести(Пункт11_12);

		КонецЦикла;
	КонецЦикла;

	ТабДок.ТолькоПросмотр = Истина;
	Возврат ТабДок;	

КонецФункции

&ИзменениеИКонтроль("ПечатьНарядДопускНаПроизводствоРаботНаВысоте")
Функция Расш_гкс_ПечатьНарядДопускНаПроизводствоРаботНаВысоте(МассивОбъектов, ПараметрыПечати)

	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "торо_НарядНаВыполнениеРемонтныхРабот";
	#Вставка
	СдвигЧП = Час(ТекущаяДатаСеанса()) - Час(ТекущаяДата());
	#КонецВставки

	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_НарядДопускНаПроизводствоРаботНаВысоте");

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка КАК Ссылка,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Номер КАК Номер,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Дата КАК Дата,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Организация КАК Организация,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Подразделение КАК Подразделение,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Ответственный КАК Ответственный,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID КАК ID,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ДатаНачала КАК ДатаНачала,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ДатаОкончания КАК ДатаОкончания,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОпаснаяРабота КАК ОпаснаяРабота,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.МестоПроведенияРабот КАК МестоПроведенияРабот
	|ИЗ
	|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтыОборудования КАК торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования
	|ГДЕ
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка В(&Ссылка)
	|	И торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID В(&ID)
	|ИТОГИ
	|	МАКСИМУМ(Номер),
	|	МАКСИМУМ(Дата),
	|	МАКСИМУМ(Организация),
	|	МАКСИМУМ(Подразделение),
	|	МАКСИМУМ(Ответственный)
	|ПО
	|	Ссылка";

	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	Если ПараметрыПечати.Свойство("МассивID") Тогда
		Запрос.УстановитьПараметр("ID", ПараметрыПечати.МассивID);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID В(&ID)", "");
	КонецЕсли;

	ВыборкаДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
	ЭтоПервый = Истина;

	Пока ВыборкаДокументов.Следующий() Цикл

		ВыборкаРемонтов = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока ВыборкаРемонтов.Следующий() Цикл

			Если НЕ ЭтоПервый Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ЭтоПервый = Ложь;

			Шапка = Макет.ПолучитьОбласть("Шапка");

			Шапка.Параметры.Номер = ВыборкаДокументов.Номер;
			#Вставка
			Шапка.Параметры.Дата = ВыборкаДокументов.Дата + (СдвигЧП * 3600);
			#КонецВставки
			#Удаление
			Шапка.Параметры.Дата = ВыборкаДокументов.Дата;
			#КонецУдаления
			Шапка.Параметры.Организация = ВыборкаДокументов.Организация;
			Шапка.Параметры.Подразделение = ВыборкаДокументов.Подразделение;

			СписокТО = "";

			Для Каждого РемРаб Из ВыборкаДокументов.Ссылка.РемонтныеРаботы Цикл
				Если РемРаб.РемонтыОборудования_ID = ВыборкаРемонтов.ID
					И ТипЗнч(РемРаб.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда

					Если РемРаб.РемонтнаяРабота.НаименованиеДляПечати = "" Тогда
						НаименованиеРаботы = РемРаб.РемонтнаяРабота.Наименование;
					Иначе
						НаименованиеРаботы = РемРаб.РемонтнаяРабота.НаименованиеДляПечати;
					КонецЕсли;

					СписокТО = СписокТО + НаименованиеРаботы + ", ";
				КонецЕсли;
			КонецЦикла;

			Шапка.Параметры.ТехОперации = Лев(СписокТО, СтрДлина(СписокТО) - 2);

			ТабДок.Вывести(Шапка);	

			ТабСотрудники = Макет.ПолучитьОбласть("СтрокаЗаполнения");

			МассивИсполнителей = Новый Массив;

			Для Каждого Сотрудник Из ВыборкаДокументов.Ссылка.Исполнители Цикл
				Если Сотрудник.РемонтыОборудования_ID = ВыборкаРемонтов.ID
					И МассивИсполнителей.Найти(Сотрудник.Сотрудник) = Неопределено Тогда
					МассивИсполнителей.Добавить(Сотрудник.Сотрудник);
				КонецЕсли;
			КонецЦикла;

			Для Каждого Сотрудник Из МассивИсполнителей Цикл
				ТабСотрудники.Параметры.ФИО = Сотрудник;
				ТабДок.Вывести(ТабСотрудники);
			КонецЦикла;

			ТабЧасть0 = Макет.ПолучитьОбласть("Часть0");

			СписокРабот = "";

			Для Каждого РемРаб Из ВыборкаДокументов.Ссылка.РемонтныеРаботы Цикл
				Если РемРаб.РемонтыОборудования_ID = ВыборкаРемонтов.ID
					И ТипЗнч(РемРаб.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
					СписокРабот = СписокРабот + РемРаб.РемонтнаяРабота.СодержаниеРабот + ", ";
				КонецЕсли;
			КонецЦикла;

			ТабЧасть0.Параметры.СодержаниеРаботТО = Лев(СписокРабот, СтрДлина(СписокРабот) - 2);

			#Вставка
			ДатаНач = ВыборкаРемонтов.ДатаНачала + (СдвигЧП * 3600);
			ДатаКон = ВыборкаРемонтов.ДатаОкончания + (СдвигЧП * 3600);
			#КонецВставки
			#Удаление
			ДатаНач = ВыборкаРемонтов.ДатаНачала;
			ДатаКон = ВыборкаРемонтов.ДатаОкончания;
			#КонецУдаления

			ТабЧасть0.Параметры.НачЧас		= Строка(Час(ДатаНач));
			ТабЧасть0.Параметры.НачМин		= Строка(Минута(ДатаНач));
			ТабЧасть0.Параметры.НачДень		= Строка(День(ДатаНач));
			// >> [Деснол] [Ушаков А.Д.] [26.09.2019] 
			ТабЧасть0.Параметры.НачМесяц	= НазваниеМесяцаСтрокой_РодительныйПадеж(ДатаНач);
			//ТабЧасть0.Параметры.НачМесяц	= НазваниеМесяцаСтрокойПадежное(Месяц(ДатаНач), "Род");
			// << [Деснол] [Ушаков А.Д.] [26.09.2019] 
			ТабЧасть0.Параметры.НачГод		= Строка(Год(ДатаНач));

			ТабЧасть0.Параметры.КонЧас		= Строка(Час(ДатаКон));
			ТабЧасть0.Параметры.КонМин		= Строка(Минута(ДатаКон));
			ТабЧасть0.Параметры.КонДень		= Строка(День(ДатаКон));
			// >> [Деснол] [Ушаков А.Д.] [26.09.2019] 
			ТабЧасть0.Параметры.КонМесяц	= НазваниеМесяцаСтрокой_РодительныйПадеж(ДатаКон);
			//ТабЧасть0.Параметры.КонМесяц	= НазваниеМесяцаСтрокойПадежное(Месяц(ДатаКон), "Род");
			// << [Деснол] [Ушаков А.Д.] [26.09.2019] 
			ТабЧасть0.Параметры.КонГод		= Строка(Год(ДатаКон));

			ТабДок.Вывести(ТабЧасть0);

			Для Сч = 1 По 11 Цикл
				ТабЧасть = Макет.ПолучитьОбласть("Часть" + Сч);
				ТабДок.Вывести(ТабЧасть);
			КонецЦикла;

		КонецЦикла;
	КонецЦикла;

	ТабДок.ТолькоПросмотр = Истина;

	Возврат ТабДок;

КонецФункции

&ИзменениеИКонтроль("ПечатьНарядДопускНаПроведениеГазоопасныхРабот")
Функция Расш_гкс_ПечатьНарядДопускНаПроведениеГазоопасныхРабот(МассивОбъектов, ПараметрыПечати)

	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "торо_НарядНаВыполнениеРемонтныхРабот";
	#Вставка
	СдвигЧП = Час(ТекущаяДатаСеанса()) - Час(ТекущаяДата());
	#КонецВставки

	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_НарядДопускНаПроведениеГазоопасныхРабот");

	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_НарядНаВыполнениеРемонтныхРаботИсполнители.Сотрудник КАК Сотрудник,
	|	торо_НарядНаВыполнениеРемонтныхРаботИсполнители.Квалификация КАК Квалификация,
	|	МИНИМУМ(торо_НарядНаВыполнениеРемонтныхРаботИсполнители.ДатаНачала) КАК ДатаНачала,
	|	МАКСИМУМ(торо_НарядНаВыполнениеРемонтныхРаботИсполнители.ДатаОкончания) КАК ДатаОкончания,
	|	торо_НарядНаВыполнениеРемонтныхРаботИсполнители.РемонтыОборудования_ID КАК РемонтыОборудования_ID
	|ПОМЕСТИТЬ Исполнители
	|ИЗ
	|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.Исполнители КАК торо_НарядНаВыполнениеРемонтныхРаботИсполнители
	|ГДЕ
	|	торо_НарядНаВыполнениеРемонтныхРаботИсполнители.Ссылка В(&Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_НарядНаВыполнениеРемонтныхРаботИсполнители.Сотрудник,
	|	торо_НарядНаВыполнениеРемонтныхРаботИсполнители.Квалификация,
	|	торо_НарядНаВыполнениеРемонтныхРаботИсполнители.РемонтыОборудования_ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка КАК Ссылка,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Номер КАК Номер,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Дата КАК Дата,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Организация КАК Организация,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Подразделение КАК Подразделение,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Ответственный КАК Ответственный,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID КАК ID,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОпаснаяРабота КАК ОпаснаяРабота,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.МестоПроведенияРабот КАК МестоПроведенияРабот,
	|	Исполнители.Сотрудник КАК Сотрудник,
	|	Исполнители.Квалификация КАК Квалификация,
	|	Исполнители.ДатаНачала КАК ДатаНачала,
	|	Исполнители.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтыОборудования КАК торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования
	|		ЛЕВОЕ СОЕДИНЕНИЕ Исполнители КАК Исполнители
	|		ПО торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID = Исполнители.РемонтыОборудования_ID
	|ГДЕ
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка В(&Ссылка)
	|	И торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID В(&ID)
	|ИТОГИ
	|	МАКСИМУМ(Номер),
	|	МАКСИМУМ(Дата),
	|	МАКСИМУМ(Организация),
	|	МАКСИМУМ(Подразделение),
	|	МАКСИМУМ(Ответственный)
	|ПО
	|	Ссылка,
	|	ID";

	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	Если ПараметрыПечати.Свойство("МассивID") Тогда
		Запрос.УстановитьПараметр("ID", ПараметрыПечати.МассивID);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID В(&ID)", "");
	КонецЕсли;

	ВыборкаДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
	ЭтоПервый = Истина;

	Пока ВыборкаДокументов.Следующий() Цикл

		ВыборкаРемонтов = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ID");
		Пока ВыборкаРемонтов.Следующий() Цикл

			Если НЕ ЭтоПервый Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ЭтоПервый = Ложь;

			Шапка = Макет.ПолучитьОбласть("ШапкаДокумента");
			Шапка.Параметры.Номер = ВыборкаДокументов.Номер;
			#Вставка
			Шапка.Параметры.Дата = Формат(ВыборкаДокументов.Дата + (СдвигЧП * 3600),"ДФ=dd.MM.yyyy");
			#КонецВставки
			#Удаление
			Шапка.Параметры.Дата = Формат(ВыборкаДокументов.Дата,"ДФ=dd.MM.yyyy");
			#КонецУдаления
			ТабДок.Вывести(Шапка);

			ПерваяРемонтнаяРабота = Макет.ПолучитьОбласть("ПерваяРемонтнаяРабота");
			РемонтнаяРабота       = Макет.ПолучитьОбласть("РемонтнаяРабота");

			Отбор = Новый Структура;
			Отбор.Вставить("РемонтыОборудования_ID", ВыборкаРемонтов.ID);
			СтрокиТекущегоОтбора = ВыборкаДокументов.Ссылка.РемонтныеРаботы.НайтиСтроки(Отбор);

			ПерваяРабота = Истина;
			Для Каждого СтрокаОтбора Из СтрокиТекущегоОтбора Цикл
				Если ТипЗнч(СтрокаОтбора.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
					Если СтрокаОтбора.РемонтнаяРабота.НаименованиеДляПечати = "" Тогда
						НаименованиеРаботы = СтрокаОтбора.РемонтнаяРабота.Наименование;
					Иначе
						НаименованиеРаботы = СтрокаОтбора.РемонтнаяРабота.НаименованиеДляПечати;
					КонецЕсли;

					Если ПерваяРабота Тогда 
						ПерваяРемонтнаяРабота.Параметры.РемонтнаяРабота = НаименованиеРаботы;
						ПерваяРабота = Ложь;
						ТабДок.Вывести(ПерваяРемонтнаяРабота);
					Иначе
						РемонтнаяРабота.Параметры.РемонтнаяРабота = НаименованиеРаботы;
						ТабДок.Вывести(РемонтнаяРабота);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;

			Пункт4_10 = Макет.ПолучитьОбласть("Пункт4_10");
			ТабДок.Вывести(Пункт4_10);
			ШапкаТаблицыИсполнители = Макет.ПолучитьОбласть("ШапкаТаблицыИсполнители");
			ТабДок.Вывести(ШапкаТаблицыИсполнители);

			ПП = 0;
			ВыборкаРемонта = ВыборкаРемонтов.Выбрать(ОбходРезультатаЗапроса.Прямой); 
			Пока ВыборкаРемонта.Следующий() Цикл 

				СтрокаТаблицыИсполнители = Макет.ПолучитьОбласть("СтрокаТаблицыИсполнители");
				ПП = ПП+1;
				СтрокаТаблицыИсполнители.Параметры.Заполнить(ВыборкаРемонта);
				СтрокаТаблицыИсполнители.Параметры.ПП = ПП;
				#Вставка
				Шапка.Параметры.Дата = Формат(ВыборкаДокументов.Дата + (СдвигЧП * 3600),"ДФ=dd.MM.yyyy");
				СтрокаТаблицыИсполнители.Параметры.ДатаНачала = 
					СтрокаТаблицыИсполнители.Параметры.ДатаНачала  + (СдвигЧП * 3600);
				СтрокаТаблицыИсполнители.Параметры.ДатаОкончания = 
					СтрокаТаблицыИсполнители.Параметры.ДатаОкончания  + (СдвигЧП * 3600);
				#КонецВставки
				//Если ВыборкаРемонта.ДатаНачала <> Дата (1,1,1) Тогда 
				//	СтрокаТаблицыИсполнители.Параметры.ДатаВремя = Строка(ВыборкаРемонта.ДатаНачала);
				//КонецЕсли;
				ТабДок.Вывести(СтрокаТаблицыИсполнители);
			КонецЦикла;

			Пункт12_16 = Макет.ПолучитьОбласть("Пункт12_16");
			ТабДок.Вывести(Пункт12_16);

		КонецЦикла;
	КонецЦикла;

	ТабДок.ТолькоПросмотр = Истина;
	Возврат ТабДок;

КонецФункции

&ИзменениеИКонтроль("ПечатьНарядНаПроизводствоРаботПовышеннойОпасности")
Функция Расш_гкс_ПечатьНарядНаПроизводствоРаботПовышеннойОпасности(МассивОбъектов, ПараметрыПечати)

	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "торо_НарядНаВыполнениеРемонтныхРабот";
	#Вставка
	СдвигЧП = Час(ТекущаяДатаСеанса()) - Час(ТекущаяДата());
	#КонецВставки

	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_НарядНаПроизводствоРаботПовышеннойОпасности");

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка КАК Ссылка,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Номер КАК Номер,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Дата КАК Дата,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Организация КАК Организация,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Подразделение КАК Подразделение,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Ответственный КАК Ответственный,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID КАК ID,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ДатаНачала КАК ДатаНачала,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ДатаОкончания КАК ДатаОкончания,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОпаснаяРабота КАК ОпаснаяРабота,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.МестоПроведенияРабот КАК МестоПроведенияРабот
	|ИЗ
	|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтыОборудования КАК торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования
	|ГДЕ
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка В(&Ссылка)
	|	И торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID В(&ID)
	|ИТОГИ
	|	МАКСИМУМ(Номер),
	|	МАКСИМУМ(Дата),
	|	МАКСИМУМ(Организация),
	|	МАКСИМУМ(Подразделение),
	|	МАКСИМУМ(Ответственный)
	|ПО
	|	Ссылка";

	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	Если ПараметрыПечати.Свойство("МассивID") Тогда
		Запрос.УстановитьПараметр("ID", ПараметрыПечати.МассивID);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID В(&ID)", "");
	КонецЕсли;

	ВыборкаДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
	ЭтоПервый = Истина;

	Пока ВыборкаДокументов.Следующий() Цикл

		ВыборкаРемонтов = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока ВыборкаРемонтов.Следующий() Цикл

			Если НЕ ЭтоПервый Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ЭтоПервый = Ложь;

			Шапка = Макет.ПолучитьОбласть("ШапкаДокумента");
			Шапка.Параметры.Организация = ВыборкаДокументов.Организация;
			Шапка.Параметры.ПодразделениеОрганизации = ВыборкаДокументов.Подразделение;

			#Вставка
			Шапка.Параметры.Дата = Формат(ВыборкаДокументов.Дата + (СдвигЧП * 3600),"ДФ=dd.MM.yyyy");
			#КонецВставки
			#Удаление
			Шапка.Параметры.Дата = Формат(ВыборкаДокументов.Дата,"ДФ=dd.MM.yyyy");
			#КонецУдаления
			Шапка.Параметры.Номер = ВыборкаДокументов.Номер;
			ТабДок.Вывести(Шапка);

			ПерваяРемонтнаяРабота = Макет.ПолучитьОбласть("ПерваяРемонтнаяРабота");
			РемонтнаяРабота       = Макет.ПолучитьОбласть("РемонтнаяРабота");

			Отбор = Новый Структура;
			Отбор.Вставить("РемонтыОборудования_ID", ВыборкаРемонтов.ID);
			СтрокиТекущегоОтбора = ВыборкаДокументов.Ссылка.РемонтныеРаботы.НайтиСтроки(Отбор);

			ПерваяРабота = Истина;
			Для Каждого СтрокаОтбора Из СтрокиТекущегоОтбора Цикл
				Если ТипЗнч(СтрокаОтбора.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
					Если СтрокаОтбора.РемонтнаяРабота.НаименованиеДляПечати = "" Тогда
						НаименованиеРаботы = СтрокаОтбора.РемонтнаяРабота.Наименование;
					Иначе
						НаименованиеРаботы = СтрокаОтбора.РемонтнаяРабота.НаименованиеДляПечати;
					КонецЕсли;

					Если ПерваяРабота Тогда 
						ПерваяРемонтнаяРабота.Параметры.РемонтнаяРабота = НаименованиеРаботы;
						ПерваяРабота = Ложь;
						ТабДок.Вывести(ПерваяРемонтнаяРабота);
					Иначе
						РемонтнаяРабота.Параметры.РемонтнаяРабота = НаименованиеРаботы;
						ТабДок.Вывести(РемонтнаяРабота);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;	

			Пункт3_4 = Макет.ПолучитьОбласть("Пункт3_4");

			#Вставка
			ДатаНачала = ВыборкаРемонтов.ДатаНачала + (СдвигЧП * 3600);
			ДатаОкончания = ВыборкаРемонтов.ДатаОкончания + (СдвигЧП * 3600);
			#КонецВставки
			#Удаление
			ДатаНачала = ВыборкаРемонтов.ДатаНачала;
			ДатаОкончания = ВыборкаРемонтов.ДатаОкончания;
			#КонецУдаления

			Пункт3_4.Параметры.ЧасНачало	 =	Формат(ДатаНачала,"ДФ=HH");
			Пункт3_4.Параметры.МинутаНачало     =  Формат(ДатаНачала,"ДФ=мм");
			Пункт3_4.Параметры.ДатаНачало     =  Формат(ДатаНачала,"ДФ=dd.MM.yyyy");

			Пункт3_4.Параметры.ЧасОкончание	 =	Формат(ДатаОкончания,"ДФ=HH");
			Пункт3_4.Параметры.МинутаОкончание     =  Формат(ДатаОкончания,"ДФ=мм");
			Пункт3_4.Параметры.ДатаОкончание    =  Формат(ДатаОкончания,"ДФ=dd.MM.yyyy");

			ТабДок.Вывести(Пункт3_4);


			Пункт5_6 = Макет.ПолучитьОбласть("Пункт5_6");

			ТабДок.Вывести(Пункт5_6);

			СтрокаТаблицыИсполнители = Макет.ПолучитьОбласть("СтрокаТаблицыИсполнители");

			ТЗ = ВыборкаДокументов.Ссылка.Исполнители.Выгрузить(, "Сотрудник,Квалификация");
			ТЗ.Свернуть("Сотрудник,Квалификация");
			ПП = 0;

			Для Каждого Стр Из ТЗ Цикл
				ПП = ПП+1;
				СтрокаТаблицыИсполнители.Параметры.Заполнить(Стр);
				СтрокаТаблицыИсполнители.Параметры.ПП = ПП;
				ТабДок.Вывести(СтрокаТаблицыИсполнители);
			КонецЦикла;

			Пункт7_11 = Макет.ПолучитьОбласть("Пункт7_11");
			ТабДок.Вывести(Пункт7_11);

		КонецЦикла;
	КонецЦикла;

	ТабДок.ТолькоПросмотр = Истина;
	Возврат ТабДок;

КонецФункции

// гкс+ [7729] Тарасов 28.09.2020
Функция ПечатьЗаказНаРаботу(МассивОбъектов, ПараметрыПечати)
	
	Макет  = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_ЗаявкаНаРемонт.ПФ_MXL_дс_ЗаказНаРаботу");
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Шапка 		= Макет.ПолучитьОбласть("Шапка");
	ШапкаРР 	= Макет.ПолучитьОбласть("ШапкаРР");
	ШапкаРР2 	= Макет.ПолучитьОбласть("ШапкаРР2");
	СтрокаРР 	= Макет.ПолучитьОбласть("СтрокаРР");
	ПодвалРР 	= Макет.ПолучитьОбласть("ПодвалРР");
	Подвал 		= Макет.ПолучитьОбласть("Подвал");
	// гкс+ [Печатка] Куст 27.10.2020
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	торо_НарядНаВыполнениеРемонтныхРаботДокументыОснования.ДокументОснование КАК ДокументОснование
		|	,торо_НарядНаВыполнениеРемонтныхРаботДокументыОснования.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ДокументыЗаявкаНаРемонт
		|ИЗ
		|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.ДокументыОснования КАК торо_НарядНаВыполнениеРемонтныхРаботДокументыОснования
		|ГДЕ
		|	торо_НарядНаВыполнениеРемонтныхРаботДокументыОснования.Ссылка В(&МассивОбъектов)
		|	И ТИПЗНАЧЕНИЯ(торо_НарядНаВыполнениеРемонтныхРаботДокументыОснования.ДокументОснование) = ТИП(Документ.торо_ЗаявкаНаРемонт)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаявкаНаРемонтРемонтыОборудования.Ссылка КАК Документ,
		|	ЗаявкаНаРемонтРемонтыОборудования.Ссылка.Организация КАК Организация,
		|	ЗаявкаНаРемонтРемонтыОборудования.ОбъектРемонта.Организация КАК ОрганизацияПолучатель,
		|	ЗаявкаНаРемонтРемонтыОборудования.Ссылка.Номер КАК Номер,
		|	ЗаявкаНаРемонтРемонтыОборудования.Ссылка.Подразделение КАК Подразделение,
		|	ЗаявкаНаРемонтРемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта,
		|	ЗаявкаНаРемонтРемонтыОборудования.ОбъектРемонта.ТехНомер КАК ТехНомерОР,
		|	ЗаявкаНаРемонтРемонтыОборудования.ОбъектРемонта.ИнвентарныйНомер КАК ИнвентарныйНомерОР,
		|	ВЫРАЗИТЬ(ЗаявкаНаРемонтРемонтыОборудования.ОписаниеРемонта КАК СТРОКА(1000)) КАК ОписаниеРемонта,
		|	ЗаявкаНаРемонтРемонтыОборудования.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
		|	ЗаявкаНаРемонтРемонтыОборудования.ID КАК ID
		|	,ВТ_ДокументыЗаявкаНаРемонт.Ссылка КАК Наряд
		|ПОМЕСТИТЬ ВТ_РемонтыОборудования
		|ИЗ
		|	Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК ЗаявкаНаРемонтРемонтыОборудования
		|	Внутреннее соединение ВТ_ДокументыЗаявкаНаРемонт КАК ВТ_ДокументыЗаявкаНаРемонт
		|	ПО ВТ_ДокументыЗаявкаНаРемонт.ДокументОснование = ЗаявкаНаРемонтРемонтыОборудования.Ссылка
		|ГДЕ ЗаявкаНаРемонтРемонтыОборудования.ID В(&ID)
		|	 " + " ; " ;
	ТекИерархия = Константы.торо_ИерархияДляВводаНовыхОР.Получить();
	Если ТекИерархия.ИзменяетсяДокументами Тогда 
		Запрос.Текст = Запрос.Текст + "
		|	ВЫБРАТЬ
		|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.ОбъектИерархии КАК ОР,
		|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.РодительИерархии КАК Родитель
		|Поместить ТекИерархия
		|ИЗ
		|	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(,
		|СтруктураИерархии = &СтруктураИерархии) КАК торо_РасположениеОРВСтруктуреИерархииСрезПоследних
		|ГДЕ
		|торо_РасположениеОРВСтруктуреИерархииСрезПоследних.Удален = ЛОЖЬ	" + " ; " ;
	Иначе
		Запрос.Текст = Запрос.Текст + "
		|	ВЫБРАТЬ
		|	Рег.ОбъектИерархии КАК ОР,
		|	Рег.РодительИерархии КАК Родитель
		|Поместить ТекИерархия
		|ИЗ
		|	РегистрСведений.торо_ИерархическиеСтруктурыОР КАК Рег
		|ГДЕ Рег.СтруктураИерархии = &СтруктураИерархии
		|	" + " ; " ;
	КонецЕсли;
	Запрос.Текст = Запрос.Текст 
+ "ВЫБРАТЬ
  |	Выбор когда ТЧ.ОР.ЭтоАктив Тогда ТЧ.ОР иначе ТЧ.Родитель конец КАК Родитель,
  |	ТЧ.ОР.ЭтоАктив ИЛИ (ТЧ.Родитель.ЭтоАктив
  |		И ТЧ.ОР.ИнвентарныйНомер = ТЧ.Родитель.ИнвентарныйНомер) КАК ЭтоАктив,
  |	ТЧ.ОР.ИнвентарныйНомер КАК ИН,
  |	ТЧ.ОР КАК ОР
  |ПОМЕСТИТЬ Уровень1
  |ИЗ
  |	ТекИерархия КАК ТЧ
  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РемонтыОборудования КАК ВТ_РемонтыОборудования
  |		ПО ТЧ.ОР = ВТ_РемонтыОборудования.ОбъектРемонта
  |;
  |
  |////////////////////////////////////////////////////////////////////////////////
  |ВЫБРАТЬ
  |	ВЫБОР
  |		КОГДА Уровень1.ЭтоАктив
  |			ТОГДА Уровень1.Родитель
  |		ИНАЧЕ ТЧ.Родитель
  |	КОНЕЦ КАК Родитель,
  |	ВЫБОР
  |		КОГДА Уровень1.ЭтоАктив
  |			ТОГДА ИСТИНА
  |		ИНАЧЕ ТЧ.Родитель.ЭтоАктив
  |				И ТЧ.Родитель.ИнвентарныйНомер = Уровень1.ИН
  |	КОНЕЦ КАК ЭтоАктив,
  |	Уровень1.ИН КАК ИН,
  |	Уровень1.ОР КАК ОР
  |ПОМЕСТИТЬ Уровень2
  |ИЗ
  |	Уровень1 КАК Уровень1
  |		ЛЕВОЕ СОЕДИНЕНИЕ ТекИерархия КАК ТЧ
  |		ПО (ТЧ.ОР = Уровень1.Родитель)
   |;
  |
  |////////////////////////////////////////////////////////////////////////////////
  |ВЫБРАТЬ
  |	ВЫБОР
  |		КОГДА Уровень1.ЭтоАктив
  |			ТОГДА Уровень1.Родитель
  |		ИНАЧЕ ТЧ.Родитель
  |	КОНЕЦ КАК Родитель,
  |	ВЫБОР
  |		КОГДА Уровень1.ЭтоАктив
  |			ТОГДА ИСТИНА
  |		ИНАЧЕ ТЧ.Родитель.ЭтоАктив
  |				И ТЧ.Родитель.ИнвентарныйНомер = Уровень1.ИН
  |	КОНЕЦ КАК ЭтоАктив,
  |	Уровень1.ИН КАК ИН,
  |	Уровень1.ОР КАК ОР
  |ПОМЕСТИТЬ Уровень3
  |ИЗ
  |	Уровень2 КАК Уровень1
  |		ЛЕВОЕ СОЕДИНЕНИЕ ТекИерархия КАК ТЧ
  |		ПО (ТЧ.ОР = Уровень1.Родитель);
  |
  |////////////////////////////////////////////////////////////////////////////////
  |ВЫБРАТЬ
  |	ВЫБОР
  |		КОГДА Уровень1.ЭтоАктив
  |			ТОГДА Уровень1.Родитель
  |		ИНАЧЕ ТЧ.Родитель
  |	КОНЕЦ КАК Родитель,
  |	ВЫБОР
  |		КОГДА Уровень1.ЭтоАктив
  |			ТОГДА ИСТИНА
  |		ИНАЧЕ ТЧ.Родитель.ЭтоАктив
  |				И ТЧ.Родитель.ИнвентарныйНомер = Уровень1.ИН
  |	КОНЕЦ КАК ЭтоАктив,
  |	Уровень1.ИН КАК ИН,
  |	Уровень1.ОР КАК ОР
  |ПОМЕСТИТЬ Уровень4
  |ИЗ
  |	Уровень3 КАК Уровень1
  |		ЛЕВОЕ СОЕДИНЕНИЕ ТекИерархия КАК ТЧ
  |		ПО (ТЧ.ОР = Уровень1.Родитель)" + " ; " + "
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ВыявленныеДефектыСписокДефектов.гкс_СимптомДефекта КАК Симптом,
		|	ВТ_РемонтыОборудования.Документ КАК Документ,
		|	ВТ_РемонтыОборудования.Наряд КАК Наряд,
		|	ВТ_РемонтыОборудования.ID КАК ID
		|ПОМЕСТИТЬ ВТ_СимптомыОбъектовРемонта
		|ИЗ
		|	ВТ_РемонтыОборудования КАК ВТ_РемонтыОборудования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов
		|		ПО ВТ_РемонтыОборудования.ID = торо_ВыявленныеДефектыСписокДефектов.ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_РемонтыОборудования.Документ КАК Документ,
		|	ВТ_РемонтыОборудования.Наряд КАК Наряд,
		|	ВТ_РемонтыОборудования.Организация КАК Организация,
		|	ВТ_РемонтыОборудования.ОрганизацияПолучатель КАК ОрганизацияПолучатель,
		|	ВТ_РемонтыОборудования.Номер КАК Номер,
		|	ВТ_РемонтыОборудования.Подразделение КАК Подразделение,
		|	ВТ_РемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта,
		|	ВТ_РемонтыОборудования.ТехНомерОР КАК ТехНомерОР,
		|	ВТ_РемонтыОборудования.ИнвентарныйНомерОР КАК ИнвентарныйНомерОР,
		|	ЕСТЬNULL(ВТ_СимптомыОбъектовРемонта.Симптом, ЗНАЧЕНИЕ(Справочник.гкс_СимптомыДефектов.ПустаяСсылка)) КАК СимптомДефекта,
		|	ВТ_РемонтыОборудования.ОписаниеРемонта КАК ОписаниеРемонта,
		|	ВТ_РемонтыОборудования.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
		|	ВТ_РемонтыОборудования.ID КАК ID,
		|	Уровень3.Родитель КАК ОС,
		|	ПРЕДСТАВЛЕНИЕ(ВТ_РемонтыОборудования.Организация) КАК ОрганизацияПредставление,
		|	ПРЕДСТАВЛЕНИЕ(ВТ_РемонтыОборудования.ОрганизацияПолучатель) КАК ОрганизацияПолучательПредставление,
		|	ПРЕДСТАВЛЕНИЕ(ВТ_РемонтыОборудования.Подразделение) КАК ПодразделениеПредставление,
		|	ПРЕДСТАВЛЕНИЕ(ВТ_РемонтыОборудования.ОбъектРемонта) КАК ОбъектРемонтаПредставление,
		|	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(ВТ_СимптомыОбъектовРемонта.Симптом, ЗНАЧЕНИЕ(Справочник.гкс_СимптомыДефектов.ПустаяСсылка))) КАК СимптомДефектаПредставление,
		|	ПРЕДСТАВЛЕНИЕ(ВТ_РемонтыОборудования.ВидРемонтныхРабот) КАК ВидРемонтныхРаботПредставление
		|ИЗ
		|	ВТ_РемонтыОборудования КАК ВТ_РемонтыОборудования
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СимптомыОбъектовРемонта КАК ВТ_СимптомыОбъектовРемонта
		|		ПО ВТ_РемонтыОборудования.ID = ВТ_СимптомыОбъектовРемонта.ID
		|		Левое соединение Уровень4 КАК Уровень3
		|		ПО Уровень3.ОР = ВТ_РемонтыОборудования.ОбъектРемонта И Уровень3.ЭтоАктив
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаявкаНаРемонтРемонтныеРаботы.Ссылка КАК Документ,
		|	ЗаявкаНаРемонтРемонтныеРаботы.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		|	ЗаявкаНаРемонтРемонтныеРаботы.НомерСтроки КАК НомерСтроки,
		|	ЗаявкаНаРемонтРемонтныеРаботы.ID КАК РемонтнаяРабота_ID,
		|	ЗаявкаНаРемонтРемонтныеРаботы.РемонтнаяРабота КАК РемонтнаяРабота,
		|	ЗаявкаНаРемонтРемонтныеРаботы.гкс_Примечание КАК Примечание
		|ПОМЕСТИТЬ ВТ_РемонтныеРаботы
		|ИЗ
		|	Документ.торо_ЗаявкаНаРемонт.РемонтныеРаботы КАК ЗаявкаНаРемонтРемонтныеРаботы
		|ГДЕ
		|	(ЗаявкаНаРемонтРемонтныеРаботы.Ссылка, ЗаявкаНаРемонтРемонтныеРаботы.РемонтыОборудования_ID) В
		|			(ВЫБРАТЬ
		|				ВТ_РемонтыОборудования.Документ КАК Документ,
		|				ВТ_РемонтыОборудования.ID КАК ID
		|			ИЗ
		|				ВТ_РемонтыОборудования)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РемонтыОборудования.Документ КАК Документ,
		|	ВТ_РемонтыОборудования.ID КАК ID,
		|	ВТ_РемонтныеРаботы.НомерСтроки КАК НомерСтроки,
		|	ВТ_РемонтныеРаботы.РемонтнаяРабота_ID КАК РемонтнаяРабота_ID,
		|	ВТ_РемонтныеРаботы.РемонтнаяРабота КАК РемонтнаяРабота,
		|	ВТ_РемонтныеРаботы.Примечание КАК Примечание,
		|	ПРЕДСТАВЛЕНИЕ(ВТ_РемонтныеРаботы.РемонтнаяРабота) КАК РемонтнаяРаботаПредставление
		|ИЗ
		|	ВТ_РемонтыОборудования КАК ВТ_РемонтыОборудования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РемонтныеРаботы КАК ВТ_РемонтныеРаботы
		|		ПО ВТ_РемонтыОборудования.Документ = ВТ_РемонтныеРаботы.Документ
		|			И ВТ_РемонтыОборудования.ID = ВТ_РемонтныеРаботы.РемонтыОборудования_ID
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|ИТОГИ ПО
		|	ID,
		|	Документ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РемонтныеРаботы.Документ КАК Документ,
		|	ВТ_РемонтныеРаботы.РемонтыОборудования_ID КАК ID,
		|	ВТ_РемонтныеРаботы.РемонтнаяРабота_ID КАК РемонтнаяРабота_ID,
		|	ЕСТЬNULL(ЗаявкаНаРемонтТрудовыеЗатраты.Количество, 0) КАК КоличествоЧеловек,
		|	ЕСТЬNULL(ЗаявкаНаРемонтТрудовыеЗатраты.ВремяРаботы, 0) / 60 КАК ВремяРаботыМин
		|ИЗ
		|	ВТ_РемонтныеРаботы КАК ВТ_РемонтныеРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.ТрудовыеЗатраты КАК ЗаявкаНаРемонтТрудовыеЗатраты
		|		ПО ВТ_РемонтныеРаботы.Документ = ЗаявкаНаРемонтТрудовыеЗатраты.Ссылка
		|			И ВТ_РемонтныеРаботы.РемонтыОборудования_ID = ЗаявкаНаРемонтТрудовыеЗатраты.РемонтыОборудования_ID
		|			И ВТ_РемонтныеРаботы.РемонтнаяРабота_ID = ЗаявкаНаРемонтТрудовыеЗатраты.ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РемонтыОборудования.Наряд КАК Документ,
		|	ВТ_РемонтыОборудования.ID КАК ID,
		|	ЗаявкаНаРемонтИсполнителиПоРемонтам.Исполнитель КАК ИсполнительПоРемонту,
		|	ЗаявкаНаРемонтИсполнителиПоРемонтам.УточнениеИсполнителя КАК УточнениеИсполнителя,
		|	ПРЕДСТАВЛЕНИЕ(ЗаявкаНаРемонтИсполнителиПоРемонтам.Исполнитель) КАК ИсполнительПоРемонтуПредставление
		|ИЗ
		|	ВТ_РемонтыОборудования КАК ВТ_РемонтыОборудования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_НарядНаВыполнениеРемонтныхРабот.ИсполнителиПоРемонтам КАК ЗаявкаНаРемонтИсполнителиПоРемонтам
		|		ПО ВТ_РемонтыОборудования.Наряд = ЗаявкаНаРемонтИсполнителиПоРемонтам.Ссылка
		|			И ВТ_РемонтыОборудования.ID = ЗаявкаНаРемонтИсполнителиПоРемонтам.РемонтыОборудования_ID
		|Упорядочить По ЗаявкаНаРемонтИсполнителиПоРемонтам.НомерСтроки
		|ИТОГИ ПО
		|	ID,
		|	Документ";
	Запрос.УстановитьПараметр("СтруктураИерархии", ТекИерархия);
// гкс- [Печатка] Куст 27.10.2020
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Если ПараметрыПечати.Свойство("МассивID") Тогда
		Запрос.УстановитьПараметр("ID", ПараметрыПечати.МассивID);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, 
		"ГДЕ ЗаявкаНаРемонтРемонтыОборудования.ID В(&ID)", "");
	КонецЕсли;
	
	ЭтоПервый = Истина;
	ИндексВыборкиСДокументами 			= 8;
	ИндексВыборкиСРемонтнымиРаботами 	= ИндексВыборкиСДокументами + 2;
	ИндексВыборкиСТрудовымиЗатратами 	= ИндексВыборкиСРемонтнымиРаботами + 1;
	ИндексВыборкиСИсполнителями 		= ИндексВыборкиСТрудовымиЗатратами + 1;
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаДокументов 		 = РезультатыЗапроса[ИндексВыборкиСДокументами].Выбрать();
	ВыборкаРемонтныеРаботы	 = РезультатыЗапроса[ИндексВыборкиСРемонтнымиРаботами].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаТрудовыеЗатраты	 = РезультатыЗапроса[ИндексВыборкиСТрудовымиЗатратами].Выбрать();
	ВыборкаИсполнители		 = РезультатыЗапроса[ИндексВыборкиСИсполнителями].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДокументов.Следующий() Цикл
		Если НЕ ЭтоПервый Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ЭтоПервый = Ложь;
		
		// Заполняем Шапку табличного документа
		ЗаполнитьЗначенияСвойств(Шапка.Параметры, ВыборкаДокументов);
		// гкс+ [] Деснол 17.08.2022
		ЗаполнитьЗначенияСвойств(Шапка.Параметры, Новый Структура("ОрганизацияПолучательПредставление", "ЗАО ""Содружество-Соя"""));
		// гкс- [] Деснол 17.08.2022
		// гкс+ [03.23] Деснол 17.03.2023
		Шапка.Параметры.Получатель = "Содружество-Соя ЗАО";
		Если СтрНайти(Шапка.Параметры.ОрганизацияПредставление, "КУРСКАГРОТЕРМИНАЛ") > 0 Тогда 
			Шапка.Параметры.Получатель = Шапка.Параметры.ОрганизацияПредставление;
		КонецЕсли;
		// гкс- [03.23] Деснол 17.03.2023
		ТабличныйДокумент.Вывести(Шапка);
		
		СтруктураПоискаID = Новый Структура("ID", ВыборкаДокументов.ID);
		СтруктураПоискаIDДокумент = Новый Структура("ID, Документ", ВыборкаДокументов.ID, ВыборкаДокументов.Наряд);
		ИсполнительПодразделение = Истина;
		// Заполняем испольнителя по работе табличного документа
		Если ВыборкаИсполнители.НайтиСледующий(СтруктураПоискаID) Тогда 
			
			ВыборкаИсполнителиДокумент = ВыборкаИсполнители.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Если ВыборкаИсполнителиДокумент.НайтиСледующий(СтруктураПоискаIDДокумент) Тогда
				Выборка = ВыборкаИсполнителиДокумент.Выбрать();
				Если Выборка.Следующий() Тогда
					ЗаполнитьЗначенияСвойств(Подвал.Параметры, Выборка);
					Если ЗначениеЗаполнено(Выборка.ИсполнительПоРемонту) И 
						ТипЗнч(Выборка.ИсполнительПоРемонту) = Тип("СправочникСсылка.Контрагенты") Тогда 
						ИсполнительПодразделение = Ложь;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		ВыборкаИсполнители.Сбросить();
		Если ИсполнительПодразделение Тогда
			СтруктураПоискаIDДокумент = Новый Структура("ID, Документ", ВыборкаДокументов.ID, ВыборкаДокументов.Документ);
			ТабличныйДокумент.Вывести(ШапкаРР);
			
			// Заполняем строки ремонтных работ табличного документа
			ОбщаяВремяРаботМин = 0;
			Если ВыборкаРемонтныеРаботы.НайтиСледующий(СтруктураПоискаID) Тогда
				
				ВыборкаРемонтныеРаботамыДокумент = ВыборкаРемонтныеРаботы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Если ВыборкаРемонтныеРаботамыДокумент.НайтиСледующий(СтруктураПоискаIDДокумент) Тогда
					Выборка = ВыборкаРемонтныеРаботамыДокумент.Выбрать();
					Пока Выборка.Следующий() Цикл
						
						ЗаполнитьЗначенияСвойств(СтрокаРР.Параметры, Выборка);
						СтрокаРР.Параметры.РемонтнаяРаботаПредставление = ""+СтрокаРР.Параметры.РемонтнаяРаботаПредставление+" "+Выборка.Примечание; 
						
						КоличествоЧеловек 	= 0;
						ВремяРаботыМин 		= 0;
						СтруктураПоиска = Новый Структура("Документ, ID, РемонтнаяРабота_ID", Выборка.Документ, Выборка.ID, Выборка.РемонтнаяРабота_ID);
						Пока ВыборкаТрудовыеЗатраты.НайтиСледующий(СтруктураПоиска) Цикл
							КоличествоЧеловек = КоличествоЧеловек + ВыборкаТрудовыеЗатраты.КоличествоЧеловек;	
							ВремяРаботыМин	  = ВремяРаботыМин + ВыборкаТрудовыеЗатраты.ВремяРаботыМин;
							
							ОбщаяВремяРаботМин = ОбщаяВремяРаботМин + ВыборкаТрудовыеЗатраты.ВремяРаботыМин*ВыборкаТрудовыеЗатраты.КоличествоЧеловек;
						КонецЦикла;
						ВыборкаТрудовыеЗатраты.Сбросить();
						СтрокаРР.Параметры.КоличествоЧеловек = КоличествоЧеловек;	
						СтрокаРР.Параметры.ВремяРаботыМин	= ВремяРаботыМин;
							
						ТабличныйДокумент.Вывести(СтрокаРР);
						
					КонецЦикла;
				КонецЕсли;
				
			КонецЕсли;
			ВыборкаРемонтныеРаботы.Сбросить();
			
			// Заполняем подвал ремонтных работ табличного документа
			Если ОбщаяВремяРаботМин = Цел(ОбщаяВремяРаботМин) Тогда 
				ОбщаяВремяРаботМин = Строка(ОбщаяВремяРаботМин);
			КонецЕсли;
			ПодвалРР.Параметры.ОбщаяВремяРаботМин = ОбщаяВремяРаботМин;
			ТабличныйДокумент.Вывести(ПодвалРР);
		Иначе
			ТабличныйДокумент.Вывести(ШапкаРР2);
		КонецЕсли;
		
		
		
		ТабличныйДокумент.Вывести(Подвал);
	КонецЦикла;	
	
	// Зададим параметры макета
	ТабличныйДокумент.АвтоМасштаб	= Истина;
	ТабличныйДокумент.ПолеСверху  = 0;
	ТабличныйДокумент.ПолеСлева   = 0;
	ТабличныйДокумент.ПолеСнизу   = 0;
	ТабличныйДокумент.ПолеСправа  = 0;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // гкс- [7729] Тарасов 28.09.2020

&ИзменениеИКонтроль("ДобавитьКомандыПечати")
Процедура Расш_гкс_ДобавитьКомандыПечати(КомандыПечати)
	
	// Наряд на выполнение огневых работ
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_НарядНаВыполнениеРемонтныхРабот";
	КомандаПечати.Идентификатор = "НарядНаВыполнениеОгневыхРабот";
	КомандаПечати.Представление = НСтр("es='El vestido-permiso de la ejecución de los trabajos de fuego';ru='Наряд-допуск на выполнение огневых работ';en='Fire work admission order'");
	КомандаПечати.Обработчик = "торо_Печать.ЗапроситьУПользователяДополнительныеПараметрыПередПечатью";
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	
	// Наряд-допуск на производство работ на высоте
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_НарядНаВыполнениеРемонтныхРабот";
	КомандаПечати.Идентификатор = "НарядДопускНаПроизводствоРаботНаВысоте";
	КомандаПечати.Представление = НСтр("es='El vestido-permiso de la producción de los trabajos a la altura';ru='Наряд-допуск на производство работ на высоте';en='Work at heights admission order'");
	КомандаПечати.Обработчик = "торо_Печать.ЗапроситьУПользователяДополнительныеПараметрыПередПечатью";
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	
	// Наряд-допуск для работы в электроустановках
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_НарядНаВыполнениеРемонтныхРабот";
	КомандаПечати.Идентификатор = "НарядДопускДляРаботыВЭлектроустановках";
	КомандаПечати.Представление = НСтр("es='El vestido-permiso para el trabajo en las instalaciones eléctricas';ru='Наряд-допуск для работы в электроустановках';en='The admission order for work in electrical installations'");
	КомандаПечати.Обработчик = "торо_Печать.ЗапроситьУПользователяДополнительныеПараметрыПередПечатью";
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	
	// Наряд на производство работ повышенной опасности
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_НарядНаВыполнениеРемонтныхРабот";
	КомандаПечати.Идентификатор = "НарядНаПроизводствоРаботПовышеннойОпасности";
	КомандаПечати.Представление = НСтр("es='El vestido-permiso de la producción de los trabajos del peligro subido';ru='Наряд-допуск на производство работ повышенной опасности';en='Production of hazardous work admission order'");
	КомандаПечати.Обработчик = "торо_Печать.ЗапроситьУПользователяДополнительныеПараметрыПередПечатью";
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_НарядНаВыполнениеРемонтныхРабот";
	КомандаПечати.Идентификатор = "НарядНаРаботы_НеОпасные";
	КомандаПечати.Представление = НСтр("es='El vestido de los trabajos';ru='Наряд на работы';en='Work order'");
	КомандаПечати.Обработчик = "торо_Печать.ЗапроситьУПользователяДополнительныеПараметрыПередПечатью";
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	
	// Наряд-допуск на проведение газоопасных работ
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_НарядНаВыполнениеРемонтныхРабот";
	КомандаПечати.Идентификатор = "НарядДопускНаПроведениеГазоопасныхРабот";
	КомандаПечати.Представление = НСтр("es='El vestido-permiso de la realización газоопасных de los trabajos';ru='Наряд-допуск на проведение газоопасных работ';en='Hazardous work admission order'");
	КомандаПечати.Обработчик = "торо_Печать.ЗапроситьУПользователяДополнительныеПараметрыПередПечатью";
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_НарядНаВыполнениеРемонтныхРабот";
	КомандаПечати.Идентификатор = "НарядНаРаботы_сПоказателями";
	КомандаПечати.Представление = НСтр("es='El vestido de los trabajos (con la lista de los índices)';ru='Наряд на работы (со списком показателей)';en='Work order (with a list of indicators)'");
	КомандаПечати.Обработчик = "торо_Печать.ЗапроситьУПользователяДополнительныеПараметрыПередПечатью";
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_НарядНаВыполнениеРемонтныхРабот";
	КомандаПечати.Идентификатор = "НарядНаРаботы_ОднимДокументом";
	КомандаПечати.Представление = НСтр("es='El vestido de los trabajos (un documento)';ru='Наряд на работы (одним документом)';en='Work order (in one document)'");
	КомандаПечати.Обработчик = "торо_Печать.ЗапроситьУПользователяДополнительныеПараметрыПередПечатью";
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	
	#Вставка
	// гкс+ [7729] Тарасов 28.09.2020
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_НарядНаВыполнениеРемонтныхРабот";
	КомандаПечати.Идентификатор = "дс_ЗаказНаРаботу";
	КомандаПечати.Представление = НСтр("ru='Заказ на работу';en='Work order'");
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_НарядНаВыполнениеРемонтныхРабот";
	КомандаПечати.Идентификатор = "дс_НарядРемонтныеРаботы";
	КомандаПечати.Представление = НСтр("ru='Наряд-допуск на проведение ремонтных работ';en='Work permit for repair work'");
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);

	// гкс- [7729] Тарасов 28.09.2020
	
	// гкс+ [разработка 2021] Куст 19.05.2021
	// БАТ
	// Наряд на выполнение огневых работ
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_НарядНаВыполнениеРемонтныхРабот";
	КомандаПечати.Идентификатор = "БАТНарядНаВыполнениеОгневыхРабот";
	КомандаПечати.Представление = НСтр("es='El vestido-permiso de la ejecución de los trabajos de fuego';ru='Наряд-допуск на выполнение огневых работ';en='Fire work admission order'");
	КомандаПечати.Обработчик = "торо_Печать.ЗапроситьУПользователяДополнительныеПараметрыПередПечатью";
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	
	// Наряд на производство работ повышенной опасности
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_НарядНаВыполнениеРемонтныхРабот";
	КомандаПечати.Идентификатор = "БАТНарядНаПроизводствоРаботПовышеннойОпасности";
	КомандаПечати.Представление = НСтр("es='El vestido-permiso de la producción de los trabajos del peligro subido';ru='Наряд-допуск на производство работ повышенной опасности';en='Production of hazardous work admission order'");
	КомандаПечати.Обработчик = "торо_Печать.ЗапроситьУПользователяДополнительныеПараметрыПередПечатью";
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	// гкс- [разработка 2021] Куст 19.05.2021
	#КонецВставки	
КонецПроцедуры

&ИзменениеИКонтроль("Печать")
Процедура Расш_гкс_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "НарядНаВыполнениеОгневыхРабот") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"НарядНаВыполнениеОгневыхРабот", 
		"Наряд на выполнение огневых работ", 
		#Удаление
		ПечатьНарядНаВыполнениеОгневыхРабот(МассивОбъектов, ПараметрыПечати),
		#КонецУдаления
		#Вставка
		гкс_ПечатьНарядНаОгневыеРаботы(МассивОбъектов, ПараметрыПечати),
		#КонецВставки
		,
		"Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_НарядНаВыполнениеОгневыхРабот");
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "НарядДопускНаПроизводствоРаботНаВысоте") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"НарядДопускНаПроизводствоРаботНаВысоте", 
		"Наряд допуск на производство работ на высоте", 
		#Удаление
		ПечатьНарядДопускНаПроизводствоРаботНаВысоте(МассивОбъектов,ПараметрыПечати),
		#КонецУдаления
		#Вставка
		гкс_ПечатьНарядНаРоботыНаВысоте(МассивОбъектов,ПараметрыПечати),
		#КонецВставки
		,
		"Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_НарядДопускНаПроизводствоРаботНаВысоте");
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "НарядДопускДляРаботыВЭлектроустановках") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"НарядДопускДляРаботыВЭлектроустановках", 
		"Наряд допуск для работы в электроустановках", 
		ПечатьНарядДопускДляРаботыВЭлектроустановках(МассивОбъектов,ПараметрыПечати),
		,
		"Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_НарядДопускДляРаботыВЭлектроустановках");		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "НарядНаПроизводствоРаботПовышеннойОпасности") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"НарядНаПроизводствоРаботПовышеннойОпасности", 
		"Наряд на производство работ повышенной опасности", 
		#Удаление
		ПечатьНарядНаПроизводствоРаботПовышеннойОпасности(МассивОбъектов, ПараметрыПечати),
		#КонецУдаления
		#Вставка
		гкс_ПечатьНарядНаПроизводствоРаботПовышеннойОпасности(МассивОбъектов, ПараметрыПечати),
		#КонецВставки
		,
		"Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_НарядНаПроизводствоРаботПовышеннойОпасности");		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "НарядНаРаботы_НеОпасные") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"НарядНаРаботы_НеОпасные", 
		"Наряд на производство работ", 
		НарядНаРаботы_НеОпасные(МассивОбъектов, ПараметрыПечати, "НарядНаРаботы_НеОпасные"),
		,
		"Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_НарядНаРаботы_НеОпасные");
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "НарядДопускНаПроведениеГазоопасныхРабот") Тогда 
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
		"НарядДопускНаПроведениеГазоопасныхРабот",
		"Наряд допуск на проведение газоопасных работ",
		#Удаление
		ПечатьНарядДопускНаПроведениеГазоопасныхРабот(МассивОбъектов, ПараметрыПечати),
		#КонецУдаления
		#Вставка
		гкс_ПечатьНарядНаГазоопасныеРаботы(МассивОбъектов, ПараметрыПечати),
		#КонецВставки
		,
		"Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_НарядДопускНаПроведениеГазоопасныхРабот");
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "НарядНаРаботы_сПоказателями") Тогда 
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
		"НарядНаРаботы_сПоказателями",
		"Наряд на производство работ (со списком показателей)",
		НарядНаРаботы_НеОпасные(МассивОбъектов, ПараметрыПечати, "НарядНаРаботы_сПоказателями"),
		,
		"Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_НарядНаРаботы_сПоказателями");
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "НарядНаРаботы_ОднимДокументом") Тогда 
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
		"НарядНаРаботы_ОднимДокументом",
		"Наряд на производство работ (одним документом)",
		НарядНаРаботы_ОднимДокументом(МассивОбъектов, ПараметрыПечати),
		,
		"Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_НарядНаРаботы_ОднимДокументом");
	КонецЕсли;
	
	#Вставка
	// гкс+ [7729] Тарасов 28.09.2020
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "дс_ЗаказНаРаботу") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"дс_ЗаказНаРаботу", 
		"Заказ на работу", 
		ПечатьЗаказНаРаботу(МассивОбъектов, ПараметрыПечати),
		,
		"Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_дс_ЗаказНаРаботу");
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "дс_НарядРемонтныеРаботы") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"дс_НарядРемонтныеРаботы", 
		"Наряд допуск на проведение ремонтных работ", 
		гкс_ПечатьНарядНаРемонтныеРаботы(МассивОбъектов, ПараметрыПечати),
		,
		"Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_гкс_НарядРемонтныеРаботы");
	КонецЕсли;
	// гкс- [7729] Тарасов 28.09.2020	
	// гкс+ [разработка 2021] Куст 19.05.2021
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "БАТНарядНаВыполнениеОгневыхРабот") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"БАТНарядНаВыполнениеОгневыхРабот", 
		"Наряд на выполнение огневых работ", 
		гкс_ПечатьБАТОгневые(МассивОбъектов, ПараметрыПечати),
		,
		"Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_НарядНаВыполнениеОгневыхРабот");
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "БАТНарядНаПроизводствоРаботПовышеннойОпасности") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"БАТНарядНаПроизводствоРаботПовышеннойОпасности", 
		"Наряд на производство работ повышенной опасности", 
		гкс_ПечатьБАТПовышеннойОпасности(МассивОбъектов, ПараметрыПечати),
		,
		"Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_НарядНаПроизводствоРаботПовышеннойОпасности");
	КонецЕсли;
	// гкс- [разработка 2021] Куст 19.05.2021
	#КонецВставки	
КонецПроцедуры

// гкс+ [Релиз 1] Куст 10.12.2020
Функция гкс_ПечатьНарядНаПроизводствоРаботПовышеннойОпасности(МассивОбъектов, ПараметрыПечати)
	
	ТабДок = Новый ТабличныйДокумент;
	// гкс+ [разработка 2021] Куст 07.05.2021
	ТабДок.АвтоМасштаб = Истина;
	// гкс- [разработка 2021] Куст 07.05.2021
	ТабДок.ИмяПараметровПечати = "торо_НарядНаВыполнениеРемонтныхРабот";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_гкс_НарядНаПроизводствоРаботПовышеннойОпасности");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Док.Ссылка КАК Ссылка,
	|	Док.Ссылка.Номер КАК Номер,
	|	Док.Ссылка.Дата КАК Дата,
	|	Док.Ссылка.Организация КАК Организация,
	|	Док.Ссылка.Подразделение КАК Подразделение,
	|	Док.Ссылка.Ответственный КАК Ответственный,
	|	Док.ID КАК ID,
	|	Док.ОбъектРемонта КАК ОбъектРемонта,
	|	Док.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	Док.ДатаНачала КАК ДатаНачала,
	|	Док.ДатаОкончания КАК ДатаОкончания,
	|	Док.ОпаснаяРабота КАК ОпаснаяРабота,
	|	Док.МестоПроведенияРабот КАК МестоПроведенияРабот
	|ПОМЕСТИТЬ ВсеДокументы
	|ИЗ
	|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтыОборудования КАК Док
	|ГДЕ
	|	Док.Ссылка В(&Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВсеДокументы.Ссылка КАК Ссылка,
	|	Ответственные.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	МАКСИМУМ(Ответственные.Сотрудник) КАК Сотрудник
	|ПОМЕСТИТЬ ВсеОтветственныеДокументы
	|ИЗ
	|	ВсеДокументы КАК ВсеДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_НарядНаВыполнениеРемонтныхРабот.Ответственные КАК Ответственные
	|		ПО (Ответственные.Ссылка = ВсеДокументы.Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсеДокументы.Ссылка,
	|	Ответственные.ОтветственноеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеОтветственныеДокументы.Ссылка КАК Ссылка,
	|	ВсеОтветственныеДокументы.Сотрудник КАК Допускающий,
	|	NULL КАК РуководительРабот,
	|	NULL КАК ИсполнительРабот
	|ПОМЕСТИТЬ ОтветственныеБезГруппировки
	|ИЗ
	|	ВсеОтветственныеДокументы КАК ВсеОтветственныеДокументы
	|ГДЕ
	|	ВсеОтветственныеДокументы.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.торо_ОтветственныеЛица.Допускающий)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВсеОтветственныеДокументы.Ссылка,
	|	NULL,
	|	ВсеОтветственныеДокументы.Сотрудник,
	|	NULL
	|ИЗ
	|	ВсеОтветственныеДокументы КАК ВсеОтветственныеДокументы
	|ГДЕ
	|	ВсеОтветственныеДокументы.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.торо_ОтветственныеЛица.РуководительРабот)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВсеОтветственныеДокументы.Ссылка,
	|	NULL,
	|	NULL,
	|	ВсеОтветственныеДокументы.Сотрудник
	|ИЗ
	|	ВсеОтветственныеДокументы КАК ВсеОтветственныеДокументы
	|ГДЕ
	|	ВсеОтветственныеДокументы.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.торо_ОтветственныеЛица.ИсполнительРабот)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтветственныеБезГруппировки.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ОтветственныеБезГруппировки.Допускающий) КАК Допускающий,
	|	МАКСИМУМ(ОтветственныеБезГруппировки.РуководительРабот) КАК РуководительРабот,
	|	МАКСИМУМ(ОтветственныеБезГруппировки.ИсполнительРабот) КАК ИсполнительРабот
	|ПОМЕСТИТЬ ОтвДокументов
	|ИЗ
	|	ОтветственныеБезГруппировки КАК ОтветственныеБезГруппировки
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтветственныеБезГруппировки.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеДокументы.Ссылка КАК Ссылка,
	|	ЕстьNull(ННД.НомерТекст, ВсеДокументы.Номер) КАК Номер,
	|	ВсеДокументы.Ссылка.гкс_РежимРаботы КАК РежимРаботы,
	|	ВсеДокументы.Ссылка.гкс_ОсобыеУсловия КАК ОсобыеУсловия,
	|	ВсеДокументы.Дата КАК Дата,
	|	ВсеДокументы.Организация КАК Организация,
	|	ВсеДокументы.Подразделение КАК Подразделение,
	|	ВсеДокументы.Ответственный КАК Ответственный,
	|	ВсеДокументы.ID КАК ИД,
	|	ВсеДокументы.ОбъектРемонта КАК ОР,
	|	ВсеДокументы.ВидРемонтныхРабот КАК ВР,
	|	ВсеДокументы.ДатаНачала КАК ДатаНачала,
	|	ВсеДокументы.ДатаОкончания КАК ДатаОкончания,
	|	ВсеДокументы.ОпаснаяРабота КАК ОпаснаяРабота,
	|	ВсеДокументы.МестоПроведенияРабот КАК МестоПроведенияРабот,
	|	ОтвДокументов.Допускающий КАК Допускающий,
	|	ОтвДокументов.РуководительРабот КАК РуководительРабот,
	|	ОтвДокументов.ИсполнительРабот КАК ИсполнительРабот
	
	|ИЗ
	|	ВсеДокументы КАК ВсеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтвДокументов КАК ОтвДокументов
	|		ПО ВсеДокументы.Ссылка = ОтвДокументов.Ссылка
	|		левое соединение РегистрСведений.гкс_НомераНарядДопусков КАК ННД
	|		ПО ННД.Документ = ВсеДокументы.Ссылка
	|ИТОГИ
	|	МАКСИМУМ(Номер),
	|	МАКСИМУМ(Дата),
	|	МАКСИМУМ(Организация),
	|	МАКСИМУМ(Подразделение),
	|	МАКСИМУМ(Ответственный)
	|ПО
	|	Ссылка
	|;
	|Выбрать Различные
	// гкс+ [разработка 2021] Куст 08.07.2021
	|Документторо_НарядНаВыполнениеРемонтныхРаботИсполнители.Сотрудник КАК Сотрудник,
	|Документторо_НарядНаВыполнениеРемонтныхРаботИсполнители.Ссылка КАК Ссылка,
	|Документторо_НарядНаВыполнениеРемонтныхРаботИсполнители.РемонтыОборудования_ID КАК ИД,
	|Документторо_НарядНаВыполнениеРемонтныхРаботИсполнители.Квалификация КАК Квалификация,
	|Документторо_НарядНаВыполнениеРемонтныхРаботИсполнители.гкс_СотрудникКонтрагента КАК гкс_СотрудникКонтрагента
	// гкс- [разработка 2021] Куст 08.07.2021
	|ИЗ
	|	ВсеДокументы КАК ВсеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_НарядНаВыполнениеРемонтныхРабот.Исполнители КАК 
	| Документторо_НарядНаВыполнениеРемонтныхРаботИсполнители
	|		ПО ВсеДокументы.Ссылка = Документторо_НарядНаВыполнениеРемонтныхРаботИсполнители.Ссылка
	|Итоги ПО Ссылка, ИД
	|;
	|Выбрать Различные
	| Документторо_НарядНаВыполнениеРемонтныхРаботИсполнителиПоРемонтам.Ссылка КАК Ссылка, 
	| Документторо_НарядНаВыполнениеРемонтныхРаботИсполнителиПоРемонтам.НомерСтроки КАК НомерСтроки,
	| Документторо_НарядНаВыполнениеРемонтныхРаботИсполнителиПоРемонтам.Исполнитель КАК Контрагент, 
	| Документторо_НарядНаВыполнениеРемонтныхРаботИсполнителиПоРемонтам.РемонтыОборудования_ID КАК ИД
	|
	|ИЗ	
	|	ВсеДокументы КАК ВсеДокументы
	|	Внутреннее соединение Документ.торо_НарядНаВыполнениеРемонтныхРабот.ИсполнителиПоРемонтам КАК
	| Документторо_НарядНаВыполнениеРемонтныхРаботИсполнителиПоРемонтам
	|	ПО Документторо_НарядНаВыполнениеРемонтныхРаботИсполнителиПоРемонтам.Ссылка = ВсеДокументы.Ссылка
	|Упорядочить по Документторо_НарядНаВыполнениеРемонтныхРаботИсполнителиПоРемонтам.НомерСтроки	
	|Итоги ПО Ссылка, ИД
	|;
	| Выбрать Различные 
	|ТЧ.Ссылка КАК Ссылка, ТЧ.РемонтыОборудования_ID КАК ИД, ТЧ.РемонтнаяРабота КАК РР, ТЧ.НомерСтроки КАК НомерСтроки
	|
	|	ИЗ	
	|	ВсеДокументы КАК ВсеДокументы
	|	Внутреннее соединение Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтныеРаботы КАК ТЧ
	|	ПО ТЧ.Ссылка = ВсеДокументы.Ссылка
	|Упорядочить По ТЧ.НомерСтроки
	|Итоги ПО Ссылка, ИД
	|;
	|Выбрать Различные
	|ВсеДокументы.Ссылка КАК Ссылка, ТЧ.РемонтыОборудования_ID КАК ИД, ТЧ.Номенклатура КАК Номенклатура
	|ИЗ
	|	ВсеДокументы КАК ВсеДокументы
	|	Внутреннее соединение  Документ.торо_ЗаявкаНаРемонт.МатериальныеЗатраты КАК ТЧ
	|	ПО ТЧ.РемонтыОборудования_ID = ВсеДокументы.ID И ТЧ.Ссылка.Проведен
	|Итоги ПО Ссылка, ИД
	|;
	|Выбрать Различные
	|ВсеДокументы.Ссылка КАК Ссылка, ТЧ.РемонтыОборудования_ID КАК ИД, ТЧ.Инструмент КАК Инструмент
	|ИЗ
	|	ВсеДокументы КАК ВсеДокументы
	|	Внутреннее соединение  Документ.торо_ЗаявкаНаРемонт.Инструменты КАК ТЧ
	|	ПО ТЧ.РемонтыОборудования_ID = ВсеДокументы.ID И ТЧ.Ссылка.Проведен
	|Итоги ПО Ссылка, ИД
	|;
	|Выбрать Различные
	|ВсеДокументы.Ссылка КАК Ссылка, ТЧ.РемонтыОборудования_ID КАК ИД, ТЧ.Номенклатура КАК Номенклатура
	|ИЗ
	|	ВсеДокументы КАК ВсеДокументы
	|	Внутреннее соединение  Документ.торо_ЗаявкаНаРемонт.гкс_СИЗ КАК ТЧ
	|	ПО ТЧ.РемонтыОборудования_ID = ВсеДокументы.ID И ТЧ.Ссылка.Проведен
	|Итоги ПО Ссылка, ИД
	|;
	|Выбрать Различные
	|ВсеДокументы.Ссылка КАК Ссылка, ТЧ.РемонтыОборудования_ID КАК ИД, ТЧ.МераБезопасности КАК МераБезопасности
	|ИЗ
	|	ВсеДокументы КАК ВсеДокументы
	|	Внутреннее соединение  Документ.торо_ЗаявкаНаРемонт.МерыБезопасности КАК ТЧ
	|	ПО ТЧ.РемонтыОборудования_ID = ВсеДокументы.ID И ТЧ.Ссылка.Проведен
	|Итоги ПО Ссылка, ИД
	|;
	|Выбрать 
	|ТЧ.Ссылка КАК Ссылка, ТЧ.НомерСтроки КАК НомерСтроки, 1 КАК Приоритет,
	|	ТЧ.Мероприятие КАК Мероприятие
	|
	|	ИЗ	
	|	ВсеДокументы КАК ВсеДокументы
	|	Внутреннее соединение Документ.торо_НарядНаВыполнениеРемонтныхРабот.гкс_МПОБДо КАК ТЧ
	|	ПО ТЧ.Ссылка = ВсеДокументы.Ссылка
	|
	|Объединить все
	|
	|Выбрать 
	|ТЧ.Ссылка, ТЧ.НомерСтроки, 2 ,
	|	ТЧ.Мероприятие
	|
	|	ИЗ	
	|	ВсеДокументы КАК ВсеДокументы
	|	Внутреннее соединение Документ.торо_НарядНаВыполнениеРемонтныхРабот.гкс_МПОБВоВремя КАК ТЧ
	|	ПО ТЧ.Ссылка = ВсеДокументы.Ссылка
	|
	|Упорядочить по Приоритет, ТЧ.НомерСтроки	
	|Итоги ПО Ссылка
	|;
	|Выбрать Различные ТЧ.Сотрудник
	|Поместить РазличныеСотрудники
	|ИЗ ВсеОтветственныеДокументы КАК ТЧ
	|;
	|Выбрать
	|ТЧ.Сотрудник, Максимум(Рег.ТекущаяДолжность) КАК Должность
	|
	|ИЗ РазличныеСотрудники КАК ТЧ
	|	Внутреннее соединение РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК Рег
	|	По Рег.Сотрудник = ТЧ.Сотрудник
	|Сгруппировать по ТЧ.Сотрудник
	|
	|
	|
	|";
	
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов); 
	Если ПараметрыПечати.Свойство("МассивID") Тогда
		Запрос.УстановитьПараметр("ID", ПараметрыПечати.МассивID);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТЧ.ID В(&ID)", "");
	КонецЕсли;
	
	ПервыйПакет = 4;
	ВторойПакет = ПервыйПакет + 1;
	ТретийПакет = ВторойПакет + 1;
	РемРаботыПакет = ТретийПакет + 1;
	МатЗатПакет = РемРаботыПакет + 1;
	ИнструментыПакет = МатЗатПакет + 1;
	СИЗПакет = ИнструментыПакет + 1;
	МБПакет = СИЗПакет + 1;
	МероприятияПакет = МБПакет + 1;
	ДолжностиПакет = МероприятияПакет + 2;
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаДокументов = РезультатЗапроса[ПервыйПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
	ВыборкаИсполнители = РезультатЗапроса[ВторойПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаКонтрагенты = РезультатЗапроса[ТретийПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаРР = РезультатЗапроса[РемРаботыПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаМатЗат = РезультатЗапроса[МатЗатПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаИнструменты = РезультатЗапроса[ИнструментыПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаСИЗ = РезультатЗапроса[СИЗПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаМБ = РезультатЗапроса[МБПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаМероприятия = РезультатЗапроса[МероприятияПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаДолжности = РезультатЗапроса[ДолжностиПакет].Выбрать();
	
	ЭтоПервый = Истина;
	
	Пока ВыборкаДокументов.Следующий() Цикл
		
		ВыборкаРемонтов = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока ВыборкаРемонтов.Следующий() Цикл
			
			Если НЕ ЭтоПервый Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ЭтоПервый = Ложь;
			СтрПоиска = Новый Структура("Ссылка,ИД", ВыборкаДокументов.Ссылка, ВыборкаРемонтов.ИД);
			СтрПоискаОбщая = Новый Структура("Ссылка", ВыборкаДокументов.Ссылка);
			
			Шапка = Макет.ПолучитьОбласть("Шапка");
			Шапка.Параметры.Номер = ВыборкаДокументов.Номер;
			Шапка.Параметры.День = День(ВыборкаДокументов.Дата);
			Шапка.Параметры.Месяц = Формат(ВыборкаДокументов.Дата, "ДФ=ММММ");
			Шапка.Параметры.Год = Формат(ВыборкаДокументов.Дата, "ДФ=гггг");
			Шапка.Параметры.Ответственный = ВыборкаРемонтов.Ответственный;
			Шапка.Параметры.Организация = ВыборкаРемонтов.Организация;
			Шапка.Параметры.Подразделение = ВыборкаРемонтов.Подразделение;
	Попытка
	    // Подключаем внешнюю компоненту
	    ПодключитьВнешнююКомпоненту("ОбщийМакет.КомпонентаСклоненияФИО", "NameDecl",ТипВнешнейКомпоненты.Native ) ;
	    Объект = Новый("AddIn.NameDecl.CNameDecl");
	Исключение
	    // Не удалось выполнить операции с внешней компонентой
	    Сообщить("Не удалось подключить внешнюю компоненту по причине: " + ОписаниеОшибки()); 
	КонецПопытки;
	Если ЗначениеЗаполнено(ВыборкаРемонтов.ИсполнительРабот) Тогда 
		// Получаем результат склонения
		// гкс+ [разработка 2021] Куст 08.07.2021
		Попытка
			РезультатСклонения = Объект.Просклонять(Строка(ВыборкаРемонтов.ИсполнительРабот), 3);
		Исключение
			РезультатСклонения = Строка(ВыборкаРемонтов.ИсполнительРабот);
		КонецПопытки;
		// гкс- [разработка 2021] Куст 08.07.2021
	Иначе
		РезультатСклонения = "";
	КонецЕсли;
			ВыборкаДолжности.Сбросить();
			Если ВыборкаДолжности.НайтиСледующий(ВыборкаРемонтов.ИсполнительРабот) Тогда 
				Шапка.Параметры.ОтветственныйИсполнитель = Строка(ВыборкаДолжности.Должность) + " " + РезультатСклонения;
			Иначе
				Шапка.Параметры.ОтветственныйИсполнитель = РезультатСклонения;
			КонецЕсли;
			Шапка.Параметры.БригадаКолво = "   ";
			//
			ВыборкаКонтрагенты.Сбросить();
			ЭтоКонтрагент = Ложь;
			Если ВыборкаКонтрагенты.НайтиСледующий(СтрПоискаОбщая) Тогда 
				ВыборкаР = ВыборкаКонтрагенты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаР.Следующий() Цикл
					Если ВыборкаР.ИД = ВыборкаРемонтов.ИД Тогда 
						Выборка = ВыборкаР.Выбрать();
						Выборка.Следующий();
						ЭтоКонтрагент = ТипЗнч(Выборка.Контрагент) = Тип("СправочникСсылка.Контрагенты");
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			Если Не ЭтоКонтрагент Тогда 
				ВыборкаИсполнители.Сбросить();
				Если ВыборкаИсполнители.НайтиСледующий(СтрПоискаОбщая) Тогда 
					ВыборкаР = ВыборкаИсполнители.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаР.Следующий() Цикл
						Если ВыборкаР.ИД = ВыборкаРемонтов.ИД Тогда 
							Колво = 0;
							Выборка = ВыборкаР.Выбрать();
							Пока Выборка.Следующий() Цикл
								Колво = Колво + 1;
							КонецЦикла;
							Шапка.Параметры.БригадаКолво = Колво;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
			Шапка.Параметры.СписокОР = ВыборкаРемонтов.ОР;
			//
			ВыборкаРР.Сбросить();
			Если ВыборкаРР.НайтиСледующий(СтрПоискаОбщая) Тогда 
				МассивТК = Новый Массив();
				ВыборкаР = ВыборкаРР.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаР.Следующий() Цикл
					Если ВыборкаР.ИД = ВыборкаРемонтов.ИД Тогда 
						Выборка = ВыборкаР.Выбрать();
						Пока Выборка.Следующий() Цикл
							Если ТипЗнч(Выборка.РР) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда 
								МассивТК.Добавить(Выборка.РР);
							КонецЕсли;
						КонецЦикла;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Шапка.Параметры.СписокОР = Строка(Шапка.Параметры.СписокОР) + " (" + СтрСоединить(МассивТК,", ") + ")";
			КонецЕсли;
			Шапка.Параметры.СписокМатериалы = "";
			//
			ВыборкаМатЗат.Сбросить();
			Если ВыборкаМатЗат.НайтиСледующий(СтрПоискаОбщая) Тогда 
				ВыборкаР = ВыборкаМатЗат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаР.Следующий() Цикл
					Если ВыборкаР.ИД = ВыборкаРемонтов.ИД Тогда 
						МассивСтрок = Новый Массив();
						Выборка = ВыборкаР.Выбрать();
						Пока Выборка.Следующий() Цикл
							МассивСтрок.Добавить(Выборка.Номенклатура);
						КонецЦикла;
						Шапка.Параметры.СписокМатериалы = СтрСоединить(МассивСтрок, ", ");
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			Шапка.Параметры.СписокИнструменты = "";
			//
			ВыборкаИнструменты.Сбросить();
			Если ВыборкаИнструменты.НайтиСледующий(СтрПоискаОбщая) Тогда 
				ВыборкаР = ВыборкаИнструменты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаР.Следующий() Цикл
					Если ВыборкаР.ИД = ВыборкаРемонтов.ИД Тогда 
						МассивСтрок = Новый Массив();
						Выборка = ВыборкаР.Выбрать();
						Пока Выборка.Следующий() Цикл
							МассивСтрок.Добавить(Выборка.Инструмент);
						КонецЦикла;
						Шапка.Параметры.СписокИнструменты = СтрСоединить(МассивСтрок, ", ");
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			Шапка.Параметры.СписокСИЗ = "";
			//
			ВыборкаСИЗ.Сбросить();
			Если ВыборкаСИЗ.НайтиСледующий(СтрПоискаОбщая) Тогда 
				ВыборкаР = ВыборкаСИЗ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаР.Следующий() Цикл
					Если ВыборкаР.ИД = ВыборкаРемонтов.ИД Тогда 
						МассивСтрок = Новый Массив();
						Выборка = ВыборкаР.Выбрать();
						Пока Выборка.Следующий() Цикл
							МассивСтрок.Добавить(Выборка.Номенклатура);
						КонецЦикла;
						Шапка.Параметры.СписокСИЗ = СтрСоединить(МассивСтрок, ", ");
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			Шапка.Параметры.Мероприятия = "";
			//
			ВыборкаМероприятия.Сбросить();
			Если ВыборкаМероприятия.НайтиСледующий(СтрПоискаОбщая) Тогда 
				МассивСтрок = Новый Массив();
				Выборка = ВыборкаМероприятия.Выбрать();
				Пока Выборка.Следующий() Цикл
					МассивСтрок.Добавить(Выборка.Мероприятие);
				КонецЦикла;
				Шапка.Параметры.Мероприятия = СтрСоединить(МассивСтрок, "" + Символы.ПС);
			КонецЕсли;
			Шапка.Параметры.ОсобыеУсловия = ВыборкаРемонтов.ОсобыеУсловия;
			Шапка.Параметры.ДатаНачала = Формат(ВыборкаРемонтов.ДатаНачала, "ДФ=""ЧЧ 'ч.' мм 'мин.' дд ММММ гггг 'г.'""");
			Шапка.Параметры.ДатаОкончания = Формат(ВыборкаРемонтов.ДатаОкончания, "ДФ=""ЧЧ 'ч.' мм 'мин.' дд ММММ гггг 'г.'""");
			Шапка.Параметры.РежимРаботы = ВыборкаРемонтов.РежимРаботы;
			Если ВыборкаДолжности.НайтиСледующий(ВыборкаРемонтов.РуководительРабот) Тогда 
				Шапка.Параметры.РуководительРабот = Строка(ВыборкаДолжности.Должность) + " " + ВыборкаРемонтов.РуководительРабот;
			Иначе
				Шапка.Параметры.РуководительРабот = ВыборкаРемонтов.РуководительРабот;
			КонецЕсли;
			Если ВыборкаДолжности.НайтиСледующий(ВыборкаРемонтов.Допускающий) Тогда 
				Шапка.Параметры.Допускающий = Строка(ВыборкаДолжности.Должность) + " " + ВыборкаРемонтов.Допускающий;
			Иначе
				Шапка.Параметры.Допускающий = ВыборкаРемонтов.Допускающий;
			КонецЕсли;
			Шапка.Параметры.МерыБезопасности = "";
			//
			ВыборкаМБ.Сбросить();
			Если ВыборкаМБ.НайтиСледующий(СтрПоискаОбщая) Тогда 
				ВыборкаР = ВыборкаМБ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаР.Следующий() Цикл
					Если ВыборкаР.ИД = ВыборкаРемонтов.ИД Тогда 
						МассивСтрок = Новый Массив();
						Выборка = ВыборкаР.Выбрать();
						Пока Выборка.Следующий() Цикл
							МассивСтрок.Добавить(Выборка.МераБезопасности);
						КонецЦикла;
						Шапка.Параметры.МерыБезопасности = СтрСоединить(МассивСтрок, ", ");
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			ТабДок.Вывести(Шапка);
			
			СтрокаТЧ = Макет.ПолучитьОбласть("СтрокаТЧ");
			// гкс+ [разработка 2021] Куст 08.07.2021
			Если ЭтоКонтрагент Тогда 
				ВыборкаИсполнители.Сбросить();
				Если ВыборкаИсполнители.НайтиСледующий(СтрПоискаОбщая) Тогда 
					ВыборкаР = ВыборкаИсполнители.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаР.Следующий() Цикл
						Если ВыборкаР.ИД = ВыборкаРемонтов.ИД Тогда 
							НомерПП = 1;
							Выборка = ВыборкаР.Выбрать();
							Пока Выборка.Следующий() Цикл
								СтрокаТЧ.Параметры.НомерПП = НомерПП;
								СтрокаТЧ.Параметры.Сотрудник = Выборка.гкс_СотрудникКонтрагента;
								СтрокаТЧ.Параметры.Квалификация = Выборка.Квалификация;
								ТабДок.Вывести(СтрокаТЧ);
								НомерПП = НомерПП + 1;
							КонецЦикла;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			Иначе
			// гкс- [разработка 2021] Куст 08.07.2021
				ВыборкаИсполнители.Сбросить();
				Если ВыборкаИсполнители.НайтиСледующий(СтрПоискаОбщая) Тогда 
					ВыборкаР = ВыборкаИсполнители.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаР.Следующий() Цикл
						Если ВыборкаР.ИД = ВыборкаРемонтов.ИД Тогда 
							НомерПП = 1;
							Выборка = ВыборкаР.Выбрать();
							Пока Выборка.Следующий() Цикл
								СтрокаТЧ.Параметры.НомерПП = НомерПП;
								СтрокаТЧ.Параметры.Сотрудник = Выборка.Сотрудник;
								СтрокаТЧ.Параметры.Квалификация = Выборка.Квалификация;
								ТабДок.Вывести(СтрокаТЧ);
								НомерПП = НомерПП + 1;
							КонецЦикла;
							Шапка.Параметры.БригадаКолво = Колво;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
			
			
			Подвал = Макет.ПолучитьОбласть("Подвал");
			Подвал.Параметры.Допускающий = Шапка.Параметры.Допускающий;
			ТабДок.Вывести(Подвал);
		КонецЦикла;
	КонецЦикла;
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ТолькоПросмотр = Истина;
	Возврат ТабДок;
	
КонецФункции
// гкс- [Релиз 1] Куст 10.12.2020

// гкс+ [Релиз 1] Куст 17.12.2020
Функция гкс_ПечатьНарядНаОгневыеРаботы(МассивОбъектов, ПараметрыПечати)
	
	ТабДок = Новый ТабличныйДокумент;
	// гкс+ [разработка 2021] Куст 07.05.2021
	ТабДок.АвтоМасштаб = Истина;
	// гкс- [разработка 2021] Куст 07.05.2021
	ТабДок.ИмяПараметровПечати = "торо_НарядНаВыполнениеРемонтныхРабот";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_гкс_НарядНаОгневыеРаботы");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Док.Ссылка КАК Ссылка,
	|	Док.Ссылка.Номер КАК Номер,
	|	Док.Ссылка.Дата КАК Дата,
	|	Док.Ссылка.Организация КАК Организация,
	|	Док.Ссылка.Подразделение КАК Подразделение,
	|	Док.Ссылка.Ответственный КАК Ответственный,
	|	Док.ID КАК ID,
	|	Док.ОбъектРемонта КАК ОбъектРемонта,
	|	Док.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	Док.ДатаНачала КАК ДатаНачала,
	|	Док.ДатаОкончания КАК ДатаОкончания,
	|	Док.ОпаснаяРабота КАК ОпаснаяРабота,
	|	Док.МестоПроведенияРабот КАК МестоПроведенияРабот
	|ПОМЕСТИТЬ ВсеДокументы
	|ИЗ
	|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтыОборудования КАК Док
	|ГДЕ
	|	Док.Ссылка В(&Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВсеДокументы.Ссылка КАК Ссылка,
	|	Ответственные.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	МАКСИМУМ(Ответственные.Сотрудник) КАК Сотрудник
	|ПОМЕСТИТЬ ВсеОтветственныеДокументы
	|ИЗ
	|	ВсеДокументы КАК ВсеДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_НарядНаВыполнениеРемонтныхРабот.Ответственные КАК Ответственные
	|		ПО (Ответственные.Ссылка = ВсеДокументы.Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсеДокументы.Ссылка,
	|	Ответственные.ОтветственноеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеОтветственныеДокументы.Ссылка КАК Ссылка,
	|	ВсеОтветственныеДокументы.Сотрудник КАК Допускающий,
	|	NULL КАК РуководительРабот,
	|	NULL КАК ИсполнительРабот,
	|	NULL КАК ОтветственныйЗаПодготовку
	|ПОМЕСТИТЬ ОтветственныеБезГруппировки
	|ИЗ
	|	ВсеОтветственныеДокументы КАК ВсеОтветственныеДокументы
	|ГДЕ
	|	ВсеОтветственныеДокументы.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.торо_ОтветственныеЛица.Допускающий)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВсеОтветственныеДокументы.Ссылка,
	|	NULL,
	|	ВсеОтветственныеДокументы.Сотрудник,
	|	NULL
	|	,NULL
	|ИЗ
	|	ВсеОтветственныеДокументы КАК ВсеОтветственныеДокументы
	|ГДЕ
	|	ВсеОтветственныеДокументы.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.торо_ОтветственныеЛица.РуководительРабот)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВсеОтветственныеДокументы.Ссылка,
	|	NULL,
	|	NULL,
	|	ВсеОтветственныеДокументы.Сотрудник
	|	,NULL
	|ИЗ
	|	ВсеОтветственныеДокументы КАК ВсеОтветственныеДокументы
	|ГДЕ
	|	ВсеОтветственныеДокументы.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.торо_ОтветственныеЛица.ИсполнительРабот)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВсеОтветственныеДокументы.Ссылка,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВсеОтветственныеДокументы.Сотрудник
	|ИЗ
	|	ВсеОтветственныеДокументы КАК ВсеОтветственныеДокументы
	|ГДЕ
	|	ВсеОтветственныеДокументы.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.торо_ОтветственныеЛица.ОтветственныйЗаПодготовкуОбъекта)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтветственныеБезГруппировки.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ОтветственныеБезГруппировки.Допускающий) КАК Допускающий,
	|	МАКСИМУМ(ОтветственныеБезГруппировки.РуководительРабот) КАК РуководительРабот,
	|	МАКСИМУМ(ОтветственныеБезГруппировки.ИсполнительРабот) КАК ИсполнительРабот,
	|	МАКСИМУМ(ОтветственныеБезГруппировки.ОтветственныйЗаПодготовку) КАК ОтветственныйЗаПодготовку
	|ПОМЕСТИТЬ ОтвДокументов
	|ИЗ
	|	ОтветственныеБезГруппировки КАК ОтветственныеБезГруппировки
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтветственныеБезГруппировки.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеДокументы.Ссылка КАК Ссылка,
	|	ЕстьNull(ННД.НомерТекст, ВсеДокументы.Номер) КАК Номер,
	|	ВсеДокументы.Ссылка.гкс_РежимРаботы КАК РежимРаботы,
	|	ВсеДокументы.Ссылка.гкс_ОсобыеУсловия КАК ОсобыеУсловия,
	|	ВсеДокументы.Дата КАК Дата,
	|	ВсеДокументы.Организация КАК Организация,
	|	ВсеДокументы.Подразделение КАК Подразделение,
	|	ВсеДокументы.Ответственный КАК Ответственный,
	|	ВсеДокументы.ID КАК ИД,
	|	ВсеДокументы.ОбъектРемонта КАК ОР,
	|	ВсеДокументы.ОбъектРемонта.Подразделение КАК ПодразделениеВладелец,
	|	ВсеДокументы.ВидРемонтныхРабот КАК ВР,
	|	ВсеДокументы.ДатаНачала КАК ДатаНачала,
	|	ВсеДокументы.ДатаОкончания КАК ДатаОкончания,
	|	ВсеДокументы.ОпаснаяРабота КАК ОпаснаяРабота,
	|	ВсеДокументы.МестоПроведенияРабот КАК МестоПроведенияРабот,
	|	ОтвДокументов.Допускающий КАК Допускающий,
	|	ОтвДокументов.РуководительРабот КАК РуководительРабот,
	|	ОтвДокументов.ИсполнительРабот КАК ИсполнительРабот,
	|	ОтвДокументов.ОтветственныйЗаПодготовку КАК ОтветственныйЗаПодготовку
	
	|ИЗ
	|	ВсеДокументы КАК ВсеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтвДокументов КАК ОтвДокументов
	|		ПО ВсеДокументы.Ссылка = ОтвДокументов.Ссылка
	|		левое соединение РегистрСведений.гкс_НомераНарядДопусков КАК ННД
	|		ПО ННД.Документ = ВсеДокументы.Ссылка
	|ИТОГИ
	|	МАКСИМУМ(Номер),
	|	МАКСИМУМ(Дата),
	|	МАКСИМУМ(Организация),
	|	МАКСИМУМ(Подразделение),
	|	МАКСИМУМ(Ответственный)
	|ПО
	|	Ссылка
	|;
	|Выбрать Различные
	|ТЧ.Сотрудник КАК Сотрудник, ТЧ.Ссылка КАК Ссылка, ТЧ.РемонтыОборудования_ID КАК ИД, ТЧ.Квалификация КАК Квалификация
	// гкс+ [разработка 2021] Куст 08.07.2021
	|	, ТЧ.гкс_СотрудникКонтрагента КАК гкс_СотрудникКонтрагента
	// гкс- [разработка 2021] Куст 08.07.2021
	|ИЗ
	|	ВсеДокументы КАК ВсеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_НарядНаВыполнениеРемонтныхРабот.Исполнители КАК ТЧ
	|		ПО ВсеДокументы.Ссылка = ТЧ.Ссылка
	|Итоги ПО Ссылка, ИД
	|;
	|Выбрать Различные
	|ТЧ.Ссылка КАК Ссылка, ТЧ.НомерСтроки КАК НомерСтроки,
	|	ТЧ.Исполнитель КАК Контрагент, ТЧ.РемонтыОборудования_ID КАК ИД
	|
	|	ИЗ	
	|	ВсеДокументы КАК ВсеДокументы
	|	Внутреннее соединение Документ.торо_НарядНаВыполнениеРемонтныхРабот.ИсполнителиПоРемонтам КАК ТЧ
	|	ПО ТЧ.Ссылка = ВсеДокументы.Ссылка
	|Упорядочить по ТЧ.НомерСтроки	
	|Итоги ПО Ссылка, ИД
	|;
	| Выбрать Различные 
	|ТЧ.Ссылка КАК Ссылка, ТЧ.РемонтыОборудования_ID КАК ИД, ТЧ.РемонтнаяРабота КАК РР, ТЧ.НомерСтроки КАК НомерСтроки
	|
	|	ИЗ	
	|	ВсеДокументы КАК ВсеДокументы
	|	Внутреннее соединение Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтныеРаботы КАК ТЧ
	|	ПО ТЧ.Ссылка = ВсеДокументы.Ссылка
	|Упорядочить По ТЧ.НомерСтроки
	|Итоги ПО Ссылка, ИД
	|;  
	|Выбрать 
	|ТЧ.Ссылка КАК Ссылка, ТЧ.НомерСтроки КАК НомерСтроки, 1 КАК Приоритет,
	|	ТЧ.Мероприятие КАК Мероприятие
	|
	|	ИЗ	
	|	ВсеДокументы КАК ВсеДокументы
	|	Внутреннее соединение Документ.торо_НарядНаВыполнениеРемонтныхРабот.гкс_МПОБДо КАК ТЧ
	|	ПО ТЧ.Ссылка = ВсеДокументы.Ссылка
	|
	|Объединить все
	|
	|Выбрать 
	|ТЧ.Ссылка, ТЧ.НомерСтроки, 2 ,
	|	ТЧ.Мероприятие
	|
	|	ИЗ	
	|	ВсеДокументы КАК ВсеДокументы
	|	Внутреннее соединение Документ.торо_НарядНаВыполнениеРемонтныхРабот.гкс_МПОБВоВремя КАК ТЧ
	|	ПО ТЧ.Ссылка = ВсеДокументы.Ссылка
	|
	|Упорядочить по Приоритет, ТЧ.НомерСтроки	
	|Итоги ПО Ссылка
	|;
	|Выбрать Различные ТЧ.Сотрудник
	|Поместить РазличныеСотрудники
	|ИЗ ВсеОтветственныеДокументы КАК ТЧ
	|;
	|Выбрать
	|ТЧ.Сотрудник, Максимум(Рег.ТекущаяДолжность) КАК Должность
	|
	|ИЗ РазличныеСотрудники КАК ТЧ
	|	Внутреннее соединение РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК Рег
	|	По Рег.Сотрудник = ТЧ.Сотрудник
	|Сгруппировать по ТЧ.Сотрудник
	|
	|
	|
	|";
	
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов); 
	Если ПараметрыПечати.Свойство("МассивID") Тогда
		Запрос.УстановитьПараметр("ID", ПараметрыПечати.МассивID);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТЧ.ID В(&ID)", "");
	КонецЕсли;
	
	ПервыйПакет = 4;
	ВторойПакет = ПервыйПакет + 1;
	ТретийПакет = ВторойПакет + 1;
	РемРаботыПакет = ТретийПакет + 1;
	МероприятияПакет = РемРаботыПакет + 1;
	ДолжностиПакет = МероприятияПакет + 2;
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаДокументов = РезультатЗапроса[ПервыйПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
	ВыборкаИсполнители = РезультатЗапроса[ВторойПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаКонтрагенты = РезультатЗапроса[ТретийПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаРР = РезультатЗапроса[РемРаботыПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаМероприятия = РезультатЗапроса[МероприятияПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаДолжности = РезультатЗапроса[ДолжностиПакет].Выбрать();
	
	ЭтоПервый = Истина;
	
	Пока ВыборкаДокументов.Следующий() Цикл
		
		ВыборкаРемонтов = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока ВыборкаРемонтов.Следующий() Цикл
			
			Если НЕ ЭтоПервый Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ЭтоПервый = Ложь;
			СтрПоиска = Новый Структура("Ссылка,ИД", ВыборкаДокументов.Ссылка, ВыборкаРемонтов.ИД);
			СтрПоискаОбщая = Новый Структура("Ссылка", ВыборкаДокументов.Ссылка);
			
			Шапка = Макет.ПолучитьОбласть("Шапка");
			Шапка.Параметры.Номер = ВыборкаДокументов.Номер;
			//Шапка.Параметры.День = День(ВыборкаДокументов.Дата);
			//Шапка.Параметры.Месяц = Формат(ВыборкаДокументов.Дата, "ДФ=ММММ");
			//Шапка.Параметры.Год = Формат(ВыборкаДокументов.Дата, "ДФ=гггг");
			//Шапка.Параметры.Ответственный = ВыборкаРемонтов.Ответственный;
			Шапка.Параметры.Организация = ВыборкаРемонтов.Организация;
			Шапка.Параметры.Подразделение = ВыборкаРемонтов.Подразделение;
			Шапка.Параметры.ПодразделениеВладелец = ВыборкаРемонтов.ПодразделениеВладелец;
			
			ВыборкаДолжности.Сбросить();
			Если ВыборкаДолжности.НайтиСледующий(ВыборкаРемонтов.ОтветственныйЗаПодготовку) Тогда 
				Шапка.Параметры.Ответственный = Строка(ВыборкаДолжности.Должность) + " " + ВыборкаРемонтов.ОтветственныйЗаПодготовку;
			Иначе
				Шапка.Параметры.Ответственный = ВыборкаРемонтов.ОтветственныйЗаПодготовку;
			КонецЕсли;
			//
			ВыборкаКонтрагенты.Сбросить();
			ЭтоКонтрагент = Ложь;
			Если ВыборкаКонтрагенты.НайтиСледующий(СтрПоискаОбщая) Тогда 
				ВыборкаР = ВыборкаКонтрагенты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаР.Следующий() Цикл
					Если ВыборкаР.ИД = ВыборкаРемонтов.ИД Тогда 
						Выборка = ВыборкаР.Выбрать();
						Выборка.Следующий();
						ЭтоКонтрагент = ТипЗнч(Выборка.Контрагент) = Тип("СправочникСсылка.Контрагенты");
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			Шапка.Параметры.ОР = ВыборкаРемонтов.ОР;
			//
			ВыборкаРР.Сбросить();
			Если ВыборкаРР.НайтиСледующий(СтрПоискаОбщая) Тогда 
				МассивТК = Новый Массив();
				ВыборкаР = ВыборкаРР.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаР.Следующий() Цикл
					Если ВыборкаР.ИД = ВыборкаРемонтов.ИД Тогда 
						Выборка = ВыборкаР.Выбрать();
						Пока Выборка.Следующий() Цикл
							Если ТипЗнч(Выборка.РР) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда 
								МассивТК.Добавить(Выборка.РР);
							КонецЕсли;
						КонецЦикла;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Шапка.Параметры.СписокТК = СтрСоединить(МассивТК, ", ");
			КонецЕсли;
			
			Шапка.Параметры.Мероприятия1 = "";
			Шапка.Параметры.Мероприятия2 = "";
			//
			ВыборкаМероприятия.Сбросить();
			Если ВыборкаМероприятия.НайтиСледующий(СтрПоискаОбщая) Тогда 
				МассивСтрок1 = Новый Массив();
				МассивСтрок2 = Новый Массив();
				Выборка = ВыборкаМероприятия.Выбрать();
				Пока Выборка.Следующий() Цикл
					Если Выборка.Приоритет = 1 Тогда 
						МассивСтрок1.Добавить(Выборка.Мероприятие);
					Иначе
						МассивСтрок2.Добавить(Выборка.Мероприятие);
					КонецЕсли;
				КонецЦикла;
				Шапка.Параметры.Мероприятия1 = СтрСоединить(МассивСтрок1, "" + Символы.ПС);
				Шапка.Параметры.Мероприятия2 = СтрСоединить(МассивСтрок2, "" + Символы.ПС);
			КонецЕсли;
			Шапка.Параметры.ДатаНачала = Формат(ВыборкаРемонтов.ДатаНачала, "ДФ=""ЧЧ 'ч.' мм 'мин.' дд ММММ гггг 'г.'""");
			Шапка.Параметры.ДатаОкончания = Формат(ВыборкаРемонтов.ДатаОкончания, "ДФ=""ЧЧ 'ч.' мм 'мин.' дд ММММ гггг 'г.'""");
			ВыборкаДолжности.Сбросить();
			Если ВыборкаДолжности.НайтиСледующий(ВыборкаРемонтов.Допускающий) Тогда 
				Шапка.Параметры.Допускающий = Строка(ВыборкаДолжности.Должность) + " " + ВыборкаРемонтов.Допускающий;
			Иначе
				Шапка.Параметры.Допускающий = ВыборкаРемонтов.Допускающий;
			КонецЕсли;
			//
			ТабДок.Вывести(Шапка);
			
			ШапкаТЧ1 = Макет.ПолучитьОбласть("ШапкаТЧ1");
			ТабДок.Вывести(ШапкаТЧ1);
			СтрокаТЧ1 = Макет.ПолучитьОбласть("СтрокаТЧ1");
			
			ВыборкаИсполнители.Сбросить();
			Если ВыборкаИсполнители.НайтиСледующий(СтрПоискаОбщая) Тогда 
				ВыборкаР = ВыборкаИсполнители.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаР.Следующий() Цикл
					Если ВыборкаР.ИД = ВыборкаРемонтов.ИД Тогда 
						НомерПП = 1;
						Выборка = ВыборкаР.Выбрать();
						Пока Выборка.Следующий() Цикл
							// гкс+ [разработка 2021] Куст 08.07.2021
							Если ЭтоКонтрагент Тогда 
								СтрокаТЧ1.Параметры.НомерПП = НомерПП;
								СтрокаТЧ1.Параметры.Сотрудник = Выборка.гкс_СотрудникКонтрагента;
								СтрокаТЧ1.Параметры.Квалификация = Выборка.Квалификация;
							Иначе
							// гкс- [разработка 2021] Куст 08.07.2021
								СтрокаТЧ1.Параметры.НомерПП = НомерПП;
								СтрокаТЧ1.Параметры.Сотрудник = Выборка.Сотрудник;
								СтрокаТЧ1.Параметры.Квалификация = Выборка.Квалификация;
							КонецЕсли;
							ТабДок.Вывести(СтрокаТЧ1);
							НомерПП = НомерПП + 1;
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			ШапкаТЧ2 = Макет.ПолучитьОбласть("ШапкаТЧ2");
			ТабДок.Вывести(ШапкаТЧ2);
			СтрокаТЧ2 = Макет.ПолучитьОбласть("СтрокаТЧ2");
			ТабДок.Вывести(СтрокаТЧ2);
			ТабДок.Вывести(СтрокаТЧ2);
			ШапкаТЧ3 = Макет.ПолучитьОбласть("ШапкаТЧ3");
			ТабДок.Вывести(ШапкаТЧ3);
			СтрокаТЧ3 = Макет.ПолучитьОбласть("СтрокаТЧ3");
			ТабДок.Вывести(СтрокаТЧ3);
			Подвал = Макет.ПолучитьОбласть("Подвал");
			
			ТабДок.Вывести(Подвал);
		КонецЦикла;
	КонецЦикла;
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ТолькоПросмотр = Истина;
	// гкс+ [разработка 2021] Куст 07.05.2021
	ТабДок.АвтоМасштаб = Истина;
	// гкс- [разработка 2021] Куст 07.05.2021
	Возврат ТабДок;
	
КонецФункции
// гкс- [Релиз 1] Куст 17.12.2020

// гкс+ [Релиз 1] Куст 27.01.2021
Функция гкс_ПечатьНарядНаГазоопасныеРаботы(МассивОбъектов, ПараметрыПечати)
	
	ТабДок = Новый ТабличныйДокумент;
	// гкс+ [разработка 2021] Куст 07.05.2021
	ТабДок.АвтоМасштаб = Истина;
	// гкс- [разработка 2021] Куст 07.05.2021
	ТабДок.ИмяПараметровПечати = "торо_НарядНаВыполнениеРемонтныхРабот";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_гкс_НарядНаГазоопасныеРаботы");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Док.Ссылка КАК Ссылка,
	|	Док.Ссылка.Номер КАК Номер,
	|	Док.Ссылка.Дата КАК Дата,
	|	Док.Ссылка.Организация КАК Организация,
	|	Док.Ссылка.Подразделение КАК Подразделение,
	|	Док.Ссылка.Ответственный КАК Ответственный,
	|	Док.ID КАК ID,
	|	Док.ОбъектРемонта КАК ОбъектРемонта,
	|	Док.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	Док.ДатаНачала КАК ДатаНачала,
	|	Док.ДатаОкончания КАК ДатаОкончания,
	|	Док.ОпаснаяРабота КАК ОпаснаяРабота,
	|	Док.МестоПроведенияРабот КАК МестоПроведенияРабот
	|ПОМЕСТИТЬ ВсеДокументы
	|ИЗ
	|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтыОборудования КАК Док
	|ГДЕ
	|	Док.Ссылка В(&Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВсеДокументы.Ссылка КАК Ссылка,
	|	Ответственные.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	МАКСИМУМ(Ответственные.Сотрудник) КАК Сотрудник
	|ПОМЕСТИТЬ ВсеОтветственныеДокументы
	|ИЗ
	|	ВсеДокументы КАК ВсеДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_НарядНаВыполнениеРемонтныхРабот.Ответственные КАК Ответственные
	|		ПО (Ответственные.Ссылка = ВсеДокументы.Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсеДокументы.Ссылка,
	|	Ответственные.ОтветственноеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеОтветственныеДокументы.Ссылка КАК Ссылка,
	|	ВсеОтветственныеДокументы.Сотрудник КАК Допускающий,
	|	NULL КАК РуководительРабот,
	|	NULL КАК ИсполнительРабот,
	|	NULL КАК ОтветственныйЗаПодготовку
	|ПОМЕСТИТЬ ОтветственныеБезГруппировки
	|ИЗ
	|	ВсеОтветственныеДокументы КАК ВсеОтветственныеДокументы
	|ГДЕ
	|	ВсеОтветственныеДокументы.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.торо_ОтветственныеЛица.Допускающий)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВсеОтветственныеДокументы.Ссылка,
	|	NULL,
	|	ВсеОтветственныеДокументы.Сотрудник,
	|	NULL
	|	,NULL
	|ИЗ
	|	ВсеОтветственныеДокументы КАК ВсеОтветственныеДокументы
	|ГДЕ
	|	ВсеОтветственныеДокументы.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.торо_ОтветственныеЛица.РуководительРабот)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВсеОтветственныеДокументы.Ссылка,
	|	NULL,
	|	NULL,
	|	ВсеОтветственныеДокументы.Сотрудник
	|	,NULL
	|ИЗ
	|	ВсеОтветственныеДокументы КАК ВсеОтветственныеДокументы
	|ГДЕ
	|	ВсеОтветственныеДокументы.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.торо_ОтветственныеЛица.ИсполнительРабот)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВсеОтветственныеДокументы.Ссылка,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВсеОтветственныеДокументы.Сотрудник
	|ИЗ
	|	ВсеОтветственныеДокументы КАК ВсеОтветственныеДокументы
	|ГДЕ
	|	ВсеОтветственныеДокументы.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.торо_ОтветственныеЛица.ОтветственныйЗаПодготовкуОбъекта)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтветственныеБезГруппировки.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ОтветственныеБезГруппировки.Допускающий) КАК Допускающий,
	|	МАКСИМУМ(ОтветственныеБезГруппировки.РуководительРабот) КАК РуководительРабот,
	|	МАКСИМУМ(ОтветственныеБезГруппировки.ИсполнительРабот) КАК ИсполнительРабот,
	|	МАКСИМУМ(ОтветственныеБезГруппировки.ОтветственныйЗаПодготовку) КАК ОтветственныйЗаПодготовку
	|ПОМЕСТИТЬ ОтвДокументов
	|ИЗ
	|	ОтветственныеБезГруппировки КАК ОтветственныеБезГруппировки
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтветственныеБезГруппировки.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеДокументы.Ссылка КАК Ссылка,
	|	ЕстьNull(ННД.НомерТекст, ВсеДокументы.Номер) КАК Номер,
	|	ВсеДокументы.Ссылка.гкс_РежимРаботы КАК РежимРаботы,
	|	ВсеДокументы.Ссылка.гкс_ОсобыеУсловия КАК ОсобыеУсловия,
	|	ВсеДокументы.Дата КАК Дата,
	|	ВсеДокументы.Организация КАК Организация,
	|	ВсеДокументы.Подразделение КАК Подразделение,
	|	ВсеДокументы.Ответственный КАК Ответственный,
	|	ВсеДокументы.ID КАК ИД,
	|	ВсеДокументы.ОбъектРемонта КАК ОР,
	|	ВсеДокументы.ОбъектРемонта.Подразделение КАК ПодразделениеВладелец,
	|	ВсеДокументы.ВидРемонтныхРабот КАК ВР,
	|	ВсеДокументы.ДатаНачала КАК ДатаНачала,
	|	ВсеДокументы.ДатаОкончания КАК ДатаОкончания,
	|	ВсеДокументы.ОпаснаяРабота КАК ОпаснаяРабота,
	|	ВсеДокументы.МестоПроведенияРабот КАК МестоПроведенияРабот,
	|	ОтвДокументов.Допускающий КАК Допускающий,
	|	ОтвДокументов.РуководительРабот КАК РуководительРабот,
	|	ОтвДокументов.ИсполнительРабот КАК ИсполнительРабот,
	|	ОтвДокументов.ОтветственныйЗаПодготовку КАК ОтветственныйЗаПодготовку
	
	|ИЗ
	|	ВсеДокументы КАК ВсеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтвДокументов КАК ОтвДокументов
	|		ПО ВсеДокументы.Ссылка = ОтвДокументов.Ссылка
	|		левое соединение РегистрСведений.гкс_НомераНарядДопусков КАК ННД
	|		ПО ННД.Документ = ВсеДокументы.Ссылка
	|ИТОГИ
	|	МАКСИМУМ(Номер),
	|	МАКСИМУМ(Дата),
	|	МАКСИМУМ(Организация),
	|	МАКСИМУМ(Подразделение),
	|	МАКСИМУМ(Ответственный)
	|ПО
	|	Ссылка
	|;
	|Выбрать Различные
	|ТЧ.Сотрудник КАК Сотрудник, ТЧ.Ссылка КАК Ссылка, ТЧ.РемонтыОборудования_ID КАК ИД, ТЧ.Квалификация КАК Квалификация
	// гкс+ [разработка 2021] Куст 08.07.2021
	|	, ТЧ.гкс_СотрудникКонтрагента КАК гкс_СотрудникКонтрагента
	// гкс- [разработка 2021] Куст 08.07.2021
	|ИЗ
	|	ВсеДокументы КАК ВсеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_НарядНаВыполнениеРемонтныхРабот.Исполнители КАК ТЧ
	|		ПО ВсеДокументы.Ссылка = ТЧ.Ссылка
	|Итоги ПО Ссылка, ИД
	|;
	|Выбрать Различные
	|ТЧ.Ссылка КАК Ссылка, ТЧ.НомерСтроки КАК НомерСтроки,
	|	ТЧ.Исполнитель КАК Контрагент, ТЧ.РемонтыОборудования_ID КАК ИД
	|
	|	ИЗ	
	|	ВсеДокументы КАК ВсеДокументы
	|	Внутреннее соединение Документ.торо_НарядНаВыполнениеРемонтныхРабот.ИсполнителиПоРемонтам КАК ТЧ
	|	ПО ТЧ.Ссылка = ВсеДокументы.Ссылка
	|Упорядочить по ТЧ.НомерСтроки	
	|Итоги ПО Ссылка, ИД
	|;
	| Выбрать Различные 
	|ТЧ.Ссылка КАК Ссылка, ТЧ.РемонтыОборудования_ID КАК ИД, ТЧ.РемонтнаяРабота КАК РР, ТЧ.НомерСтроки КАК НомерСтроки
	|
	|	ИЗ	
	|	ВсеДокументы КАК ВсеДокументы
	|	Внутреннее соединение Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтныеРаботы КАК ТЧ
	|	ПО ТЧ.Ссылка = ВсеДокументы.Ссылка
	|Упорядочить По ТЧ.НомерСтроки
	|Итоги ПО Ссылка, ИД
	|;  
	|Выбрать 
	|ТЧ.Ссылка КАК Ссылка, ТЧ.НомерСтроки КАК НомерСтроки, 1 КАК Приоритет,
	|	ТЧ.Мероприятие КАК Мероприятие
	|
	|	ИЗ	
	|	ВсеДокументы КАК ВсеДокументы
	|	Внутреннее соединение Документ.торо_НарядНаВыполнениеРемонтныхРабот.гкс_МПОБДо КАК ТЧ
	|	ПО ТЧ.Ссылка = ВсеДокументы.Ссылка
	|
	|Объединить все
	|
	|Выбрать 
	|ТЧ.Ссылка, ТЧ.НомерСтроки, 2 ,
	|	ТЧ.Мероприятие
	|
	|	ИЗ	
	|	ВсеДокументы КАК ВсеДокументы
	|	Внутреннее соединение Документ.торо_НарядНаВыполнениеРемонтныхРабот.гкс_МПОБВоВремя КАК ТЧ
	|	ПО ТЧ.Ссылка = ВсеДокументы.Ссылка
	|
	|Упорядочить по Приоритет, ТЧ.НомерСтроки	
	|Итоги ПО Ссылка
	|;
	|Выбрать Различные ТЧ.Сотрудник
	|Поместить РазличныеСотрудники
	|ИЗ ВсеОтветственныеДокументы КАК ТЧ
	|;
	|Выбрать
	|ТЧ.Сотрудник, Максимум(Рег.ТекущаяДолжность) КАК Должность
	|
	|ИЗ РазличныеСотрудники КАК ТЧ
	|	Внутреннее соединение РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК Рег
	|	По Рег.Сотрудник = ТЧ.Сотрудник
	|Сгруппировать по ТЧ.Сотрудник
	|
		|;
	|Выбрать Различные
	|ВсеДокументы.Ссылка КАК Ссылка, ТЧ.НомерСтроки	КАК НомерСтроки, ТЧ.Номенклатура КАК Номенклатура,
	|	ТЧ.РемонтыОборудования_ID КАК ИД
	|ИЗ	
	|	ВсеДокументы КАК ВсеДокументы
	|	Внутреннее соединение Документ.торо_НарядНаВыполнениеРемонтныхРабот.ДокументыОснования КАК Основания
	|		Внутреннее соединение Документ.торо_ЗаявкаНаРемонт.гкс_СИЗ КАК ТЧ
	|		ПО ТЧ.Ссылка = Основания.ДокументОснование
	|	ПО ВсеДокументы.Ссылка = Основания.Ссылка
	|Упорядочить по ТЧ.НомерСтроки	
	|Итоги ПО Ссылка
	|
	|
	|";
	
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов); 
	Если ПараметрыПечати.Свойство("МассивID") Тогда
		Запрос.УстановитьПараметр("ID", ПараметрыПечати.МассивID);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТЧ.ID В(&ID)", "");
	КонецЕсли;
	
	ПервыйПакет = 4;
	ВторойПакет = ПервыйПакет + 1;
	ТретийПакет = ВторойПакет + 1;
	РемРаботыПакет = ТретийПакет + 1;
	МероприятияПакет = РемРаботыПакет + 1;
	ДолжностиПакет = МероприятияПакет + 2;
	СИЗПакет = ДолжностиПакет + 1;
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаДокументов = РезультатЗапроса[ПервыйПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
	ВыборкаИсполнители = РезультатЗапроса[ВторойПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаКонтрагенты = РезультатЗапроса[ТретийПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаРР = РезультатЗапроса[РемРаботыПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаМероприятия = РезультатЗапроса[МероприятияПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаДолжности = РезультатЗапроса[ДолжностиПакет].Выбрать();
	ВыборкаСИЗ = РезультатЗапроса[СИЗПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ЭтоПервый = Истина;
	
	Пока ВыборкаДокументов.Следующий() Цикл
		
		ВыборкаРемонтов = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока ВыборкаРемонтов.Следующий() Цикл
			
			Если НЕ ЭтоПервый Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ЭтоПервый = Ложь;
			СтрПоиска = Новый Структура("Ссылка,ИД", ВыборкаДокументов.Ссылка, ВыборкаРемонтов.ИД);
			СтрПоискаОбщая = Новый Структура("Ссылка", ВыборкаДокументов.Ссылка);
			
			Шапка = Макет.ПолучитьОбласть("Шапка");
			Шапка.Параметры.Номер = ВыборкаДокументов.Номер;
			//Шапка.Параметры.День = День(ВыборкаДокументов.Дата);
			//Шапка.Параметры.Месяц = Формат(ВыборкаДокументов.Дата, "ДФ=ММММ");
			//Шапка.Параметры.Год = Формат(ВыборкаДокументов.Дата, "ДФ=гггг");
			//Шапка.Параметры.Ответственный = ВыборкаРемонтов.Ответственный;
			Шапка.Параметры.Организация = ВыборкаРемонтов.Организация;
			Шапка.Параметры.Подразделение = ВыборкаРемонтов.Подразделение;
			Шапка.Параметры.ПодразделениеВладелец = ВыборкаРемонтов.ПодразделениеВладелец;
			
			ВыборкаДолжности.Сбросить();
			Если ВыборкаДолжности.НайтиСледующий(ВыборкаРемонтов.ОтветственныйЗаПодготовку) Тогда 
				Шапка.Параметры.Ответственный = Строка(ВыборкаДолжности.Должность) + " " + ВыборкаРемонтов.ОтветственныйЗаПодготовку;
			Иначе
				Шапка.Параметры.Ответственный = ВыборкаРемонтов.ОтветственныйЗаПодготовку;
			КонецЕсли;
			//
			ВыборкаКонтрагенты.Сбросить();
			ЭтоКонтрагент = Ложь;
			Если ВыборкаКонтрагенты.НайтиСледующий(СтрПоискаОбщая) Тогда 
				ВыборкаР = ВыборкаКонтрагенты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаР.Следующий() Цикл
					Если ВыборкаР.ИД = ВыборкаРемонтов.ИД Тогда 
						Выборка = ВыборкаР.Выбрать();
						Выборка.Следующий();
						ЭтоКонтрагент = ТипЗнч(Выборка.Контрагент) = Тип("СправочникСсылка.Контрагенты");
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			Шапка.Параметры.ОР = ВыборкаРемонтов.ОР;
			//
			ВыборкаРР.Сбросить();
			Если ВыборкаРР.НайтиСледующий(СтрПоискаОбщая) Тогда 
				МассивТК = Новый Массив();
				ВыборкаР = ВыборкаРР.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаР.Следующий() Цикл
					Если ВыборкаР.ИД = ВыборкаРемонтов.ИД Тогда 
						Выборка = ВыборкаР.Выбрать();
						Пока Выборка.Следующий() Цикл
							Если ТипЗнч(Выборка.РР) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда 
								МассивТК.Добавить(Выборка.РР);
							КонецЕсли;
						КонецЦикла;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Шапка.Параметры.СписокТК = СтрСоединить(МассивТК, ", ");
			КонецЕсли;
			//
			ВыборкаСИЗ.Сбросить();
			Если ВыборкаСИЗ.НайтиСледующий(СтрПоискаОбщая) Тогда 
				МассивСИЗ = Новый Массив();
				ВыборкаНом = ВыборкаСИЗ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаНом.Следующий() Цикл
					Если ВыборкаНом.ИД = ВыборкаРемонтов.ИД Тогда 
						МассивСИЗ.Добавить(ВыборкаНом.Номенклатура);
					КонецЕсли;
				КонецЦикла;
				Шапка.Параметры.СИЗ = СтрСоединить(МассивСИЗ, ", ");
			КонецЕсли;
			
			Шапка.Параметры.Мероприятия1 = "";
			Шапка.Параметры.Мероприятия2 = "";
			//
			ВыборкаМероприятия.Сбросить();
			Если ВыборкаМероприятия.НайтиСледующий(СтрПоискаОбщая) Тогда 
				МассивСтрок1 = Новый Массив();
				МассивСтрок2 = Новый Массив();
				Выборка = ВыборкаМероприятия.Выбрать();
				Пока Выборка.Следующий() Цикл
					Если Выборка.Приоритет = 1 Тогда 
						МассивСтрок1.Добавить(Выборка.Мероприятие);
					Иначе
						МассивСтрок2.Добавить(Выборка.Мероприятие);
					КонецЕсли;
				КонецЦикла;
				Шапка.Параметры.Мероприятия1 = СтрСоединить(МассивСтрок1, "" + Символы.ПС);
				Шапка.Параметры.Мероприятия2 = СтрСоединить(МассивСтрок2, "" + Символы.ПС);
			КонецЕсли;
			Шапка.Параметры.ДатаНачала = Формат(ВыборкаРемонтов.ДатаНачала, "ДФ=""ЧЧ 'ч.' мм 'мин.' дд ММММ гггг 'г.'""");
			Шапка.Параметры.ДатаОкончания = Формат(ВыборкаРемонтов.ДатаОкончания, "ДФ=""ЧЧ 'ч.' мм 'мин.' дд ММММ гггг 'г.'""");
			ВыборкаДолжности.Сбросить();
			Если ВыборкаДолжности.НайтиСледующий(ВыборкаРемонтов.Допускающий) Тогда 
				Шапка.Параметры.Допускающий = Строка(ВыборкаДолжности.Должность) + " " + ВыборкаРемонтов.Допускающий;
			Иначе
				Шапка.Параметры.Допускающий = ВыборкаРемонтов.Допускающий;
			КонецЕсли;
			//
			ТабДок.Вывести(Шапка);
			
			СтрокаТЧ1 = Макет.ПолучитьОбласть("СтрокаТЧ1");
			
			ВыборкаИсполнители.Сбросить();
			Если ВыборкаИсполнители.НайтиСледующий(СтрПоискаОбщая) Тогда 
				ВыборкаР = ВыборкаИсполнители.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаР.Следующий() Цикл
					Если ВыборкаР.ИД = ВыборкаРемонтов.ИД Тогда 
						НомерПП = 1;
						Выборка = ВыборкаР.Выбрать();
						Пока Выборка.Следующий() Цикл
							// гкс+ [разработка 2021] Куст 08.07.2021
							Если ЭтоКонтрагент Тогда 
								СтрокаТЧ1.Параметры.НомерПП = НомерПП;
								СтрокаТЧ1.Параметры.Сотрудник = Выборка.гкс_СотрудникКонтрагента;
							Иначе
							// гкс- [разработка 2021] Куст 08.07.2021
								СтрокаТЧ1.Параметры.НомерПП = НомерПП;
								СтрокаТЧ1.Параметры.Сотрудник = Выборка.Сотрудник;
								//СтрокаТЧ1.Параметры.Квалификация = Выборка.Квалификация;
							КонецЕсли;
							ТабДок.Вывести(СтрокаТЧ1);
							НомерПП = НомерПП + 1;
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			ШапкаТЧ2 = Макет.ПолучитьОбласть("ШапкаТЧ2");
			ТабДок.Вывести(ШапкаТЧ2);
			СтрокаТЧ2 = Макет.ПолучитьОбласть("СтрокаТЧ2");
			ТабДок.Вывести(СтрокаТЧ2);
			ТабДок.Вывести(СтрокаТЧ2);
			Подвал = Макет.ПолучитьОбласть("Подвал");
			
			ТабДок.Вывести(Подвал);
		КонецЦикла;
	КонецЦикла;
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ТолькоПросмотр = Истина;
	Возврат ТабДок;
	
КонецФункции
// гкс- [Релиз 1] Куст 27.01.2021

// гкс+ [Релиз 1] Куст 29.01.2021
Функция гкс_ПечатьНарядНаРемонтныеРаботы(МассивОбъектов, ПараметрыПечати)
	
	ТабДок = Новый ТабличныйДокумент;
	// гкс+ [разработка 2021] Куст 07.05.2021
	ТабДок.АвтоМасштаб = Истина;
	// гкс- [разработка 2021] Куст 07.05.2021
	ТабДок.ИмяПараметровПечати = "торо_НарядНаВыполнениеРемонтныхРабот";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_гкс_НарядРемонтныеРаботы");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Док.Ссылка КАК Ссылка,
	|	Док.Ссылка.Номер КАК Номер,
	|	Док.Ссылка.Дата КАК Дата,
	|	Док.Ссылка.Организация КАК Организация,
	|	Док.Ссылка.Подразделение КАК Подразделение,
	|	Док.Ссылка.Ответственный КАК Ответственный,
	|	Док.ID КАК ID,
	|	Док.ОбъектРемонта КАК ОбъектРемонта,
	|	Док.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	Док.ДатаНачала КАК ДатаНачала,
	|	Док.ДатаОкончания КАК ДатаОкончания,
	|	Док.ОпаснаяРабота КАК ОпаснаяРабота,
	|	Док.МестоПроведенияРабот КАК МестоПроведенияРабот
	|ПОМЕСТИТЬ ВсеДокументы
	|ИЗ
	|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтыОборудования КАК Док
	|ГДЕ
	|	Док.Ссылка В(&Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВсеДокументы.Ссылка КАК Ссылка,
	|	Ответственные.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	МАКСИМУМ(Ответственные.Сотрудник) КАК Сотрудник
	|ПОМЕСТИТЬ ВсеОтветственныеДокументы
	|ИЗ
	|	ВсеДокументы КАК ВсеДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_НарядНаВыполнениеРемонтныхРабот.Ответственные КАК Ответственные
	|		ПО (Ответственные.Ссылка = ВсеДокументы.Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсеДокументы.Ссылка,
	|	Ответственные.ОтветственноеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеОтветственныеДокументы.Ссылка КАК Ссылка,
	|	ВсеОтветственныеДокументы.Сотрудник КАК Допускающий,
	|	NULL КАК РуководительРабот,
	|	NULL КАК ИсполнительРабот,
	|	NULL КАК ОтветственныйЗаПодготовку
	|ПОМЕСТИТЬ ОтветственныеБезГруппировки
	|ИЗ
	|	ВсеОтветственныеДокументы КАК ВсеОтветственныеДокументы
	|ГДЕ
	|	ВсеОтветственныеДокументы.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.торо_ОтветственныеЛица.Допускающий)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВсеОтветственныеДокументы.Ссылка,
	|	NULL,
	|	ВсеОтветственныеДокументы.Сотрудник,
	|	NULL
	|	,NULL
	|ИЗ
	|	ВсеОтветственныеДокументы КАК ВсеОтветственныеДокументы
	|ГДЕ
	|	ВсеОтветственныеДокументы.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.торо_ОтветственныеЛица.РуководительРабот)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВсеОтветственныеДокументы.Ссылка,
	|	NULL,
	|	NULL,
	|	ВсеОтветственныеДокументы.Сотрудник
	|	,NULL
	|ИЗ
	|	ВсеОтветственныеДокументы КАК ВсеОтветственныеДокументы
	|ГДЕ
	|	ВсеОтветственныеДокументы.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.торо_ОтветственныеЛица.ИсполнительРабот)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВсеОтветственныеДокументы.Ссылка,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВсеОтветственныеДокументы.Сотрудник
	|ИЗ
	|	ВсеОтветственныеДокументы КАК ВсеОтветственныеДокументы
	|ГДЕ
	|	ВсеОтветственныеДокументы.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.торо_ОтветственныеЛица.ОтветственныйЗаПодготовкуОбъекта)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтветственныеБезГруппировки.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ОтветственныеБезГруппировки.Допускающий) КАК Допускающий,
	|	МАКСИМУМ(ОтветственныеБезГруппировки.РуководительРабот) КАК РуководительРабот,
	|	МАКСИМУМ(ОтветственныеБезГруппировки.ИсполнительРабот) КАК ИсполнительРабот,
	|	МАКСИМУМ(ОтветственныеБезГруппировки.ОтветственныйЗаПодготовку) КАК ОтветственныйЗаПодготовку
	|ПОМЕСТИТЬ ОтвДокументов
	|ИЗ
	|	ОтветственныеБезГруппировки КАК ОтветственныеБезГруппировки
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтветственныеБезГруппировки.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеДокументы.Ссылка КАК Ссылка,
	|	ЕстьNull(ННД.НомерТекст, ВсеДокументы.Номер) КАК Номер,
	|	ВсеДокументы.Ссылка.гкс_РежимРаботы КАК РежимРаботы,
	|	ВсеДокументы.Ссылка.гкс_ОсобыеУсловия КАК ОсобыеУсловия,
	|	ВсеДокументы.Дата КАК Дата,
	|	ВсеДокументы.Организация КАК Организация,
	|	ВсеДокументы.Подразделение КАК Подразделение,
	|	ВсеДокументы.Ответственный КАК Ответственный,
	|	ВсеДокументы.ID КАК ИД,
	|	ВсеДокументы.ОбъектРемонта КАК ОР,
	|	ВсеДокументы.ОбъектРемонта.Подразделение КАК ПодразделениеВладелец,
	|	ВсеДокументы.ВидРемонтныхРабот КАК ВР,
	|	ВсеДокументы.ДатаНачала КАК ДатаНачала,
	|	ВсеДокументы.ДатаОкончания КАК ДатаОкончания,
	|	ВсеДокументы.ОпаснаяРабота КАК ОпаснаяРабота,
	|	ВсеДокументы.МестоПроведенияРабот КАК МестоПроведенияРабот,
	|	ОтвДокументов.Допускающий КАК Допускающий,
	|	ОтвДокументов.РуководительРабот КАК РуководительРабот,
	|	ОтвДокументов.ИсполнительРабот КАК ИсполнительРабот,
	|	ОтвДокументов.ОтветственныйЗаПодготовку КАК ОтветственныйЗаПодготовку
	
	|ИЗ
	|	ВсеДокументы КАК ВсеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтвДокументов КАК ОтвДокументов
	|		ПО ВсеДокументы.Ссылка = ОтвДокументов.Ссылка
	|		левое соединение РегистрСведений.гкс_НомераНарядДопусков КАК ННД
	|		ПО ННД.Документ = ВсеДокументы.Ссылка
	|ИТОГИ
	|	МАКСИМУМ(Номер),
	|	МАКСИМУМ(Дата),
	|	МАКСИМУМ(Организация),
	|	МАКСИМУМ(Подразделение),
	|	МАКСИМУМ(Ответственный)
	|ПО
	|	Ссылка
	|;
	|Выбрать Различные
	|ТЧ.Сотрудник КАК Сотрудник,
	|ТЧ.Ссылка КАК Ссылка, ТЧ.РемонтыОборудования_ID КАК ИД, ТЧ.Квалификация КАК Квалификация
	// гкс+ [разработка 2021] Куст 08.07.2021
	|	, ТЧ.гкс_СотрудникКонтрагента КАК гкс_СотрудникКонтрагента
	// гкс- [разработка 2021] Куст 08.07.2021
	|ИЗ
	|	ВсеДокументы КАК ВсеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_НарядНаВыполнениеРемонтныхРабот.Исполнители КАК ТЧ
	|		ПО ВсеДокументы.Ссылка = ТЧ.Ссылка
	|Итоги ПО Ссылка, ИД
	|;
	|Выбрать Различные
	|ТЧ.Ссылка КАК Ссылка, ТЧ.НомерСтроки КАК НомерСтроки,
	|	ТЧ.Исполнитель КАК Контрагент, ТЧ.РемонтыОборудования_ID КАК ИД
	|
	|	ИЗ	
	|	ВсеДокументы КАК ВсеДокументы
	|	Внутреннее соединение Документ.торо_НарядНаВыполнениеРемонтныхРабот.ИсполнителиПоРемонтам КАК ТЧ
	|	ПО ТЧ.Ссылка = ВсеДокументы.Ссылка
	|Упорядочить по ТЧ.НомерСтроки	
	|Итоги ПО Ссылка, ИД
	|;
	| Выбрать Различные 
	|ТЧ.Ссылка КАК Ссылка, ТЧ.РемонтыОборудования_ID КАК ИД, ТЧ.РемонтнаяРабота КАК РР, ТЧ.НомерСтроки КАК НомерСтроки
	|
	|	ИЗ	
	|	ВсеДокументы КАК ВсеДокументы
	|	Внутреннее соединение Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтныеРаботы КАК ТЧ
	|	ПО ТЧ.Ссылка = ВсеДокументы.Ссылка
	|Упорядочить По ТЧ.НомерСтроки
	|Итоги ПО Ссылка, ИД
	|;  
	|Выбрать 
	|ТЧ.Ссылка КАК Ссылка, ТЧ.НомерСтроки КАК НомерСтроки, 1 КАК Приоритет,
	|	ТЧ.Мероприятие КАК Мероприятие
	|
	|	ИЗ	
	|	ВсеДокументы КАК ВсеДокументы
	|	Внутреннее соединение Документ.торо_НарядНаВыполнениеРемонтныхРабот.гкс_МПОБДо КАК ТЧ
	|	ПО ТЧ.Ссылка = ВсеДокументы.Ссылка
	|
	|Объединить все
	|
	|Выбрать 
	|ТЧ.Ссылка, ТЧ.НомерСтроки, 2 ,
	|	ТЧ.Мероприятие
	|
	|	ИЗ	
	|	ВсеДокументы КАК ВсеДокументы
	|	Внутреннее соединение Документ.торо_НарядНаВыполнениеРемонтныхРабот.гкс_МПОБВоВремя КАК ТЧ
	|	ПО ТЧ.Ссылка = ВсеДокументы.Ссылка
	|
	|Упорядочить по Приоритет, ТЧ.НомерСтроки	
	|Итоги ПО Ссылка
	|;
	|Выбрать Различные ТЧ.Сотрудник
	|Поместить РазличныеСотрудники
	|ИЗ ВсеОтветственныеДокументы КАК ТЧ
	|;
	|Выбрать
	|ТЧ.Сотрудник, Максимум(Рег.ТекущаяДолжность) КАК Должность
	|
	|ИЗ РазличныеСотрудники КАК ТЧ
	|	Внутреннее соединение РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК Рег
	|	По Рег.Сотрудник = ТЧ.Сотрудник
	|Сгруппировать по ТЧ.Сотрудник
	|
	|
	|
	|";
	
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов); 
	Если ПараметрыПечати.Свойство("МассивID") Тогда
		Запрос.УстановитьПараметр("ID", ПараметрыПечати.МассивID);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТЧ.ID В(&ID)", "");
	КонецЕсли;
	
	ПервыйПакет = 4;
	ВторойПакет = ПервыйПакет + 1;
	ТретийПакет = ВторойПакет + 1;
	РемРаботыПакет = ТретийПакет + 1;
	МероприятияПакет = РемРаботыПакет + 1;
	ДолжностиПакет = МероприятияПакет + 2;
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаДокументов = РезультатЗапроса[ПервыйПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
	ВыборкаИсполнители = РезультатЗапроса[ВторойПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаКонтрагенты = РезультатЗапроса[ТретийПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаРР = РезультатЗапроса[РемРаботыПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаМероприятия = РезультатЗапроса[МероприятияПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаДолжности = РезультатЗапроса[ДолжностиПакет].Выбрать();
	
	ЭтоПервый = Истина;
	
	Пока ВыборкаДокументов.Следующий() Цикл
		
		ВыборкаРемонтов = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока ВыборкаРемонтов.Следующий() Цикл
			
			Если НЕ ЭтоПервый Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ЭтоПервый = Ложь;
			СтрПоиска = Новый Структура("Ссылка,ИД", ВыборкаДокументов.Ссылка, ВыборкаРемонтов.ИД);
			СтрПоискаОбщая = Новый Структура("Ссылка", ВыборкаДокументов.Ссылка);
			
			Шапка = Макет.ПолучитьОбласть("Шапка");
			Шапка.Параметры.Номер = ВыборкаДокументов.Номер;
			Шапка.Параметры.Подразделение = ВыборкаРемонтов.ПодразделениеВладелец;
			Шапка.Параметры.Организация = ВыборкаРемонтов.Организация;
			Шапка.Параметры.ОР = ВыборкаРемонтов.ОР;
			
			ВыборкаДолжности.Сбросить();
			Если ВыборкаДолжности.НайтиСледующий(ВыборкаРемонтов.ОтветственныйЗаПодготовку) Тогда 
				Шапка.Параметры.ОтветственныйЗаПодготовку = Строка(ВыборкаДолжности.Должность) + " " + ВыборкаРемонтов.ОтветственныйЗаПодготовку;
			Иначе
				Шапка.Параметры.ОтветственныйЗаПодготовку = ВыборкаРемонтов.ОтветственныйЗаПодготовку;
			КонецЕсли;
			ВыборкаДолжности.Сбросить();
			Если ВыборкаДолжности.НайтиСледующий(ВыборкаРемонтов.РуководительРабот) Тогда 
				Шапка.Параметры.РуководительРабот = Строка(ВыборкаДолжности.Должность) + " " + ВыборкаРемонтов.РуководительРабот;
			Иначе
				Шапка.Параметры.РуководительРабот = ВыборкаРемонтов.РуководительРабот;
			КонецЕсли;
			
			//
			ВыборкаКонтрагенты.Сбросить();
			ЭтоКонтрагент = Ложь;
			Если ВыборкаКонтрагенты.НайтиСледующий(СтрПоискаОбщая) Тогда 
				ВыборкаР = ВыборкаКонтрагенты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаР.Следующий() Цикл
					Если ВыборкаР.ИД = ВыборкаРемонтов.ИД Тогда 
						Выборка = ВыборкаР.Выбрать();
						Выборка.Следующий();
						ЭтоКонтрагент = ТипЗнч(Выборка.Контрагент) = Тип("СправочникСсылка.Контрагенты");
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			//
			ВыборкаРР.Сбросить();
			Если ВыборкаРР.НайтиСледующий(СтрПоискаОбщая) Тогда 
				МассивТК = Новый Массив();
				ВыборкаР = ВыборкаРР.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаР.Следующий() Цикл
					Если ВыборкаР.ИД = ВыборкаРемонтов.ИД Тогда 
						Выборка = ВыборкаР.Выбрать();
						Пока Выборка.Следующий() Цикл
							Если ТипЗнч(Выборка.РР) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда 
								МассивТК.Добавить(Выборка.РР);
							КонецЕсли;
						КонецЦикла;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Шапка.Параметры.ТК = СтрСоединить(МассивТК, ", ");
			КонецЕсли;
			
			Шапка.Параметры.Мероприятия1 = "";
			//
			ВыборкаМероприятия.Сбросить();
			МассивСтрок2 = Новый Массив();
			Если ВыборкаМероприятия.НайтиСледующий(СтрПоискаОбщая) Тогда 
				МассивСтрок1 = Новый Массив();
				Выборка = ВыборкаМероприятия.Выбрать();
				Пока Выборка.Следующий() Цикл
					Если Выборка.Приоритет = 1 Тогда 
						МассивСтрок1.Добавить(Выборка.Мероприятие);
					Иначе
						МассивСтрок2.Добавить(Выборка.Мероприятие);
					КонецЕсли;
				КонецЦикла;
				Шапка.Параметры.Мероприятия1 = СтрСоединить(МассивСтрок1, "" + Символы.ПС);
			КонецЕсли;
			Шапка.Параметры.ДатаНачала = Формат(ВыборкаРемонтов.ДатаНачала, "ДФ=""ЧЧ 'ч.' мм 'мин.' дд ММММ гггг 'г.'""");
			Шапка.Параметры.ДатаОкончания = Формат(ВыборкаРемонтов.ДатаОкончания, "ДФ=""ЧЧ 'ч.' мм 'мин.' дд ММММ гггг 'г.'""");
			//
			ТабДок.Вывести(Шапка);
			
			СтрокаТЧ1 = Макет.ПолучитьОбласть("СтрокаТЧ1");
			СтрокаТЧ2 = Макет.ПолучитьОбласть("СтрокаТЧ2");
			НомерПП = 1;
			Для Каждого СтрокаМассива Из МассивСтрок2 Цикл
				СтрокаТЧ1.Параметры.НомерПП = НомерПП;
				СтрокаТЧ1.Параметры.Мероприятие = СтрокаМассива;
				ТабДок.Вывести(СтрокаТЧ1);
				НомерПП = НомерПП + 1;
			КонецЦикла;
			
			Шапка2 = Макет.ПолучитьОбласть("Шапка2");
			ТабДок.Вывести(Шапка2);
			ВыборкаИсполнители.Сбросить();
			Если ВыборкаИсполнители.НайтиСледующий(СтрПоискаОбщая) Тогда 
				ВыборкаР = ВыборкаИсполнители.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаР.Следующий() Цикл
					Если ВыборкаР.ИД = ВыборкаРемонтов.ИД Тогда 
						НомерПП = 1;
						Выборка = ВыборкаР.Выбрать();
						Пока Выборка.Следующий() Цикл
							// гкс+ [разработка 2021] Куст 08.07.2021
							Если ЭтоКонтрагент Тогда 
								СтрокаТЧ2.Параметры.НомерПП = НомерПП;
								СтрокаТЧ2.Параметры.Сотрудник = Выборка.гкс_СотрудникКонтрагента;
							Иначе
							// гкс- [разработка 2021] Куст 08.07.2021
								СтрокаТЧ2.Параметры.НомерПП = НомерПП;
								СтрокаТЧ2.Параметры.Сотрудник = Выборка.Сотрудник;
							КонецЕсли;
							ТабДок.Вывести(СтрокаТЧ2);
							НомерПП = НомерПП + 1;
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			Подвал = Макет.ПолучитьОбласть("Подвал");
			ТабДок.Вывести(Подвал);
		КонецЦикла;
	КонецЦикла;
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ТолькоПросмотр = Истина;
	Возврат ТабДок;
	
КонецФункции
// гкс- [Релиз 1] Куст 29.01.2021

// гкс+ [Релиз 1] Куст 10.12.2020
Функция гкс_ПечатьНарядНаРоботыНаВысоте(МассивОбъектов, ПараметрыПечати)
	
	ТабДок = Новый ТабличныйДокумент;
	// гкс+ [разработка 2021] Куст 07.05.2021
	ТабДок.АвтоМасштаб = Истина;
	// гкс- [разработка 2021] Куст 07.05.2021
	ТабДок.ИмяПараметровПечати = "торо_НарядНаВыполнениеРемонтныхРабот";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_гкс_НарядРаботНаВысоте");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Док.Ссылка КАК Ссылка,
	|	Док.Ссылка.Номер КАК Номер,
	|	Док.Ссылка.Дата КАК Дата,
	|	Док.Ссылка.Организация КАК Организация,
	|	Док.Ссылка.Подразделение КАК Подразделение,
	|	Док.Ссылка.Ответственный КАК Ответственный,
	|	Док.ID КАК ID,
	|	Док.ОбъектРемонта КАК ОбъектРемонта,
	|	Док.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	Док.ДатаНачала КАК ДатаНачала,
	|	Док.ДатаОкончания КАК ДатаОкончания,
	|	Док.ОпаснаяРабота КАК ОпаснаяРабота,
	|	Док.МестоПроведенияРабот КАК МестоПроведенияРабот
	|ПОМЕСТИТЬ ВсеДокументы
	|ИЗ
	|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтыОборудования КАК Док
	|ГДЕ
	|	Док.Ссылка В(&Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВсеДокументы.Ссылка КАК Ссылка,
	|	Ответственные.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	МАКСИМУМ(Ответственные.Сотрудник) КАК Сотрудник
	|ПОМЕСТИТЬ ВсеОтветственныеДокументы
	|ИЗ
	|	ВсеДокументы КАК ВсеДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_НарядНаВыполнениеРемонтныхРабот.Ответственные КАК Ответственные
	|		ПО (Ответственные.Ссылка = ВсеДокументы.Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсеДокументы.Ссылка,
	|	Ответственные.ОтветственноеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеОтветственныеДокументы.Ссылка КАК Ссылка,
	|	ВсеОтветственныеДокументы.Сотрудник КАК Допускающий,
	|	NULL КАК РуководительРабот,
	|	NULL КАК ИсполнительРабот
	|ПОМЕСТИТЬ ОтветственныеБезГруппировки
	|ИЗ
	|	ВсеОтветственныеДокументы КАК ВсеОтветственныеДокументы
	|ГДЕ
	|	ВсеОтветственныеДокументы.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.торо_ОтветственныеЛица.Допускающий)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВсеОтветственныеДокументы.Ссылка,
	|	NULL,
	|	ВсеОтветственныеДокументы.Сотрудник,
	|	NULL
	|ИЗ
	|	ВсеОтветственныеДокументы КАК ВсеОтветственныеДокументы
	|ГДЕ
	|	ВсеОтветственныеДокументы.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.торо_ОтветственныеЛица.РуководительРабот)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВсеОтветственныеДокументы.Ссылка,
	|	NULL,
	|	NULL,
	|	ВсеОтветственныеДокументы.Сотрудник
	|ИЗ
	|	ВсеОтветственныеДокументы КАК ВсеОтветственныеДокументы
	|ГДЕ
	|	ВсеОтветственныеДокументы.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.торо_ОтветственныеЛица.ИсполнительРабот)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтветственныеБезГруппировки.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ОтветственныеБезГруппировки.Допускающий) КАК Допускающий,
	|	МАКСИМУМ(ОтветственныеБезГруппировки.РуководительРабот) КАК РуководительРабот,
	|	МАКСИМУМ(ОтветственныеБезГруппировки.ИсполнительРабот) КАК ИсполнительРабот
	|ПОМЕСТИТЬ ОтвДокументов
	|ИЗ
	|	ОтветственныеБезГруппировки КАК ОтветственныеБезГруппировки
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтветственныеБезГруппировки.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеДокументы.Ссылка КАК Ссылка,
	|	ЕстьNull(ННД.НомерТекст, ВсеДокументы.Номер) КАК Номер,
	|	ВсеДокументы.Ссылка.гкс_РежимРаботы КАК РежимРаботы,
	|	ВсеДокументы.Ссылка.гкс_ОсобыеУсловия КАК ОсобыеУсловия,
	|	ВсеДокументы.Дата КАК Дата,
	|	ВсеДокументы.Организация КАК Организация,
	|	ВсеДокументы.Подразделение КАК Подразделение,
	|	ВсеДокументы.Ответственный КАК Ответственный,
	|	ВсеДокументы.ID КАК ИД,
	|	ВсеДокументы.ОбъектРемонта КАК ОР,
	|	ВсеДокументы.ВидРемонтныхРабот КАК ВР,
	|	ВсеДокументы.ДатаНачала КАК ДатаНачала,
	|	ВсеДокументы.ДатаОкончания КАК ДатаОкончания,
	|	ВсеДокументы.ОпаснаяРабота КАК ОпаснаяРабота,
	|	ВсеДокументы.МестоПроведенияРабот КАК МестоПроведенияРабот,
	|	ОтвДокументов.Допускающий КАК Допускающий,
	|	ОтвДокументов.РуководительРабот КАК РуководительРабот,
	|	ОтвДокументов.ИсполнительРабот КАК ИсполнительРабот
	
	|ИЗ
	|	ВсеДокументы КАК ВсеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтвДокументов КАК ОтвДокументов
	|		ПО ВсеДокументы.Ссылка = ОтвДокументов.Ссылка
	|		левое соединение РегистрСведений.гкс_НомераНарядДопусков КАК ННД
	|		ПО ННД.Документ = ВсеДокументы.Ссылка
	|ИТОГИ
	|	МАКСИМУМ(Номер),
	|	МАКСИМУМ(Дата),
	|	МАКСИМУМ(Организация),
	|	МАКСИМУМ(Подразделение),
	|	МАКСИМУМ(Ответственный)
	|ПО
	|	Ссылка
	|;
	|Выбрать Различные
	|ТЧ.Сотрудник КАК Сотрудник, ТЧ.Ссылка КАК Ссылка, ТЧ.РемонтыОборудования_ID КАК ИД, ТЧ.Квалификация КАК Квалификация
	// гкс+ [разработка 2021] Куст 08.07.2021
	|	, ТЧ.гкс_СотрудникКонтрагента КАК гкс_СотрудникКонтрагента
	// гкс- [разработка 2021] Куст 08.07.2021
	|ИЗ
	|	ВсеДокументы КАК ВсеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_НарядНаВыполнениеРемонтныхРабот.Исполнители КАК ТЧ
	|		ПО ВсеДокументы.Ссылка = ТЧ.Ссылка
	|Итоги ПО Ссылка, ИД
	|;
	|Выбрать Различные
	|ТЧ.Ссылка КАК Ссылка, ТЧ.НомерСтроки КАК НомерСтроки,
	|	ТЧ.Исполнитель КАК Контрагент, ТЧ.РемонтыОборудования_ID КАК ИД
	|
	|	ИЗ	
	|	ВсеДокументы КАК ВсеДокументы
	|	Внутреннее соединение Документ.торо_НарядНаВыполнениеРемонтныхРабот.ИсполнителиПоРемонтам КАК ТЧ
	|	ПО ТЧ.Ссылка = ВсеДокументы.Ссылка
	|Упорядочить по ТЧ.НомерСтроки	
	|Итоги ПО Ссылка, ИД
	|;
	| Выбрать Различные 
	|ТЧ.Ссылка КАК Ссылка, ТЧ.РемонтыОборудования_ID КАК ИД, ТЧ.РемонтнаяРабота КАК РР, ТЧ.НомерСтроки КАК НомерСтроки
	|
	|	ИЗ	
	|	ВсеДокументы КАК ВсеДокументы
	|	Внутреннее соединение Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтныеРаботы КАК ТЧ
	|	ПО ТЧ.Ссылка = ВсеДокументы.Ссылка
	|Упорядочить По ТЧ.НомерСтроки
	|Итоги ПО Ссылка, ИД
	|;
	|Выбрать Различные
	|ВсеДокументы.Ссылка КАК Ссылка, ТЧ.РемонтыОборудования_ID КАК ИД, ТЧ.Номенклатура КАК Номенклатура
	|ИЗ
	|	ВсеДокументы КАК ВсеДокументы
	|	Внутреннее соединение  Документ.торо_ЗаявкаНаРемонт.МатериальныеЗатраты КАК ТЧ
	|	ПО ТЧ.РемонтыОборудования_ID = ВсеДокументы.ID И ТЧ.Ссылка.Проведен
	|Итоги ПО Ссылка, ИД
	|;
	|Выбрать Различные
	|ВсеДокументы.Ссылка КАК Ссылка, ТЧ.РемонтыОборудования_ID КАК ИД, ТЧ.Инструмент КАК Инструмент
	|ИЗ
	|	ВсеДокументы КАК ВсеДокументы
	|	Внутреннее соединение  Документ.торо_ЗаявкаНаРемонт.Инструменты КАК ТЧ
	|	ПО ТЧ.РемонтыОборудования_ID = ВсеДокументы.ID И ТЧ.Ссылка.Проведен
	|Итоги ПО Ссылка, ИД
	|;
	|Выбрать Различные
	|ВсеДокументы.Ссылка КАК Ссылка, ТЧ.РемонтыОборудования_ID КАК ИД, ТЧ.Номенклатура КАК Номенклатура
	|ИЗ
	|	ВсеДокументы КАК ВсеДокументы
	|	Внутреннее соединение  Документ.торо_ЗаявкаНаРемонт.гкс_СИЗ КАК ТЧ
	|	ПО ТЧ.РемонтыОборудования_ID = ВсеДокументы.ID И ТЧ.Ссылка.Проведен
	|Итоги ПО Ссылка, ИД
	|;
	|Выбрать Различные
	|ВсеДокументы.Ссылка КАК Ссылка, ТЧ.РемонтыОборудования_ID КАК ИД, ТЧ.МераБезопасности КАК МераБезопасности
	|ИЗ
	|	ВсеДокументы КАК ВсеДокументы
	|	Внутреннее соединение  Документ.торо_ЗаявкаНаРемонт.МерыБезопасности КАК ТЧ
	|	ПО ТЧ.РемонтыОборудования_ID = ВсеДокументы.ID И ТЧ.Ссылка.Проведен
	|Итоги ПО Ссылка, ИД
	|;
	|Выбрать 
	|ТЧ.Ссылка КАК Ссылка, ТЧ.НомерСтроки КАК НомерСтроки, 1 КАК Приоритет,
	|	ТЧ.Мероприятие КАК Мероприятие
	|
	|	ИЗ	
	|	ВсеДокументы КАК ВсеДокументы
	|	Внутреннее соединение Документ.торо_НарядНаВыполнениеРемонтныхРабот.гкс_МПОБДо КАК ТЧ
	|	ПО ТЧ.Ссылка = ВсеДокументы.Ссылка
	|
	|Объединить все
	|
	|Выбрать 
	|ТЧ.Ссылка, ТЧ.НомерСтроки, 2 ,
	|	ТЧ.Мероприятие
	|
	|	ИЗ	
	|	ВсеДокументы КАК ВсеДокументы
	|	Внутреннее соединение Документ.торо_НарядНаВыполнениеРемонтныхРабот.гкс_МПОБВоВремя КАК ТЧ
	|	ПО ТЧ.Ссылка = ВсеДокументы.Ссылка
	|
	|Упорядочить по Приоритет, ТЧ.НомерСтроки	
	|Итоги ПО Ссылка
	|;
	|Выбрать Различные ТЧ.Сотрудник
	|Поместить РазличныеСотрудники
	|ИЗ ВсеОтветственныеДокументы КАК ТЧ
	|;
	|Выбрать
	|ТЧ.Сотрудник, Максимум(Рег.ТекущаяДолжность) КАК Должность
	|
	|ИЗ РазличныеСотрудники КАК ТЧ
	|	Внутреннее соединение РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК Рег
	|	По Рег.Сотрудник = ТЧ.Сотрудник
	|Сгруппировать по ТЧ.Сотрудник
	|
	|
	|
	|";
	
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов); 
	Если ПараметрыПечати.Свойство("МассивID") Тогда
		Запрос.УстановитьПараметр("ID", ПараметрыПечати.МассивID);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТЧ.ID В(&ID)", "");
	КонецЕсли;
	
	ПервыйПакет = 4;
	ВторойПакет = ПервыйПакет + 1;
	ТретийПакет = ВторойПакет + 1;
	РемРаботыПакет = ТретийПакет + 1;
	МатЗатПакет = РемРаботыПакет + 1;
	ИнструментыПакет = МатЗатПакет + 1;
	СИЗПакет = ИнструментыПакет + 1;
	МБПакет = СИЗПакет + 1;
	МероприятияПакет = МБПакет + 1;
	ДолжностиПакет = МероприятияПакет + 2;
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаДокументов = РезультатЗапроса[ПервыйПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
	ВыборкаИсполнители = РезультатЗапроса[ВторойПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаКонтрагенты = РезультатЗапроса[ТретийПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаРР = РезультатЗапроса[РемРаботыПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаМатЗат = РезультатЗапроса[МатЗатПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаИнструменты = РезультатЗапроса[ИнструментыПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаСИЗ = РезультатЗапроса[СИЗПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаМБ = РезультатЗапроса[МБПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаМероприятия = РезультатЗапроса[МероприятияПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаДолжности = РезультатЗапроса[ДолжностиПакет].Выбрать();
	
	ЭтоПервый = Истина;
	Попытка
	    // Подключаем внешнюю компоненту
	    ПодключитьВнешнююКомпоненту("ОбщийМакет.КомпонентаСклоненияФИО", "NameDecl",ТипВнешнейКомпоненты.Native ) ;
	    Объект = Новый("AddIn.NameDecl.CNameDecl");
	Исключение
	    // Не удалось выполнить операции с внешней компонентой
	    Сообщить("Не удалось подключить внешнюю компоненту по причине: " + ОписаниеОшибки()); 
	КонецПопытки;
	Пока ВыборкаДокументов.Следующий() Цикл
		
		ВыборкаРемонтов = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока ВыборкаРемонтов.Следующий() Цикл
			
			Если НЕ ЭтоПервый Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ЭтоПервый = Ложь;
			СтрПоиска = Новый Структура("Ссылка,ИД", ВыборкаДокументов.Ссылка, ВыборкаРемонтов.ИД);
			СтрПоискаОбщая = Новый Структура("Ссылка", ВыборкаДокументов.Ссылка);
			
			СтрокаТЧ1 = Макет.ПолучитьОбласть("СтрокаТЧ1");
			СтрокаТЧ2 = Макет.ПолучитьОбласть("СтрокаТЧ2");
			СтрокаТЧ3 = Макет.ПолучитьОбласть("СтрокаТЧ3");
			Часть0 = Макет.ПолучитьОбласть("Часть0");
			Часть1 = Макет.ПолучитьОбласть("Часть1");
			Часть2 = Макет.ПолучитьОбласть("Часть2");
			Часть3 = Макет.ПолучитьОбласть("Часть3");
			Часть4 = Макет.ПолучитьОбласть("Часть4");
			Часть5 = Макет.ПолучитьОбласть("Часть5");
			Часть6 = Макет.ПолучитьОбласть("Часть6");
			Часть7 = Макет.ПолучитьОбласть("Часть7");
			Часть8 = Макет.ПолучитьОбласть("Часть8");
			Часть9 = Макет.ПолучитьОбласть("Часть9");
			Часть10 = Макет.ПолучитьОбласть("Часть10");
			Часть11 = Макет.ПолучитьОбласть("Часть11");
			Шапка = Макет.ПолучитьОбласть("Шапка");
			Шапка.Параметры.Номер = ВыборкаДокументов.Номер;
			Шапка.Параметры.День = День(ВыборкаДокументов.Дата);
			Шапка.Параметры.Месяц = МесяцРодПадеж(ВыборкаДокументов.Дата);
			Шапка.Параметры.Год = Формат(ВыборкаДокументов.Дата, "ДФ=гггг");
			//Шапка.Параметры.Ответственный = ВыборкаРемонтов.Ответственный;
			Шапка.Параметры.Организация = ВыборкаРемонтов.Организация;
			Шапка.Параметры.Подразделение = ВыборкаРемонтов.Подразделение;
			Часть0.Параметры.ДатаНачала = Формат(ВыборкаРемонтов.ДатаНачала, "ДФ=""ЧЧ 'ч.' мм 'мин.' дд ММММ гггг 'г.'""");
			Часть0.Параметры.ДатаОкончания = Формат(ВыборкаРемонтов.ДатаОкончания, "ДФ=""ЧЧ 'ч.' мм 'мин.' дд ММММ гггг 'г.'""");
			//
			Если ЗначениеЗаполнено(ВыборкаРемонтов.ИсполнительРабот) Тогда 
				// Получаем результат склонения
				РезультатСклонения = Объект.Просклонять(Строка(ВыборкаРемонтов.ИсполнительРабот), 3);
			Иначе
				РезультатСклонения = "";
			КонецЕсли;
			Шапка.Параметры.ИсполнительРабот = РезультатСклонения;
			Если ЗначениеЗаполнено(ВыборкаРемонтов.РуководительРабот) Тогда 
				// Получаем результат склонения
				Попытка
					РезультатСклонения = Объект.Просклонять(Строка(ВыборкаРемонтов.РуководительРабот), 3);
				Исключение
					РезультатСклонения = Строка(ВыборкаРемонтов.РуководительРабот);
				КонецПопытки;
			Иначе
				РезультатСклонения = "";
			КонецЕсли;
			Шапка.Параметры.РуководительРабот = РезультатСклонения;
			//
			Часть8.Параметры.Ответственный = ВыборкаРемонтов.Ответственный;
			Часть8.Параметры.ИсполнительРабот = ВыборкаРемонтов.ИсполнительРабот;
			Часть8.Параметры.РуководительРабот = ВыборкаРемонтов.РуководительРабот;
			//
			ВыборкаРР.Сбросить();
			Если ВыборкаРР.НайтиСледующий(СтрПоискаОбщая) Тогда 
				МассивТК = Новый Массив();
				ВыборкаР = ВыборкаРР.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаР.Следующий() Цикл
					Если ВыборкаР.ИД = ВыборкаРемонтов.ИД Тогда 
						Выборка = ВыборкаР.Выбрать();
						Пока Выборка.Следующий() Цикл
							Если ТипЗнч(Выборка.РР) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда 
								МассивТК.Добавить(Выборка.РР);
							КонецЕсли;
						КонецЦикла;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Шапка.Параметры.ТехОперации = СтрСоединить(МассивТК,", ");
			КонецЕсли;
			ТабДок.Вывести(Шапка);
			//
			ВыборкаКонтрагенты.Сбросить();
			ЭтоКонтрагент = Ложь;
			Если ВыборкаКонтрагенты.НайтиСледующий(СтрПоискаОбщая) Тогда 
				ВыборкаР = ВыборкаКонтрагенты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаР.Следующий() Цикл
					Если ВыборкаР.ИД = ВыборкаРемонтов.ИД Тогда 
						Выборка = ВыборкаР.Выбрать();
						Выборка.Следующий();
						ЭтоКонтрагент = ТипЗнч(Выборка.Контрагент) = Тип("СправочникСсылка.Контрагенты");
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			//
			// гкс+ [разработка 2021] Куст 08.07.2021
			Если ЭтоКонтрагент Тогда 
				ВыборкаИсполнители.Сбросить();
				Если ВыборкаИсполнители.НайтиСледующий(СтрПоискаОбщая) Тогда 
					ВыборкаР = ВыборкаИсполнители.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаР.Следующий() Цикл
						Если ВыборкаР.ИД = ВыборкаРемонтов.ИД Тогда 
							НомерПП = 1;
							Выборка = ВыборкаР.Выбрать();
							Пока Выборка.Следующий() Цикл
								СтрокаТЧ1.Параметры.Сотрудник = Выборка.гкс_СотрудникКонтрагента;
								ТабДок.Вывести(СтрокаТЧ1);
								НомерПП = НомерПП + 1;
							КонецЦикла;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			Иначе
			// гкс- [разработка 2021] Куст 08.07.2021
				ВыборкаИсполнители.Сбросить();
				Если ВыборкаИсполнители.НайтиСледующий(СтрПоискаОбщая) Тогда 
					ВыборкаР = ВыборкаИсполнители.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаР.Следующий() Цикл
						Если ВыборкаР.ИД = ВыборкаРемонтов.ИД Тогда 
							НомерПП = 1;
							Выборка = ВыборкаР.Выбрать();
							Пока Выборка.Следующий() Цикл
								СтрокаТЧ1.Параметры.Сотрудник = Выборка.Сотрудник;
								ТабДок.Вывести(СтрокаТЧ1);
								НомерПП = НомерПП + 1;
							КонецЦикла;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
			//
			Если Не ЭтоКонтрагент Тогда 
				ВыборкаИсполнители.Сбросить();
				Если ВыборкаИсполнители.НайтиСледующий(СтрПоискаОбщая) Тогда 
					ВыборкаР = ВыборкаИсполнители.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаР.Следующий() Цикл
						Если ВыборкаР.ИД = ВыборкаРемонтов.ИД Тогда 
							Колво = 0;
							Выборка = ВыборкаР.Выбрать();
							Пока Выборка.Следующий() Цикл
								Колво = Колво + 1;
							КонецЦикла;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
			Часть0.Параметры.ОР = ВыборкаРемонтов.ОР;
			ТабДок.Вывести(Часть0);
			//
			ВыборкаМатЗат.Сбросить();
			Часть1.Параметры.Материалы = "";
			Если ВыборкаМатЗат.НайтиСледующий(СтрПоискаОбщая) Тогда 
				ВыборкаР = ВыборкаМатЗат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаР.Следующий() Цикл
					Если ВыборкаР.ИД = ВыборкаРемонтов.ИД Тогда 
						МассивСтрок = Новый Массив();
						Выборка = ВыборкаР.Выбрать();
						Пока Выборка.Следующий() Цикл
							МассивСтрок.Добавить(Выборка.Номенклатура);
						КонецЦикла;
						Часть1.Параметры.Материалы = СтрСоединить(МассивСтрок, ", ");
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			Часть1.Параметры.Инструменты = "";
			//
			ВыборкаИнструменты.Сбросить();
			Если ВыборкаИнструменты.НайтиСледующий(СтрПоискаОбщая) Тогда 
				ВыборкаР = ВыборкаИнструменты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаР.Следующий() Цикл
					Если ВыборкаР.ИД = ВыборкаРемонтов.ИД Тогда 
						МассивСтрок = Новый Массив();
						Выборка = ВыборкаР.Выбрать();
						Пока Выборка.Следующий() Цикл
							МассивСтрок.Добавить(Выборка.Инструмент);
						КонецЦикла;
						Часть1.Параметры.Инструменты = СтрСоединить(МассивСтрок, ", ");
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			ТабДок.Вывести(Часть1);
			ТабДок.Вывести(Часть2);
			//
			ВыборкаМероприятия.Сбросить();
			Если ВыборкаМероприятия.НайтиСледующий(СтрПоискаОбщая) Тогда 
				Выборка = ВыборкаМероприятия.Выбрать();
				Пока Выборка.Следующий() Цикл
					Если Выборка.Приоритет = 1 Тогда 
						СтрокаТЧ2.Параметры.Мероприятие = Выборка.Мероприятие;
						ТабДок.Вывести(СтрокаТЧ2);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			ТабДок.Вывести(Часть3);
			//
			ВыборкаМероприятия.Сбросить();
			Если ВыборкаМероприятия.НайтиСледующий(СтрПоискаОбщая) Тогда 
				Выборка = ВыборкаМероприятия.Выбрать();
				Пока Выборка.Следующий() Цикл
					Если Выборка.Приоритет = 2 Тогда 
						СтрокаТЧ3.Параметры.Мероприятие = Выборка.Мероприятие;
						ТабДок.Вывести(СтрокаТЧ3);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			//
			ТабДок.Вывести(Часть4);
			ТабДок.Вывести(Часть5);
			ТабДок.Вывести(Часть6);
			ТабДок.Вывести(Часть7);
			ТабДок.Вывести(Часть8);
			ТабДок.Вывести(Часть9);
			ТабДок.Вывести(Часть10);
			ТабДок.Вывести(Часть11);
		КонецЦикла;
	КонецЦикла;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ТолькоПросмотр = Истина;
	Возврат ТабДок;
	
КонецФункции
// гкс- [Релиз 1] Куст 10.12.2020

// гкс+ [Релиз 1] Куст 01.02.2021
Функция МесяцРодПадеж(Дата)
	Номер = Месяц(Дата);
	Если Номер = 1 Тогда 
		Возврат "Января";
	ИначеЕсли Номер = 2 Тогда 
		Возврат "Февраля";
	ИначеЕсли Номер = 3 Тогда 
		Возврат "Марта";
	ИначеЕсли Номер = 4 Тогда 
		Возврат "Апреля";
	ИначеЕсли Номер = 5 Тогда 
		Возврат "Мая";
	ИначеЕсли Номер = 6 Тогда 
		Возврат "Июля";
	ИначеЕсли Номер = 7 Тогда 
		Возврат "Июня";
	ИначеЕсли Номер = 8 Тогда 
		Возврат "Августа";
	ИначеЕсли Номер = 9 Тогда 
		Возврат "Сентября";
	ИначеЕсли Номер = 10 Тогда 
		Возврат "Октября";
	ИначеЕсли Номер = 11 Тогда 
		Возврат "Ноября";
	ИначеЕсли Номер = 12 Тогда 
		Возврат "Декабря";
	КонецЕсли;
КонецФункции

&ИзменениеИКонтроль("НарядНаРаботы_НеОпасные")
Функция Расш_гкс_НарядНаРаботы_НеОпасные(МассивОбъектов, ПараметрыПечати, ИмяПФ)

	ТабДок = Новый ТабличныйДокумент;
	#Вставка
	// гкс+ [разработка 2021] Куст 07.05.2021
	ТабДок.АвтоМасштаб = Истина;
	// гкс- [разработка 2021] Куст 07.05.2021
	#КонецВставки
	ТабДок.ИмяПараметровПечати = "торо_НарядНаВыполнениеРемонтныхРабот";
	ТабДок.ТолькоПросмотр = Истина;

	#Удаление
	Если ИмяПФ = "НарядНаРаботы_сПоказателями" Тогда 
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_НарядНаРаботы_сПоказателями");
	Иначе 
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_НарядНаРаботы_НеОпасные");
	КонецЕсли;
	#КонецУдаления
	#Вставка
	// гкс+ [10.22] Деснол 11.10.2022
	Если ИмяПФ = "НарядНаРаботы_сПоказателями" Тогда 
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_гкс_НарядНаРаботы_сПоказателями");
	Иначе 
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_гкс_НарядНаРаботы_НеОпасные");
	КонецЕсли;
	// гкс- [10.22] Деснол 11.10.2022
	#КонецВставки

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка КАК Ссылка,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Номер КАК Номер,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Дата КАК Дата,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Организация КАК Организация,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Подразделение КАК Подразделение,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Ответственный КАК Ответственный,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID КАК ID,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОбъектРемонта.Наименование КАК Наименование,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОбъектРемонта.АдресМестонахождения КАК АдресМестонахождения,
	#Вставка
	// гкс+ [10.22] Деснол 11.10.2022
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОбъектРемонта.ТехНомер КАК ТехНомер,
	// гкс- [10.22] Деснол 11.10.2022
	#КонецВставки
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ДатаНачала КАК ДатаНачала,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ДатаОкончания КАК ДатаОкончания,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОпаснаяРабота КАК ОпаснаяРабота,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.МестоПроведенияРабот КАК МестоПроведенияРабот,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ДокументИсточник КАК ДокументИсточник
	|ИЗ
	|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтыОборудования КАК торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования
	|ГДЕ
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка В(&Ссылка)
	|	И торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID В(&ID)
	|ИТОГИ
	|	МАКСИМУМ(Номер),
	|	МАКСИМУМ(Дата),
	|	МАКСИМУМ(Организация),
	|	МАКСИМУМ(Подразделение),
	|	МАКСИМУМ(Ответственный)
	|ПО
	|	Ссылка";

	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	Если ПараметрыПечати.Свойство("МассивID") Тогда
		Запрос.УстановитьПараметр("ID", ПараметрыПечати.МассивID);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID В(&ID)", "");
	КонецЕсли;

	ВыборкаДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
	ЭтоПервый = Истина;

	Пока ВыборкаДокументов.Следующий() Цикл

		ВыборкаРемонтов = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока ВыборкаРемонтов.Следующий() Цикл

			Если НЕ ЭтоПервый Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ЭтоПервый = Ложь;

			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВЫБОР
			|		КОГДА тчРемонтныеРаботы.РемонтнаяРабота ССЫЛКА Справочник.торо_ТехнологическиеОперации
			|			ТОГДА ВЫБОР
			|					КОГДА тчРемонтныеРаботы.РемонтнаяРабота.НаименованиеДляПечати = """"
			|						ТОГДА тчРемонтныеРаботы.РемонтнаяРабота.Наименование
			|					ИНАЧЕ тчРемонтныеРаботы.РемонтнаяРабота.НаименованиеДляПечати
			|				  КОНЕЦ
			|		ИНАЧЕ тчРемонтныеРаботы.РемонтнаяРабота.Наименование
			|	КОНЕЦ КАК РемонтнаяРаботаДляПечати,
			|	тчРемонтныеРаботы.РемонтнаяРабота КАК РемонтнаяРабота,
			|	ЕСТЬNULL(тчРемонтныеРаботы.РемонтнаяРабота.СодержаниеРабот, """") КАК СодержаниеРабот,
			|	тчРемонтныеРаботы.Родитель_ID КАК Родитель_ID,
			|	тчРемонтныеРаботы.ID КАК ID,
			|	торо_ТехнологическиеОперации.БазоваяЕдиницаИзмерения КАК ЕдИзм,
			#Вставка
			|	тчРемонтныеРаботы.гкс_Примечание КАК гкс_Примечание,
			// гкс+ [разработка 2021] Куст 05.05.2021
			|	Выразить("""" КАК Строка(500)) КАК Исполнитель,
			// гкс- [разработка 2021] Куст 05.05.2021
			#КонецВставки
			|	тчРемонтныеРаботы.Количество КАК Количество
			|ИЗ
			|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтныеРаботы КАК тчРемонтныеРаботы
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ТехнологическиеОперации КАК торо_ТехнологическиеОперации
			|		ПО тчРемонтныеРаботы.РемонтнаяРабота = торо_ТехнологическиеОперации.Ссылка
			|ГДЕ
			|	тчРемонтныеРаботы.Ссылка = &Ссылка
			|	И тчРемонтныеРаботы.РемонтыОборудования_ID = &ID
			|
			|УПОРЯДОЧИТЬ ПО
			|	Родитель_ID
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Исполнители.Сотрудник КАК Сотрудник,
			|	Исполнители.Квалификация КАК Квалификация
			|ИЗ
			|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.Исполнители КАК Исполнители
			|ГДЕ
			|	Исполнители.Ссылка = &Ссылка
			|	И Исполнители.РемонтыОборудования_ID = &ID
			|
			|СГРУППИРОВАТЬ ПО
			|	Исполнители.Сотрудник,
			|	Исполнители.Квалификация";				   
			#Вставка
			Запрос.Текст = Запрос.Текст + " ; "
			+ "Выбрать Различные
			|ДокТЧ.Сотрудник КАК Сотрудник,
			|ДокТЧ.ID КАК ID
			|ИЗ
			|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.Исполнители КАК ДокТЧ
			|ГДЕ
			|	ДокТЧ.Ссылка = &Ссылка
			|	И ДокТЧ.РемонтыОборудования_ID = &ID
			|Итоги по ID";
			#КонецВставки

			Запрос.УстановитьПараметр("Ссылка", ВыборкаДокументов.Ссылка);
			Запрос.УстановитьПараметр("Дата", ВыборкаДокументов.Дата);
			Запрос.УстановитьПараметр("ID", ВыборкаРемонтов.ID);
			РезЗапроса = Запрос.ВыполнитьПакет();

			тчРемРаботы = РезЗапроса[0].выгрузить();
			тчСотрудникиИКвалификация = РезЗапроса[1].выбрать();
			#Вставка
			ПакетИсп = 2;
			ВыборкаИдИсп = РезЗапроса[ПакетИсп].выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Для Каждого СтрокаТаблицы Из тчРемРаботы Цикл
				ВыборкаИдИсп.Сбросить();
				Если ВыборкаИдИсп.НайтиСледующий(Новый Структура("ID", СтрокаТаблицы.ID)) Тогда 
					ВыборкаИсп = ВыборкаИдИсп.Выбрать();
					СтрокаИсполнителей = "";
					Пока ВыборкаИсп.Следующий() Цикл
							СтрокаИсполнителей = ?(ЗначениеЗаполнено(СтрокаИсполнителей), СтрокаИсполнителей + ",
							|", "") + ПреобразоватьФИО(ВыборкаИсп.Сотрудник);
					КонецЦикла;
					СтрокаТаблицы.Исполнитель = СтрокаИсполнителей;
				КонецЕсли;
			КонецЦикла;
			#КонецВставки

			обШапка = Макет.ПолучитьОбласть("Шапка");

			обШапка.Параметры.Организация = ВыборкаДокументов.Организация;
			обШапка.Параметры.Подразделение = ВыборкаДокументов.Подразделение;

			обШапка.Параметры.ДатаОткрытия = Формат(ВыборкаДокументов.Дата,"ДФ=dd.MM.yyyy");
			обШапка.Параметры.Номер = ВыборкаДокументов.Номер;

			обШапка.Параметры.ДатаНачала = Формат(ВыборкаРемонтов.ДатаНачала,"ДФ=dd.MM.yyyy");
			обШапка.Параметры.ДатаОкончания = Формат(ВыборкаРемонтов.ДатаОкончания,"ДФ=dd.MM.yyyy");

			ПерваяСтрока = Истина;
			массивПроверки = Новый Массив;
			Пока тчСотрудникиИКвалификация.Следующий() Цикл
				Если перваяСтрока Тогда
					ПерваяСтрока = Ложь;
					обШапка.Параметры.СотрудникИКвалификация = Строка(тчСотрудникиИКвалификация.Сотрудник) + " (" + тчСотрудникиИКвалификация.Квалификация + ")";
					обШапка.Параметры.Сотрудник = тчСотрудникиИКвалификация.Сотрудник;
					ТабДок.Вывести(обШапка);
					Продолжить;
				КонецЕсли;

				обСотрудник = Макет.ПолучитьОбласть("Сотрудник");
				обСотрудник.Параметры.СотрудникИКвалификация = Строка(тчСотрудникиИКвалификация.Сотрудник) + " (" + тчСотрудникиИКвалификация.Квалификация + ")";
				обСотрудник.Параметры.Сотрудник = тчСотрудникиИКвалификация.Сотрудник;

				ПроверитьИВывести(ТабДок, обСотрудник);

			КонецЦикла;

			Если ПерваяСтрока Тогда
				ТабДок.Вывести(обШапка);
			КонецЕсли;

			ВывестиРемонты(Макет, ТабДок, тчРемРаботы, ВыборкаРемонтов, ИмяПФ);

			#Вставка
			// гкс+ [10.22] Деснол 11.10.2022
			гкс_Подвал = Макет.ПолучитьОбласть("гкс_Подвал");
			ТабДок.Вывести(гкс_Подвал);
			// гкс- [10.22] Деснол 11.10.2022
			#КонецВставки
			обОтветственный = Макет.ПолучитьОбласть("Ответственный");
			обОтветственный.Параметры.Сотрудник = ВыборкаДокументов.Ответственный;
			обОтветственный.Параметры.Дата = Формат(ТекущаяДата(),"ДФ='''""''dd''""'' MMMM yyyy ""г.""'");
			ПроверитьИВывести(ТабДок, обОтветственный);
			
			ПерваяСтрока = Истина;
			обИсполнительСЗаголовоком = Макет.ПолучитьОбласть("ИсполнительСЗаголовоком");

			тчСотрудникиИКвалификация.Сбросить();
			Пока тчСотрудникиИКвалификация.Следующий() Цикл
				Если ПерваяСтрока Тогда
					ПерваяСтрока = Ложь;
					обИсполнительСЗаголовоком.Параметры.Сотрудник = тчСотрудникиИКвалификация.Сотрудник;
					обИсполнительСЗаголовоком.Параметры.Дата = Формат(ТекущаяДата(),"ДФ='''""''dd''""'' MMMM yyyy ""г.""'");
					ПроверитьИВывести(ТабДок, обИсполнительСЗаголовоком);
					Продолжить;
				КонецЕсли;

				обИсполнитель = Макет.ПолучитьОбласть("Исполнитель");
				обИсполнитель.Параметры.Сотрудник = тчСотрудникиИКвалификация.Сотрудник;
				обИсполнитель.Параметры.дата = Формат(ТекущаяДата(),"ДФ='''""''dd''""'' MMMM yyyy ""г.""'");
				ПроверитьИВывести(ТабДок, обИсполнитель);
			КонецЦикла;

			Если ПерваяСтрока Тогда
				ПроверитьИВывести(ТабДок, обИсполнительСЗаголовоком);
			КонецЕсли;

		КонецЦикла;
	КонецЦикла;

	Возврат ТабДок;

КонецФункции

&ИзменениеИКонтроль("ВывестиРекурсивно")
Процедура Расш_гкс_ВывестиРекурсивно(Макет, ТЧ, Мас, ТабДок, ИмяОбластиВМакете, НомерРодителя)

	НомерСтроки = 1;
	Для каждого текСтрока из Мас Цикл
		НомерСтрокой = НомерРодителя + Строка(НомерСтроки);

		обСтрокаТЧСостав = Макет.ПолучитьОбласть(ИмяОбластиВМакете);
		обСтрокаТЧСостав.Параметры.Ном = НомерСтрокой;
		#Удаление
		обСтрокаТЧСостав.Параметры.Наименование = текСтрока.РемонтнаяРаботаДляПечати;
		#КонецУдаления
		#Вставка
		обСтрокаТЧСостав.Параметры.Наименование = текСтрока.РемонтнаяРаботаДляПечати + " " 
			+ текСтрока.гкс_Примечание;
		// гкс+ [разработка 2021] Куст 05.05.2021
		обСтрокаТЧСостав.Параметры.Исполнитель = текСтрока.Исполнитель;
		// гкс- [разработка 2021] Куст 05.05.2021
		#КонецВставки
		обСтрокаТЧСостав.Параметры.СодержаниеРабот = текСтрока.СодержаниеРабот;
		обСтрокаТЧСостав.Параметры.Количество = текСтрока.Количество;
		#Удаление
		обСтрокаТЧСостав.Параметры.ЕдИзм = текСтрока.ЕдИзм;
		#КонецУдаления
		ПроверитьИВывести(ТабДок, обСтрокаТЧСостав);

		подСтроки = тч.НайтиСтроки(Новый структура("Родитель_ID", текСтрока.ID));
		ВывестиРекурсивно(Макет, тч, подСтроки, ТабДок, ИмяОбластиВМакете, НомерСтрокой + ".");
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;

КонецПроцедуры

&ИзменениеИКонтроль("НарядНаРаботы_ОднимДокументом")
Функция Расш_гкс_НарядНаРаботы_ОднимДокументом(МассивОбъектов, ПараметрыПечати)

	ТабДок = Новый ТабличныйДокумент;
	#Вставка
	// гкс+ [разработка 2021] Куст 07.05.2021
	ТабДок.АвтоМасштаб = Истина;
	// гкс- [разработка 2021] Куст 07.05.2021
	#КонецВставки
	ТабДок.ИмяПараметровПечати = "торо_НарядНаВыполнениеРемонтныхРабот";
	ТабДок.ТолькоПросмотр = Истина;

	#Удаление
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_НарядНаРаботы_ОднимДокументом");
	#КонецУдаления
	#Вставка
	// гкс+ [10.22] Деснол 11.10.2022
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_гкс_НарядНаРаботы_ОднимДокументом");
	// гкс- [10.22] Деснол 11.10.2022
	#КонецВставки

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка КАК Ссылка,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Номер КАК Номер,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Дата КАК Дата,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Организация КАК Организация,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Подразделение КАК Подразделение,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Ответственный КАК Ответственный,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID КАК ID,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОбъектРемонта.Наименование КАК Наименование,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОбъектРемонта.АдресМестонахождения КАК АдресМестонахождения,
	#Вставка
	// гкс+ [10.22] Деснол 11.10.2022
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОбъектРемонта.ТехНомер КАК ТехНомер,
	// гкс- [10.22] Деснол 11.10.2022
	#КонецВставки
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ДатаНачала КАК ДатаНачала,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ДатаОкончания КАК ДатаОкончания,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОпаснаяРабота КАК ОпаснаяРабота,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.МестоПроведенияРабот КАК МестоПроведенияРабот,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ДокументИсточник КАК ДокументИсточник
	|ИЗ
	|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтыОборудования КАК торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования
	|ГДЕ
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка В(&Ссылка)
	|	И торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID В(&ID)
	|ИТОГИ
	|	МАКСИМУМ(Номер),
	|	МАКСИМУМ(Дата),
	|	МАКСИМУМ(Организация),
	|	МАКСИМУМ(Подразделение),
	|	МАКСИМУМ(Ответственный)
	|ПО
	|	Ссылка";

	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	Если ПараметрыПечати.Свойство("МассивID") Тогда
		Запрос.УстановитьПараметр("ID", ПараметрыПечати.МассивID);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID В(&ID)", "");
	КонецЕсли;

	ВыборкаДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");

	Пока ВыборкаДокументов.Следующий() Цикл

		обШапка = Макет.ПолучитьОбласть("Шапка");

		обШапка.Параметры.Организация = ВыборкаДокументов.Организация;
		обШапка.Параметры.Подразделение = ВыборкаДокументов.Подразделение;

		обШапка.Параметры.ДатаОткрытия = Формат(ВыборкаДокументов.Дата,"ДФ=dd.MM.yyyy");
		обШапка.Параметры.Номер = ВыборкаДокументов.Номер;

		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Исполнители.Сотрудник КАК Сотрудник,
		|	Исполнители.Квалификация КАК Квалификация
		|ИЗ
		|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.Исполнители КАК Исполнители
		|ГДЕ
		|	Исполнители.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	Исполнители.Сотрудник,
		|	Исполнители.Квалификация";

		Запрос.УстановитьПараметр("Ссылка", ВыборкаДокументов.Ссылка);
		Результат = Запрос.Выполнить();
		тчСотрудникиИКвалификация = Результат.Выбрать();

		ПерваяСтрока = Истина;
		Пока тчСотрудникиИКвалификация.Следующий() Цикл
			Если ПерваяСтрока Тогда
				ПерваяСтрока = Ложь;
				обШапка.Параметры.СотрудникИКвалификация = Строка(тчСотрудникиИКвалификация.Сотрудник) + " (" + тчСотрудникиИКвалификация.Квалификация + ")";
				обШапка.Параметры.Сотрудник = тчСотрудникиИКвалификация.Сотрудник;
				ТабДок.Вывести(обШапка);
				Продолжить;
			КонецЕсли;

			обСотрудник = Макет.ПолучитьОбласть("Сотрудник");
			обСотрудник.Параметры.СотрудникИКвалификация = Строка(тчСотрудникиИКвалификация.Сотрудник) + " (" + тчСотрудникиИКвалификация.Квалификация + ")";
			обСотрудник.Параметры.Сотрудник = тчСотрудникиИКвалификация.Сотрудник;

			ПроверитьИВывести(ТабДок, обСотрудник);

		КонецЦикла;

		Если ПерваяСтрока Тогда
			ТабДок.Вывести(обШапка);
		КонецЕсли;

		ВыборкаРемонтов = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока ВыборкаРемонтов.Следующий() Цикл

			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВЫБОР
			|		КОГДА тчРемонтныеРаботы.РемонтнаяРабота ССЫЛКА Справочник.торо_ТехнологическиеОперации
			|			ТОГДА ВЫБОР
			|					КОГДА тчРемонтныеРаботы.РемонтнаяРабота.НаименованиеДляПечати = """"
			|						ТОГДА тчРемонтныеРаботы.РемонтнаяРабота.Наименование
			|					ИНАЧЕ тчРемонтныеРаботы.РемонтнаяРабота.НаименованиеДляПечати
			|				  КОНЕЦ
			|		ИНАЧЕ тчРемонтныеРаботы.РемонтнаяРабота.Наименование
			|	КОНЕЦ КАК РемонтнаяРаботаДляПечати,
			|	тчРемонтныеРаботы.РемонтнаяРабота КАК РемонтнаяРабота,
			|	ЕСТЬNULL(тчРемонтныеРаботы.РемонтнаяРабота.СодержаниеРабот, """") КАК СодержаниеРабот,
			|	тчРемонтныеРаботы.Родитель_ID КАК Родитель_ID,
			#Вставка
			|	тчРемонтныеРаботы.гкс_Примечание КАК гкс_Примечание,
			|	Выразить("""" КАК Строка(500)) КАК Исполнитель,
			#КонецВставки
			|	тчРемонтныеРаботы.ID КАК ID,
			|	торо_ТехнологическиеОперации.БазоваяЕдиницаИзмерения КАК ЕдИзм,
			|	тчРемонтныеРаботы.Количество КАК Количество
			|ИЗ
			|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтныеРаботы КАК тчРемонтныеРаботы
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ТехнологическиеОперации КАК торо_ТехнологическиеОперации
			|		ПО тчРемонтныеРаботы.РемонтнаяРабота = торо_ТехнологическиеОперации.Ссылка
			|ГДЕ
			|	тчРемонтныеРаботы.Ссылка = &Ссылка
			|	И тчРемонтныеРаботы.РемонтыОборудования_ID = &ID
			|
			|УПОРЯДОЧИТЬ ПО
			|	Родитель_ID";				   
			#Вставка
			Запрос.Текст = Запрос.Текст + " ; "
			+ "Выбрать Различные
			|ДокТЧ.Сотрудник КАК Сотрудник,
			|ДокТЧ.ID КАК ID
			|ИЗ
			|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.Исполнители КАК ДокТЧ
			|ГДЕ
			|	ДокТЧ.Ссылка = &Ссылка
			|	И ДокТЧ.РемонтыОборудования_ID = &ID
			|Итоги по ID";
			#КонецВставки

			Запрос.УстановитьПараметр("Ссылка", ВыборкаДокументов.Ссылка);
			Запрос.УстановитьПараметр("Дата", ВыборкаДокументов.Дата);
			Запрос.УстановитьПараметр("ID", ВыборкаРемонтов.ID);
			#Удаление
			Результат = Запрос.Выполнить();

			тчРемРаботы = Результат.Выгрузить();
			#КонецУдаления
			#Вставка
			Результат = Запрос.ВыполнитьПакет();
			ПакетТЧ = 0;
			тчРемРаботы = Результат[ПакетТЧ].Выгрузить();
			ПакетИсп = 1;
			ВыборкаИдИсп = Результат[ПакетИсп].выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Для Каждого СтрокаТаблицы Из тчРемРаботы Цикл
				ВыборкаИдИсп.Сбросить();
				Если ВыборкаИдИсп.НайтиСледующий(Новый Структура("ID", СтрокаТаблицы.ID)) Тогда 
					ВыборкаИсп = ВыборкаИдИсп.Выбрать();
					СтрокаИсполнителей = "";
					Пока ВыборкаИсп.Следующий() Цикл
						СтрокаИсполнителей = ?(ЗначениеЗаполнено(СтрокаИсполнителей), СтрокаИсполнителей + ",
							|", "") + ПреобразоватьФИО(ВыборкаИсп.Сотрудник);
					КонецЦикла;
					СтрокаТаблицы.Исполнитель = СтрокаИсполнителей;
				КонецЕсли;
			КонецЦикла;
			#КонецВставки

			ВывестиРемонты(Макет, ТабДок, тчРемРаботы, ВыборкаРемонтов, "НарядНаРаботы_ОднимДокументом");

		КонецЦикла;

		#Вставка
		// гкс+ [10.22] Деснол 11.10.2022
		гкс_Подвал = Макет.ПолучитьОбласть("гкс_Подвал");
		ТабДок.Вывести(гкс_Подвал);
		// гкс- [10.22] Деснол 11.10.2022
		#КонецВставки
		обОтветственный = Макет.ПолучитьОбласть("Ответственный");
		обОтветственный.Параметры.Сотрудник = ВыборкаДокументов.Ответственный;
		обОтветственный.Параметры.Дата = Формат(ТекущаяДата(),"ДФ='''""''dd''""'' MMMM yyyy ""г.""'");
		ПроверитьИВывести(ТабДок, обОтветственный);

		ПерваяСтрока = Истина;
		обИсполнительСЗаголовоком = Макет.ПолучитьОбласть("ИсполнительСЗаголовоком");

		тчСотрудникиИКвалификация.Сбросить();
		Пока тчСотрудникиИКвалификация.Следующий() Цикл
			Если ПерваяСтрока Тогда
				ПерваяСтрока = Ложь;
				обИсполнительСЗаголовоком.Параметры.Сотрудник = тчСотрудникиИКвалификация.Сотрудник;
				обИсполнительСЗаголовоком.Параметры.Дата = Формат(ТекущаяДата(),"ДФ='''""''dd''""'' MMMM yyyy ""г.""'");
				ПроверитьИВывести(ТабДок, обИсполнительСЗаголовоком);
				Продолжить;
			КонецЕсли;

			обИсполнитель = Макет.ПолучитьОбласть("Исполнитель");
			обИсполнитель.Параметры.Сотрудник = тчСотрудникиИКвалификация.Сотрудник;
			обИсполнитель.Параметры.дата = Формат(ТекущаяДата(),"ДФ='''""''dd''""'' MMMM yyyy ""г.""'");
			ПроверитьИВывести(ТабДок, обИсполнитель);
		КонецЦикла;

		Если ПерваяСтрока Тогда
			ПроверитьИВывести(ТабДок, обИсполнительСЗаголовоком);
		КонецЕсли;

		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();

	КонецЦикла;

	Возврат ТабДок;

КонецФункции
// гкс- [Релиз 1] Куст 01.02.2021

// гкс+ [разработка 2021] Куст 05.05.2021
&ИзменениеИКонтроль("ВывестиРемонты")
Процедура гкс_ВывестиРемонты(Макет, ТабДок, тчРемРаботы, ВыборкаРемонтов, ИмяПФ)

	НайС = тчРемРаботы.НайтиСтроки(Новый Структура("Родитель_ID", ""));
	Дерево = Новый ДеревоЗначений;
	Дерево.Колонки.Добавить("РемонтнаяРабота");
	Дерево.Колонки.Добавить("РемонтыОборудования_ID");
	Дерево.Колонки.Добавить("ID");
	Дерево.Колонки.Добавить("Количество");

	НужноПолучитьНормыЗапчастей = Истина;

	// Затраты из сметы
	СтруктураЗатратИзСметы = Новый Структура("РемонтныеРаботыИзСметы, СтруктураТаблиц", Новый Массив, Новый Структура);
	Если ТипЗнч(ВыборкаРемонтов.ДокументИсточник) = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") Тогда
		СтруктураЗатратИзСметы = ПолучитьНормыЗатратИзСметы(тчРемРаботы, ВыборкаРемонтов, ВыборкаРемонтов.ДокументИсточник);
		НужноПолучитьНормыЗапчастей = Ложь;
	КонецЕсли;

	РемонтныеРаботыИзСметы = СтруктураЗатратИзСметы.РемонтныеРаботыИзСметы;

	Для каждого текСтрока Из НайС Цикл
		Если Не РемонтныеРаботыИзСметы.Найти(текСтрока.ID) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		нс = Дерево.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(нс, текСтрока);
		СобратьДерево(нс, тчРемРаботы, РемонтныеРаботыИзСметы);
	КонецЦикла;

	// Затраты из нормативов
	стрЗатрат = торо_Ремонты.ПолучитьНормыЗатратИзВетвиДереваОпераций(Дерево,,, ВыборкаРемонтов.ДатаНачала, ВыборкаРемонтов.ДатаОкончания);

	тчМатЗатраты = Новый ТаблицаЗначений;
	тчМатЗатраты.Колонки.Добавить("Наименование");
	#Вставка
	// гкс+ [10.22] Деснол 11.10.2022
	тчМатЗатраты.Колонки.Добавить("КодНСИ");
	// гкс- [10.22] Деснол 11.10.2022
	#КонецВставки
	тчМатЗатраты.Колонки.Добавить("Характеристика");
	тчМатЗатраты.Колонки.Добавить("ЕдИзм");
	тчМатЗатраты.Колонки.Добавить("Количество");

	тчИнструменты = Новый ТаблицаЗначений;
	тчИнструменты.Колонки.Добавить("Наименование");
	#Вставка
	// гкс+ [10.22] Деснол 11.10.2022
	тчИнструменты.Колонки.Добавить("КодНСИ");
	// гкс- [10.22] Деснол 11.10.2022
	#КонецВставки
	тчИнструменты.Колонки.Добавить("ЕдИзм");
	тчИнструменты.Колонки.Добавить("Количество");

	Для каждого текСтрока Из СтрЗатрат Цикл
		МатЗатраты = текСтрока.СтруктураТаблиц.МатериальныеЗатраты;
		Инструменты = текСтрока.СтруктураТаблиц.ИнструментыИТехника;

		Для каждого текСтрокаТЧ Из МатЗатраты Цикл
			нс = тчМатЗатраты.Добавить();
			нс.Наименование = текСтрокаТЧ.Номенклатура;
			#Вставка
			// гкс+ [10.22] Деснол 11.10.2022
			ТемпСтрукт = Новый Структура("КодНСИ", текСтрокаТЧ.Номенклатура.Код);
			ЗаполнитьЗначенияСвойств(нс, ТемпСтрукт);
			// гкс- [10.22] Деснол 11.10.2022
			#КонецВставки
			нс.Характеристика = текСтрокаТЧ.Характеристика; 
			нс.ЕдИзм = текСтрокаТЧ.Номенклатура.ЕдиницаИзмерения;
			нс.Количество = текСтрокаТЧ.Количество;
		КонецЦикла;

		Для каждого текСтрокаТЧ Из Инструменты Цикл
			нс = тчИнструменты.Добавить();
			нс.Наименование = текСтрокаТЧ.Инструмент;
			#Вставка
			// гкс+ [10.22] Деснол 11.10.2022
			ТемпСтрукт = Новый Структура("КодНСИ", текСтрокаТЧ.Инструмент.Код);
			ЗаполнитьЗначенияСвойств(нс, ТемпСтрукт);
			// гкс- [10.22] Деснол 11.10.2022
			#КонецВставки
			нс.ЕдИзм = текСтрокаТЧ.Инструмент.ЕдиницаИзмерения;
			нс.Количество = текСтрокаТЧ.Количество;
		КонецЦикла;
	КонецЦикла;

	Если СтруктураЗатратИзСметы.СтруктураТаблиц.Количество() > 0 Тогда
		МатериальныеЗатраты = СтруктураЗатратИзСметы.СтруктураТаблиц.МатериальныеЗатраты;
		Инструменты = СтруктураЗатратИзСметы.СтруктураТаблиц.ИнструментыИТехника;

		Для каждого СтрокаЗатрат Из МатериальныеЗатраты Цикл
			НоваяСтрокаЗатрат = тчМатЗатраты.Добавить();
			НоваяСтрокаЗатрат.Наименование = СтрокаЗатрат.Номенклатура;
			#Вставка
			// гкс+ [10.22] Деснол 11.10.2022
			ТемпСтрукт = Новый Структура("КодНСИ", СтрокаЗатрат.Номенклатура.Код);
			ЗаполнитьЗначенияСвойств(НоваяСтрокаЗатрат, ТемпСтрукт);
			// гкс- [10.22] Деснол 11.10.2022
			#КонецВставки
			НоваяСтрокаЗатрат.Характеристика = СтрокаЗатрат.ХарактеристикаНоменклатуры; 
			НоваяСтрокаЗатрат.ЕдИзм = СтрокаЗатрат.ЕдиницаИзмерения;
			НоваяСтрокаЗатрат.Количество = СтрокаЗатрат.Количество;
		КонецЦикла;

		Для каждого СтрокаИнструментов Из Инструменты Цикл
			НоваяСтрокаИнструментов = тчИнструменты.Добавить();
			НоваяСтрокаИнструментов.Наименование = СтрокаИнструментов.Инструмент;
			#Вставка
			// гкс+ [10.22] Деснол 11.10.2022
			ТемпСтрукт = Новый Структура("КодНСИ", СтрокаИнструментов.Инструмент.Код);
			ЗаполнитьЗначенияСвойств(НоваяСтрокаИнструментов, ТемпСтрукт);
			// гкс- [10.22] Деснол 11.10.2022
			#КонецВставки
			НоваяСтрокаИнструментов.ЕдИзм = СтрокаИнструментов.ЕдиницаИзмерения;
			НоваяСтрокаИнструментов.Количество = СтрокаИнструментов.Количество;
		КонецЦикла;
	КонецЕсли;

	// Если наряд не на основании сметы, то запчасти нужно брать из ОР
	Если НужноПолучитьНормыЗапчастей Тогда
		НормыЗапчастей = ПолучитьНормыЗапчастей(ВыборкаРемонтов.ОбъектРемонта, ВыборкаРемонтов.ВидРемонтныхРабот);
		Для каждого СтрокаЗапчасти Из НормыЗапчастей Цикл
			НоваяСтрокаЗатрат = тчМатЗатраты.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаЗатрат, СтрокаЗапчасти);
		КонецЦикла; 
	КонецЕсли;

	#Удаление
	тчМатЗатраты.Свернуть("Наименование, Характеристика, ЕдИзм", "Количество");
	тчИнструменты.Свернуть("Наименование, ЕдИзм", "Количество");
	#КонецУдаления
	#Вставка
	// гкс+ [10.22] Деснол 11.10.2022
	тчМатЗатраты.Свернуть("Наименование, Характеристика, ЕдИзм, КодНСИ", "Количество");
	тчИнструменты.Свернуть("Наименование, ЕдИзм, КодНСИ", "Количество");
	// гкс- [10.22] Деснол 11.10.2022
	#КонецВставки

	обОписаниеОР = Макет.ПолучитьОбласть("ОписаниеОР");
	Если ИмяПФ = "НарядНаРаботы_ОднимДокументом" Тогда 
		обОписаниеОР.Параметры.ДатаНачала = Формат(ВыборкаРемонтов.ДатаНачала,"ДФ=dd.MM.yyyy");
		обОписаниеОР.Параметры.ДатаОкончания = Формат(ВыборкаРемонтов.ДатаОкончания,"ДФ=dd.MM.yyyy");
	КонецЕсли;
	обОписаниеОР.Параметры.ОР = торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(ВыборкаРемонтов.ОбъектРемонта);
	#Вставка
	// гкс+ [10.22] Деснол 11.10.2022
	обОписаниеОР.Параметры.ОР =  Строка(обОписаниеОР.Параметры.ОР) + "
	|Технологический №: " + ВыборкаРемонтов.ТехНомер;
	// гкс- [10.22] Деснол 11.10.2022
	#КонецВставки
	обОписаниеОР.Параметры.Местонахождение = ВыборкаРемонтов.АдресМестонахождения;
	обОписаниеОР.Параметры.Описание = ВыборкаРемонтов.ВидРемонтныхРабот;
	ПроверитьИВывести(ТабДок, обОписаниеОР);

	#Удаление
	обШапкаТЧСостав = Макет.ПолучитьОбласть("ШапкаТЧСостав");
	#КонецУдаления
	#Вставка
	обШапкаТЧСостав = Макет.ПолучитьОбласть("ШапкаТЧСостав1");
	#КонецВставки
	ПроверитьИВывести(ТабДок, обШапкаТЧСостав);

	СтрокиВКорне = тчРемРаботы.НайтиСтроки(Новый структура("Родитель_ID", ""));
	#Удаление
	ВывестиРекурсивно(Макет, тчРемРаботы, СтрокиВКорне, ТабДок, "СтрокаТЧСостав", "");
	#КонецУдаления
	#Вставка
	ВывестиРекурсивно(Макет, тчРемРаботы, СтрокиВКорне, ТабДок, "СтрокаТЧСостав1", "");
	#КонецВставки


	ИспользоватьХарактеристики = Константы.торо_ИспользоватьХарактеристикиНоменклатуры.Получить();
	Если ИспользоватьХарактеристики Тогда 
		обШапкаТЧМатериалы = Макет.ПолучитьОбласть("ШапкаТЧМатериалыФО");
		обСтрокаТЧМатериалы = Макет.ПолучитьОбласть("СтрокаТЧМатериалыФО");
	Иначе 
		обШапкаТЧМатериалы = Макет.ПолучитьОбласть("ШапкаТЧМатериалы");
		обСтрокаТЧМатериалы = Макет.ПолучитьОбласть("СтрокаТЧМатериалы");
	КонецЕсли;
	ПроверитьИВывести(ТабДок, обШапкаТЧМатериалы);

	номерПП = 1;
	Для каждого текСтрока из тчМатЗатраты Цикл
		#Вставка
		// гкс+ [10.22] Деснол 11.10.2022
		ЗаполнитьЗначенияСвойств(обСтрокаТЧМатериалы.Параметры, текСтрока);
		// гкс- [10.22] Деснол 11.10.2022
		#КонецВставки
		обСтрокаТЧМатериалы.Параметры.Ном = НомерПП;
		обСтрокаТЧМатериалы.Параметры.Наименование = текСтрока.Наименование;
		Если ИспользоватьХарактеристики Тогда
			обСтрокаТЧМатериалы.Параметры.Характеристика = текСтрока.Характеристика;
		КонецЕсли; 
		обСтрокаТЧМатериалы.Параметры.ЕдИзм = текСтрока.ЕдИзм;
		обСтрокаТЧМатериалы.Параметры.Количество = текСтрока.Количество;

		НомерПП = НомерПП + 1;
		ПроверитьИВывести(ТабДок, обСтрокаТЧМатериалы);
	КонецЦикла;

	обШапкаТЧИнструменты = Макет.ПолучитьОбласть("ШапкаТЧИнструменты");
	ПроверитьИВывести(ТабДок, обШапкаТЧИнструменты);

	НомерПП = 1;
	Для каждого ТекСтрока Из тчИнструменты Цикл 
		обСтрокаТЧИнструменты = Макет.ПолучитьОбласть("СтрокаТЧИнструменты");
		#Вставка
		// гкс+ [10.22] Деснол 11.10.2022
		ЗаполнитьЗначенияСвойств(обСтрокаТЧИнструменты.Параметры, текСтрока);
		// гкс- [10.22] Деснол 11.10.2022
		#КонецВставки
		обСтрокаТЧИнструменты.Параметры.Ном = НомерПП;
		обСтрокаТЧИнструменты.Параметры.Наименование = ТекСтрока.Наименование;
		обСтрокаТЧИнструменты.Параметры.ЕдИзм = ТекСтрока.ЕдИзм;
		обСтрокаТЧИнструменты.Параметры.Количество = ТекСтрока.Количество;

		НомерПП = НомерПП + 1;
		ПроверитьИВывести(ТабДок, обСтрокаТЧИнструменты);
	КонецЦикла;

	КонтрПоказатели = ПланыВидовХарактеристик.торо_ИзмеряемыеПоказателиОбъектовРемонта.ПолучитьСтруктуруИзмеряемыхПоказателейОбъектовРемонта(ВыборкаРемонтов.ОбъектРемонта);
	Если ИмяПФ = "НарядНаРаботы_сПоказателями" И КонтрПоказатели.Количество() > 0 Тогда 
		обШапкаТЧПоказатели = Макет.ПолучитьОбласть("ШапкаТЧПоказатели");
		ПроверитьИВывести(ТабДок, обШапкаТЧПоказатели);

		НомерПП = 1;
		Для каждого Строка Из КонтрПоказатели Цикл 
			Если НЕ Строка.Удален Тогда 
				обСтрокаТЧПоказатели = Макет.ПолучитьОбласть("СтрокаТЧПокзатели");
				обСтрокаТЧПоказатели.Параметры.Ном = НомерПП;
				обСтрокаТЧПоказатели.Параметры.Показатель = Строка.Показатель;

				НомерПП = НомерПП + 1;
				ПроверитьИВывести(ТабДок, обСтрокаТЧПоказатели);
			КонецЕсли;
		КонецЦикла;

	КонецЕсли;

КонецПроцедуры
// гкс- [разработка 2021] Куст 05.05.2021

// гкс+ [разработка 2021] Куст 05.05.2021
Функция ПреобразоватьФИО(Сотрудник)
	ИндексПервойЧастиИмени = 0;
	ИндексВторойЧастиИмени = 1;
	ИндексТретейЧастиИмени = 2;
	МассивИмени = СтрРазделить(Строка(Сотрудник), " ", Ложь);
	Если МассивИмени.Количество() > 2 Тогда 
		Возврат МассивИмени[ИндексПервойЧастиИмени] 
		+ " " + Лев(МассивИмени[ИндексВторойЧастиИмени], 1) 
		+ ". " + Лев(МассивИмени[ИндексТретейЧастиИмени], 1) + ".";
	КонецЕсли;
	Возврат Сотрудник;
КонецФункции
// гкс- [разработка 2021] Куст 05.05.2021

// гкс+ [разработка 2021] Куст 19.05.2021
Функция гкс_ПечатьБАТОгневые(МассивОбъектов, ПараметрыПечати)
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ИмяПараметровПечати = "торо_НарядНаВыполнениеРемонтныхРабот";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_гкс_БАТ_ОгневыеРаботы");
	
	Запрос = Новый Запрос;
#Область ТекстЗапроса
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Док.Ссылка КАК Ссылка,
	|	Док.Ссылка.Номер КАК Номер,
	|	Док.Ссылка.Дата КАК Дата,
	|	Док.Ссылка.Организация КАК Организация,
	|	Док.Ссылка.Подразделение КАК Подразделение,
	|	Док.Ссылка.Ответственный КАК Ответственный,
	|	Док.ID КАК ID,
	|	Док.ОбъектРемонта КАК ОбъектРемонта,
	|	Док.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	Док.ДатаНачала КАК ДатаНачала,
	|	Док.ДатаОкончания КАК ДатаОкончания,
	|	Док.ОпаснаяРабота КАК ОпаснаяРабота,
	|	Док.МестоПроведенияРабот КАК МестоПроведенияРабот
	|ПОМЕСТИТЬ ВсеДокументы
	|ИЗ
	|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтыОборудования КАК Док
	|ГДЕ
	|	Док.Ссылка В(&Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВсеДокументы.Ссылка КАК Ссылка,
	|	Ответственные.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	МАКСИМУМ(Ответственные.Сотрудник) КАК Сотрудник
	|ПОМЕСТИТЬ ВсеОтветственныеДокументы
	|ИЗ
	|	ВсеДокументы КАК ВсеДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_НарядНаВыполнениеРемонтныхРабот.Ответственные КАК Ответственные
	|		ПО (Ответственные.Ссылка = ВсеДокументы.Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсеДокументы.Ссылка,
	|	Ответственные.ОтветственноеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеОтветственныеДокументы.Ссылка КАК Ссылка,
	|	ВсеОтветственныеДокументы.Сотрудник КАК Допускающий,
	|	NULL КАК РуководительРабот,
	|	NULL КАК ИсполнительРабот,
	|	NULL КАК ОтветственныйЗаПодготовку
	|	,NULL КАК НарядВыдал
	|ПОМЕСТИТЬ ОтветственныеБезГруппировки
	|ИЗ
	|	ВсеОтветственныеДокументы КАК ВсеОтветственныеДокументы
	|ГДЕ
	|	ВсеОтветственныеДокументы.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.торо_ОтветственныеЛица.Допускающий)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВсеОтветственныеДокументы.Ссылка,
	|	NULL,
	|	ВсеОтветственныеДокументы.Сотрудник,
	|	NULL
	|	,NULL
	|	,NULL
	|ИЗ
	|	ВсеОтветственныеДокументы КАК ВсеОтветственныеДокументы
	|ГДЕ
	|	ВсеОтветственныеДокументы.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.торо_ОтветственныеЛица.РуководительРабот)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВсеОтветственныеДокументы.Ссылка,
	|	NULL,
	|	NULL,
	|	ВсеОтветственныеДокументы.Сотрудник
	|	,NULL
	|	,NULL
	|ИЗ
	|	ВсеОтветственныеДокументы КАК ВсеОтветственныеДокументы
	|ГДЕ
	|	ВсеОтветственныеДокументы.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.торо_ОтветственныеЛица.ИсполнительРабот)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВсеОтветственныеДокументы.Ссылка,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВсеОтветственныеДокументы.Сотрудник
	|	,NULL
	|ИЗ
	|	ВсеОтветственныеДокументы КАК ВсеОтветственныеДокументы
	|ГДЕ
	|	ВсеОтветственныеДокументы.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.торо_ОтветственныеЛица.ОтветственныйЗаПодготовкуОбъекта)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВсеОтветственныеДокументы.Ссылка,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВсеОтветственныеДокументы.Сотрудник
	|ИЗ
	|	ВсеОтветственныеДокументы КАК ВсеОтветственныеДокументы
	|ГДЕ
	|	ВсеОтветственныеДокументы.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.торо_ОтветственныеЛица.Наряд_допускВыдал)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтветственныеБезГруппировки.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ОтветственныеБезГруппировки.Допускающий) КАК Допускающий,
	|	МАКСИМУМ(ОтветственныеБезГруппировки.РуководительРабот) КАК РуководительРабот,
	|	МАКСИМУМ(ОтветственныеБезГруппировки.ИсполнительРабот) КАК ИсполнительРабот,
	|	МАКСИМУМ(ОтветственныеБезГруппировки.ОтветственныйЗаПодготовку) КАК ОтветственныйЗаПодготовку,
	|		МАКСИМУМ(ОтветственныеБезГруппировки.НарядВыдал) КАК НарядВыдал
	|ПОМЕСТИТЬ ОтвДокументов
	|ИЗ
	|	ОтветственныеБезГруппировки КАК ОтветственныеБезГруппировки
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтветственныеБезГруппировки.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеДокументы.Ссылка КАК Ссылка,
	|	ЕстьNull(ННД.НомерТекст, ВсеДокументы.Номер) КАК Номер,
	|	ВсеДокументы.Ссылка.гкс_РежимРаботы КАК РежимРаботы,
	|	ВсеДокументы.Ссылка.гкс_ОсобыеУсловия КАК ОсобыеУсловия,
	|	ВсеДокументы.Ссылка.Комментарий КАК Комментарий,
	|	ВсеДокументы.Дата КАК Дата,
	|	ВсеДокументы.ID КАК ИД,
	|	ВсеДокументы.ОбъектРемонта КАК ОР,
	|	ВсеДокументы.ОбъектРемонта.Подразделение КАК ПодразделениеВладелец,
	|	Выбор когда ВсеДокументы.ОбъектРемонта.ТипОбъекта = Значение(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто)
	|	тогда гкс_ТекущиеФМОР.ТМ
	|	иначе гкс_ТекущиеФМОР.ТМФМ
	|	Конец КАК ТехМесто,
	|	ВсеДокументы.ОбъектРемонта.ТехНомер	КАК ТехНомер,
	|	ВсеДокументы.ДатаНачала КАК ДатаНачала,
	|	ВсеДокументы.ДатаОкончания КАК ДатаОкончания,
	|	ОтвДокументов.Допускающий КАК Допускающий,
	|	ОтвДокументов.РуководительРабот КАК РуководительРабот,
	|	ОтвДокументов.ИсполнительРабот КАК ИсполнительРабот,
	|	ОтвДокументов.ОтветственныйЗаПодготовку КАК ОтветственныйЗаПодготовку,
	|	ОтвДокументов.НарядВыдал КАК НарядВыдал
	|ИЗ
	|	ВсеДокументы КАК ВсеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтвДокументов КАК ОтвДокументов
	|		ПО ВсеДокументы.Ссылка = ОтвДокументов.Ссылка
	|		левое соединение РегистрСведений.гкс_НомераНарядДопусков КАК ННД
	|		ПО ННД.Документ = ВсеДокументы.Ссылка
		|	Левое соединение РегистрСведений.гкс_ТекущиеФМОР КАК гкс_ТекущиеФМОР
		|	ПО гкс_ТекущиеФМОР.ОР = ВсеДокументы.ОбъектРемонта
	|ИТОГИ
	|	МАКСИМУМ(Номер),
	|	МАКСИМУМ(Дата)
	|ПО
	|	Ссылка
	|;
	|Выбрать Различные
	|ТЧ.Сотрудник КАК Сотрудник,
	|ТЧ.гкс_СотрудникКонтрагента КАК гкс_СотрудникКонтрагента,
	|ТЧ.Ссылка КАК Ссылка, ТЧ.РемонтыОборудования_ID КАК ИД, ТЧ.Квалификация КАК Квалификация
	|ИЗ
	|	ВсеДокументы КАК ВсеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_НарядНаВыполнениеРемонтныхРабот.Исполнители КАК ТЧ
	|			Внутреннее соединение Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтныеРаботы КАК ТЧ_РемонтныеРаботы
	|			ПО ТЧ_РемонтныеРаботы.Ссылка = ТЧ.Ссылка И ТЧ_РемонтныеРаботы.гкс_Огневая
	|			И ТЧ_РемонтныеРаботы.ID = ТЧ.ID
	|		ПО ВсеДокументы.Ссылка = ТЧ.Ссылка
	|Итоги ПО Ссылка, ИД
	|;
	|Выбрать Различные
	|ТЧ.Ссылка КАК Ссылка, ТЧ.НомерСтроки КАК НомерСтроки,
	|	ТЧ.Исполнитель КАК Контрагент, ТЧ.РемонтыОборудования_ID КАК ИД
	|
	|	ИЗ	
	|	ВсеДокументы КАК ВсеДокументы
	|	Внутреннее соединение Документ.торо_НарядНаВыполнениеРемонтныхРабот.ИсполнителиПоРемонтам КАК ТЧ
	|	ПО ТЧ.Ссылка = ВсеДокументы.Ссылка
	|Упорядочить по ТЧ.НомерСтроки	
	|Итоги ПО Ссылка, ИД
	|;
	| Выбрать Различные 
	|ТЧ.Ссылка КАК Ссылка, ТЧ.РемонтыОборудования_ID КАК ИД, ТЧ.РемонтнаяРабота КАК РР, ТЧ.НомерСтроки КАК НомерСтроки,
	|ТЧ.гкс_Примечание КАК гкс_Примечание
	|	ИЗ	
	|	ВсеДокументы КАК ВсеДокументы
	|	Внутреннее соединение Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтныеРаботы КАК ТЧ
	|	ПО ТЧ.Ссылка = ВсеДокументы.Ссылка И ТЧ.гкс_Огневая
	|Упорядочить По ТЧ.НомерСтроки
	|Итоги ПО Ссылка, ИД
	|;  
	|Выбрать 
	|ТЧ.Ссылка КАК Ссылка, ТЧ.НомерСтроки КАК НомерСтроки, 1 КАК Приоритет,
	|	ТЧ.Мероприятие КАК Мероприятие
	|
	|	ИЗ	
	|	ВсеДокументы КАК ВсеДокументы
	|	Внутреннее соединение Документ.торо_НарядНаВыполнениеРемонтныхРабот.гкс_МПОБДо КАК ТЧ
	|	ПО ТЧ.Ссылка = ВсеДокументы.Ссылка
	|
	|Объединить все
	|
	|Выбрать 
	|ТЧ.Ссылка, ТЧ.НомерСтроки, 2 ,
	|	ТЧ.Мероприятие
	|
	|	ИЗ	
	|	ВсеДокументы КАК ВсеДокументы
	|	Внутреннее соединение Документ.торо_НарядНаВыполнениеРемонтныхРабот.гкс_МПОБВоВремя КАК ТЧ
	|	ПО ТЧ.Ссылка = ВсеДокументы.Ссылка
	|
	|Упорядочить по Приоритет, ТЧ.НомерСтроки	
	|Итоги ПО Ссылка
	|;
	|Выбрать Различные ТЧ.Сотрудник
	|Поместить РазличныеСотрудники
	|ИЗ ВсеОтветственныеДокументы КАК ТЧ
	|;
	|Выбрать
	|ТЧ.Сотрудник, Максимум(Рег.ТекущаяДолжность) КАК Должность
	|
	|ИЗ РазличныеСотрудники КАК ТЧ
	|	Внутреннее соединение РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК Рег
	|	По Рег.Сотрудник = ТЧ.Сотрудник
	|Сгруппировать по ТЧ.Сотрудник
	|
	|
	|
	|";
#КонецОбласти
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов); 
	СдвигЧП = Час(ТекущаяДатаСеанса()) - Час(ТекущаяДата());
	СекундВЧасе = 3600;
	СдвигСекунд = СдвигЧП * СекундВЧасе;
	
	ПервыйПакет = 4;
	ВторойПакет = ПервыйПакет + 1;
	ТретийПакет = ВторойПакет + 1;
	РемРаботыПакет = ТретийПакет + 1;
	МероприятияПакет = РемРаботыПакет + 1;
	ЧислоПакетовРавноеДвум = 2;
	ДолжностиПакет = МероприятияПакет + ЧислоПакетовРавноеДвум;
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаДокументов = РезультатЗапроса[ПервыйПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
	ВыборкаИсполнители = РезультатЗапроса[ВторойПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаКонтрагенты = РезультатЗапроса[ТретийПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаРР = РезультатЗапроса[РемРаботыПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаМероприятия = РезультатЗапроса[МероприятияПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаДолжности = РезультатЗапроса[ДолжностиПакет].Выбрать();
	
	ЭтоПервый = Истина;
	
	Пока ВыборкаДокументов.Следующий() Цикл
		
		ВыборкаРемонтов = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока ВыборкаРемонтов.Следующий() Цикл
			
			Если НЕ ЭтоПервый Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ЭтоПервый = Ложь;
			СтрПоиска = Новый Структура("Ссылка,ИД", ВыборкаДокументов.Ссылка, ВыборкаРемонтов.ИД);
			СтрПоискаОбщая = Новый Структура("Ссылка", ВыборкаДокументов.Ссылка);
			
			ОбластьШапка1 = Макет.ПолучитьОбласть("Шапка1");
			ОбластьШапка2 = Макет.ПолучитьОбласть("Шапка2");
			ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
			ОбластьСтрокаТЧ1 = Макет.ПолучитьОбласть("СтрокаТЧ1");
			ОбластьСтрокаТЧ2 = Макет.ПолучитьОбласть("СтрокаТЧ2");
			//
			ФИОЗаПодготовку = ПреобразоватьФИО(ВыборкаРемонтов.ОтветственныйЗаПодготовку);
			ФИОНарядВыдал = ПреобразоватьФИО(ВыборкаРемонтов.НарядВыдал);
			ФИОРуководительРабот = ПреобразоватьФИО(ВыборкаРемонтов.РуководительРабот);
			ОбластьШапка2.Параметры.ЗаПодготовку = ФИОЗаПодготовку;
			ОбластьШапка1.Параметры.НарядВыдал = ФИОНарядВыдал;
			ОбластьПодвал.Параметры.НарядВыдал = ФИОНарядВыдал;
			ОбластьШапка2.Параметры.РуководительРабот = ФИОРуководительРабот;
			ОбластьПодвал.Параметры.РуководительРабот = ФИОРуководительРабот;
			ОбластьПодвал.Параметры.ОсобыеУсловия = ВыборкаРемонтов.ОсобыеУсловия;
					
			ВыборкаДолжности.Сбросить();
			Если ВыборкаДолжности.НайтиСледующий(ВыборкаРемонтов.ОтветственныйЗаПодготовку) Тогда 
				ОбластьШапка1.Параметры.ЗаПодготовку = Строка(ВыборкаДолжности.Должность) + ", " + ФИОЗаПодготовку;
				ОбластьШапка2.Параметры.ЗаПодготовкуД = Строка(ВыборкаДолжности.Должность);
			Иначе
				ОбластьШапка1.Параметры.ЗаПодготовку = ФИОЗаПодготовку;
				ОбластьШапка2.Параметры.ЗаПодготовкуД = "";
			КонецЕсли;
			ВыборкаДолжности.Сбросить();
			Если ВыборкаДолжности.НайтиСледующий(ВыборкаРемонтов.НарядВыдал) Тогда 
				ОбластьШапка1.Параметры.НарядВыдалД = Строка(ВыборкаДолжности.Должность);
				ОбластьПодвал.Параметры.НарядВыдалД = Строка(ВыборкаДолжности.Должность);
			Иначе
				ОбластьШапка1.Параметры.НарядВыдалД = "";
				ОбластьПодвал.Параметры.НарядВыдалД = "";
			КонецЕсли;
			ВыборкаДолжности.Сбросить();
			Если ВыборкаДолжности.НайтиСледующий(ВыборкаРемонтов.РуководительРабот) Тогда 
				ОбластьШапка1.Параметры.РуководительРабот = Строка(ВыборкаДолжности.Должность) + ", " + ФИОРуководительРабот;
				ОбластьШапка2.Параметры.РуководительРаботД = Строка(ВыборкаДолжности.Должность);
			Иначе
				ОбластьШапка1.Параметры.РуководительРабот = ФИОРуководительРабот;
				ОбластьШапка2.Параметры.РуководительРаботД = "";
			КонецЕсли;
			//
			ВыборкаКонтрагенты.Сбросить();
			ЭтоКонтрагент = Ложь;
			Если ВыборкаКонтрагенты.НайтиСледующий(СтрПоискаОбщая) Тогда 
				ВыборкаР = ВыборкаКонтрагенты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаР.Следующий() Цикл
					Если ВыборкаР.ИД = ВыборкаРемонтов.ИД Тогда 
						Выборка = ВыборкаР.Выбрать();
						Выборка.Следующий();
						ЭтоКонтрагент = ТипЗнч(Выборка.Контрагент) = Тип("СправочникСсылка.Контрагенты");
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			МассивТекста = Новый Массив();
			Если ЗначениеЗаполнено(ВыборкаРемонтов.ТехМесто) Тогда 
				МассивТекста.Добавить(Строка(ВыборкаРемонтов.ТехМесто));
			КонецЕсли;
			Если ЗначениеЗаполнено(ВыборкаРемонтов.Комментарий) Тогда 
				МассивТекста.Добавить(Строка(ВыборкаРемонтов.Комментарий));
			КонецЕсли;
			Если ЗначениеЗаполнено(ВыборкаРемонтов.ТехНомер) Тогда 
				МассивТекста.Добавить(Строка(ВыборкаРемонтов.ТехНомер));
			КонецЕсли;
			ТекстМестаПроведения = СтрСоединить(МассивТекста, ", ");
			МассивЧастейТекста = СтрРазделить(ТекстМестаПроведения, " ");
			НомерПоПорядку = 0;
			МассивТекста = Новый массив();
			МассивТекста.Добавить("");
			НомерКуска = 0;
			КрайнийИндекс = 3;
			Пока НомерПоПорядку < МассивЧастейТекста.Количество() Цикл
				ТекДлинна = СтрДлина(МассивТекста[НомерКуска]) + ?(НомерКуска = 0, 20, 0);
				Если НомерКуска >= КрайнийИндекс Тогда 
					МассивТекста[НомерКуска] = МассивТекста[НомерКуска] + " " + МассивЧастейТекста[НомерПоПорядку];
				ИначеЕсли ТекДлинна + СтрДлина(МассивЧастейТекста[НомерПоПорядку]) > 80 Тогда 
					МассивТекста.Добавить(МассивЧастейТекста[НомерПоПорядку]);
					НомерКуска = НомерКуска + 1;
				Иначе
					МассивТекста[НомерКуска] = МассивТекста[НомерКуска] + " " + МассивЧастейТекста[НомерПоПорядку];
				КонецЕсли;
				НомерПоПорядку = НомерПоПорядку + 1;
			КонецЦикла;
			НомерПоПорядку = 1;
			Для Каждого СтрокаМассива Из МассивТекста Цикл
				ОбластьШапка1.Параметры["МестоПроведения" + НомерПоПорядку] = СтрокаМассива;
				НомерПоПорядку = НомерПоПорядку + 1;
				Если НомерПоПорядку = 5 Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			//
			ВыборкаРР.Сбросить();
			Если ВыборкаРР.НайтиСледующий(СтрПоискаОбщая) Тогда 
				МассивТК = Новый Массив();
				ВыборкаР = ВыборкаРР.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаР.Следующий() Цикл
					Если ВыборкаР.ИД = ВыборкаРемонтов.ИД Тогда 
						Выборка = ВыборкаР.Выбрать();
						Пока Выборка.Следующий() Цикл
							Если ТипЗнч(Выборка.РР) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда 
								МассивТК.Добавить(Строка(Выборка.РР) + " " + Выборка.гкс_Примечание);
							КонецЕсли;
						КонецЦикла;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				ОбластьШапка1.Параметры.СписокТО = СтрСоединить(МассивТК, ", ");
			КонецЕсли;
			//
			МассивСтрок1 = Новый Массив();
			ВыборкаМероприятия.Сбросить();
			Если ВыборкаМероприятия.НайтиСледующий(СтрПоискаОбщая) Тогда 
				
				МассивСтрок2 = Новый Массив();
				Выборка = ВыборкаМероприятия.Выбрать();
				Пока Выборка.Следующий() Цикл
					Если Выборка.Приоритет = 1 Тогда 
						МассивСтрок1.Добавить(Выборка.Мероприятие);
					Иначе
						МассивСтрок2.Добавить(Выборка.Мероприятие);
					КонецЕсли;
				КонецЦикла;
				ОбластьПодвал.Параметры.МероприятияВоВремя = СтрСоединить(МассивСтрок2, "." + Символы.ПС);
			КонецЕсли;
			ТекДатаНачала = ВыборкаРемонтов.ДатаНачала + СдвигСекунд;
			ТекДатаОкончания = ВыборкаРемонтов.ДатаОкончания + СдвигСекунд;
			ДатаНачалаТекст = Формат(ТекДатаНачала, "ДФ=""ЧЧ:мм дд.ММ.гггг """);
			ОбластьШапка1.Параметры.ДатаНачала = ДатаНачалаТекст;
			ОбластьШапка1.Параметры.ДатаОкончания = Формат(ТекДатаОкончания, "ДФ=""ЧЧ:мм дд.ММ.гггг """);
			//
			ТабДок.Вывести(ОбластьШапка1);
			НомерПП = 1;
			Для Каждого СтрокаМассива ИЗ МассивСтрок1 Цикл
				ОбластьСтрокатЧ1.Параметры.НомерПП = НомерПП;
				ОбластьСтрокатЧ1.Параметры.Текст = СтрокаМассива;
				ОбластьСтрокатЧ1.Параметры.ДатаНачала = ДатаНачалаТекст;
				ТабДок.Вывести(ОбластьСтрокатЧ1);
				НомерПП = НомерПП + 1;
			КонецЦикла;
			ТабДок.Вывести(ОбластьШапка2);
			
			ВыборкаИсполнители.Сбросить();
			Если ВыборкаИсполнители.НайтиСледующий(СтрПоискаОбщая) Тогда 
				ВыборкаР = ВыборкаИсполнители.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаР.Следующий() Цикл
					Если ВыборкаР.ИД = ВыборкаРемонтов.ИД Тогда 
						НомерПП = 1;
						Выборка = ВыборкаР.Выбрать();
						Пока Выборка.Следующий() Цикл
							
							ОбластьСтрокаТЧ2.Параметры.НомерПП = НомерПП;
							Если ЭтоКонтрагент Тогда 
								ОбластьСтрокаТЧ2.Параметры.Сотрудник = Выборка.гкс_СотрудникКонтрагента;
							Иначе
								ОбластьСтрокаТЧ2.Параметры.Сотрудник = Выборка.Сотрудник;
							КонецЕсли;
							ОбластьСтрокаТЧ2.Параметры.Квалификация = Выборка.Квалификация;
							
							ТабДок.Вывести(ОбластьСтрокаТЧ2);
							НомерПП = НомерПП + 1;
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			ТабДок.Вывести(ОбластьПодвал);
		КонецЦикла;
	КонецЦикла;
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.АвтоМасштаб = Истина;
	Возврат ТабДок;
КонецФункции
// гкс- [разработка 2021] Куст 19.05.2021

// гкс+ [разработка 2021] Куст 19.05.2021
Функция гкс_ПечатьБАТПовышеннойОпасности(МассивОбъектов, ПараметрыПечати)
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ИмяПараметровПечати = "торо_НарядНаВыполнениеРемонтныхРабот";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_НарядНаВыполнениеРемонтныхРабот.ПФ_MXL_гкс_БАТ_ПовышеннойОпасности");
	
	Запрос = Новый Запрос;
#Область ТекстЗапроса
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Док.Ссылка КАК Ссылка,
	|	Док.Ссылка.Номер КАК Номер,
	|	Док.Ссылка.Дата КАК Дата,
	|	Док.Ссылка.Организация КАК Организация,
	|	Док.Ссылка.Подразделение КАК Подразделение,
	|	Док.Ссылка.Ответственный КАК Ответственный,
	|	Док.ID КАК ID,
	|	Док.ОбъектРемонта КАК ОбъектРемонта,
	|	Док.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	Док.ДатаНачала КАК ДатаНачала,
	|	Док.ДатаОкончания КАК ДатаОкончания,
	|	Док.ОпаснаяРабота КАК ОпаснаяРабота,
	|	Док.МестоПроведенияРабот КАК МестоПроведенияРабот
	|ПОМЕСТИТЬ ВсеДокументы
	|ИЗ
	|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтыОборудования КАК Док
	|ГДЕ
	|	Док.Ссылка В(&Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВсеДокументы.Ссылка КАК Ссылка,
	|	Ответственные.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	МАКСИМУМ(Ответственные.Сотрудник) КАК Сотрудник
	|ПОМЕСТИТЬ ВсеОтветственныеДокументы
	|ИЗ
	|	ВсеДокументы КАК ВсеДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_НарядНаВыполнениеРемонтныхРабот.Ответственные КАК Ответственные
	|		ПО (Ответственные.Ссылка = ВсеДокументы.Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсеДокументы.Ссылка,
	|	Ответственные.ОтветственноеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеОтветственныеДокументы.Ссылка КАК Ссылка,
	|	ВсеОтветственныеДокументы.Сотрудник КАК Допускающий,
	|	NULL КАК РуководительРабот,
	|	NULL КАК ИсполнительРабот,
	|	NULL КАК ОтветственныйЗаПодготовку
	|	,NULL КАК НарядВыдал
	|ПОМЕСТИТЬ ОтветственныеБезГруппировки
	|ИЗ
	|	ВсеОтветственныеДокументы КАК ВсеОтветственныеДокументы
	|ГДЕ
	|	ВсеОтветственныеДокументы.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.торо_ОтветственныеЛица.Допускающий)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВсеОтветственныеДокументы.Ссылка,
	|	NULL,
	|	ВсеОтветственныеДокументы.Сотрудник,
	|	NULL
	|	,NULL
	|	,NULL
	|ИЗ
	|	ВсеОтветственныеДокументы КАК ВсеОтветственныеДокументы
	|ГДЕ
	|	ВсеОтветственныеДокументы.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.торо_ОтветственныеЛица.РуководительРабот)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВсеОтветственныеДокументы.Ссылка,
	|	NULL,
	|	NULL,
	|	ВсеОтветственныеДокументы.Сотрудник
	|	,NULL
	|	,NULL
	|ИЗ
	|	ВсеОтветственныеДокументы КАК ВсеОтветственныеДокументы
	|ГДЕ
	|	ВсеОтветственныеДокументы.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.торо_ОтветственныеЛица.ИсполнительРабот)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВсеОтветственныеДокументы.Ссылка,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВсеОтветственныеДокументы.Сотрудник
	|	,NULL
	|ИЗ
	|	ВсеОтветственныеДокументы КАК ВсеОтветственныеДокументы
	|ГДЕ
	|	ВсеОтветственныеДокументы.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.торо_ОтветственныеЛица.ОтветственныйЗаПодготовкуОбъекта)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВсеОтветственныеДокументы.Ссылка,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВсеОтветственныеДокументы.Сотрудник
	|ИЗ
	|	ВсеОтветственныеДокументы КАК ВсеОтветственныеДокументы
	|ГДЕ
	|	ВсеОтветственныеДокументы.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.торо_ОтветственныеЛица.Наряд_допускВыдал)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтветственныеБезГруппировки.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ОтветственныеБезГруппировки.Допускающий) КАК Допускающий,
	|	МАКСИМУМ(ОтветственныеБезГруппировки.РуководительРабот) КАК РуководительРабот,
	|	МАКСИМУМ(ОтветственныеБезГруппировки.ИсполнительРабот) КАК ИсполнительРабот,
	|	МАКСИМУМ(ОтветственныеБезГруппировки.ОтветственныйЗаПодготовку) КАК ОтветственныйЗаПодготовку,
	|		МАКСИМУМ(ОтветственныеБезГруппировки.НарядВыдал) КАК НарядВыдал
	|ПОМЕСТИТЬ ОтвДокументов
	|ИЗ
	|	ОтветственныеБезГруппировки КАК ОтветственныеБезГруппировки
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтветственныеБезГруппировки.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеДокументы.Ссылка КАК Ссылка,
	|	ЕстьNull(ННД.НомерТекст, ВсеДокументы.Номер) КАК Номер,
	|	ВсеДокументы.Ссылка.гкс_РежимРаботы КАК РежимРаботы,
	|	ВсеДокументы.Ссылка.гкс_ОсобыеУсловия КАК ОсобыеУсловия,
	|	ВсеДокументы.Ссылка.Комментарий КАК Комментарий,
	|	ВсеДокументы.Дата КАК Дата,
	|	ВсеДокументы.Организация КАК Организация,
	|	ВсеДокументы.Подразделение КАК Подразделение,
	|	ВсеДокументы.Ответственный КАК Ответственный,
	|	ВсеДокументы.ID КАК ИД,
	|	ВсеДокументы.ОбъектРемонта КАК ОР,
	|	ВсеДокументы.ОбъектРемонта.Подразделение КАК ПодразделениеВладелец,
	|	Выбор когда ВсеДокументы.ОбъектРемонта.ТипОбъекта = Значение(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто)
	|	тогда гкс_ТекущиеФМОР.ТМ
	|	иначе гкс_ТекущиеФМОР.ТМФМ
	|	Конец КАК ТехМесто,
	|	ВсеДокументы.ОбъектРемонта.ТехНомер	КАК ТехНомер,
	|	ВсеДокументы.ВидРемонтныхРабот КАК ВР,
	|	ВсеДокументы.ДатаНачала КАК ДатаНачала,
	|	ВсеДокументы.ДатаОкончания КАК ДатаОкончания,
	|	ВсеДокументы.ОпаснаяРабота КАК ОпаснаяРабота,
	|	ВсеДокументы.МестоПроведенияРабот КАК МестоПроведенияРабот,
	|	ОтвДокументов.Допускающий КАК Допускающий,
	|	ОтвДокументов.РуководительРабот КАК РуководительРабот,
	|	ОтвДокументов.ИсполнительРабот КАК ИсполнительРабот,
	|	ОтвДокументов.ОтветственныйЗаПодготовку КАК ОтветственныйЗаПодготовку,
	|	ОтвДокументов.НарядВыдал КАК НарядВыдал
	|ИЗ
	|	ВсеДокументы КАК ВсеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтвДокументов КАК ОтвДокументов
	|		ПО ВсеДокументы.Ссылка = ОтвДокументов.Ссылка
	|		левое соединение РегистрСведений.гкс_НомераНарядДопусков КАК ННД
	|		ПО ННД.Документ = ВсеДокументы.Ссылка
		|	Левое соединение РегистрСведений.гкс_ТекущиеФМОР КАК гкс_ТекущиеФМОР
		|	ПО гкс_ТекущиеФМОР.ОР = ВсеДокументы.ОбъектРемонта
	|ИТОГИ
	|	МАКСИМУМ(Номер),
	|	МАКСИМУМ(Дата),
	|	МАКСИМУМ(Организация),
	|	МАКСИМУМ(Подразделение),
	|	МАКСИМУМ(Ответственный)
	|ПО
	|	Ссылка
	|;
	|Выбрать Различные
	|ТЧ.Сотрудник КАК Сотрудник,
	|ТЧ.гкс_СотрудникКонтрагента КАК гкс_СотрудникКонтрагента,
	|ТЧ.Ссылка КАК Ссылка, ТЧ.РемонтыОборудования_ID КАК ИД, ТЧ.Квалификация КАК Квалификация
	|ИЗ
	|	ВсеДокументы КАК ВсеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_НарядНаВыполнениеРемонтныхРабот.Исполнители КАК ТЧ
	|		ПО ВсеДокументы.Ссылка = ТЧ.Ссылка
	|Итоги ПО Ссылка, ИД
	|;
	|Выбрать Различные
	|ТЧ.Ссылка КАК Ссылка, ТЧ.НомерСтроки КАК НомерСтроки,
	|	ТЧ.Исполнитель КАК Контрагент, ТЧ.РемонтыОборудования_ID КАК ИД
	|
	|	ИЗ	
	|	ВсеДокументы КАК ВсеДокументы
	|	Внутреннее соединение Документ.торо_НарядНаВыполнениеРемонтныхРабот.ИсполнителиПоРемонтам КАК ТЧ
	|	ПО ТЧ.Ссылка = ВсеДокументы.Ссылка
	|Упорядочить по ТЧ.НомерСтроки	
	|Итоги ПО Ссылка, ИД
	|;
	| Выбрать Различные 
	|ТЧ.Ссылка КАК Ссылка, ТЧ.РемонтыОборудования_ID КАК ИД, ТЧ.РемонтнаяРабота КАК РР, ТЧ.НомерСтроки КАК НомерСтроки,
	|ТЧ.гкс_Примечание КАК гкс_Примечание
	|	ИЗ	
	|	ВсеДокументы КАК ВсеДокументы
	|	Внутреннее соединение Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтныеРаботы КАК ТЧ
	|	ПО ТЧ.Ссылка = ВсеДокументы.Ссылка
	|Упорядочить По ТЧ.НомерСтроки
	|Итоги ПО Ссылка, ИД
	|;  
	|Выбрать 
	|ТЧ.Ссылка КАК Ссылка, ТЧ.НомерСтроки КАК НомерСтроки, 1 КАК Приоритет,
	|	ТЧ.Мероприятие КАК Мероприятие
	|
	|	ИЗ	
	|	ВсеДокументы КАК ВсеДокументы
	|	Внутреннее соединение Документ.торо_НарядНаВыполнениеРемонтныхРабот.гкс_МПОБДо КАК ТЧ
	|	ПО ТЧ.Ссылка = ВсеДокументы.Ссылка
	|
	|Объединить все
	|
	|Выбрать 
	|ТЧ.Ссылка, ТЧ.НомерСтроки, 2 ,
	|	ТЧ.Мероприятие
	|
	|	ИЗ	
	|	ВсеДокументы КАК ВсеДокументы
	|	Внутреннее соединение Документ.торо_НарядНаВыполнениеРемонтныхРабот.гкс_МПОБВоВремя КАК ТЧ
	|	ПО ТЧ.Ссылка = ВсеДокументы.Ссылка
	|
	|Упорядочить по Приоритет, ТЧ.НомерСтроки	
	|Итоги ПО Ссылка
	|;
	|Выбрать Различные ТЧ.Сотрудник
	|Поместить РазличныеСотрудники
	|ИЗ ВсеОтветственныеДокументы КАК ТЧ
	|;
	|Выбрать
	|ТЧ.Сотрудник, Максимум(Рег.ТекущаяДолжность) КАК Должность
	|
	|ИЗ РазличныеСотрудники КАК ТЧ
	|	Внутреннее соединение РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК Рег
	|	По Рег.Сотрудник = ТЧ.Сотрудник
	|Сгруппировать по ТЧ.Сотрудник
	|
	|
	|
	|";
	#КонецОбласти
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов); 
	Если ПараметрыПечати.Свойство("МассивID") Тогда
		Запрос.УстановитьПараметр("ID", ПараметрыПечати.МассивID);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТЧ.ID В(&ID)", "");
	КонецЕсли;
	СдвигЧП = Час(ТекущаяДатаСеанса()) - Час(ТекущаяДата());
	СекундВЧасе = 3600;
	СдвигСекунд = СдвигЧП * СекундВЧасе;
	
	ПервыйПакет = 4;
	ВторойПакет = ПервыйПакет + 1;
	ТретийПакет = ВторойПакет + 1;
	РемРаботыПакет = ТретийПакет + 1;
	МероприятияПакет = РемРаботыПакет + 1;
	ЧислоПакетовРавноеДвум = 2;
	ДолжностиПакет = МероприятияПакет + ЧислоПакетовРавноеДвум;
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаДокументов = РезультатЗапроса[ПервыйПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
	ВыборкаИсполнители = РезультатЗапроса[ВторойПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаКонтрагенты = РезультатЗапроса[ТретийПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаРР = РезультатЗапроса[РемРаботыПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаМероприятия = РезультатЗапроса[МероприятияПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаДолжности = РезультатЗапроса[ДолжностиПакет].Выбрать();
	
	ЭтоПервый = Истина;
	
	Пока ВыборкаДокументов.Следующий() Цикл
		
		ВыборкаРемонтов = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока ВыборкаРемонтов.Следующий() Цикл
			
			Если НЕ ЭтоПервый Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ЭтоПервый = Ложь;
			СтрПоиска = Новый Структура("Ссылка,ИД", ВыборкаДокументов.Ссылка, ВыборкаРемонтов.ИД);
			СтрПоискаОбщая = Новый Структура("Ссылка", ВыборкаДокументов.Ссылка);
			
			ОбластьШапка1 = Макет.ПолучитьОбласть("Шапка1");
			ОбластьШапка2 = Макет.ПолучитьОбласть("Шапка2");
			ОбластьШапка3 = Макет.ПолучитьОбласть("Шапка3");
			ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
			ОбластьСтрокаТЧ1 = Макет.ПолучитьОбласть("СтрокаТЧ1");
			ОбластьСтрокаТЧ2 = Макет.ПолучитьОбласть("СтрокаТЧ2");
			ОбластьСтрокаТЧ3 = Макет.ПолучитьОбласть("СтрокаТЧ3");
			ФИОНарядВыдал = ПреобразоватьФИО(ВыборкаРемонтов.НарядВыдал);
			ФИОРуководительРабот = ПреобразоватьФИО(ВыборкаРемонтов.РуководительРабот);
			ОбластьПодвал.Параметры.НарядВыдал = ФИОНарядВыдал;
			ОбластьПодвал.Параметры.РуководительРабот = ФИОРуководительРабот;
			ОбластьШапка1.Параметры.ОсобыеУсловия = ВыборкаРемонтов.ОсобыеУсловия;
			
			ВыборкаДолжности.Сбросить();
			Если ВыборкаДолжности.НайтиСледующий(ВыборкаРемонтов.НарядВыдал) Тогда 
				ОбластьПодвал.Параметры.НарядВыдалД = Строка(ВыборкаДолжности.Должность);
			Иначе
				ОбластьПодвал.Параметры.НарядВыдалД = "";
			КонецЕсли;
			ВыборкаДолжности.Сбросить();
			Если ВыборкаДолжности.НайтиСледующий(ВыборкаРемонтов.РуководительРабот) Тогда 
				ОбластьШапка1.Параметры.РуководительРабот = Строка(ВыборкаДолжности.Должность) + ", " + ФИОРуководительРабот;
				ОбластьПодвал.Параметры.РуководительРаботД = Строка(ВыборкаДолжности.Должность);
			Иначе
				ОбластьШапка1.Параметры.РуководительРабот = ФИОРуководительРабот;
				ОбластьПодвал.Параметры.РуководительРаботД = "";
			КонецЕсли;
			//
			ВыборкаКонтрагенты.Сбросить();
			ЭтоКонтрагент = Ложь;
			Если ВыборкаКонтрагенты.НайтиСледующий(СтрПоискаОбщая) Тогда 
				ВыборкаР = ВыборкаКонтрагенты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаР.Следующий() Цикл
					Если ВыборкаР.ИД = ВыборкаРемонтов.ИД Тогда 
						Выборка = ВыборкаР.Выбрать();
						Выборка.Следующий();
						ЭтоКонтрагент = ТипЗнч(Выборка.Контрагент) = Тип("СправочникСсылка.Контрагенты");
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			МассивТекста = Новый Массив();
			Если ЗначениеЗаполнено(ВыборкаРемонтов.ТехМесто) Тогда 
				МассивТекста.Добавить(Строка(ВыборкаРемонтов.ТехМесто));
			КонецЕсли;
			Если ЗначениеЗаполнено(ВыборкаРемонтов.Комментарий) Тогда 
				МассивТекста.Добавить(Строка(ВыборкаРемонтов.Комментарий));
			КонецЕсли;
			Если ЗначениеЗаполнено(ВыборкаРемонтов.ТехНомер) Тогда 
				МассивТекста.Добавить(Строка(ВыборкаРемонтов.ТехНомер));
			КонецЕсли;
			ОбластьШапка1.Параметры.МестоПроведения = СтрСоединить(МассивТекста, ", ");
			//
			МассивСтрок1 = Новый Массив();
			МассивСтрок2 = Новый Массив();
			ВыборкаМероприятия.Сбросить();
			Если ВыборкаМероприятия.НайтиСледующий(СтрПоискаОбщая) Тогда 
				Выборка = ВыборкаМероприятия.Выбрать();
				Пока Выборка.Следующий() Цикл
					Если Выборка.Приоритет = 1 Тогда 
						МассивСтрок1.Добавить(Выборка.Мероприятие);
					Иначе
						МассивСтрок2.Добавить(Выборка.Мероприятие);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			ТекДатаНачала = ВыборкаРемонтов.ДатаНачала + СдвигСекунд;
			ТекДатаОкончания = ВыборкаРемонтов.ДатаОкончания + СдвигСекунд;
			ДатаНачалаТекст = Формат(ТекДатаНачала, "ДФ=""ЧЧ:мм дд.ММ.гггг """);
			ОбластьШапка2.Параметры.ЧасДН = Формат(ТекДатаНачала, "ДФ=""ЧЧ""");
			ОбластьШапка2.Параметры.МинДН = Формат(ТекДатаНачала, "ДФ=""мм""");
			ОбластьШапка2.Параметры.ГодДН = Формат(ТекДатаНачала, "ДФ=""гггг""");
			ОбластьШапка2.Параметры.ЧасДО = Формат(ТекДатаОкончания, "ДФ=""ЧЧ""");
			ОбластьШапка2.Параметры.МинДО = Формат(ТекДатаОкончания, "ДФ=""мм""");
			ОбластьШапка2.Параметры.ГодДО = Формат(ТекДатаОкончания, "ДФ=""гггг""");
			ОбластьШапка2.Параметры.ДатаДН = Формат(ТекДатаНачала, "ДФ=""дд ММММ""");
			ОбластьШапка2.Параметры.ДатаДО = Формат(ТекДатаОкончания, "ДФ=""дд ММММ""");
			//
			ТабДок.Вывести(ОбластьШапка1);
			НомерПП = 1;
			Для Каждого СтрокаМассива ИЗ МассивСтрок1 Цикл
				ОбластьСтрокатЧ1.Параметры.Текст = СтрокаМассива;
				ОбластьСтрокатЧ1.Параметры.ДатаНачала = ДатаНачалаТекст;
				ТабДок.Вывести(ОбластьСтрокатЧ1);
				НомерПП = НомерПП + 1;
			КонецЦикла;
			ТабДок.Вывести(ОбластьШапка2);
			Для Каждого СтрокаМассива ИЗ МассивСтрок2 Цикл
				ОбластьСтрокатЧ2.Параметры.Текст = СтрокаМассива;
				ОбластьСтрокатЧ2.Параметры.РуководительРабот = ФИОРуководительРабот;
				ТабДок.Вывести(ОбластьСтрокатЧ2);
			КонецЦикла;
			ТабДок.Вывести(ОбластьШапка3);
			
			ВыборкаИсполнители.Сбросить();
			Если ВыборкаИсполнители.НайтиСледующий(СтрПоискаОбщая) Тогда 
				ВыборкаР = ВыборкаИсполнители.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаР.Следующий() Цикл
					Если ВыборкаР.ИД = ВыборкаРемонтов.ИД Тогда 
						Выборка = ВыборкаР.Выбрать();
						Пока Выборка.Следующий() Цикл
							Если ЭтоКонтрагент Тогда 
								ОбластьСтрокаТЧ3.Параметры.Сотрудник = Выборка.гкс_СотрудникКонтрагента;
							Иначе
								ОбластьСтрокаТЧ3.Параметры.Сотрудник = Выборка.Сотрудник;
							КонецЕсли;
							ОбластьСтрокаТЧ3.Параметры.Квалификация = Выборка.Квалификация;
							
							ТабДок.Вывести(ОбластьСтрокаТЧ3);
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			ТабДок.Вывести(ОбластьПодвал);
		КонецЦикла;
	КонецЦикла;
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.АвтоМасштаб = Истина;
	Возврат ТабДок;
КонецФункции

// гкс- [разработка 2021] Куст 19.05.2021
#КонецОбласти