#Область РаботаСДеревомРемонтныхРабот

&ИзменениеИКонтроль("ДобавитьСтрокуДереваРемонтов")
Функция Расш_гкс_ДобавитьСтрокуДереваРемонтов(Дерево, ДокументОбъект, Знач ТекущиеЗначения, Значение, ID, Знач ТехКарта, Количество)

	Если Количество = Неопределено Тогда
		Количество = 1;
	КонецЕсли;

	Если ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот") Тогда
		МассивСтрок = Дерево.Строки.НайтиСтроки(Новый Структура("ID, Родитель_ID, Предписание_ID", ТекущиеЗначения.СтрокаРодитель_ID, ТекущиеЗначения.СтрокаРодительРодитель_ID,ТекущиеЗначения.СтрокаРодительРемонтыОборудования_ID),Истина);
	Иначе
		МассивСтрок = Дерево.Строки.НайтиСтроки(Новый Структура("ID, Родитель_ID, РемонтыОборудования_ID", ТекущиеЗначения.СтрокаРодитель_ID, ТекущиеЗначения.СтрокаРодительРодитель_ID,ТекущиеЗначения.СтрокаРодительРемонтыОборудования_ID),Истина);
	КонецЕсли;

	Если МассивСтрок.Количество() > 0 Тогда
		СтрокаРодитель = МассивСтрок[0];	
		НовСтрокаДерева = СтрокаРодитель.Строки.Добавить();
		НовСтрокаДерева.ID = Новый УникальныйИдентификатор;
		НовСтрокаДерева.Родитель_ID     		= ТекущиеЗначения.СтрокаРодитель_ID;
		Если ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот") Тогда
			НовСтрокаДерева.Предписание_ID 	= ID;
		Иначе
			НовСтрокаДерева.РемонтыОборудования_ID 	= ?(ТекущиеЗначения.Свойство("ТекущийРемонт_ID"), ТекущиеЗначения.ТекущийРемонт_ID, ТекущиеЗначения.СтрокаРодительРемонтыОборудования_ID);
		КонецЕсли;
		НовСтрокаДерева.РемонтнаяРабота 		= Значение;
		НовСтрокаДерева.Картинка        		= ИндексКартинкиДереваРемонтныхРабот(Значение);
		Если (ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.торо_АктОВыполненииЭтапаРабот")
			ИЛИ ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.торо_АктОВыполненииРегламентногоМероприятия")) И ТипЗнч(Значение) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
			НовСтрокаДерева.НоваяОперация = Истина;
			НовСтрокаДерева.ПроцентВыполненияРабот = 100;
		КонецЕсли; 
		Если Не НовСтрокаДерева.Владелец().Колонки.Найти("Количество") = Неопределено Тогда
			НовСтрокаДерева.Количество      = Количество * ?(СтрокаРодитель.Количество = 0, 1, СтрокаРодитель.Количество);
		КонецЕсли;

		ЗаполнитьЗначенияСвойств(ДокументОбъект.РемонтныеРаботы.Добавить(), НовСтрокаДерева);

		ДатаНачалаРемонта = Неопределено;
		ТекущиеЗначения.Свойство("ДатаНачалаРемонта", ДатаНачалаРемонта);

		Если (ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.торо_АктОВыполненииРегламентногоМероприятия") 
			ИЛИ ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.торо_АктОВыполненииЭтапаРабот"))
			И ТипЗнч(Значение) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда

			СтрокаРемРабот = Новый Структура("ID, РемонтыОборудования_ID, РемонтнаяРабота, Количество", ID, НовСтрокаДерева.РемонтыОборудования_ID, Значение, Количество);
			ЗаполнитьНормативыРемонтнойРаботы(ДокументОбъект, СтрокаРемРабот, ТехКарта, , НовСтрокаДерева.ID);
		КонецЕсли;

		Если ТипЗнч(Значение) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда

			ТехКарта = РегистрыСведений.торо_ВерсииТехКарт.ПолучитьВерсиюТехКарты(Значение, ДатаНачалаРемонта);

			Если ЗначениеЗаполнено(ТехКарта) Тогда
				Для Каждого ОперацияРемонта Из ТехКарта.СписокОпераций Цикл
					Если ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот") Тогда
						ТекущиеЗначения = Новый Структура("СтрокаРодитель_ID, СтрокаРодительРодитель_ID, СтрокаРодительРемонтыОборудования_ID",НовСтрокаДерева.ID,НовСтрокаДерева.Родитель_ID, НовСтрокаДерева.Предписание_ID);
					Иначе
						Если ТекущиеЗначения.Свойство("ДатаНачалаРемонта") 
							И ЗначениеЗаполнено(ТекущиеЗначения.ДатаНачалаРемонта) Тогда
							ТекущиеЗначения = Новый Структура("СтрокаРодитель_ID, СтрокаРодительРодитель_ID, СтрокаРодительРемонтыОборудования_ID,ДатаНачалаРемонта",НовСтрокаДерева.ID,НовСтрокаДерева.Родитель_ID, НовСтрокаДерева.РемонтыОборудования_ID,ТекущиеЗначения.ДатаНачалаРемонта);
						Иначе
							ТекущиеЗначения = Новый Структура("СтрокаРодитель_ID, СтрокаРодительРодитель_ID, СтрокаРодительРемонтыОборудования_ID",НовСтрокаДерева.ID,НовСтрокаДерева.Родитель_ID, НовСтрокаДерева.РемонтыОборудования_ID);
						КонецЕсли;
					КонецЕсли;

					#Удаление
					ДобавитьСтрокуДереваРемонтов(Дерево, ДокументОбъект, ТекущиеЗначения, ОперацияРемонта.Операция, ОперацияРемонта.ID, ТехКарта, ОперацияРемонта.Количество);
					#КонецУдаления
					#Вставка
					гкс_ДобавитьСтрокуДереваРемонтов(Дерево, ДокументОбъект, ТекущиеЗначения, ОперацияРемонта.Операция,
						ОперацияРемонта.ID, ТехКарта, ОперацияРемонта.Количество, ОперацияРемонта);
					#КонецВставки

				КонецЦикла;				
			КонецЕсли;

		КонецЕсли;

		Возврат НовСтрокаДерева;
	КонецЕсли;

КонецФункции

Функция гкс_ДобавитьСтрокуДереваРемонтов(Дерево, ДокументОбъект, Знач ТекущиеЗначения, Значение, 
				ID = "", Знач ТехКарта = Неопределено, Количество = Неопределено, СтрокаРР) 
	
	Если Количество = Неопределено Тогда
		Количество = 1;
	КонецЕсли;
	
	Если ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот") Тогда
		МассивСтрок = Дерево.Строки.НайтиСтроки(Новый Структура("ID, Родитель_ID, Предписание_ID", ТекущиеЗначения.СтрокаРодитель_ID, ТекущиеЗначения.СтрокаРодительРодитель_ID,ТекущиеЗначения.СтрокаРодительРемонтыОборудования_ID),Истина);
	Иначе
		МассивСтрок = Дерево.Строки.НайтиСтроки(Новый Структура("ID, Родитель_ID, РемонтыОборудования_ID", ТекущиеЗначения.СтрокаРодитель_ID, ТекущиеЗначения.СтрокаРодительРодитель_ID,ТекущиеЗначения.СтрокаРодительРемонтыОборудования_ID),Истина);
	КонецЕсли;
	
	Если МассивСтрок.Количество() > 0 Тогда
		СтрокаРодитель = МассивСтрок[0];	
		НовСтрокаДерева = СтрокаРодитель.Строки.Добавить();
		НовСтрокаДерева.ID = Новый УникальныйИдентификатор;
		НовСтрокаДерева.Родитель_ID     		= ТекущиеЗначения.СтрокаРодитель_ID;
		Если ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот") Тогда
			НовСтрокаДерева.Предписание_ID 	= ID;
		Иначе
			НовСтрокаДерева.РемонтыОборудования_ID 	= ?(ТекущиеЗначения.Свойство("ТекущийРемонт_ID"), ТекущиеЗначения.ТекущийРемонт_ID, ТекущиеЗначения.СтрокаРодительРемонтыОборудования_ID);
		КонецЕсли;
		НовСтрокаДерева.РемонтнаяРабота 		= Значение;
		ВременнаяСтруктура = Новый Структура("гкс_Примечание,гкс_ПовКоэф", "", Неопределено);
		ЗаполнитьЗначенияСвойств(ВременнаяСтруктура, СтрокаРР);
		// гкс+ [Релиз 1] Куст 22.04.2021
		НовСтрокаДерева.гкс_СпособВыполнения = СтрокаРР.СпособВыполнения;
		// гкс- [Релиз 1] Куст 22.04.2021
		ЗаполнитьЗначенияСвойств(НовСтрокаДерева, ВременнаяСтруктура);
		НовСтрокаДерева.Картинка        		= ИндексКартинкиДереваРемонтныхРабот(Значение);
		Если (ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.торо_АктОВыполненииЭтапаРабот")
			ИЛИ ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.торо_АктОВыполненииРегламентногоМероприятия")) И ТипЗнч(Значение) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
			НовСтрокаДерева.НоваяОперация = Истина;
			НовСтрокаДерева.ПроцентВыполненияРабот = 100;
		КонецЕсли; 
		Если Не НовСтрокаДерева.Владелец().Колонки.Найти("Количество") = Неопределено Тогда
			НовСтрокаДерева.Количество      = Количество * ?(СтрокаРодитель.Количество = 0, 1, СтрокаРодитель.Количество);
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ДокументОбъект.РемонтныеРаботы.Добавить(), НовСтрокаДерева);
		
		ДатаНачалаРемонта = Неопределено;
		ТекущиеЗначения.Свойство("ДатаНачалаРемонта", ДатаНачалаРемонта);
		
		Если (ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.торо_АктОВыполненииРегламентногоМероприятия") 
		  ИЛИ ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.торо_АктОВыполненииЭтапаРабот"))
		  И ТипЗнч(Значение) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
		  
		    СтрокаРемРабот = Новый Структура("ID, РемонтыОборудования_ID, РемонтнаяРабота, Количество", ID, НовСтрокаДерева.РемонтыОборудования_ID, Значение, Количество);
		    ЗаполнитьНормативыРемонтнойРаботы(ДокументОбъект, СтрокаРемРабот, ТехКарта, , НовСтрокаДерева.ID);
		КонецЕсли;
				
		Если ТипЗнч(Значение) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда
			
			ТехКарта = РегистрыСведений.торо_ВерсииТехКарт.ПолучитьВерсиюТехКарты(Значение, ДатаНачалаРемонта);
			
			Если ЗначениеЗаполнено(ТехКарта) Тогда
				Для Каждого ОперацияРемонта Из ТехКарта.СписокОпераций Цикл
					Если ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот") Тогда
						ТекущиеЗначения = Новый Структура("СтрокаРодитель_ID, СтрокаРодительРодитель_ID, СтрокаРодительРемонтыОборудования_ID",НовСтрокаДерева.ID,НовСтрокаДерева.Родитель_ID, НовСтрокаДерева.Предписание_ID);
					Иначе
						Если ТекущиеЗначения.Свойство("ДатаНачалаРемонта") 
							И ЗначениеЗаполнено(ТекущиеЗначения.ДатаНачалаРемонта) Тогда
							ТекущиеЗначения = Новый Структура("СтрокаРодитель_ID, СтрокаРодительРодитель_ID, СтрокаРодительРемонтыОборудования_ID,ДатаНачалаРемонта",НовСтрокаДерева.ID,НовСтрокаДерева.Родитель_ID, НовСтрокаДерева.РемонтыОборудования_ID,ТекущиеЗначения.ДатаНачалаРемонта);
						Иначе
							ТекущиеЗначения = Новый Структура("СтрокаРодитель_ID, СтрокаРодительРодитель_ID, СтрокаРодительРемонтыОборудования_ID",НовСтрокаДерева.ID,НовСтрокаДерева.Родитель_ID, НовСтрокаДерева.РемонтыОборудования_ID);
						КонецЕсли;
					КонецЕсли;

				гкс_ДобавитьСтрокуДереваРемонтов(Дерево, ДокументОбъект, ТекущиеЗначения, ОперацияРемонта.Операция,
						ОперацияРемонта.ID, ТехКарта, ОперацияРемонта.Количество, ОперацияРемонта);
					
     			КонецЦикла;				
			КонецЕсли;
			
		КонецЕсли;
		
		Возврат НовСтрокаДерева;
	КонецЕсли;
	
КонецФункции

&ИзменениеИКонтроль("ПолучитьИсполнителейИзДокументаОснования_Наряд")
Процедура Расш_гкс_ПолучитьИсполнителейИзДокументаОснования_Наряд(ДокументОснование, ЗаполняемыйДокумент, СписокИДРемонтов, СписокИДРемРабот, СписокИДТехКарт, табИсполнителей, табПодрядчиков, табИсполнителейСПодразделениями)

	#Вставка
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот") Тогда
		Условие  = "торо_НарядНаРегламентноеМероприятиеИсполнители.гкс_ВремяРаботы";
	Иначе 
		Условие = "ВЫБОР КОГДА торо_НарядНаРегламентноеМероприятиеИсполнители.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
		| ИЛИ торо_НарядНаРегламентноеМероприятиеИсполнители.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1) ТОГДА 0
		| ИНАЧЕ РАЗНОСТЬДАТ(торо_НарядНаРегламентноеМероприятиеИсполнители.ДатаНачала,
		| торо_НарядНаРегламентноеМероприятиеИсполнители.ДатаОкончания, СЕКУНДА) КОНЕЦ";
	КонецЕсли;
	#КонецВставки
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_НарядНаРегламентноеМероприятиеИсполнители.Ссылка КАК Ссылка,
	|	торо_НарядНаРегламентноеМероприятиеИсполнители.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	торо_НарядНаРегламентноеМероприятиеИсполнители.ID КАК ID,
	|	торо_НарядНаРегламентноеМероприятиеИсполнители.Квалификация КАК Квалификация,
	|	торо_НарядНаРегламентноеМероприятиеИсполнители.ДатаНачала КАК ДатаНачала,
	|	торо_НарядНаРегламентноеМероприятиеИсполнители.ДатаОкончания КАК ДатаОкончания,
	#Удаление
	|	ВЫБОР
	|		КОГДА торо_НарядНаРегламентноеМероприятиеИсполнители.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ торо_НарядНаРегламентноеМероприятиеИсполнители.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА 0
	|		ИНАЧЕ РАЗНОСТЬДАТ(торо_НарядНаРегламентноеМероприятиеИсполнители.ДатаНачала, торо_НарядНаРегламентноеМероприятиеИсполнители.ДатаОкончания, СЕКУНДА)
	|	КОНЕЦ КАК ВремяРаботы,
	#КонецУдаления
	#Вставка
	|	" + Условие + " КАК ВремяРаботы,
	|	торо_НарядНаРегламентноеМероприятиеИсполнители.гкс_Количество КАК гкс_Количество,
	|	торо_НарядНаРегламентноеМероприятиеИсполнители.гкс_СотрудникКонтрагента КАК гкс_СотрудникКонтрагента,
	#КонецВставки
	|	торо_НарядНаРегламентноеМероприятиеИсполнители.Сотрудник КАК Сотрудник,
	|	1 КАК КТУ
	|ПОМЕСТИТЬ ВТ_ТаблицаИсполнителей
	|ИЗ
	|	Документ.торо_НарядНаРегламентноеМероприятие.Исполнители КАК торо_НарядНаРегламентноеМероприятиеИсполнители
	|ГДЕ
	|	торо_НарядНаРегламентноеМероприятиеИсполнители.Ссылка = &Ссылка
	|	И торо_НарядНаРегламентноеМероприятиеИсполнители.РемонтыОборудования_ID В(&РемонтыОборудования_ID)
	|	И торо_НарядНаРегламентноеМероприятиеИсполнители.ID В(&ID)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РемонтыОборудования_ID,
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ВыполняемыеРемонтныеРаботыПоРегламентнымМероприятиямОстатки.IDРемонта КАК IDРемонта,
	|	торо_ВыполняемыеРемонтныеРаботыПоРегламентнымМероприятиямОстатки.IDОперации КАК IDОперации,
	|	торо_ВыполняемыеРемонтныеРаботыПоРегламентнымМероприятиямОстатки.ПроцентРемонтаОстаток КАК ПроцентВыполненный
	|ПОМЕСТИТЬ ВТ_ВыполняемыеРаботыОстатки
	|ИЗ
	|	РегистрНакопления.торо_ВыполняемыеРемонтныеРаботыПоРегламентнымМероприятиям.Остатки(
	|			&Дата,
	|			IDОперации В (&ID)
	|				И IDРемонта В (&РемонтыОборудования_ID)) КАК торо_ВыполняемыеРемонтныеРаботыПоРегламентнымМероприятиямОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта,
	|	IDОперации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ЗапланированныеРемонтныеРаботы.IDРемонта КАК IDРемонта,
	|	торо_ЗапланированныеРемонтныеРаботы.IDОперации КАК IDОперации,
	|	СУММА(торо_ЗапланированныеРемонтныеРаботы.ПроцентРемонта) КАК ПроцентПлановый
	|ПОМЕСТИТЬ ВТ_ЗапланированныеРемонтыОбороты
	|ИЗ
	|	РегистрНакопления.торо_ЗапланированныеРемонтныеРаботы КАК торо_ЗапланированныеРемонтныеРаботы
	|ГДЕ
	|	торо_ЗапланированныеРемонтныеРаботы.Активность
	|	И торо_ЗапланированныеРемонтныеРаботы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И торо_ЗапланированныеРемонтныеРаботы.Период <= &Дата
	|	И торо_ЗапланированныеРемонтныеРаботы.IDРемонта В(&РемонтыОборудования_ID)
	|	И торо_ЗапланированныеРемонтныеРаботы.IDОперации В(&ID)
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_ЗапланированныеРемонтныеРаботы.IDРемонта,
	|	торо_ЗапланированныеРемонтныеРаботы.IDОперации
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта,
	|	IDОперации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_НарядНаРегламентноеМероприятиеРегламентныеМероприятия.ID КАК ID,
	|	торо_НарядНаРегламентноеМероприятиеРегламентныеМероприятия.ДатаНачала КАК ДатаНачала,
	|	торо_НарядНаРегламентноеМероприятиеРегламентныеМероприятия.ДатаОкончания КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТ_ТаблицаРемонтов
	|ИЗ
	|	Документ.торо_НарядНаРегламентноеМероприятие.РегламентныеМероприятия КАК торо_НарядНаРегламентноеМероприятиеРегламентныеМероприятия
	|ГДЕ
	|	торо_НарядНаРегламентноеМероприятиеРегламентныеМероприятия.Ссылка = &Ссылка
	|	И торо_НарядНаРегламентноеМероприятиеРегламентныеМероприятия.ID В(&РемонтыОборудования_ID)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_НарядНаРегламентноеМероприятиеРемонтныеРаботы.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	торо_НарядНаРегламентноеМероприятиеРемонтныеРаботы.ID КАК ID,
	|	торо_НарядНаРегламентноеМероприятиеРемонтныеРаботы.РемонтнаяРабота КАК РемонтнаяРабота,
	|	торо_НарядНаРегламентноеМероприятиеРемонтныеРаботы.Родитель_ID КАК Родитель_ID
	|ПОМЕСТИТЬ ВТ_ТаблицаОпераций
	|ИЗ
	|	Документ.торо_НарядНаРегламентноеМероприятие.РемонтныеРаботы КАК торо_НарядНаРегламентноеМероприятиеРемонтныеРаботы
	|ГДЕ
	|	торо_НарядНаРегламентноеМероприятиеРемонтныеРаботы.Ссылка = &Ссылка
	|	И торо_НарядНаРегламентноеМероприятиеРемонтныеРаботы.РемонтыОборудования_ID В(&РемонтыОборудования_ID)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РемонтыОборудования_ID,
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаОпераций_ТехОперации.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	ВТ_ТаблицаОпераций_ТехОперации.ID КАК ID,
	|	ВТ_ТаблицаОпераций_ТехОперации.РемонтнаяРабота КАК ТехОперация,
	|	ЕСТЬNULL(ВТ_ТаблицаОпераций_ТехКарты.РемонтнаяРабота, НЕОПРЕДЕЛЕНО) КАК ИдТехКарты,
	|	ВТ_ТаблицаРемонтов.ДатаНачала КАК ДатаНачала
	|ПОМЕСТИТЬ ВТ_ТаблицаОперацийСРодителями
	|ИЗ
	|	ВТ_ТаблицаОпераций КАК ВТ_ТаблицаОпераций_ТехОперации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаОпераций КАК ВТ_ТаблицаОпераций_ТехКарты
	|		ПО ВТ_ТаблицаОпераций_ТехОперации.РемонтыОборудования_ID = ВТ_ТаблицаОпераций_ТехКарты.РемонтыОборудования_ID
	|			И ВТ_ТаблицаОпераций_ТехОперации.Родитель_ID = ВТ_ТаблицаОпераций_ТехКарты.ID
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаРемонтов КАК ВТ_ТаблицаРемонтов
	|		ПО ВТ_ТаблицаОпераций_ТехОперации.РемонтыОборудования_ID = ВТ_ТаблицаРемонтов.ID
	|ГДЕ
	|	ВТ_ТаблицаОпераций_ТехОперации.РемонтнаяРабота ССЫЛКА Справочник.торо_ТехнологическиеОперации
	|	И ВТ_ТаблицаОпераций_ТехОперации.ID В(&ID)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаРемонтов.ID КАК ID,
	|	ВТ_ТаблицаРемонтов.ДатаНачала КАК ДатаНачала,
	|	МАКСИМУМ(торо_СтоимостьЧасаКвалификации.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_ДатыСрезаСтоимостиКвалификаций
	|ИЗ
	|	ВТ_ТаблицаРемонтов КАК ВТ_ТаблицаРемонтов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_СтоимостьЧасаКвалификации КАК торо_СтоимостьЧасаКвалификации
	|		ПО ВТ_ТаблицаРемонтов.ДатаНачала >= торо_СтоимостьЧасаКвалификации.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаРемонтов.ДатаНачала,
	|	ВТ_ТаблицаРемонтов.ID
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДатаНачала,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДатыСрезаСтоимостиКвалификаций.ID КАК ID,
	|	ВТ_ДатыСрезаСтоимостиКвалификаций.ДатаНачала КАК ДатаНачала,
	|	торо_СтоимостьЧасаКвалификации.Квалификация КАК Квалификация,
	|	торо_СтоимостьЧасаКвалификации.Валюта КАК Валюта,
	|	торо_СтоимостьЧасаКвалификации.Стоимость КАК Стоимость
	|ПОМЕСТИТЬ ВТ_СтоимостиКвалификаций
	|ИЗ
	|	ВТ_ДатыСрезаСтоимостиКвалификаций КАК ВТ_ДатыСрезаСтоимостиКвалификаций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_СтоимостьЧасаКвалификации КАК торо_СтоимостьЧасаКвалификации
	|		ПО ВТ_ДатыСрезаСтоимостиКвалификаций.Период = торо_СтоимостьЧасаКвалификации.Период
	#Вставка
	// гкс+ [Релиз18] Деснол
	|	Где &Валюта = торо_СтоимостьЧасаКвалификации.Валюта
	// гкс- [Релиз18]
	#КонецВставки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СтоимостиКвалификаций.ID КАК ID,
	|	ВТ_СтоимостиКвалификаций.ДатаНачала КАК ДатаНачала,
	|	ВТ_СтоимостиКвалификаций.Квалификация КАК Квалификация,
	|	ВТ_СтоимостиКвалификаций.Валюта КАК Валюта,
	|	ВТ_СтоимостиКвалификаций.Стоимость КАК Стоимость,
	|	МАКСИМУМ(КурсыВалют.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_ДатыСрезаКурсовВалют
	|ИЗ
	|	ВТ_СтоимостиКвалификаций КАК ВТ_СтоимостиКвалификаций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|		ПО ВТ_СтоимостиКвалификаций.ДатаНачала >= КурсыВалют.Период
	|			И ВТ_СтоимостиКвалификаций.Валюта = КурсыВалют.Валюта
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СтоимостиКвалификаций.ДатаНачала,
	|	ВТ_СтоимостиКвалификаций.Квалификация,
	|	ВТ_СтоимостиКвалификаций.Валюта,
	|	ВТ_СтоимостиКвалификаций.Стоимость,
	|	ВТ_СтоимостиКвалификаций.ID
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Валюта,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДатыСрезаКурсовВалют.ID КАК ID,
	|	ВТ_ДатыСрезаКурсовВалют.ДатаНачала КАК ДатаНачала,
	|	ВТ_ДатыСрезаКурсовВалют.Квалификация КАК Квалификация,
	|	ВТ_ДатыСрезаКурсовВалют.Валюта КАК Валюта,
	|	ВТ_ДатыСрезаКурсовВалют.Стоимость КАК Стоимость,
	|	КурсыВалют.Курс КАК Курс,
	|	КурсыВалют.Кратность КАК Кратность
	|ПОМЕСТИТЬ ВТ_СтоимостиКвалификацийСКурсамиВалют
	|ИЗ
	|	ВТ_ДатыСрезаКурсовВалют КАК ВТ_ДатыСрезаКурсовВалют
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|		ПО ВТ_ДатыСрезаКурсовВалют.Валюта = КурсыВалют.Валюта
	|			И ВТ_ДатыСрезаКурсовВалют.Период = КурсыВалют.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Квалификация,
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ТаблицаОперацийСРодителями.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	ВТ_ТаблицаОперацийСРодителями.ID КАК ID,
	|	ВТ_ТаблицаОперацийСРодителями.ТехОперация КАК ТехОперация,
	|	ВТ_ТаблицаОперацийСРодителями.ИдТехКарты КАК ИдТехКарты,
	|	ВТ_ТаблицаОперацийСРодителями.ДатаНачала КАК ДатаНачала,
	|	МАКСИМУМ(торо_ВерсииТехКарт.Период) КАК ДатаВерсииТехКарты
	|ПОМЕСТИТЬ ВТ_ДатыСрезаТехКарт
	|ИЗ
	|	ВТ_ТаблицаОперацийСРодителями КАК ВТ_ТаблицаОперацийСРодителями
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВерсииТехКарт КАК торо_ВерсииТехКарт
	|		ПО ВТ_ТаблицаОперацийСРодителями.ДатаНачала >= торо_ВерсииТехКарт.Период
	|			И ВТ_ТаблицаОперацийСРодителями.ИдТехКарты >= торо_ВерсииТехКарт.ИдентификаторТехКарты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаОперацийСРодителями.РемонтыОборудования_ID,
	|	ВТ_ТаблицаОперацийСРодителями.ID,
	|	ВТ_ТаблицаОперацийСРодителями.ТехОперация,
	|	ВТ_ТаблицаОперацийСРодителями.ИдТехКарты,
	|	ВТ_ТаблицаОперацийСРодителями.ДатаНачала
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДатаВерсииТехКарты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ДатыСрезаТехКарт.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	ВТ_ДатыСрезаТехКарт.ID КАК ID,
	|	ВТ_ДатыСрезаТехКарт.ТехОперация КАК ТехОперация,
	|	ЕСТЬNULL(торо_ВерсииТехКарт.ТехКарта, НЕОПРЕДЕЛЕНО) КАК ТехКарта
	|ПОМЕСТИТЬ ВТ_ТаблицаОперацийСТехКартами
	|ИЗ
	|	ВТ_ДатыСрезаТехКарт КАК ВТ_ДатыСрезаТехКарт
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВерсииТехКарт КАК торо_ВерсииТехКарт
	|		ПО ВТ_ДатыСрезаТехКарт.ДатаВерсииТехКарты = торо_ВерсииТехКарт.Период
	|			И ВТ_ДатыСрезаТехКарт.ИдТехКарты = торо_ВерсииТехКарт.ИдентификаторТехКарты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТехОперация,
	|	ТехКарта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ТаблицаОперацийСТехКартами.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	ВТ_ТаблицаОперацийСТехКартами.ID КАК ID,
	|	ВТ_ТаблицаОперацийСТехКартами.ТехОперация КАК ТехОперация,
	|	ВТ_ТаблицаОперацийСТехКартами.ТехКарта КАК ТехКарта,
	|	ЕСТЬNULL(торо_ТехКартыТрудовыеЗатраты.ВремяРаботы, торо_ТехнологическиеОперацииТрудовыеЗатраты.ВремяРаботы) КАК ВремяРаботы,
	|	ЕСТЬNULL(торо_ТехКартыТрудовыеЗатраты.Квалификация, торо_ТехнологическиеОперацииТрудовыеЗатраты.Квалификация) КАК Квалификация,
	|	ЕСТЬNULL(торо_ТехКартыТрудовыеЗатраты.Количество, торо_ТехнологическиеОперацииТрудовыеЗатраты.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_ТаблицаНорм
	|ИЗ
	|	ВТ_ТаблицаОперацийСТехКартами КАК ВТ_ТаблицаОперацийСТехКартами
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ТехКарты.ТрудовыеЗатраты КАК торо_ТехКартыТрудовыеЗатраты
	|		ПО ВТ_ТаблицаОперацийСТехКартами.ТехКарта = торо_ТехКартыТрудовыеЗатраты.Ссылка
	|			И ВТ_ТаблицаОперацийСТехКартами.ТехОперация = торо_ТехКартыТрудовыеЗатраты.Операция
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ТехнологическиеОперации.ТрудовыеЗатраты КАК торо_ТехнологическиеОперацииТрудовыеЗатраты
	|		ПО (ВЫБОР
	|				КОГДА торо_ТехКартыТрудовыеЗатраты.Ссылка ЕСТЬ NULL
	|					ТОГДА ВТ_ТаблицаОперацийСТехКартами.ТехОперация = торо_ТехнологическиеОперацииТрудовыеЗатраты.Ссылка
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|ГДЕ
	|	НЕ(торо_ТехКартыТрудовыеЗатраты.Ссылка ЕСТЬ NULL
	|				И торо_ТехнологическиеОперацииТрудовыеЗатраты.Ссылка ЕСТЬ NULL)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РемонтыОборудования_ID,
	|	ID,
	|	Квалификация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаИсполнителей.Ссылка КАК Ссылка,
	|	ВТ_ТаблицаИсполнителей.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	ВТ_ТаблицаИсполнителей.ID КАК ID,
	|	ВТ_ТаблицаИсполнителей.Квалификация КАК Квалификация,
	|	ВТ_ТаблицаИсполнителей.ДатаНачала КАК ДатаНачала,
	|	ВТ_ТаблицаИсполнителей.ДатаОкончания КАК ДатаОкончания,
	|	ВТ_ТаблицаИсполнителей.Сотрудник КАК Сотрудник,
	#Вставка
	|	ВТ_ТаблицаИсполнителей.гкс_Количество КАК гкс_Количество,
	|	ВТ_ТаблицаИсполнителей.гкс_СотрудникКонтрагента КАК гкс_СотрудникКонтрагента,
	#КОнецВставки
	|	ВТ_ТаблицаИсполнителей.КТУ КАК КТУ,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаНорм.ВремяРаботы ЕСТЬ NULL
	|			ТОГДА ВТ_ТаблицаИсполнителей.ВремяРаботы
	|		ИНАЧЕ ВТ_ТаблицаНорм.ВремяРаботы
	|	КОНЕЦ КАК ВремяРаботыПолное,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_ЗапланированныеРемонтыОбороты.ПроцентПлановый, 0) = 0
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(ВТ_ВыполняемыеРаботыОстатки.ПроцентВыполненный, 0) / ВТ_ЗапланированныеРемонтыОбороты.ПроцентПлановый
	|	КОНЕЦ КАК ДоляВыолнения,
	|	ЕСТЬNULL(ВТ_СтоимостиКвалификацийСКурсамиВалют.Стоимость, 0) * ЕСТЬNULL(ВТ_СтоимостиКвалификацийСКурсамиВалют.Курс, 0) / ЕСТЬNULL(ВТ_СтоимостиКвалификацийСКурсамиВалют.Кратность, 1) КАК СтоимостьЧаса
	|ПОМЕСТИТЬ ВТ_ТаблицаРасчетЧастейФормул
	|ИЗ
	|	ВТ_ТаблицаИсполнителей КАК ВТ_ТаблицаИсполнителей
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыполняемыеРаботыОстатки КАК ВТ_ВыполняемыеРаботыОстатки
	|		ПО ВТ_ТаблицаИсполнителей.РемонтыОборудования_ID = ВТ_ВыполняемыеРаботыОстатки.IDРемонта
	|			И ВТ_ТаблицаИсполнителей.ID = ВТ_ВыполняемыеРаботыОстатки.IDОперации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗапланированныеРемонтыОбороты КАК ВТ_ЗапланированныеРемонтыОбороты
	|		ПО ВТ_ТаблицаИсполнителей.РемонтыОборудования_ID = ВТ_ЗапланированныеРемонтыОбороты.IDРемонта
	|			И ВТ_ТаблицаИсполнителей.ID = ВТ_ЗапланированныеРемонтыОбороты.IDОперации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаНорм КАК ВТ_ТаблицаНорм
	|		ПО ВТ_ТаблицаИсполнителей.РемонтыОборудования_ID = ВТ_ТаблицаНорм.РемонтыОборудования_ID
	|			И ВТ_ТаблицаИсполнителей.ID = ВТ_ТаблицаНорм.ID
	|			И ВТ_ТаблицаИсполнителей.Квалификация = ВТ_ТаблицаНорм.Квалификация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтоимостиКвалификацийСКурсамиВалют КАК ВТ_СтоимостиКвалификацийСКурсамиВалют
	|		ПО ВТ_ТаблицаИсполнителей.РемонтыОборудования_ID = ВТ_СтоимостиКвалификацийСКурсамиВалют.ID
	|			И ВТ_ТаблицаИсполнителей.Квалификация = ВТ_СтоимостиКвалификацийСКурсамиВалют.Квалификация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаРасчетЧастейФормул.Ссылка КАК Ссылка,
	|	ВТ_ТаблицаРасчетЧастейФормул.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	ВТ_ТаблицаРасчетЧастейФормул.ID КАК ID,
	|	ВТ_ТаблицаРасчетЧастейФормул.Квалификация КАК Квалификация,
	|	ВТ_ТаблицаРасчетЧастейФормул.ДатаНачала КАК ДатаНачала,
	|	ВТ_ТаблицаРасчетЧастейФормул.ДатаОкончания КАК ДатаОкончания,
	#Вставка
	|	ВТ_ТаблицаРасчетЧастейФормул.гкс_Количество КАК гкс_Количество,
	|	ВТ_ТаблицаРасчетЧастейФормул.гкс_СотрудникКонтрагента КАК гкс_СотрудникКонтрагента,
	#КОнецВставки
	|	ВТ_ТаблицаРасчетЧастейФормул.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаРасчетЧастейФормул.КТУ КАК КТУ,
	|	1 КАК Количество,
	|	ВТ_ТаблицаРасчетЧастейФормул.ВремяРаботыПолное * ВТ_ТаблицаРасчетЧастейФормул.ДоляВыолнения КАК ВремяРаботы,
	|	ВТ_ТаблицаРасчетЧастейФормул.ВремяРаботыПолное * ВТ_ТаблицаРасчетЧастейФормул.ДоляВыолнения * ВТ_ТаблицаРасчетЧастейФормул.СтоимостьЧаса / 3600 КАК СуммаКНачислению
	|ПОМЕСТИТЬ ВТ_ТаблицаИтог
	|ИЗ
	|	ВТ_ТаблицаРасчетЧастейФормул КАК ВТ_ТаблицаРасчетЧастейФормул
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РемонтыОборудования_ID,
	|	ID,
	|	Квалификация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаИтог.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	ВТ_ТаблицаИтог.ID КАК ID,
	|	ВТ_ТаблицаИтог.Квалификация КАК Квалификация,
	#Вставка
	// гкс+ [Релиз18] Деснол
	|	ВТ_ТаблицаИтог.Сотрудник КАК Сотрудник,
	// гкс- [Релиз18]
	#КОнецВставки
	|	СУММА(ВТ_ТаблицаИтог.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_КоличествоСотрудников
	|ИЗ
	|	ВТ_ТаблицаИтог КАК ВТ_ТаблицаИтог
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаИтог.РемонтыОборудования_ID,
	|	ВТ_ТаблицаИтог.ID,
	|	ВТ_ТаблицаИтог.Квалификация
	#Вставка
	// гкс+ [Релиз18] Деснол
	|	,ВТ_ТаблицаИтог.Сотрудник
	// гкс- [Релиз18]
	#КОнецВставки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РемонтыОборудования_ID,
	|	ID,
	|	Квалификация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаИтог.Ссылка КАК Ссылка,
	|	ВТ_ТаблицаИтог.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	ВТ_ТаблицаИтог.ID КАК ID,
	|	ВТ_ТаблицаИтог.Квалификация КАК Квалификация,
	|	ВТ_ТаблицаИтог.ДатаНачала КАК ДатаНачала,
	|	ВТ_ТаблицаИтог.ДатаОкончания КАК ДатаОкончания,
	|	ВТ_ТаблицаИтог.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаИтог.КТУ КАК КТУ,
	#Вставка
	|	ВТ_ТаблицаИтог.гкс_Количество КАК гкс_Количество,
	|	ВТ_ТаблицаИтог.гкс_СотрудникКонтрагента КАК гкс_СотрудникКонтрагента,
	#КОнецВставки
	|	ВТ_ТаблицаИтог.ВремяРаботы КАК ВремяРаботы,
	|	ВТ_ТаблицаИтог.СуммаКНачислению / ВТ_КоличествоСотрудников.Количество КАК СуммаКНачислению
	|ИЗ
	|	ВТ_ТаблицаИтог КАК ВТ_ТаблицаИтог
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КоличествоСотрудников КАК ВТ_КоличествоСотрудников
	|		ПО ВТ_ТаблицаИтог.РемонтыОборудования_ID = ВТ_КоличествоСотрудников.РемонтыОборудования_ID
	|			И ВТ_ТаблицаИтог.ID = ВТ_КоличествоСотрудников.ID
	#Вставка
	// гкс+ [Релиз18] Деснол
	|	И ВТ_ТаблицаИтог.Сотрудник = ВТ_КоличествоСотрудников.Сотрудник
	// гкс- [Релиз18]
	#КОнецВставки
	|			И ВТ_ТаблицаИтог.Квалификация = ВТ_КоличествоСотрудников.Квалификация";


	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	Запрос.УстановитьПараметр("ID", СписокИДРемРабот);
	Запрос.УстановитьПараметр("РемонтыОборудования_ID", СписокИДРемонтов);
	#Вставка
	Если ЗначениеЗаполнено(ЗаполняемыйДокумент.Дата) = Ложь Тогда 
		ТекДата = КонецДня(ТекущаяДата());
		Запрос.УстановитьПараметр("Дата", ТекДата);
	Иначе
	#КонецВставки
	Запрос.УстановитьПараметр("Дата", ЗаполняемыйДокумент.Дата);
	#Вставка
	КонецЕсли;
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот") Тогда 
		Запрос.УстановитьПараметр("Валюта", ПолучитьВалютуНаряда(ДокументОснование));
	Иначе
		Запрос.УстановитьПараметр("Валюта", Константы.ВалютаУправленческогоУчета.Получить());
	КонецЕсли;
	#КонецВставки
	Запрос.УстановитьПараметр("ДатаОснования", ДокументОснование.Дата);

	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.торо_НарядНаРегламентноеМероприятие.РегламентныеМероприятия", "Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтыОборудования");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.торо_НарядНаРегламентноеМероприятие", "Документ.торо_НарядНаВыполнениеРемонтныхРабот");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "РегистрНакопления.торо_ВыполняемыеРемонтныеРаботыПоРегламентнымМероприятиям", "РегистрНакопления.торо_ВыполняемыеРемонтныеРаботы");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ".ПроцентРемонта", ".ПроцентОпераций");
		#Вставка
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТ_ТаблицаНорм.ВремяРаботы", "ВТ_ТаблицаИсполнителей.ВремяРаботы");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТОГДА ВТ_ТаблицаИсполнителей.ВремяРаботы", "ТОГДА ВТ_ТаблицаНорм.ВремяРаботы");
		#КонецВставки
	КонецЕсли;

	Результат = Запрос.Выполнить();
	ВыборкаИсполнителей = Результат.Выбрать();

	Пока ВыборкаИсполнителей.Следующий() Цикл
		НовСтр = табИсполнителей.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаИсполнителей);
	КонецЦикла;

	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот") Тогда

		ЗапросИсполнители = Новый Запрос;
		ЗапросИсполнители.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_НарядНаВыполнениеРемонтныхРаботИсполнителиПоРемонтам.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		|	торо_НарядНаВыполнениеРемонтныхРаботИсполнителиПоРемонтам.Исполнитель КАК Исполнитель,
		|	торо_НарядНаВыполнениеРемонтныхРаботИсполнителиПоРемонтам.УточнениеИсполнителя КАК УточнениеИсполнителя,
		|	торо_НарядНаВыполнениеРемонтныхРаботИсполнителиПоРемонтам.ДатаНачала КАК ДатаНачала,
		|	торо_НарядНаВыполнениеРемонтныхРаботИсполнителиПоРемонтам.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.ИсполнителиПоРемонтам КАК торо_НарядНаВыполнениеРемонтныхРаботИсполнителиПоРемонтам
		|ГДЕ
		|	торо_НарядНаВыполнениеРемонтныхРаботИсполнителиПоРемонтам.Ссылка = &Ссылка
		|	И торо_НарядНаВыполнениеРемонтныхРаботИсполнителиПоРемонтам.РемонтыОборудования_ID В(&РемонтыОборудования_ID)";
		#Вставка
		ЗапросИсполнители.Текст = ЗапросИсполнители.Текст + "
		|	Упорядочить ПО торо_НарядНаВыполнениеРемонтныхРаботИсполнителиПоРемонтам.НомерСтроки ";
		#КонецВставки

		ЗапросИсполнители.УстановитьПараметр("Ссылка", ДокументОснование);
		ЗапросИсполнители.УстановитьПараметр("РемонтыОборудования_ID", СписокИДРемонтов);

		Результат = ЗапросИсполнители.Выполнить();
		ВыборкаИсполнители = Результат.Выбрать();

		Пока ВыборкаИсполнители.Следующий() Цикл
			НовСтр = табИсполнителейСПодразделениями.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаИсполнители);
		КонецЦикла;

	Иначе

		ЗапросПодрядчики = Новый Запрос;
		ЗапросПодрядчики.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_НарядНаРегламентноеМероприятиеПодрядчики.Ссылка КАК Ссылка,
		|	торо_НарядНаРегламентноеМероприятиеПодрядчики.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		|	торо_НарядНаРегламентноеМероприятиеПодрядчики.ID КАК ID,
		|	торо_НарядНаРегламентноеМероприятиеПодрядчики.Контрагент КАК Контрагент,
		|	торо_НарядНаРегламентноеМероприятиеПодрядчики.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	торо_НарядНаРегламентноеМероприятиеПодрядчики.ДатаНачала КАК ДатаНачала,
		|	торо_НарядНаРегламентноеМероприятиеПодрядчики.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	Документ.торо_НарядНаРегламентноеМероприятие.Подрядчики КАК торо_НарядНаРегламентноеМероприятиеПодрядчики
		|ГДЕ
		|	торо_НарядНаРегламентноеМероприятиеПодрядчики.Ссылка = &Ссылка
		|	И торо_НарядНаРегламентноеМероприятиеПодрядчики.РемонтыОборудования_ID В(&РемонтыОборудования_ID)
		|	И торо_НарядНаРегламентноеМероприятиеПодрядчики.ID В(&ID)";

		ЗапросПодрядчики.УстановитьПараметр("Ссылка", ДокументОснование);
		ЗапросПодрядчики.УстановитьПараметр("ID", СписокИДРемРабот);
		ЗапросПодрядчики.УстановитьПараметр("РемонтыОборудования_ID", СписокИДРемонтов);

		Результат = ЗапросПодрядчики.Выполнить();
		ВыборкаПодрядчиков = Результат.Выбрать();

		Пока ВыборкаПодрядчиков.Следующий() Цикл
			НовСтр = табПодрядчиков.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаПодрядчиков);
		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьИсполнителейПоДаннымЗаполненияНаОсновании")
Процедура Расш_гкс_ЗаполнитьИсполнителейПоДаннымЗаполненияНаОсновании(Объект, ДанныеДляЗаполнения)

	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот") Тогда

		УдалитьСтарыеСтрокиИзТаблицыПередЗаполнением(Объект.Исполнители, ДанныеДляЗаполнения.Исполнители, "ID, РемонтыОборудования_ID");

		Для каждого СтрокаДанных Из ДанныеДляЗаполнения.Исполнители Цикл
			КоличествоСтрок = СтрокаДанных.Количество;

			// У сотрудников количество равно 0
			Если КоличествоСтрок <> 0 Тогда
				Для Счетчик = 1 По КоличествоСтрок Цикл 				
					НовСтр = Объект.Исполнители.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр, СтрокаДанных);
					#Вставка
					НовСтр.гкс_ВремяРаботы = СтрокаДанных.ВремяРаботы;
					#КонецВставки
				КонецЦикла;
			Иначе
				НовСтр = Объект.Исполнители.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, СтрокаДанных);
				#Вставка
				НовСтр.гкс_ВремяРаботы = СтрокаДанных.ВремяРаботы;
				#КонецВставки
			КонецЕсли;
		КонецЦикла;

	ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.торо_АктОВыполненииРегламентногоМероприятия") 
		ИЛИ ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.торо_АктОВыполненииЭтапаРабот") Тогда	

		ИспользоватьУсложненнуюСхемуЗакрытияНарядов = Константы.торо_ИспользоватьУсложненнуюСхемуЗакрытияНарядов.Получить();
		СтруктураПоискаОперации = Новый Структура("РемонтыОборудования_ID, ID");

		УдалитьСтарыеСтрокиИзТаблицыПередЗаполнением(Объект.ТрудовыеЗатраты, ДанныеДляЗаполнения.Исполнители, "ID, РемонтыОборудования_ID");

		Для каждого СтрокаДанных Из ДанныеДляЗаполнения.Исполнители Цикл
			КоличествоСтрок = СтрокаДанных.Количество;

			// У сотрудников количество равно 0
			Если КоличествоСтрок <> 0 Тогда
				Для Счетчик = 1 По КоличествоСтрок Цикл
					НовСтр = Объект.ТрудовыеЗатраты.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр, СтрокаДанных);
				КонецЦикла;
			Иначе
				НовСтр = Объект.ТрудовыеЗатраты.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, СтрокаДанных);			
			КонецЕсли;
		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьНормативыРемонтнойРаботы")
Процедура Расш_гкс_ЗаполнитьНормативыРемонтнойРаботы(ДокументОбъект, СтрокаРемонтныхРабот, ТехКартаРемонта, СтруктураСоответствияТЧ, НовСтрока_ID)

	Если ТехКартаРемонта <> Неопределено Тогда

		Если ТипЗнч(ТехКартаРемонта) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
			СтрокаОперации = СтрокаРемонтныхРабот;
		Иначе
			СтрокаОперации = ТехКартаРемонта.СписокОпераций.Найти(СтрокаРемонтныхРабот.ID, "ID");
			Если СтрокаОперации = Неопределено Тогда
				СтрокаОперации = ТехКартаРемонта.СписокОпераций.Найти(СтрокаРемонтныхРабот.РемонтнаяРабота, "Операция");
			КонецЕсли;
		КонецЕсли;

		Если СтрокаОперации <> Неопределено 
			ИЛИ ТипЗнч(СтрокаРемонтныхРабот.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации")
			Тогда

			Если СтруктураСоответствияТЧ = Неопределено Тогда

				СтруктураСоответствияТЧ = Новый Структура;
				СоответствиеЗаполнения = Новый Соответствие();
				СоответствиеЗаполнения.Вставить("ИмяТЧ", "МатериальныеЗатраты");
				СоответствиеЗаполнения.Вставить("Разбивать", Ложь);
				СтруктураСоответствияТЧ.Вставить("МатериальныеЗатраты", СоответствиеЗаполнения);

				СоответствиеЗаполнения = Новый Соответствие();
				СоответствиеЗаполнения.Вставить("ИмяТЧ", "ТрудовыеЗатраты");
				СоответствиеЗаполнения.Вставить("Разбивать", Ложь);
				СтруктураСоответствияТЧ.Вставить("ТрудовыеЗатраты", СоответствиеЗаполнения);

				Если ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") Тогда

					СоответствиеЗаполнения = Новый Соответствие();
					СоответствиеЗаполнения.Вставить("ИмяТЧ", "Инструменты");
					СоответствиеЗаполнения.Вставить("Разбивать", Ложь);
					СтруктураСоответствияТЧ.Вставить("ИнструментыИТехника", СоответствиеЗаполнения);

					Если ТипЗнч(ТехКартаРемонта) <> Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
						СоответствиеЗаполнения = Новый Соответствие();
						СоответствиеЗаполнения.Вставить("ИмяТЧ", "МерыБезопасности");
						СоответствиеЗаполнения.Вставить("Разбивать", Ложь);
						СтруктураСоответствияТЧ.Вставить("МерыБезопасности", СоответствиеЗаполнения);
					КонецЕсли;

				КонецЕсли;

			КонецЕсли; 

			Для Каждого КлючИЗначение Из СтруктураСоответствияТЧ Цикл

				Если СтрокаОперации <> Неопределено 
					И ТипЗнч(ТехКартаРемонта) <> Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда // берем из тех. карты
					СтруктураПоиска = Новый Структура("ID", СтрокаОперации.ID);
					МассивСтрокНормативов = ТехКартаРемонта[КлючИЗначение.Ключ].НайтиСтроки(СтруктураПоиска);
				Иначе // берем напрямую из тех. операции
					Если КлючИЗначение.Ключ = "МерыБезопасности" Тогда
						Продолжить; // В тех. операциях нет такой ТЧ.
					КонецЕсли;
					МассивСтрокНормативов = СтрокаРемонтныхРабот.РемонтнаяРабота[КлючИЗначение.Ключ];
				КонецЕсли;

				Если КлючИЗначение.Значение.Получить("Разбивать") = Ложь Тогда // Не нужно разбивать строки по количеству

					Для Каждого ЭлементМассива Из МассивСтрокНормативов Цикл

						НовСтрокаТЧ    = ДокументОбъект[КлючИЗначение.Значение.Получить("ИмяТЧ")].Добавить();

						ЗаполнитьЗначенияСвойств(НовСтрокаТЧ, ЭлементМассива);

						Если ЗначениеЗаполнено(НовСтрока_ID) Тогда
							НовСтрокаТЧ.ID = НовСтрока_ID;
						Иначе 
							НовСтрокаТЧ.ID = СтрокаРемонтныхРабот.ID;
						КонецЕсли;
						НовСтрокаТЧ.РемонтыОборудования_ID = СтрокаРемонтныхРабот.РемонтыОборудования_ID;

						Если КлючИЗначение.Значение.Получить("ИмяТЧ") = "МатериальныеЗатраты" тогда
							Если СтрокаОперации <> Неопределено 
								И ТипЗнч(ТехКартаРемонта) <> Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда 

								НовСтрокаТЧ.ЕдиницаИзмерения = ЭлементМассива.Упаковка;
								НовСтрокаТЧ.Количество = ЭлементМассива.КоличествоУпаковок;
								НовСтрокаТЧ.КоличествоЕдиниц = ЭлементМассива.КоличествоНаЕдиницу;
								НовСтрокаТЧ.ХарактеристикаНоменклатуры = ЭлементМассива.Характеристика;

							Иначе
								НовСтрокаТЧ.ЕдиницаИзмерения = ЭлементМассива.Упаковка;
								Коэффициент = НовСтрокаТЧ.ЕдиницаИзмерения.Коэффициент;
								НовСтрокаТЧ.ХарактеристикаНоменклатуры = ЭлементМассива.Характеристика;
								//НовСтрокаТЧ.ХарактеристикиИспользуются = ЭлементМассива.Номенклатура.ИспользованиеХарактеристик = ;
								Если Коэффициент = 0 Тогда
									Коэффициент = 1;
								КонецЕсли;
								Если ТипЗнч(ТехКартаРемонта) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
									НовСтрокаТЧ.КоличествоЕдиниц = ЭлементМассива.КоличествоУпаковок * Коэффициент * СтрокаРемонтныхРабот.Количество;
									НовСтрокаТЧ.Количество = ЭлементМассива.КоличествоУпаковок * СтрокаРемонтныхРабот.Количество;
								Иначе
									НовСтрокаТЧ.КоличествоЕдиниц = ЭлементМассива.КоличествоУпаковок * Коэффициент;
								КонецЕсли;
							КонецЕсли;

						ИначеЕсли КлючИЗначение.Значение.Получить("ИмяТЧ") = "ТрудовыеЗатраты" Тогда

							Если ТипЗнч(ТехКартаРемонта) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
								НовСтрокаТЧ.ВремяРаботы = НовСтрокаТЧ.ВремяРаботы * СтрокаРемонтныхРабот.Количество;
							КонецЕсли;

						КонецЕсли;

					КонецЦикла;

				ИначеЕсли КлючИЗначение.Значение.Получить("Разбивать") = Истина Тогда // Надо добавить нужное количество строк

					Для Каждого ЭлементМассива Из МассивСтрокНормативов Цикл

						Для Сч = 1 По ЭлементМассива.Количество Цикл

							НовСтрокаТЧ    = ДокументОбъект[КлючИЗначение.Значение.Получить("ИмяТЧ")].Добавить();
							ЗаполнитьЗначенияСвойств(НовСтрокаТЧ, ЭлементМассива);
							Если ЗначениеЗаполнено(НовСтрока_ID) Тогда
								НовСтрокаТЧ.ID = НовСтрока_ID;
							Иначе
								НовСтрокаТЧ.ID = СтрокаРемонтныхРабот.ID;
							КонецЕсли;
							НовСтрокаТЧ.РемонтыОборудования_ID = СтрокаРемонтныхРабот.РемонтыОборудования_ID;
							Если КлючИЗначение.Значение.Получить("ИмяТЧ") = "ТрудовыеЗатраты" Тогда
								//И ТипЗнч(ТехКартаРемонта) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
								НовСтрокаТЧ.ВремяРаботы = НовСтрокаТЧ.ВремяРаботы * СтрокаРемонтныхРабот.Количество;
								НовСтрокаТЧ.КТУ = 1;
							КонецЕсли;

							#Вставка
							Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.торо_НарядНаВыполнениеРемонтныхРабот") 
								или ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.торо_НарядНаРегламентноеМероприятие") Тогда
								НовСтрокаТЧ.гкс_ВремяРаботы = ЭлементМассива.ВремяРаботы * СтрокаРемонтныхРабот.Количество;
							КонецЕсли;
							#КонецВставки
						КонецЦикла; 

					КонецЦикла;

				КонецЕсли; 

			КонецЦикла; 

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьИсполнителейПоНормам")
Процедура Расш_гкс_ЗаполнитьИсполнителейПоНормам(Форма, ИДТекущейОперации, ИДТекущегоРемонта, ИмяТЧ)

	СтруктураТаблиц = Новый Структура("ТрудовыеЗатраты");

	МассивДанныхЗаполнения = ПолучитьДанныеДляЗаполненияЗатратПоНормам(Форма, СтруктураТаблиц, ИДТекущейОперации, ИДТекущегоРемонта);

	Для каждого СтруктураДанныхЗаполнения из МассивДанныхЗаполнения Цикл 
		Если СтруктураДанныхЗаполнения.СтруктураТаблиц.ТрудовыеЗатраты = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		ТаблицаДляСвертки = СтруктураДанныхЗаполнения.СтруктураТаблиц.ТрудовыеЗатраты.Скопировать();
		ТаблицаДляСвертки.Свернуть("ID");
		СтруктураПоиска = Новый Структура("ID, РемонтыОборудования_ID");

		Для каждого СтрокаИД из ТаблицаДляСвертки Цикл
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаИД);
			СтруктураПоиска.РемонтыОборудования_ID = СтруктураДанныхЗаполнения.РемонтыОборудования_ID;
			МассивСтрок = Форма.Объект[ИмяТЧ].НайтиСтроки(СтруктураПоиска);
			Для каждого СтрокаКУдалению из МассивСтрок Цикл
				Форма.Объект[ИмяТЧ].Удалить(СтрокаКУдалению);
			КонецЦикла;
		КонецЦикла;

		Для каждого СтрокаНормы из СтруктураДанныхЗаполнения.СтруктураТаблиц.ТрудовыеЗатраты Цикл
			КоличествоСтрок = Макс(1, СтрокаНормы.Количество);
			Для Инд = 1 по КоличествоСтрок Цикл
				НовСтр = Форма.Объект[ИмяТЧ].Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, СтрокаНормы);
				НовСтр.ID = СтруктураДанныхЗаполнения.ID;
				НовСтр.РемонтыОборудования_ID = СтруктураДанныхЗаполнения.РемонтыОборудования_ID;
				НовСтр.ДатаНачала = СтруктураДанныхЗаполнения.ДатаНачала;
				НовСтр.ДатаОкончания = СтруктураДанныхЗаполнения.ДатаОкончания;
				Если ИмяТЧ = "ТрудовыеЗатраты" Тогда
					НовСтр.КТУ = 1;
				КонецЕсли;
				#Вставка
				Если ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот") 
					или ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.торо_НарядНаРегламентноеМероприятие") Тогда
					НовСтр.гкс_ВремяРаботы = СтрокаНормы.ВремяРаботы * СтрокаНормы.Количество;
				КонецЕсли;
				#КонецВставки
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

&ИзменениеИКонтроль("ПолучитьИсполнителейИзДокументаОснования")
Процедура Расш_гкс_ПолучитьИсполнителейИзДокументаОснования(ДокументОснование, ЗаполняемыйДокумент, СписокИДРемонтов, СписокИДРемРабот, СписокИДТехКарт, табИсполнителей, табПодрядчиков, табИсполнителейСПодразделениями)

	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.торо_ГрафикРегламентныхМероприятийТОиР") 
		ИЛИ ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.торо_ПланГрафикРемонта") Тогда

		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов.Ссылка КАК Ссылка,
		|	торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов.ID КАК РемонтыОборудования_ID,
		|	торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов.Исполнитель КАК Контрагент,
		|	торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов.ДатаНач КАК ДатаНачала,
		|	торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов.ДатаКон КАК ДатаОкончания,
		|	1 КАК Количество
		|ИЗ
		|	Документ.торо_ГрафикРегламентныхМероприятийТОиР.ПланРемонтов КАК торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов
		|ГДЕ
		|	торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов.Ссылка = &Ссылка
		|	И торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов.ID В(&ID)";


		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.торо_ПланГрафикРемонта") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.торо_ГрафикРегламентныхМероприятийТОиР", "Документ.торо_ПланГрафикРемонта");
		КонецЕсли;

		Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
		Запрос.УстановитьПараметр("ID", СписокИДРемонтов);

		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();

		стрПоиска = Новый Структура("ID", "");
		тзРР = ЗаполняемыйДокумент.РемонтныеРаботы.Выгрузить();
		тзРР.Индексы.Добавить("ID");

		Пока Выборка.Следующий() Цикл
			Если НЕ ЗначениеЗаполнено(Выборка.Контрагент) Тогда
				Продолжить;
			КонецЕсли;

			Если ТипЗнч(Выборка.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда

				Для каждого ИДТехКарты из СписокИДТехКарт Цикл

					Если ТипЗнч(ИДТехКарты) = Тип("Строка") Тогда
						стрПоиска.ID = ИДТехКарты;
					Иначе
						стрПоиска.ID = ИДТехКарты.ID;
					КонецЕсли;

					масСтрок = тзРР.НайтиСтроки(стрПоиска);
					Для каждого текСтрока из масСтрок Цикл
						Если ТипЗнч(текСтрока.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда
							НовСтр = табПодрядчиков.Добавить();
							ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
							НовСтр.ID = стрПоиска.ID;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			КонецЕсли;

			НовСтр = табИсполнителейСПодразделениями.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
			НовСтр.Исполнитель = Выборка.Контрагент;
		КонецЦикла;

	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.торо_НарядНаРегламентноеМероприятие") 
		ИЛИ ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот")	Тогда

		ПолучитьИсполнителейИзДокументаОснования_Наряд(ДокументОснование, ЗаполняемыйДокумент, СписокИДРемонтов, СписокИДРемРабот, СписокИДТехКарт, табИсполнителей, табПодрядчиков, табИсполнителейСПодразделениями);

	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") Тогда

		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ЗаявкаНаРемонтТрудовыеЗатраты.Ссылка КАК Ссылка,
		|	торо_ЗаявкаНаРемонтТрудовыеЗатраты.ID КАК ID,
		|	торо_ЗаявкаНаРемонтТрудовыеЗатраты.ВремяРаботы КАК ВремяРаботы,
		|	торо_ЗаявкаНаРемонтТрудовыеЗатраты.Квалификация КАК Квалификация,
		|	торо_ЗаявкаНаРемонтТрудовыеЗатраты.Количество КАК Количество,
		|	торо_ЗаявкаНаРемонтТрудовыеЗатраты.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		|	1 КАК КТУ,
		#Удаление
		|	торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаНачала КАК ДатаНачала,
		|	торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаОкончания КАК ДатаОкончания
		#КонецУдаления
		#Вставка
		|	ЕстьNull(РегДат.ДатаНачала, торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаНачала) КАК ДатаНачала,
		|	ЕстьNull(РегДат.ДатаОкончания, торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаОкончания) КАК ДатаОкончания
		#КОнецВставки
		|ИЗ
		|	Документ.торо_ЗаявкаНаРемонт.ТрудовыеЗатраты КАК торо_ЗаявкаНаРемонтТрудовыеЗатраты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК торо_ЗаявкаНаРемонтРемонтыОборудования
		#Вставка
		|	Левое соединение РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК РегДат
		|	ПО РегДат.IDРемонта = торо_ЗаявкаНаРемонтРемонтыОборудования.ID
		#КонецВставки
		|		ПО (торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка = торо_ЗаявкаНаРемонтТрудовыеЗатраты.Ссылка
		|			И торо_ЗаявкаНаРемонтРемонтыОборудования.ID = торо_ЗаявкаНаРемонтТрудовыеЗатраты.РемонтыОборудования_ID)
		|ГДЕ
		|	торо_ЗаявкаНаРемонтТрудовыеЗатраты.Ссылка = &Ссылка
		|	И торо_ЗаявкаНаРемонтТрудовыеЗатраты.РемонтыОборудования_ID В(&РемонтыОборудования_ID)
		|	И торо_ЗаявкаНаРемонтТрудовыеЗатраты.ID В(&ID)
		#Вставка
		|	Упорядочить по торо_ЗаявкаНаРемонтТрудовыеЗатраты.НомерСтроки
		#КонецВставки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ЗаявкаНаРемонтИсполнителиРемонтныхРабот.Ссылка КАК Ссылка,
		|	торо_ЗаявкаНаРемонтИсполнителиРемонтныхРабот.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		|	торо_ЗаявкаНаРемонтИсполнителиРемонтныхРабот.Исполнитель КАК Исполнитель,
		|	торо_ЗаявкаНаРемонтИсполнителиРемонтныхРабот.УточнениеИсполнителя КАК УточнениеИсполнителя,
		#Удаление
		|	торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаНачала КАК ДатаНачала,
		|	торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаОкончания КАК ДатаОкончания
		#КонецУдаления
		#Вставка
		|	ЕстьNull(РегДат.ДатаНачала, торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаНачала) КАК ДатаНачала,
		|	ЕстьNull(РегДат.ДатаОкончания, торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаОкончания) КАК ДатаОкончания
		#КОнецВставки
		|ИЗ
		|	Документ.торо_ЗаявкаНаРемонт.ИсполнителиПоРемонтам КАК торо_ЗаявкаНаРемонтИсполнителиРемонтныхРабот
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК торо_ЗаявкаНаРемонтРемонтыОборудования
		#Вставка
		|	Левое соединение РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК РегДат
		|	ПО РегДат.IDРемонта = торо_ЗаявкаНаРемонтРемонтыОборудования.ID
		#КонецВставки
		|		ПО (торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка = торо_ЗаявкаНаРемонтИсполнителиРемонтныхРабот.Ссылка
		|			И торо_ЗаявкаНаРемонтРемонтыОборудования.ID = торо_ЗаявкаНаРемонтИсполнителиРемонтныхРабот.РемонтыОборудования_ID)
		|ГДЕ
		|	торо_ЗаявкаНаРемонтИсполнителиРемонтныхРабот.Ссылка = &Ссылка
		|	И торо_ЗаявкаНаРемонтИсполнителиРемонтныхРабот.РемонтыОборудования_ID В(&РемонтыОборудования_ID)";
		#Вставка
		Запрос.Текст = Запрос.Текст + "
		|	Упорядочить по торо_ЗаявкаНаРемонтИсполнителиРемонтныхРабот.НомерСтроки ";
		#КонецВставки

		Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
		Запрос.УстановитьПараметр("РемонтыОборудования_ID", СписокИДРемонтов);
		Запрос.УстановитьПараметр("ID", СписокИДРемРабот);

		Результат = Запрос.ВыполнитьПакет();
		ВыборкаТрудозатрат = Результат[0].Выбрать();
		ВыборкаИсполнителей = Результат[1].Выбрать();

		Пока ВыборкаТрудозатрат.Следующий() Цикл
			Если ТипЗнч(ЗаполняемыйДокумент.Ссылка) <> Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот") Тогда
				// от задвоения 
				Для Счетчик = 1 По ВыборкаТрудозатрат.Количество Цикл
					НовСтр = табИсполнителей.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаТрудозатрат);
				КонецЦикла; 
			Иначе
				НовСтр = табИсполнителей.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаТрудозатрат);
			КонецЕсли; 
		КонецЦикла;

		Пока ВыборкаИсполнителей.Следующий() Цикл
			Если ЗначениеЗаполнено(ВыборкаИсполнителей.Исполнитель) Тогда
				НовСтр = табИсполнителейСПодразделениями.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаИсполнителей);
			КонецЕсли;
		КонецЦикла;

	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.торо_ВыявленныеДефекты") Тогда

		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	торо_ВыявленныеДефектыСписокДефектов.Ссылка КАК Ссылка,
		|	торо_ВыявленныеДефектыСписокДефектов.ID КАК РемонтыОборудования_ID,
		|	торо_ВыявленныеДефектыСписокДефектов.ПодразделениеИсполнитель КАК Исполнитель
		|ИЗ
		|	Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов
		|ГДЕ
		|	торо_ВыявленныеДефектыСписокДефектов.Ссылка = &Ссылка
		|	И торо_ВыявленныеДефектыСписокДефектов.ID В(&ID)";

		Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
		Запрос.УстановитьПараметр("ID", СписокИДРемонтов);

		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();

		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка.Исполнитель) Тогда
				НовСтр = табИсполнителейСПодразделениями.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
			КонецЕсли;
		КонецЦикла;

	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот") Тогда

		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ОбследованноеОборудование.Ссылка КАК Ссылка,
		|	ОбследованноеОборудование.ID КАК РемонтыОборудования_ID,
		|	ОбследованноеОборудование.Исполнитель КАК Исполнитель
		|ИЗ
		|	Документ.торо_ВнешнееОснованиеДляРабот.ОбследованноеОборудование КАК ОбследованноеОборудование
		|ГДЕ
		|	ОбследованноеОборудование.Ссылка = &Ссылка
		|	И ОбследованноеОборудование.ID В(&ID)";

		Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
		Запрос.УстановитьПараметр("ID", СписокИДРемонтов);

		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();

		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка.Исполнитель) Тогда
				НовСтр = табИсполнителейСПодразделениями.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
			КонецЕсли;
		КонецЦикла;	

	КонецЕсли;

КонецПроцедуры

&ИзменениеИКонтроль("ПолучитьДанныеДляЗаполненияПоОснованиюИзДокументов")
Функция Расш_гкс_ПолучитьДанныеДляЗаполненияПоОснованиюИзДокументов(МассивДокументовОснований, ЗаполняемыйДокумент, СписокИДРемонтов, СписокИДРемРабот, СписокИДТехКарт, КомандаЗаполнения)

	СтруктураДанных = Новый Структура;

	Если КомандаЗаполнения = "Исполнители" Тогда
		табИсполнителей = Новый ТаблицаЗначений;
		табИсполнителей.Колонки.Добавить("РемонтыОборудования_ID");
		табИсполнителей.Колонки.Добавить("ID");
		табИсполнителей.Колонки.Добавить("Квалификация");
		табИсполнителей.Колонки.Добавить("ДатаНачала");
		табИсполнителей.Колонки.Добавить("ДатаОкончания");
		табИсполнителей.Колонки.Добавить("Сотрудник");
		#Вставка
		табИсполнителей.Колонки.Добавить("гкс_Количество");
		табИсполнителей.Колонки.Добавить("гкс_СотрудникКонтрагента");
		#КонецВставки
		табИсполнителей.Колонки.Добавить("КТУ");
		табИсполнителей.Колонки.Добавить("ВремяРаботы", Новый ОписаниеТипов("Число"));
		табИсполнителей.Колонки.Добавить("СуммаКНачислению", Новый ОписаниеТипов("Число"));
		табИсполнителей.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));

		табПодрядчиков = Новый ТаблицаЗначений;
		табПодрядчиков.Колонки.Добавить("РемонтыОборудования_ID");
		табПодрядчиков.Колонки.Добавить("ID");
		табПодрядчиков.Колонки.Добавить("Контрагент");
		табПодрядчиков.Колонки.Добавить("ДоговорКонтрагента");
		табПодрядчиков.Колонки.Добавить("ДатаНачала");
		табПодрядчиков.Колонки.Добавить("ДатаОкончания");

		табИсполнителейСПодразделениями = Новый ТаблицаЗначений;
		табИсполнителейСПодразделениями.Колонки.Добавить("РемонтыОборудования_ID");
		табИсполнителейСПодразделениями.Колонки.Добавить("Исполнитель");
		табИсполнителейСПодразделениями.Колонки.Добавить("УточнениеИсполнителя");
		табИсполнителейСПодразделениями.Колонки.Добавить("ДатаНачала");
		табИсполнителейСПодразделениями.Колонки.Добавить("ДатаОкончания");

		Для каждого ДокументОснование из МассивДокументовОснований Цикл
			ПолучитьИсполнителейИзДокументаОснования(ДокументОснование, ЗаполняемыйДокумент, СписокИДРемонтов, СписокИДРемРабот, СписокИДТехКарт, табИсполнителей, табПодрядчиков, табИсполнителейСПодразделениями);	
		КонецЦикла;

		#Удаление
		табИсполнителей.Свернуть("РемонтыОборудования_ID, ID, Квалификация, ДатаНачала, ДатаОкончания, Сотрудник, КТУ, ВремяРаботы, СуммаКНачислению, Количество");
		#КонецУдаления
		#Вставка
		табИсполнителей.Свернуть("РемонтыОборудования_ID, ID, Квалификация, ДатаНачала, ДатаОкончания, Сотрудник, "
			+ "КТУ, ВремяРаботы, СуммаКНачислению, Количество, гкс_Количество, гкс_СотрудникКонтрагента");
		#КонецВставки
		табПодрядчиков.Свернуть("РемонтыОборудования_ID, ID, Контрагент, ДоговорКонтрагента, ДатаНачала, ДатаОкончания");
		табИсполнителейСПодразделениями.Свернуть("РемонтыОборудования_ID, Исполнитель, УточнениеИсполнителя, ДатаНачала, ДатаОкончания");

		СтруктураДанных.Вставить("Исполнители", табИсполнителей);
		СтруктураДанных.Вставить("Подрядчики", табПодрядчиков);
		СтруктураДанных.Вставить("ИсполнителиСПодразделениями", табИсполнителейСПодразделениями);


	ИначеЕсли КомандаЗаполнения = "Материалы" Тогда
		табМатериалов = Новый ТаблицаЗначений;
		табМатериалов.Колонки.Добавить("РемонтыОборудования_ID");
		табМатериалов.Колонки.Добавить("ID");
		табМатериалов.Колонки.Добавить("ЕдиницаИзмерения");
		табМатериалов.Колонки.Добавить("Количество");
		табМатериалов.Колонки.Добавить("Номенклатура");
		табМатериалов.Колонки.Добавить("ХарактеристикаНоменклатуры");
		табМатериалов.Колонки.Добавить("ХарактеристикиИспользуются");
		табМатериалов.Колонки.Добавить("Сумма");
		табМатериалов.Колонки.Добавить("КоличествоЕдиниц");
		#Вставка
		табМатериалов.Колонки.Добавить("гкс_Давальческие");
		#КонецВставки

		Для каждого ДокументОснование из МассивДокументовОснований Цикл
			ПолучитьМатериалыИзДокументаОснования(ДокументОснование, СписокИДРемонтов, СписокИДРемРабот, табМатериалов);
		КонецЦикла;

		СтруктураДанных.Вставить("Материалы", табМатериалов);

	ИначеЕсли КомандаЗаполнения = "Запчасти" Тогда
		табЗапчастей = Новый ТаблицаЗначений;
		табЗапчастей.Колонки.Добавить("РемонтыОборудования_ID");

		табЗапчастей.Колонки.Добавить("Номенклатура");
		табЗапчастей.Колонки.Добавить("ХарактеристикаНоменклатуры");
		табЗапчастей.Колонки.Добавить("Количество");
		табЗапчастей.Колонки.Добавить("ЕдиницаИзмерения");

		табЗапчастей.Колонки.Добавить("НоменклатураНовая");
		табЗапчастей.Колонки.Добавить("ХарактеристикаНоменклатурыНовая");
		табЗапчастей.Колонки.Добавить("КоличествоНовое");
		табЗапчастей.Колонки.Добавить("ЕдиницаИзмеренияНовая");

		Для каждого ДокументОснование из МассивДокументовОснований Цикл
			ПолучитьЗапчастиИзДокументаОснования(ДокументОснование, СписокИДРемонтов, табЗапчастей);
		КонецЦикла;

		СтруктураДанных.Вставить("Запчасти", табЗапчастей);
	КонецЕсли;

	Возврат СтруктураДанных;

КонецФункции

&ИзменениеИКонтроль("ПолучитьМатериалыИзДокументаОснования")
Процедура Расш_гкс_ПолучитьМатериалыИзДокументаОснования(ДокументОснование, СписокИДРемонтов, СписокИДРемРабот, табМатериалов)

	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") Тогда

		// Вариант с регистром торо_ПлановыеМатериальныеЗатратыРемонтныхРабот не подходит, так как в нем нет упаковок.
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ЗаявкаНаРемонтМатериальныеЗатраты.Ссылка КАК Ссылка,
		|	торо_ЗаявкаНаРемонтМатериальныеЗатраты.ID КАК ID,
		|	торо_ЗаявкаНаРемонтМатериальныеЗатраты.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	торо_ЗаявкаНаРемонтМатериальныеЗатраты.Количество КАК Количество,
		#Вставка
		|	торо_ЗаявкаНаРемонтМатериальныеЗатраты.гкс_Давальческие КАК гкс_Давальческие,
		#КонецВставки
		|	торо_ЗаявкаНаРемонтМатериальныеЗатраты.Номенклатура КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА торо_ЗаявкаНаРемонтМатериальныеЗатраты.Номенклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ХарактеристикиИспользуются,
		|	торо_ЗаявкаНаРемонтМатериальныеЗатраты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	торо_ЗаявкаНаРемонтМатериальныеЗатраты.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		|	торо_ЗаявкаНаРемонтМатериальныеЗатраты.КоличествоЕдиниц КАК КоличествоЕдиниц
		|ИЗ
		|	Документ.торо_ЗаявкаНаРемонт.МатериальныеЗатраты КАК торо_ЗаявкаНаРемонтМатериальныеЗатраты
		|ГДЕ
		|	торо_ЗаявкаНаРемонтМатериальныеЗатраты.Ссылка = &Ссылка
		|	И торо_ЗаявкаНаРемонтМатериальныеЗатраты.РемонтыОборудования_ID В(&РемонтыОборудования_ID)
		|	И торо_ЗаявкаНаРемонтМатериальныеЗатраты.ID В(&ID)";

		Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
		Запрос.УстановитьПараметр("РемонтыОборудования_ID", СписокИДРемонтов);
		Запрос.УстановитьПараметр("ID", СписокИДРемРабот);

		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();

		Пока Выборка.Следующий() Цикл
			НовСтр = табМатериалов.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
		КонецЦикла;		
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот") Тогда

		Для каждого СтрокаОснования из ДокументОснование.ДокументыОснования Цикл
			ПолучитьМатериалыИзДокументаОснования(СтрокаОснования.ДокументОснование, СписокИДРемонтов, СписокИДРемРабот, табМатериалов);
		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

Функция ПолучитьВалютуНаряда(ДокументОснование)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_НарядНаВыполнениеРемонтныхРабот.Организация.гкс_ВидЦены.ВалютаЦены КАК Валюта
		|ИЗ
		|	Документ.торо_НарядНаВыполнениеРемонтныхРабот КАК торо_НарядНаВыполнениеРемонтныхРабот
		|ГДЕ
		|	торо_НарядНаВыполнениеРемонтныхРабот.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Валюта;
	КонецЦикла;
	Возврат Константы.ВалютаУправленческогоУчета.Получить();
КонецФункции

// гкс+ [] Деснол 16.08.2022
&ИзменениеИКонтроль("ПостроитьДиаграммуГантаДляППР")
Процедура гкс_ПостроитьДиаграммуГантаДляППР(Диаграмма, ТаблицаДанныхППР, СтруктураИерархии, ОтображатьИерархию, ИспользоватьИерархию, РезультатЗапроса, ЭтоКорректировка, Редактировать, ИспользоватьРасшифровку, ДиаграммаДляОтчета, СортироватьПоНаименованию)

	//////////////////////////////////////////////////////
	ТекДата = ТекущаяДата();

	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Булево"));

	ОписаниеТ = новый ОписаниеТипов(МассивТипов);

	ЕстьЦепочки = ТаблицаДанныхППР.Колонки.Найти("Цепочка") <> Неопределено;

	Если ТаблицаДанныхППР.Колонки.Найти("ЕстьВЗ") = Неопределено Тогда
		ТаблицаДанныхППР.Колонки.Добавить("ЕстьВЗ",ОписаниеТ);
		ТаблицаДанныхППР.ЗаполнитьЗначения(Ложь,"ЕстьВЗ");
	КонецЕсли;

	Если ТаблицаДанныхППР.Колонки.Найти("ЕстьДвиженияПоВЗ") = Неопределено Тогда
		ТаблицаДанныхППР.Колонки.Добавить("ЕстьДвиженияПоВЗ",ОписаниеТ);
		ТаблицаДанныхППР.ЗаполнитьЗначения(Ложь,"ЕстьДвиженияПоВЗ");
	КонецЕсли;

	Если ТаблицаДанныхППР.Колонки.Найти("ID") = Неопределено Тогда
		ТаблицаДанныхППР.Колонки.Добавить("ID",Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(36)));
		ТаблицаДанныхППР.ЗаполнитьЗначения("","ID");
	КонецЕсли;

	Диаграмма.Очистить();
	Диаграмма.АвтоОпределениеПолногоИнтервала = Ложь;

	СерияРемонт = Диаграмма.Серии.Добавить();
	СерияРемонт.Текст = "График ремонта";

	ЦветВыполненого 			= WebЦвета.Черный;
	ЦветИзмененного 			= WebЦвета.Томатный;
	ЦветОтмененного 			= WebЦвета.Красный;
	ЦветЗапланированного 		= WebЦвета.Васильковый;
	ЦветЗамещенногоИсходного 	= WebЦвета.СеребристоСерый;
	ЦветИсходного 				= WebЦвета.ГолубойСоСтальнымОттенком;
	ЦветЗамещенного 			= WebЦвета.СветлоСерый;

	СтруктураЦветов = Новый Структура("ЦветИсходного, ЦветВыполненого, ЦветИзмененного, ЦветОтмененного, ЦветЗамещенного, ЦветЗапланированного, ЦветЗамещенногоИсходного");
	СтруктураЦветов.ЦветВыполненого 			= WebЦвета.Черный;
	СтруктураЦветов.ЦветИзмененного 			= WebЦвета.Томатный;
	СтруктураЦветов.ЦветОтмененного 			= WebЦвета.Красный;
	СтруктураЦветов.ЦветЗапланированного 		= WebЦвета.Васильковый;
	СтруктураЦветов.ЦветЗамещенногоИсходного 	= WebЦвета.СеребристоСерый;
	СтруктураЦветов.ЦветИсходного 				= WebЦвета.ГолубойСоСтальнымОттенком;
	СтруктураЦветов.ЦветЗамещенного 			= WebЦвета.СветлоСерый;


	Запрос = Новый Запрос;
	Если Не ОтображатьИерархию И НЕ ИспользоватьИерархию Тогда

		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаДанныхППР.ОбъектРемонтныхРабот,
		|	ТаблицаДанныхППР.ВидРемонтныхРабот,
		|	ТаблицаДанныхППР.ДокументППР,
		|	ТаблицаДанныхППР.ID,
		|	ТаблицаДанныхППР.ДатаНач,
		|	ТаблицаДанныхППР.ДатаКон,
		|	ТаблицаДанныхППР.ДатаНачСт,
		|	ТаблицаДанныхППР.ДатаКонСт,
		|	ТаблицаДанныхППР.ЕстьВЗ,
		|  ТаблицаДанныхППР.Отменен,
		|  ТаблицаДанныхППР.Замещен,
		|  ТаблицаДанныхППР.ЗамещенСт,
		|	ТаблицаДанныхППР.ЕстьДвиженияПоВЗ,
		|	ТаблицаДанныхППР.ДоступенДляРедактирования ";
		Если НЕ СортироватьПоНаименованию Тогда
			Запрос.Текст = Запрос.Текст + ", ТаблицаДанныхППР.НомерОР";
		КонецЕсли;
		Если ЕстьЦепочки Тогда
			Запрос.Текст = Запрос.Текст + ", ТаблицаДанныхППР.Цепочка, ТаблицаДанныхППР.НомерСтрокиВРЦепочки";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|ПОМЕСТИТЬ ТаблицаДанныхППР
		|ИЗ
		|	&ТаблицаДанныхППР КАК ТаблицаДанныхППР
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаДанныхППР.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
		|	ТаблицаДанныхППР.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
		|	ТаблицаДанныхППР.ДокументППР,
		|	ТаблицаДанныхППР.ID,
		|	ТаблицаДанныхППР.ДатаНач КАК ДатаНач,
		|	ТаблицаДанныхППР.ДатаКон КАК ДатаКон,
		|	ТаблицаДанныхППР.ДатаНачСт,
		|	ТаблицаДанныхППР.ДатаКонСт,
		|	ПРЕДСТАВЛЕНИЕ(ТаблицаДанныхППР.ОбъектРемонтныхРабот),
		|	ПРЕДСТАВЛЕНИЕ(ТаблицаДанныхППР.ВидРемонтныхРабот),
		|	ТаблицаДанныхППР.ЕстьВЗ,
		|	ТаблицаДанныхППР.ЕстьДвиженияПоВЗ,
		|	ТаблицаДанныхППР.Отменен,
		|  ТаблицаДанныхППР.ЗамещенСт,
		|  ТаблицаДанныхППР.Замещен,
		|	ТаблицаДанныхППР.ДоступенДляРедактирования ";
		Если НЕ СортироватьПоНаименованию Тогда
			Запрос.Текст = Запрос.Текст + ", ТаблицаДанныхППР.НомерОР";
		КонецЕсли;
		Если ЕстьЦепочки Тогда
			Запрос.Текст = Запрос.Текст + ", ТаблицаДанныхППР.Цепочка, ТаблицаДанныхППР.НомерСтрокиВРЦепочки";
		КонецЕсли;

		Запрос.Текст = Запрос.Текст + "
		|ИЗ
		|	ТаблицаДанныхППР КАК ТаблицаДанныхППР
		|ГДЕ ДатаНач > ДАТАВРЕМЯ(1,1,1,0,0,0) ";
		Если СортироватьПоНаименованию Тогда
			Если ЕстьЦепочки Тогда
				Запрос.Текст = Запрос.Текст + "
				|УПОРЯДОЧИТЬ ПО
				|	ОбъектРемонтныхРабот.Наименование,
				|	НомерСтрокиВРЦепочки,
				|	ВидРемонтныхРабот.Наименование,
				|	ДатаНач,
				|	ДатаКон ";
			Иначе
				Запрос.Текст = Запрос.Текст + "
				|УПОРЯДОЧИТЬ ПО
				|	ОбъектРемонтныхРабот.Наименование,
				|	ВидРемонтныхРабот.Наименование,
				|	ДатаНач,
				|	ДатаКон ";
			КонецЕсли;
		Иначе
			Если ЕстьЦепочки Тогда
				Запрос.Текст = Запрос.Текст + "
				|УПОРЯДОЧИТЬ ПО
				|	НомерОР,
				|	ВидРемонтныхРабот.Наименование,
				|	НомерСтрокиВРЦепочки";
			Иначе
				Запрос.Текст = Запрос.Текст + "
				|УПОРЯДОЧИТЬ ПО
				|	НомерОР,
				|	ВидРемонтныхРабот.Наименование";
			КонецЕсли;
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|ИТОГИ ПО
		|	ОбъектРемонтныхРабот";
		Если ЕстьЦепочки Тогда
			Запрос.Текст = Запрос.Текст + ", НомерСтрокиВРЦепочки";
		КонецЕсли;

		Запрос.Текст = Запрос.Текст + ", ВидРемонтныхРабот";

		Запрос.УстановитьПараметр("ТаблицаДанныхППР", ТаблицаДанныхППР);

		Результат = Запрос.Выполнить();

		ВыборкаПоОР = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоОР.Следующий() Цикл

			ТочкаОРР = Диаграмма.Точки.Добавить();
			ТочкаОРР.Текст = ВыборкаПоОР.ОбъектРемонтныхРаботПредставление;
			Если ИспользоватьРасшифровку Тогда
				ТочкаОРР.Расшифровка = ВыборкаПоОР.ОбъектРемонтныхРабот;
			КонецЕсли;

			ВыборкаПоВРИлиЦепочкам = ВыборкаПоОР.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоВРИлиЦепочкам.Следующий() Цикл

				Если ЕстьЦепочки Тогда
					ВыборкаПоВР = ВыборкаПоВРИлиЦепочкам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

					Пока ВыборкаПоВР.Следующий() Цикл
						ВывестиЧастьГрафикаПервыйВариант(ВыборкаПоВР, ВыборкаПоОР, ТекДата, ТочкаОРР, СерияРемонт, Диаграмма, СтруктураЦветов, ИспользоватьРасшифровку, ЭтоКорректировка,Редактировать);
					КонецЦикла;

				Иначе
					ВыборкаПоВР = ВыборкаПоВРИлиЦепочкам;					
					ВывестиЧастьГрафикаПервыйВариант(ВыборкаПоВР, ВыборкаПоОР, ТекДата, ТочкаОРР, СерияРемонт, Диаграмма, СтруктураЦветов, ИспользоватьРасшифровку, ЭтоКорректировка,Редактировать);

				КонецЕсли;	
			КонецЦикла;

		КонецЦикла;

	ИначеЕсли Не ЗначениеЗаполнено(СтруктураИерархии) И НЕ ИспользоватьИерархию Тогда


		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаДанныхППР.ОбъектРемонтныхРабот,
		|	ТаблицаДанныхППР.ВидРемонтныхРабот,
		|	ТаблицаДанныхППР.ID,
		|	ТаблицаДанныхППР.ДатаНач,
		|	ТаблицаДанныхППР.ДатаКон,
		|	ТаблицаДанныхППР.ДатаНачСт,
		|	ТаблицаДанныхППР.ДатаКонСт,
		|	ТаблицаДанныхППР.ЕстьВЗ,
		|	ТаблицаДанныхППР.ЕстьДвиженияПоВЗ,
		|  ТаблицаДанныхППР.Отменен,
		|  ТаблицаДанныхППР.Замещен,
		|  ТаблицаДанныхППР.ЗамещенСт,
		|	ТаблицаДанныхППР.ДоступенДляРедактирования ";
		Если НЕ СортироватьПоНаименованию Тогда
			Запрос.Текст = Запрос.Текст + ", ТаблицаДанныхППР.НомерОР";
		КонецЕсли;
		Если ЕстьЦепочки Тогда
			Запрос.Текст = Запрос.Текст + ", ТаблицаДанныхППР.Цепочка, ТаблицаДанныхППР.НомерСтрокиВРЦепочки";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|ПОМЕСТИТЬ ТаблицаДанныхППР
		|ИЗ
		|	&ТаблицаДанныхППР КАК ТаблицаДанныхППР
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаДанныхППР.ОбъектРемонтныхРабот.Родитель КАК Положение,
		|	ТаблицаДанныхППР.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
		|	ТаблицаДанныхППР.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
		|	ТаблицаДанныхППР.ID,
		|	ТаблицаДанныхППР.ДатаНач КАК ДатаНач,
		|	ТаблицаДанныхППР.ДатаКон КАК ДатаКон,
		|	ТаблицаДанныхППР.ДатаНачСт,
		|	ТаблицаДанныхППР.ДатаКонСт,
		|	ПРЕДСТАВЛЕНИЕ(ТаблицаДанныхППР.ОбъектРемонтныхРабот),
		|	ПРЕДСТАВЛЕНИЕ(ТаблицаДанныхППР.ВидРемонтныхРабот),
		|	ТаблицаДанныхППР.ЕстьВЗ,
		|	ТаблицаДанныхППР.ЕстьДвиженияПоВЗ,
		|  ТаблицаДанныхППР.Отменен,
		|  ТаблицаДанныхППР.Замещен,
		|  ТаблицаДанныхППР.ЗамещенСт,
		|	ТаблицаДанныхППР.ДоступенДляРедактирования ";
		Если НЕ СортироватьПоНаименованию Тогда
			Запрос.Текст = Запрос.Текст + ", ТаблицаДанныхППР.НомерОР";
		КонецЕсли;
		Если ЕстьЦепочки Тогда
			Запрос.Текст = Запрос.Текст + ", ТаблицаДанныхППР.Цепочка, ТаблицаДанныхППР.НомерСтрокиВРЦепочки";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|ИЗ
		|	ТаблицаДанныхППР КАК ТаблицаДанныхППР
		|ГДЕ ДатаНач > ДАТАВРЕМЯ(1,1,1,0,0,0) ";
		Если СортироватьПоНаименованию Тогда
			Если ЕстьЦепочки Тогда
				Запрос.Текст = Запрос.Текст + "
				|УПОРЯДОЧИТЬ ПО
				|	ОбъектРемонтныхРабот.Наименование,
				|	НомерСтрокиВРЦепочки,
				|	ВидРемонтныхРабот.Наименование,
				|	ДатаНач,
				|	ДатаКон ";
			Иначе
				Запрос.Текст = Запрос.Текст + "
				|УПОРЯДОЧИТЬ ПО
				|	ОбъектРемонтныхРабот.Наименование,
				|	ВидРемонтныхРабот.Наименование,
				|	ДатаНач,
				|	ДатаКон ";
			КонецЕсли;
		Иначе
			Если ЕстьЦепочки Тогда
				Запрос.Текст = Запрос.Текст + "
				|УПОРЯДОЧИТЬ ПО
				|	НомерОР,
				|	ВидРемонтныхРабот.Наименование,
				|	НомерСтрокиВРЦепочки";
			Иначе
				Запрос.Текст = Запрос.Текст + "
				|УПОРЯДОЧИТЬ ПО
				|	НомерОР,
				|	ВидРемонтныхРабот.Наименование";
			КонецЕсли;
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|ИТОГИ ПО
		|	Положение,
		|	ОбъектРемонтныхРабот";
		Если ЕстьЦепочки Тогда
			Запрос.Текст = Запрос.Текст + ", НомерСтрокиВРЦепочки";
		КонецЕсли;

		Запрос.Текст = Запрос.Текст + ", ВидРемонтныхРабот";

		Запрос.УстановитьПараметр("ТаблицаДанныхППР", ТаблицаДанныхППР);
		Запрос.УстановитьПараметр("СтруктураИерархии", СтруктураИерархии);

		Результат = Запрос.Выполнить();

		ВыборкаПоПоложению = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоПоложению.Следующий() Цикл

			ТочкаПоложение = Диаграмма.Точки.Добавить();
			ТочкаПоложение.Текст = СокрЛП(ВыборкаПоПоложению.Положение);
			Если ИспользоватьРасшифровку Тогда
				ТочкаПоложение.Расшифровка = ВыборкаПоПоложению.Положение;
			КонецЕсли;

			ВыборкаПоОР = ВыборкаПоПоложению.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоОР.Следующий() Цикл

				ТочкаОРР = ТочкаПоложение.Точки.Добавить();
				ТочкаОРР.Текст = ВыборкаПоОР.ОбъектРемонтныхРаботПредставление;
				Если ИспользоватьРасшифровку Тогда
					ТочкаОРР.Расшифровка = ВыборкаПоОР.ОбъектРемонтныхРабот;
				КонецЕсли;

				ВыборкаПоВРИлиЦепочкам = ВыборкаПоОР.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаПоВРИлиЦепочкам.Следующий() Цикл

					Если ЕстьЦепочки Тогда
						ВыборкаПоВР = ВыборкаПоВРИлиЦепочкам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаПоВР.Следующий() Цикл
							ВывестиЧастьГрафикаВторойВариант(ВыборкаПоВР, ВыборкаПоОр, ТекДата, ТочкаОРР, ТочкаПоложение, СерияРемонт, Диаграмма, СтруктураЦветов, ИспользоватьРасшифровку, ЭтоКорректировка, Редактировать);
						КонецЦикла;

					Иначе
						ВыборкаПоВР = ВыборкаПоВРИлиЦепочкам; 						
						ВывестиЧастьГрафикаВторойВариант(ВыборкаПоВР, ВыборкаПоОр, ТекДата, ТочкаОРР, ТочкаПоложение, СерияРемонт, Диаграмма, СтруктураЦветов, ИспользоватьРасшифровку, ЭтоКорректировка, Редактировать);
					КонецЕсли;	

				КонецЦикла;

			КонецЦикла;

		КонецЦикла;

	ИначеЕсли НЕ ИспользоватьИерархию И СтруктураИерархии.ИзменяетсяДокументами Тогда


		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаДанныхППР.ОбъектРемонтныхРабот,
		|	ТаблицаДанныхППР.ВидРемонтныхРабот,
		|	ТаблицаДанныхППР.ID,
		|	ТаблицаДанныхППР.ДатаНач,
		|	ТаблицаДанныхППР.ДатаКон,
		|	ТаблицаДанныхППР.ДатаНачСт,
		|	ТаблицаДанныхППР.ДатаКонСт,
		|	ТаблицаДанныхППР.ЕстьВЗ,
		|	ТаблицаДанныхППР.ЕстьДвиженияПоВЗ,
		|  ТаблицаДанныхППР.Отменен,
		|  ТаблицаДанныхППР.Замещен,
		|  ТаблицаДанныхППР.ЗамещенСт,
		|	ТаблицаДанныхППР.ДоступенДляРедактирования ";
		Если НЕ СортироватьПоНаименованию Тогда
			Запрос.Текст = Запрос.Текст + ", ТаблицаДанныхППР.НомерОР";
		КонецЕсли;
		Если ЕстьЦепочки Тогда
			Запрос.Текст = Запрос.Текст + ", ТаблицаДанныхППР.Цепочка, ТаблицаДанныхППР.НомерСтрокиВРЦепочки";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|ПОМЕСТИТЬ ТаблицаДанныхППР
		|ИЗ
		|	&ТаблицаДанныхППР КАК ТаблицаДанныхППР
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ИерархическиеСтруктурыОР.РодительИерархии КАК Положение,
		|	торо_ИерархическиеСтруктурыОР.ОбъектИерархии
		|ПОМЕСТИТЬ ТаблицаСтруктуры
		|ИЗ
		#Удаление
		|	РегистрСведений.торо_ИерархическиеСтруктурыОР КАК торо_ИерархическиеСтруктурыОР
		#КонецУдаления
		#Вставка
		|	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних() КАК торо_ИерархическиеСтруктурыОР
		#КонецВставки
		|ГДЕ
		|	торо_ИерархическиеСтруктурыОР.СтруктураИерархии = &СтруктураИерархии
		#Вставка
		|	И торо_ИерархическиеСтруктурыОР.Удален = Ложь
		#КонецВставки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаДанныхППР.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
		|	ТаблицаДанныхППР.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
		|	ТаблицаДанныхППР.ID,
		|	ТаблицаДанныхППР.ДатаНач КАК ДатаНач,
		|	ТаблицаДанныхППР.ДатаКон КАК ДатаКон,
		|	ТаблицаДанныхППР.ДатаНачСт,
		|	ТаблицаДанныхППР.ДатаКонСт,
		|	ПРЕДСТАВЛЕНИЕ(ТаблицаДанныхППР.ОбъектРемонтныхРабот),
		|	ПРЕДСТАВЛЕНИЕ(ТаблицаДанныхППР.ВидРемонтныхРабот),
		|	ЕСТЬNULL(ТаблицаСтруктуры.Положение, НЕОПРЕДЕЛЕНО) КАК Положение,
		|	ПРЕДСТАВЛЕНИЕ(ТаблицаСтруктуры.Положение) КАК ПоложениеПредставление,
		|	ТаблицаДанныхППР.ЕстьВЗ,
		|	ТаблицаДанныхППР.ЕстьДвиженияПоВЗ,
		|  ТаблицаДанныхППР.Отменен,
		|  ТаблицаДанныхППР.Замещен,
		|  ТаблицаДанныхППР.ЗамещенСт,
		|	ТаблицаДанныхППР.ДоступенДляРедактирования ";
		Если НЕ СортироватьПоНаименованию Тогда
			Запрос.Текст = Запрос.Текст + ", ТаблицаДанныхППР.НомерОР";
		КонецЕсли;
		Если ЕстьЦепочки Тогда
			Запрос.Текст = Запрос.Текст + ", ТаблицаДанныхППР.Цепочка, ТаблицаДанныхППР.НомерСтрокиВРЦепочки";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|ИЗ
		|	ТаблицаДанныхППР КАК ТаблицаДанныхППР
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСтруктуры КАК ТаблицаСтруктуры
		|		ПО ТаблицаДанныхППР.ОбъектРемонтныхРабот = ТаблицаСтруктуры.ОбъектИерархии
		|ГДЕ ДатаНач > ДАТАВРЕМЯ(1,1,1,0,0,0) ";
		Если СортироватьПоНаименованию Тогда
			Если ЕстьЦепочки Тогда
				Запрос.Текст = Запрос.Текст + "
				|УПОРЯДОЧИТЬ ПО
				|	ОбъектРемонтныхРабот.Наименование,
				|	НомерСтрокиВРЦепочки,
				|	ВидРемонтныхРабот.Наименование,
				|	ДатаНач,
				|	ДатаКон ";
			Иначе
				Запрос.Текст = Запрос.Текст + "
				|УПОРЯДОЧИТЬ ПО
				|	ОбъектРемонтныхРабот.Наименование,
				|	ВидРемонтныхРабот.Наименование,
				|	ДатаНач,
				|	ДатаКон ";
			КонецЕсли;
		Иначе
			Если ЕстьЦепочки Тогда
				Запрос.Текст = Запрос.Текст + "
				|УПОРЯДОЧИТЬ ПО
				|	НомерОР,
				|	ВидРемонтныхРабот.Наименование,
				|	НомерСтрокиВРЦепочки";
			Иначе
				Запрос.Текст = Запрос.Текст + "
				|УПОРЯДОЧИТЬ ПО
				|	НомерОР, 
				|	ВидРемонтныхРабот.Наименование";
			КонецЕсли;
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|ИТОГИ ПО
		|	Положение,
		|	ОбъектРемонтныхРабот";
		Если ЕстьЦепочки Тогда
			Запрос.Текст = Запрос.Текст + ", НомерСтрокиВРЦепочки";
		КонецЕсли;

		Запрос.Текст = Запрос.Текст + ", ВидРемонтныхРабот";

		Запрос.УстановитьПараметр("ТаблицаДанныхППР", ТаблицаДанныхППР);
		Запрос.УстановитьПараметр("СтруктураИерархии", СтруктураИерархии);

		Результат = Запрос.Выполнить();

		ВыборкаПоПоложению = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоПоложению.Следующий() Цикл

			ТочкаПоложение = Диаграмма.Точки.Добавить();
			ТочкаПоложение.Текст = СокрЛП(ВыборкаПоПоложению.Положение);
			Если ИспользоватьРасшифровку Тогда
				ТочкаПоложение.Расшифровка = ВыборкаПоПоложению.Положение;
			КонецЕсли;

			ВыборкаПоОР = ВыборкаПоПоложению.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоОР.Следующий() Цикл

				ТочкаОРР = ТочкаПоложение.Точки.Добавить();
				ТочкаОРР.Текст = ВыборкаПоОР.ОбъектРемонтныхРаботПредставление;
				Если ИспользоватьРасшифровку Тогда
					ТочкаОРР.Расшифровка = ВыборкаПоОР.ОбъектРемонтныхРабот;
				КонецЕсли;

				ВыборкаПоВРИлиЦепочкам = ВыборкаПоОР.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаПоВРИлиЦепочкам.Следующий() Цикл

					Если ЕстьЦепочки Тогда
						ВыборкаПоВР = ВыборкаПоВРИлиЦепочкам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаПоВР.Следующий() Цикл
							ВывестиЧастьГрафикаТретийВариант(ВыборкаПоВР, ВыборкаПоОр, ТекДата, ТочкаОРР, ТочкаПоложение, СерияРемонт, Диаграмма, СтруктураЦветов, ИспользоватьРасшифровку, ЭтоКорректировка, Редактировать);
						КонецЦикла;

					Иначе
						ВыборкаПоВР = ВыборкаПоВРИлиЦепочкам;						
						ВывестиЧастьГрафикаТретийВариант(ВыборкаПоВР, ВыборкаПоОр, ТекДата, ТочкаОРР, ТочкаПоложение, СерияРемонт, Диаграмма, СтруктураЦветов, ИспользоватьРасшифровку, ЭтоКорректировка, Редактировать);

					КонецЕсли;


				КонецЦикла;

			КонецЦикла;

		КонецЦикла;

	ИначеЕсли ИспользоватьИерархию Тогда

		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаДанныхППР.ОбъектРемонтныхРабот,
		|	ТаблицаДанныхППР.ВидРемонтныхРабот,
		|	ТаблицаДанныхППР.ДокументППР,
		|	ТаблицаДанныхППР.ID,
		|	ТаблицаДанныхППР.ДатаНач,
		|	ТаблицаДанныхППР.ДатаКон,
		|	ТаблицаДанныхППР.ДатаНачСт,
		|	ТаблицаДанныхППР.ДатаКонСт,
		|	ТаблицаДанныхППР.ЕстьВЗ,
		|	ТаблицаДанныхППР.ЕстьДвиженияПоВЗ,
		|  ТаблицаДанныхППР.Отменен,
		|  ТаблицаДанныхППР.Замещен,
		|  ТаблицаДанныхППР.ЗамещенСт,
		|	ТаблицаДанныхППР.ДоступенДляРедактирования ";
		Если НЕ СортироватьПоНаименованию Тогда
			Запрос.Текст = Запрос.Текст + ", ТаблицаДанныхППР.НомерОР";
		КонецЕсли;
		Если ЕстьЦепочки Тогда
			Запрос.Текст = Запрос.Текст + ", ТаблицаДанныхППР.Цепочка, ТаблицаДанныхППР.НомерСтрокиВРЦепочки";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|ПОМЕСТИТЬ ТаблицаДанныхППР
		|ИЗ
		|	&ТаблицаДанныхППР КАК ТаблицаДанныхППР
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаДанныхППР.ОбъектРемонтныхРабот.Родитель КАК Родитель,
		|	ТаблицаДанныхППР.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
		|	ТаблицаДанныхППР.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
		|	ТаблицаДанныхППР.ДокументППР,
		|	ТаблицаДанныхППР.ID,
		|	ТаблицаДанныхППР.ДатаНач КАК ДатаНач,
		|	ТаблицаДанныхППР.ДатаКон КАК ДатаКон,
		|	ТаблицаДанныхППР.ДатаНачСт,
		|	ТаблицаДанныхППР.ДатаКонСт,
		|	ПРЕДСТАВЛЕНИЕ(ТаблицаДанныхППР.ОбъектРемонтныхРабот),
		|	ПРЕДСТАВЛЕНИЕ(ТаблицаДанныхППР.ВидРемонтныхРабот),
		|	ТаблицаДанныхППР.ЕстьВЗ,
		|	ТаблицаДанныхППР.ЕстьДвиженияПоВЗ,
		|  ТаблицаДанныхППР.Отменен,
		|  ТаблицаДанныхППР.Замещен,
		|  ТаблицаДанныхППР.ЗамещенСт,
		|	ТаблицаДанныхППР.ДоступенДляРедактирования ";
		Если НЕ СортироватьПоНаименованию Тогда
			Запрос.Текст = Запрос.Текст + ", ТаблицаДанныхППР.НомерОР";
		КонецЕсли;
		Если ЕстьЦепочки Тогда
			Запрос.Текст = Запрос.Текст + ", ТаблицаДанныхППР.Цепочка, ТаблицаДанныхППР.НомерСтрокиВРЦепочки";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|ИЗ
		|	ТаблицаДанныхППР КАК ТаблицаДанныхППР
		|ГДЕ ДатаНач > ДАТАВРЕМЯ(1,1,1,0,0,0) ";
		Если СортироватьПоНаименованию Тогда
			Если ЕстьЦепочки Тогда
				Запрос.Текст = Запрос.Текст + "
				|УПОРЯДОЧИТЬ ПО
				|	ОбъектРемонтныхРабот.Наименование,
				|	НомерСтрокиВРЦепочки,
				|	ВидРемонтныхРабот.Наименование,
				|	ДатаНач,
				|	ДатаКон ";
			Иначе
				Запрос.Текст = Запрос.Текст + "
				|УПОРЯДОЧИТЬ ПО
				|	ОбъектРемонтныхРабот.Наименование,
				|	ВидРемонтныхРабот.Наименование,
				|	ДатаНач,
				|	ДатаКон ";
			КонецЕсли;
		Иначе
			Если ЕстьЦепочки Тогда
				Запрос.Текст = Запрос.Текст + "
				|УПОРЯДОЧИТЬ ПО
				|	НомерОР,
				|   ВидРемонтныхРабот.Наименование,
				|	НомерСтрокиВРЦепочки";
			Иначе
				Запрос.Текст = Запрос.Текст + "
				|УПОРЯДОЧИТЬ ПО
				| НомерОР,
				| ВидРемонтныхРабот.Наименование";
			КонецЕсли;
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|ИТОГИ ПО
		|	ОбъектРемонтныхРабот ИЕРАРХИЯ";

		Если ЕстьЦепочки Тогда
			Запрос.Текст = Запрос.Текст + ", НомерСтрокиВРЦепочки";
		КонецЕсли;

		Запрос.Текст = Запрос.Текст + ", ВидРемонтныхРабот";

		Запрос.УстановитьПараметр("ТаблицаДанныхППР", ТаблицаДанныхППР);

		Результат = Запрос.Выполнить();

		ВыборкаПоПоложению = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

		ТаблицаОбъектовРемонта = Новый ТаблицаЗначений();
		ТаблицаОбъектовРемонта.Колонки.Добавить("РодительОбъекта");
		ТаблицаОбъектовРемонта.Колонки.Добавить("СамОбъект");  		

		Пока ВыборкаПоПоложению.Следующий() Цикл 			

			Если ТаблицаОбъектовРемонта.Найти(ВыборкаПоПоложению.Родитель, "СамОбъект") = Неопределено Тогда
				ТочкаПоложение = Диаграмма.Точки.Добавить();
				ТочкаПоложение.Текст = СокрЛП(ВыборкаПоПоложению.ОбъектРемонтныхРабот);
				ТочкаПоложение.Расшифровка = ВыборкаПоПоложению.ОбъектРемонтныхРабот;

				СтрокаТаблицы = ТаблицаОбъектовРемонта.Добавить();
				СтрокаТаблицы.РодительОбъекта = ТочкаПоложение;
				СтрокаТаблицы.СамОбъект = ВыборкаПоПоложению.ОбъектРемонтныхРабот;
			Иначе
				ТочкаПоложение = ТаблицаОбъектовРемонта.Найти(ВыборкаПоПоложению.Родитель, "СамОбъект").РодительОбъекта.Точки.Добавить();
				ТочкаПоложение.Текст = СокрЛП(ВыборкаПоПоложению.ОбъектРемонтныхРабот);
				ТочкаПоложение.Расшифровка = ВыборкаПоПоложению.ОбъектРемонтныхРабот;

				СтрокаТаблицы = ТаблицаОбъектовРемонта.Добавить();
				СтрокаТаблицы.РодительОбъекта = ТочкаПоложение;
				СтрокаТаблицы.СамОбъект = ВыборкаПоПоложению.ОбъектРемонтныхРабот;
			КонецЕсли;

			ВыборкаПоОР = ВыборкаПоПоложению.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоОР.Следующий() Цикл 						
				ТочкаОРР = ТочкаПоложение.Точки.Добавить();
				ТочкаОРР.Текст = ВыборкаПоОР.ВидРемонтныхРабот;
				ТочкаОРР.Расшифровка = ВыборкаПоОР.ВидРемонтныхРабот;

				Если ЭтоКорректировка Тогда
					// корректировка
					ТочкаВРРСт = ТочкаОРР.Точки.Добавить();
					ТочкаВРРСт.Текст = "План до корректировки";
					ТочкаВРРСт.Расшифровка = ВыборкаПоВР.ВидРемонтныхРабот;
					//
				КонецЕсли;

				ВыборкаПоВРИлиЦепочкам = ВыборкаПоОР.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	


				Пока ВыборкаПоВРИлиЦепочкам.Следующий() Цикл

					Если ЕстьЦепочки Тогда
						ВыборкаПоВР = ВыборкаПоВРИлиЦепочкам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаПоВР.Следующий() Цикл  								
							ВывестиЧастьГрафикаЧетвертыйВариант(ВыборкаПоВР, ВыборкаПоОр, ТекДата, ТочкаОРР, ТочкаПоложение, ТочкаВРРСт, СерияРемонт, Диаграмма, СтруктураЦветов, ИспользоватьРасшифровку, ЭтоКорректировка, Редактировать);
						КонецЦикла;
					Иначе
						ВыборкаПоВР = ВыборкаПоВРИлиЦепочкам;				
						ВывестиЧастьГрафикаЧетвертыйВариант(ВыборкаПоВР, ВыборкаПоОр, ТекДата, ТочкаОРР, ТочкаПоложение, ТочкаВРРСт, СерияРемонт, Диаграмма, СтруктураЦветов, ИспользоватьРасшифровку, ЭтоКорректировка, Редактировать);

					КонецЕсли;

				КонецЦикла; 
			КонецЦикла; 

		КонецЦикла;

	Иначе

		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаДанныхППР.ОбъектРемонтныхРабот,
		|	ТаблицаДанныхППР.ВидРемонтныхРабот,
		|	ТаблицаДанныхППР.ID,
		|	ТаблицаДанныхППР.ДатаНач,
		|	ТаблицаДанныхППР.ДатаКон,
		|	ТаблицаДанныхППР.ДатаНачСт,
		|	ТаблицаДанныхППР.ДатаКонСт,
		|	ТаблицаДанныхППР.ЕстьВЗ,
		|	ТаблицаДанныхППР.ЕстьДвиженияПоВЗ,
		|  ТаблицаДанныхППР.Отменен,
		|  ТаблицаДанныхППР.Замещен,
		|  ТаблицаДанныхППР.ЗамещенСт,
		|	ТаблицаДанныхППР.ДоступенДляРедактирования ";
		Если НЕ СортироватьПоНаименованию Тогда
			Запрос.Текст = Запрос.Текст + ", ТаблицаДанныхППР.НомерОР";
		КонецЕсли;
		Если ЕстьЦепочки Тогда
			Запрос.Текст = Запрос.Текст + ", ТаблицаДанныхППР.Цепочка, ТаблицаДанныхППР.НомерСтрокиВРЦепочки";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|ПОМЕСТИТЬ ТаблицаДанныхППР
		|ИЗ
		|	&ТаблицаДанныхППР КАК ТаблицаДанныхППР
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ИерархическиеСтруктурыОР.РодительИерархии КАК Положение,
		|	торо_ИерархическиеСтруктурыОР.ОбъектИерархии
		|ПОМЕСТИТЬ ТаблицаСтруктуры
		|ИЗ
		|	РегистрСведений.торо_ИерархическиеСтруктурыОР КАК торо_ИерархическиеСтруктурыОР
		|ГДЕ
		|	торо_ИерархическиеСтруктурыОР.СтруктураИерархии = &СтруктураИерархии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(ТаблицаСтруктуры.Положение, НЕОПРЕДЕЛЕНО) КАК Положение,
		|	ТаблицаДанныхППР.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
		|	ТаблицаДанныхППР.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
		|	ТаблицаДанныхППР.ID,
		|	ТаблицаДанныхППР.ДатаНач КАК ДатаНач,
		|	ТаблицаДанныхППР.ДатаКон КАК ДатаКон,
		|	ТаблицаДанныхППР.ДатаНачСт,
		|	ТаблицаДанныхППР.ДатаКонСт,
		|	ТаблицаСтруктуры.Положение.Представление КАК ПоложениеПредставление,
		|	ПРЕДСТАВЛЕНИЕ(ТаблицаДанныхППР.ОбъектРемонтныхРабот),
		|	ПРЕДСТАВЛЕНИЕ(ТаблицаДанныхППР.ВидРемонтныхРабот),
		|	ТаблицаДанныхППР.ЕстьВЗ,
		|	ТаблицаДанныхППР.ЕстьДвиженияПоВЗ,
		|  ТаблицаДанныхППР.Отменен,
		|  ТаблицаДанныхППР.Замещен,
		|  ТаблицаДанныхППР.ЗамещенСт,
		|	ТаблицаДанныхППР.ДоступенДляРедактирования ";
		Если НЕ СортироватьПоНаименованию Тогда
			Запрос.Текст = Запрос.Текст + ", ТаблицаДанныхППР.НомерОР";
		КонецЕсли;
		Если ЕстьЦепочки Тогда
			Запрос.Текст = Запрос.Текст + ", ТаблицаДанныхППР.Цепочка, ТаблицаДанныхППР.НомерСтрокиВРЦепочки";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|ИЗ
		|	ТаблицаДанныхППР КАК ТаблицаДанныхППР
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСтруктуры КАК ТаблицаСтруктуры
		|		ПО ТаблицаДанныхППР.ОбъектРемонтныхРабот = ТаблицаСтруктуры.ОбъектИерархии
		|ГДЕ ДатаНач > ДАТАВРЕМЯ(1,1,1,0,0,0) ";
		Если СортироватьПоНаименованию Тогда
			Если ЕстьЦепочки Тогда
				Запрос.Текст = Запрос.Текст + "
				|УПОРЯДОЧИТЬ ПО
				|	ОбъектРемонтныхРабот.Наименование,
				|	НомерСтрокиВРЦепочки,
				|	ВидРемонтныхРабот.Наименование,
				|	ДатаНач,
				|	ДатаКон ";
			Иначе
				Запрос.Текст = Запрос.Текст + "
				|УПОРЯДОЧИТЬ ПО
				|	ОбъектРемонтныхРабот.Наименование,
				|	ВидРемонтныхРабот.Наименование,
				|	ДатаНач,
				|	ДатаКон ";
			КонецЕсли;
		Иначе
			Если ЕстьЦепочки Тогда
				Запрос.Текст = Запрос.Текст + "
				|УПОРЯДОЧИТЬ ПО
				|	НомерОР,
				|	ВидРемонтныхРабот.Наименование,
				|	НомерСтрокиВРЦепочки";
			Иначе
				Запрос.Текст = Запрос.Текст + "
				|УПОРЯДОЧИТЬ ПО
				|	НомерОР,
				|	ВидРемонтныхРабот.Наименование";
			КонецЕсли;

		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|ИТОГИ ПО
		|	Положение,
		|	ОбъектРемонтныхРабот";

		Если ЕстьЦепочки Тогда
			Запрос.Текст = Запрос.Текст + ", НомерСтрокиВРЦепочки";
		КонецЕсли;

		Запрос.Текст = Запрос.Текст + ", ВидРемонтныхРабот";

		Запрос.УстановитьПараметр("ТаблицаДанныхППР", ТаблицаДанныхППР);
		Запрос.УстановитьПараметр("СтруктураИерархии", СтруктураИерархии);

		Результат = Запрос.Выполнить();

		ВыборкаПоПоложению = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоПоложению.Следующий() Цикл

			ТочкаПоложение = Диаграмма.Точки.Добавить();
			ТочкаПоложение.Текст = СокрЛП(ВыборкаПоПоложению.Положение);
			Если ИспользоватьРасшифровку Тогда
				ТочкаПоложение.Расшифровка = ВыборкаПоПоложению.Положение;
			КонецЕсли;

			ВыборкаПоОР = ВыборкаПоПоложению.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоОР.Следующий() Цикл

				ТочкаОРР = ТочкаПоложение.Точки.Добавить();
				ТочкаОРР.Текст = ВыборкаПоОР.ОбъектРемонтныхРаботПредставление;
				Если ИспользоватьРасшифровку Тогда
					ТочкаОРР.Расшифровка = ВыборкаПоОР.ОбъектРемонтныхРабот;
				КонецЕсли;

				ВыборкаПоВРИлиЦепочкам = ВыборкаПоОР.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаПоВРИлиЦепочкам.Следующий() Цикл  					

					Если ЕстьЦепочки Тогда
						ВыборкаПоВР = ВыборкаПоВРИлиЦепочкам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаПоВР.Следующий() Цикл
							ВывестиЧастьГрафикаПятыйВариант(ВыборкаПоВР, ВыборкаПоОр, ТекДата, ТочкаОРР, ТочкаПоложение, СерияРемонт, Диаграмма, СтруктураЦветов, ИспользоватьРасшифровку, ЭтоКорректировка, Редактировать);							
						КонецЦикла;
					Иначе
						ВыборкаПоВР = ВыборкаПоВРИлиЦепочкам; 						
						ВывестиЧастьГрафикаПятыйВариант(ВыборкаПоВР, ВыборкаПоОр, ТекДата, ТочкаОРР, ТочкаПоложение, СерияРемонт, Диаграмма, СтруктураЦветов, ИспользоватьРасшифровку, ЭтоКорректировка, Редактировать);							
					КонецЕсли;

				КонецЦикла;

			КонецЦикла;

		КонецЦикла;
	КонецЕсли; 

КонецПроцедуры // гкс- [] Деснол 16.08.2022

&ИзменениеИКонтроль("торо_ЗапретИзмененияПроведенныхПриНаличииСозданныхНаОснованииПередЗаписью")
Процедура гкс_торо_ЗапретИзмененияПроведенныхПриНаличииСозданныхНаОснованииПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения)

	Если Источник.БезусловнаяЗапись = Истина Или Источник.ЭтоНовый() Или (Не Источник.Проведен И РежимЗаписи = РежимЗаписиДокумента.Проведение) Тогда
		Возврат;
	КонецЕсли; 

	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Или РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		СвязанныеДокументы = КритерииОтбора.СвязанныеДокументы.Найти(Источник.Ссылка);

		ЕстьСвязанныеПроведенные = Ложь;
		ЕстьОстановочныйПроведенный = Ложь;
		Для Каждого СвязанныйДокумент Из СвязанныеДокументы Цикл
			#Вставка
			Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.торо_ВыявленныеДефекты") 
				И ТипЗнч(СвязанныйДокумент) = Тип("ДокументСсылка.гкс_ЕВОБланк") Тогда
				Продолжить;
			КонецЕсли;
			#КонецВставки

			Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") 
				И ТипЗнч(СвязанныйДокумент) = Тип("ДокументСсылка.торо_ОстановочныеРемонты") Тогда

				Если СвязанныйДокумент.Проведен Тогда
					ЕстьОстановочныйПроведенный = Истина;
				КонецЕсли;
				Продолжить;
			КонецЕсли;

			Если СвязанныйДокумент.Проведен Тогда
				ЕстьСвязанныеПроведенные = Истина;
				Прервать;
			КонецЕсли;

		КонецЦикла;

		Если ЕстьСвязанныеПроведенные И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			ТекстСообщения = НСтр("es='¡Es imposible la realización del documento, hay unos documentos introducidos en razon de dados!';ru='Невозможно проведение документа, есть документы, введенные на основании данного!';en='Unable to hold a document, there are documents entered on the basis of this!'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		ИначеЕсли (ЕстьСвязанныеПроведенные ИЛИ ЕстьОстановочныйПроведенный) И РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
			ТекстСообщения = НСтр("es='¡No es posible anular la realización del documento que tiene los documentos vinculados!';ru='Нельзя отменять проведение документа, имеющего связанные документы!';en='Can not cancel the holding of a document having related documents!'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;

	КонецЕсли;
КонецПроцедуры

// гкс+ [TOIR20-610] Оселедько В.С. 22.07.2025 
Функция гкс_ИндексКартинкиДереваРемонтныхРаботПоПараметрам(Работа, ЭтоГруппа = Ложь, ПометкаУдаления = Ложь) Экспорт
	
	ТипРаботы = ТипЗнч(Работа);
	
	Если ТипРаботы = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда
		Результат = ?(ПометкаУдаления, 1, 0);
	ИначеЕсли ТипРаботы = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
		Если ЭтоГруппа Тогда 
			Результат = 4;
		Иначе 
			Результат = ?(ПометкаУдаления, 3, 2);
		КонецЕсли;	
	Иначе
		Результат = 4;
	КонецЕсли;

	Возврат Результат; 
	
КонецФункции
// гкс- [TOIR20-610] Оселедько В.С. 22.07.2025

#КонецОбласти