
#Область ОбработчикиСобытийФормы

&НаСервере
&После("ПриСозданииНаСервере")
Процедура Расш_гкс_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	гкс_ДобавитьНовыеЭлементы();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура гкс_ДобавитьНовыеЭлементы()
	ТипСтрока100 = Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(100));
	МассРек = Новый Массив();
	МассРек.Добавить(Новый РеквизитФормы("гкс_Примечание", ТипСтрока100, "ДеревоРемонтныхРабот"));
	МассРек.Добавить(Новый РеквизитФормы("гкс_СпособВыполнения", 
		Новый ОписаниеТипов("ПеречислениеСсылка.СпособыСтроительства"), "ДеревоРемонтныхРабот"));
	// гкс+ [разработка 2021] Куст 08.07.2021
	МассРек.Добавить(Новый РеквизитФормы("гкс_ПовКоэф", 
		Новый ОписаниеТипов("СправочникСсылка.гкс_ПКоэффициентыРабот"), "ДеревоРемонтныхРабот"));
	// гкс- [разработка 2021] Куст 08.07.2021
	МассРек.Добавить(Новый РеквизитФормы("гкс_Примечание", ТипСтрока100, "Объект.РемонтныеРаботы"));
	МассРек.Добавить(Новый РеквизитФормы("гкс_СпособВыполнения", 
		Новый ОписаниеТипов("ПеречислениеСсылка.СпособыСтроительства"), "Объект.РемонтныеРаботы"));
	// гкс+ [разработка 2021] Куст 08.07.2021
	МассРек.Добавить(Новый РеквизитФормы("гкс_ПовКоэф", 
		Новый ОписаниеТипов("СправочникСсылка.гкс_ПКоэффициентыРабот"), "Объект.РемонтныеРаботы"));
	// гкс- [разработка 2021] Куст 08.07.2021
	ИзменитьРеквизиты(МассРек);
	// гкс+ [02.23] Деснол 07.02.2023
	НЭлем = Элементы.Добавить("гкс_Описание", Тип("ПолеФормы"), Элементы.РемонтыОборудования);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Объект.РемонтыОборудования.ОписаниеРемонта";
	НЭлем.ТолькоПросмотр = Истина;
	Элементы.РемонтыОборудованияОписаниеРемонта.Видимость = Ложь;
	// гкс- [02.23] Деснол 07.02.2023
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("РемонтыОборудованияВыбор")
Процедура Расш_гкс_РемонтыОборудованияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ТекДокОснование = Элементы.ДокументыОснования.ТекущиеДанные;
	Если ВыбраннаяСтрока <> Неопределено И ТекДокОснование <> Неопределено Тогда
		Строка = Объект.РемонтыОборудования.НайтиПоИдентификатору(ВыбраннаяСтрока);
		Если Строка <> Неопределено Тогда

			СтрокаРемонтовОборудования = Новый Структура("ID, ВидРемонтныхРабот, ДатаНачала, ДатаОкончания, Завершен, ОбъектРемонта, ОбъектРемонтаВладелец, ДокументОстановочный, ОписаниеРемонта");

			Если ФО_торо_НазначениеНаРемонтСУчетомРисков Тогда
				СтрокаРемонтовОборудования.Вставить("КрайняяДопустимаяДатаЗавершенияРемонта");
				СтрокаРемонтовОборудования.Вставить("КритичностьДефекта");
			КонецЕсли; 

			ЗаполнитьЗначенияСвойств(СтрокаРемонтовОборудования, Строка);

			СтруктураПоиска = Новый Структура("РемонтыОборудования_ID", Строка.ID);

			МассивСтрок = Объект.РемонтныеРаботы.НайтиСтроки(СтруктураПоиска);

			МассивСтрокРемонтныхРабот = Новый Массив;

			Для каждого Элем Из МассивСтрок Цикл

				СтруктураДобавления = Новый Структура("РемонтнаяРабота, Количество, Родитель_ID, РемонтыОборудования_ID, ID, ТехКартаРемонта, ПроцентВыполненияРабот, Исполнитель, ДоговорБригада, НоваяОперация"); 
				#Вставка
				СтруктураДобавления.Вставить("гкс_Примечание", "");
				СтруктураДобавления.Вставить("гкс_СпособВыполнения", Неопределено);
				СтруктураДобавления.Вставить("гкс_ПовКоэф", Неопределено);
				#КонецВставки
				ЗаполнитьЗначенияСвойств(СтруктураДобавления, Элем);

				Если ТипЗнч(ТекДокОснование.ДокументОснование) = Тип("ДокументСсылка.торо_ВыявленныеДефекты") Тогда
					Если ЗначениеЗаполнено(Элем.Родитель_ID) Тогда
						СтрРодителя = Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("РемонтыОборудования_ID, ID", Элем.РемонтыОборудования_ID, Элем.Родитель_ID));
						Если СтрРодителя.Количество() > 0 И ТипЗнч(СтрРодителя[0].РемонтнаяРабота) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда 
							СтруктураДобавления.ТехКартаРемонта = СтрРодителя[0].РемонтнаяРабота;					
						КонецЕсли;						
					КонецЕсли;
				КонецЕсли;

				Если ТипЗнч(ТекДокОснование.ДокументОснование) = Тип("ДокументСсылка.торо_ВыявленныеДефекты")
					И ТипЗнч(Элем.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда

					СтруктураДобавления.НоваяОперация = Истина;	

				КонецЕсли; 

				МассивСтрокРемонтныхРабот.Добавить(СтруктураДобавления);

			КонецЦикла;

			СтруктураВыбора = Новый Структура();

			СтруктураВыбора.Вставить("ДокументОснование"         , Строка.ДокументОснование);
			СтруктураВыбора.Вставить("СтрокаРемонтовОборудования", СтрокаРемонтовОборудования);
			СтруктураВыбора.Вставить("МассивСтрокРемонтныхРабот" , МассивСтрокРемонтныхРабот);
			СтруктураВыбора.Вставить("ЭтоРемонтнаяРабота"        , Ложь);

			ВводитьСвязанные = Ложь;
			Если ТипЗнч(Владелец) = Тип("ДокументСсылка.торо_ОстановочныеРемонты") Тогда
				Если Не ЗначениеЗаполнено(ОРДляОтбораПоОстановочным) Тогда
					ВводитьСвязанные = Истина;
					ОРДляОтбораПоОстановочным = СтруктураВыбора.СтрокаРемонтовОборудования.ОбъектРемонта;
					ВРДляОтбораПоОстановочным = СтруктураВыбора.СтрокаРемонтовОборудования.ВидРемонтныхРабот;
					СформироватьТаблицуОтбораЗависимыхОтОстановочныхРемонтов();

					МассивСтрокКУдалению = Новый Массив;
					ПустойВР = ПредопределенноеЗначение("Справочник.торо_ВидыРемонтов.ПустаяСсылка");
					Для Каждого Стр Из Объект.РемонтыОборудования Цикл
						Если ТаблицаДляОтбораПоОстановочным.НайтиСтроки(Новый Структура("СвязанныйОбъектРемонта, ВидРемонтаЗависимогоОбъекта", Стр.ОбъектРемонта, Стр.ВидРемонтныхРабот)).Количество() = 0
							И ТаблицаДляОтбораПоОстановочным.НайтиСтроки(Новый Структура("СвязанныйОбъектРемонта, ВидРемонтаЗависимогоОбъекта", Стр.ОбъектРемонта, ПустойВР)).Количество() = 0 Тогда
							МассивСтрокКУдалению.Добавить(Стр);
						КонецЕсли;
					КонецЦикла;
					Для Каждого Стр Из МассивСтрокКУдалению Цикл
						Объект.РемонтыОборудования.Удалить(Стр);
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;

			Если типЗнч(Строка.ДокументОснование) = ТИп("ДокументСсылка.торо_ВыявленныеДефекты") тогда
				СтруктураВыбора.Вставить("НаправлениеНаУстранение", ПолучитьПричинуДефекта(Строка.ДокументОснование, Строка.ID));
			иначе
				СтруктураВыбора.Вставить("НаправлениеНаУстранение", "");
			КонецЕсли;

			ОповеститьОВыборе(СтруктураВыбора);
		КонецЕсли;

	Иначе

		ПоказатьПредупреждение(Неопределено, НСтр("es='la selección o la reparación!';ru='Не выбран документ основание для подбора или ремонт!';en='Not selected document basis for selection or repair!'"), 10);

	КонецЕсли;

КонецПроцедуры


#КонецОбласти