#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПЕРЕМЕННЫЕ

Перем мТаблицаОбъектовРемонта;
Перем ТаблицаПроведения;
Перем ТаблицаВремяНахожденияВСостоянии;
Перем мПредыдущиеЭксплуатации;
перем СтруктураДанных Экспорт; // Структура, хранящая данные для работы с уведомлениями.

Перем БезусловнаяЗапись Экспорт; // Отключает проверки при записи документа



#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбъектыРемонта.Количество() = 0 Тогда
		ТекстСообщения = НСтр("es='En el documento no es rellenada la parte tabular de los objetos de la reparación. ¡La realización es imposible!';ru='В документе не заполнена табличная часть объектов ремонта. Проведение невозможно!';en='The document does not fill out the tabular part of the repair facilities. Conducting is impossible!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		Возврат;
	КонецЕсли;
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = Строка(Ссылка);
	
	// Проверить заполнение ТЧ
	ПроверитьЗаполнениеТабличнойЧастиОбъектыРемонта(Отказ, Заголовок);
	
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(РежимПроведения, Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Для Каждого Строка Из ОбъектыРемонта Цикл
		Если Строка.ИзменятьСостояниеПодчиненныхОР И НЕ ЗначениеЗаполнено(Строка.Иерархия) Тогда
			ШаблонСообщения = НСтр("es='En la línea № %1 no es rellenado el campo ""la Jerarquía"". La anotación es imposible.';ru='В строке №%1 не заполнено поле ""Иерархия"". Запись невозможна.';en='In line No.%1, the Hierarchy field is not filled. Recording is not possible.'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Строка.НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Если БезусловнаяЗапись = Неопределено Тогда
		БезусловнаяЗапись = Ложь;
	КонецЕсли; 

	Если РежимЗаписи = РежимЗаписиДокумента.Проведение или РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ПроверитьБолееПоздниеДокументы(Отказ);
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// Заполним причины простоя для запускаемых ОР
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		ПолучитьТаблицуОбъектовРемонта();
		ТаблицаПроведения = ПолучитьИтоговуюТаблицуПроведения();
		мПредыдущиеЭксплуатации = ОпределитьСостоянияОбъектов(мТаблицаОбъектовРемонта,мТаблицаОбъектовРемонта.ВыгрузитьКолонку("ОбъектРемонта"));
		ТаблицаВремяНахожденияВСостоянии = ОпределитьВремяНахожденияВСостоянии();
		
		Если Не БезусловнаяЗапись Тогда
			
			Если ОпределитьДублиСтрок() Тогда 
				Отказ = Истина;
				Возврат; 
			КонецЕсли;
			
			ПроблемныеСостояния = ПолучитьСостоянияПроблемаПроведения(ТаблицаПроведения);
			Если ПроблемныеСостояния.Количество() Тогда
				Отказ = Истина;
				Для Каждого ПроблемнаяЗапись Из ПроблемныеСостояния Цикл
					ШаблонСообщения = НСтр("es='%2 objeto de la reparación %1 era traducido en el estado %3 (el documento %4) que contradice los datos del documento corriente.';ru='%2 объект ремонта %1 был переведен в состояние %3(документом %4), что противоречит данным текущего документа.';en='%2 repair object%1 was transferred to state%3 (document%4), which contradicts the data in the current document.'");
					ТекстСообщения = СтрШаблон(ШаблонСообщения, ПроблемнаяЗапись.ОбъектРемонта, ПроблемнаяЗапись.Период, ПроблемнаяЗапись.ВидЭксплуатацииСтарый, ПроблемнаяЗапись.Регистратор);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				КонецЦикла;
			КонецЕсли;
			
			СравнитьДатыСДатойВводаВЭксплуатацию(Отказ, мТаблицаОбъектовРемонта);
			
			НекорректныеИнтервалы = ПроверитьДаты(Отказ,ТаблицаВремяНахожденияВСостоянии);
			НекорректныеИнтервалы1 = ПроверитьДатыВнутриДокумента(Отказ, ТаблицаВремяНахожденияВСостоянии);
			Для Каждого СтрокаИнтервала Из НекорректныеИнтервалы Цикл
				СтрТаблицыОР = СтрокаИнтервала;
				
				Если ВидОперации = Перечисления.торо_ВидыОперацийОтклоненияВРаботеОборудования.ВидЭксплуатацииНаПериод Тогда
					ТекстСообщения = СтрШаблон(
						НСтр("es='La realización del documento es imposible. Para el objeto de la reparación %1 período %2 - %3 se cruza con otro período,"
"	El estado en que es indicado ya. Es necesario comprobar las fechas indicadas.';ru='Проведение документа невозможно. Для объекта ремонта %1 период %2 - %3 пересекается с другим периодом,"
"	состояние на который уже указано. Необходимо проверить указанные даты.';en='The document is not possible. For the repair object%1, the period%2 -%3 intersects with another period,"
"the state to which is already indicated. Please check the dates indicated. '"),
						СтрТаблицыОР.ОбъектРемонта,СтрТаблицыОР.ДатаНачала,СтрТаблицыОР.ДатаОкончания);
				Иначе
					ТекстСообщения = СтрШаблон(
						НСтр("es='La realización del documento es imposible. Para el objeto de la reparación %1 fecha del cambio del estado %2 cae en el período,"
"	El estado en que es indicado ya. Es necesario comprobar la fecha indicada del cambio del estado.';ru='Проведение документа невозможно. Для объекта ремонта %1 дата изменения состояния %2 попадает в период,"
"	состояние на который уже указано. Необходимо проверить указанную дату изменения состояния.';en='The document cannot be posted. For the repair object%1, the date of the change of state%2 falls within the"
"the state to which is already indicated. Please check the indicated date of state change. '"),
						СтрТаблицыОР.ОбъектРемонта,СтрТаблицыОР.ДатаОкончания);
				КонецЕсли;
				
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			КонецЦикла;
			
			Для Каждого СтрокаИнтервала Из НекорректныеИнтервалы1 Цикл
				СтрТаблицыОР = мТаблицаОбъектовРемонта.НайтиСтроки(Новый Структура("ДатаНачала,ОбъектРемонта", СтрокаИнтервала.ДатаНачала,СтрокаИнтервала.ОбъектРемонта))[0];
				ШаблонСообщения = НСтр("es='Para el objeto %1, el período %2 - %3 contiene las fechas incorrectas (¡probablemente el período se cruza con otro período en los límites del documento)!';ru='Для объекта %1, период %2 - %3 содержит некорректные даты (возможно период пересекается с другим периодом в рамках документа)!';en='For object% 1, the period% 2 -% 3 contains incorrect dates (perhaps the period intersects with another period within the document)!'");
				ТекстСообщения = СтрШаблон(ШаблонСообщения, СтрТаблицыОР.ОбъектРемонта, СтрТаблицыОР.ДатаНачала, СтрТаблицыОР.ДатаОкончания);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			КонецЦикла;
			
			НекорректныеИнтервалы2 = ПроверитьДатыНезакрытыеИнтервалы(Отказ, ТаблицаВремяНахожденияВСостоянии, ТаблицаПроведения);
			Для Каждого СтрокаИнтервала Из НекорректныеИнтервалы2 Цикл
				СтрТаблицыОР = мТаблицаОбъектовРемонта.НайтиСтроки(Новый Структура("ДатаОкончания,ОбъектРемонта", СтрокаИнтервала.Период,СтрокаИнтервала.ОбъектРемонта))[0];
				Если СтрТаблицыОР.ВидЭксплуатации.ТипЭксплуатации <> Перечисления.торо_ТипЭксплуатации.Эксплуатация Тогда
					ШаблонСообщения = НСтр("es='La tentativa de pasar todavía un documento con el tipo ""las Horas muertas"" en el período de %1 para el objeto %2. "
"Den la fecha de la terminación del estado %3, menor las fechas ha comenzado ya las horas muertas, registradas en el sistema.';ru='Попытка провести еще один документ с видом ""Простой"" на период %1 для объекта %2. "
"Задайте дату окончания состояния %3, меньшую даты начала уже зарегистрированного в системе простоя.';en='Attempt to post another document with the view Simple ""for the period%1 for object%2. Set the end date of state%3 to be less than the start date of the downtime already registered in the system. '");
					ТекстСообщения = СтрШаблон(ШаблонСообщения, СтрТаблицыОР.ДатаОкончания, СтрТаблицыОР.ОбъектРемонта, СтрТаблицыОР.ВидЭксплуатации);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если НЕ Отказ Тогда	
			Если ВидОперации = Перечисления.торо_ВидыОперацийОтклоненияВРаботеОборудования.ВидЭксплуатацииНаПериод Тогда
				Для Каждого ОР Из ОбъектыРемонта Цикл
					СтрВР = Неопределено;
					Если НЕ ЗначениеЗаполнено(ОР.ВидЭксплуатации) Тогда
						СтрВР = мТаблицаОбъектовРемонта.НайтиСтроки(Новый Структура("ДатаНачала,ОбъектРемонта", ОР.ДатаНачала,ОР.ОбъектРемонта));
						Если СтрВР.Количество() = 0 Тогда
							Продолжить;
						КонецЕсли;
						ОР.ВидЭксплуатации = СтрВР[0].ВидЭксплуатации;
					КонецЕсли;
				КонецЦикла;
				
			Иначе
				
			КонецЕсли;
		Иначе
			ТекстСообщения = НСтр("es='¡La realización del documento no es cumplida!';ru='Проведение документа не выполнено!';en='The document has not been posted!'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	
	ФОИспользоватьОстановочные	= ПолучитьФункциональнуюОпцию("торо_ИспользоватьОстановочныеРемонты");
	
	ДокОснование = Неопределено;
	Если ТипЗнч(Основание) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Основание);
		
		Основание.Свойство("ДокументОснование", ДокОснование);
		
		Если Основание.Свойство("ВидОперации") Тогда
			ВидОперации = Основание.ВидОперации;
		КонецЕсли;
		
		// Создание из формы объекта ремонта
		Если Основание.Свойство("ОбъектРемонта") Тогда
			НС = ОбъектыРемонта.Добавить();
			НС.ОбъектРемонта = Основание.ОбъектРемонта;
			НС.ДатаОкончания = ТекущаяДата();
			Если Основание.Свойство("СтруктураИерархии") Тогда
				НС.Иерархия = Основание.СтруктураИерархии;
			Иначе
				НС.Иерархия = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
				"НастройкиТОиР",
				"ОсновнаяСтруктураИерархии",
				Истина);
			КонецЕсли;
		КонецЕсли;

	Иначе
		ДокОснование = Основание;
	КонецЕсли;
	
	Если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.торо_ВыявленныеДефекты") Тогда
		
		Организация = ДокОснование.Организация;
		Подразделение = ДокОснование.Подразделение;
		ВидОперации = Перечисления.торо_ВидыОперацийОтклоненияВРаботеОборудования.ВидЭксплуатации;
		ДокументОснование = ДокОснование;
		
		Если ТипЗнч(Основание) = Тип("Структура") И Основание.Свойство("СтруктураИерархии") Тогда
			СтруктураИерархии = Основание.СтруктураИерархии;
		Иначе
			СтруктураИерархии = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
				"НастройкиТОиР",
				"ОсновнаяСтруктураИерархии",
				Истина);
		КонецЕсли;
		
		ВидЭксплуатацииПриСозданииНаОсновании = Константы.торо_ВидЭксплуатацииДляВводаНаОснованииВыявленногоДефекта.Получить();
		
		Если ФОИспользоватьОстановочные = Истина Тогда 
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ЕСТЬNULL(торо_ВыявленныеДефекты.ОбъектРемонта, торо_ВыявленныеДефектыСписокДефектов.ОтказавшийЭлемент) КАК ОР,
			               |	торо_ВыявленныеДефектыСписокДефектов.Ссылка.ДатаОбнаружения КАК ДатаНачалаРемонта,
			               |	торо_ВидРемонтаПриВводеНаОснованииВыявленныхДефектов.Значение КАК ВидРемонта
			               |ПОМЕСТИТЬ ИсхДанные
			               |ИЗ
			               |	Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов
			               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефекты
			               |		ПО торо_ВыявленныеДефектыСписокДефектов.ID = торо_ВыявленныеДефекты.ID,
			               |	Константа.торо_ВидРемонтаПриВводеНаОснованииВыявленныхДефектов КАК торо_ВидРемонтаПриВводеНаОснованииВыявленныхДефектов
			               |ГДЕ
			               |	торо_ВыявленныеДефектыСписокДефектов.Ссылка = &Ссылка
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ИсхДанные.ОР КАК ОР,
			               |	ИсхДанные.ДатаНачалаРемонта КАК ДатаНачалаРемонта,
			               |	ЕСТЬNULL(торо_НормативныеРемонтыОборудования.НормативныйРемонт, ЗНАЧЕНИЕ(Справочник.торо_ВидыРемонтов.ПустаяСсылка)) КАК НормативныйРемонт
			               |ПОМЕСТИТЬ ИдентТехКарты
			               |ИЗ
			               |	ИсхДанные КАК ИсхДанные
			               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_НормативныеРемонтыОборудования КАК торо_НормативныеРемонтыОборудования
			               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_НормативныеРемонтыОборудованияУдаленные КАК торо_НормативныеРемонтыОборудованияУдаленные
			               |			ПО торо_НормативныеРемонтыОборудования.ОбъектРемонта = торо_НормативныеРемонтыОборудованияУдаленные.ОбъектРемонта
			               |				И торо_НормативныеРемонтыОборудования.ВидРемонта = торо_НормативныеРемонтыОборудованияУдаленные.ВидРемонта
			               |				И торо_НормативныеРемонтыОборудования.ТиповойОР = торо_НормативныеРемонтыОборудованияУдаленные.ТиповойОР
			               |		ПО ИсхДанные.ОР = торо_НормативныеРемонтыОборудования.ОбъектРемонта
			               |			И ИсхДанные.ВидРемонта = торо_НормативныеРемонтыОборудования.ВидРемонта
			               |ГДЕ
			               |	торо_НормативныеРемонтыОборудованияУдаленные.ОбъектРемонта ЕСТЬ NULL
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	торо_ВерсииТехКартСрезПоследних.ИдентификаторТехКарты КАК ИдентификаторТехКарты,
			               |	торо_ВерсииТехКартСрезПоследних.ТехКарта КАК ТехКарта
			               |ПОМЕСТИТЬ ВерсииТехкарт
			               |ИЗ
			               |	РегистрСведений.торо_ВерсииТехКарт.СрезПоследних(
			               |			&ДатаОбнаружения,
			               |			ИдентификаторТехКарты В
			               |				(ВЫБРАТЬ
			               |					Таб.НормативныйРемонт
			               |				ИЗ
			               |					ИдентТехКарты КАК Таб)) КАК торо_ВерсииТехКартСрезПоследних
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ РАЗЛИЧНЫЕ
			               |	ИдентТехКарты.ОР КАК ОР,
			               |	ИдентТехКарты.НормативныйРемонт КАК НормативныйРемонт,
			               |	ЕСТЬNULL(ВерсииТехкарт.ТехКарта.ВыполнениеРемонтаТребуетОстановаОборудования, ЛОЖЬ) КАК ТребуетОстанова,
			               |	ЕСТЬNULL(ВерсииТехкарт.ТехКарта.ВидПростоя, ЗНАЧЕНИЕ(Справочник.торо_ПричиныПростояОборудования.ПустаяСсылка)) КАК ВидПростоя
			               |ИЗ
			               |	ИдентТехКарты КАК ИдентТехКарты
			               |		ЛЕВОЕ СОЕДИНЕНИЕ ВерсииТехкарт КАК ВерсииТехкарт
			               |		ПО ИдентТехКарты.НормативныйРемонт = ВерсииТехкарт.ИдентификаторТехКарты";
			
			Запрос.УстановитьПараметр("Ссылка", ДокОснование);			
			Запрос.УстановитьПараметр("ДатаОбнаружения", ДокОснование.ДатаОбнаружения);
			
			резЗапроса = Запрос.Выполнить();
			
			Если НЕ резЗапроса.Пустой() Тогда
				Выборка = резЗапроса.Выбрать();
				Пока Выборка.Следующий() Цикл
					НоваяСтрока = ОбъектыРемонта.Добавить();
					НоваяСтрока.ОбъектРемонта = Выборка.ОР;
					НоваяСтрока.ДатаОкончания = ДокОснование.ДатаОбнаружения;
					
					Если Выборка.ТребуетОстанова Тогда
						НоваяСтрока.ВидЭксплуатации = Выборка.ВидПростоя;
					Иначе	
						НоваяСтрока.ВидЭксплуатации = ВидЭксплуатацииПриСозданииНаОсновании;
					КонецЕсли;
					
					НоваяСтрока.Иерархия = СтруктураИерархии;
					
				КонецЦикла;
			КонецЕсли;
			
		Иначе
			Если ТипЗнч(Основание) = Тип("Структура") И Основание.Свойство("МассивОР") Тогда
				
				Для Каждого ОР Из Основание.МассивОР Цикл
					НоваяСтрока = ОбъектыРемонта.Добавить();
					НоваяСтрока.ОбъектРемонта = ОР;
					НоваяСтрока.ДатаОкончания = ДокОснование.ДатаОбнаружения;
					НоваяСтрока.ВидЭксплуатации = ВидЭксплуатацииПриСозданииНаОсновании;
					НоваяСтрока.Иерархия = СтруктураИерархии;
				КонецЦикла;
				
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДокОснование) = Тип("ДокументСсылка.торо_АктОВыполненииЭтапаРабот") 
		ИЛИ ТипЗнч(ДокОснование) = Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот") Тогда
		
		Организация = ДокОснование.Организация;
		Подразделение = ДокОснование.Подразделение;
		ВидОперации = Перечисления.торо_ВидыОперацийОтклоненияВРаботеОборудования.ВидЭксплуатацииНаПериод;
		ДокументОснование = ДокОснование;
		
		СтруктураИерархии = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
											"НастройкиТОиР",
											"ОсновнаяСтруктураИерархии",
											Истина);
											
		Если ТипЗнч(Основание) = Тип("Структура") И Основание.Свойство("МассивОР") Тогда
			МассивОР = ПолучитьСтруктуруОбъектовРемонтаИПростоевИзДокументаОснования(ДокОснование, Основание.МассивОР);
		Иначе
			МассивОР = ПолучитьСтруктуруОбъектовРемонтаИПростоевИзДокументаОснования(ДокОснование);
		КонецЕсли;
											
		Для каждого ТекСтрока из МассивОР Цикл
			МассивСтрокСТекущимОР = ОбъектыРемонта.НайтиСтроки(Новый Структура("ОбъектРемонта", ТекСтрока.ОбъектРемонта));
			Если НЕ МассивСтрокСТекущимОР.Количество() Тогда
				НоваяСтрока = ОбъектыРемонта.Добавить();
				НоваяСтрока.ОбъектРемонта = ТекСтрока.ОбъектРемонта;
				НоваяСтрока.ДатаНачала = ТекСтрока.ДатаНачала;
				НоваяСтрока.ДатаОкончания = ТекСтрока.ДатаОкончания;
				
				Если Константы.торо_ИспользоватьОстановочныеРемонты.Получить() Тогда
					НоваяСтрока.ВидЭксплуатацииНаПериод = ТекСтрока.ВидПростоя;
				КонецЕсли;
				
				НоваяСтрока.Иерархия = СтруктураИерархии;
			Иначе
				Для Каждого СтрокаОР Из МассивСтрокСТекущимОР Цикл
					Если СтрокаОР.ДатаНачала <= ТекСтрока.ДатаНачала И СтрокаОР.ДатаОкончания <= ТекСтрока.ДатаОкончания И СтрокаОР.ДатаОкончания >= ТекСтрока.ДатаНачала  Тогда
						ОбъектыРемонта[ОбъектыРемонта.Индекс(СтрокаОР)].ДатаОкончания = ТекСтрока.ДатаОкончания;
					ИначеЕсли СтрокаОР.ДатаНачала >= ТекСтрока.ДатаНачала И СтрокаОР.ДатаОкончания >= ТекСтрока.ДатаОкончания И СтрокаОР.ДатаНачала <= ТекСтрока.ДатаОкончания Тогда 
						ОбъектыРемонта[ОбъектыРемонта.Индекс(СтрокаОР)].ДатаНачала = ТекСтрока.ДатаНачала;
					ИначеЕсли СтрокаОР.ДатаНачала >= ТекСтрока.ДатаНачала И СтрокаОР.ДатаОкончания <= ТекСтрока.ДатаОкончания Тогда
						ОбъектыРемонта[ОбъектыРемонта.Индекс(СтрокаОР)].ДатаНачала = ТекСтрока.ДатаНачала;
						ОбъектыРемонта[ОбъектыРемонта.Индекс(СтрокаОР)].ДатаОкончания = ТекСтрока.ДатаОкончания;
					ИначеЕсли НЕ (СтрокаОР.ДатаНачала <= ТекСтрока.ДатаНачала И СтрокаОР.ДатаОкончания >= ТекСтрока.ДатаОкончания) Тогда
						НоваяСтрока = ОбъектыРемонта.Добавить();
						НоваяСтрока.ОбъектРемонта = ТекСтрока.ОбъектРемонта;
						НоваяСтрока.ДатаНачала = ТекСтрока.ДатаНачала;
						НоваяСтрока.ДатаОкончания = ТекСтрока.ДатаОкончания;
						
						Если Константы.торо_ИспользоватьОстановочныеРемонты.Получить() Тогда
							НоваяСтрока.ВидЭксплуатацииНаПериод = ТекСтрока.ВидПростоя;
						КонецЕсли;
						
						НоваяСтрока.Иерархия = СтруктураИерархии;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДокОснование) = Тип("ДокументСсылка.торо_АктОВыполненииРегламентногоМероприятия") Тогда
		
		Организация = ДокОснование.Организация;
		Подразделение = ДокОснование.Подразделение;
		ВидОперации = Перечисления.торо_ВидыОперацийОтклоненияВРаботеОборудования.ВидЭксплуатацииНаПериод;
		ДокументОснование = ДокОснование;
	
	КонецЕсли;
	
	торо_ЗаполнениеДокументов.ЗаполнитьСтандартныеРеквизитыШапкиПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура ЗаполнитьВидыЭксплуатацииВТаблицеДляОбработки()
	
	ТаблицаДляОбработки = мТаблицаОбъектовРемонта;
	Если ЗначениеЗаполнено(ВидЭксплуатации) Тогда
		ВидНаПериод = (ВидОперации = Перечисления.торо_ВидыОперацийОтклоненияВРаботеОборудования.ВидЭксплуатацииНаПериод);
		Для Каждого Строка Из ТаблицаДляОбработки Цикл
			Если ВидНаПериод Тогда 
				ЗаполнитьПустоеЗначениеВСтроке(Строка, "ВидЭксплуатацииНаПериод", ВидЭксплуатации);
			Иначе
				ЗаполнитьПустоеЗначениеВСтроке(Строка, "ВидЭксплуатации", ВидЭксплуатации);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПустоеЗначениеВСтроке(Строка, ИмяКолонки, Значение)
	
	Если Не ЗначениеЗаполнено(Строка[ИмяКолонки]) Тогда
		Строка[ИмяКолонки] = Значение;
	КонецЕсли;
	
КонецПроцедуры

Функция ОпределитьДублиСтрок()
	
	Запрос = Новый Запрос;
	Если ВидОперации = Перечисления.торо_ВидыОперацийОтклоненияВРаботеОборудования.ВидЭксплуатации Тогда	
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВЫРАЗИТЬ(таб.ОбъектРемонта КАК Справочник.торо_ОбъектыРемонта) КАК ОбъектРемонта,
		               |	таб.ДатаОкончания КАК ДатаОкончания,
		               |	таб.НомерСтроки,
		               |	1 КАК ДляСуммирования
		               |ПОМЕСТИТЬ Вт_оры
		               |ИЗ
		               |	&ТабОр КАК таб
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ОбъектРемонта,
		               |	ДатаОкончания
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	Вт_оры.ОбъектРемонта КАК ОбъектРемонта,
		               |	Вт_оры.ДатаОкончания КАК ДатаОкончания
		               |ПОМЕСТИТЬ ВТ_ОРыУникальные
		               |ИЗ
		               |	Вт_оры КАК Вт_оры
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ОбъектРемонта,
		               |	ДатаОкончания
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Вт_оры.НомерСтроки,
		               |	Вт_оры.ДляСуммирования КАК ДляСуммирования,
		               |	ВТ_ОРыУникальные.ОбъектРемонта КАК ОбъектРемонта,
		               |	ВТ_ОРыУникальные.ДатаОкончания КАК ДатаОкончания
		               |ИЗ
		               |	ВТ_ОРыУникальные КАК ВТ_ОРыУникальные
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Вт_оры КАК Вт_оры
		               |		ПО ВТ_ОРыУникальные.ОбъектРемонта = Вт_оры.ОбъектРемонта
		               |			И ВТ_ОРыУникальные.ДатаОкончания = Вт_оры.ДатаОкончания
		               |ИТОГИ
		               |	СУММА(ДляСуммирования)
		               |ПО
		               |	ОбъектРемонта,
		               |	ДатаОкончания";
					   
		Запрос.УстановитьПараметр("ТабОр", ОбъектыРемонта);
		
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			Возврат Ложь;
		КонецЕсли;
		
		ВыборкаПоОР = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		отказ = Ложь;
		Пока ВыборкаПоОР.Следующий() Цикл
			
			ВыборкаПоПериоду = ВыборкаПоОР.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоПериоду.Следующий() Цикл
				Если ВыборкаПоПериоду.ДляСуммирования < 2 Тогда Продолжить; КонецЕсли;
				
				Текст = НСтр("es='Las líneas iguales: ';ru='Одинаковые строки: ';en='Same lines: '");
				Первый = Истина;
				ДетЗаписи = ВыборкаПоПериоду.Выбрать();
				Пока ДетЗаписи.Следующий() Цикл
					Текст = Текст + ?(Первый, строка(ДетЗаписи.НомерСтроки), ", " + Строка(строка(ДетЗаписи.НомерСтроки)));
					первый = Ложь;
					отказ = Истина;
				КонецЦикла;
				ОбщегоНазначения.СообщитьПользователю(Текст);
			КонецЦикла;
		КонецЦикла;
	
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВЫРАЗИТЬ(таб.ОбъектРемонта КАК Справочник.торо_ОбъектыРемонта) КАК ОбъектРемонта,
		               |	таб.ДатаОкончания КАК ДатаОкончания,
		               |	таб.ДатаНачала КАК ДатаНачала,
		               |	таб.НомерСтроки,
		               |	1 КАК ДляСуммирования
		               |ПОМЕСТИТЬ Вт_оры
		               |ИЗ
		               |	&ТабОр КАК таб
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ОбъектРемонта,
		               |	ДатаОкончания
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	Вт_оры.ОбъектРемонта КАК ОбъектРемонта,
		               |	Вт_оры.ДатаОкончания КАК ДатаОкончания,
		               |	Вт_оры.ДатаНачала КАК ДатаНачала
		               |ПОМЕСТИТЬ ВТ_ОРыУникальные
		               |ИЗ
		               |	Вт_оры КАК Вт_оры
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ОбъектРемонта,
		               |	ДатаОкончания,
		               |	ДатаНачала
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Вт_оры.НомерСтроки,
		               |	Вт_оры.ДляСуммирования КАК ДляСуммирования,
		               |	ВТ_ОРыУникальные.ОбъектРемонта КАК ОбъектРемонта,
		               |	ВТ_ОРыУникальные.ДатаОкончания КАК ДатаОкончания,
		               |	ВТ_ОРыУникальные.ДатаНачала КАК ДатаНачала
		               |ИЗ
		               |	ВТ_ОРыУникальные КАК ВТ_ОРыУникальные
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Вт_оры КАК Вт_оры
		               |		ПО ВТ_ОРыУникальные.ОбъектРемонта = Вт_оры.ОбъектРемонта
		               |			И ВТ_ОРыУникальные.ДатаОкончания = Вт_оры.ДатаОкончания
		               |			И ВТ_ОРыУникальные.ДатаНачала = Вт_оры.ДатаНачала
		               |ИТОГИ
		               |	СУММА(ДляСуммирования)
		               |ПО
		               |	ОбъектРемонта,
		               |	ДатаОкончания,
		               |	ДатаНачала";
					   
		Запрос.УстановитьПараметр("ТабОр", ОбъектыРемонта);
		
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			Возврат Ложь;
		КонецЕсли;
		
		ВыборкаПоОР = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		отказ = Ложь;
		Пока ВыборкаПоОР.Следующий() Цикл
			
			ВыборкаПоПериоду = ВыборкаПоОР.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоПериоду.Следующий() Цикл
				ВыборкаПоПериоду2 = ВыборкаПоПериоду.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаПоПериоду2.Следующий() Цикл
				
					Если ВыборкаПоПериоду2.ДляСуммирования < 2 Тогда Продолжить; КонецЕсли;
					
					Текст = НСтр("es='Las líneas iguales: ';ru='Одинаковые строки: ';en='Same lines: '");
					Первый = Истина;
					ДетЗаписи = ВыборкаПоПериоду2.Выбрать();
					Пока ДетЗаписи.Следующий() Цикл
						Текст = Текст + ?(Первый, строка(ДетЗаписи.НомерСтроки), ", " + Строка(строка(ДетЗаписи.НомерСтроки)));
						первый = Ложь;
						отказ = Истина;
					КонецЦикла;
					ОбщегоНазначения.СообщитьПользователю(Текст);
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;				   
	
	Если отказ тогда 
		ТекстСообщения = НСтр("es='¡En la parte tabular del documento contener los datos incorrectos, la realización el documento es anulado!';ru='В табличной части документа содержаться некорректные данные, проведение документ отменено!';en='The tabular part of the document contains incorrect data, the document is canceled!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции

Процедура ДвиженияПоРегистрам(РежимПроведения, Отказ, Заголовок)
	
	ТаблицаОстановленногоОборудования = ПодготовитьТаблицуОстановленногоОборудования();
	ТаблицаЗапущенногоОборудования    = СформироватьТаблицуЗапущенногоОборудования();
	
	ДвиженияПоРегистру_торо_КоличествоПусковОР(РежимПроведения, Отказ, Заголовок);
		
	Движения.торо_ТекущееСостояниеОР.Записывать = Истина;
	Для Каждого СтрокаПроведения Из ТаблицаПроведения Цикл
		Движение = Движения.торо_ТекущееСостояниеОР.Добавить();
		Движение.Активность 		= Истина;
		Движение.ОбъектРемонта 		= СтрокаПроведения.ОбъектРемонта;
		Движение.Период 			= СтрокаПроведения.Период;
		Движение.ВидЭксплуатации 	= СтрокаПроведения.ВидЭксплуатации;
		Движение.Примечание			= СтрокаПроведения.Примечание;
		Движение.ПричинаПростоя		= СтрокаПроведения.ПричинаПростоя;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТаблицаПроведения.ОбъектРемонта,
	|	ТаблицаПроведения.Период,
	|	ТаблицаПроведения.ВидЭксплуатации,
	|	ТаблицаПроведения.ПричинаПростоя
	|ПОМЕСТИТЬ ТаблицаПроведения
	|ИЗ
	|	&ТаблицаПроведения КАК ТаблицаПроведения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаВремяНахожденияВСостоянии.ОбъектРемонта,
	|	ТаблицаВремяНахожденияВСостоянии.Период,
	|	ТаблицаВремяНахожденияВСостоянии.ПричинаПростоя,
	|	ТаблицаВремяНахожденияВСостоянии.ДатаОкончания,
	|	ТаблицаВремяНахожденияВСостоянии.ВидЭксплуатации,
	|	ТаблицаВремяНахожденияВСостоянии.ВремяПростоя
	|ПОМЕСТИТЬ ТаблицаВремяНахожденияВСостоянии
	|ИЗ
	|	&ТаблицаВремяНахожденияВСостоянии КАК ТаблицаВремяНахожденияВСостоянии
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаПроведения.ОбъектРемонта,
	|	ТаблицаПроведения.Период КАК Период,
	|	ТаблицаПроведения.ПричинаПростоя КАК ПричинаПростоя,
	|	ТаблицаПроведения.ВидЭксплуатации КАК ВидЭксплуатации,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения
	|ИЗ
	|	ТаблицаПроведения КАК ТаблицаПроведения
	|ГДЕ
	|	ТаблицаПроведения.ВидЭксплуатации.ТипЭксплуатации <> ЗНАЧЕНИЕ(Перечисление.торо_ТипЭксплуатации.Эксплуатация)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаВремяНахожденияВСостоянии.ОбъектРемонта,
	|	ТаблицаВремяНахожденияВСостоянии.ДатаОкончания,
	|	ЗНАЧЕНИЕ(Справочник.торо_ПричиныПростояОборудования.ПустаяСсылка),
	|	ТаблицаВремяНахожденияВСостоянии.ВидЭксплуатации,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|ИЗ
	|	ТаблицаВремяНахожденияВСостоянии КАК ТаблицаВремяНахожденияВСостоянии
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПроведения КАК ТаблицаПроведения
	|		ПО ТаблицаВремяНахожденияВСостоянии.ОбъектРемонта = ТаблицаПроведения.ОбъектРемонта
	|			И (ТаблицаВремяНахожденияВСостоянии.Период = ТаблицаПроведения.Период
	|			ИЛИ ТаблицаВремяНахожденияВСостоянии.ДатаОкончания = ТаблицаПроведения.Период)
	|ГДЕ
	|	ТаблицаВремяНахожденияВСостоянии.ВидЭксплуатации.ТипЭксплуатации <> ЗНАЧЕНИЕ(Перечисление.торо_ТипЭксплуатации.Эксплуатация)";
	
	Запрос.УстановитьПараметр("ТаблицаПроведения",ТаблицаПроведения);
	Запрос.УстановитьПараметр("ТаблицаВремяНахожденияВСостоянии",ТаблицаВремяНахожденияВСостоянии);
	ТаблицаПроведенияДоп = Запрос.Выполнить().Выгрузить();
	
	Движения.торо_ВремяПростояОборудования.Записывать = Истина;
	Движения.торо_ВремяНахожденияВСостоянии.Записывать = Истина;
	Для Каждого Выборка Из ТаблицаВремяНахожденияВСостоянии Цикл
		
		Эксплуатация = Выборка.ВидЭксплуатации;
		
		Если ЗначениеЗаполнено(Эксплуатация) Тогда
			Если Эксплуатация.ТипЭксплуатации = Перечисления.торо_ТипЭксплуатации.Простой Тогда
				
				Если Выборка.ВремяПростоя > 0 Тогда
					Движение = Движения.торо_ВремяПростояОборудования.Добавить();
					Движение.Активность 	= Истина;
					Движение.ОбъектРемонта 	= Выборка.ОбъектРемонта;
					Движение.ПричинаПростоя = Выборка.ПричинаПростоя;
					Движение.ДатаЗапуска 	= Выборка.ДатаОкончания;
					Движение.ВремяПростоя 	= Выборка.ВремяПростоя;
					Движение.Период 		= Выборка.Период; 
				КонецЕсли;
				
				
			КонецЕсли;
			
			Если Выборка.ВремяПростоя > 0 Тогда
				Движение = Движения.торо_ВремяНахожденияВСостоянии.Добавить();
				Движение.ВремяНахожденияВСостоянии 	= Выборка.ВремяПростоя;
				Движение.ДатаИзмененияСостояния 	= Выборка.ДатаОкончания;
				Движение.ОбъектРемонта 				= Выборка.ОбъектРемонта;
				Движение.ВидЭксплуатации 			= Эксплуатация;
				Движение.Период						= Выборка.Период;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла; 
	
	Движения.торо_ОстановленноеОборудование.Записывать = Истина;
	Движения.торо_ОборудованиеНаИспытаниях.Записывать = Истина;
	
	Для Каждого СтрокаДляПроведенияРН Из ТаблицаПроведенияДоп Цикл
		Эксплуатация = СтрокаДляПроведенияРН.ВидЭксплуатации;
		Если Не ЗначениеЗаполнено(Эксплуатация) Тогда
			Продолжить;
		КонецЕсли;
		Если Эксплуатация.ТипЭксплуатации = Перечисления.торо_ТипЭксплуатации.Простой Тогда
			
			Движение = Движения.торо_ОстановленноеОборудование.Добавить();
			Движение.ВидДвижения 	= СтрокаДляПроведенияРН.ВидДвижения;
			Движение.Активность 	= Истина;
			Движение.Количество 	= 1;
			Движение.ОбъектРемонта 	= СтрокаДляПроведенияРН.ОбъектРемонта;
			Движение.Период 		= СтрокаДляПроведенияРН.Период;
			Движение.ПричинаПростоя = СтрокаДляПроведенияРН.ПричинаПростоя;
			
		ИначеЕсли Эксплуатация.ТипЭксплуатации = Перечисления.торо_ТипЭксплуатации.Испытания Тогда
			
			Движение = Движения.торо_ОборудованиеНаИспытаниях.Добавить();
			Движение.ВидДвижения 	= СтрокаДляПроведенияРН.ВидДвижения;
			Движение.Активность 	= Истина;
			Движение.Количество 	= 1;
			Движение.ОбъектРемонта 	= СтрокаДляПроведенияРН.ОбъектРемонта;
			Движение.Период 		= СтрокаДляПроведенияРН.Период;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПодготовитьТаблицуОстановленногоОборудования()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТаблицаОбъектыРемонта.ОбъектРемонта,
	|	ТаблицаОбъектыРемонта.ДатаНачала КАК Период,
	|	ТаблицаОбъектыРемонта.ПричинаПростоя КАК ПричинаПростоя,
	|	1 КАК Количество
	|ПОМЕСТИТЬ ТаблицаОстанова
	|ИЗ
	|	&ТаблицаОбъектыРемонта КАК ТаблицаОбъектыРемонта
	|ГДЕ
	|	ТаблицаОбъектыРемонта.ДатаНачала > ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОстанова.ОбъектРемонта,
	|	ТаблицаОстанова.Период,
	|	ТаблицаОстанова.ПричинаПростоя,
	|	ТаблицаОстанова.Количество,
	|	ИСТИНА КАК Активность
	|ИЗ
	|	ТаблицаОстанова КАК ТаблицаОстанова";
	
	// @ММ\/
	Запрос.УстановитьПараметр("ТаблицаОбъектыРемонта", мТаблицаОбъектовРемонта);
	// @ММ/\
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ДвиженияПоРегистру_торо_КоличествоПусковОР(РежимПроведения, Отказ, Заголовок)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	ТаблицаОбъектыРемонта.ОбъектРемонта КАК ОбъектРемонта,
				   |	ТаблицаОбъектыРемонта.ДатаНачала КАК ДатаНачала,
				   |	ТаблицаОбъектыРемонта.ДатаОкончания КАК ДатаОкончания,
				   |	ТаблицаОбъектыРемонта.ВидЭксплуатации КАК ВидЭксплуатации,
				   |	ТаблицаОбъектыРемонта.ВидПуска КАК ВидПуска,
				   |	ТаблицаОбъектыРемонта.ВидПускаНаПериод КАК ВидПускаНаПериод
				   |ПОМЕСТИТЬ ТаблицаОР
				   |ИЗ
				   |	&ТаблицаОбъектыРемонта КАК ТаблицаОбъектыРемонта
				   |ГДЕ ТаблицаОбъектыРемонта.ВидПуска<>ЗНАЧЕНИЕ(Справочник.торо_ВидыПусковОР.ПустаяСсылка)
				   | 		ИЛИ ТаблицаОбъектыРемонта.ВидПускаНаПериод<>ЗНАЧЕНИЕ(Справочник.торо_ВидыПусковОР.ПустаяСсылка) 
	   			   |;
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	ТаблицаОбъектыРемонта.ОбъектРемонта КАК ОбъектРемонта,
				   |	ТаблицаОбъектыРемонта.ДатаНачала КАК ДатаПуска,
				   |	ТаблицаОбъектыРемонта.ВидПускаНаПериод КАК ВидПуска
				   |ИЗ
				   |	ТаблицаОР КАК ТаблицаОбъектыРемонта
				   |ГДЕ ТаблицаОбъектыРемонта.ВидПускаНаПериод <>ЗНАЧЕНИЕ(Справочник.торо_ВидыПусковОР.ПустаяСсылка)
				   |
				   |ОБЪЕДИНИТЬ ВСЕ
				   |
				   |ВЫБРАТЬ
				   |	ТаблицаОбъектыРемонта.ОбъектРемонта,
				   |	ТаблицаОбъектыРемонта.ДатаОкончания,
				   |	ТаблицаОбъектыРемонта.ВидПуска
				   |ИЗ
				   |	ТаблицаОР КАК ТаблицаОбъектыРемонта
				   |ГДЕ ТаблицаОбъектыРемонта.ВидПуска <>ЗНАЧЕНИЕ(Справочник.торо_ВидыПусковОР.ПустаяСсылка)";

				   
	
	Запрос.УстановитьПараметр("ТаблицаОбъектыРемонта", мТаблицаОбъектовРемонта);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Движения.торо_КоличествоПусковОР.Записывать = Истина;
	Пока Выборка.Следующий() Цикл
		Движение = Движения.торо_КоличествоПусковОР.Добавить();
		Движение.ОбъектРемонта = Выборка.ОбъектРемонта;
		Движение.Период = Выборка.ДатаПуска;
		Движение.ВидПуска = Выборка.ВидПуска;
		Движение.Количество = 1;
	КонецЦикла;
	
	
КонецПроцедуры

Функция СформироватьТаблицуЗапущенногоОборудования()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТаблицаОбъектыРемонта.ОбъектРемонта,
	|	ТаблицаОбъектыРемонта.ДатаОкончания КАК Период,
	|	ТаблицаОбъектыРемонта.ПричинаПростоя КАК ПричинаПростоя,
	|	1 КАК Количество
	|ПОМЕСТИТЬ ТаблицаЗапусков
	|ИЗ
	|	&ТаблицаОбъектыРемонта КАК ТаблицаОбъектыРемонта
	|ГДЕ
	|	ТаблицаОбъектыРемонта.ДатаОкончания > ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗапусков.ОбъектРемонта,
	|	ТаблицаЗапусков.Период,
	|	ТаблицаЗапусков.ПричинаПростоя,
	|	ТаблицаЗапусков.Количество
	|ИЗ
	|	ТаблицаЗапусков КАК ТаблицаЗапусков";
	
	// @ММ\/
	Запрос.УстановитьПараметр("ТаблицаОбъектыРемонта", мТаблицаОбъектовРемонта);
	// @ММ/\
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Проверяет правильность заполнения строк табличной части "ОбъектыРемонта".
//
// Параметры:
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиОбъектыРемонта(Отказ, Заголовок)
	
	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("ОбъектРемонта");
	
	ЗаполненОбщийВидЭксплуатации = (ВидЭксплуатации <> Справочники.торо_ВидыЭксплуатации.ПустаяСсылка());
	Если ВидОперации = Перечисления.торо_ВидыОперацийОтклоненияВРаботеОборудования.ВидЭксплуатацииНаПериод Тогда
		СтруктураОбязательныхПолей.Вставить("ДатаНачала");
		СтруктураОбязательныхПолей.Вставить("ДатаОкончания");
		СтруктураОбязательныхПолей.Вставить("ВидЭксплуатации");
		Если Не ЗаполненОбщийВидЭксплуатации Тогда
			СтруктураОбязательныхПолей.Вставить("ВидЭксплуатацииНаПериод");
		КонецЕсли;
	Иначе
		Если Не ЗаполненОбщийВидЭксплуатации Тогда
			СтруктураОбязательныхПолей.Вставить("ВидЭксплуатации");
		КонецЕсли;
		СтруктураОбязательныхПолей.Вставить("ДатаОкончания");
	КонецЕсли; 
	
	ПроверитьЗаполнениеВидовПусковПричинПростоя(Отказ, Заголовок);
	
	// Вызовем общую процедуру проверки.
	торо_ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "ОбъектыРемонта", СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	Если Не Отказ Тогда 
			
		ТаблицаОбъектовРемонта = мТаблицаОбъектовРемонта.Скопировать(, "ОбъектРемонта");
		ТаблицаОбъектовРемонта.Свернуть("ОбъектРемонта");
		
	КонецЕсли;	
КонецПроцедуры

Процедура ПроверитьЗаполнениеВидовПусковПричинПростоя(Отказ, Заголовок)
	
	ВидДокументаЕстьНаПериод = (ВидОперации = Перечисления.торо_ВидыОперацийОтклоненияВРаботеОборудования.ВидЭксплуатацииНаПериод);
	ВидПускаПростой = Перечисления.торо_ТипЭксплуатации.Простой;
	ФОУчетПусковОборудования = Константы.торо_УчетПусковОборудования.Получить();
	
	Для Каждого СтрокаТЧ Из ОбъектыРемонта Цикл
		
		Если ФОУчетПусковОборудования Тогда
			Если (ЗначениеЗаполнено(СтрокаТЧ.ВидЭксплуатации) И СтрокаТЧ.ВидЭксплуатации.ОбязательныйВводВидаПуска
						ИЛИ ЗначениеЗаполнено(ВидЭксплуатации) И Не ВидДокументаЕстьНаПериод И ВидЭксплуатации.ОбязательныйВводВидаПуска И Не ЗначениеЗаполнено(СтрокаТЧ.ВидЭксплуатации))
					И СтрокаТЧ.ВидЭксплуатации.ТипЭксплуатации <> Перечисления.торо_ТипЭксплуатации.Простой И Не ЗначениеЗаполнено(СтрокаТЧ.ВидПуска)
				ИЛИ (ЗначениеЗаполнено(СтрокаТЧ.ВидЭксплуатацииНаПериод) И СтрокаТЧ.ВидЭксплуатацииНаПериод.ОбязательныйВводВидаПуска 
					И СтрокаТЧ.ВидЭксплуатацииНаПериод.ТипЭксплуатации <> Перечисления.торо_ТипЭксплуатации.Простой 
						ИЛИ ЗначениеЗаполнено(ВидЭксплуатации) И ВидДокументаЕстьНаПериод И ВидЭксплуатации.ОбязательныйВводВидаПуска И Не ЗначениеЗаполнено(СтрокаТЧ.ВидЭксплуатацииНаПериод)) 
					И Не ЗначениеЗаполнено(СтрокаТЧ.ВидПускаНаПериод) 
				
				Тогда
				ШаблонСообщения = НСтр("es='¡En la línea № %1 partes tabulares ""los Objetos de la reparación"" no son rellenadas obligatorio para el relleno los tipos de la puesta en marcha!';ru='В строке № %1 табличной части ""Объекты ремонта"" не заполнены обязательные для заполнения виды пуска!';en='In line No.% 1 of the tabular part “Repair objects” the required start-up types are not filled!'");
				ТекстСообщения = СтрШаблон(ШаблонСообщения, СтрокаТЧ.НомерСтроки);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			КонецЕсли;
		КонецЕсли;
		
		Если ВидДокументаЕстьНаПериод Тогда
			ОбязательноКЗаполнениюПричинаПростоя = ?(ЗначениеЗаполнено(СтрокаТЧ.ВидЭксплуатацииНаПериод), СтрокаТЧ.ВидЭксплуатацииНаПериод.ТипЭксплуатации, ВидЭксплуатации.ТипЭксплуатации) = ВидПускаПростой;
			ОбязательноКЗаполнениюПричинаПростоя = ОбязательноКЗаполнениюПричинаПростоя Или СтрокаТЧ.ВидЭксплуатации.ТипЭксплуатации = ВидПускаПростой;
		Иначе
			ОбязательноКЗаполнениюПричинаПростоя = ?(ЗначениеЗаполнено(СтрокаТЧ.ВидЭксплуатации), СтрокаТЧ.ВидЭксплуатации.ТипЭксплуатации, ВидЭксплуатации.ТипЭксплуатации) = ВидПускаПростой;
		КонецЕсли;
		Если ОбязательноКЗаполнениюПричинаПростоя И Не ЗначениеЗаполнено(СтрокаТЧ.ПричинаПростоя) Тогда
			ШаблонСообщения = НСтр("es='¡En la línea № %1 partes tabulares ""los Objetos de la reparación"" no es rellenado el campo obligatorio para el relleno ""la Causa de las horas muertas""!';ru='В строке № %1 табличной части ""Объекты ремонта"" не заполнено обязательное для заполнения поле ""Причина простоя""!';en='In the line No.% 1 of the tabular part “Repair objects” the required field “Reason for downtime” is not filled!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, СтрокаТЧ.НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция	ОпределитьСостоянияОбъектов(ТЧОбъектыРемонта,СписокОР) 
	
	Если ВидОперации = Перечисления.торо_ВидыОперацийОтклоненияВРаботеОборудования.ВидЭксплуатацииНаПериод Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВременнаяТаблица.ОбъектРемонта КАК ОбъектРемонта,
		               |	ВременнаяТаблица.ДатаНачала КАК ДатаНачала,
		               |	ВременнаяТаблица.ДатаОкончания КАК ДатаОкончания,
		               |	ВременнаяТаблица.ВидЭксплуатации КАК ВидЭксплуатации,
		               |	ВременнаяТаблица.ВидЭксплуатацииНаПериод КАК ВидЭксплуатацииНаПериод
		               |ПОМЕСТИТЬ ТаблицаОбъектовРемонта
		               |ИЗ
		               |	&ТаблицаОР КАК ВременнаяТаблица
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ОбъектРемонта,
		               |	ДатаОкончания
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВременнаяТаблица.ОбъектРемонта КАК ОбъектРемонта,
		               |	ВременнаяТаблица.ДатаНачала КАК ДатаНачала,
		               |	ВременнаяТаблица.ДатаОкончания КАК ДатаОкончания
		               |ПОМЕСТИТЬ ТаблицаОбъектовРемонтаДляЗаполнения
		               |ИЗ
		               |	ТаблицаОбъектовРемонта КАК ВременнаяТаблица
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ОбъектРемонта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаОбъектыРемонта.ОбъектРемонта КАК ОбъектРемонта,
		               |	ТаблицаОбъектыРемонта.ДатаНачала КАК Период,
		               |	ТаблицаОбъектыРемонта.ВидЭксплуатацииНаПериод КАК ВидЭксплуатации
		               |ПОМЕСТИТЬ ТаблицаПроведенияНачало
		               |ИЗ
		               |	ТаблицаОбъектовРемонта КАК ТаблицаОбъектыРемонта
		               |ГДЕ
		               |	ТаблицаОбъектыРемонта.ВидЭксплуатацииНаПериод <> ЗНАЧЕНИЕ(Справочник.торо_ВидыЭксплуатации.ПустаяСсылка)
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ОбъектРемонта,
		               |	Период
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ТаблицаОбъектыРемонта.ОбъектРемонта КАК ОбъектРемонта,
		               |	ТаблицаОбъектыРемонта.ДатаОкончания КАК Дата,
		               |	ТаблицаОбъектыРемонта.ВидЭксплуатации КАК ВидЭксплуатации
		               |ПОМЕСТИТЬ ТаблицаПредыдущиеЭксплуатации
		               |ИЗ
		               |	ТаблицаОбъектовРемонта КАК ТаблицаОбъектыРемонта
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПроведенияНачало КАК ТаблицаПроведенияНачало
		               |		ПО ТаблицаОбъектыРемонта.ОбъектРемонта = ТаблицаПроведенияНачало.ОбъектРемонта
		               |			И ТаблицаОбъектыРемонта.ДатаОкончания = ТаблицаПроведенияНачало.Период
		               |ГДЕ
		               |	ТаблицаПроведенияНачало.Период ЕСТЬ NULL
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ТаблицаОбъектыРемонта.ОбъектРемонта,
		               |	ТаблицаОбъектыРемонта.Период,
		               |	ТаблицаОбъектыРемонта.ВидЭксплуатации
		               |ИЗ
		               |	ТаблицаПроведенияНачало КАК ТаблицаОбъектыРемонта
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ТаблицаРегистрСведений.ОбъектРемонта,
		               |	ТаблицаРегистрСведений.Период,
		               |	ТаблицаРегистрСведений.ВидЭксплуатации
		               |ИЗ
		               |	ТаблицаОбъектовРемонта КАК ТаблицаОбъектыРемонта
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ТекущееСостояниеОР КАК ТаблицаРегистрСведений
		               |		ПО ТаблицаОбъектыРемонта.ОбъектРемонта = ТаблицаРегистрСведений.ОбъектРемонта
		               |			И (ТаблицаРегистрСведений.Период < ТаблицаОбъектыРемонта.ДатаНачала
		               |				ИЛИ ТаблицаРегистрСведений.Период > ТаблицаОбъектыРемонта.ДатаОкончания)
		               |ГДЕ
		               |	ТаблицаРегистрСведений.ОбъектРемонта В(&ОР)
		               |	И ТаблицаРегистрСведений.Регистратор <> &Ссылка
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ОбъектРемонта,
		               |	ВидЭксплуатации,
		               |	Дата
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаОбъектовРемонта.ОбъектРемонта КАК ОбъектРемонта,
		               |	ТаблицаОбъектовРемонта.ДатаНачала КАК ДатаНачала,
		               |	ТаблицаОбъектовРемонта.ДатаОкончания КАК ДатаОкончания,
		               |	МАКСИМУМ(ТаблицаПредыдущиеЭксплуатации.Дата) КАК ДатаСреза1
		               |ПОМЕСТИТЬ ТаблицаСреза1
		               |ИЗ
		               |	ТаблицаОбъектовРемонтаДляЗаполнения КАК ТаблицаОбъектовРемонта
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПредыдущиеЭксплуатации КАК ТаблицаПредыдущиеЭксплуатации
		               |		ПО (ТаблицаПредыдущиеЭксплуатации.Дата < ТаблицаОбъектовРемонта.ДатаНачала)
		               |			И (ТаблицаПредыдущиеЭксплуатации.ОбъектРемонта = ТаблицаОбъектовРемонта.ОбъектРемонта)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТаблицаОбъектовРемонта.ОбъектРемонта,
		               |	ТаблицаОбъектовРемонта.ДатаНачала,
		               |	ТаблицаОбъектовРемонта.ДатаОкончания
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ОбъектРемонта,
		               |	ДатаНачала
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаОбъектовРемонта.ОбъектРемонта КАК ОбъектРемонта,
		               |	ТаблицаОбъектовРемонта.ДатаНачала КАК ДатаНачала,
		               |	ТаблицаОбъектовРемонта.ДатаОкончания КАК ДатаОкончания,
		               |	ТаблицаОбъектовРемонта.ДатаСреза1 КАК ДатаСреза1,
		               |	МАКСИМУМ(ТаблицаПредыдущиеЭксплуатации.Дата) КАК ДатаСреза2
		               |ПОМЕСТИТЬ ТаблицаСреза
		               |ИЗ
		               |	ТаблицаСреза1 КАК ТаблицаОбъектовРемонта
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПредыдущиеЭксплуатации КАК ТаблицаПредыдущиеЭксплуатации
		               |		ПО (ТаблицаПредыдущиеЭксплуатации.Дата < ТаблицаОбъектовРемонта.ДатаОкончания)
		               |			И (ТаблицаПредыдущиеЭксплуатации.ОбъектРемонта = ТаблицаОбъектовРемонта.ОбъектРемонта)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТаблицаОбъектовРемонта.ОбъектРемонта,
		               |	ТаблицаОбъектовРемонта.ДатаНачала,
		               |	ТаблицаОбъектовРемонта.ДатаОкончания,
		               |	ТаблицаОбъектовРемонта.ДатаСреза1
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ОбъектРемонта,
		               |	ДатаСреза1
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаОбъектовРемонта.ОбъектРемонта КАК ОбъектРемонта,
		               |	ТаблицаОбъектовРемонта.ДатаНачала КАК ДатаНачала,
		               |	ТаблицаОбъектовРемонта.ДатаОкончания КАК ДатаОкончания,
		               |	ТаблицаОбъектовРемонта.ДатаСреза1 КАК ДатаСреза1,
		               |	ТаблицаОбъектовРемонта.ДатаСреза2 КАК ДатаСреза2,
		               |	ТаблицаПредыдущиеЭксплуатации.ВидЭксплуатации КАК ВидЭксплуатации1
		               |ПОМЕСТИТЬ ТаблицаЭксплутации1
		               |ИЗ
		               |	ТаблицаСреза КАК ТаблицаОбъектовРемонта
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПредыдущиеЭксплуатации КАК ТаблицаПредыдущиеЭксплуатации
		               |		ПО (ТаблицаПредыдущиеЭксплуатации.Дата = ТаблицаОбъектовРемонта.ДатаСреза1)
		               |			И (ТаблицаПредыдущиеЭксплуатации.ОбъектРемонта = ТаблицаОбъектовРемонта.ОбъектРемонта)
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ОбъектРемонта,
		               |	ДатаСреза2
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ТаблицаОбъектовРемонта.ОбъектРемонта КАК ОбъектРемонта,
		               |	ТаблицаОбъектовРемонта.ДатаНачала КАК ДатаНачала,
		               |	ТаблицаОбъектовРемонта.ДатаОкончания КАК ДатаОкончания,
		               |	ТаблицаОбъектовРемонта.ВидЭксплуатации1 КАК ВидЭксплуатации1,
					   |	ЕстьNULL(ТаблицаОбъектовРемонта.ДатаСреза1,ТаблицаОбъектовРемонта.ОбъектРемонта.ДатаВводаВЭксплуатацию) КАК ДатаСреза1,
					   |	ЕстьNULL(ТаблицаОбъектовРемонта.ДатаСреза2,ТаблицаОбъектовРемонта.ОбъектРемонта.ДатаВводаВЭксплуатацию) КАК ДатаСреза2,
		               |	ТаблицаПредыдущиеЭксплуатации.ВидЭксплуатации КАК ВидЭксплуатации2,
		               |	ЗНАЧЕНИЕ(Справочник.торо_ПричиныПростояОборудования.ПустаяСсылка) КАК ПричинаПростоя
		               |ИЗ
		               |	ТаблицаЭксплутации1 КАК ТаблицаОбъектовРемонта
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПредыдущиеЭксплуатации КАК ТаблицаПредыдущиеЭксплуатации
		               |		ПО (ТаблицаПредыдущиеЭксплуатации.Дата = ТаблицаОбъектовРемонта.ДатаСреза2)
		               |			И (ТаблицаПредыдущиеЭксплуатации.ОбъектРемонта = ТаблицаОбъектовРемонта.ОбъектРемонта)";
		
		Запрос.УстановитьПараметр("ТаблицаОР",ТЧОбъектыРемонта);
		Запрос.УстановитьПараметр("ОР",СписокОР); 
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
				
	Иначе
		
		МенеджерВТ = Новый МенеджерВременныхТаблиц;
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВременнаяТаблица.ОбъектРемонта КАК ОбъектРемонта,
		               |	ВременнаяТаблица.ДатаНачала КАК ДатаНачала,
		               |	ВременнаяТаблица.ДатаОкончания КАК ДатаОкончания,
		               |	ВременнаяТаблица.ВидЭксплуатации КАК ВидЭксплуатации,
		               |	ВременнаяТаблица.ПричинаПростоя КАК ПричинаПростоя
		               |ПОМЕСТИТЬ ТаблицаОбъектовРемонта
		               |ИЗ
		               |	&ТаблицаОР КАК ВременнаяТаблица
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ОбъектРемонта,
		               |	ДатаНачала
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаРегистрСведений.ОбъектРемонта КАК ОбъектРемонта,
		               |	МАКСИМУМ(ТаблицаРегистрСведений.Период) КАК Период,
		               |	ТаблицаОбъектовРемонта.ДатаОкончания КАК ДатаОкончания
		               |ПОМЕСТИТЬ ПериодыПредшествующихЭксплуатацийМакс
		               |ИЗ
		               |	ТаблицаОбъектовРемонта КАК ТаблицаОбъектовРемонта
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ТекущееСостояниеОР КАК ТаблицаРегистрСведений
		               |		ПО ТаблицаОбъектовРемонта.ОбъектРемонта = ТаблицаРегистрСведений.ОбъектРемонта
		               |			И (ТаблицаРегистрСведений.Период < ТаблицаОбъектовРемонта.ДатаОкончания)
		               |ГДЕ
		               |	ТаблицаРегистрСведений.Регистратор <> &Ссылка
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТаблицаРегистрСведений.ОбъектРемонта,
		               |	ТаблицаОбъектовРемонта.ДатаОкончания
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ОбъектРемонта,
		               |	Период
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ПериодыПредшествующихЭксплуатацийМакс.ОбъектРемонта КАК ОбъектРемонта,
		               |	торо_ТекущееСостояниеОР.ВидЭксплуатации КАК ВидЭксплуатации,
		               |	торо_ТекущееСостояниеОР.Период КАК Период
		               |ИЗ
		               |	ПериодыПредшествующихЭксплуатацийМакс КАК ПериодыПредшествующихЭксплуатацийМакс
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ТекущееСостояниеОР КАК торо_ТекущееСостояниеОР
		               |		ПО ПериодыПредшествующихЭксплуатацийМакс.ОбъектРемонта = торо_ТекущееСостояниеОР.ОбъектРемонта
		               |			И ПериодыПредшествующихЭксплуатацийМакс.Период = торо_ТекущееСостояниеОР.Период";
		
		Запрос.УстановитьПараметр("ТаблицаОР",мТаблицаОбъектовРемонта);
		Запрос.УстановитьПараметр("ОР",мТаблицаОбъектовРемонта.ВыгрузитьКолонку("ОбъектРемонта")); 
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		ТабРегистра = Запрос.Выполнить().Выгрузить();
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТабРег.ОбъектРемонта,
		|	ТабРег.Период,
		|	ТабРег.ВидЭксплуатации
		|ПОМЕСТИТЬ ТабРегистра
		|ИЗ
		|	&ТабРег КАК ТабРег
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаОбъектовРемонта.ОбъектРемонта,
		|	ТаблицаОбъектовРемонта.ДатаОкончания КАК Период,
		|	ТаблицаОбъектовРемонта.ВидЭксплуатации,
		|	ТаблицаОбъектовРемонта.ПричинаПростоя КАК ПричинаПростоя
		|ПОМЕСТИТЬ ТабРегистраСведений
		|ИЗ
		|	ТаблицаОбъектовРемонта КАК ТаблицаОбъектовРемонта
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТабРегистра.ОбъектРемонта,
		|	ТабРегистра.Период,
		|	ТабРегистра.ВидЭксплуатации,
		|	торо_ОстановленноеОборудование.ПричинаПростоя
		|ИЗ
		|	ТабРегистра КАК ТабРегистра
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.торо_ОстановленноеОборудование КАК торо_ОстановленноеОборудование
		|		ПО ТабРегистра.ОбъектРемонта = торо_ОстановленноеОборудование.ОбъектРемонта
		|			И ТабРегистра.Период = торо_ОстановленноеОборудование.Период
		|			И торо_ОстановленноеОборудование.ВидДвижения = Значение(ВидДвиженияНакопления.Приход)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабРегистра.Период КАК ДатаНачала,
		|	МИНИМУМ(ТабРегистра1.Период) КАК ДатаОкончания,
		|	ТабРегистра.ОбъектРемонта,
		|	ТабРегистра.ВидЭксплуатации КАК ВидЭксплуатации1,
		|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ДатаСреза1,
		|	ТабРегистра.Период КАК ДатаСреза2,
		|	ТабРегистра.ВидЭксплуатации КАК ВидЭксплуатации2,
		|	ТабРегистра.ПричинаПростоя
		|ИЗ
		|	ТабРегистраСведений КАК ТабРегистра
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабРегистраСведений КАК ТабРегистра1
		|		ПО ТабРегистра.ОбъектРемонта = ТабРегистра1.ОбъектРемонта
		|			И ТабРегистра.Период < ТабРегистра1.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	ТабРегистра.Период,
		|	ТабРегистра.ОбъектРемонта,
		|	ТабРегистра.ВидЭксплуатации,
		|	ТабРегистра.ПричинаПростоя
		|";
		
		Запрос.УстановитьПараметр("ТабРег", ТабРегистра);
		
	КонецЕсли;
	
	Таб = Запрос.Выполнить().Выгрузить();
	
	Если МенеджерВТ <> Неопределено Тогда
		МенеджерВТ.Закрыть();
	КонецЕсли;
	
	Возврат Таб;
	
КонецФункции

Функция ПолучитьСостоянияПроблемаПроведения(пТаблицаПроведения)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаПроведения.ОбъектРемонта,
	               |	ТаблицаПроведения.Период,
	               |	ТаблицаПроведения.ВидЭксплуатации
	               |ПОМЕСТИТЬ ТаблицаПроведения
	               |ИЗ
	               |	&ТаблицаПроведения КАК ТаблицаПроведения
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаПроведения.ОбъектРемонта,
	               |	ТаблицаПроведения.Период,
	               |	ТаблицаПроведения.ВидЭксплуатации КАК ВидЭксплуатацииНовый,
	               |	торо_ТекущееСостояниеОР.Регистратор,
	               |	торо_ТекущееСостояниеОР.ВидЭксплуатации КАК ВидЭксплуатацииСтарый
	               |ИЗ
	               |	ТаблицаПроведения КАК ТаблицаПроведения
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ТекущееСостояниеОР КАК торо_ТекущееСостояниеОР
	               |		ПО ТаблицаПроведения.ОбъектРемонта = торо_ТекущееСостояниеОР.ОбъектРемонта
	               |			И ТаблицаПроведения.Период = торо_ТекущееСостояниеОР.Период
	               |			И (торо_ТекущееСостояниеОР.Регистратор <> &Ссылка)";
	
	Запрос.УстановитьПараметр("ТаблицаПроведения",пТаблицаПроведения);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьИтоговуюТаблицуПроведения()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаОбъектыРемонта.ОбъектРемонта КАК ОбъектРемонта,
	               |	ТаблицаОбъектыРемонта.ДатаНачала КАК ДатаНачала,
	               |	ТаблицаОбъектыРемонта.ДатаОкончания КАК ДатаОкончания,
	               |	ТаблицаОбъектыРемонта.ВидЭксплуатации КАК ВидЭксплуатации,
	               |	ТаблицаОбъектыРемонта.ВидЭксплуатацииНаПериод КАК ВидЭксплуатацииНаПериод,
	               |	ТаблицаОбъектыРемонта.Примечание КАК Примечание,
	               |	ТаблицаОбъектыРемонта.ПричинаПростоя
	               |ПОМЕСТИТЬ ТаблицаОР
	               |ИЗ
	               |	&ТаблицаОбъектыРемонта КАК ТаблицаОбъектыРемонта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаОбъектыРемонта.ОбъектРемонта КАК ОбъектРемонта,
	               |	ТаблицаОбъектыРемонта.ДатаНачала КАК Период,
	               |	ТаблицаОбъектыРемонта.ВидЭксплуатацииНаПериод КАК ВидЭксплуатации,
	               |	ТаблицаОбъектыРемонта.Примечание КАК Примечание,
	               |	ТаблицаОбъектыРемонта.ПричинаПростоя
	               |ПОМЕСТИТЬ ТаблицаПроведенияНачало
	               |ИЗ
	               |	ТаблицаОР КАК ТаблицаОбъектыРемонта
	               |ГДЕ
	               |	ТаблицаОбъектыРемонта.ВидЭксплуатацииНаПериод <> ЗНАЧЕНИЕ(Справочник.торо_ВидыЭксплуатации.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаОбъектыРемонта.ОбъектРемонта,
	               |	ТаблицаОбъектыРемонта.ДатаОкончания КАК Период,
	               |	ТаблицаОбъектыРемонта.ВидЭксплуатации,
	               |	ТаблицаОбъектыРемонта.Примечание КАК Примечание,
	               |	ТаблицаОбъектыРемонта.ПричинаПростоя
	               |ИЗ
	               |	ТаблицаОР КАК ТаблицаОбъектыРемонта
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПроведенияНачало КАК ТаблицаПроведенияНачало
	               |		ПО ТаблицаОбъектыРемонта.ОбъектРемонта = ТаблицаПроведенияНачало.ОбъектРемонта
	               |			И ТаблицаОбъектыРемонта.ДатаОкончания = ТаблицаПроведенияНачало.Период
	               |ГДЕ
	               |	ТаблицаОбъектыРемонта.ВидЭксплуатации <> ЗНАЧЕНИЕ(Справочник.торо_ВидыЭксплуатации.ПустаяСсылка)
	               |	И ТаблицаПроведенияНачало.Период ЕСТЬ NULL 
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТаблицаОбъектыРемонта.ОбъектРемонта,
	               |	ТаблицаОбъектыРемонта.Период,
	               |	ТаблицаОбъектыРемонта.ВидЭксплуатации,
	               |	ТаблицаОбъектыРемонта.Примечание,
	               |	ТаблицаОбъектыРемонта.ПричинаПростоя
	               |ИЗ
	               |	ТаблицаПроведенияНачало КАК ТаблицаОбъектыРемонта";
	
	Запрос.УстановитьПараметр("ТаблицаОбъектыРемонта", мТаблицаОбъектовРемонта);
	
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции

Функция ПроверитьДатыВнутриДокумента(Отказ, пОбъектыРемонта)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаОР.ОбъектРемонта,
	               |	ТаблицаОР.ПричинаПростоя,
	               |	ТаблицаОР.Период,
	               |	ТаблицаОР.ВремяПростоя,
	               |	ТаблицаОР.ДатаОкончания,
	               |	ТаблицаОР.ДатаНачала
	               |ПОМЕСТИТЬ ПроверяемаяТаблица
	               |ИЗ
	               |	&ПроверяемаяТаблица КАК ТаблицаОР
				   |ГДЕ
				   |	ТаблицаОР.ДатаНачала > ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПроверяемаяТаблица.ОбъектРемонта КАК ОбъектРемонта,
	               |	ПроверяемаяТаблица.ДатаНачала КАК ДатаНачала,
	               |	КОЛИЧЕСТВО(ПроверяемаяТаблица.ВремяПростоя) КАК ВремяПростоя
	               |ИЗ
	               |	ПроверяемаяТаблица КАК ПроверяемаяТаблица
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПроверяемаяТаблица КАК ПроверТаблица
	               |		ПО ПроверяемаяТаблица.ОбъектРемонта = ПроверТаблица.ОбъектРемонта
				   |			И ПроверяемаяТаблица.Период < ПроверТаблица.ДатаОкончания И ПроверяемаяТаблица.ДатаОкончания > ПроверТаблица.Период
				   |				И (ПроверяемаяТаблица.Период <> ПроверТаблица.Период ИЛИ ПроверяемаяТаблица.ДатаОкончания <> ПроверТаблица.ДатаОкончания)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПроверяемаяТаблица.ОбъектРемонта,
	               |	ПроверяемаяТаблица.ДатаНачала
	               |
	               |ИМЕЮЩИЕ
	               |	КОЛИЧЕСТВО(ПроверяемаяТаблица.ВремяПростоя) > 1";
				   			  
	
	Запрос.УстановитьПараметр("ПроверяемаяТаблица", пОбъектыРемонта);
	 
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции


Процедура СравнитьДатыСДатойВводаВЭксплуатацию(Отказ,пОбъектыРемонта)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаОР.ОбъектРемонта,
	               |	ТаблицаОР.ДатаНачала,
	               |	ТаблицаОР.ДатаОкончания
	               |ПОМЕСТИТЬ ПроверяемаяТаблица
	               |ИЗ
	               |	&ПроверяемаяТаблица КАК ТаблицаОР
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПроверяемаяТаблица.ОбъектРемонта,
	               |	ПроверяемаяТаблица.ДатаОкончания,
	               |	торо_ОбъектыРемонта.ДатаВводаВЭксплуатацию
	               |ИЗ
	               |	ПроверяемаяТаблица КАК ПроверяемаяТаблица
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	               |		ПО ПроверяемаяТаблица.ОбъектРемонта = торо_ОбъектыРемонта.Ссылка
	               |ГДЕ
	               |	ПроверяемаяТаблица.ДатаОкончания < торо_ОбъектыРемонта.ДатаВводаВЭксплуатацию
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПроверяемаяТаблица.ОбъектРемонта,
	               |	ПроверяемаяТаблица.ДатаНачала,
	               |	торо_ОбъектыРемонта.ДатаВводаВЭксплуатацию
	               |ИЗ
	               |	ПроверяемаяТаблица КАК ПроверяемаяТаблица
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	               |		ПО ПроверяемаяТаблица.ОбъектРемонта = торо_ОбъектыРемонта.Ссылка
	               |ГДЕ
	               |	ПроверяемаяТаблица.ДатаНачала <> ДАТАВРЕМЯ(1, 1, 1)
	               |	И ПроверяемаяТаблица.ДатаНачала < торо_ОбъектыРемонта.ДатаВводаВЭксплуатацию";
	
	Запрос.УстановитьПараметр("ПроверяемаяТаблица",пОбъектыРемонта);
	НеверныеДаты = Запрос.Выполнить().Выгрузить();
	Если НеверныеДаты.Количество() > 0 Тогда
		Отказ = Истина;
		Для Каждого Строка Из НеверныеДаты Цикл
			ШаблонСообщения = НСтр("es='¡Para el objeto de la reparación %1 es imposible cambiar el estado a la fecha de %2 puesto que ella menos de fechas de la introducción en la explotación %3!';ru='Для объекта ремонта %1 невозможно изменить состояние на дату %2 так как она меньше даты ввода в эксплуатацию %3!';en='For repair object% 1, it is not possible to change the state to date% 2 since it is less than the commissioning date% 3!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Строка.ОбъектРемонта, Строка.ДатаОкончания, Строка.ДатаВводаВЭксплуатацию);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

Функция ПроверитьДаты(Отказ,пОбъектыРемонта)
	Запрос= Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаОР.ОбъектРемонта КАК ОбъектРемонта,
	               |	ТаблицаОР.ПричинаПростоя КАК ПричинаПростоя,
	               |	ТаблицаОР.Период КАК Период,
	               |	ТаблицаОР.ВремяПростоя КАК ВремяПростоя,
	               |	ТаблицаОР.ДатаОкончания КАК ДатаОкончания,
	               |	ТаблицаОР.ДатаНачала КАК ДатаНачала
	               |ПОМЕСТИТЬ ПроверяемаяТаблица
	               |ИЗ
	               |	&ПроверяемаяТаблица КАК ТаблицаОР
	               |ГДЕ
	               |	(ТаблицаОР.ДатаНачала > ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |			ИЛИ &СостояниеНаДату)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ОбъектРемонта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПроверяемаяТаблица.ОбъектРемонта КАК ОбъектРемонта,
	               |	ПроверяемаяТаблица.ДатаНачала КАК ДатаНачала,
	               |	ПроверяемаяТаблица.ДатаОкончания КАК ДатаОкончания
	               |ПОМЕСТИТЬ Финальная
	               |ИЗ
	               |	ПроверяемаяТаблица КАК ПроверяемаяТаблица
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.торо_ВремяНахожденияВСостоянии КАК торо_ВремяНахожденияВСостоянии
	               |		ПО ПроверяемаяТаблица.ОбъектРемонта = торо_ВремяНахожденияВСостоянии.ОбъектРемонта
	               |			И ПроверяемаяТаблица.Период < торо_ВремяНахожденияВСостоянии.ДатаИзмененияСостояния
	               |			И ПроверяемаяТаблица.ДатаОкончания > торо_ВремяНахожденияВСостоянии.Период
	               |			И (торо_ВремяНахожденияВСостоянии.Регистратор <> &Ссылка)
	               |
				   //|ОБЪЕДИНИТЬ ВСЕ
				   //|
				   //|ВЫБРАТЬ
				   //|	ПроверяемаяТаблица.ОбъектРемонта,
				   //|	ПроверяемаяТаблица.ДатаНачала,
				   //|	ПроверяемаяТаблица.ДатаОкончания
				   //|ИЗ
				   //|	РегистрСведений.торо_ТекущееСостояниеОР КАК торо_ТекущееСостояниеОР
				   //|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПроверяемаяТаблица КАК ПроверяемаяТаблица
				   //|		ПО (ПроверяемаяТаблица.ОбъектРемонта = торо_ТекущееСостояниеОР.ОбъектРемонта)
				   //|			И (торо_ТекущееСостояниеОР.Регистратор <> &Ссылка)
				   //|			И (ПроверяемаяТаблица.ДатаНачала <= торо_ТекущееСостояниеОР.Период)
				   //|			И (ПроверяемаяТаблица.ДатаОкончания >= торо_ТекущееСостояниеОР.Период)
				   //|			И (&ЭтоДокНаПериод)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Финальная.ОбъектРемонта КАК ОбъектРемонта,
	               |	Финальная.ДатаНачала КАК ДатаНачала,
	               |	Финальная.ДатаОкончания КАК ДатаОкончания
	               |ИЗ
	               |	Финальная КАК Финальная";
	
	Запрос.УстановитьПараметр("ПроверяемаяТаблица", пОбъектыРемонта);
	Запрос.УстановитьПараметр("СостояниеНаДату", ВидОперации = Перечисления.торо_ВидыОперацийОтклоненияВРаботеОборудования.ВидЭксплуатации); 
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ЭтоДокНаПериод", ВидОперации = Перечисления.торо_ВидыОперацийОтклоненияВРаботеОборудования.ВидЭксплуатацииНаПериод);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Проверяет корректность дат: в открытые периоды можно вносить данные, 
// но только периодами ( а не одной датой), причем "вторым" может быть только 
// состояние с типом эксплуатации "Эксплуатация".
//
Функция ПроверитьДатыНезакрытыеИнтервалы(Отказ,пОбъектыРемонта, пТабПроведения)
	Запрос= Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаОР.ОбъектРемонта,
	               |	ТаблицаОР.ПричинаПростоя,
	               |	ТаблицаОР.Период,
	               |	ТаблицаОР.ВремяПростоя,
	               |	ТаблицаОР.ДатаОкончания,
	               |	ТаблицаОР.ДатаНачала
	               |ПОМЕСТИТЬ ПроверяемаяТаблица0
	               |ИЗ
	               |	&ПроверяемаяТаблица КАК ТаблицаОР
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТабПроведения.ОбъектРемонта,
	               |	ТабПроведения.Период
	               |ПОМЕСТИТЬ ТабПроведения
	               |ИЗ
	               |	&ТабПроведения КАК ТабПроведения
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПроверяемаяТаблица.ОбъектРемонта,
	               |	ПроверяемаяТаблица.ПричинаПростоя,
	               |	ПроверяемаяТаблица.Период,
	               |	ПроверяемаяТаблица.ВремяПростоя,
	               |	ПроверяемаяТаблица.ДатаОкончания,
	               |	ПроверяемаяТаблица.ДатаНачала
	               |ПОМЕСТИТЬ ПроверяемаяТаблица
	               |ИЗ
	               |	ПроверяемаяТаблица0 КАК ПроверяемаяТаблица
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПроверяемаяТаблица0 КАК ПроверяемаяТаблица2
	               |		ПО ПроверяемаяТаблица.ДатаОкончания = ПроверяемаяТаблица2.Период
	               |ГДЕ
	               |	ПроверяемаяТаблица2.Период ЕСТЬ NULL 
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ПроверяемаяТаблица.ОбъектРемонта,
	               |	ПроверяемаяТаблица.ДатаОкончания
	               |ПОМЕСТИТЬ НовыеИнтервалыВОткрытыхИнтервалах
	               |ИЗ
	               |	ПроверяемаяТаблица КАК ПроверяемаяТаблица
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.торо_ВремяНахожденияВСостоянии КАК торо_ВремяНахожденияВСостоянии
	               |		ПО ПроверяемаяТаблица.ОбъектРемонта = торо_ВремяНахожденияВСостоянии.ОбъектРемонта
	               |			И ПроверяемаяТаблица.Период < торо_ВремяНахожденияВСостоянии.Период
	               |			И (торо_ВремяНахожденияВСостоянии.Регистратор <> &Ссылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТабПроведения.ОбъектРемонта,
	               |	ТабПроведения.Период
	               |ИЗ
	               |	НовыеИнтервалыВОткрытыхИнтервалах КАК НовыеИнтервалыВОткрытыхИнтервалах
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабПроведения КАК ТабПроведения
	               |		ПО НовыеИнтервалыВОткрытыхИнтервалах.ОбъектРемонта = ТабПроведения.ОбъектРемонта
	               |			И НовыеИнтервалыВОткрытыхИнтервалах.ДатаОкончания = ТабПроведения.Период";
				   
	Запрос.УстановитьПараметр("ПроверяемаяТаблица", пОбъектыРемонта);
	Запрос.УстановитьПараметр("ТабПроведения", пТабПроведения);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ПолучитьТаблицуОбъектовРемонта()
	
	мТаблицаОбъектовРемонта.Очистить();	
	
	Для каждого ТекСтрока из ОбъектыРемонта Цикл
		Если НЕ ТекСтрока.ИзменятьСостояниеПодчиненныхОР Тогда
			НС = мТаблицаОбъектовРемонта.Добавить();
			ЗаполнитьЗначенияСвойств(НС , ТекСтрока);
			
		Иначе
			
			СтруктураПоиска = Новый Структура();
			
			СтруктураПоиска.Вставить("ОбъектРемонта",			ТекСтрока.ОбъектРемонта);
			СтруктураПоиска.Вставить("ДатаНачала",				ТекСтрока.ДатаНачала);
			СтруктураПоиска.Вставить("ДатаОкончания",			ТекСтрока.ДатаОкончания);
			СтруктураПоиска.Вставить("ПричинаПростоя",			ТекСтрока.ПричинаПростоя);
			СтруктураПоиска.Вставить("ВидЭксплуатации",			ТекСтрока.ВидЭксплуатации);
			СтруктураПоиска.Вставить("ВидЭксплуатацииНаПериод",	ТекСтрока.ВидЭксплуатацииНаПериод);
			СтруктураПоиска.Вставить("ВидПуска",				ТекСтрока.ВидПуска);
			СтруктураПоиска.Вставить("ВидПускаНаПериод",		ТекСтрока.ВидПускаНаПериод);
						
			Если мТаблицаОбъектовРемонта.НайтиСтроки(СтруктураПоиска).Количество() Тогда
				Продолжить;
			КонецЕсли;	
			
			НС = мТаблицаОбъектовРемонта.Добавить();
			ЗаполнитьЗначенияСвойств(НС , ТекСтрока);
			
			МассивПодчиненных = торо_РаботаСИерархией20.ПолучитьМассивПодчиненныхОбъектов(ТекСтрока.ОбъектРемонта, ТекСтрока.Иерархия, Дата);
			
			Для Каждого ЭлементСписка Из МассивПодчиненных Цикл
				
				   СтруктураПоиска = Новый Структура();
					
					СтруктураПоиска.Вставить("ОбъектРемонта",			ЭлементСписка);
					СтруктураПоиска.Вставить("ДатаНачала",				ТекСтрока.ДатаНачала);
					СтруктураПоиска.Вставить("ДатаОкончания",			ТекСтрока.ДатаОкончания);
					СтруктураПоиска.Вставить("ПричинаПростоя",			ТекСтрока.ПричинаПростоя);
					СтруктураПоиска.Вставить("ВидЭксплуатации",			ТекСтрока.ВидЭксплуатации);
					СтруктураПоиска.Вставить("ВидЭксплуатацииНаПериод",	ТекСтрока.ВидЭксплуатацииНаПериод);
					СтруктураПоиска.Вставить("ВидПуска",				ТекСтрока.ВидПуска);
					СтруктураПоиска.Вставить("ВидПускаНаПериод",		ТекСтрока.ВидПускаНаПериод);
					
					Если мТаблицаОбъектовРемонта.НайтиСтроки(СтруктураПоиска).Количество() Тогда
						Продолжить;
					КонецЕсли;	
					
					НС = мТаблицаОбъектовРемонта.Добавить();
					
					ЗаполнитьЗначенияСвойств(НС , ТекСтрока);
					НС.ОбъектРемонта		 	= ЭлементСписка;
					
			КонецЦикла;	
 				
		КонецЕсли;
	КонецЦикла;
	
	Если ВидОперации = Перечисления.торо_ВидыОперацийОтклоненияВРаботеОборудования.ВидЭксплуатации тогда
		Для каждого текСтрока из мТаблицаОбъектовРемонта цикл
			ТекСтрока.ВидЭксплуатацииНаПериод = Справочники.торо_ВидыЭксплуатации.ПустаяСсылка(); 
			ТекСтрока.ДатаНачала = '00010101000000'; 
		КонецЦикла;
	КонецЕсли;
	
	// Используем вид эксплуатации документа если не заполнены значения в ТЧ.
	ЗаполнитьВидыЭксплуатацииВТаблицеДляОбработки();
	
КонецПроцедуры

Функция ОпределитьВремяНахожденияВСостоянии()
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.Календари"));
	Если мПредыдущиеЭксплуатации = Неопределено Тогда
		мПредыдущиеЭксплуатации = ОпределитьСостоянияОбъектов(мТаблицаОбъектовРемонта,мТаблицаОбъектовРемонта.ВыгрузитьКолонку("ОбъектРемонта"));
	КонецЕсли;
	Если мПредыдущиеЭксплуатации.Колонки.Найти("ПлановыйГрафикРаботы") = Неопределено Тогда
		мПредыдущиеЭксплуатации.Колонки.Добавить("ПлановыйГрафикРаботы", Новый ОписаниеТипов(МассивТипов));
	КонецЕсли;
	
	Для Каждого СтрокаТО Из мПредыдущиеЭксплуатации Цикл
		
		СтрокаТО.ПлановыйГрафикРаботы = СтрокаТО.ОбъектРемонта.ПлановыйГрафикРаботы;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаОбъектовРемонта.ОбъектРемонта,
	               |	ТаблицаОбъектовРемонта.ДатаНачала,
	               |	ТаблицаОбъектовРемонта.ДатаОкончания,
	               |	ТаблицаОбъектовРемонта.ДатаСреза1,
	               |	ТаблицаОбъектовРемонта.ДатаСреза2,
	               |	ТаблицаОбъектовРемонта.ВидЭксплуатации1,
	               |	ТаблицаОбъектовРемонта.ВидЭксплуатации2,
	               |	ТаблицаОбъектовРемонта.ПлановыйГрафикРаботы,
	               |	ТаблицаОбъектовРемонта.ПричинаПростоя
	               |ПОМЕСТИТЬ ИсходныеДанные
	               |ИЗ
	               |	&мПредыдущиеЭксплуатации КАК ТаблицаОбъектовРемонта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаОбъектовРемонта.ОбъектРемонта,
	               |	ТаблицаОбъектовРемонта.ДатаНачала КАК ДатаОкончания,
	               |	ТаблицаОбъектовРемонта.ДатаСреза1 КАК ДатаНачала,
	               |	ТаблицаОбъектовРемонта.ВидЭксплуатации1 КАК ВидЭксплуатации,
	               |	ТаблицаОбъектовРемонта.ПлановыйГрафикРаботы,
	               |	ТаблицаОбъектовРемонта.ПричинаПростоя
	               |ИЗ
	               |	ИсходныеДанные КАК ТаблицаОбъектовРемонта
	               |ГДЕ
	               |	ТаблицаОбъектовРемонта.ДатаНачала > ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |	И ТаблицаОбъектовРемонта.ДатаСреза1 > ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	ТаблицаОбъектовРемонта.ОбъектРемонта,
	               |	ТаблицаОбъектовРемонта.ДатаОкончания,
	               |	ТаблицаОбъектовРемонта.ДатаСреза2,
	               |	ТаблицаОбъектовРемонта.ВидЭксплуатации2,
	               |	ТаблицаОбъектовРемонта.ПлановыйГрафикРаботы,
	               |	ТаблицаОбъектовРемонта.ПричинаПростоя
	               |ИЗ
	               |	ИсходныеДанные КАК ТаблицаОбъектовРемонта
	               |ГДЕ
	               |	ТаблицаОбъектовРемонта.ДатаОкончания > ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |	И ТаблицаОбъектовРемонта.ДатаСреза2 > ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
				   
				   
	Запрос.УстановитьПараметр("мПредыдущиеЭксплуатации",мПредыдущиеЭксплуатации);
	ВремяНахожденияВСостоянии = Запрос.Выполнить().Выгрузить();
	
	// применить график
	ВременнаяТаблица = СоздатьТаблицуЧасовСохранениеЭксплуатации(ВремяНахожденияВСостоянии);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаОбъектыРемонта.ОбъектРемонта КАК ОбъектРемонта,
	               |	ТаблицаОбъектыРемонта.ДатаНачала КАК ДатаНачала,
	               |	ТаблицаОбъектыРемонта.ДатаОкончания КАК ДатаОкончания,
	               |	ТаблицаОбъектыРемонта.ПричинаПростоя
	               |ПОМЕСТИТЬ ТаблицаОР
	               |ИЗ
	               |	&ТаблицаОбъектыРемонта КАК ТаблицаОбъектыРемонта
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ОбъектРемонта,
	               |	ДатаНачала,
	               |	ДатаОкончания
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВременнаяТаблица.ОбъектРемонта КАК ОбъектРемонта,
	               |	ВременнаяТаблица.Период КАК Период,
	               |	ВременнаяТаблица.ВремяПростоя,
	               |	ВременнаяТаблица.ДатаОкончания,
	               |	ВременнаяТаблица.ВидЭксплуатации,
	               |	ВременнаяТаблица.ПричинаПростоя
	               |ПОМЕСТИТЬ ТаблицаВременПростоя
	               |ИЗ
	               |	&ВременнаяТаблица КАК ВременнаяТаблица
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ОбъектРемонта,
	               |	Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаВременПростоя.ОбъектРемонта КАК ОбъектРемонта,
	               |	ТаблицаВременПростоя.Период КАК Период,
	               |	ТаблицаВременПростоя.ВремяПростоя,
	               |	ТаблицаВременПростоя.ДатаОкончания,
	               |	ТаблицаВременПростоя.ВидЭксплуатации,
	               |	ТаблицаОР.ДатаОкончания КАК ДатаОкончания1,
	               |	ВЫБОР
	               |		КОГДА ТаблицаВременПростоя.ПричинаПростоя <> ЗНАЧЕНИЕ(Справочник.торо_ПричиныПростояОборудования.ПустаяСсылка)
	               |			ТОГДА ТаблицаВременПростоя.ПричинаПростоя
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ТаблицаВременПростоя.Период = ТаблицаОР.ДатаНачала
	               |					ТОГДА ТаблицаОР.ПричинаПростоя
	               |				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.торо_ПричиныПростояОборудования.ПустаяСсылка)
	               |			КОНЕЦ
	               |	КОНЕЦ КАК ПричинаПростоя,
	               |	ТаблицаОР.ДатаНачала
	               |ПОМЕСТИТЬ ТаблицаВременПростояСДатамиИсходногоИнтервала
	               |ИЗ
	               |	ТаблицаВременПростоя КАК ТаблицаВременПростоя
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОР КАК ТаблицаОР
	               |		ПО ТаблицаВременПростоя.ОбъектРемонта = ТаблицаОР.ОбъектРемонта
	               |			И ТаблицаВременПростоя.Период >= ТаблицаОР.ДатаНачала
	               |			И ТаблицаВременПростоя.Период < ТаблицаОР.ДатаОкончания
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ОбъектРемонта,
	               |	Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаВременПростоя.ОбъектРемонта КАК ОбъектРемонта,
	               |	ТаблицаВременПростоя.Период КАК Период,
	               |	ТаблицаВременПростоя.ВремяПростоя,
	               |	ТаблицаВременПростоя.ДатаОкончания,
	               |	ТаблицаВременПростоя.ВидЭксплуатации,
	               |	ТаблицаВременПростоя.ДатаОкончания1 КАК ДатаОкончания1,
	               |	ВЫБОР
	               |		КОГДА ТаблицаВременПростоя.ПричинаПростоя = ЗНАЧЕНИЕ(Справочник.торо_ПричиныПростояОборудования.ПустаяСсылка)
	               |			ТОГДА ТаблицаОР.ПричинаПростоя
	               |		ИНАЧЕ ТаблицаВременПростоя.ПричинаПростоя
	               |	КОНЕЦ КАК ПричинаПростоя,
	               |	ТаблицаВременПростоя.ДатаНачала
	               |ПОМЕСТИТЬ ТаблицаВременПростояСДатамиИсходногоИнтервалаДополненная
	               |ИЗ
	               |	ТаблицаВременПростояСДатамиИсходногоИнтервала КАК ТаблицаВременПростоя
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОР КАК ТаблицаОР
	               |		ПО ТаблицаВременПростоя.ОбъектРемонта = ТаблицаОР.ОбъектРемонта
	               |			И ТаблицаВременПростоя.Период = ТаблицаОР.ДатаОкончания
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ОбъектРемонта,
	               |	Период,
	               |	ДатаОкончания1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаВременПростоя.ОбъектРемонта КАК ОбъектРемонта,
	               |	ТаблицаВременПростоя.Период КАК Период,
	               |	ТаблицаВременПростоя.ВремяПростоя,
	               |	ТаблицаВременПростоя.ДатаОкончания КАК ДатаОкончания,
	               |	ТаблицаВременПростоя.ВидЭксплуатации,
	               |	МИНИМУМ(ТаблицаВременПростоя.ДатаОкончания1) КАК ДатаОкончаниямин
	               |ПОМЕСТИТЬ ДатаОкончанияМинимальногоИнтервала
	               |ИЗ
	               |	ТаблицаВременПростояСДатамиИсходногоИнтервалаДополненная КАК ТаблицаВременПростоя
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТаблицаВременПростоя.ОбъектРемонта,
	               |	ТаблицаВременПростоя.Период,
	               |	ТаблицаВременПростоя.ВремяПростоя,
	               |	ТаблицаВременПростоя.ДатаОкончания,
	               |	ТаблицаВременПростоя.ВидЭксплуатации
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ОбъектРемонта,
	               |	Период,
	               |	ДатаОкончания
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ДатаОкончанияМинимальногоИнтервала.ОбъектРемонта КАК ОбъектРемонта,
	               |	ДатаОкончанияМинимальногоИнтервала.Период КАК Период,
	               |	ДатаОкончанияМинимальногоИнтервала.ВремяПростоя,
	               |	ДатаОкончанияМинимальногоИнтервала.ДатаОкончания,
	               |	ДатаОкончанияМинимальногоИнтервала.ВидЭксплуатации,
	               |	ТаблицаВременПростояСДатамиИсходногоИнтервала.ДатаНачала,
	               |	ТаблицаВременПростояСДатамиИсходногоИнтервала.ПричинаПростоя
	               |ПОМЕСТИТЬ ВТ_ДанныеПоОР
	               |ИЗ
	               |	ДатаОкончанияМинимальногоИнтервала КАК ДатаОкончанияМинимальногоИнтервала
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаВременПростояСДатамиИсходногоИнтервалаДополненная КАК ТаблицаВременПростояСДатамиИсходногоИнтервала
	               |		ПО ДатаОкончанияМинимальногоИнтервала.ОбъектРемонта = ТаблицаВременПростояСДатамиИсходногоИнтервала.ОбъектРемонта
	               |			И ДатаОкончанияМинимальногоИнтервала.Период = ТаблицаВременПростояСДатамиИсходногоИнтервала.Период
	               |			И ДатаОкончанияМинимальногоИнтервала.ДатаОкончаниямин = ТаблицаВременПростояСДатамиИсходногоИнтервала.ДатаОкончания1
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ОбъектРемонта,
	               |	Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДанныеПоОР.ОбъектРемонта КАК ОбъектРемонта,
	               |	ВТ_ДанныеПоОР.Период КАК ПериодОР,
	               |	МАКСИМУМ(торо_ТекущееСостояниеОР.Период) КАК Период
	               |ПОМЕСТИТЬ ВТ_СрезДат
	               |ИЗ
	               |	ВТ_ДанныеПоОР КАК ВТ_ДанныеПоОР
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ТекущееСостояниеОР КАК торо_ТекущееСостояниеОР
	               |		ПО ВТ_ДанныеПоОР.ОбъектРемонта = торо_ТекущееСостояниеОР.ОбъектРемонта
	               |			И ВТ_ДанныеПоОР.Период >= торо_ТекущееСостояниеОР.Период
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ДанныеПоОР.ОбъектРемонта,
	               |	ВТ_ДанныеПоОР.Период
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ОбъектРемонта,
	               |	Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_СрезДат.ОбъектРемонта КАК ОбъектРемонта,
	               |	ВТ_СрезДат.ПериодОР КАК ПериодОР,
	               |	торо_ТекущееСостояниеОР.ПричинаПростоя
	               |ПОМЕСТИТЬ ВТ_СрезПричинПоОрам
	               |ИЗ
	               |	ВТ_СрезДат КАК ВТ_СрезДат
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ТекущееСостояниеОР КАК торо_ТекущееСостояниеОР
	               |		ПО ВТ_СрезДат.ОбъектРемонта = торо_ТекущееСостояниеОР.ОбъектРемонта
	               |			И ВТ_СрезДат.Период = торо_ТекущееСостояниеОР.Период
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ОбъектРемонта,
	               |	ПериодОР
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДанныеПоОР.ОбъектРемонта,
	               |	ВТ_ДанныеПоОР.Период,
	               |	ВТ_ДанныеПоОР.ВремяПростоя,
	               |	ВТ_ДанныеПоОР.ДатаОкончания,
	               |	ВТ_ДанныеПоОР.ВидЭксплуатации,
	               |	ВТ_ДанныеПоОР.ДатаНачала,
	               |	ВЫБОР
	               |		КОГДА ВТ_ДанныеПоОР.ПричинаПростоя <> ЗНАЧЕНИЕ(Справочник.торо_ПричиныПростояОборудования.ПустаяСсылка)
	               |				ИЛИ ВТ_СрезПричинПоОрам.ПричинаПростоя ЕСТЬ NULL 
	               |			ТОГДА ВТ_ДанныеПоОР.ПричинаПростоя
	               |		ИНАЧЕ ВТ_СрезПричинПоОрам.ПричинаПростоя
	               |	КОНЕЦ КАК ПричинаПростоя
	               |ИЗ
	               |	ВТ_ДанныеПоОР КАК ВТ_ДанныеПоОР
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СрезПричинПоОрам КАК ВТ_СрезПричинПоОрам
	               |		ПО ВТ_ДанныеПоОР.ОбъектРемонта = ВТ_СрезПричинПоОрам.ОбъектРемонта
	               |			И ВТ_ДанныеПоОР.Период = ВТ_СрезПричинПоОрам.ПериодОР";
	
	Запрос.УстановитьПараметр("ТаблицаОбъектыРемонта",мТаблицаОбъектовРемонта);
	Запрос.УстановитьПараметр("ВременнаяТаблица",ВременнаяТаблица);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция СоздатьТаблицуЧасовСохранениеЭксплуатации(ТаблицаПериодовПростоя)
	
	Если ТаблицаПериодовПростоя.Количество() Тогда
		
		МенеджерВТ = Новый МенеджерВременныхТаблиц;
		
		МассивГрафиков = ТаблицаПериодовПростоя.ВыгрузитьКолонку("ПлановыйГрафикРаботы");
		
		ТаблицаПериодовПростоя.Сортировать("ДатаНачала Возр");
		
		МинДата = ТаблицаПериодовПростоя[0].ДатаНачала;
		
		ТаблицаПериодовПростоя.Сортировать("ДатаОкончания Убыв");
		
		МаксДата = ТаблицаПериодовПростоя[0].ДатаОкончания;
		
		КалендарныеГрафики.СоздатьВТРасписанияРаботыНаПериод(МенеджерВТ, МассивГрафиков, НачалоДня(МинДата), МаксДата);
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТаблицаПериодовПростоя.ОбъектРемонта КАК ОбъектРемонта,
		               |	ТаблицаПериодовПростоя.ДатаНачала КАК ДатаНачала,
		               |	ТаблицаПериодовПростоя.ДатаОкончания КАК ДатаОкончания,
		               |	ТаблицаПериодовПростоя.ПричинаПростоя КАК ПричинаПростоя,
		               |	ТаблицаПериодовПростоя.ПлановыйГрафикРаботы КАК ПлановыйГрафикРаботы,
		               |	ТаблицаПериодовПростоя.ВидЭксплуатации КАК ВидЭксплуатации
		               |ПОМЕСТИТЬ ТаблицаПериодовПростоя
		               |ИЗ
		               |	&ТаблицаПериодовПростоя КАК ТаблицаПериодовПростоя
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ПлановыйГрафикРаботы
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТРасписанияРаботы.ГрафикРаботы КАК ГрафикРаботы,
		               |	ВТРасписанияРаботы.ДатаГрафика КАК ДатаГрафика,
		               |	ВТРасписанияРаботы.ВремяНачала КАК ВремяНачала,
		               |	ВТРасписанияРаботы.ВремяОкончания КАК ВремяОкончания
		               |ПОМЕСТИТЬ ВТРасписанияРаботыИзм
		               |ИЗ
		               |	ВТРасписанияРаботы КАК ВТРасписанияРаботы
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ГрафикРаботы,
		               |	ДатаГрафика
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТРасписанияРаботыИзм.ГрафикРаботы КАК ГрафикРаботы,
		               |	ВТРасписанияРаботыИзм.ДатаГрафика КАК ДатаГрафика,
		               |	РАЗНОСТЬДАТ(ВТРасписанияРаботыИзм.ВремяНачала, ВТРасписанияРаботыИзм.ВремяОкончания, СЕКУНДА) КАК Секунды,
		               |	РАЗНОСТЬДАТ(ВТРасписанияРаботыИзм.ВремяНачала, ВТРасписанияРаботыИзм.ВремяОкончания, ЧАС) КАК Часы
		               |ПОМЕСТИТЬ ВремТабРаботы
		               |ИЗ
		               |	ВТРасписанияРаботыИзм КАК ВТРасписанияРаботыИзм
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ГрафикРаботы
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаПериодовПростоя.ОбъектРемонта КАК ОбъектРемонта,
		               |	ЕСТЬNULL(ГрафикиРаботыПоСменам.Секунды, 0) КАК Секунды,
		               |	ТаблицаПериодовПростоя.ДатаНачала КАК ДатаНачала,
		               |	ЕСТЬNULL(ГрафикиРаботыПоСменам.Часы, 0) КАК Часы,
		               |	ТаблицаПериодовПростоя.ДатаОкончания КАК ДатаОкончания,
		               |	ТаблицаПериодовПростоя.ПричинаПростоя КАК ПричинаПростоя,
		               |	ТаблицаПериодовПростоя.ВидЭксплуатации КАК ВидЭксплуатации,
		               |	ЕСТЬNULL(ГрафикиРаботыПоСменам.ДатаГрафика, ДатаВремя(1,1,1,0,0,0)) КАК ДатаГрафика,
		               |	ТаблицаПериодовПростоя.ПлановыйГрафикРаботы КАК ПлановыйГрафикРаботы
		               |ПОМЕСТИТЬ ПростойОборудованияПолныеДни
		               |ИЗ
		               |	ТаблицаПериодовПростоя КАК ТаблицаПериодовПростоя
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВремТабРаботы КАК ГрафикиРаботыПоСменам
		               |		ПО ТаблицаПериодовПростоя.ПлановыйГрафикРаботы = ГрафикиРаботыПоСменам.ГрафикРаботы
		               |			И (КОНЕЦПЕРИОДА(ТаблицаПериодовПростоя.ДатаНачала, ДЕНЬ) < ГрафикиРаботыПоСменам.ДатаГрафика)
		               |			И (НАЧАЛОПЕРИОДА(ТаблицаПериодовПростоя.ДатаОкончания, ДЕНЬ) > ГрафикиРаботыПоСменам.ДатаГрафика)
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ПлановыйГрафикРаботы,
		               |	ДатаГрафика
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Расписание.ГрафикРаботы КАК ГрафикРаботы,
		               |	Расписание.ДатаГрафика КАК ДатаГрафика,
		               |	ДОБАВИТЬКДАТЕ(Расписание.ДатаГрафика, СЕКУНДА, РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), Расписание.ВремяНачала, СЕКУНДА)) КАК НачалоРасписания,
		               |	ДОБАВИТЬКДАТЕ(Расписание.ДатаГрафика, СЕКУНДА, РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), Расписание.ВремяОкончания, СЕКУНДА)) КАК КонецРасписания
		               |ПОМЕСТИТЬ НеПолныеДни
		               |ИЗ
		               |	ВТРасписанияРаботыИзм КАК Расписание
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ПростойОборудованияПолныеДни КАК ПолныеДни
		               |		ПО Расписание.ГрафикРаботы = ПолныеДни.ПлановыйГрафикРаботы
		               |			И Расписание.ДатаГрафика = ПолныеДни.ДатаГрафика
		               |ГДЕ
		               |	ПолныеДни.ДатаГрафика ЕСТЬ NULL
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ГрафикРаботы
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаПериодовПростоя.ОбъектРемонта КАК ОбъектРемонта,
		               |	ТаблицаПериодовПростоя.ДатаНачала КАК Период,
		               |	РАЗНОСТЬДАТ(ВЫБОР
		               |			КОГДА ТаблицаПериодовПростоя.ДатаНачала >= НеПолныеДни.НачалоРасписания
		               |				ТОГДА ТаблицаПериодовПростоя.ДатаНачала
		               |			ИНАЧЕ НеПолныеДни.НачалоРасписания
		               |		КОНЕЦ, ВЫБОР
		               |			КОГДА ТаблицаПериодовПростоя.ДатаОкончания >= НеПолныеДни.КонецРасписания
		               |				ТОГДА НеПолныеДни.КонецРасписания
		               |			ИНАЧЕ ТаблицаПериодовПростоя.ДатаОкончания
		               |		КОНЕЦ, СЕКУНДА) КАК ВремяПростоя,
		               |	ТаблицаПериодовПростоя.ДатаОкончания КАК ДатаОкончания,
		               |	ТаблицаПериодовПростоя.ПричинаПростоя КАК ПричинаПростоя,
		               |	ТаблицаПериодовПростоя.ВидЭксплуатации КАК ВидЭксплуатации
		               |ПОМЕСТИТЬ Финальная
		               |ИЗ
		               |	НеПолныеДни КАК НеПолныеДни
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПериодовПростоя КАК ТаблицаПериодовПростоя
		               |		ПО НеПолныеДни.ГрафикРаботы = ТаблицаПериодовПростоя.ПлановыйГрафикРаботы
		               |			И (НеПолныеДни.НачалоРасписания >= ТаблицаПериодовПростоя.ДатаНачала
		               |					И НеПолныеДни.НачалоРасписания <= ТаблицаПериодовПростоя.ДатаОкончания
		               |				ИЛИ НеПолныеДни.КонецРасписания >= ТаблицаПериодовПростоя.ДатаНачала
		               |					И НеПолныеДни.КонецРасписания <= ТаблицаПериодовПростоя.ДатаОкончания
		               |				ИЛИ НеПолныеДни.НачалоРасписания <= ТаблицаПериодовПростоя.ДатаНачала
		               |					И НеПолныеДни.КонецРасписания >= ТаблицаПериодовПростоя.ДатаОкончания)
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ПолныеДни.ОбъектРемонта,
		               |	ПолныеДни.ДатаНачала,
		               |	ПолныеДни.Секунды,
		               |	ПолныеДни.ДатаОкончания,
		               |	ПолныеДни.ПричинаПростоя,
		               |	ПолныеДни.ВидЭксплуатации
		               |ИЗ
		               |	ПростойОборудованияПолныеДни КАК ПолныеДни
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Финальная.ОбъектРемонта КАК ОбъектРемонта,
		               |	Финальная.Период КАК Период,
		               |	СУММА(Финальная.ВремяПростоя) КАК ВремяПростоя,
		               |	Финальная.ДатаОкончания КАК ДатаОкончания,
		               |	Финальная.ПричинаПростоя КАК ПричинаПростоя,
		               |	Финальная.ВидЭксплуатации КАК ВидЭксплуатации
		               |ИЗ
		               |	Финальная КАК Финальная
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	Финальная.ОбъектРемонта,
		               |	Финальная.Период,
		               |	Финальная.ДатаОкончания,
		               |	Финальная.ПричинаПростоя,
		               |	Финальная.ВидЭксплуатации";
		
		Запрос.УстановитьПараметр("ТаблицаПериодовПростоя", ТаблицаПериодовПростоя);
		
		Возврат Запрос.Выполнить().Выгрузить();
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаПериодовПростоя.ОбъектРемонта,
		|	ТаблицаПериодовПростоя.ДатаНачала,
		|	ТаблицаПериодовПростоя.ДатаОкончания,
		|	ТаблицаПериодовПростоя.ПричинаПростоя,
		|	ТаблицаПериодовПростоя.ПлановыйГрафикРаботы,
		|	ТаблицаПериодовПростоя.ВидЭксплуатации
		|ПОМЕСТИТЬ ТаблицаПериодовПростоя
		|ИЗ
		|	&ТаблицаПериодовПростоя КАК ТаблицаПериодовПростоя
		|;
		|
		|ВЫБРАТЬ
		|	ТаблицаПериодовПростоя.ОбъектРемонта,
		|	ТаблицаПериодовПростоя.ДатаНачала КАК Период,
		|	0 КАК ВремяПростоя,
		|	ТаблицаПериодовПростоя.ДатаОкончания,
		|	ТаблицаПериодовПростоя.ПричинаПростоя,
		|	ТаблицаПериодовПростоя.ВидЭксплуатации
		|ИЗ
		|	ТаблицаПериодовПростоя КАК ТаблицаПериодовПростоя";
		
		Запрос.УстановитьПараметр("ТаблицаПериодовПростоя", ТаблицаПериодовПростоя);
		Возврат Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
КонецФункции

Процедура ЗаполнитьДаннымиПоУмолчанию() Экспорт
	
	ПолучитьТаблицуОбъектовРемонта();
	
	Если ВидОперации = Перечисления.торо_ВидыОперацийОтклоненияВРаботеОборудования.ВидЭксплуатацииНаПериод Тогда
		ЗаполнитьВидыЭксплуатацииПоУмолчанию(мТаблицаОбъектовРемонта);
	ИначеЕсли ВидОперации = Перечисления.торо_ВидыОперацийОтклоненияВРаботеОборудования.ВидЭксплуатации Тогда	
		мПредыдущиеЭксплуатации = ОпределитьСостоянияОбъектов(мТаблицаОбъектовРемонта,мТаблицаОбъектовРемонта.ВыгрузитьКолонку("ОбъектРемонта"));
	КонецЕсли;
	
	ТаблицаВремяНахожденияВСостоянии = ОпределитьВремяНахожденияВСостоянии();
		
	Если ВидОперации = Перечисления.торо_ВидыОперацийОтклоненияВРаботеОборудования.ВидЭксплуатацииНаПериод Тогда
		Для Каждого ОР Из ОбъектыРемонта Цикл
			СтрВР = Неопределено;
			Если НЕ ЗначениеЗаполнено(ОР.ВидЭксплуатации) Тогда
				СтрВР = мТаблицаОбъектовРемонта.НайтиСтроки(Новый Структура("ДатаНачала,ОбъектРемонта", ОР.ДатаНачала,ОР.ОбъектРемонта));
				Если СтрВР.Количество() = 0 Тогда
					Продолжить;
				КонецЕсли;
				ОР.ВидЭксплуатации = СтрВР[0].ВидЭксплуатации;
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьВидыЭксплуатацииПоУмолчанию(пОбъектыРемонта)
	ТабОР = пОбъектыРемонта.Скопировать(,"ОбъектРемонта");
	ТабОР.Свернуть("ОбъектРемонта");
	
	мПредыдущиеЭксплуатации = ОпределитьСостоянияОбъектов(пОбъектыРемонта,ТабОР);
	
	
	// Сортируем строки пОбъектыРемонта в порядке возрастания дат окончания периода,
	// чтобы полученное значение заполнялось корректно и учитывалось в дальнейшем.
	пОбъектыРемонта.Сортировать("ОбъектРемонта,ДатаОкончания");
	
	Для Каждого СтрТЧ Из пОбъектыРемонта Цикл
		Если НЕ ЗначениеЗаполнено(СтрТЧ.ВидЭксплуатации)Тогда
			строкаЗаполнения = мПредыдущиеЭксплуатации.НайтиСтроки(Новый Структура("ОбъектРемонта,ДатаНачала",СтрТЧ.ОбъектРемонта, СтрТЧ.ДатаНачала));
			Если строкаЗаполнения.Количество() = 0 Тогда
				Продолжить
			КонецЕсли;
			
			СтрТЧ.ВидЭксплуатации = строкаЗаполнения[0].ВидЭксплуатации1;             

			строкаКорректировки = мПредыдущиеЭксплуатации.НайтиСтроки(Новый Структура("ОбъектРемонта,ДатаСреза1",СтрТЧ.ОбъектРемонта, СтрТЧ.ДатаОкончания));
			Если строкаКорректировки.Количество() > 0 Тогда
				строкаКорректировки[0].ВидЭксплуатации1 = СтрТЧ.ВидЭксплуатации;
			КонецЕсли;
			
			строкаКорректировки = мПредыдущиеЭксплуатации.НайтиСтроки(Новый Структура("ОбъектРемонта,ДатаСреза2",СтрТЧ.ОбъектРемонта, СтрТЧ.ДатаОкончания));
			Если строкаКорректировки.Количество() > 0 Тогда
				строкаКорректировки[0].ВидЭксплуатации2 = СтрТЧ.ВидЭксплуатации;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;


КонецПроцедуры

Процедура ПроверитьБолееПоздниеДокументы(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	торо_ТекущееСостояниеОР.Период КАК Период,
	               |	торо_ТекущееСостояниеОР.ОбъектРемонта КАК ОбъектРемонта,
	               |	торо_ТекущееСостояниеОР.ВидЭксплуатации КАК ВидЭксплуатации,
	               |	торо_ТекущееСостояниеОР.ПричинаПростоя КАК ПричинаПростоя,
	               |	торо_ТекущееСостояниеОР.Примечание КАК Примечание,
	               |	торо_ТекущееСостояниеОР.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ ИсхДанные
	               |ИЗ
	               |	РегистрСведений.торо_ТекущееСостояниеОР КАК торо_ТекущееСостояниеОР
	               |ГДЕ
	               |	торо_ТекущееСостояниеОР.Регистратор = &Регистратор
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ОбъектРемонта,
	               |	ВидЭксплуатации
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ИсхДанные.ВидЭксплуатации КАК ВидЭксплуатации,
	               |	ИсхДанные.ОбъектРемонта КАК ОбъектРемонта,
	               |	ИсхДанные.Период КАК Период,
	               |	ИсхДанные.Примечание КАК Примечание,
	               |	ИсхДанные.ПричинаПростоя КАК ПричинаПростоя,
	               |	торо_ВремяНахожденияВСостоянии.Регистратор КАК Регистратор
	               |ИЗ
	               |	ИсхДанные КАК ИсхДанные
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.торо_ВремяНахожденияВСостоянии КАК торо_ВремяНахожденияВСостоянии
	               |		ПО ИсхДанные.ОбъектРемонта = торо_ВремяНахожденияВСостоянии.ОбъектРемонта
	               |			И ИсхДанные.ВидЭксплуатации = торо_ВремяНахожденияВСостоянии.ВидЭксплуатации
	               |			И ИсхДанные.Период = торо_ВремяНахожденияВСостоянии.Период
	               |			И ИсхДанные.Регистратор <> торо_ВремяНахожденияВСостоянии.Регистратор
	               |ГДЕ
	               |	НЕ торо_ВремяНахожденияВСостоянии.Регистратор ЕСТЬ NULL";
				   
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	резЗапроса = Запрос.Выполнить();
	Если резЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = резЗапроса.Выбрать();
	Отказ = Истина;
	
	Пока Выборка.Следующий() Цикл
		ШаблонСообщения = НСтр("es='En razon de esto el documento es introducido el documento ""%1"". ¡La operación es anulada!';ru='На основании этого документ введён документ ""%1"". Операция отменена!';en='Based on this document, document ""%1"" was entered. Operation canceled!'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, Выборка.Регистратор);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЦикла;
	
КонецПроцедуры

// Для заполнения на основании
Функция ПолучитьСтруктуруОбъектовРемонтаИПростоевИзДокументаОснования(СсылкаНаДокумент, МассивОР = Неопределено)
	
	ИспользоватьОстановочныеРемонты = Константы.торо_ИспользоватьОстановочныеРемонты.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта,
	               |	РемонтыОборудования.ДатаНачала КАК ДатаНачала,
	               |	РемонтыОборудования.ДатаОкончания КАК ДатаОкончания,
	               |	РемонтыОборудования.ID КАК ID,
	               |	РемонтныеРаботы.РемонтнаяРабота КАК РемонтнаяРабота,
	               |	РемонтныеРаботы.Родитель_ID КАК Родитель_ID
	               |ПОМЕСТИТЬ ИсхДанныеПодготовка
	               |ИЗ
	               |	Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтыОборудования КАК РемонтыОборудования
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтныеРаботы КАК РемонтныеРаботы
	               |		ПО (РемонтныеРаботы.РемонтыОборудования_ID = РемонтыОборудования.ID)
	               |			И (РемонтныеРаботы.Ссылка = РемонтыОборудования.Ссылка)
	               |ГДЕ
	               |	РемонтыОборудования.Ссылка = &Ссылка
	               |	И РемонтыОборудования.ОбъектРемонта В(&МассивОР)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РемонтыОборудования.ОбъектРемонта,
	               |	РемонтыОборудования.ДатаНачала,
	               |	РемонтыОборудования.ДатаОкончания,
	               |	РемонтыОборудования.ID,
	               |	РемонтныеРаботы.РемонтнаяРабота,
	               |	РемонтныеРаботы.Родитель_ID
	               |ИЗ
	               |	Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК РемонтыОборудования
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтныеРаботы КАК РемонтныеРаботы
	               |		ПО РемонтыОборудования.ID = РемонтныеРаботы.РемонтыОборудования_ID
	               |			И РемонтыОборудования.Ссылка = РемонтныеРаботы.Ссылка
	               |ГДЕ
	               |	РемонтыОборудования.Ссылка = &Ссылка
	               |	И РемонтыОборудования.ОбъектРемонта В(&МассивОР)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	РемонтнаяРабота
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(торо_ВыявленныеДефекты.ОбъектРемонта, ИсхДанныеПодготовка.ОбъектРемонта) КАК ОбъектРемонта,
	               |	ИсхДанныеПодготовка.ДатаНачала КАК ДатаНачала,
	               |	ИсхДанныеПодготовка.ДатаОкончания КАК ДатаОкончания,
	               |	ИсхДанныеПодготовка.ID КАК ID,
	               |	ИсхДанныеПодготовка.РемонтнаяРабота КАК РемонтнаяРабота,
	               |	ИсхДанныеПодготовка.Родитель_ID КАК Родитель_ID
	               |ПОМЕСТИТЬ ИсхДанные
	               |ИЗ
	               |	ИсхДанныеПодготовка КАК ИсхДанныеПодготовка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефекты
	               |		ПО ИсхДанныеПодготовка.ID = торо_ВыявленныеДефекты.ID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ИсхДанные.ОбъектРемонта КАК ОбъектРемонта,
	               |	ИсхДанные.ДатаНачала КАК ДатаНачала,
	               |	ИсхДанные.ДатаОкончания КАК ДатаОкончания,
	               |	ЗНАЧЕНИЕ(Справочник.торо_ПричиныПростояОборудования.) КАК ВидПростоя
	               |ПОМЕСТИТЬ ВТ_Выгрузка
	               |ИЗ
	               |	ИсхДанные КАК ИсхДанные";
	
	Если ИспользоватьОстановочныеРемонты = Истина Тогда	
		
		Запрос.Текст = Запрос.Текст + ";"+
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИсхДанные.ОбъектРемонта КАК ОбъектРемонта,
		|	ИсхДанные.ДатаНачала КАК ДатаНачала,
		|	ИсхДанные.ДатаОкончания КАК ДатаОкончания,
		|	ИсхДанные.РемонтнаяРабота КАК РемонтнаяРабота,
		|	ИсхДанные.ID КАК ID,
		|	ЕСТЬNULL(торо_ВерсииТехКарт.ТехКарта, ЗНАЧЕНИЕ(Справочник.торо_ТехКарты.)) КАК ТехКарта,
		|	ЕСТЬNULL(торо_ВерсииТехКарт.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК Период
		|ПОМЕСТИТЬ ТехКарты_ВсеДаты
		|ИЗ
		|	ИсхДанные КАК ИсхДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВерсииТехКарт КАК торо_ВерсииТехКарт
		|		ПО ИсхДанные.РемонтнаяРабота = торо_ВерсииТехКарт.ИдентификаторТехКарты
		|			И ИсхДанные.ДатаНачала >= торо_ВерсииТехКарт.Период
		|			И (ИсхДанные.Родитель_ID = """")
		|ГДЕ
		|	НЕ торо_ВерсииТехКарт.ТехКарта ЕСТЬ NULL
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID,
		|	РемонтнаяРабота
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ТехКарты_ВсеДаты.Период) КАК Период,
		|	ТехКарты_ВсеДаты.РемонтнаяРабота КАК РемонтнаяРабота,
		|	ТехКарты_ВсеДаты.ID КАК ID
		|ПОМЕСТИТЬ ТехКарты_МаксДата
		|ИЗ
		|	ТехКарты_ВсеДаты КАК ТехКарты_ВсеДаты
		|
		|СГРУППИРОВАТЬ ПО
		|	ТехКарты_ВсеДаты.ID,
		|	ТехКарты_ВсеДаты.РемонтнаяРабота
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID,
		|	РемонтнаяРабота
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТехКарты_МаксДата.ID КАК ID,
		|	ТехКарты_ВсеДаты.ТехКарта КАК ТехКарта,
		|	ТехКарты_ВсеДаты.ТехКарта.ВыполнениеРемонтаТребуетОстановаОборудования КАК ТребуетОстанова,
		|	ВЫБОР
		|		КОГДА ТехКарты_ВсеДаты.ТехКарта.ВыполнениеРемонтаТребуетОстановаОборудования = ИСТИНА
		|			ТОГДА ТехКарты_ВсеДаты.ТехКарта.ВремяПростоя
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ВремяПростоя,
		|	ВЫБОР
		|		КОГДА ТехКарты_ВсеДаты.ТехКарта.ВыполнениеРемонтаТребуетОстановаОборудования = ИСТИНА
		|			ТОГДА ТехКарты_ВсеДаты.ТехКарта.ВидПростоя
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.торо_ПричиныПростояОборудования.)
		|	КОНЕЦ КАК ВидПростоя
		|ПОМЕСТИТЬ ТехКарты
		|ИЗ
		|	ТехКарты_МаксДата КАК ТехКарты_МаксДата
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТехКарты_ВсеДаты КАК ТехКарты_ВсеДаты
		|		ПО ТехКарты_МаксДата.ID = ТехКарты_ВсеДаты.ID
		|			И ТехКарты_МаксДата.Период = ТехКарты_ВсеДаты.Период
		|			И ТехКарты_МаксДата.РемонтнаяРабота = ТехКарты_ВсеДаты.РемонтнаяРабота
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Таб.ID КАК ID,
		|	МАКСИМУМ(Таб.ВидПростоя) КАК ВидПростоя
		|ПОМЕСТИТЬ ТолькоЗаполненныеВидыПростоя
		|ИЗ
		|	ТехКарты КАК Таб
		|ГДЕ
		|	Таб.ВидПростоя <> ЗНАЧЕНИЕ(Справочник.торо_ПричиныПростояОборудования.)
		|
		|СГРУППИРОВАТЬ ПО
		|	Таб.ID
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИсхДанные.ОбъектРемонта КАК ОбъектРемонта,
		|	ИсхДанные.ДатаНачала КАК ДатаНачала,
		|	ИсхДанные.ДатаОкончания КАК ДатаОкончания,
		|	ИсхДанные.ID КАК ID
		|ПОМЕСТИТЬ ИсхДанныеСвернуто
		|ИЗ
		|	ИсхДанные КАК ИсхДанные
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсхДанные.ОбъектРемонта КАК ОбъектРемонта,
		|	ИсхДанные.ДатаНачала КАК ДатаНачала,
		|	ИсхДанные.ДатаОкончания КАК ДатаОкончания,
		|	ИсхДанные.ID КАК ID,
		|	МАКСИМУМ(ЕСТЬNULL(ТехКарты.ТребуетОстанова, ЛОЖЬ)) КАК ТребуетОстанова,
		|	СУММА(ЕСТЬNULL(ТехКарты.ВремяПростоя, 0)) КАК ВремяПростоя,
		|	МАКСИМУМ(ЕСТЬNULL(ВидыПростоя.ВидПростоя, ЗНАЧЕНИЕ(Справочник.торо_ПричиныПростояОборудования.))) КАК ВидПростоя
		|ПОМЕСТИТЬ ФинДанные
		|ИЗ
		|	ИсхДанныеСвернуто КАК ИсхДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТехКарты КАК ТехКарты
		|		ПО ИсхДанные.ID = ТехКарты.ID
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТолькоЗаполненныеВидыПростоя КАК ВидыПростоя
		|		ПО ИсхДанные.ID = ВидыПростоя.ID
		|
		|СГРУППИРОВАТЬ ПО
		|	ИсхДанные.ID,
		|	ИсхДанные.ОбъектРемонта,
		|	ИсхДанные.ДатаНачала,
		|	ИсхДанные.ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_Выгрузка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ФинДанные.ОбъектРемонта КАК ОбъектРемонта,
		|	ФинДанные.ДатаНачала КАК ДатаНачала,
		|	ВЫБОР
		|		КОГДА ФинДанные.ТребуетОстанова = ИСТИНА
		|			ТОГДА ДОБАВИТЬКДАТЕ(ФинДанные.ДатаНачала, СЕКУНДА, ФинДанные.ВремяПростоя)
		|		ИНАЧЕ ФинДанные.ДатаОкончания
		|	КОНЕЦ КАК ДатаОкончания,
		|	ФинДанные.ВидПростоя КАК ВидПростоя
		|ПОМЕСТИТЬ ВТ_Выгрузка
		|ИЗ
		|	ФинДанные КАК ФинДанные";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + ";" + 
	"ВЫБРАТЬ 
	|	* 
	|ИЗ 
	|	ВТ_Выгрузка КАК ВТ_Выгрузка";
	 
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
	Если МассивОР = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"РемонтыОборудования.ОбъектРемонта В(&МассивОР)", "ИСТИНА");
	Иначе
		Запрос.УстановитьПараметр("МассивОР", МассивОР);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат торо_ОбщегоНазначения.РезультатЗапросаВМассивСтруктур(РезультатЗапроса);
	
КонецФункции

мТаблицаОбъектовРемонта = ОбъектыРемонта.ВыгрузитьКолонки();

#КонецОбласти

#КонецЕсли

