
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура Расш_гкс_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// гкс+ [8078] Тарасов 09.10.2020
	ДобавитьИзменитьЭлементы();
	// гкс- [8078] Тарасов 09.10.2020
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
&ИзменениеИКонтроль("ПолучитьСписокДефектов")
Функция Расш_гкс_ПолучитьСписокДефектов()

	ТабДок=Результат;
	ТабДок.Очистить();
	#Вставка
	СдвигЧП = Час(ТекущаяДатаСеанса()) - Час(ТекущаяДата());
	#КонецВставки

	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_ВыявленныеДефекты.ПФ_MXL_ЖурналДефектов");
	#Вставка
	// гкс+ [8078] Тарасов 09.10.2020
	Если ЭтаФорма["гкс_ОРОтказавшийЭлемент"] Тогда
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_ВыявленныеДефекты.ПФ_MXL_дс_ЖурналДефектов");
	КонецЕсли;
	// гкс- [8078] Тарасов 09.10.2020
	#КонецВставки
	// Заголовок
	Область = Макет.ПолучитьОбласть("Заголовок");
	ТабДок.Вывести(Область);

	// Отбор
	ВывестиОбласть = Ложь;
	Область = Макет.ПолучитьОбласть("Отбор");
	Если ЗначениеЗаполнено(Организация) Тогда
		ВывестиОбласть					= Истина;
		Область.Параметры.Организация	= Организация;
	КонецЕсли;

	Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда
		ВывестиОбласть								= Истина;
		Область.Параметры.ПодразделениеОрганизации	= ПодразделениеОрганизации;
	КонецЕсли;

	Если ЗначениеЗаполнено(ОР) Тогда
		ВывестиОбласть			= Истина;
		Область.Параметры.ОР	= торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(ОР);
	КонецЕсли;

	Если ЗначениеЗаполнено(НачПериода) И ЗначениеЗаполнено(КонПериода) Тогда
		ВывестиОбласть			= Истина;
		// >> [Деснол] [Ушаков А.Д.] [04.10.2019] 
		Область.Параметры.Дата = СтрШаблон(НСтр("es='Período: %1: %2';ru='Период с: %1 по: %2';en='The period from: %1 to: %2'"), НачПериода, КонПериода);
		//Область.Параметры.Дата	= "Период с: " + НачПериода + " по: " + КонПериода;
		// << [Деснол] [Ушаков А.Д.] [04.10.2019] 
	КонецЕсли;
	
	#Вставка
	// гкс+ [8078] Тарасов 09.10.2020
	Если ЭтаФорма["гкс_ОРОтказавшийЭлемент"] Тогда
		Если ЗначениеЗаполнено(ЭтаФорма["гкс_СтатусСогласования"]) Тогда 
			ВывестиОбласть			= Истина;
			Область.Параметры.гкс_СтатусСогласования = ЭтаФорма["гкс_СтатусСогласования"];
		КонецЕсли;
	КонецЕсли;
	// гкс- [8078] Тарасов 09.10.2020
	
	#КонецВставки
	Если ВывестиОбласть Тогда
		ТабДок.Вывести(Область);
	КонецЕсли;

	СписокДефектов = Новый Запрос();		

	СписокДефектов.Текст ="ВЫБРАТЬ
	#Вставка
	// гкс+ [8078] Тарасов 09.10.2020
	|	ЕСТЬNULL(торо_ТекущиеСтатусыСогласованияДокументов.СтатусДокумента, 
	|				ЗНАЧЕНИЕ(Справочник.торо_СтатусыСогласованияДокументовРемонтныхРабот.ПустаяСсылка)) КАК гкс_СтатусСогласования,
	|	торо_ВыявленныеДефектыСписокДефектов.Ссылка КАК Документ,
	// гкс- [8078] Тарасов 09.10.2020
	#КонецВставки
	|	торо_ВыявленныеДефектыСписокДефектов.ID,
	|	торо_ВыявленныеДефектыСписокДефектов.ОбъектРемонта,
	|	торо_ВыявленныеДефектыСписокДефектов.ОтказавшийЭлемент,
	|	торо_ВыявленныеДефектыСписокДефектов.ДефектОписание,
	|	торо_ВыявленныеДефектыСписокДефектов.ДефектПричина,
	|	торо_ВыявленныеДефектыСписокДефектов.ВидДефекта,
	|	торо_ВыявленныеДефектыСписокДефектов.ПоследствияДефекта,
	|	торо_ВыявленныеДефектыСписокДефектов.НаправлениеНаУстранение,
	|	торо_ВыявленныеДефектыСписокДефектов.Ссылка.Организация,
	|	торо_ВыявленныеДефектыСписокДефектов.Ссылка.ДатаОбнаружения,
	|	торо_ВыявленныеДефектыСписокДефектов.Ссылка.Ответственный,
	|	торо_ВыявленныеДефектыСписокДефектов.Ссылка.Подразделение
	|ПОМЕСТИТЬ ВТДефекты
	|ИЗ
	|	Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов
	#Вставка
	// гкс+ [8078] Тарасов 09.10.2020
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ТекущиеСтатусыСогласованияДокументов КАК торо_ТекущиеСтатусыСогласованияДокументов
	|		ПО торо_ВыявленныеДефектыСписокДефектов.Ссылка = торо_ТекущиеСтатусыСогласованияДокументов.СогласуемыйДокумент
	// гкс- [8078] Тарасов 09.10.2020
	#КонецВставки
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &Организация = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ торо_ВыявленныеДефектыСписокДефектов.Ссылка.Организация = &Организация
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ОбъектРемонта = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВЫБОР
	|					КОГДА &ОбъектРемонтаРодитель = НЕОПРЕДЕЛЕНО
	|						ТОГДА торо_ВыявленныеДефектыСписокДефектов.ОбъектРемонта = &ОбъектРемонта
	|					ИНАЧЕ торо_ВыявленныеДефектыСписокДефектов.ОбъектРемонта В ИЕРАРХИИ (&ОбъектРемонтаРодитель)
	|				КОНЕЦ
	|		КОНЕЦ
	#Вставка
	// гкс+ [8078] Тарасов 09.10.2020
	|	И ВЫБОР
	|			КОГДА &гкс_ОтказавшийЭлемент = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ торо_ВыявленныеДефектыСписокДефектов.ОтказавшийЭлемент = &гкс_ОтказавшийЭлемент
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &гкс_СтатусСогласования = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЕСТЬNULL(торо_ТекущиеСтатусыСогласованияДокументов.СтатусДокумента, 
	|					ЗНАЧЕНИЕ(Справочник.торо_СтатусыСогласованияДокументовРемонтныхРабот.ПустаяСсылка)) = &гкс_СтатусСогласования
	|		КОНЕЦ
	// гкс- [8078] Тарасов 09.10.2020
	#КонецВставки
	|	И ВЫБОР
	|			КОГДА &Подразделение = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ торо_ВыявленныеДефектыСписокДефектов.Ссылка.Подразделение = &Подразделение
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &НачПериода = ""НЕОПРЕДЕЛЕНО""
	|					ИЛИ &КонПериода = ""НЕОПРЕДЕЛЕНО""
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ торо_ВыявленныеДефектыСписокДефектов.Ссылка.ДатаОбнаружения МЕЖДУ &НачПериода И &КонПериода
	|		КОНЕЦ
	|	И торо_ВыявленныеДефектыСписокДефектов.Ссылка.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_Ремонты.Регистратор,
	|	торо_Ремонты.ID
	|ПОМЕСТИТЬ ВТРСРемонты
	|ИЗ
	|	РегистрСведений.торо_Ремонты КАК торо_Ремонты
	|ГДЕ
	|	торо_Ремонты.ID В
	|			(ВЫБРАТЬ
	|				ВТДефекты.ID
	|			ИЗ
	|				ВТДефекты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	#Удаление
	|	ВТРСРемонты.Регистратор,
	#КонецУдаления
	#Вставка
	// гкс+ [8078] Тарасов 09.10.2020
	|	ЕСТЬNULL(ВТРСРемонты.Регистратор, ВТДефекты.Документ) КАК Регистратор,
	|	ВТДефекты.гкс_СтатусСогласования КАК гкс_СтатусСогласования,
	// гкс- [8078] Тарасов 09.10.2020
	#КонецВставки
	|	ВТДефекты.ОбъектРемонта КАК ОбъектРемонта,
	|	ВТДефекты.ОтказавшийЭлемент,
	|	ВТДефекты.ДефектОписание,
	|	ВТДефекты.ДефектПричина,
	|	ВТДефекты.ВидДефекта,
	|	ВТДефекты.ПоследствияДефекта,
	|	ВТДефекты.НаправлениеНаУстранение,
	|	ВТДефекты.ID,
	|	ВТДефекты.Подразделение,
	|	ВТДефекты.Ответственный,
	|	ВТДефекты.ДатаОбнаружения,
	|	ВТДефекты.Организация
	|ПОМЕСТИТЬ ВТДефектыОборудования
	|ИЗ
	|	ВТДефекты КАК ВТДефекты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРСРемонты КАК ВТРСРемонты
	|		ПО ВТДефекты.ID = ВТРСРемонты.ID
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ВТРСРемонты.Регистратор) = ТИП(Документ.торо_ВыявленныеДефекты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТДефектыОборудования.Регистратор,
	#Вставка
	// гкс+ [8078] Тарасов 09.10.2020
	|	ВТДефектыОборудования.гкс_СтатусСогласования КАК гкс_СтатусСогласования,
	// гкс- [8078] Тарасов 09.10.2020
	#КонецВставки
	|	ВТДефектыОборудования.ОбъектРемонта,
	|	ВТДефектыОборудования.ОтказавшийЭлемент,
	|	ВТДефектыОборудования.ДефектОписание,
	|	ВТДефектыОборудования.ДефектПричина,
	|	ВТДефектыОборудования.ВидДефекта,
	|	ВТДефектыОборудования.ПоследствияДефекта,
	|	ВТДефектыОборудования.НаправлениеНаУстранение,
	|	ВТДефектыОборудования.ID,
	|	ВЫБОР
	|		КОГДА торо_ЗавершенныеРемонтныеРаботы.ID ЕСТЬ NULL 
	|			ТОГДА isnull(ВТРСРемонты.Регистратор,ВТДефектыОборудования.Регистратор)
	|		ИНАЧЕ торо_ЗавершенныеРемонтныеРаботы.Регистратор
	|	КОНЕЦ КАК Регистратор1,
	|	ВЫБОР
	|		КОГДА торо_ЗавершенныеРемонтныеРаботы.ID ЕСТЬ NULL 
	|			ТОГДА ""Не устранен""
	|		ИНАЧЕ ""Устранен""
	|	КОНЕЦ КАК Устранен,
	|	ВЫБОР
	|		КОГДА торо_ЗавершенныеРемонтныеРаботы.ID ЕСТЬ NULL 
	|			ТОГДА ВЫБОР
	|					КОГДА ВТРСРемонты.ID ЕСТЬ NULL 
	|						ТОГДА ""Зарегистрирован""
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ТИПЗНАЧЕНИЯ(ВТРСРемонты.Регистратор) = ТИП(Документ.торо_ЗаявкаНаРемонт)
	|								ТОГДА ""Работы не начаты""
	|							ИНАЧЕ ""Работы начаты""
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ""Работы завершены""
	|	КОНЕЦ КАК СостояниеРабот,
	|ВЫБОР
	|		КОГДА торо_ЗавершенныеРемонтныеРаботы.ID ЕСТЬ NULL 
	|			ТОГДА ВЫБОР
	|				КОГДА ВТРСРемонты.ID ЕСТЬ NULL 
	|					ТОГДА 0
	|				ИНАЧЕ ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(ВТРСРемонты.Регистратор) = ТИП(Документ.торо_ЗаявкаНаРемонт)
	|						ТОГДА 2
	|					ИНАЧЕ 3
	|				КОНЕЦ
	|			КОНЕЦ
	|		ИНАЧЕ 1
	|КОНЕЦ КАК СтатусСортировки,
	|	ВТДефектыОборудования.ДатаОбнаружения,
	|	ВТДефектыОборудования.Ответственный
	|ИЗ
	|	ВТДефектыОборудования КАК ВТДефектыОборудования
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗавершенныеРемонтныеРаботы КАК торо_ЗавершенныеРемонтныеРаботы
	|		ПО ВТДефектыОборудования.ID = торо_ЗавершенныеРемонтныеРаботы.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРСРемонты КАК ВТРСРемонты
	|		ПО ВТДефектыОборудования.ID = ВТРСРемонты.ID
	|			И (ТИПЗНАЧЕНИЯ(ВТРСРемонты.Регистратор) = ТИП(Документ.торо_НарядНаВыполнениеРемонтныхРабот)
	|				ИЛИ ТИПЗНАЧЕНИЯ(ВТРСРемонты.Регистратор) = ТИП(Документ.торо_ЗаявкаНаРемонт)
	|				ИЛИ ТИПЗНАЧЕНИЯ(ВТРСРемонты.Регистратор) = ТИП(Документ.торо_АктОВыполненииЭтапаРабот))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТДефектыОборудования.ДатаОбнаружения,
	|	СтатусСортировки УБЫВ
	|ИТОГИ ПО
	|	ВТДефектыОборудования.ID";

	// >> [Деснол] [Ушаков А.Д.] [04.10.2019]
	ТекстЗапроса = СписокДефектов.Текст;

	Переводы = Новый Соответствие;

	Переводы.Вставить("_РаботыЗавершены", НСтр("es='El trabajo se haya completado';ru='Работы завершены';en='Work completed'"));
	Переводы.Вставить("_Зарегистрирован", НСтр("es='Registrado';ru='Зарегистрирован';en='Registered'"));
	Переводы.Вставить("_НеУстранен", НСтр("es='No eliminado';ru='Не устранен';en='Not eliminated'"));
	Переводы.Вставить("_Устранен", НСтр("es='Eliminado';ru='Устранен';en='Fixed'"));
	Переводы.Вставить("_РаботыНеНачаты", НСтр("es='El trabajo no se desarrollan';ru='Работы не начаты';en='Work is not started'"));
	Переводы.Вставить("_РаботыНачаты", НСтр("es='El trabajo iniciado';ru='Работы начаты';en='Work started'"));

	СтрокиЗамены = Новый Соответствие;

	СтрокиЗамены.Вставить("""Работы завершены""", "&_РаботыЗавершены");
	СтрокиЗамены.Вставить("""Зарегистрирован""", "&_Зарегистрирован");
	СтрокиЗамены.Вставить("""Не устранен""", "&_НеУстранен");
	СтрокиЗамены.Вставить("""Устранен""", "&_Устранен");
	СтрокиЗамены.Вставить("""Работы не начаты""", "&_РаботыНеНачаты");
	СтрокиЗамены.Вставить("""Работы начаты""", "&_РаботыНачаты");

	Для каждого КодЗамены Из СтрокиЗамены Цикл
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, КодЗамены.Ключ, КодЗамены.Значение);
	КонецЦикла;
	
	#Вставка
	// гкс+ [8078] Тарасов 09.10.2020
	Если ЭтаФорма["гкс_ОРОтказавшийЭлемент"] Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И торо_ВыявленныеДефектыСписокДефектов.Ссылка.Проведен", 
													"И НЕ торо_ВыявленныеДефектыСписокДефектов.Ссылка.ПометкаУдаления");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ГДЕ
										|	ТИПЗНАЧЕНИЯ(ВТРСРемонты.Регистратор) = ТИП(Документ.торо_ВыявленныеДефекты)",
										"		И ТИПЗНАЧЕНИЯ(ВТРСРемонты.Регистратор) = ТИП(Документ.торо_ВыявленныеДефекты)");
	КонецЕсли;
	// гкс- [8078] Тарасов 09.10.2020
	
	#КонецВставки	
	СписокДефектов.Текст = ТекстЗапроса;

	Для каждого Перевод Из Переводы Цикл
		СписокДефектов.УстановитьПараметр(Перевод.Ключ, Перевод.Значение);
	КонецЦикла;
	// << [Деснол] [Ушаков А.Д.] [04.10.2019] 

	// СписокДефектов
	Область = Макет.ПолучитьОбласть("СписокДефектовШапка");
	ТабДок.Вывести(Область);
	ОбластьСписокДефектов = Макет.ПолучитьОбласть("СписокДефектов");

	// Если поле "Организация" заполнено, то в запросе отбор по ней
	Если ЗначениеЗаполнено(Организация) Тогда
		СписокДефектов.УстановитьПараметр("Организация", Организация);
	Иначе
		СписокДефектов.УстановитьПараметр("Организация", Неопределено);
	КонецЕсли;

	// Если поле "Подразделение" заполнено, то в запросе отбор по нему
	Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда
		СписокДефектов.УстановитьПараметр("Подразделение", ПодразделениеОрганизации);
	Иначе
		СписокДефектов.УстановитьПараметр("Подразделение", Неопределено);
	КонецЕсли;	

	// Если поле "ОР" заполнено, то в запросе отбор по нему
	СписокОРДляОтбора = Новый СписокЗначений;
	#Вставка
	// гкс+ [8078] Тарасов 09.10.2020
	Если ЭтаФорма["гкс_ОРОтказавшийЭлемент"] Тогда
		СписокДефектов.УстановитьПараметр("ОбъектРемонта", 			Неопределено);
		СписокДефектов.УстановитьПараметр("ОбъектРемонтаРодитель", 	Неопределено);
		СписокДефектов.УстановитьПараметр("гкс_ОтказавшийЭлемент", 	Неопределено);
		Если ЗначениеЗаполнено(ОР) Тогда
			СписокДефектов.УстановитьПараметр("гкс_ОтказавшийЭлемент", ОР);
		КонецЕсли;
		
		СписокДефектов.УстановитьПараметр("гкс_СтатусСогласования", Неопределено);
		Если ЗначениеЗаполнено(ЭтаФорма["гкс_СтатусСогласования"]) Тогда
			СписокДефектов.УстановитьПараметр("гкс_СтатусСогласования", ЭтаФорма["гкс_СтатусСогласования"]);
		КонецЕсли;
		
	Иначе
		// гкс+ [10.22] Деснол 11.10.2022
		СписокДефектов.УстановитьПараметр("гкс_ОтказавшийЭлемент", 	Неопределено);
		Если ЗначениеЗаполнено(ОР) Тогда
			СписокДефектов.УстановитьПараметр("гкс_ОтказавшийЭлемент", ОР);
		КонецЕсли;
		СписокДефектов.УстановитьПараметр("гкс_СтатусСогласования", Неопределено);
		Если ЗначениеЗаполнено(ЭтаФорма["гкс_СтатусСогласования"]) Тогда
			СписокДефектов.УстановитьПараметр("гкс_СтатусСогласования", ЭтаФорма["гкс_СтатусСогласования"]);
		КонецЕсли;
		// гкс- [10.22] Деснол 11.10.2022
	// гкс- [8078] Тарасов 09.10.2020
	#КонецВставки
	Если ЗначениеЗаполнено(ОР) Тогда
		СписокДефектов.УстановитьПараметр("ОбъектРемонтаРодитель", Неопределено);
		СписокДефектов.УстановитьПараметр("ОбъектРемонта", ОР);	
	Иначе
		СписокДефектов.УстановитьПараметр("ОбъектРемонта", Неопределено);
		СписокДефектов.УстановитьПараметр("ОбъектРемонтаРодитель", Неопределено);
	КонецЕсли;	
	#Вставка
	// гкс+ [8078] Тарасов 09.10.2020
	КонецЕсли;
	// гкс- [8078] Тарасов 09.10.2020
	#КонецВставки
	
	// Если поля "Даты" заполнено, то в запросе отбор по ним
	Если ЗначениеЗаполнено(НачПериода) И ЗначениеЗаполнено(КонПериода) Тогда
		СписокДефектов.УстановитьПараметр("НачПериода", НачалоДня(НачПериода));
		СписокДефектов.УстановитьПараметр("КонПериода", КонецДня(КонПериода));
	Иначе
		СписокДефектов.УстановитьПараметр("НачПериода", "НЕОПРЕДЕЛЕНО");
		СписокДефектов.УстановитьПараметр("КонПериода", "НЕОПРЕДЕЛЕНО");
	КонецЕсли;		

	ДефектыВыборка		 = СписокДефектов.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ДефектыВыборка.Следующий() Цикл 

		Выборка = ДефектыВыборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Если Выборка.Следующий() Тогда
			ОбластьСписокДефектов.Параметры.Заполнить(Выборка);
			ОбластьСписокДефектов.Параметры.ОбъектРемонтаПредставление = торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(Выборка.ОбъектРемонта);
			ОбластьСписокДефектов.Параметры.ОтказавшийЭлементПредставление = торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(Выборка.ОтказавшийЭлемент);
			#Вставка
			ОбластьСписокДефектов.Параметры.ДатаОбнаружения = ОбластьСписокДефектов.Параметры.ДатаОбнаружения 
				+ (СдвигЧП * 3600);
			#КонецВставки
			ТабДок.Вывести(ОбластьСписокДефектов);
		КонецЕсли;

	КонецЦикла;

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	// Зададим параметры макета
	ТабДок.ПолеСверху         = 0;
	ТабДок.ПолеСлева          = 0;
	ТабДок.ПолеСнизу          = 0;
	ТабДок.ПолеСправа         = 0;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.АвтоМасштаб  = ИСТИНА;

	Возврат ТабДок;

КонецФункции

// гкс+ [8078] Тарасов 09.10.2020
&НаСервере
Процедура ДобавитьИзменитьЭлементы()

	НовыеРеквизиты = Новый Массив();
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("гкс_ОРОтказавшийЭлемент", Новый ОписаниеТипов("Булево")));
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("гкс_СтатусСогласования", 
														Новый ОписаниеТипов("СправочникСсылка.торо_СтатусыСогласованияДокументовРемонтныхРабот")));
	
	ИзменитьРеквизиты(НовыеРеквизиты);
	
	Если Параметры.Свойство("ПараметрыОтбора") Тогда
		Если Параметры.ПараметрыОтбора.Свойство("гкс_ОРОтказавшийЭлемент", ЭтаФорма["гкс_ОРОтказавшийЭлемент"]) Тогда
			Элементы.ОР.Заголовок = НСтр("ru='Отказавший элемент';en='Failed item';es='El elemento que ha renunciado'");
			
			НЭлем = Элементы.Вставить("гкс_СтатусСогласования",Тип("ПолеФормы"), ЭтаФорма, Элементы.ОР);
			НЭлем.Вид = ВидПоляФормы.ПолеВвода;
			НЭлем.ПутьКДанным = "гкс_СтатусСогласования";
			НЭлем.Заголовок = НСтр("ru='Статус cогласования';en='Approval status';es='Estado de aprobación'");
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // гкс- [8078] Тарасов 09.10.2020

#КонецОбласти
