// гкс+ [Комиссия] Куст 29.10.2020
&НаСервере
Процедура Расш_гкс_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ДобавитьНовыеЭлементы();
КонецПроцедуры
// гкс- [Комиссия] Куст 29.10.2020

// гкс+ [Комиссия] Куст 29.10.2020
&НаСервере
Процедура ДобавитьНовыеЭлементы()
	НЭлем = Элементы.Добавить("гкс_ГруппаПриказа", Тип("ГруппаФормы"));
	НЭлем.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НЭлем.ОтображатьЗаголовок = Ложь;
	//
	НЭлем = Элементы.Добавить("гкс_ДатаПриказа", Тип("ПолеФормы"), Элементы["гкс_ГруппаПриказа"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Объект.гкс_ДатаПриказа";
	//
	НЭлем = Элементы.Добавить("гкс_НомерПриказа", Тип("ПолеФормы"), Элементы["гкс_ГруппаПриказа"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Объект.гкс_НомерПриказа";
	//
	Элементы.Переместить(Элементы["гкс_ГруппаПриказа"], ЭтаФорма, Элементы.Председатель);
КонецПроцедуры
// гкс- [Комиссия] Куст 29.10.2020