////////////////////////////////////////////////////////////////////////////////
// торо_Печать: методы для печати.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Выводит документ на печать.
//
// Параметры:
//		ИмяОбъектаМетаданных - Строка - Имя объекта метаданных. Например "Документ.торо_АктОВыполненииЭтапаРабот".
//		ИмяПечатнойФормы - Строка - имя печатной формы.
//		МассивОбъектов - Массив, Ссылка - ссылка или массив ссылок на печатаемые объекты.
//		ПараметрыПечати - Структура - дополнительные параметры.
//
Процедура НапечататьДокумент(ИмяОбъектаМетаданных, ИмяПечатнойФормы, МассивОбъектов, ПараметрыПечати = Неопределено) Экспорт
	
	ПечатьДокументовБезПредварительногоПросмотра = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	
	Если ПечатьДокументовБезПредварительногоПросмотра Тогда
		
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер(
			ИмяОбъектаМетаданных, ИмяПечатнойФормы, МассивОбъектов, ПараметрыПечати);
		
	Иначе
		
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
			ИмяОбъектаМетаданных, ИмяПечатнойФормы, МассивОбъектов, Неопределено, ПараметрыПечати);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗапроситьУПользователяДополнительныеПараметрыПередПечатью(ПараметрыПечати) Экспорт
	
	Если ПараметрыПечати.ОбъектыПечати.Количество() = 1 Тогда
		
		ИмяТаблицыРемонтов = "РемонтыОборудования";
		Если ПараметрыПечати.МенеджерПечати = "Документ.торо_ВыявленныеДефекты" Тогда
			ИмяТаблицыРемонтов = "СписокДефектов";
		ИначеЕсли ПараметрыПечати.МенеджерПечати = "Документ.торо_НарядНаРегламентноеМероприятие" Тогда
			ИмяТаблицыРемонтов = "РегламентныеМероприятия";
		ИначеЕсли ПараметрыПечати.МенеджерПечати = "Документ.торо_АктОВыполненииРегламентногоМероприятия" Тогда
			ИмяТаблицыРемонтов = "Мероприятия";
		КонецЕсли;
		
		РемонтыОборудования = торо_ПечатьСервер.ПолучитьСтруктуруДанныхРемонтовОборудования(ПараметрыПечати.ОбъектыПечати[0], ИмяТаблицыРемонтов);
		
		ДополнительныеПараметры = Новый Структура("ПараметрыПечати", ПараметрыПечати);
		
		Если РемонтыОборудования.Количество() = 1 Тогда
			МассивID = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(РемонтыОборудования[0].ID);
			ПослеВыбораРемонтовДляПечати(МассивID, ДополнительныеПараметры);
		Иначе 		
			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораРемонтовДляПечати", ЭтотОбъект, ДополнительныеПараметры);
			ОткрытьФорму("ОбщаяФорма.торо_ФормаВыбораИзОбъектовОборудования", Новый Структура("РемонтыОборудования, КлючНазначенияИспользования", РемонтыОборудования, "ПАРАМЕТРЫ_ПЕЧАТИ_" + ПараметрыПечати.Идентификатор), ПараметрыПечати.Форма, ПараметрыПечати.ОбъектыПечати[0],,,ОписаниеОповещения);
		КонецЕсли;
	Иначе
		
		НапечататьДокумент(ПараметрыПечати.МенеджерПечати, ПараметрыПечати.Идентификатор, ПараметрыПечати.ОбъектыПечати, Новый Структура);		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ПослеВыбораРемонтовДляПечати(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ПараметрыПечати = ДополнительныеПараметры.ПараметрыПечати;
	Параметры = Новый Структура("МассивID", Результат);
	
	НапечататьДокумент(ПараметрыПечати.МенеджерПечати,
			ПараметрыПечати.Идентификатор,
			ПараметрыПечати.ОбъектыПечати,
			Параметры);

КонецПроцедуры
		
Функция ВыбратьГарантийныеРемонтыДляПечати(ПараметрыПечати) Экспорт
	
	ИмяТаблицыРемонтов = "СписокДефектов";
	РемонтыОборудования = торо_ПечатьСервер.ПолучитьСтруктуруДанныхГарантийнхРемонтов(ПараметрыПечати.ОбъектыПечати[0], ИмяТаблицыРемонтов);
	
	ДополнительныеПараметры = Новый Структура("ПараметрыПечати", ПараметрыПечати);
	
	Если РемонтыОборудования.Количество() > 0 Тогда
		МассивID = Новый Массив;
		Для каждого Элем Из РемонтыОборудования Цикл 
			МассивID.Добавить(Элем.ID);
		КонецЦикла;
		
		ПослеВыбораРемонтовДляПечати(МассивID, ДополнительныеПараметры);
	Иначе
		ТекстСообщения = НСтр("es='El acta de reclamación se estructura solamente para los objetos sobre el servicio de garantía. "
"¡En el documento faltan los objetos sobre el servicio de garantía!';ru='Рекламационный акт оформляется только для объектов на гарантийном обслуживании."
"В документе отсутствуют объекты на гарантийном обслуживании!';en='A reclamation act is issued only for objects on warranty service."
"The document does not contain objects for warranty service!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции 

Функция ЗапроситьУПользователяДополнительныеПараметрыПередПечатьюКС2_КС3(ПараметрыПечати) Экспорт
	
	Если ПараметрыПечати.Идентификатор = "ФормаКС2" Тогда
		ИмяФормы = "КС-2";
		КлючНазначенияИспользования = "ПАРАМЕТРЫ_ПЕЧАТИ_ПечатьФормаКС2";
	Иначе
		ИмяФормы = "КС-3";
		КлючНазначенияИспользования = "ПАРАМЕТРЫ_ПЕЧАТИ_ПечатьФормаКС3";
	КонецЕсли;
	
	Если ПараметрыПечати.ОбъектыПечати.Количество() = 1 Тогда
		
		РемонтыОборудования = торо_ПечатьСервер.ПолучитьСтруктуруДанныхРемонтовОборудованияСПодрядчиками(ПараметрыПечати.ОбъектыПечати[0]);
		ДополнительныеПараметры = Новый Структура("ПараметрыПечати", ПараметрыПечати);
		
		Если РемонтыОборудования.Количество() = 0 Тогда
			ШаблонСообщения = НСтр("es='En el documento ""%1"" no es indicado ni un contratista. Las formas %2 no serán creadas.';ru='В документе ""%1"" не указан ни один подрядчик. Формы %2 не будут созданы.';en=""No contractor specified in document '% 1'. Forms% 2 will not be created.""");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ПараметрыПечати.ОбъектыПечати[0], ИмяФормы);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		ИначеЕсли РемонтыОборудования.Количество() = 1 Тогда
			МассивID = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(РемонтыОборудования[0].ID);
			ПослеВыбораРемонтовДляПечатиКС2_КС3(МассивID, ДополнительныеПараметры);
		Иначе 		
			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораРемонтовДляПечатиКС2_КС3", ЭтотОбъект, ДополнительныеПараметры);
			ОткрытьФорму("ОбщаяФорма.торо_ФормаВыбораИзОбъектовОборудования", Новый Структура("РемонтыОборудования, КлючНазначенияИспользования", РемонтыОборудования, КлючНазначенияИспользования), ПараметрыПечати.Форма, ПараметрыПечати.ОбъектыПечати[0],,,ОписаниеОповещения);
		КонецЕсли;
		
	Иначе
		
		НапечататьДокумент(ПараметрыПечати.МенеджерПечати, ПараметрыПечати.Идентификатор, ПараметрыПечати.ОбъектыПечати, Новый Структура);
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ПослеВыбораРемонтовДляПечатиКС2_КС3(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ПараметрыПечати = ДополнительныеПараметры.ПараметрыПечати;
	
	Если ПараметрыПечати.Идентификатор = "ФормаКС2" Тогда
		ТекстЭлементаВсеПодрядчики = НСтр("es='(КС-2 para todos los contratistas)';ru='(КС-2 для всех подрядчиков)';en='(KS-2 for all contractors)'");
		ЗаголовокСпискаВыбора = НСтр("es='Formar КС-2 para...';ru='Формировать КС-2 для...';en='Form KS-2 for ...'");
	Иначе
		ТекстЭлементаВсеПодрядчики = НСтр("es='(КС-3 para todos los contratistas)';ru='(КС-3 для всех подрядчиков)';en='(KS-3 for all contractors)'");
		ЗаголовокСпискаВыбора = НСтр("es='Formar КС-3 para...';ru='Формировать КС-3 для...';en='Form KS-3 for ...'");
	КонецЕсли;
	
	МассивПодрядчиков = торо_ПечатьСервер.ПолучитьСписокПодрядчиковПоРемонтам(ПараметрыПечати.ОбъектыПечати[0], Результат);

	// Перенесено из ТОиР 1.3
	УникальныйНомерВсе = Новый УникальныйИдентификатор;
	СписокПодрядчиков = Новый СписокЗначений;
	СписокПодрядчиков.Добавить(УникальныйНомерВсе, ТекстЭлементаВсеПодрядчики);
	//
	Для Каждого ТекПодрядчик Из МассивПодрядчиков Цикл
		СписокПодрядчиков.Добавить(ТекПодрядчик);
	КонецЦикла;		
	
	ДополнительныеПараметры.Вставить("МассивID", Результат);
	ДополнительныеПараметры.Вставить("СписокПодрядчиков", СписокПодрядчиков);
	ДополнительныеПараметры.Вставить("УникальныйНомерВсе", УникальныйНомерВсе);
	
	Описаниеоповещения = Новый ОписаниеОповещения("ПослеВыбораКонтрагентовДляПечатиКС2_КС3", ЭтотОбъект, ДополнительныеПараметры);
	СписокПодрядчиков.ПоказатьВыборЭлемента(Описаниеоповещения, ЗаголовокСпискаВыбора);

КонецПроцедуры
		
Процедура ПослеВыбораКонтрагентовДляПечатиКС2_КС3(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	СписокПодрядчиков = ДополнительныеПараметры.СписокПодрядчиков;
	УникальныйНомерВсе = ДополнительныеПараметры.УникальныйНомерВсе;
	
	ФормироватьКСДля = Новый СписокЗначений;
	Если ВыбранныйЭлемент.Значение = УникальныйНомерВсе Тогда
		СписокПодрядчиков.Удалить(СписокПодрядчиков.НайтиПоЗначению(УникальныйНомерВсе));
		ФормироватьКСДля = СписокПодрядчиков.Скопировать();
	Иначе
		ФормироватьКСДля.Добавить(ВыбранныйЭлемент.Значение);
	КонецЕсли; 
	
	ПараметрыПечати = ДополнительныеПараметры.ПараметрыПечати;
	Параметры = Новый Структура("МассивID, Подрядчики", ДополнительныеПараметры.МассивID, ФормироватьКСДля);
	
	НапечататьДокумент(ПараметрыПечати.МенеджерПечати,
			ПараметрыПечати.Идентификатор,
			ПараметрыПечати.ОбъектыПечати,
			Параметры);
	
КонецПроцедуры


Функция ОткрытьФормуЖурналаДефектов(ПараметрыПечати) Экспорт
	
	ОткрытьФорму("Документ.торо_ВыявленныеДефекты.Форма.ФормаЖурналаДефектов", , ПараметрыПечати.Форма, ПараметрыПечати.Идентификатор);
	Возврат Неопределено;
	
КонецФункции

Функция ОбработатьКомандуПечатиППР(ПараметрыПечати) Экспорт
	
	ПараметрКоманды = ПараметрыПечати.ОбъектыПечати;
	
	Если ПараметрКоманды.Количество() = 1 Тогда	
		ДопПараметры = Новый Структура;
		Доппараметры.Вставить("ПараметрыПечати", ПараметрыПечати);
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораПараметровПечатиППР", ЭтотОбъект, ДопПараметры);
		
		ПараметрыФормы = Новый Структура("ДокППР, КлючНазначенияИспользования", ПараметрКоманды[0], "ПАРАМЕТРЫ_ПЕЧАТИ_" + ПараметрыПечати.Идентификатор); 
		ОткрытьФорму(ПараметрыПечати.МенеджерПечати + ".Форма.ФормаВводаПериода", ПараметрыФормы, ПараметрыПечати.Форма, ПараметрКоманды[0],,,ОписаниеОповещения);
	Иначе
		НапечататьДокумент(ПараметрыПечати.МенеджерПечати, ПараметрыПечати.Идентификатор, ПараметрыПечати.ОбъектыПечати, Новый Структура);
	КонецЕсли;
	Возврат Неопределено;
	
КонецФункции

Процедура ПослеВыбораПараметровПечатиППР(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПечати = ДополнительныеПараметры.ПараметрыПечати;

	Параметры = Новый Структура;
	Параметры.Вставить("Параметры", Результат);
	
	НапечататьДокумент(ПараметрыПечати.МенеджерПечати,
			ПараметрыПечати.Идентификатор,
			ПараметрыПечати.ОбъектыПечати,
			Параметры);
	
КонецПроцедуры

Функция ОткрытьЖурналРемонтовППР(ПараметрыПечати) Экспорт
	
	ПараметрыДляПечати = Новый Структура("ДокументППР", ПараметрыПечати.ОбъектыПечати[0]);
	ОткрытьФорму("Документ.торо_ПланГрафикРемонта.Форма.ФормаЖурналаРемонтов", ПараметрыДляПечати, ПараметрыПечати.Форма, ПараметрыПечати.Идентификатор);
	Возврат Неопределено;
КонецФункции

Функция ОткрытьПланФактныйАнализППР(ПараметрыПечати) Экспорт
	
	СсылкаНаДокумент = ПараметрыПечати.ОбъектыПечати[0];
	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаДокумент, "Проведен, ДатаПланирования");
	
	Если НЕ РеквизитыДокумента.Проведен Тогда
		ТекстСообщения = НСтр("es='El informe no se forma en razon de los documentos no pasados. Pasen el documento.';ru='Отчет не формируется на основании непроведенных документов. Проведите документ.';en='The report is not generated on the basis of non-conducted documents. Swipe the document.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат Неопределено;
	КонецЕсли;
	
	ПериодОтчета = Новый СтандартныйПериод();
	ПериодОтчета.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	ПериодОтчета.ДатаНачала = РеквизитыДокумента.ДатаПланирования;
	ПериодОтчета.ДатаОкончания = торо_ПечатьСервер.ДатаОкончанияПланированияПланГрафикППР(СсылкаНаДокумент);
	ПараметрыОтбора = Новый Структура("ПериодОтчета, ДокументППР", ПериодОтчета, СсылкаНаДокумент);
	ПараметрыОтчета = Новый Структура("ПараметрыОтбора", ПараметрыОтбора);
	Параметры = Новый Структура("ПараметрыОтчета", ПараметрыОтчета);
	ОткрытьФорму("Отчет.торо_ПланФактныйАнализППР.Форма", Параметры);
	
КонецФункции


Функция ЗапроситьДопПараметрыПечатиОР(ПараметрыПечати) Экспорт
	
	МассивОбычныхОР = Новый Массив;
	Для каждого ОбъектПечати из ПараметрыПечати.ОбъектыПечати Цикл
		Если ТипЗнч(ОбъектПечати) = Тип("СправочникСсылка.торо_ОбъектыРемонта") 
			И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектПечати, "ЭтоГруппа", Истина) = Ложь Тогда
			МассивОбычныхОР.Добавить(ОбъектПечати);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыПечати.ОбъектыПечати = МассивОбычныхОР;
	Если МассивОбычныхОР.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("es='¡La prensa es posible solamente para los objetos de la reparación!';ru='Печать возможна только для объектов ремонта!';en='Printing is possible only for repair objects!'"));
	Иначе	
		ДополнительныеПараметры = Новый Структура("ПараметрыПечати", ПараметрыПечати);
		ДополнительныеПараметры.Вставить("ТекСтруктураИерархии", ПараметрыПечати.Форма.ТекСтруктураИерархии);
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораПараметровПечатиОР", ЭтотОбъект, ДополнительныеПараметры);
		ОткрытьФорму("Справочник.торо_ОбъектыРемонта.Форма.ФормаВыбораРазделовПаспортаОР", Новый Структура("КлючНазначенияИспользования", "ПАРАМЕТРЫ_ПЕЧАТИ_" + ПараметрыПечати.Идентификатор), ПараметрыПечати.Форма, ПараметрыПечати.Идентификатор,,,ОписаниеОповещения);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ПослеВыбораПараметровПечатиОР(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПечати = ДополнительныеПараметры.ПараметрыПечати;
	
	ТекСтруктураИерархии = ДополнительныеПараметры.ТекСтруктураИерархии;
	Параметры = Новый Структура;
	Параметры.Вставить("ТекСтруктураИерархии", ТекСтруктураИерархии);
	Параметры.Вставить("ПечатаемыеРазделы", Результат);
	
	НапечататьДокумент(ПараметрыПечати.МенеджерПечати,
			ПараметрыПечати.Идентификатор,
			ПараметрыПечати.ОбъектыПечати,
			Параметры);
	
КонецПроцедуры
		
Функция ПечататьТекущуюВерсиюТехКары(ПараметрыПечати) Экспорт
	
	Параметры = Новый Структура;
	СтруктураФормы = Новый Структура("ТехКарта");
	ЗаполнитьЗначенияСвойств(СтруктураФормы, ПараметрыПечати.Форма);
	
	Если СтруктураФормы.ТехКарта <> Неопределено Тогда
		ДатаПринятия = СтруктураФормы.ТехКарта.ДатаПринятия;
	КонецЕсли;
	
	Если ДатаПринятия <> Неопределено Тогда
		Параметры.Вставить("ДатаПринятия", ДатаПринятия);
	КонецЕсли;
	
	НапечататьДокумент(ПараметрыПечати.МенеджерПечати,
			ПараметрыПечати.Идентификатор,
			ПараметрыПечати.ОбъектыПечати,
			Параметры);
			
	Возврат Неопределено;		
	
КонецФункции   	

#КонецОбласти
