
&НаСервере
&ИзменениеИКонтроль("ЗаполнитьТЗСоответствиеВероятностиИменамКолонок")
Процедура Расш_гкс_ЗаполнитьТЗСоответствиеВероятностиИменамКолонок(ВыборкаКатегорииВероятности)

	ТЗСоответствиеВероятностиИменамКолонок.Очистить();

	Пока ВыборкаКатегорииВероятности.Следующий() Цикл

		НС = ТЗСоответствиеВероятностиИменамКолонок.Добавить();
		НС.ВероятностьПоследствий = ВыборкаКатегорииВероятности.Ссылка;
		#Удаление
		НС.ИмяКолонки             = "Колонка_" + СокрЛП(ВыборкаКатегорииВероятности.Наименование);
		НС.ИмяВыбран              = "Выбран_"  + СокрЛП(ВыборкаКатегорииВероятности.Наименование);
		#КонецУдаления
		#Вставка
		НС.ИмяКолонки             = "Колонка_" + СтрЗаменить(СокрЛП(ВыборкаКатегорииВероятности.Наименование), " ", "");
		НС.ИмяВыбран              = "Выбран_"  + СтрЗаменить(СокрЛП(ВыборкаКатегорииВероятности.Наименование), " ", "");
		#КонецВставки
		НС.Заголовок              = ВыборкаКатегорииВероятности.Наименование;
		НС.Описание	              = ВыборкаКатегорииВероятности.Описание;

	КонецЦикла; 	

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("Выбрать")
Процедура Расш_гкс_Выбрать(Команда)

	// Риски должны быть проставлены для всех объектов воздействия.
	Если не ТЗСоответствиеОбъектовВоздействияИменамТаблиц.Количество() = ТЗВыбранныеЗначения.Количество() Тогда
		ТекстСообщения = НСтр("es='No para todos los objetos de la influencia son indicados los riesgos. La elección no puede ser cumplida.';ru='Не для всех объектов воздействия указаны риски. Выбор не может быть выполнен.';en='Not all exposure targets indicate risks. The selection cannot be made.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли; 
	#Вставка
	Если элементы["гкс_Комментарий"].Видимость = Истина Тогда 
		Если ЗначениеЗаполнено(ЭтотОбъект["Комментарий"]) = Ложь Тогда 
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("es='el comentario no está lleno';ru='комментарий не заполнен';en='comment is not filled'");
			Сообщение.Поле = "Комментарий";
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;
	КонецЕсли;
	#КонецВставки

	МассивПодходящихСтрок = ТЗВыбранныеЗначения.НайтиСтроки(Новый Структура("РезультатВыбора",Истина)); 

	Если МассивПодходящихСтрок.Количество() > 0 Тогда

		ВыбраннаяСтрока = МассивПодходящихСтрок[0];

		СтруктураВыбора = Новый Структура("КритичностьДефекта, КрайняяДопустимаяДатаЗавершенияРемонта");
		#Вставка
		СтруктураВыбора.Вставить("КатегорияРиска", Неопределено);
		// гкс+ [07.23] Деснол 17.07.2023
		СтруктураВыбора.Вставить("КачественнаяОценка", Неопределено);
		// гкс- [07.23] Деснол 17.07.2023
		#КонецВставки
		ЗаполнитьЗначенияСвойств(СтруктураВыбора, ВыбраннаяСтрока);

		ДатаНачалаРемонта    = ДатаОбнаружения;
		ДатаОкончанияРемонта = СтруктураВыбора.КрайняяДопустимаяДатаЗавершенияРемонта;

		Если ЗначениеЗаполнено(ВыбраннаяСтрока.КоличествоПериодовДН)
			И ЗначениеЗаполнено(ВыбраннаяСтрока.ПериодичностьДН) Тогда
			ДатаНачалаРемонта = ОбщегоНазначенияУТКлиентСервер.РассчитатьДатуОкончанияПериода(ДатаНачалаРемонта, ВыбраннаяСтрока.ПериодичностьДН, ВыбраннаяСтрока.КоличествоПериодовДН); 
		КонецЕсли; 

		Если ЗначениеЗаполнено(ВыбраннаяСтрока.КоличествоПериодовДО)
			И ЗначениеЗаполнено(ВыбраннаяСтрока.ПериодичностьДО) Тогда
			ДатаОкончанияРемонта = ОбщегоНазначенияУТКлиентСервер.РассчитатьДатуОкончанияПериода(ДатаОбнаружения, ВыбраннаяСтрока.ПериодичностьДО, ВыбраннаяСтрока.КоличествоПериодовДО); 
		КонецЕсли; 

		СтруктураВыбора.Вставить("ДатаНачалаРемонта"   , ДатаНачалаРемонта);
		СтруктураВыбора.Вставить("ДатаОкончанияРемонта", ДатаОкончанияРемонта);

		// Сохранение результатов выбора.

		МассивСтруктур = Новый Массив;

		Для каждого Строка Из ТЗВыбранныеЗначения Цикл

			Структура = Новый Структура;
			Структура.Вставить("ID_Ремонта"                            , ID_Ремонта);
			Структура.Вставить("РемонтыОборудования_ID"                , ID_Ремонта);           
			Структура.Вставить("ОбъектВоздействия"                     , Строка.ОбъектВоздействия);
			Структура.Вставить("КатегорияРиска"                        , Строка.КатегорияРиска);
			Структура.Вставить("РезультатВыбора"                       , Строка.РезультатВыбора);
			#Вставка
			// гкс+ [07.23] Деснол 17.07.2023
			Структура.Вставить("КачественнаяОценка"                        , Строка.КачественнаяОценка);
			// гкс- [07.23] Деснол 17.07.2023
			Для Каждого СТ1 Из ТЗСоответствиеОбъектовВоздействияИменамТаблиц Цикл
				Если СТ1.ОбъектВоздействия = Строка.ОбъектВоздействия Тогда 
					Структура.Вставить("Комментарий", СТ1.Комментарий);
					Прервать;
				КонецЕсли;
			КонецЦикла;
			#КонецВставки

			МассивСтруктур.Добавить(Структура);

		КонецЦикла; 

		СтруктураВыбора.Вставить("РезультатыПодбораИзМатрицыОценкиРисков", МассивСтруктур);
		#Вставка
		СтруктураВыбора.Вставить("Комментарий", ЭтотОбъект["Комментарий"]);
		#КонецВставки

		ОповеститьОВыборе(СтруктураВыбора);
	Иначе 
		ТекстСообщения = НСтр("es='No es escogido ni una categoría del riesgo con los datos rellenados para el cálculo';ru='Не выбрано ни одной категории риска с заполненными данными для расчета';en='No risk categories with data filled in for calculation were selected.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли; 

КонецПроцедуры

// гкс+ [Релиз 1] Куст 28.10.2020
&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура Расш_гкс_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	#Вставка
	МассивРеквизитов = Новый Массив();
	МассивРеквизитов.Добавить(Новый РеквизитФормы("Описание",Новый ОписаниеТипов("Строка"),
		"ТЗСоответствиеОбъектовВоздействияИменамТаблиц"));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("Комментарий",Новый ОписаниеТипов("Строка"),
		"ТЗСоответствиеОбъектовВоздействияИменамТаблиц"));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("Комментарий",Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(500))));
	// гкс+ [07.23] Деснол 17.07.2023
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ТЧ_Качество",Новый ОписаниеТипов("ТаблицаЗначений")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("КачественнаяОценка",Новый ОписаниеТипов("ПеречислениеСсылка.гкс_КачественнаяОценкаКритичности"),
		"ТЧ_Качество", "Качественная оценка"));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("КатегорияРиска",Новый ОписаниеТипов("СправочникСсылка.торо_КатегорииРиска"),
		"ТЧ_Качество"));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ОбъектВоздействия",Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыВоздействия"),
		"ТЧ_Качество"));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("КачественнаяОценка",Новый ОписаниеТипов("ПеречислениеСсылка.гкс_КачественнаяОценкаКритичности"),
		"ТЗВыбранныеЗначения", "Качественная оценка"));
	// гкс- [07.23] Деснол 17.07.2023
	ИзменитьРеквизиты(МассивРеквизитов);
	НЭлем = Элементы.Добавить("гкс_Комментарий", Тип("ПолеФормы"));
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Комментарий";
	НЭлем.АвтоМаксимальнаяШирина = Ложь;
	НЭлем.МногострочныйРежим = Истина;
	Если Параметры.Свойство("Комментарий") Тогда 
		ЭтотОбъект["Комментарий"] = Параметры.Комментарий;
	Иначе
		НЭлем.Видимость = Ложь;
	КонецЕсли;
	// гкс+ [07.23] Деснол 17.07.2023
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
		|	Рег.ОбъектВоздействия КАК ОбъектВоздействия,
		|	Рег.КатегорияРиска КАК КатегорияРиска,
		|	Рег.КачественнаяОценка КАК КачественнаяОценка
		|ИЗ
		|	РегистрСведений.гкс_СоответствиеКачестваКритичности КАК Рег";
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НС = ЭтотОбъект["ТЧ_Качество"].Добавить();
		ЗаполнитьЗначенияСвойств(НС, Выборка);
	КонецЦикла;
	// гкс- [07.23] Деснол 17.07.2023
	#КонецВставки
	Если Не ЗначениеЗаполнено(КлючНазначенияИспользования) Тогда
		ТекстСообщения = НСтр("es='El tratamiento no es destinado al uso directo.';ru='Обработка не предназначена для непосредственного использования.';en='Processing is not intended for direct use.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		Возврат;
	КонецЕсли;

	Параметры.Свойство("ID_Ремонта", ID_Ремонта);

	Если НЕ Параметры.Свойство("ДатаОбнаружения", ДатаОбнаружения) Тогда

		Запрос = Новый Запрос;
		# Область ТекстЗапроса
		Запрос.Текст = "ВЫБРАТЬ
		|	торо_ВыявленныеДефектыСрезПоследних.Период КАК Период,
		|	торо_ВыявленныеДефектыСрезПоследних.КрайняяДопустимаяДатаЗавершенияРемонта КАК КрайняяДопустимаяДатаЗавершенияРемонта,
		|	торо_ВыявленныеДефектыСрезПоследних.Регистратор КАК ДокументИсточник
		|ИЗ
		|	РегистрСведений.торо_ВыявленныеДефекты.СрезПоследних(, ID = &ID_Ремонта) КАК торо_ВыявленныеДефектыСрезПоследних";
		# КонецОбласти
		Запрос.УстановитьПараметр("ID_Ремонта", ID_Ремонта);
		РезультатЗапроса = Запрос.Выполнить();

		Если РезультатЗапроса.Пустой() Тогда
			ТекстСообщения = НСтр("es='Para la reparación escogida no hay documentos los defectos Revelados.';ru='Для выбранного ремонта нет документов Выявленные дефекты.';en='There are no documents for the selected repair. Defects detected.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			Возврат;
		Иначе
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();

			Если ЗначениеЗаполнено(Выборка.КрайняяДопустимаяДатаЗавершенияРемонта) Тогда
				Элементы.Выбрать.Доступность = Ложь;
				ЭтаФорма.ТолькоПросмотр      = Истина;
			КонецЕсли; 

			ДатаОбнаружения  = Выборка.Период;
			ДокументИсточник = Выборка.ДокументИсточник;

		КонецЕсли;  
	КонецЕсли; 

	Запрос = Новый Запрос;
	# Область ТекстЗапроса
	Запрос.Текст = "ВЫБРАТЬ
	|	торо_ОбъектыВоздействия.Ссылка КАК Ссылка,
	|	торо_ОбъектыВоздействия.Наименование КАК Наименование
	#Вставка
	|	,торо_ОбъектыВоздействия.Описание КАК Описание
	#КонецВставки
	|ИЗ
	|	Справочник.торо_ОбъектыВоздействия КАК торо_ОбъектыВоздействия
	#Вставка
	|Где торо_ОбъектыВоздействия.ПометкаУдаления = Ложь
	#КонецВставки
	|
	|УПОРЯДОЧИТЬ ПО
	|	торо_ОбъектыВоздействия.Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_Последствия.ОбъектВоздействия КАК ОбъектВоздействия,
	|	торо_Последствия.КатегорияТяжести КАК КатегорияТяжести,
	|	торо_Последствия.Описание КАК Описание
	|ИЗ
	|	РегистрСведений.торо_Последствия КАК торо_Последствия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_КатегорииВероятности.Ссылка КАК Ссылка,
	|	торо_КатегорииВероятности.Наименование КАК Наименование,
	|	торо_КатегорииВероятности.Описание КАК Описание
	|ИЗ
	|	Справочник.торо_КатегорииВероятности КАК торо_КатегорииВероятности
	|ГДЕ
	|	НЕ торо_КатегорииВероятности.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	торо_КатегорииВероятности.РеквизитДопУпорядочивания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_КатегорииРиска.Ссылка КАК Ссылка,
	#Вставка
	|	торо_КатегорииРиска.Наименование КАК Наименование,
	#КонецВставки
	|	торо_КатегорииРиска.КатегорияВероятности КАК КатегорияВероятности,
	|	торо_КатегорииТяжестиПоследствий.Ссылка КАК КатегорияТяжестиПоследствий,
	|	торо_КатегорииРиска.Цвет КАК Цвет,
	|	торо_КатегорииРиска.ДатаПлановаяКрайняя_КоличествоПериодов КАК КоличествоПериодовКДД,
	|	торо_КатегорииРиска.ДатаПлановаяКрайняя_Период КАК ПериодичностьКДД,
	|	торо_КатегорииРиска.КритичностьДефекта КАК КритичностьДефекта,
	|	торо_КатегорииРиска.ДатаНачала_КоличествоПериодов КАК КоличествоПериодовДН,
	|	торо_КатегорииРиска.ДатаОкончания_КоличествоПериодов КАК КоличествоПериодовДО,
	|	торо_КатегорииРиска.ДатаНачала_Период КАК ПериодичностьДН,
	|	торо_КатегорииРиска.ДатаОкончания_Период КАК ПериодичностьДО
	|ИЗ
	|	Справочник.торо_КатегорииТяжестиПоследствий КАК торо_КатегорииТяжестиПоследствий
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_КатегорииРиска КАК торо_КатегорииРиска
	|		ПО (торо_КатегорииРиска.КатегорияТяжестиПоследствий = торо_КатегорииТяжестиПоследствий.Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	торо_КатегорииТяжестиПоследствий.РеквизитДопУпорядочивания
	|ИТОГИ ПО
	|	КатегорияТяжестиПоследствий";
	# КонецОбласти

	РезультатЗапроса = Запрос.ВыполнитьПакет();

	тзПоследствия.Загрузить(РезультатЗапроса[1].Выгрузить());

	ЗаполнитьТЗСоответствиеВероятностиИменамКолонок(РезультатЗапроса[2].Выбрать());

	МассивРеквизитов = Новый Массив;

	// Добавление таблиц по ОБЪЕКТАМ ВОЗДЕЙСТВИЯ в виде реквизитов формы.
	Если Не РезультатЗапроса[0].Пустой() Тогда

		Выборка = РезультатЗапроса[0].Выбрать();

		Пока Выборка.Следующий() Цикл

			Наименование = СокрЛП(Выборка.Наименование);
			Наименование = СтрЗаменить(Наименование, "(", "");
			Наименование = СтрЗаменить(Наименование, ")", "");
			Наименование = СтрЗаменить(Наименование, ",", "");

			Пока Найти(Наименование, " ") > 0 Цикл
				Наименование = СтрЗаменить(Наименование, " ", "");	
			КонецЦикла; 

			РеквизитТаблица = Новый РеквизитФормы("тз" + Наименование,Новый ОписаниеТипов("ТаблицаЗначений"),"", Выборка.Наименование);

			НС = ТЗСоответствиеОбъектовВоздействияИменамТаблиц.Добавить();
			НС.ОбъектВоздействия = Выборка.Ссылка;
			НС.ИмяТаблицы        = РеквизитТаблица.Имя;
			НС.Заголовок         = Выборка.Наименование;
			#Вставка
			НС.Описание         = Выборка.Описание;
			#КонецВставки

			МассивРеквизитов.Добавить(РеквизитТаблица);

		КонецЦикла; 

	КонецЕсли; 

	ИзменитьРеквизиты(МассивРеквизитов);

	МассивРеквизитов = Новый Массив;
	#Вставка
	НомерПП = 0;
	#КонецВставки

	Для каждого СтрокаСоответствия Из ТЗСоответствиеОбъектовВоздействияИменамТаблиц Цикл

		// Добавим страницу и таблицу значений на форму.

		Страница = Элементы.Добавить("Страница_" + СтрокаСоответствия.ИмяТаблицы, Тип("ГруппаФормы"), Элементы.ГруппаОбъектыВоздействия);
		Страница.Вид       = ВидГруппыФормы.Страница;
		Страница.Заголовок = СтрокаСоответствия.Заголовок;
		#Вставка
		Надпись = Элементы.Добавить("НадписьОписание_" + СтрокаСоответствия.ИмяТаблицы, Тип("ДекорацияФормы"), Страница);
        Надпись.Заголовок                = СтрокаСоответствия.Заголовок + НСтр("es=': <no seleccionado>';ru=': <не выбрано>';en=': <not selected>'");
        Надпись.РастягиватьПоГоризонтали = Истина;
        Надпись.АвтоМаксимальнаяШирина   = Ложь;
		#КонецВставки

		Надпись = Элементы.Добавить("Надпись_" + СтрокаСоответствия.ИмяТаблицы, Тип("ДекорацияФормы"), Страница);
		// >> [Деснол] [Ушаков А.Д.] [26.09.2019] 
		Надпись.Заголовок                = СтрокаСоответствия.Заголовок + НСтр("es=': <no seleccionado>';ru=': <не выбрано>';en=': <not selected>'");
		// << [Деснол] [Ушаков А.Д.] [26.09.2019] 
		Надпись.РастягиватьПоГоризонтали = Истина;
		Надпись.АвтоМаксимальнаяШирина   = Ложь;

		ТЗ = Элементы.Добавить(СтрокаСоответствия.ИмяТаблицы, Тип("ТаблицаФормы"), Страница);
		ТЗ.ПутьКДанным              = СтрокаСоответствия.ИмяТаблицы;
		ТЗ.МножественныйВыбор       = Ложь;
		ТЗ.ИзменятьСоставСтрок      = Ложь;
		ТЗ.ИзменятьПорядокСтрок     = Ложь;
		ТЗ.ТолькоПросмотр           = ЭтаФорма.ТолькоПросмотр;

		// Свойства внешнего вида настраиваются в ДобавитьЭлементыДляКолонокНаФорму.

		ТЗ.УстановитьДействие("Выбор"               , "ВыборСтрокиТЗВыбораКатегорииРиска");
		ТЗ.УстановитьДействие("ПриАктивизацииЯчейки", "ТЗВыбораКатегорииРискаПриАктивизацииЯчейки");

		ДополнитьТаблицуОБЪЕКТЫВОЗДЕЙСТВИЯКолонками(СтрокаСоответствия.ИмяТаблицы, МассивРеквизитов);
		#Вставка
		Коммент = Элементы.Добавить("Комментарий_" + СтрокаСоответствия.ИмяТаблицы, Тип("ПолеФормы"), Страница);
		Коммент.Вид = ВидПоляФормы.ПолеВвода;
		Коммент.Видимость = Ложь;
		Коммент.ПутьКДанным = "ТЗСоответствиеОбъектовВоздействияИменамТаблиц[" + НомерПП + "].Комментарий";
        Коммент.Заголовок                = НСтр("es='Comment';ru='Комментарий';en='Comment'");
        Коммент.РастягиватьПоГоризонтали = Истина;
		Коммент.многострочныйРежим = Истина;
        Коммент.АвтоМаксимальнаяШирина   = Ложь;
		НомерПП = НомерПП + 1;
		#КонецВставки

	КонецЦикла; 

	ИзменитьРеквизиты(МассивРеквизитов);

	ДобавитьЭлементыДляКолонокНаФорму();

	Если ТЗСоответствиеОбъектовВоздействияИменамТаблиц.Количество() > 0 Тогда
		МассивВыбранныхЗначений = Новый Массив;
		Параметры.Свойство("МассивВыбранныхЗначений", МассивВыбранныхЗначений);

		ЗаполнитьТаблицыДаннымиДляВыбора(РезультатЗапроса[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам), МассивВыбранныхЗначений);
		#Вставка
		Для Каждого СТ Из МассивВыбранныхЗначений Цикл
			Для Каждого СТ1 Из ТЗСоответствиеОбъектовВоздействияИменамТаблиц Цикл
				Если СТ1.ОбъектВоздействия = СТ.ОбъектВоздействия Тогда 
					СТ1.Комментарий = СТ.Комментарий;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		#КонецВставки
	КонецЕсли; 

	УстановитьУсловноеОформление();

	Если Не ЗначениеЗаполнено(ТекущийПользователь) Тогда
		ТекущийПользователь = Пользователи.АвторизованныйПользователь();
	КонецЕсли; 

	ЗапретитьРедактирование = НЕ (ПравоДоступа("Изменение", Метаданные.Документы.торо_ВыявленныеДефекты) 
	И ПравоДоступа("Изменение", Метаданные.Документы.торо_ЗаявкаНаРемонт));

	ЭтаФорма.ТолькоПросмотр = ЭтаФорма.ТолькоПросмотр ИЛИ ЗапретитьРедактирование;
	Элементы.Выбрать.Доступность = НЕ ЭтаФорма.ТолькоПросмотр;
	#Вставка
	Элементы.ТЗВыбранныеЗначенияКрайняяДопустимаяДатаЗавершенияРемонта.Видимость = Ложь;
	Для Каждого СТ Из ТЗСоответствиеОбъектовВоздействияИменамТаблиц Цикл
		Элементы["НадписьОписание_" + СТ.ИмяТаблицы].Заголовок = СТ.Описание;
	КонецЦикла;
	Для каждого Строка Из ТЗВыбранныеЗначения Цикл
		Строка.РезультатВыбора = Ложь;
	КонецЦикла;
	НайтиМаксимальныйРангРиска();
	// гкс+ [07.23] Деснол 18.07.2023
	Для Каждого СтрокаРедактирования Из ТЗВыбранныеЗначения Цикл
		НайдСтр = ЭтотОбъект["ТЧ_Качество"].НайтиСтроки(Новый Структура("КатегорияРиска,ОбъектВоздействия",
		СтрокаРедактирования.КатегорияРиска, СтрокаРедактирования.ОбъектВоздействия));
		Если НайдСтр.Количество() = 0 Тогда 
			НайдСтр = ЭтотОбъект["ТЧ_Качество"].НайтиСтроки(Новый Структура("КатегорияРиска,ОбъектВоздействия",
			СтрокаРедактирования.КатегорияРиска, Справочники.торо_ОбъектыВоздействия.ПустаяСсылка()));
		КонецЕсли;
		Если Не НайдСтр.Количество() = 0 Тогда 
			СтрокаРедактирования.КачественнаяОценка = НайдСтр[0].КачественнаяОценка;
		КонецЕсли;
	КонецЦикла;
	// гкс- [07.23] Деснол 18.07.2023
	#КонецВставки

КонецПроцедуры
// гкс- [Релиз 1] Куст 28.10.2020

// гкс+ [Релиз 1] Куст 28.10.2020
&НаСервере
&ИзменениеИКонтроль("ДобавитьЭлементыДляКолонокНаФорму")
Процедура Расш_гкс_ДобавитьЭлементыДляКолонокНаФорму()

	// Добавленные колонки необходимо отобразить на форме.
	ШрифтЖирный = Новый Шрифт(,,ИСТИНА);

	ЭтаФорма.Ширина = ТЗСоответствиеВероятностиИменамКолонок.Количество() * 20;
	Элементы.ТЗВыбранныеЗначения.ВысотаВСтрокахТаблицы = ТЗСоответствиеОбъектовВоздействияИменамТаблиц.Количество(); 

	Для каждого СтрокаСоответствия Из ТЗСоответствиеОбъектовВоздействияИменамТаблиц Цикл

		ИмяРодительскогоЭлемента = СтрокаСоответствия.ИмяТаблицы;
		ЭлементРодитель = Элементы[ИмяРодительскогоЭлемента];

		ЭлементРодитель.ВысотаШапки               = 2;
		ЭлементРодитель.КоманднаяПанель.Видимость = Ложь; 
		ЭлементРодитель.ШрифтЗаголовка            = ШрифтЖирный;

		ЭлементРодитель.РастягиватьПоГоризонтали = Истина;
		ЭлементРодитель.ВариантУправленияВысотой=ВариантУправленияВысотойТаблицы.ПоСодержимому;

		ГруппаКолонок = Элементы.Добавить(ИмяРодительскогоЭлемента + "_" + "КатегорияТяжестиОписаниеПоследствий", Тип("ГруппаФормы"), ЭлементРодитель);
		ГруппаКолонок.Вид                           = ВидГруппыФормы.ГруппаКолонок;
		ГруппаКолонок.Группировка                   = ГруппировкаКолонок.Горизонтальная;
		ГруппаКолонок.ОтображатьВШапке              = Истина;
		ГруппаКолонок.Ширина                        = 25;
		ГруппаКолонок.Заголовок                     =  НСтр("es='Categoría de probabilidad / Categoría de gravedad';ru='Категория вероятности / Категория тяжести последствий';en='Category probability Category of consequences'");
		ГруппаКолонок.ШрифтЗаголовка                = ШрифтЖирный;
		ГруппаКолонок.ФиксацияВТаблице              = ФиксацияВТаблице.Лево;
		ГруппаКолонок.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;

		Колонка = Элементы.Добавить(ИмяРодительскогоЭлемента + "_" + "КатегорияТяжести", Тип("ПолеФормы"), ГруппаКолонок);
		Колонка.Вид                     = ВидПоляФормы.ПолеВвода;
		Колонка.ПутьКДанным             = СтрокаСоответствия.ИмяТаблицы + ".КатегорияТяжести";
		Колонка.ОтображатьВШапке        = Ложь;
		Колонка.Ширина                  = 2;
		Колонка.Шрифт                   = ШрифтЖирный;
		Колонка.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;	
		Колонка.ТолькоПросмотр = Истина;

		Колонка = Элементы.Добавить(ИмяРодительскогоЭлемента + "_" + "Последствия", Тип("ПолеФормы"), ГруппаКолонок);
		Колонка.Вид                = ВидПоляФормы.ПолеВвода;
		Колонка.ПутьКДанным        = СтрокаСоответствия.ИмяТаблицы + ".Последствия";
		Колонка.ОтображатьВШапке   = Ложь;
		Колонка.МногострочныйРежим = Истина;
		Колонка.Ширина             = 23;
		Колонка.Шрифт              = ШрифтЖирный;
		Колонка.ТолькоПросмотр = Истина;				

		Для каждого ИмяКолонкиСтрока Из ТЗСоответствиеВероятностиИменамКолонок Цикл

			ИмяВероятности = СтрЗаменить(ИмяКолонкиСтрока.ИмяКолонки, "Выбран_", "");
			ИмяВероятности = СтрЗаменить(ИмяВероятности             , "Колонка_", "");


			Колонка = Элементы.Добавить(ИмяРодительскогоЭлемента + "_" + ИмяКолонкиСтрока.ИмяКолонки + "_Период", Тип("ПолеФормы"), ЭлементРодитель);
			Колонка.Вид                           = ВидПоляФормы.ПолеВвода;
			#Удаление
			Колонка.ПутьКДанным                   = СтрокаСоответствия.ИмяТаблицы + "." + ИмяКолонкиСтрока.ИмяКолонки + ".СтроковоеПредставлениеПериода";
			#КонецУдаления
			#Вставка
			Колонка.ПутьКДанным                   = СтрокаСоответствия.ИмяТаблицы + "." + ИмяКолонкиСтрока.ИмяКолонки + ".Наименование";
			Колонка.Ширина = 5;
			#КонецВставки
			Колонка.ОтображатьВШапке              = Истина;
			Колонка.ОтображатьВПодвале            = Истина;
			Колонка.ТолькоПросмотр                = Истина;
			Колонка.АвтоМаксимальнаяШирина        = Ложь;
			Колонка.ГоризонтальноеПоложение       = ГоризонтальноеПоложениеЭлемента.Центр;
			Колонка.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
			Колонка.Заголовок                     = ИмяКолонкиСтрока.Заголовок;
			Колонка.Подсказка                     = ИмяКолонкиСтрока.Описание;
			Колонка.ШрифтЗаголовка                = ШрифтЖирный;
			Колонка.ШрифтПодвала                  = ШрифтЖирный;
			Колонка.РастягиватьПоГоризонтали      = Истина;

		КонецЦикла; 

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ВыборСтрокиТЗВыбораКатегорииРиска")
Процедура Расш_гкс_ВыборСтрокиТЗВыбораКатегорииРиска(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если ЭтаФорма.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли; 

	ИмяТаблицы = Элемент.Имя;
	ИмяКолонки = Поле.Имя;
	ТекущиеДанные = Элемент.ТекущиеДанные;

	Если Не ТекущиеДанные = Неопределено Тогда

		МассивСтрокПоИмени = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИмяКолонки, "_");

		Если МассивСтрокПоИмени.Количество() > 2 Тогда

			ИмяВероятности = МассивСтрокПоИмени[2];

			// Если для пары категория тяжести и вероятность последствий не создана категория риска, выходим из процедуры.
			Если Не ЗначениеЗаполнено(ТекущиеДанные["Колонка_" + ИмяВероятности]) Тогда
				Возврат;
			КонецЕсли; 

			ВероятностьПоследствий = Неопределено;
			ОписаниеВероятности = "";

			Для каждого Строка Из ЭтаФорма[ИмяТаблицы] Цикл
				Для каждого СтрокаВероятность Из ТЗСоответствиеВероятностиИменамКолонок Цикл

					Строка[СтрокаВероятность.ИмяВыбран] = Ложь;

					Если СтрокаВероятность.ИмяКолонки = "Колонка_" + ИмяВероятности Тогда
						ВероятностьПоследствий = СтрокаВероятность.ВероятностьПоследствий;
						ОписаниеВероятности    = СтрокаВероятность.Описание;
					КонецЕсли;

				КонецЦикла; 
			КонецЦикла; 

			ТекущиеДанные["Выбран_" + ИмяВероятности] = Истина;

			// Добавить/изменить строку по выбранному объекту воздействия.
			ТекущийОбъектВоздействияСтроки = ТЗСоответствиеОбъектовВоздействияИменамТаблиц.НайтиСтроки(Новый Структура("ИмяТаблицы", ИмяТаблицы));

			Если ТекущийОбъектВоздействияСтроки.Количество() > 0 Тогда

				ТекущийОбъектВоздействия = ТекущийОбъектВоздействияСтроки[0].ОбъектВоздействия;


				МассивСтрок = ТЗВыбранныеЗначения.НайтиСтроки(Новый Структура("ОбъектВоздействия", ТекущийОбъектВоздействия));

				Если МассивСтрок.Количество() = 0 Тогда
					СтрокаРедактирования = ТЗВыбранныеЗначения.Добавить();
					СтрокаРедактирования.ОбъектВоздействия = ТекущийОбъектВоздействия;
				Иначе
					СтрокаРедактирования = МассивСтрок[0];
				КонецЕсли; 

				СтрокаРедактирования.КатегорияТяжести         = ТекущиеДанные.КатегорияТяжести;
				СтрокаРедактирования.ВероятностьПоследствий   = ВероятностьПоследствий;
				СтрокаРедактирования.КатегорияРиска           = ТекущиеДанные["Колонка_" + ИмяВероятности];
				СтрокаРедактирования.КритичностьДефекта       = ТекущиеДанные["Колонка_" + ИмяВероятности + "КритичностьДефекта"];
				#Вставка
				// гкс+ [07.23] Деснол 18.07.2023
				НайдСтр = ЭтотОбъект["ТЧ_Качество"].НайтиСтроки(Новый Структура("КатегорияРиска,ОбъектВоздействия",
					СтрокаРедактирования.КатегорияРиска, СтрокаРедактирования.ОбъектВоздействия));
					Если НайдСтр.Количество() = 0 Тогда 
						НайдСтр = ЭтотОбъект["ТЧ_Качество"].НайтиСтроки(Новый Структура("КатегорияРиска",
						СтрокаРедактирования.КатегорияРиска));
						Для Каждого СМ Из НайдСтр Цикл
							Если Не ЗначениеЗаполнено(СМ.ОбъектВоздействия) Тогда 
								СтрокаРедактирования.КачественнаяОценка = СМ.КачественнаяОценка;
								Прервать;
							КонецЕсли
						КонецЦикла;
						НайдСтр = Новый Массив();
					КонецЕсли;
					Если Не НайдСтр.Количество() = 0 Тогда 
						СтрокаРедактирования.КачественнаяОценка = НайдСтр[0].КачественнаяОценка;
					КонецЕсли;
				// гкс- [07.23] Деснол 18.07.2023
				#КонецВставки


				// КДД.
				СтрокаРедактирования.КоличествоПериодовКДД    = ТекущиеДанные["Колонка_" + ИмяВероятности + "КоличествоПериодовКДД"];
				СтрокаРедактирования.ПериодичностьКДД         = ТекущиеДанные["Колонка_" + ИмяВероятности + "ПериодичностьКДД"];

				// ДН.
				СтрокаРедактирования.КоличествоПериодовДН     = ТекущиеДанные["Колонка_" + ИмяВероятности + "КоличествоПериодовДН"];
				СтрокаРедактирования.ПериодичностьДН          = ТекущиеДанные["Колонка_" + ИмяВероятности + "ПериодичностьДН"];

				// ДО.
				СтрокаРедактирования.КоличествоПериодовДО     = ТекущиеДанные["Колонка_" + ИмяВероятности + "КоличествоПериодовДО"];
				СтрокаРедактирования.ПериодичностьДО          = ТекущиеДанные["Колонка_" + ИмяВероятности + "ПериодичностьДО"];

				МассивНайденныхПоследствий = тзПоследствия.НайтиСтроки(Новый Структура("ОбъектВоздействия, КатегорияТяжести",
				СтрокаРедактирования.ОбъектВоздействия, 
				СтрокаРедактирования.КатегорияТяжести));

				Если МассивНайденныхПоследствий.Количество() > 0 Тогда
					МассивСтрокДляНадписи = Новый Массив;
					МассивСтрокДляНадписи.Добавить(ТекущийОбъектВоздействияСтроки[0].Заголовок);
					МассивСтрокДляНадписи.Добавить(":");
					МассивСтрокДляНадписи.Добавить(МассивНайденныхПоследствий[0].Описание);

					МассивСтрокДляНадписи.Добавить(" (");
					МассивСтрокДляНадписи.Добавить(СтрЗаменить(ОписаниеВероятности, Символы.ПС, " "));
					МассивСтрокДляНадписи.Добавить(")");

					Элементы["Надпись_" + ИмяТаблицы].Заголовок = СтрСоединить(МассивСтрокДляНадписи);
					#Вставка
					Элементы["НадписьОписание_" + ИмяТаблицы].Заголовок = ТекущийОбъектВоздействияСтроки[0].Описание;
					#КонецВставки
				КонецЕсли; 													

			КонецЕсли; 

		КонецЕсли;

	КонецЕсли; 

	ПроставитьПризнакРезультатаВыбора();

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ЗаполнитьТаблицуВыбранныхЗначений")
Процедура Расш_гкс_ЗаполнитьТаблицуВыбранныхЗначений(ИмяТаблицы, ИмяВероятности, ТекущиеДанные, ТекущийОбъектВоздействияСтроки, ВероятностьПоследствий, ОписаниеВероятности)

	ТекущийОбъектВоздействия = ТекущийОбъектВоздействияСтроки[0].ОбъектВоздействия;			

	МассивСтрок = ТЗВыбранныеЗначения.НайтиСтроки(Новый Структура("ОбъектВоздействия", ТекущийОбъектВоздействия));

	Если МассивСтрок.Количество() = 0 Тогда
		СтрокаРедактирования = ТЗВыбранныеЗначения.Добавить();
		СтрокаРедактирования.ОбъектВоздействия = ТекущийОбъектВоздействия;
	Иначе
		СтрокаРедактирования = МассивСтрок[0];
	КонецЕсли; 

	СтрокаРедактирования.КатегорияТяжести         = ТекущиеДанные.КатегорияТяжести;
	СтрокаРедактирования.ВероятностьПоследствий   = ВероятностьПоследствий;
	СтрокаРедактирования.КатегорияРиска           = ТекущиеДанные["Колонка_" + ИмяВероятности];
	СтрокаРедактирования.КритичностьДефекта       = ТекущиеДанные["Колонка_" + ИмяВероятности + "КритичностьДефекта"];


	// КДД.
	СтрокаРедактирования.КоличествоПериодовКДД    = ТекущиеДанные["Колонка_" + ИмяВероятности + "КоличествоПериодовКДД"];
	СтрокаРедактирования.ПериодичностьКДД         = ТекущиеДанные["Колонка_" + ИмяВероятности + "ПериодичностьКДД"];

	// ДН.
	СтрокаРедактирования.КоличествоПериодовДН     = ТекущиеДанные["Колонка_" + ИмяВероятности + "КоличествоПериодовДН"];
	СтрокаРедактирования.ПериодичностьДН          = ТекущиеДанные["Колонка_" + ИмяВероятности + "ПериодичностьДН"];

	// ДО.
	СтрокаРедактирования.КоличествоПериодовДО     = ТекущиеДанные["Колонка_" + ИмяВероятности + "КоличествоПериодовДО"];
	СтрокаРедактирования.ПериодичностьДО          = ТекущиеДанные["Колонка_" + ИмяВероятности + "ПериодичностьДО"];

	МассивНайденныхПоследствий = тзПоследствия.НайтиСтроки(Новый Структура("ОбъектВоздействия, КатегорияТяжести",
	СтрокаРедактирования.ОбъектВоздействия, 
	СтрокаРедактирования.КатегорияТяжести));

	Если МассивНайденныхПоследствий.Количество() > 0 Тогда

		МассивСтрокДляНадписи = Новый Массив;
		МассивСтрокДляНадписи.Добавить(ТекущийОбъектВоздействияСтроки[0].Заголовок);
		МассивСтрокДляНадписи.Добавить(":");
		МассивСтрокДляНадписи.Добавить(МассивНайденныхПоследствий[0].Описание);

		МассивСтрокДляНадписи.Добавить(" (");
		МассивСтрокДляНадписи.Добавить(СтрЗаменить(ОписаниеВероятности, Символы.ПС, " "));
		МассивСтрокДляНадписи.Добавить(")");

		Элементы["Надпись_" + ИмяТаблицы].Заголовок = СтрСоединить(МассивСтрокДляНадписи);
		#Вставка
		Элементы["НадписьОписание_" + ИмяТаблицы].Заголовок = ТекущийОбъектВоздействияСтроки[0].Описание;
		#КонецВставки

	КонецЕсли; 													

КонецПроцедуры

&НаКлиенте
&Вместо("ПроставитьПризнакРезультатаВыбора")
Процедура Расш_гкс_ПроставитьПризнакРезультатаВыбора()
	Для каждого Строка Из ТЗВыбранныеЗначения Цикл
		Строка.РезультатВыбора = Ложь;
	КонецЦикла;
	НайтиМаксимальныйРангРиска();
КонецПроцедуры

&НаСервере
Процедура НайтиМаксимальныйРангРиска()
	// гкс+ [07.23] Деснол 03.08.2023
	ПриоритетКачества = Новый Соответствие();
	ПриоритетКачества.Вставить(Перечисления.гкс_КачественнаяОценкаКритичности.Некритичное, 1);
	ПриоритетКачества.Вставить(Перечисления.гкс_КачественнаяОценкаКритичности.Среднекритичное, 2);
	ПриоритетКачества.Вставить(Перечисления.гкс_КачественнаяОценкаКритичности.Критичное, 3);
	МаксКачество = 0;
	Для каждого Строка Из ТЗВыбранныеЗначения Цикл
		КачествоСтроки = ПриоритетКачества.Получить(Строка.КачественнаяОценка);
		Если Не КачествоСтроки = Неопределено Тогда 
			МаксКачество = Макс(МаксКачество, КачествоСтроки);
		КонецЕсли;
	КонецЦикла;
	ОтборКачество = Неопределено;
	Если МаксКачество = 1 Тогда 
		ОтборКачество = Перечисления.гкс_КачественнаяОценкаКритичности.Некритичное;
	ИначеЕсли МаксКачество = 2 Тогда 
		ОтборКачество = Перечисления.гкс_КачественнаяОценкаКритичности.Среднекритичное;
	ИначеЕсли МаксКачество = 3 Тогда 
		ОтборКачество = Перечисления.гкс_КачественнаяОценкаКритичности.Критичное;
	КонецЕсли;
	// гкс- [07.23] Деснол 03.08.2023
	МассивКР = Новый Массив();
	Если ЗначениеЗаполнено(ОтборКачество) Тогда 
		Для каждого Строка Из ТЗВыбранныеЗначения Цикл
			Если ОтборКачество = Строка.КачественнаяОценка Тогда 
				МассивКР.Добавить(Строка.КатегорияРиска);
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для каждого Строка Из ТЗВыбранныеЗначения Цикл
			МассивКР.Добавить(Строка.КатегорияРиска);
		КонецЦикла;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_КатегорииРиска.Код КАК Код,
		|	торо_КатегорииРиска.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.торо_КатегорииРиска КАК торо_КатегорииРиска
		|ГДЕ
		|	торо_КатегорииРиска.Ссылка В(&Ссылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Код УБЫВ";
	
	Запрос.УстановитьПараметр("Ссылка", МассивКР);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() = Ложь Тогда 
		Для каждого Строка Из ТЗВыбранныеЗначения Цикл
			Строка.РезультатВыбора = Ложь;
		КонецЦикла;
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Если ЗначениеЗаполнено(ОтборКачество) Тогда 
			Для каждого Строка Из ТЗВыбранныеЗначения Цикл
				Если Строка.КатегорияРиска = Выборка.Ссылка И ОтборКачество = Строка.КачественнаяОценка Тогда 
					Строка.РезультатВыбора = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		Иначе
			Для каждого Строка Из ТЗВыбранныеЗначения Цикл
				Если Строка.КатегорияРиска = Выборка.Ссылка Тогда 
					Строка.РезультатВыбора = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// гкс- [Релиз 1] Куст 28.10.2020

