
&ИзменениеИКонтроль("торо_ПроверкаОборудованияНаФункциональныхМестах")
Процедура гкс_торо_ПроверкаОборудованияНаФункциональныхМестах()
	Если Константы.торо_ИспользоватьФункциональныеМеста.Получить() = Ложь Тогда 
		Возврат;
	КонецЕсли;
	СобытиеФМ = Константы.торо_ПараметрыОповещенияОПроверкеОборудованияНаФМ.Получить();
	Если ЗначениеЗаполнено(СобытиеФМ) = Ложь Тогда 
		Возврат;
	КонецЕсли;

	ЗапросТекст = 
	"ВЫБРАТЬ
	|	торо_ОбъектыДляПроверкиТребованийФМ.Объект КАК Ссылка,
	|	торо_ОбъектыДляПроверкиТребованийФМ.Объект.ТипОбъекта 
	|	= ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто) КАК ЭтоФМ,
	|	ТИПЗНАЧЕНИЯ(торо_ОбъектыДляПроверкиТребованийФМ.Объект.Ссылка) = ТИП(Справочник.торо_ОбъектыРемонта) КАК ЭтоОР,
	|	торо_ОбъектыДляПроверкиТребованийФМ.Объект.ТиповойОР КАК ТОР
	|ПОМЕСТИТЬ ЭтиНужноПроверить1
	|ИЗ
	|	РегистрСведений.торо_ОбъектыДляПроверкиТребованийФМ КАК торо_ОбъектыДляПроверкиТребованийФМ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_УчетКонтролируемыхПоказателейПоказатели.ОбъектРемонта КАК ОР,
	|	торо_УчетКонтролируемыхПоказателейПоказатели.ОбъектРемонта.ТиповойОР КАК ТОР,
	|	торо_УчетКонтролируемыхПоказателейПоказатели.ОбъектРемонта.ТипОбъекта 
	|	= ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто) КАК ЭтоФМ,
	|	ИСТИНА КАК ЭтоОР,
	|	торо_ДокументыДляПроверкиТребованийФМ.ПроверяемыйДокумент КАК Док
	|ПОМЕСТИТЬ ЭтиНужноПроверить2
	|ИЗ
	|	РегистрСведений.торо_ДокументыДляПроверкиТребованийФМ КАК торо_ДокументыДляПроверкиТребованийФМ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_УчетКонтролируемыхПоказателей.Показатели 
	|	КАК торо_УчетКонтролируемыхПоказателейПоказатели
	|		ПО торо_ДокументыДляПроверкиТребованийФМ.ПроверяемыйДокумент = торо_УчетКонтролируемыхПоказателейПоказатели.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭтиНужноПроверить.Ссылка КАК Ссылка,
	|	ЭтиНужноПроверить.ЭтоФМ КАК ЭтоФМ,
	|	ЭтиНужноПроверить.ЭтоОР КАК ЭтоОР,
	|	ЭтиНужноПроверить.ТОР КАК ТОР,
	|	NULL КАК ОР
	|ПОМЕСТИТЬ ЭтиНужноПроверить
	|ИЗ
	|	ЭтиНужноПроверить1 КАК ЭтиНужноПроверить
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	ЭтиНужноПроверить2.ЭтоФМ,
	|	ЭтиНужноПроверить2.ЭтоОР,
	|	ЭтиНужноПроверить2.ТОР,
	|	ЭтиНужноПроверить2.ОР
	|ИЗ
	|	ЭтиНужноПроверить2 КАК ЭтиНужноПроверить2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭтиНужноПроверить.Ссылка КАК Ссылка,
	|	NULL КАК ОР
	|ПОМЕСТИТЬ ТолькоОР
	|ИЗ
	|	ЭтиНужноПроверить КАК ЭтиНужноПроверить
	|ГДЕ
	|	ЭтиНужноПроверить.ЭтоФМ = ЛОЖЬ
	|	И ЭтиНужноПроверить.ЭтоОР = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ОбъектыРемонта.Ссылка,
	|	NULL
	|ИЗ
	|	ЭтиНужноПроверить КАК ЭтиНужноПроверить
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	|		ПО ЭтиНужноПроверить.Ссылка = торо_ОбъектыРемонта.ТиповойОР
	|ГДЕ
	|	ЭтиНужноПроверить.ЭтоОР = ЛОЖЬ
	|	И ЭтиНужноПроверить.ЭтоФМ = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭтиНужноПроверить.Ссылка КАК ФМ,
	|	ЭтиНужноПроверить.ТОР КАК ТОР,
	|	ИСТИНА КАК ПроверитьВсе
	|ПОМЕСТИТЬ ВсеФМ
	|ИЗ
	|	ЭтиНужноПроверить КАК ЭтиНужноПроверить
	|ГДЕ
	|	ЭтиНужноПроверить.ЭтоФМ = ИСТИНА
	|	И ЭтиНужноПроверить.ЭтоОР = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ОбъектыРемонта.Ссылка,
	|	торо_ОбъектыРемонта.ТиповойОР,
	|	ИСТИНА
	|ИЗ
	|	ЭтиНужноПроверить КАК ЭтиНужноПроверить
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	|		ПО ЭтиНужноПроверить.Ссылка = торо_ОбъектыРемонта.ТиповойОР
	|ГДЕ
	|	ЭтиНужноПроверить.ЭтоФМ = ИСТИНА
	|	И ЭтиНужноПроверить.ЭтоОР = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РегистрОР.РодительИерархии,
	|	РегистрОР.РодительИерархии.ТиповойОР,
	|	ЛОЖЬ
	|ИЗ
	|	ЭтиНужноПроверить КАК ЭтиНужноПроверить
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИерархическиеСтруктурыОР КАК РегистрОР
	|		ПО ЭтиНужноПроверить.Ссылка = РегистрОР.ОбъектИерархии
	|			И (РегистрОР.РодительИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто))
	|ГДЕ
	|	ЭтиНужноПроверить.ЭтоФМ = ЛОЖЬ
	|	И ЭтиНужноПроверить.ЭтоОР = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РегистрОР.РодительИерархии,
	|	РегистрОР.РодительИерархии.ТиповойОР,
	|	ЛОЖЬ
	|ИЗ
	|	ЭтиНужноПроверить КАК ЭтиНужноПроверить
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИерархическиеСтруктурыОР КАК РегистрОР
	|			ПО торо_ОбъектыРемонта.Ссылка = РегистрОР.ОбъектИерархии
	|				И (РегистрОР.РодительИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто))
	|		ПО ЭтиНужноПроверить.Ссылка = торо_ОбъектыРемонта.ТиповойОР
	|ГДЕ
	|	ЭтиНужноПроверить.ЭтоОР = ЛОЖЬ
	|	И ЭтиНужноПроверить.ЭтоФМ = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РегистрОР.РодительИерархии,
	|	РегистрОР.РодительИерархии.ТиповойОР,
	|	ЛОЖЬ
	|ИЗ
	|	ЭтиНужноПроверить КАК ЭтиНужноПроверить
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних КАК РегистрОР
	|		ПО ЭтиНужноПроверить.Ссылка = РегистрОР.ОбъектИерархии
	|			И (РегистрОР.РодительИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто))
	|ГДЕ
	|	ЭтиНужноПроверить.ЭтоФМ = ЛОЖЬ
	|	И ЭтиНужноПроверить.ЭтоОР = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РегистрОР.РодительИерархии,
	|	РегистрОР.РодительИерархии.ТиповойОР,
	|	ЛОЖЬ
	|ИЗ
	|	ЭтиНужноПроверить КАК ЭтиНужноПроверить
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних КАК РегистрОР
	|			ПО торо_ОбъектыРемонта.Ссылка = РегистрОР.ОбъектИерархии
	|				И (РегистрОР.РодительИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто))
	|		ПО ЭтиНужноПроверить.Ссылка = торо_ОбъектыРемонта.ТиповойОР
	|ГДЕ
	|	ЭтиНужноПроверить.ЭтоОР = ЛОЖЬ
	|	И ЭтиНужноПроверить.ЭтоФМ = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеФМ.ФМ КАК ФМ,
	|	ВсеФМ.ТОР КАК ТОР,
	|	МАКСИМУМ(ВсеФМ.ПроверитьВсе) КАК ПроверитьВсе
	|ПОМЕСТИТЬ ФМТОР
	|ИЗ
	|	ВсеФМ КАК ВсеФМ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсеФМ.ФМ,
	|	ВсеФМ.ТОР
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ТиповыеОРОграниченияНаХарактеристикиОборудования.Ограничение КАК Ограничение,
	|	торо_ТиповыеОРОграниченияНаХарактеристикиОборудования.Иерархия КАК Иерархия,
	|	ФМТОР.ФМ КАК ФМ,
	|	ЛОЖЬ КАК гкс_Удален
	|ПОМЕСТИТЬ ВсеОграничения
	|ИЗ
	|	ФМТОР КАК ФМТОР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТиповыеОР.ОграниченияНаХарактеристикиОборудования 
	|	КАК торо_ТиповыеОРОграниченияНаХарактеристикиОборудования
	|		ПО ФМТОР.ТОР = торо_ТиповыеОРОграниченияНаХарактеристикиОборудования.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_ОграниченияНаХарактеристикиОборудования.Ограничение,
	|	торо_ОграниченияНаХарактеристикиОборудования.Иерархия,
	|	ФМТОР.ФМ,
	|	торо_ОграниченияНаХарактеристикиОборудования.гкс_Удален
	|ИЗ
	|	ФМТОР КАК ФМТОР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОграниченияНаХарактеристикиОборудования КАК торо_ОграниченияНаХарактеристикиОборудования
	|		ПО ФМТОР.ФМ = торо_ОграниченияНаХарактеристикиОборудования.ФункциональноеМесто
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеОграничения.Ограничение КАК Ограничение,
	|	ВсеОграничения.Иерархия КАК Иерархия,
	|	ВсеОграничения.ФМ КАК ФМ,
	|	МАКСИМУМ(ВсеОграничения.гкс_Удален) КАК гкс_Удален
	|ПОМЕСТИТЬ СхлопнутыеОграничения
	|ИЗ
	|	ВсеОграничения КАК ВсеОграничения
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсеОграничения.Ограничение,
	|	ВсеОграничения.Иерархия,
	|	ВсеОграничения.ФМ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РегистрОР.ОбъектИерархии КАК ОР,
	|	РегистрОР.СтруктураИерархии КАК СтруктураИерархии,
	|	РегистрОР.ОбъектИерархии.ТиповойОР КАК ТОР
	|ПОМЕСТИТЬ ВсеОР
	|ИЗ
	|	ФМТОР КАК ФМТОР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИерархическиеСтруктурыОР КАК РегистрОР
	|		ПО ФМТОР.ФМ = РегистрОР.РодительИерархии
	|			И (ФМТОР.ПроверитьВсе
	|				ИЛИ РегистрОР.ОбъектИерархии В
	|					(ВЫБРАТЬ
	|						ТЧ.Ссылка
	|					ИЗ
	|						ТолькоОР КАК ТЧ))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РегистрОР.ОбъектИерархии,
	|	РегистрОР.СтруктураИерархии,
	|	РегистрОР.ОбъектИерархии.ТиповойОР
	|ИЗ
	|	ФМТОР КАК ФМТОР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних КАК РегистрОР
	|		ПО ФМТОР.ФМ = РегистрОР.РодительИерархии
	|			И (РегистрОР.Удален = ЛОЖЬ)
	|			И (ФМТОР.ПроверитьВсе
	|				ИЛИ РегистрОР.ОбъектИерархии В
	|					(ВЫБРАТЬ
	|						ТЧ.Ссылка
	|					ИЗ
	|						ТолькоОР КАК ТЧ))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СхлопнутыеОграничения.Ограничение КАК Ограничение,
	|	ВсеОР.СтруктураИерархии КАК СтруктураИерархии,
	|	ВсеОР.ОР КАК ОР,
	|	СхлопнутыеОграничения.ФМ КАК ФМ
	|ПОМЕСТИТЬ ОграниченияОР
	|ИЗ
	|	СхлопнутыеОграничения КАК СхлопнутыеОграничения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВсеОР КАК ВсеОР
	|		ПО (СхлопнутыеОграничения.Иерархия = ВсеОР.СтруктураИерархии
	|				ИЛИ СхлопнутыеОграничения.Иерархия = ЗНАЧЕНИЕ(Справочник.торо_СтруктурыОР.ПустаяСсылка))
	|			И (СхлопнутыеОграничения.гкс_Удален = ЛОЖЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_ЗначенияКонтролируемыхПоказателейСрезПоследних.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_ЗначенияКонтролируемыхПоказателейСрезПоследних.Показатель КАК Показатель,
	|	торо_ЗначенияКонтролируемыхПоказателейСрезПоследних.Значение КАК Значение,
	|	торо_ЗначенияКонтролируемыхПоказателейСрезПоследних.ДатаКонтроля КАК ДатаКонтроля
	|ПОМЕСТИТЬ ПоказателиОР
	|ИЗ
	|	РегистрСведений.торо_ЗначенияКонтролируемыхПоказателей.СрезПоследних(
	|			,
	|			ОбъектРемонта В
	|				(ВЫБРАТЬ
	|					ТЧ.ОР
	|				ИЗ
	|					ВсеОР КАК ТЧ)) КАК торо_ЗначенияКонтролируемыхПоказателейСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоказателиОР.ОбъектРемонта КАК ОбъектРемонта,
	|	ПоказателиОР.Показатель КАК Показатель,
	|	МАКСИМУМ(ПоказателиОР.ДатаКонтроля) КАК ДатаКонтроля
	|ПОМЕСТИТЬ ПоказателиОРМаксимум
	|ИЗ
	|	ПоказателиОР КАК ПоказателиОР
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоказателиОР.ОбъектРемонта,
	|	ПоказателиОР.Показатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоказателиОР.ОбъектРемонта КАК ОбъектРемонта,
	|	ПоказателиОР.Показатель КАК Показатель,
	|	ПоказателиОР.Значение КАК Значение
	|ПОМЕСТИТЬ ПоказателиОРСрез
	|ИЗ
	|	ПоказателиОР КАК ПоказателиОР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоказателиОРМаксимум КАК ПоказателиОРМаксимум
	|		ПО ПоказателиОР.ОбъектРемонта = ПоказателиОРМаксимум.ОбъектРемонта
	|			И ПоказателиОР.Показатель = ПоказателиОРМаксимум.Показатель
	|			И ПоказателиОР.ДатаКонтроля = ПоказателиОРМаксимум.ДатаКонтроля
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВсеОР.ТОР КАК ТОР,
	|	торо_ТиповыеОРДополнительныеРеквизиты.Свойство КАК Свойство,
	|	торо_ТиповыеОРДополнительныеРеквизиты.Значение КАК Значение,
	|	ВсеОР.ОР КАК ОР
	|ПОМЕСТИТЬ РеквизитыТОР
	|ИЗ
	|	ВсеОР КАК ВсеОР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТиповыеОР.ДополнительныеРеквизиты КАК торо_ТиповыеОРДополнительныеРеквизиты
	|		ПО ВсеОР.ТОР = торо_ТиповыеОРДополнительныеРеквизиты.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_ОграниченияНаХарактеристикиОбрудованияСписокОграничений.ВидСравнения КАК ВидСравнения,
	|	торо_ОграниченияНаХарактеристикиОбрудованияСписокОграничений.Значение КАК Значение,
	|	ОграниченияОР.ОР КАК ОР,
	|	торо_ОграниченияНаХарактеристикиОбрудованияСписокОграничений.Характеристика КАК Характеристика,
	|	ОграниченияОР.ФМ КАК ФМ
	|ПОМЕСТИТЬ ОграниченияРеквизиты
	|ИЗ
	|	ОграниченияОР КАК ОграниченияОР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОграниченияНаХарактеристикиОбрудования.СписокОграничений КАК торо_ОграниченияНаХарактеристикиОбрудованияСписокОграничений
	|		ПО ОграниченияОР.Ограничение = торо_ОграниченияНаХарактеристикиОбрудованияСписокОграничений.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОграниченияОР.ОР КАК ОР,
	|	торо_ОграниченияНаХарактеристикиОбрудованияСписокОграниченийПоказатели.Характеристика КАК Характеристика,
	|	торо_ОграниченияНаХарактеристикиОбрудованияСписокОграниченийПоказатели.ВидСравнения КАК ВидСравнения,
	|	торо_ОграниченияНаХарактеристикиОбрудованияСписокОграниченийПоказатели.Значение КАК Значение,
	|	ОграниченияОР.ФМ КАК ФМ
	|ПОМЕСТИТЬ ОграниченияПоказатели
	|ИЗ
	|	ОграниченияОР КАК ОграниченияОР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОграниченияНаХарактеристикиОбрудования.СписокОграниченийПоказатели КАК торо_ОграниченияНаХарактеристикиОбрудованияСписокОграниченийПоказатели
	|		ПО ОграниченияОР.Ограничение = торо_ОграниченияНаХарактеристикиОбрудованияСписокОграниченийПоказатели.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОграниченияРеквизиты.ВидСравнения КАК ВидСравнения,
	|	ОграниченияРеквизиты.Значение КАК План,
	|	ОграниченияРеквизиты.ОР КАК ОР,
	|	РеквизитыТОР.Значение КАК Факт,
	|	РеквизитыТОР.Свойство КАК Свойство,
	|	ОграниченияРеквизиты.ФМ КАК ФМ,
	|	ОграниченияРеквизиты.ФМ.Подразделение КАК Подразделение
	|ИЗ
	|	ОграниченияРеквизиты КАК ОграниченияРеквизиты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РеквизитыТОР КАК РеквизитыТОР
	|		ПО ОграниченияРеквизиты.ОР = РеквизитыТОР.ОР
	|			И ОграниченияРеквизиты.Характеристика = РеквизитыТОР.Свойство
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОграниченияПоказатели.ВидСравнения,
	|	ОграниченияПоказатели.Значение,
	|	ОграниченияПоказатели.ОР,
	|	ПоказателиОР.Значение,
	|	ПоказателиОР.Показатель,
	|	ОграниченияПоказатели.ФМ,
	|	ОграниченияПоказатели.ФМ.Подразделение
	|ИЗ
	|	ОграниченияПоказатели КАК ОграниченияПоказатели
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоказателиОРСрез КАК ПоказателиОР
	|		ПО ОграниченияПоказатели.Характеристика = ПоказателиОР.Показатель
	|			И ОграниченияПоказатели.ОР = ПоказателиОР.ОбъектРемонта
	|ИТОГИ
	|	МАКСИМУМ(ФМ)
	|ПО
	|	ОР";
	МВТ = Новый МенеджерВременныхТаблиц();
	Результат = ПроверитьОграниченияМассиваОР(,, ЗапросТекст, МВТ);

	Если Не Результат = Неопределено Тогда 
		Запрос = Новый Запрос();
		Запрос.МенеджерВременныхТаблиц = МВТ;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭтиНужноПроверить.Ссылка КАК Ссылка
		|ИЗ
		|	ЭтиНужноПроверить1 КАК ЭтиНужноПроверить
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЭтиНужноПроверить.Док КАК Док
		|ИЗ
		|	ЭтиНужноПроверить2 КАК ЭтиНужноПроверить";
		РезультатЗапроса = Запрос.ВыполнитьПакет();

		Выборка = РезультатЗапроса[0].Выбрать();
		Пока Выборка.Следующий() Цикл
			НаборЗаписейРегистраторо_ОбъектыДляПроверкиТребованийФМ = 
			РегистрыСведений.торо_ОбъектыДляПроверкиТребованийФМ.СоздатьНаборЗаписей();
			НаборЗаписейРегистраторо_ОбъектыДляПроверкиТребованийФМ.Отбор.Объект.Установить(Выборка.Ссылка);
			НаборЗаписейРегистраторо_ОбъектыДляПроверкиТребованийФМ.Записать();
		КонецЦикла;

		Выборка = РезультатЗапроса[1].Выбрать();
		Пока Выборка.Следующий() Цикл
			НаборЗаписейРегистраторо_ДокументыДляПроверкиТребованийФМ = 
			РегистрыСведений.торо_ДокументыДляПроверкиТребованийФМ.СоздатьНаборЗаписей();
			НаборЗаписейРегистраторо_ДокументыДляПроверкиТребованийФМ.Отбор.ПроверяемыйДокумент.Установить(Выборка.Док);
			НаборЗаписейРегистраторо_ДокументыДляПроверкиТребованийФМ.Записать();
		КонецЦикла;

		//
		Для Каждого СтрокаМассиваНеподходящихОбъектовРемонта Из Результат.НеПодходят Цикл
			СтруктураДанных = Новый Структура("Ссылка,ОбъектРемонта,ТекстТребований,ФМ,ВидДокумента");
			ЗаполнитьЗначенияСвойств(СтруктураДанных, СтрокаМассиваНеподходящихОбъектовРемонта);
			СтруктураДанных.ОбъектРемонта = СтрокаМассиваНеподходящихОбъектовРемонта.Ссылка;
			#Вставка
			Попытка
				торо_РаботаСУведомлениями.ЗаписатьУведомленияФМ(СтруктураДанных, СобытиеФМ);
			Исключение
				ЗаписьЖурналаРегистрации("РЗ_торо_ПроверкаОборудованияНаФункциональныхМестах", УровеньЖурналаРегистрации.Ошибка,,
				СтрокаМассиваНеподходящихОбъектовРемонта.Ссылка, ОписаниеОшибки());

				НаборЗаписейРегистраторо_ОбъектыДляПроверкиТребованийФМ = 
				РегистрыСведений.торо_ОбъектыДляПроверкиТребованийФМ.СоздатьНаборЗаписей();
				НаборЗаписейРегистраторо_ОбъектыДляПроверкиТребованийФМ.Отбор
				.Объект.Установить(СтрокаМассиваНеподходящихОбъектовРемонта.Ссылка);
				НоваяСтрокаНабораЗаписей = НаборЗаписейРегистраторо_ОбъектыДляПроверкиТребованийФМ.Добавить();
				НоваяСтрокаНабораЗаписей.Объект = СтрокаМассиваНеподходящихОбъектовРемонта.Ссылка;
				НоваяСтрокаНабораЗаписей.Период = ТекущаяДата();
				НаборЗаписейРегистраторо_ОбъектыДляПроверкиТребованийФМ.Записать();
			КонецПопытки;
			#КонецВставки
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
