
&После("ДобавитьСтрокуВИсториюСтатусов")
Процедура Расш_гкс_ДобавитьСтрокуВИсториюСтатусов(Форма, СтатусДокумента, ЗаКого, Очистить, Комментарий)
	СтруктураПроверки = Новый Структура("гкс_СдвигЧП", Неопределено);
	ЗаполнитьЗначенияСвойств(СтруктураПроверки, Форма);
	Если Не СтруктураПроверки.гкс_СдвигЧП = Неопределено И НЕ СтруктураПроверки.гкс_СдвигЧП = 0 Тогда 
	#Если Клиент Тогда
		Форма.ИсторияСтатусовРегистр[Форма.ИсторияСтатусовРегистр.Количество()-1].Период
		= Форма.ИсторияСтатусовРегистр[Форма.ИсторияСтатусовРегистр.Количество()-1].Период
			- (СтруктураПроверки.гкс_СдвигЧП * 3600);
		Если Форма.мХранитьИсториюСогласованияВДокументах Тогда
			ОбъектТЧ = Форма.Объект.ИсторияСтатусов;
			ОбъектТЧ[ОбъектТЧ.Количество()-1].Дата = ОбъектТЧ[ОбъектТЧ.Количество()-1].Дата
				- (СтруктураПроверки.гкс_СдвигЧП * 3600);
		КонецЕсли;
	#КонецЕсли
		Для Каждого СтрокаТаблицы Из Форма.ИсторияСтатусовРегистр Цикл
			СтрокаТаблицы.гкс_ПериодЧП = СтрокаТаблицы.Период + (СтруктураПроверки.гкс_СдвигЧП * 3600);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&ИзменениеИКонтроль("УстановитьВидимостьСогласованиеИУтверждение")
Процедура Расш_гкс_УстановитьВидимостьСогласованиеИУтверждение(мИспользоватьСогласованиеДокументов, Объект, ЭтаФорма)

	Элементы = ЭтаФорма.Элементы;
	ЭтаФорма["СогласованиеТолькоПросмотр"] = Ложь;

	Если мИспользоватьСогласованиеДокументов Тогда

		Элементы.СпособСогласования.ТолькоПросмотр = (ЗначениеЗаполнено(Объект.СпособСогласования) 
		И ЗначениеЗаполнено(ЭтаФорма.СтатусДокументаРегистр)  
		#Вставка
		И Не Пользователи.РолиДоступны("гкс_ИзменитьСпособСогласования")
		#КонецВставки
		И ЭтаФорма.СтатусДокументаРегистр <> торо_РаботаССогласованиями.ПолучитьНачальныйСтатус(Объект.СпособСогласования));

		СтруктураДанныхПоСтатусу = торо_РаботаССогласованиями.ПолучитьДанныеПоСтатусуДокумента(Объект.СпособСогласования, ЭтаФорма.СтатусДокументаРегистр);

		Если СтруктураДанныхПоСтатусу.ЗапретитьРедактирование = Истина
			И Не торо_РаботаСоСтатусамиДокументовСервер.ДоступнаРоль("ПолныеПрава") 
			#Вставка
			// гкс+ [Релиз19] Деснол
			И Не торо_РаботаСоСтатусамиДокументовСервер.ДоступнаРоль("гкс_РедактированиеЗаявкиНаРемонт") 
			// гкс- [Релиз19]
			// гкс+ [10.23] Деснол 09.04.2024
			И Не торо_РаботаСоСтатусамиДокументовСервер.ДоступнаРоль("гкс_РедактированиеСогласованныйЕвоБланк") 
			// гкс- [10.23] Деснол 09.04.2024
			#КонецВставки
			Тогда

			ЭтаФорма["СогласованиеТолькоПросмотр"] = Истина;

			Исключения = Новый Соответствие;
			Исключения.Вставить("ФормаКоманднаяПанель", Новый Структура("СПодчиненными", Истина));
			Исключения.Вставить("ГруппаСогласование", Новый Структура("СПодчиненными", Истина));
			Исключения.Вставить("ДиаграммаРемонтов", Новый Структура("СПодчиненными", Истина));
			Исключения.Вставить("ДеревоПланаГрафикаППРСУчетомПозицииПоказыватьПоложение", Новый Структура("СПодчиненными", Ложь));
			Исключения.Вставить("ДеревоПланаГрафикаППРСУчетомПозицииГруппировкаПоМаршруту", Новый Структура("СПодчиненными", Ложь));
			Исключения.Вставить("ДеревоПланаГрафикаППРСУчетомПозицииПоказыватьОР", Новый Структура("СПодчиненными", Ложь));
			Исключения.Вставить("ОбъектыРемонтаОтображатьПоложение", Новый Структура("СПодчиненными", Ложь));
			УстановитьТолькоПросмотрФормы(ЭтаФорма, Исключения);

		КонецЕсли;

	КонецЕсли;	

	Элементы.НадписьТекущийСтатусДокумента.Видимость = мИспользоватьСогласованиеДокументов;
	Элементы.ТекущийСтатусДокумента.Видимость        = мИспользоватьСогласованиеДокументов;
	Элементы.ГруппаСогласование.Видимость            = мИспользоватьСогласованиеДокументов;
	Элементы.ДеревоСогласованияУтвердитьСтатус.Доступность = ЗначениеЗаполнено(Объект.СпособСогласования);

КонецПроцедуры
