
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	КолВоДнейАктуальности = Константы.гкс_КоличествоДнейДоОкончанияАктуальностиТК.Получить();
	УстановитьПривилегированныйРежим(Ложь);
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();    
    Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КолВоДнейАктуальности", КолВоДнейАктуальности);    
    КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	//ДанныеРасшифровкиКомпоновкиДанных = Новый ДанныеРасшифровкиКомпоновкиДанных;
	//ДанныеРасшифровки = ПоместитьВоВременноеХранилище(ДанныеРасшифровкиКомпоновкиДанных);
	
КонецПроцедуры
