
&ИзменениеИКонтроль("ДобавитьКомандыПечати")
Процедура гкс_ДобавитьКомандыПечати(КомандыПечати)

	ФО_УправлениеПерсоналом = ПолучитьФункциональнуюОпцию("торо_ИспользоватьУправлениеПерсоналом");
	
	#Удаление
	Если Пользователи.РолиДоступны("ДобавлениеИзменениеДанныхДляНачисленияЗарплаты,ЧтениеДанныхДляНачисленияЗарплаты,ДобавлениеИзменениеКадровогоСостоянияРасширенная,ЧтениеКадровогоСостоянияРасширенная") 
	#КонецУдаления
	#Вставка
	Если Пользователи.РолиДоступны("ДобавлениеИзменениеПроведениеПометкаУдаленияУвольнений,ЧтениеУвольнений,
			|гкс_РедактированиеЗаявкиНаРемонт") 
	#КонецВставки
		И ФО_УправлениеПерсоналом Тогда
		// Приказ об увольнении
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Обработка.торо_ПечатьКадровыхПриказов";
		КомандаПечати.Идентификатор = "ПФ_MXL_Т8";
		КомандаПечати.Представление = НСтр("es='La orden del despido';ru='Приказ об увольнении';en='Dismissal order'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
		"НастройкиТОиР",
		"ПечатьДокументовБезПредварительногоПросмотра",
		Ложь);

	КонецЕсли;

КонецПроцедуры
