////////////////////////////////////////////////////////////////////////////////
// гкс_ИнтеграцияXDTOАдаптерПовтИсп
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция ПолучитьПолноеИмяИзXDTO
//
// Описание: Поиск имени объекта метаданных текущей ИБ по имени типа XDTO.
//
// Параметры
//  ИмяТипаXDTO - Строка - ИмяТипаXDTO
//
// Возвращаемое значение: 
//	Строка - имя объекта метаданных текущей ИБ.
//   
// Гкс+[CPM30-1106] Селимов от 09.07.2020. Добавлено:{
Функция ПолучитьПолноеИмяИзXDTO(ИмяТипаXDTO) Экспорт
	
	ТаблицаСоответствия = СоответствиеТипов();
	Строка = ТаблицаСоответствия.Найти(ИмяТипаXDTO, "ИмяXDTO");
	Если Строка = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат Строка.ИмяТипа;
	
КонецФункции  // } Гкс-[CPM30-1106]

// Функция СоответствиеТипов
//
// Описание: Сформировывет таблицу соответствий имен метаданных текущей ИБ и имен типов XDTO.
//
// Возвращаемое значение: 
//	ТаблицаЗначений -  таблица соответствий имен метаданных текущей ИБ и имен типов XDTO.
//   
// Гкс+[CPM30-1106] Селимов от 09.07.2020. Добавлено:{
Функция СоответствиеТипов() Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ИмяXDTO",	Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("ИмяТипа",	Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("ИспользоватьМенеджер",	Новый ОписаниеТипов("Булево"));
	
	//добавление соответствий типов
	ДобавитьСтроку(Таблица, "ASCompany",						"Справочник.Организации");
	ДобавитьСтроку(Таблица, "ASCounterparty",					"Справочник.Контрагенты");
	ДобавитьСтроку(Таблица, "ASContract",						"Справочник.ДоговорыКонтрагентов");
	ДобавитьСтроку(Таблица, "ASCurrency",						"Справочник.Валюты");
	ДобавитьСтроку(Таблица, "ASPerson",							"Справочник.ФизическиеЛица");
	ДобавитьСтроку(Таблица, "ASBudget",							"Справочник.Периоды");
	ДобавитьСтроку(Таблица, "ASDepartment",						"Справочник.Организации");
	ДобавитьСтроку(Таблица, "ASProject",						"Справочник.Проекты");
	ДобавитьСтроку(Таблица, "ASBudgetItem",						"Справочник.СтатьиДвиженияДенежныхСредств");
	ДобавитьСтроку(Таблица, "ASUser", 							"Справочник.Пользователи");
	ДобавитьСтроку(Таблица, "ASContactInformationKind",			"Справочник.ВидыКонтактнойИнформации");
	ДобавитьСтроку(Таблица, "ASBankAccount",					"Справочник.БанковскиеСчета");
	ДобавитьСтроку(Таблица, "ASCountry",						"Справочник.СтраныМира");
	ДобавитьСтроку(Таблица, "ASUniversalReport", 	    		"Справочник.ПроизвольныеОтчеты");
	ДобавитьСтроку(Таблица, "ASVATRates",						"Перечисление.СтавкиНДС");
	ДобавитьСтроку(Таблица, "ASContactInformationType",			"Перечисление.ТипыКонтактнойИнформации");
	ДобавитьСтроку(Таблица, "ASContractKinds",					"Перечисление.ВидыДоговоровКонтрагентов");
	ДобавитьСтроку(Таблица, "ASPaymentInvoice",					"Документ.гкс_СчетНаОплату");
	ДобавитьСтроку(Таблица, "ASDealKinds",						"Перечисление.ВидыСоглашений");
	ДобавитьСтроку(Таблица, "ASPaymentRateDefinitionMethod", 	"Перечисление.СпособыОпределенияКурсаПлатежа");
	ДобавитьСтроку(Таблица, "ASCreditProvidingTypes",			"Перечисление.гкс_ВидыОбеспеченияКредита");
	ДобавитьСтроку(Таблица, "ASTypeCounterpartyKinds",			"Перечисление.ЮридическоеФизическоеЛицо");
	// Гкс+[] Селимов от 14.01.2021. Добавлено:{
	ДобавитьСтроку(Таблица, "ASCostCenter",						"Справочник.СтруктураПредприятия");
	ДобавитьСтроку(Таблица, "ASJobTitle",						"Справочник.Должности"); // } Гкс-[] 
	Возврат Таблица;
	
КонецФункции  // } Гкс-[CPM30-1106]

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура ДобавитьСтроку
//
// Описание: добавление строки в таблицу значений Соответствия типов.
//
// Параметры
//  Таблица - ТаблицаЗначений - Таблица, в которую добавляется строка
//  ИмяXDTO - Строка - имя типа объекта XDTO
//  ИмяТипа - Строка - имя типа текущей ИБ
//  ИспользоватьМенеджер - Булево - ИспользоватьМенеджер
//
// Гкс+[CPM30-1106] Селимов от 09.07.2020. Добавлено:{
Процедура ДобавитьСтроку(Таблица, ИмяXDTO, ИмяТипа, ИспользоватьМенеджер = Ложь) Экспорт
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ИмяXDTO = ИмяXDTO;
	НоваяСтрока.ИмяТипа = ИмяТипа;
	НоваяСтрока.ИспользоватьМенеджер = ИспользоватьМенеджер;
	
КонецПроцедуры  // } Гкс-[CPM30-1106]

Функция ПолучитьПриложениеПоИмени(НаименованиеПриложения) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Приложение = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	гкс_УчастникиОбменаRMQ.Ссылка КАК Приложение
		|ИЗ
		|	Справочник.гкс_УчастникиОбменаRMQ КАК гкс_УчастникиОбменаRMQ
		|ГДЕ
		|	гкс_УчастникиОбменаRMQ.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", НаименованиеПриложения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Приложение = Выборка.Приложение;
		
	КонецЕсли;
	
	Возврат Приложение;

КонецФункции               

#КонецОбласти
