// гкс+ [КПИ] Куст 27.11.2020
&НаСервере
&ИзменениеИКонтроль("ВывестиДанныеПоказателей")
Процедура Расш_гкс_ВывестиДанныеПоказателей(СписокВариантовАнализа)

	ТаблицаПараметровДиаграмм = торо_ПоказателиKPI.ПолучитьТаблицуСоответствиТиповАнализаИТиповДиаграмм();

	НомерЯчейки = 0;
	Для каждого ЭлементСписка из СписокВариантовАнализа Цикл
		НомерЯчейки = НомерЯчейки + 1;

		ВариантАнализа = ЭлементСписка.Значение;
		Показатель = ВариантАнализа.Владелец;
		ВариантОтображения = ВариантАнализа.ВариантОтображенияПоУмолчанию;

		СтрокаПоказателя = ДанныеПоказателей.НайтиСтроки(Новый Структура("Показатель", Показатель));
		Если СтрокаПоказателя.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		СтрокаПоказателя = СтрокаПоказателя[0];

		Если ЭтоАдресВременногоХранилища(СтрокаПоказателя.АдресХранилищаДанных) Тогда
			ТабДанныхИсх = ПолучитьИзВременногоХранилища(СтрокаПоказателя.АдресХранилищаДанных);
			ТабДанных = ТабДанныхИсх.Скопировать();
		Иначе
			Продолжить;
		КонецЕсли;

		Если ЭтоАдресВременногоХранилища(СтрокаПоказателя.АдресХранилищаДанныхСПериодами) Тогда
			ТабДанныхСПериодамиИсх = ПолучитьИзВременногоХранилища(СтрокаПоказателя.АдресХранилищаДанныхСПериодами);
			ТабДанныхСПериодами = ТабДанныхСПериодамиИсх.Скопировать();
		Иначе
			Продолжить;
		КонецЕсли;

		Попытка
			СтруктураДанныхДляВывода = торо_ПоказателиKPI.ПолучитьСтруктураДанныхДляВыводаВМонитор(ТабДанных, ТабДанныхСПериодами, ВариантАнализа, ЭтаФорма);
			#Вставка
			Если Не СтруктураДанныхДляВывода = Неопределено Тогда 
				СтруктураЦелевыхЗначений = Неопределено;
				Для каждого Строка Из ТабДанных Цикл
					Если ЗначениеЗаполнено(Строка.Организация) Тогда
						СтруктураЦелевыхЗначений = торо_ПоказателиKPI.ПолучитьЦелевыеЗначенияДляСтрокиТаблицы1(ЭтаФорма, Показатель, Строка, Новый Массив);
						Прервать;
					КонецЕсли; 
				КонецЦикла;
				
				Если СтруктураЦелевыхЗначений = Неопределено Тогда
					МассивСтрок = ЭтаФорма.ЦелевыеЗначенияПоказателей.НайтиСтроки(Новый Структура("Показатель", Показатель));
					Если МассивСтрок.Количество() > 0 Тогда
						СтруктураЦелевыхЗначений = Новый Структура("ЦелевоеЗначение, КритическоеЗначение", 0, 0);
						
						ЗаполнитьЗначенияСвойств(СтруктураЦелевыхЗначений, МассивСтрок[0]);
					КонецЕсли; 
				КонецЕсли; 
				
				Если НЕ СтруктураДанныхДляВывода.Свойство("ЦелевоеЗначение") Тогда
					СтруктураДанныхДляВывода.Вставить("ЦелевоеЗначение"    , 0);
					СтруктураДанныхДляВывода.Вставить("КритическоеЗначение", 0);
					Если Не СтруктураЦелевыхЗначений = Неопределено Тогда
						ЗаполнитьЗначенияСвойств(СтруктураДанныхДляВывода, СтруктураЦелевыхЗначений);
					КонецЕсли; 
				КонецЕсли; 
			КонецЕсли;
			#КонецВставки
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
			ШаблонОшибки = НСтр("es='Al tratamiento de los datos del índice ""%1"" había una falta: %2';ru='При обработке данных показателя ""%1"" произошла ошибка: %2';en='An error occurred while processing the data for metric ""%1"":%2'");
			ТекстСообщения = СтрШаблон(ШаблонОшибки, ВариантАнализа, ОписаниеОшибки);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Продолжить;
		КонецПопытки;

		Если СтруктураДанныхДляВывода = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Попытка
			Если ВариантОтображения = Перечисления.торо_ВариантыОтображенияВариантовАнализа.Диаграмма Тогда
				ВывестиДанныеПоказателяВДиаграмму(СтруктураДанныхДляВывода, ВариантАнализа, НомерЯчейки);
			ИначеЕсли ВариантОтображения = Перечисления.торо_ВариантыОтображенияВариантовАнализа.Кратко Тогда
				ВывестиДанныеПоказателяВКраткомВиде(СтруктураДанныхДляВывода, ВариантАнализа, НомерЯчейки);
			ИначеЕсли ВариантОтображения = Перечисления.торо_ВариантыОтображенияВариантовАнализа.Таблица Тогда
				ВывестиДанныеПоказателяВТаблицу(СтруктураДанныхДляВывода, ВариантАнализа, НомерЯчейки);
			КонецЕсли;
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
			ШаблонОшибки = НСтр("es='A la conclusión de los datos del índice ""%1"" había una falta: %2';ru='При выводе данных показателя ""%1"" произошла ошибка: %2';en='An error occurred while displaying the data for the metric ""%1"":%2'");
			ТекстСообщения = СтрШаблон(ШаблонОшибки, ВариантАнализа, ОписаниеОшибки);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;
	КонецЦикла

КонецПроцедуры
// гкс- [КПИ] Куст 27.11.2020

// гкс+ [КПИ] Куст 27.11.2020
&НаСервере
&ИзменениеИКонтроль("УстановитьВидимостьНастроекИнтегральнойОценки")
Процедура Расш_гкс_УстановитьВидимостьНастроекИнтегральнойОценки()

	ЭлементТипСерийИнтегральнойОценки = НайтиЭлементФормыПользовательскойНастройкиПоЗаголовку(ЭтаФорма, "Тип серий интегральной оценки");
	#Вставка
	Если ЭлементТипСерийИнтегральнойОценки = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	#КонецВставки
	Если РежимМонитора = "Обычный" Тогда
		ЭлементТипСерийИнтегральнойОценки.Видимость = Ложь;
	Иначе
		ЭлементТипСерийИнтегральнойОценки.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры
// гкс- [КПИ] Куст 27.11.2020

// гкс+ [КПИ] Куст 27.11.2020
&НаСервере
Процедура Расш_гкс_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	ДобавитьНовыеЭлементы();
КонецПроцедуры
// гкс- [КПИ] Куст 27.11.2020

// гкс+ [КПИ] Куст 27.11.2020
&НаСервере
Процедура ДобавитьНовыеЭлементы()
	НовыеРеквизиты = Новый Массив();
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("гкс_ТЧ_Настройки", Новый ОписаниеТипов("ТаблицаЗначений")));
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("Показатель",
		Новый ОписаниеТипов("СправочникСсылка.торо_ПоказателиKPI"), "гкс_ТЧ_Настройки"));
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("Параметр", Новый ОписаниеТипов("Строка"), "гкс_ТЧ_Настройки"));
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("Значение", Новый ОписаниеТипов(), "гкс_ТЧ_Настройки"));
	ИзменитьРеквизиты(НовыеРеквизиты);
	//
	гкс_ЗагрузитьНастройки()
КонецПроцедуры
// гкс- [КПИ] Куст 27.11.2020

// гкс+ [КПИ] Куст 27.11.2020
&НаСервере
Процедура гкс_ЗагрузитьНастройки()
	КлючНастроек = "ФармаОтчета.торо_МониторKPI";
	ЗначениеНастроек = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(КлючНастроек, КлючНастроек);
	Если ТипЗнч(ЗначениеНастроек) = Тип("Соответствие") Тогда
		ТемпМассив 				= ЗначениеНастроек.Получить("гкс_ТЧ_Настройки");
		Для Каждого СтрокаМассива Из ТемпМассив Цикл
			НоваяСтрока = ЭтотОбъект["гкс_ТЧ_Настройки"].Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМассива);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
// гкс- [КПИ] Куст 27.11.2020

// гкс+ [КПИ] Куст 27.11.2020
&НаСервере
Процедура гкс_СохранитьНастройки()
	КлючНастроек = "ФармаОтчета.торо_МониторKPI";
	Настройки = Новый Соответствие;
	ТемпМассив = Новый Массив();
	Для Каждого СТ Из ЭтотОбъект["гкс_ТЧ_Настройки"] Цикл
		ТемпСтрукт = Новый Структура("Показатель,Параметр,Значение", Неопределено, Неопределено, Неопределено);
		Если ЗначениеЗаполнено(СТ.Показатель) Тогда 
			ЗаполнитьЗначенияСвойств(ТемпСтрукт, СТ);
			ТемпМассив.Добавить(ТемпСтрукт);
		КонецЕсли;
	КонецЦикла;
	Настройки.Вставить("гкс_ТЧ_Настройки", ТемпМассив);
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(КлючНастроек, КлючНастроек, Настройки);
КонецПроцедуры
// гкс- [КПИ] Куст 27.11.2020

// гкс+ [КПИ] Куст 27.11.2020
&НаКлиенте
Процедура Расш_гкс_ПередЗакрытиемПосле(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если Не ЗавершениеРаботы Тогда 
		гкс_СохранитьНастройки();
	КонецЕсли;
КонецПроцедуры
// гкс- [КПИ] Куст 27.11.2020

// гкс+ [КПИ] Куст 27.11.2020
&НаКлиенте
Процедура гкс_ОткрытьНастройкиВарианта(Команда)
	НомерЯчейки = СтрЗаменить(Команда.Имя, "_гкс_ОткрытьНастройкиВарианта", "");
	Попытка
		НомерЯчейки = Число(НомерЯчейки);
	Исключение
		Возврат;
	КонецПопытки;
	ВариантАнализа = СписокВариантовАнализа[НомерЯчейки-1].Значение;
	ТекПоказатель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВариантАнализа, "Владелец");
	Если Не ТекПоказатель = Неопределено Тогда 
		ТемпСтрукт = Новый Структура("МассивНастроек", Новый Массив());
		ОргЕсть = Ложь; ПодрЕсть = Ложь; ОрЕсть = Ложь;
		Для Каждого СТ Из ЭтотОбъект["гкс_ТЧ_Настройки"] Цикл
			Если СТ.Показатель = ТекПоказатель Тогда 
				СтрокаТЧ = Новый Структура("Показатель,Параметр,Значение", Неопределено, Неопределено, Неопределено);
				ЗаполнитьЗначенияСвойств(СтрокаТЧ, СТ);
				ТемпСтрукт.МассивНастроек.Добавить(СтрокаТЧ);
				Если СТ.Параметр = "Организация" Тогда 
					ОргЕсть = Истина;
				ИначеЕсли СТ.Параметр = "Подразделение" Тогда 
					ПодрЕсть = Истина;
				ИначеЕсли СТ.Параметр = "Объект ремонта" Тогда 
					ОРЕсть = Истина;
				КонецЕсли;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ОргЕсть = Ложь Тогда 
			СтрокаТЧ = Новый Структура("Показатель,Параметр,Значение", ТекПоказатель, "Организация", Неопределено);
			ТемпСтрукт.МассивНастроек.Добавить(СтрокаТЧ);
		КонецЕсли;
		Если ПодрЕсть = Ложь Тогда 
			СтрокаТЧ = Новый Структура("Показатель,Параметр,Значение", ТекПоказатель, "Подразделение", Неопределено);
			ТемпСтрукт.МассивНастроек.Добавить(СтрокаТЧ);
		КонецЕсли;
		Если ОрЕсть = Ложь Тогда 
			СтрокаТЧ = Новый Структура("Показатель,Параметр,Значение", ТекПоказатель, "Объект ремонта", Неопределено);
			ТемпСтрукт.МассивНастроек.Добавить(СтрокаТЧ);
		КонецЕсли;
		СтруктураОпОп = Новый Структура();
		ОпОп = Новый ОписаниеОповещения("гкс_ПослеИзмененияНастроек",ЭтотОбъект,СтруктураОпОп);
		
		ОткрытьФорму("Отчет.торо_МониторKPI.Форма.гкс_НастройкиВарианта", ТемпСтрукт, ЭтотОбъект,,,, ОпОП, 
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры
// гкс- [КПИ] Куст 27.11.2020

// гкс+ [КПИ] Куст 27.11.2020
&НаКлиенте
Процедура гкс_ПослеИзмененияНастроек(Результат, ДопПараметры)Экспорт
	Если Не Результат = Неопределено Тогда 
		Для Каждого СтрокаМассива Из Результат Цикл
			НоваяСтрока = Неопределено;
			Для Каждого СтрокаТаблицы Из ЭтотОбъект["гкс_ТЧ_Настройки"] Цикл
				Если СтрокаТаблицы.Показатель = СтрокаМассива.Показатель И СтрокаТаблицы.Параметр = СтрокаМассива.Параметр Тогда 
					НоваяСтрока = СтрокаТаблицы;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если НоваяСтрока = Неопределено Тогда 
				НоваяСтрока = ЭтотОбъект["гкс_ТЧ_Настройки"].Добавить();
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМассива);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("СоздатьСеткуЭлементовФормы")
Процедура Расш_гкс_СоздатьСеткуЭлементовФормы(КоличествоСтрок, КоличествоКолонок, СписокВариантовАнализа)

	УдалитьСтарыеЭлементы();

	РодительскаяГруппа = Элементы[ИмяГруппыСеткиДиаграмм];

	НомерЯчейки = 1;
	Для НомерСтроки = 1 по КоличествоСтрок Цикл
		Если НомерЯчейки > СписокВариантовАнализа.Количество() Тогда
			Прервать;
		КонецЕсли;

		ГруппаСтрока = Элементы.Добавить("Строка"+НомерСтроки, Тип("ГруппаФормы"), РодительскаяГруппа);
		ГруппаСтрока.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаСтрока.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		ГруппаСтрока.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаСтрока.Объединенная = Ложь;

		Для НомерКолонки = 1 По КоличествоКолонок Цикл
			Если НомерЯчейки > СписокВариантовАнализа.Количество() Тогда
				Прервать;
			КонецЕсли;

			НомерЯчейкиСтрокой = Формат(НомерЯчейки, "ЧГ=0");

			ВариантАнализа = СписокВариантовАнализа[НомерЯчейки-1].Значение;
			ЕдиницаИзмерения = ВариантАнализа.Владелец.ЕдиницаИзмерения;

			ГруппаЯчейка = Элементы.Добавить("Ячейка"+НомерЯчейкиСтрокой, Тип("ГруппаФормы"), ГруппаСтрока);
			ГруппаЯчейка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаЯчейка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			ГруппаЯчейка.Отображение = ОтображениеОбычнойГруппы.Нет;

			ГруппаШапкаПоказателя = Элементы.Добавить("ШапкаПоказателя"+НомерЯчейкиСтрокой, Тип("ГруппаФормы"), ГруппаЯчейка);
			ГруппаШапкаПоказателя.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаШапкаПоказателя.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
			ГруппаШапкаПоказателя.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаШапкаПоказателя.РастягиватьПоГоризонтали = Истина;

			ДекорацияПоказателя = Элементы.Добавить("НаименованиеПоказателя"+НомерЯчейкиСтрокой, Тип("ДекорацияФормы"), ГруппаШапкаПоказателя);
			ДекорацияПоказателя.Вид = ВидДекорацииФормы.Надпись;
			ДекорацияПоказателя.АвтоМаксимальнаяШирина = Ложь;
			ДекорацияПоказателя.РастягиватьПоГоризонтали = Истина;
			ДекорацияПоказателя.Заголовок = Строка(ВариантАнализа) + ", "+Строка(ЕдиницаИзмерения);
			ДекорацияПоказателя.Шрифт = Новый Шрифт(ДекорацияПоказателя.Шрифт,,,Истина);

			ГруппаКоманднаяПанельПоказателя = Элементы.Добавить("КоманднаяПанельПоказателя"+НомерЯчейкиСтрокой, Тип("ГруппаФормы"), ГруппаШапкаПоказателя);
			ГруппаКоманднаяПанельПоказателя.Вид = ВидГруппыФормы.КоманднаяПанель;
			ГруппаКоманднаяПанельПоказателя.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;

			ПодменюПоказателя = Элементы.Добавить("ПодменюПоказателя"+НомерЯчейкиСтрокой, Тип("ГруппаФормы"), ГруппаКоманднаяПанельПоказателя);
			ПодменюПоказателя.Вид = ВидГруппыФормы.Подменю;
			ПодменюПоказателя.Заголовок = "\/";

			КомандаРасшифровки = ЭтаФорма.Команды.Добавить("_РасшифроватьПоказатель"+НомерЯчейкиСтрокой);
			КомандаРасшифровки.Заголовок = "Расшифровать показатель";
			КомандаРасшифровки.Действие = "Подключаемый_РасшифроватьПоказатель";
			КомандаРасшифровки.Картинка = БиблиотекаКартинок.Отчет;

			ЭлементКомандаРасшифровки = Элементы.Добавить("_РасшифроватьПоказатель"+НомерЯчейкиСтрокой, Тип("КнопкаФормы"), ПодменюПоказателя);
			ЭлементКомандаРасшифровки.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
			ЭлементКомандаРасшифровки.ИмяКоманды = "_РасшифроватьПоказатель"+НомерЯчейкиСтрокой;

			КомандаОткрытия = ЭтаФорма.Команды.Добавить("_ОткрытьПоказатель"+НомерЯчейкиСтрокой);
			КомандаОткрытия.Заголовок = "Открыть показатель";
			КомандаОткрытия.Действие = "Подключаемый_ОткрытьПоказатель";
			КомандаОткрытия.Картинка = БиблиотекаКартинок.Изменить;

			ЭлементКомандаОткрытия = Элементы.Добавить("_ОткрытьПоказатель"+НомерЯчейкиСтрокой, Тип("КнопкаФормы"), ПодменюПоказателя);
			ЭлементКомандаОткрытия.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
			ЭлементКомандаОткрытия.ИмяКоманды = "_ОткрытьПоказатель"+НомерЯчейкиСтрокой;
			#Вставка
			КомандаРасшифровки = ЭтаФорма.Команды.Добавить("_гкс_ОткрытьНастройкиВарианта"+НомерЯчейкиСтрокой);
			КомандаРасшифровки.Заголовок = "Настройки варианта";
			КомандаРасшифровки.Действие = "гкс_ОткрытьНастройкиВарианта";
			КомандаРасшифровки.Картинка = БиблиотекаКартинок.Отчет;

			ЭлементКомандаРасшифровки = Элементы.Добавить("_гкс_ОткрытьНастройкиВарианта"+НомерЯчейкиСтрокой, Тип("КнопкаФормы"), ПодменюПоказателя);
			ЭлементКомандаРасшифровки.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
			ЭлементКомандаРасшифровки.ИмяКоманды = "_гкс_ОткрытьНастройкиВарианта"+НомерЯчейкиСтрокой;
			#КонецВставки

			ДобавитьДиаграммуДляВариантаАнализа(НомерЯчейки, ГруппаЯчейка, ВариантАнализа);

			НомерЯчейки = НомерЯчейки + 1;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры
// гкс- [КПИ] Куст 27.11.2020

// гкс+ [КПИ] Куст 27.11.2020
&НаСервере
&ИзменениеИКонтроль("УдалитьСтарыеЭлементы")
Процедура Расш_гкс_УдалитьСтарыеЭлементы()

	РодительскаяГруппа = Элементы[ИмяГруппыСеткиДиаграмм];
	УдаляемыеЭлементы = Новый массив;
	Для каждого Элемент из РодительскаяГруппа.ПодчиненныеЭлементы Цикл
		УдаляемыеЭлементы.Добавить(Элемент);
	КонецЦикла; 

	Для каждого Элемент из УдаляемыеЭлементы Цикл
		Элементы.Удалить(Элемент);
	КонецЦикла;

	УдаляемыеКоманды = Новый Массив;
	Для каждого Команда из ЭтаФорма.Команды Цикл
		Если СтрНачинаетсяС(Команда.Имя, "_РасшифроватьПоказатель") 
			#Вставка
			ИЛИ СтрНачинаетсяС(Команда.Имя, "_гкс_ОткрытьНастройкиВарианта")
			#КонецВставки
			ИЛИ СтрНачинаетсяС(Команда.Имя, "_ОткрытьПоказатель") Тогда
			УдаляемыеКоманды.Добавить(Команда);
		КонецЕсли;
	КонецЦикла;

	Для каждого Команда из УдаляемыеКоманды Цикл
		ЭтаФорма.Команды.Удалить(Команда);
	КонецЦикла;

	УдаляемыеРеквизиты = Новый Массив;
	МассивРеквизитов = ПолучитьРеквизиты();
	Для каждого Реквизит из МассивРеквизитов Цикл
		Если СтрНачинаетсяС(Реквизит.Имя, "_Результат") Тогда
			УдаляемыеРеквизиты.Добавить(Реквизит.Имя);
		КонецЕсли;
	КонецЦикла;

	ИзменитьРеквизиты(,УдаляемыеРеквизиты);

КонецПроцедуры
// гкс- [КПИ] Куст 27.11.2020
