#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Идентификатор = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ИерархияТип")).ИдентификаторПользовательскойНастройки;
	СтрокаПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Идентификатор);
	
	Если СтрокаПараметр <> Неопределено И ЗначениеЗаполнено(СтрокаПараметр.Значение) Тогда
		ТекИерархия = СтрокаПараметр.Значение;
	Иначе
		ТекИерархия = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			"НастройкиТОиР",
			"ОсновнаяСтруктураИерархии",
			Справочники.торо_СтруктурыОР.ПустаяСсылка());
			
		Если СтрокаПараметр <> Неопределено Тогда
			СтрокаПараметр.Значение = ТекИерархия;
		КонецЕсли;
		
	КонецЕсли;
	
	торо_ОтчетыСервер.УстановитьЗапросыНаборовДанныхИерархииОР(СхемаКомпоновкиДанных, ТекИерархия, "ТекущаяДата");

	Если ТекИерархия.СтроитсяАвтоматически Тогда
		торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.Иерархия);
	Иначе
		торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.ТолькоИерархия);
	КонецЕсли;
	
	ТабНаработки = ПолучитьТабЗначСРезультатомОтчета(ТекИерархия);
	ТабРезультата = ДобавитьКолонкуОбъектИерархии(ТабНаработки, ТекИерархия);
	
	// Сгенерируем макет компоновки данных при помощи компоновщика макета.
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	// В качестве схемы компоновки будет выступать схема самого отчета.
	// В качестве настроек отчета - текущие настройки отчета.
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	// получаем внешние наборы данных
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("НаборДанных", ТабРезультата);
	
	// Создадим и инициализируем процессор компоновки.
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных,ДанныеРасшифровки,Истина);
	

	// Создадим и инициализируем процессор вывода результата.
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.ОтображатьПроцентВывода = Истина;

	// выводим отчет
	ПроцессорВывода.Вывести(ПроцессорКомпоновки,Истина);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция ПолучитьТабЗначСРезультатомОтчета(ТекИерархия)
	
	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	
	Если Параметр = Неопределено Тогда
		
		ДатаНач = Дата(1,1,1);
		ДатаКон = Дата(3999,12,31);
		
	Иначе
		
		СтрокаПользовательскийПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Параметр.ИдентификаторПользовательскойНастройки);
		
		Если СтрокаПользовательскийПараметр = Неопределено Тогда
			ДатаНач = Параметр.Значение.ДатаНачала;
			ДатаКон = Параметр.Значение.ДатаОкончания;
		Иначе
			ДатаНач = СтрокаПользовательскийПараметр.Значение.ДатаНачала;
			ДатаКон = СтрокаПользовательскийПараметр.Значение.ДатаОкончания;
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	НАЧАЛОПЕРИОДА(торо_ПланГрафикРемонтаПланРемонтов.ДатаОкончанияРемонтныхРабот, ДЕНЬ) КАК ПланируемаяДатаОкончанияРемонта,
	               |	НАЧАЛОПЕРИОДА(торо_ПланГрафикРемонтаПланРемонтов.ДатаНачалаРемонтныхРабот, ДЕНЬ) КАК ПланируемаяДатаНачалаРемонта,
	               |	торо_ПланГрафикРемонтаПланРемонтов.ВидРемонтныхРабот КАК ВидРемонта,
	               |	торо_ПланГрафикРемонтаПланРемонтов.ОбъектРемонтныхРабот КАК ОбъектРемонта,
	               |	торо_ПланГрафикРемонтаПланРемонтов.Регистратор КАК Регистратор,
	               |	торо_ПланГрафикРемонтаПланРемонтов.ID КАК ID_Ремонта
	               |ИЗ
	               |	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних КАК торо_ПланГрафикРемонтаПланРемонтов
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	               |		ПО торо_ПланГрафикРемонтаПланРемонтов.ОбъектРемонтныхРабот = торо_ОбъектыРемонта.Ссылка
	               |ГДЕ
	               |	НЕ торо_ПланГрафикРемонтаПланРемонтов.Отменен
	               |	И НЕ торо_ПланГрафикРемонтаПланРемонтов.Замещен
	               |	И торо_ПланГрафикРемонтаПланРемонтов.ДатаНачалаРемонтныхРабот МЕЖДУ &ДатаНач И &ДатаКон";
						   
	Запрос.УстановитьПараметр("ДатаНач",ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон",ДатаКон);
	ТабРемонтов = Запрос.Выполнить().Выгрузить();
	
	ТабНаработки = торо_РаботаСНаработкой.РассчитатьНаработку(ТабРемонтов,ДатаНач,ДатаКон);
		
	Возврат ТабНаработки;
	
КонецФункции

Функция ДобавитьКолонкуОбъектИерархии(ТабНаработки, ТекИерархия)

	Запрос = Новый Запрос;
	
	Если ТекИерархия.СтроитсяАвтоматически Тогда
				
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВТ_Данные.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
		|	ВТ_Данные.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
		|	ВТ_Данные.Показатель КАК Показатель,
		|	ВТ_Данные.ДатаНач КАК ДатаНач,
		|	ВТ_Данные.ID КАК ID,
		|	ВТ_Данные.Наработка КАК Наработка
		|ПОМЕСТИТЬ ВТ_ДанныеПредв
		|ИЗ
		|	&ВТ_Данные КАК ВТ_Данные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеПредв.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
		|	ВТ_ДанныеПредв.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
		|	ВТ_ДанныеПредв.Показатель КАК Показатель,
		|	ВТ_ДанныеПредв.ДатаНач КАК ДатаНач,
		|	ВТ_ДанныеПредв.ID КАК ID,
		|	ВТ_ДанныеПредв.Наработка КАК Наработка,
		|	ВЫРАЗИТЬ(ВТ_ДанныеПредв.ОбъектРемонтныхРабот КАК Справочник.торо_ОбъектыРемонта)." + ТекИерархия.РеквизитОР + " КАК ОбъектИерархии
		|ИЗ
		|	ВТ_ДанныеПредв КАК ВТ_ДанныеПредв";
		
	Иначе

		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТ_Данные.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
		|	ВТ_Данные.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
		|	ВТ_Данные.Показатель КАК Показатель,
		|	ВТ_Данные.ДатаНач КАК ДатаНач,
		|	ВТ_Данные.ID КАК ID,
		|	ВТ_Данные.Наработка КАК Наработка
		|ПОМЕСТИТЬ ВТ_ДанныеПредв
		|ИЗ
		|	&ВТ_Данные КАК ВТ_Данные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеПредв.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
		|	ВТ_ДанныеПредв.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
		|	ВТ_ДанныеПредв.Показатель КАК Показатель,
		|	ВТ_ДанныеПредв.ДатаНач КАК ДатаНач,
		|	ВТ_ДанныеПредв.ID КАК ID,
		|	ВТ_ДанныеПредв.Наработка КАК Наработка,
		|	ВТ_ДанныеПредв.ОбъектРемонтныхРабот КАК ОбъектИерархии
		|ИЗ
		|	ВТ_ДанныеПредв КАК ВТ_ДанныеПредв";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВТ_Данные", ТабНаработки);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции
#КонецОбласти

#КонецЕсли