
#Область ОбработчикиСобытийФормы

&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере") 
Процедура гкс_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВыбранныеТипы = Параметры.ВыбранныеТипы;
	
	ОбъектОбработка = РеквизитФормыВЗначение("Объект");
	ТекстЗапроса = ОбъектОбработка.ТекстЗапроса(ВыбранныеТипы);
	
	ИнициализироватьКомпоновщикНастроек();
	КомпоновщикНастроек.ЗагрузитьНастройки(Параметры.Настройки);
	
	Список.ТекстЗапроса = ТекстЗапроса;
	
	ОбновитьСписокВыбранныхНаСервере();
	#Вставка
	// Гкс+[TOIR20-87] Селимов от 14.04.2020. Добавлено:{
	Если СтрНайти(ВыбранныеТипы, "Справочник.торо_ОбъектыРемонта") > 0 Тогда
		ДобавитьРеквизитыФормы();    
		ДобавитьЭлементыФормы();
	КонецЕсли; 	// } Гкс-[TOIR20-87] 
	#КонецВставки 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Гкс+[TOIR20-87] Селимов от 14.04.2020. Добавлено:{
&НаКлиенте
Процедура гкс_ОтборПоИерархииОР_ПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ЭтаФорма.гкс_ОтборПоИерархииОР) Тогда
		ЭтаФорма.гкс_ИспользоватьОтборПоИерархии = Истина;
	Иначе
		ЭтаФорма.гкс_ИспользоватьОтборПоИерархии = Ложь;
	КонецЕсли; 
	
	гкс_ИспользоватьОтборПоИерархии_ПриИзменении(Элементы.гкс_ИспользоватьОтборПоИерархии);
	
КонецПроцедуры // } Гкс-[TOIR20-87]

// Гкс+[TOIR20-87] Селимов от 14.04.2020. Добавлено:{
&НаКлиенте
Процедура гкс_ИспользоватьОтборПоИерархии_ПриИзменении(Элемент)
	
	УдалитьОтборПоСсылке();
	
	Если ЭтаФорма.гкс_ИспользоватьОтборПоИерархии Тогда
		
		ОбъектыРемонтаВСтруктуреИерархии = торо_РаботаСИерархией20.ПолучитьМассивПодчиненныхОбъектов(ЭтаФорма.гкс_ОтборПоИерархииОР, 
																							ЭтаФорма.гкс_ИерархияДляВводаНовыхОР, 
																							ДатаСеанса(), 
																							Ложь);
		
		ЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;		
		ЭлементОтбора.ПравоеЗначение = Новый СписокЗначений;
		ЭлементОтбора.ПравоеЗначение.ЗагрузитьЗначения(ОбъектыРемонтаВСтруктуреИерархии);
	КонецЕсли; 	
	
	ОбновитьСписокВыбранныхНаСервере();
	
КонецПроцедуры // } Гкс-[TOIR20-87] 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Гкс+[TOIR20-87] Селимов от 15.04.2020. Добавлено:{
&НаСервере
Процедура ДобавитьРеквизитыФормы()
	
	НовыеРеквизиты = Новый Массив;

	гкс_ИспользоватьОтборПоИерархии = Новый РеквизитФормы("гкс_ИспользоватьОтборПоИерархии", 
											Новый ОписаниеТипов("Булево"), , " ");
														
	гкс_ОтборПоИерархииОР 			= Новый РеквизитФормы("гкс_ОтборПоИерархииОР", 
											Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта"), ,
											"Отбор по иерархии:");
											
	гкс_ИерархияДляВводаНовыхОР 	= Новый РеквизитФормы("гкс_ИерархияДляВводаНовыхОР", 
											Новый ОписаниеТипов("СправочникСсылка.торо_СтруктурыОР"));												

	НовыеРеквизиты.Добавить(гкс_ИспользоватьОтборПоИерархии);
	НовыеРеквизиты.Добавить(гкс_ОтборПоИерархииОР);
	НовыеРеквизиты.Добавить(гкс_ИерархияДляВводаНовыхОР);
	ИзменитьРеквизиты(НовыеРеквизиты);
			
КонецПроцедуры // } Гкс-[TOIR20-87] 

// Гкс+[TOIR20-87] Селимов от 15.04.2020. Добавлено:{
&НаСервере
Процедура ДобавитьЭлементыФормы()
	
	ГруппаВИерархии = Элементы.Добавить("ГруппаВИерархии", Тип("ГруппаФормы"));
	ГруппаВИерархии.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаВИерархии.Заголовок = "Отбор по иерархии:";
	Элементы.Переместить(Элементы["ГруппаВИерархии"], ЭтаФорма, Элементы.ГруппаВыбранныеОбъекты);
	
	// флаг использовать отбор по иерархии
	ЭлементИспользоватьОтборВИерархии = Элементы.Добавить("гкс_ИспользоватьОтборПоИерархии", 
															Тип("ПолеФормы"), 
															Элементы["ГруппаВИерархии"]);
	ЭлементИспользоватьОтборВИерархии.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементИспользоватьОтборВИерархии.ПутьКДанным = "гкс_ИспользоватьОтборПоИерархии";
	ЭлементИспользоватьОтборВИерархии.Заголовок = " ";
	ЭлементИспользоватьОтборВИерархии.УстановитьДействие("ПриИзменении", "гкс_ИспользоватьОтборПоИерархии_ПриИзменении");
	
	
	// отбор по иерархии
	ЭлементОтборПоИерархии = Элементы.Добавить("гкс_ОтборПоИерархииОР", Тип("ПолеФормы"), Элементы["ГруппаВИерархии"]);
	ЭлементОтборПоИерархии.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементОтборПоИерархии.ПутьКДанным = "гкс_ОтборПоИерархииОР";
	ЭлементОтборПоИерархии.КнопкаОчистки = Истина;
	ЭлементОтборПоИерархии.УстановитьДействие("ПриИзменении", "гкс_ОтборПоИерархииОР_ПриИзменении");
	
	// структура иерархии по умолчанию
	ЭлементИерархияДляВводаНовыхОР = Элементы.Добавить("гкс_ИерархияДляВводаНовыхОР", 
													Тип("ПолеФормы"), 
													Элементы["ГруппаВИерархии"]);
	ЭлементИерархияДляВводаНовыхОР.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементИерархияДляВводаНовыхОР.ПутьКДанным = "гкс_ИерархияДляВводаНовыхОР";
	ЭлементИерархияДляВводаНовыхОР.Заголовок = "Иерархия";
	
	ЭтаФорма.гкс_ИерархияДляВводаНовыхОР = Константы.торо_ИерархияДляВводаНовыхОР.Получить();

	Элементы.ГруппаВИерархии.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная; 
	
КонецПроцедуры // } Гкс-[TOIR20-87] 

// Гкс+[TOIR20-87] Селимов от 14.04.2020. Добавлено:{
&НаСервереБезКонтекста
Функция ДатаСеанса()
	
	Возврат ТекущаяДатаСеанса();
	
КонецФункции // } Гкс-[TOIR20-87] 

// Гкс+[TOIR20-87] Селимов от 14.04.2020. Добавлено:{
&НаСервере
Процедура УдалитьОтборПоСсылке()
	
	ОтборКомпоновкиДанныхСсылка = Новый ПолеКомпоновкиДанных("Ссылка");
	Для каждого ЭлементОтбора Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ЭлементОтбора.ЛевоеЗначение = ОтборКомпоновкиДанныхСсылка Тогда
			КомпоновщикНастроек.Настройки.Отбор.Элементы.Удалить(ЭлементОтбора);
			Прервать;
		КонецЕсли; 			
	КонецЦикла; 
	
КонецПроцедуры // } Гкс-[TOIR20-87]  

#КонецОбласти

