#Область СлужебныеПроцедурыИФункции

&ИзменениеИКонтроль("ПриНачалеРедактирования")
Процедура гкс_ПриНачалеРедактирования(ТаблицаФормы, СтруктураДанныхДоРедактирования, ДанныеСтроки)

	#Вставка
	// гкс+ [Релиз 1] Куст
	Если СтруктураДанныхДоРедактирования = Неопределено Тогда 
		СтруктураДанныхДоРедактирования = Новый Структура();
	КонецЕсли;
	#КонецВставки
	СтруктураКолонок = Новый Структура;
	ДлинаИмениТаблицы = СтрДлина(ТаблицаФормы.Имя)+1;
	ЗаполнитьСтруктуруДанныхСтроки(ТаблицаФормы.ПодчиненныеЭлементы,СтруктураКолонок,ДанныеСтроки,ДлинаИмениТаблицы);
	СтруктураДанныхДоРедактирования.Вставить(ТаблицаФормы.Имя,СтруктураКолонок);

КонецПроцедуры

#КонецОбласти