#Область ОбработчикиСобытийФормы

&НаСервере
Процедура гкс_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// Гкс+[TOIR20-580] Зозуля А.В. от 12.05.2025. Добавлено:{
    ДобавитьНовыеЭлементыПосле();
	// } Гкс-[TOIR20-580] Зозуля А.В. от 12.05.2025.
КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Гкс+[TOIR20-580] Зозуля А.В. от 12.05.2025. Добавлено:{
&НаСервере
Процедура ДобавитьНовыеЭлементыПосле()

	НовыйЭлемент = Элементы.Добавить("гкс_Организация", Тип("ПолеФормы"), ЭтотОбъект);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гкс_Организация";	
	
КонецПроцедуры	// } Гкс-[TOIR20-580] Зозуля А.В. от 12.05.2025. 

#КонецОбласти
