#Область СлужебныеПроцедурыИФункции

&ИзменениеИКонтроль("ДобавитьПрофильТОиР")
Процедура Расш_гкс_ДобавитьПрофильТОиР(ОписанияПрофилей)

	// Описание для заполнения профиля "Главный диспетчер производства".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя = "БазовыеПраваТОиР";
	ОписаниеПрофиля.Наименование  = НСтр("es='Los derechos ТОиР básicos';ru='Базовые права ТОиР';en='Basic maintenance and repair rights'");
	ОписаниеПрофиля.Идентификатор = "ab8ca17c-8df7-4c6f-a6ba-6dfb85a2d469";
	ОписаниеПрофиля.Описание =
	НСтр("es='Es destinado para: "
	"- la presentación de los datos del sistema informativo.';ru='Предназначен для:"
	"- просмотра данных информационной системы.';en='Created for:"
	"- viewing information system information. '");

	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);	
	//	
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаВидаЭксплуатацииДляВводаНаОснованииВыявленногоДефекта");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетБазаДанныхПоПодрядчикамСИсторией");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетСписокОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ПросмотрФормыСпискаДокументовПоРемонту");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеАктовОВыполненииРегламентныхМероприятий");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеАктовОВыполненииЭтаповРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеАктовПриемкиОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВводаНачальныхДанных");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовОценок");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовПусковОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВыявленныхДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеГрафиковРегламентныхМероприятийТОиР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОстановочныхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗначенийИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмененийПоложенияВСтруктуреИерархии");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмененийСоставаРемонтнойБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКвалификацийРемонтногоПерсонала");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКомиссионныхРассмотрений");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКритериевВыбораПодрядчиков");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКритериевОценки");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКритичностейДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеМерБезопасности");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеНаправленийОбъектовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеНарядовНаВыполнениеРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеНарядовНаРегламентноеМероприятие");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеНастройкиРегистрацииНаработкиЗависимыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОценокРаботыПодрядчика");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПлановГрафиковРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПриоритетовОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПрисвоенийКвалификацийСотрудникам");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинЗакрытияРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинИзмененияНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинПростояОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеРемонтныхБригад");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеРесурсовРемонтнойБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСезонов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСобытийУведомленийВДокументах");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСостоянийОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСпискаОбъектовРегламентногоМероприятия");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСпособовПланированияРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСпособовСогласованияДокументов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСтатусовСогласованияДокументовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСтруктурОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТиповКоэффициентовПереводаСтоимостейРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТиповыхДефектовОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТиповыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУсловийВыявленияДефекта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокЛимитовНаПлановыеРемонтныеРаботы");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокПроизвольныхЗначенийНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокСтоимостейКвалификаций");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУчетовКонтролируемыхПоказателей");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУчетовНаработкиОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЦепочекРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеШаблоновСообщенийИУведомлений");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКвалификацийРемонтногоПерсоналаПоСотрудникам");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТекущихТарифныхСтавокСотрудников");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОпасныхПроизводств");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеРемонтныхЦикловОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПричиныОтменыПлановыхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетСводнаяДиаграммаГрафиковППР");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЕдиницИзмерения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПараметровВыработкиОС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтруктурыПредприятия");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхРеквизитовИСведений");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеОбменаСМобильнымПриложением");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеХарактеристикНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовСкользящихПланов");
	#Вставка
	ОписаниеПрофиля.Роли.Добавить("торо_ОграниченияНаХарактеристикиОбрудованияЧтение");
	ОписаниеПрофиля.Роли.Добавить("гкс_ЧтениеНовыхОбъектов");
	// гкс+ [Срочность воздействия] Куст 
	ОписаниеПрофиля.Роли.Добавить("гкс_РедактированиеСрочностиВоздействия");
	#КонецВставки

	//НазначениеНаРемонтСУчетомРисков
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОбъектовВоздействия");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКатегорийВероятности");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКатегорийТяжестиПоследствий");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеРегистраСведенийПоследствия");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКатегорийРиска");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСтратегийОбслуживания");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеМатрицыОценкиРисков");

	ОписаниеПрофиля.Роли.Добавить("ПросмотрСвязанныеДокументы");

	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");		                                     

	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

КонецПроцедуры

&ИзменениеИКонтроль("ДобавитьПрофильДиспетчера")
Процедура Расш_гкс_ДобавитьПрофильДиспетчера(ОписанияПрофилей)
	//	
	// Описание для заполнения профиля "Главный диспетчер производства".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();

	ОписаниеПрофиля.Имя = "Диспетчер";
	ОписаниеПрофиля.Наименование  = НСтр("es='El dispatcher';ru='Диспетчер';en='Dispatcher'");
	ОписаниеПрофиля.Идентификатор = "43f2f015-280b-4546-8731-3b399b49049a";
	ОписаниеПрофиля.Описание =
	НСтр("es='Es destinado para: "
	"- el registro de los defectos de los objetos de la reparación, "
	"- el recuento de los estados de los objetos de la reparación, "
	"- la formalización de las demandas por la reparación.';ru='Предназначен для:"
	"- регистрации дефектов объектов ремонта,"
	"- учета состояний объектов ремонта,"
	"- оформления заявок на ремонт.';en='Created for:"
	"- registration of defects of repair objects,"
	"- accounting of the state of repair objects,"
	"- filing repair requests.'");	


	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);

	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("торо_ВыгрузкаИЗагрузкаИзMSProject");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеВыявленныхДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинЗакрытияРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияТиповыхДефектовОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияЗакрытийЗаявокИРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияСостоянияОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеВыявленныхДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеВыбораРемонтаИзПланГрафика");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеЗакрытияЗаявокИРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораОбъектовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораРемонтныхРаботОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеТехническойДокументации");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользоватьРабочееМестоТехническогоСпециалиста");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользоватьРабочееМестоУчетаПоказателейЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетВнешниеОснования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетВыявленныеДефекты");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПлановыеОстановыОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияВыявленныхДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеВыявленныхДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовПусковОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВыявленныхДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗакрытийЗаявокИРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗначенийКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКвалификацийРемонтногоПерсонала");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКритичностейДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеМерБезопасности");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПлановГрафиковРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПриоритетовОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинЗакрытияРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинПростояОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСостоянийОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСпособовПланированияРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСпособовСогласованияДокументов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСтатусовСогласованияДокументовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТиповыхДефектовОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУсловийВыявленияДефекта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокСтоимостейКвалификаций");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКвалификацийРемонтногоПерсоналаПоСотрудникам");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТекущихТарифныхСтавокСотрудников");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОпасныхПроизводств");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетФактическиеЗатратыПоОбъектамРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПрямыеЗатратыНаВыполнениеРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетИсторияОстановаИЗапускаОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетОтказыОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПлановыеВнеплановыеРемонты");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПростойОборудования"); 	
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользоватьРабочееМестоДиспетчера");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУпаковокНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеХарактеристикНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтруктурыПредприятия");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнутреннихПотребленийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЕдиницИзмерения");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОприходованийИзлишковТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПланаРаботПодразделения");
	#Вставка
	ОписаниеПрофиля.Роли.Добавить("гкс_КомпонентыИзменение");
	ОписаниеПрофиля.Роли.Добавить("гкс_СимптомыДефектовИзменение");
	ОписаниеПрофиля.Роли.Добавить("гкс_СозданиеРедактированиеЕВОБланка");
	#КонецВставки

	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКомиссий");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеРабочегоМестаАдресацияЗаявок");

	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");

	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	//	
КонецПроцедуры

&ИзменениеИКонтроль("ДобавитьПрофильИнженера")
Процедура Расш_гкс_ДобавитьПрофильИнженера(ОписанияПрофилей)
	//	
	//	// Описание для заполнения профиля "Главный диспетчер производства".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();

	ОписаниеПрофиля.Имя = "Инженер";
	ОписаниеПрофиля.Наименование  = НСтр("es='El ingeniero';ru='Инженер';en='Engineer'");
	ОписаниеПрофиля.Идентификатор = "36bc60d8-a5aa-4d98-b4d7-15eab6d88494";
	ОписаниеПрофиля.Описание =
	НСтр("es='Es destinado para: "
	"- el recuento de los objetos de la reparación; "
	"- la planificación ППР, las medidas de reglamento; "
	"- el recuento de los trabajos cumplidos.';ru='Предназначен для:"
	"- учета объектов ремонта;"
	"- планирования ППР, регламентных мероприятий;"
	"- учета выполненных работ.';en='Created for:"
	"- accounting of repair objects;"
	"- planning of preventive maintenance, regulatory activities;"
	"- accounting of work performed.'");




	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);

	//	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("торо_ВыгрузкаИЗагрузкаИзMSProject");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеАктовОВыполненииРегламентныхМероприятий");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеАктовОВыполненииЭтаповРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеАктовПриемкиОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеГрафиковРегламентныхМероприятийТОиР");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеОстановочныхРемонтов");

	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовОценок");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовПусковОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеЗначенийИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеЗначенийКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияКвалификацийРемонтногоПерсонала");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияКритериевВыбораПодрядчиков");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияКритериевОценки");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияКритичностейДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияМерБезопасности");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияНаправленийОбъектовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПриоритетовОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинЗакрытияРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинИзмененияНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинПростояОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияРемонтныхБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияРесурсовРемонтнойБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияСезонов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияСпособовПланированияРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияСтруктурОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеТиповКоэффициентовПереводаСтоимостейРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияТиповыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияУсловияВыявленияДефекта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияЦепочкиРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияШаблоновСообщенийИУведомлений");


	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияВводНачальныхДанных");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияЗакрытийЗаявокИРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеИзмененийПоложенияВСтруктуреИерархии");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеИзмененийСоставаРемонтнойБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияКомиссионныхРассмотрений");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеНастройкиРегистрацииНаработкиЗависимыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияОценокРаботыПодрядчика");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПрисвоенийКвалификацийСотрудникам");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеУстановокКоэффициентовПереводаСтоимостей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеУстановокЛимитовНаПлановыеРемонтныеРаботы");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеУстановокПроизвольныхЗначенийНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияУстановокСтоимостейКвалификаций");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияУчетовНаработкиОборудования");


	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеСпискаОбъектовРегламентногоМероприятия");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеНарядовНаВыполнениеРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеНарядовНаРегламентноеМероприятие");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеПлановГрафиковРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеАктовОВыполненииРегламентныхМероприятий");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеАктовОВыполненииЭтаповРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеАктовПриемкиОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеГрафиковРегламентныхМероприятийТОиР");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеНарядовНаВыполнениеРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеНарядовНаРегламентноеМероприятие");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзмененияОстановочныхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеСпискаОбъектовРегламентногоМероприятия");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзмененияПлановГрафиковРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеВыбораРемонтаИзПланГрафика");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеЗакрытияЗаявокИРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеКорректировокППРПоРМ");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораОбъектовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораРемонтныхРаботОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеТехническойДокументации");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеУстановкиОценкиРМПлановыхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользоватьРабочееМестоУчетаПоказателейЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользоватьРабочееМестоТехническогоСпециалиста");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаВалютыРегламентированногоУчета");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаВидаРемонтаПриВводеНаОснованииВыявленныхДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаИерархииДляВводаНовыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаИспользованияЛотов");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаИспользованияНарядовДопусковНаРаботыПовышеннойОпасностиОбязательно");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаИспользованияОпасногоПроизводства");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаИспользованияПриоритетностиПеренесенныхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетБазаДанныхПоПодрядчикамСИсторией");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетВнешниеОснования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетВыявленныеДефекты");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетНаработкаОРПоДатам");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПлановыеОстановыОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПоКонтролируемымПоказателям");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияАктовОВыполненииРегламентныхМероприятий");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияАктовОВыполненииЭтаповРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияАктовПриемкиОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияВыявленныхДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияГрафиковРегламентныхМероприятийТОиР");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияНарядовНаВыполнениеРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияНарядовНаРегламентноеМероприятие");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияОстановочныхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияПлановГрафиковРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияСписокОбъектовРегламентногоМероприятия");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеАктовОВыполненииРегламентныхМероприятий");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеАктовОВыполненииЭтаповРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеАктовПриемкиОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеВыявленныхДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеГрафиковРегламентныхМероприятийТОиР");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеНарядовНаВыполнениеРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеНарядовНаРегламентноеМероприятие");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеПлановГрафиковРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеОстановочныхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ПросмотрФормыСпискаДокументовПоРемонту");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеАктовОВыполненииРегламентныхМероприятий");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеАктовОВыполненииЭтаповРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеАктовПриемкиОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВводаНачальныхДанных");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовОценок");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовПусковОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗакрытийЗаявокИРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗначенийИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗначенийКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмененийПоложенияВСтруктуреИерархии");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмененийСоставаРемонтнойБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКвалификацийРемонтногоПерсонала");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКомиссионныхРассмотрений");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКритериевВыбораПодрядчиков"); 
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКритериевОценки");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКритичностейДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеМерБезопасности");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеНарядовНаВыполнениеРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеНарядовНаРегламентноеМероприятие");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеНастройкиРегистрацииНаработкиЗависимыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОценокРаботыПодрядчика");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПлановГрафиковРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОстановочныхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПриоритетовОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПрисвоенийКвалификацийСотрудникам");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинЗакрытияРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинИзмененияНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинПростояОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеРемонтныхБригад");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеРесурсовРемонтнойБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСезонов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСобытийУведомленийВДокументах");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСпискаОбъектовРегламентногоМероприятия");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСпособовПланированияРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСпособовСогласованияДокументов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСтатусовСогласованияДокументовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСтруктурОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТиповКоэффициентовПереводаСтоимостейРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТиповыхДефектовОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТиповыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУсловийВыявленияДефекта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокКоэффициентовПереводаСтоимостейРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокЛимитовНаПлановыеРемонтныеРаботы");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокПроизвольныхЗначенийНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокСтоимостейКвалификаций");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУчетовКонтролируемыхПоказателей");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУчетовНаработкиОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЦепочекРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеШаблоновСообщенийИУведомлений");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеППРДляРасчетаВФоновомРежиме");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеППРДляРасчетаВФоновомРежиме");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКвалификацийРемонтногоПерсоналаПоСотрудникам");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеКвалификацийРемонтногоПерсоналаПоСотрудникам");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТекущихТарифныхСтавокСотрудников");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеТекущихТарифныхСтавокСотрудников");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеПараметровОповещенияОСостоянииОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОпасныхПроизводств");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеОпасныхПроизводств");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеРемонтныхЦикловОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеРемонтныхЦикловОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетФактическиеЗатратыПоОбъектамРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПрямыеЗатратыНаВыполнениеРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПричиныОтменыПлановыхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПричиныОтменыПлановыхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетСводнаяДиаграммаГрафиковППР");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланФактВыполненияРаботПодрядчиками");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланФактныйАнализППР");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланМТОИнструментовТрудозатрат");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетНаработкаОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПлановыеВнеплановыеРемонты");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланФактЗатрат");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланФактТрудозатрат");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПростойОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетЗатратыНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетАнализИспользованияПерсонала");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеКалькулятораРЦ");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаКоличестваДнейСмещенияВДефектеДляПростоев");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокМинимальныхОстатковНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеУстановкаАналоговНоменклатурыДляРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановкаАналоговНоменклатурыДляРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПринятиеКУчетуВыбытиеОборудования");	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУпаковокНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтруктурыПредприятия");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнутреннихПотребленийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроведениеПометкаУдаленияВнутреннихПотребленийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроведениеПометкаУдаленияЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЕдиницИзмерения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПараметровВыработкиОС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСкладов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСерийНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовЦен");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОприходованийИзлишковТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроведениеПометкаУдаленияОприходованийИзлишковТоваров");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПланаРаботПодразделения");
	#Вставка
	ОписаниеПрофиля.Роли.Добавить("гкс_ИспользованиеАРМУчетаТОР");
	ОписаниеПрофиля.Роли.Добавить("гкс_ИспользованиеАРМУчетаСвязейФМ");
	ОписаниеПрофиля.Роли.Добавить("гкс_СозданиеРедактированиеЕВОБланка");
	ОписаниеПрофиля.Роли.Добавить("гкс_РедактированиеТехническихМестВОР");
	#КонецВставки

	// Согласования и  уведомления
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовДокументовУведомлений");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияСобытийУведомленийВДокументах");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияСпособовСогласованияДокументов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеСтатусовСогласованияДокументовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовДокументовУведомлений");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПоМинимальнымОстаткам");

	//Обработки
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеСозданияДополнительныхИерархий");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеРабочегоМестаАдресацияЗаявок");


	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");

	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

КонецПроцедуры

#КонецОбласти