Функция гкс_ПолучитьСписокКонтрагентов(ОбъектыПечати) Экспорт
	СписокРезультат = Новый СписокЗначений();
	Если ТипЗнч(ОбъектыПечати[0]) = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") Тогда 
		ИмяДокумента = "торо_ЗаявкаНаРемонт.ИсполнителиПоРемонтам";
	ИначеЕсли ТипЗнч(ОбъектыПечати[0]) = Тип("ДокументСсылка.торо_АктОВыполненииЭтапаРабот") Тогда 
		ИмяДокумента = "торо_АктОВыполненииЭтапаРабот.ИсполнителиПоРемонтам";
	Иначе
		Возврат СписокРезультат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаИсполнителей.Исполнитель КАК Исполнитель,
		|	ТаблицаИсполнителей.Исполнитель.Наименование КАК Имя
		|ИЗ
		|	Документ." + ИмяДокумента + " КАК ТаблицаИсполнителей
		|ГДЕ
		|	ТаблицаИсполнителей.Ссылка В(&Ссылка)";
	Запрос.УстановитьПараметр("Ссылка", ОбъектыПечати);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	ТипКонтрагент = Тип("СправочникСсылка.Контрагенты");
	Пока Выборка.Следующий() Цикл
		Если ТипЗнч(Выборка.Исполнитель) = ТипКонтрагент Тогда 
			СписокРезультат.Добавить(Выборка.Исполнитель, Выборка.Имя);
		КонецЕсли;
	КонецЦикла;
	Возврат СписокРезультат;
КонецФункции

Функция гкс_ВернутьНайденныеДокументыSOPиOPL(ОбъектыПечати) Экспорт
	
	// Гкс+[TOIR20-537] Вялых Д.А. от 05.03.2025. Добавлено:{
	ЗапросПрисоединенныеФайлы = Новый Запрос;
	ЗапросПрисоединенныеФайлы.Текст = "ВЫБРАТЬ
	|	ТехКартыПрисоединенныеФайлы.Ссылка КАК ПрисоединенныйФайл
	|ИЗ
	|	Документ.торо_ЗаявкаНаРемонт.РемонтныеРаботы КАК торо_ЗаявкаНаРемонтРемонтныеРаботы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВерсииТехКарт КАК ВерсииТехКарт
	|		ПО ((ВЫРАЗИТЬ(торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтнаяРабота КАК Справочник.торо_ИдентификаторыТехКарт)) = ВерсииТехКарт.ИдентификаторТехКарты)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТехКартыПрисоединенныеФайлы КАК ТехКартыПрисоединенныеФайлы
	|		ПО (ВерсииТехКарт.ТехКарта = ТехКартыПрисоединенныеФайлы.ВладелецФайла)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТехКартыПрисоединенныеФайлы КАК ТехКартыПрисоединенныеФайлыРодитель
	|		ПО (ТехКартыПрисоединенныеФайлы.Родитель = ТехКартыПрисоединенныеФайлыРодитель.Ссылка)
	|ГДЕ
	|	торо_ЗаявкаНаРемонтРемонтныеРаботы.Ссылка В(&Ссылка)
	|	И ТехКартыПрисоединенныеФайлыРодитель.Наименование = ""SOP&OPL"""; 
	ЗапросПрисоединенныеФайлы.УстановитьПараметр("Ссылка", ОбъектыПечати);
	
	РезультатЗапроса = ЗапросПрисоединенныеФайлы.Выполнить().Выгрузить();
	
	МассивФайлов = Новый Массив;
	Для Каждого СтрокаРезультата ИЗ РезультатЗапроса Цикл
		МассивФайлов.Добавить(РаботаСФайлами.ДанныеФайла(СтрокаРезультата.ПрисоединенныйФайл));		
	КонецЦикла;
	
	Возврат МассивФайлов;
	// } Гкс-[TOIR20-537] Вялых Д.А. от 05.03.2025.
	
КонецФункции