
Процедура ПередЗаписью(Отказ, Замещение)
	
	// Гкс+[TOIR20-557] Вялых Д.А. от 14.03.2025. Добавлено:{
	Если Отказ Тогда
		Возврат;	
	КонецЕсли;
	
	Событие = Константы.гкс_СобытиеПросрочкиМероприятияЕвобланк.Получить();
	Если Не ЗначениеЗаполнено(Событие) Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Уведомление не настроено";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	МассивСтрок = Новый Массив();
	ТекДата = ТекущаяДата();  
	
	Если ЭтотОбъект.Отбор.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	НайденныйДокумент = ЭтотОбъект.Отбор[0].Значение;
	
	МассивПользователей = Новый Массив;
	
	ЗапросИмеющихсяЗаписей = Новый Запрос;
	ЗапросИмеющихсяЗаписей.Текст = "ВЫБРАТЬ
	|	гкс_ОжидаемыеМероприятияЕвобланк.Ответственный КАК Ответственный,
	|	гкс_ОжидаемыеМероприятияЕвобланк.Мероприятие КАК Мероприятие
	|ИЗ
	|	РегистрСведений.гкс_ОжидаемыеМероприятияЕвобланк КАК гкс_ОжидаемыеМероприятияЕвобланк
	|ГДЕ
	|	гкс_ОжидаемыеМероприятияЕвобланк.Регистратор = &Регистратор"; 
	ЗапросИмеющихсяЗаписей.УстановитьПараметр("Регистратор", НайденныйДокумент);
	
	РезультатЗапроса = ЗапросИмеющихсяЗаписей.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТЧ Из НайденныйДокумент.МероприятияПоПредупреждению Цикл
		Если Не СтрокаТЧ.Выполнено 
			И МассивПользователей.Найти(СтрокаТЧ.Ответственный) = Неопределено
			И РезультатЗапроса.НайтиСтроки(Новый Структура("Ответственный, Мероприятие", 
															СтрокаТЧ.Ответственный, СтрокаТЧ.Мероприятие)).Количество() = 0 Тогда 
															
			МассивСтрок.Добавить(Новый Структура("Ответственный, Мероприятие", СтрокаТЧ.Ответственный, СтрокаТЧ.Мероприятие));
			МассивПользователей.Добавить(СтрокаТЧ.Ответственный);
			
		КонецЕсли;
	КонецЦикла;
	
	Если МассивСтрок.Количество() Тогда 
		
		ОбМодуль = торо_РаботаСУведомлениями;
		ДокОб = НайденныйДокумент.ПолучитьОбъект();
		
		СтруктураДанных = Новый Структура();
		торо_РаботаСУведомлениями.ЗаполнитьСтруктуруДанныхДокумента(СтруктураДанных, ДокОб);
		СтруктураДанных.Вставить("ВидДокумента", "гкс_ЕВОБланк");
		
		Для Каждого СМ Из МассивСтрок Цикл
			СтруктураДанных.Вставить("Ответственный", СМ.Ответственный);
			СтруктураДанных.Вставить("Мероприятие", СМ.Мероприятие);
			ОбМодуль.ЗаписатьУведомленияФМ(СтруктураДанных, Событие);
		КонецЦикла;
		
	КонецЕсли; 
	// } Гкс-[TOIR20-557] Вялых Д.А. от 14.03.2025.
	
КонецПроцедуры
