///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2018, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	ТипСтрока            = Тип("Строка");
	ТипКатегорияНовостей = Тип("ПланВидовХарактеристикСсылка.КатегорииНовостей");

	// Список может быть либо типа ПланВидовХарактеристик,
	//  либо строка с определенными значениями ("Список категорий новостей", "Список лент новостей").

	Для каждого ТекущаяЗапись Из ЭтотОбъект Цикл
		Если ТипЗнч(ТекущаяЗапись.Список) = ТипКатегорияНовостей Тогда
			Если ТекущаяЗапись.Список.Пустая() Тогда
				Отказ = Истина;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.УстановитьДанные(ТекущаяЗапись);
				Сообщение.Поле = "Список";
				Сообщение.ПутьКДанным = "Запись";
				Сообщение.Текст = НСтр("es='El significado de la categoría renovada debe ser rellenado.';ru='Значение обновляемой категории должно быть заполнено.';en='The value of the updated category must be filled.'");
				Сообщение.Сообщить();
			КонецЕсли;
		ИначеЕсли ТипЗнч(ТекущаяЗапись.Список) = ТипСтрока Тогда
			Если ТекущаяЗапись.Список = "Список категорий новостей" Тогда
				// Разрешенное значение
			ИначеЕсли ТекущаяЗапись.Список = "Список лент новостей" Тогда
				// Разрешенное значение
			ИначеЕсли СтрНайти(ВРег(ТекущаяЗапись.Список), ВРег("Значения категории новостей:")) = 1 Тогда
				// Разрешенное значение
			Иначе
				// Неразрешенное значение
				Отказ = Истина;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.УстановитьДанные(ТекущаяЗапись);
				Сообщение.Поле = "Список";
				Сообщение.ПутьКДанным = "Запись";
				Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("es='El significado incorrecto %1. "
"Está permitido solamente: "
"- la lista de las categorías de las novedades "
"- la Lista de las cintas de las novedades "
"- el Código de la categoría de las novedades (comienza con [los Significados de la categoría de las novedades:])';ru='Неправильное значение %1."
"Разрешено только:"
"- Список категорий новостей"
"- Список лент новостей"
"- Код категории новостей (начинается с [Значения категории новостей:])';en='Invalid value%1."
"Allowed only:"
"- List of news categories"
"- List of news feeds"
"- News category code (starts with [Значения категории новостей:]) '"),
					ТекущаяЗапись.Список);
				Сообщение.Сообщить();
			КонецЕсли;
		Иначе
			// Неразрешенное значение
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.УстановитьДанные(ТекущаяЗапись);
			Сообщение.Поле = "Список";
			Сообщение.ПутьКДанным = "Запись";
			Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("es='El significado incorrecto %1. "
"Está permitido solamente: "
"- la lista de las categorías de las novedades "
"- la Lista de las cintas de las novedades "
"- el Código de la categoría de las novedades (comienza con [los Significados de la categoría de las novedades:]) "
"- la Referencia al plan de los tipos de las características de KategoriiNovostey';ru='Неправильное значение %1."
"Разрешено только:"
"- Список категорий новостей"
"- Список лент новостей"
"- Код категории новостей (начинается с [Значения категории новостей:])"
"- Ссылка на план видов характеристик КатегорииНовостей';en='Invalid value%1."
"Allowed only:"
"- List of news categories"
"- List of news feeds"
"- News category code (starts with [Значения категории новостей:])                                     - Link to a plan of types of characteristics КатегорииНовостей'"),
				ТекущаяЗапись.Список);
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли