
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ТекстЗапросаПометкиОбрабатываемых.Доступность = Объект.ИспользоватьПометкуДанных;
	Элементы.ТекстЗапросаУдаленяОбработанных.Доступность = Объект.ИспользоватьУдалениеДанных;
	Элементы.РазмерПорцииТекст.Доступность = Объект.ИспользованиеРазбиениеДанныхНаПорции;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПериодПолученияДанныхТекст = торо_ОбщегоНазначения.ПродолжительностьВЧасах(Объект.ПериодПолученияДанных);
	РазмерПорцииТекст = торо_ОбщегоНазначения.ПродолжительностьВЧасах(Объект.РазмерПорции);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьПометкуДанныхПриИзменении(Элемент)
	Элементы.ТекстЗапросаПометкиОбрабатываемых.Доступность = Объект.ИспользоватьПометкуДанных;
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьУдалениеДанныхПриИзменении(Элемент)
	Элементы.ТекстЗапросаУдаленяОбработанных.Доступность = Объект.ИспользоватьУдалениеДанных;
КонецПроцедуры

&НаКлиенте
Процедура ИспользованиеРазбиениеДанныхНаПорцииПриИзменении(Элемент)
	Элементы.РазмерПорцииТекст.Доступность = Объект.ИспользованиеРазбиениеДанныхНаПорции;
КонецПроцедуры

&НаКлиенте
Процедура РазмерПорцииТекстНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	торо_ЗаполнениеДокументовКлиент.ОткрытьФормуПодбораПродолжительности(Объект.РазмерПорции, Элемент, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура РазмерПорцииТекстОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	РазмерПорцииТекст = торо_ОбщегоНазначения.ПродолжительностьВЧасах(ВыбранноеЗначение);
	Объект.РазмерПорции = ВыбранноеЗначение;
КонецПроцедуры

&НаКлиенте
Процедура ПериодПолученияДанныхТекстНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	торо_ЗаполнениеДокументовКлиент.ОткрытьФормуПодбораПродолжительности(Объект.ПериодПолученияДанных, Элемент, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПериодПолученияДанныхТекстОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПериодПолученияДанныхТекст = торо_ОбщегоНазначения.ПродолжительностьВЧасах(ВыбранноеЗначение);
	Объект.ПериодПолученияДанных = ВыбранноеЗначение;
КонецПроцедуры
#КонецОбласти



