
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастройкиВосстановлены = ВосстановитьНастройки();
	
	Если НЕ НастройкиВосстановлены Тогда
		Объект.Организация = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР",	"ОсновнаяОрганизация");
		Объект.Завершенные              = Ложь;
		Объект.ДатаАктуальности         = ТекущаяДата();
		Объект.ПлановыйПериод           = 10;
		Объект.Периодичность            = Перечисления.Периодичность.День;
		Объект.ПериодОбновления         = 180;
		Объект.АвтоматическоеОбновление = Истина;
		
		ЗаполнитьТаблицуКритичности();
		ЗаполнитьТаблицуПриоритетностиОР();
	КонецЕсли;
	
	Если Объект.ВидДаты = 0 Тогда
		Объект.ДатаАктуальности = ТекущаяДата();
	КонецЕсли;
	
	ФОИспользоватьППР							= ПолучитьФункциональнуюОпцию("торо_ИспользоватьППР");
	ФОИспользоватьРегламентныеМероприятия = ПолучитьФункциональнуюОпцию("торо_ИспользоватьРегламентныеМероприятия");
	ФОИспользоватьНарядыНаРегламентныеМероприятия = ПолучитьФункциональнуюОпцию("торо_ИспользоватьНарядыНаРегламентноеМероприятие");
	ФОИспользоватьВнешниеОснования		= ПолучитьФункциональнуюОпцию("торо_ИспользоватьВнешниеОснованияДляРабот");
	ФОИспользоватьДефекты					= ПолучитьФункциональнуюОпцию("торо_УчетВыявленныхДефектовОборудования");
	ФОИспользоватьСметы						= ПолучитьФункциональнуюОпцию("торо_ИспользоватьСметыРемонта");
	ФОИспользоватьНаряды						= ПолучитьФункциональнуюОпцию("торо_ИспользоватьНарядыНаВыполнениеРабот");
	ФОИспользоватьСтатусыДокументов 	  	= ПолучитьФункциональнуюОпцию("торо_ИспользоватьСтатусыДокументовТОиР");
	
	Если Не ФОИспользоватьППР
		И Не ФОИспользоватьДефекты
		И Не ФОИспользоватьВнешниеОснования Тогда
		ИспользоватьУправлениеРемонтами = Ложь;
	Иначе
		ИспользоватьУправлениеРемонтами = Истина;
	КонецЕсли; 
	
	УстановитьЗапросИПараметрыДинСпискаАктов();
	УстановитьЗапросИПараметрыДинСпискаРегламентныхНарядов();
	
	УстановитьУсловноеОформление();
			
	ЗаполнитьТаблицуВводаНаОсновании();
	УстановитьПараметрыВыбораДоговора();
	УстановитьПараметрыВыбораБригады();
	
	торо_СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка, Новый Структура("УстановитьСвойствоЭлементовФормыОтПрав", Истина));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьПараметрыДинамическогоСписка();
	
	Если НЕ ЗначениеЗаполнено(сзСтатусОР) Тогда
		сзСтатусОР.Добавить("Зарегистрирован (выявленный дефект)", "Зарегистрирован (выявленный дефект)");
		сзСтатусОР.Добавить("Запланировано устранение (выявленный дефект)", "Запланировано устранение (выявленный дефект)");
		сзСтатусОР.Добавить("Устраняется (выявленный дефект)", "Устраняется (выявленный дефект)");
		сзСтатусОР.Добавить("Устранен (выявленный дефект)", "Устранен (выявленный дефект)");
		
		сзСтатусОР.Добавить("Зарегистрирован (внешнее основание)", "Зарегистрирован (внешнее основание)");
		сзСтатусОР.Добавить("Запланировано устранение (внешнее основание)", "Запланировано устранение (внешнее основание)");
		сзСтатусОР.Добавить("Устраняется (внешнее основание)", "Устраняется (внешнее основание)");
		сзСтатусОР.Добавить("Устранен (внешнее основание)", "Устранен (внешнее основание)");
		
		сзСтатусОР.Добавить("Введен ППР (план-график ППР)", "Введен ППР (план-график ППР)");
		сзСтатусОР.Добавить("Запланировано выполнение (план-график ППР)", "Запланировано выполнение (план-график ППР)");
		сзСтатусОР.Добавить("Выполняется (план-график ППР)", "Выполняется (план-график ППР)");
		сзСтатусОР.Добавить("Выполнен (план-график ППР)", "Выполнен (план-график ППР)");
	КонецЕсли;
	
	ЗаполнитьСписокВыбораОтбораПоСтатусуДокумента();

	флОстановочныеПриИзменении(Элементы.флОстановочные);
	ИспользоватьОтборПоСтатусуПриИзменении(Элементы.ИспользоватьОтборПоСтатусу);
	ИспользоватьОтборПоСтатусуДокументаПриИзменении(Элементы.ИспользоватьОтборПоСтатусуДокумента);
	
	Элементы.ФормаОткрытьЗакрытиеЗаявокИРемонтов.Доступность = Ложь;

	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если Не ЗавершениеРаботы Тогда
		СохранитьНастройки();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "СозданДокументЧерезРМТехСпец" Тогда
		
		СохранениеТекущихСтрок();
		
		Если Источник = Тип("ДокументСсылка.торо_АктОВыполненииЭтапаРабот") Тогда
			УстановитьПараметрыДинамическогоСпискаКлиент(Истина, Истина, Истина, Ложь, Ложь);
		ИначеЕсли Источник = Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот") Тогда
			УстановитьПараметрыДинамическогоСпискаКлиент(Ложь, Истина, Ложь, Ложь, Ложь);
		ИначеЕсли Источник = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") Тогда
			УстановитьПараметрыДинамическогоСпискаКлиент(Истина, Ложь, Ложь, Ложь, Ложь);
		ИначеЕсли Источник = Тип("ДокументСсылка.торо_НарядНаРегламентноеМероприятие") Тогда
			УстановитьПараметрыДинамическогоСпискаКлиент(Ложь,,Ложь, Истина, Ложь);
		ИначеЕсли Источник = Тип("ДокументСсылка.торо_АктОВыполненииРегламентногоМероприятия") Тогда
			УстановитьПараметрыДинамическогоСпискаКлиент(Ложь,,Ложь, Истина, Истина);
		КонецЕсли;
		
		УстановитьУсловноеОформление();
		
		ВосстановлениеТекущихСтрок();
		УстановитьФильтрПоРемонту();
		
	ИначеЕсли ИмяСобытия = "ПерезаполнитьТаблицы" Тогда
		ЗаполнитьЗначенияСвойств(Объект, Параметр);
		
		УстановитьПараметрыДинамическогоСпискаКлиент();
				
		РежимВыделенияСтрок = Параметр.РежимВыделенияСтрок;
		УстановитьУсловноеОформление();
	ИначеЕсли ИмяСобытия = "ЗакрытиеЗаявокИРемонтов" Тогда
		СохранениеТекущихСтрок();
		УстановитьПараметрыДинамическогоСпискаКлиент();
		ВосстановлениеТекущихСтрок();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	УстановитьПараметрыДинамическогоСпискаКлиент();

КонецПроцедуры

&НаКлиенте
Процедура ИсполнительПриИзменении(Элемент)
	
	УстановитьПараметрыДинамическогоСпискаКлиент();

КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборПоСтатусуПриИзменении(Элемент)
	
	УстановитьОтборыПоКолонкеСтатусОР();
			
КонецПроцедуры

&НаКлиенте
Процедура СтатусОРОчистка(Элемент, СтандартнаяОбработка)
	
	Для каждого текСтрока из сзСтатусОР Цикл
		текСтрока.Пометка = Ложь;
	КонецЦикла;
		
	УстановитьОтборыПоКолонкеСтатусОР();
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусОРНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОткрытьФорму("ОбщаяФорма.торо_ВыборСостоянияРемонта", Новый Структура("сзСтатусОР", сзСтатусОР),ЭтаФорма,,,,
		Новый ОписаниеОповещения("ВозвратСпискаСостояний", ЭтотОбъект));
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборПоБригадеПриИзменении(Элемент)
	Если Объект.ИспользоватьОтборПоБригаде Тогда
		Объект.ИспользоватьОтборПоДоговору = Ложь;
		Объект.ИспользоватьОтборПоКонтрагенту = Ложь;
	КонецЕсли; 
	//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Ремонты.Отбор, "Бригада", ОтборПоБригаде,,,Объект.ИспользоватьОтборПоБригаде);
	УстановитьОтборыПоАдресацииЗаявок();

КонецПроцедуры

&НаКлиенте
Процедура ОтборПоБригадеПриИзменении(Элемент)
	//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Ремонты.Отбор, "Бригада", ОтборПоБригаде,,,Объект.ИспользоватьОтборПоБригаде);
	УстановитьОтборыПоАдресацииЗаявок();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборПоИсполнителюПриИзменении(Элемент)
	УстановитьПараметрыДинамическогоСпискаКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборПоДоговоруПриИзменении(Элемент)
	
	Если Объект.ИспользоватьОтборПоДоговору Тогда
		Объект.ИспользоватьОтборПоБригаде = Ложь;	
		Объект.ИспользоватьОтборПоПодразделениюИсполнителю = Ложь;	
	КонецЕсли;
	
	УстановитьОтборыПоАдресацииЗаявок();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборПоКонтграгентуПриИзменении(Элемент)
	Если Объект.ИспользоватьОтборПоКонтрагенту Тогда
		Объект.ИспользоватьОтборПоПодразделениюИсполнителю = Ложь;
		Объект.ИспользоватьОтборПоБригаде = Ложь;
	КонецЕсли; 
	УстановитьОтборыПоАдресацииЗаявок();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	УстановитьОтборыПоАдресацииЗаявок();
КонецПроцедуры

&НаКлиенте
Процедура КонтагентПриИзменении(Элемент)
	УстановитьПараметрыВыбораДоговора();
	УстановитьОтборыПоАдресацииЗаявок();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборПоПодразделениюИсполнителюПриИзменении(Элемент)
	
	Если Объект.ИспользоватьОтборПоПодразделениюИсполнителю Тогда
		Объект.ИспользоватьОтборПоКонтрагенту = Ложь;
		Объект.ИспользоватьОтборПоДоговору = Ложь;
	КонецЕсли;
	
	УстановитьОтборыПоАдресацииЗаявок();
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	УстановитьПараметрыВыбораБригады();	
	УстановитьОтборыПоАдресацииЗаявок();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборПоСтатусуДокументаПриИзменении(Элемент)
	
	Если ФОИспользоватьСтатусыДокументов Тогда
		Элементы.ОтборПоСтатусуДокумента.Доступность = ИспользоватьОтборПоСтатусуДокумента;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Ремонты.Отбор, "СтатусДокумента", ОтборПоСтатусуДокумента,,,ИспользоватьОтборПоСтатусуДокумента);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоСтатусуДокументаПриИзменении(Элемент)
	
	Если ФОИспользоватьСтатусыДокументов Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Ремонты.Отбор, "СтатусДокумента", ОтборПоСтатусуДокумента,,,ИспользоватьОтборПоСтатусуДокумента);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ВидимостьОтбораОстановочные = ТекущаяСтраница.Имя = "СтраницаРемонты";
	
	Элементы.флОстановочные.Видимость = ВидимостьОтбораОстановочные;
	Элементы.ДокументОстановочного.Видимость = ВидимостьОтбораОстановочные;
	
	Элементы.ИспользоватьОтборПоСтатусу.Видимость = ВидимостьОтбораОстановочные;
	Элементы.СтатусОР.Видимость = ВидимостьОтбораОстановочные;
	Элементы.ГруппаСтатусДокумента.Видимость = ВидимостьОтбораОстановочные И ФОИспользоватьСтатусыДокументов;
	Элементы.ГруппаОтборовДляАдресации.Видимость = ВидимостьОтбораОстановочные;
	
	СохранениеТекущихСтрок();
	ФлагПереходаСтраницы = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура флОстановочныеПриИзменении(Элемент)
	
	Если Ремонты.Отбор.Элементы.Количество() > ИндексОтбораПоОстановочным Тогда
		Ремонты.Отбор.Элементы.Удалить(ИндексОтбораПоОстановочным);
	КонецЕсли;

	Если Не флОстановочные Тогда
		ДокументОстановочного = Неопределено;
	КонецЕсли;
	
	Элементы.ДокументОстановочного.Доступность = флОстановочные;
	Если флОстановочные Тогда
		ЭлементОтбора = Ремонты.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("IDОсновного");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
		ЭлементОтбора.Использование = Истина;
		ИндексОтбораПоОстановочным = Ремонты.Отбор.Элементы.Индекс(ЭлементОтбора);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОстановочногоПриИзменении(Элемент)
	
	Ремонты.Отбор.Элементы.Удалить(ИндексОтбораПоОстановочным);
	Если ЗначениеЗаполнено(ДокументОстановочного) Тогда
		IDОсновногоРемонта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОстановочного, "IDОсновногоРемонта");
		
		ЭлементОтбора = Ремонты.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("IDОсновного");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = IDОсновногоРемонта;
		ЭлементОтбора.Использование = Истина;
		ИндексОтбораПоОстановочным = Ремонты.Отбор.Элементы.Индекс(ЭлементОтбора);
	Иначе
		ЭлементОтбора = Ремонты.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("IDОсновного");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
		ЭлементОтбора.Использование = Истина;
		ИндексОтбораПоОстановочным = Ремонты.Отбор.Элементы.Индекс(ЭлементОтбора);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРемонты
&НаКлиенте
Процедура РемонтыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если Поле.Имя = "РемонтыДокумент" Тогда
		
		ПоказатьЗначение(Неопределено,Элемент.ТекущиеДанные.Документ);
		
	ИначеЕсли Поле.Имя = "РемонтыДокументПлановыхДат" Тогда
		
		ПоказатьЗначение(Неопределено,Элемент.ТекущиеДанные.ДокументПлановыхДат);
		
	ИначеЕсли Поле.Имя = "РемонтыОбъектРемонта" Тогда 
		
		ПоказатьЗначение(Неопределено,Элемент.ТекущиеДанные.ОбъектРемонта);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РемонтыПриАктивизацииСтроки(Элемент)
	
	Если ФлагПереходаСтраницы Тогда
		
		ВосстановлениеТекущихСтрок();
		ФлагПереходаСтраницы = Ложь;
		
	КонецЕсли;
	
	ТекДанные = Элементы.Ремонты.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда
		Элементы.ФормаОткрытьЗакрытиеЗаявокИРемонтов.Доступность = Не ВыбраныТолькоВО(); 
	КонецЕсли; 
	
	УстановитьФильтрПоРемонту();
	
КонецПроцедуры

&НаКлиенте
Функция ВыбраныТолькоВО()

	Для каждого Индекс Из Элементы.Ремонты.ВыделенныеСтроки Цикл
	    Ремонт = Элементы.Ремонты.ДанныеСтроки(Индекс);
		Если Не ТипЗнч(Ремонт.Документ) = Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот") Тогда
		    Возврат Ложь;
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат Истина;

КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗаявкиНаРемонт
&НаКлиенте
Процедура ЗаявкиНаРемонтВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	 
	Если Не Элемент.ТекущиеДанные = Неопределено Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВызватьОбработчикОповещения", ЭтаФорма, Новый Структура("ИмяСобытия, Источник", "СозданДокументЧерезРМТехСпец", Тип("ДокументСсылка.торо_ЗаявкаНаРемонт")));

		ОткрытьДокумент("Документ.торо_ЗаявкаНаРемонт.ФормаОбъекта", Элемент.ТекущиеДанные.ДокументЗаявка, ОписаниеОповещения);
		
	КонецЕсли;  
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНарядыНаРемонт
&НаКлиенте
Процедура НарядыНаРемонтВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Не Элемент.ТекущиеДанные = Неопределено Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВызватьОбработчикОповещения", ЭтаФорма, Новый Структура("ИмяСобытия, Источник", "СозданДокументЧерезРМТехСпец", Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот")));

		ОткрытьДокумент("Документ.торо_НарядНаВыполнениеРемонтныхРабот.ФормаОбъекта", Элемент.ТекущиеДанные.ДокументНаряд, ОписаниеОповещения);
		
	КонецЕсли;  	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыАктыНаРемонт
&НаКлиенте
Процедура АктыНаРемонтВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Не Элемент.ТекущиеДанные = Неопределено Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВызватьОбработчикОповещения", ЭтаФорма, Новый Структура("ИмяСобытия, Источник", "СозданДокументЧерезРМТехСпец", Тип("ДокументСсылка.торо_АктОВыполненииЭтапаРабот")));

		ОткрытьДокумент("Документ.торо_АктОВыполненииЭтапаРабот.ФормаОбъекта", Элемент.ТекущиеДанные.ДокументАкт, ОписаниеОповещения);
		
	КонецЕсли;  	
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыМероприятия
&НаКлиенте
Процедура МероприятияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если Поле.Имя = "МероприятияДокумент" Тогда
		
		ПоказатьЗначение(Неопределено, Элемент.ТекущиеДанные.Документ);
		
	ИначеЕсли Поле.Имя = "МероприятияДокументПлановыхДат" Тогда
		
		ПоказатьЗначение(Неопределено, Элемент.ТекущиеДанные.ДокументПлановыхДат);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура МероприятияПриАктивизацииСтроки(Элемент)
	
	Если ФлагПереходаСтраницы Тогда
		
		ВосстановлениеТекущихСтрок();
		ФлагПереходаСтраницы = Ложь;
		
	КонецЕсли;
	
	УстановитьФильтрПоРемонту();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНарядыНаМероприятия
&НаКлиенте
Процедура НарядыНаМероприятияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Не Элемент.ТекущиеДанные = Неопределено Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВызватьОбработчикОповещения", ЭтаФорма, Новый Структура("ИмяСобытия, Источник", "СозданДокументЧерезРМТехСпец", Тип("ДокументСсылка.торо_НарядНаРегламентноеМероприятие")));

		ОткрытьДокумент("Документ.торо_НарядНаРегламентноеМероприятие.ФормаОбъекта", Элемент.ТекущиеДанные.ДокументНаряд, ОписаниеОповещения);
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыАктыПоМероприятию
&НаКлиенте
Процедура АктыПоМероприятиюВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если не Элемент.ТекущиеДанные = Неопределено Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВызватьОбработчикОповещения", ЭтаФорма, Новый Структура("ИмяСобытия, Источник", "СозданДокументЧерезРМТехСпец", Тип("ДокументСсылка.торо_АктОВыполненииРегламентногоМероприятия")));

		ОткрытьДокумент("Документ.торо_АктОВыполненииРегламентногоМероприятия.ФормаОбъекта", Элемент.ТекущиеДанные.ДокументАкт, ОписаниеОповещения);
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастройкиОтбора(Команда)
	
	ВыделенныеСтроки = Элементы.Ремонты.ВыделенныеСтроки;
	мТекущийРемонтID.Очистить();
	МассивID = Новый СписокЗначений;
	Для Каждого НомСтроки Из ВыделенныеСтроки Цикл
		Строка = Элементы.Ремонты.ДанныеСтроки(НомСтроки);
		Если Строка <> Неопределено Тогда
			МассивID.Добавить(Строка.ID_Ремонта);
			мТекущийРемонтID.Добавить(Строка.ID_Ремонта);
		КонецЕсли;
	КонецЦикла;
	
	ВыделенныеСтроки = Элементы.Мероприятия.ВыделенныеСтроки;
	мТекущееМероприятиеID.Очистить();
	МассивID = Новый СписокЗначений;
	Для Каждого НомСтроки Из ВыделенныеСтроки Цикл
		Строка = Элементы.Мероприятия.ДанныеСтроки(НомСтроки);
		Если НЕ Строка = Неопределено Тогда
			МассивID.Добавить(Строка.ID_Ремонта);
			мТекущееМероприятиеID.Добавить(Строка.ID_Ремонта);
		КонецЕсли;
	КонецЦикла;
	
	СтруктураПараметров = Новый Структура("ВидДаты, ДатаАктуальности, Завершенные, ДанныеПоНаработке, НеПроведенные, АвтоматическоеОбновление,ПериодОбновления, ПлановыйПериод, Периодичность, ПодчиненныеПодразделения",
	Объект.ВидДаты, Объект.ДатаАктуальности, Объект.Завершенные, Объект.ДанныеПоНаработке, Объект.НеПроведенные, Объект.АвтоматическоеОбновление, Объект.ПериодОбновления, Объект.ПлановыйПериод, Объект.Периодичность, Объект.ПодчиненныеПодразделения);
	
	ДобавитьНастройкиЦвета(СтруктураПараметров);
	
	ФормаНастройки = ПолучитьФорму("Обработка.торо_РабочееМестоТехническогоСпециалиста.Форма.ФормаНастройки", СтруктураПараметров, ЭтаФорма, ЭтаФорма);
	ФормаНастройки.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьРемонты(Команда)
		
	УстановитьПараметрыДинамическогоСпискаКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗакрытиеЗаявокИРемонтов(Команда)
	
	ВыбранныеРемонты = Новый Массив;
	Для каждого Индекс Из Элементы.Ремонты.ВыделенныеСтроки Цикл
	    Ремонт = Элементы.Ремонты.ДанныеСтроки(Индекс);
		ВыбранныеРемонты.Добавить(Ремонт.ID_Ремонта);
	КонецЦикла; 
	
	Отбор = Новый Структура;
	Отбор.Вставить("ID", ВыбранныеРемонты);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОтборРемонтов", Отбор);
	ПараметрыФормы.Вставить("ДатаАктуальности", ОбщегоНазначенияУТКлиентСервер.РассчитатьДатуОкончанияПериода(Объект.ДатаАктуальности, Объект.Периодичность, Объект.ПлановыйПериод));
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВызватьОбработчикОповещения",ЭтаФорма,Новый Структура("ИмяСобытия, Источник", "ЗакрытиеЗаявокИРемонтов","ОбработкаОбъект.торо_ЗакрытиеЗаявокИРемонтов"));
	
	ОткрытьФорму("Обработка.торо_ЗакрытиеЗаявокИРемонтов.Форма.Форма", ПараметрыФормы,,,,,ОписаниеОповещения,);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗаявку(Команда)
	
	ВыполнитьВводДокументаНаОсновании("торо_ЗаявкаНаРемонт", "заявку");
		
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНаряд(Команда)

	ВыполнитьВводДокументаНаОсновании("торо_НарядНаВыполнениеРемонтныхРабот", "наряд");
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьАкт(Команда)
	
	ВыполнитьВводДокументаНаОсновании("торо_АктОВыполненииЭтапаРабот", "акт");
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНарядНаМероприятие(Команда)
	
	ВыполнитьВводДокументаНаОсновании("торо_НарядНаРегламентноеМероприятие", "наряд на регламентное мероприятие");
		
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьАктНаМероприятие(Команда)
	
	ВыполнитьВводДокументаНаОсновании("торо_АктОВыполненииРегламентногоМероприятия", "акт регламентного мероприятия");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьПараметрыДинамическогоСпискаКлиент(ОбновитьЗаявки = Истина
														, ОбновитьНаряды              = Истина
														, ОбновитьАкты                = Истина
														, ОбновитьРегламентныеНаряды  = Истина
														, ОбновитьРегламентныеАкты    = Истина)
												 
	УстановитьПараметрыДинамическогоСписка(ОбновитьЗаявки, ОбновитьНаряды, ОбновитьАкты, ОбновитьРегламентныеНаряды, 
		ОбновитьРегламентныеАкты);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыДинамическогоСписка(ОбновитьЗаявки = Истина
												, ОбновитьНаряды             = Истина
												, ОбновитьАкты               = Истина
												, ОбновитьРегламентныеНаряды = Истина
												, ОбновитьРегламентныеАкты   = Истина)
	
	ИтогоПлановыхДней = 0;
	СекундВДне = 86400;
																								
	Если ЗначениеЗаполнено(Объект.Периодичность) Тогда 
		
		ИтогоПлановыхДней = ПолучитьИтогПлановыхДней(Объект.Периодичность, Объект.ПлановыйПериод, 
			Объект.ДатаАктуальности);
	КонецЕсли;
	
	Если ОбновитьЗаявки ИЛИ ОбновитьАкты или ОбновитьНаряды Тогда
		
		Ремонты.Параметры.УстановитьЗначениеПараметра("Организация"                   , Объект.Организация);
		
		Если Объект.ИспользоватьОтборПоПодразделению Тогда
		
			Если Объект.ПодчиненныеПодразделения Тогда
				
				Если НЕ ЗначениеЗаполнено(Объект.Исполнитель) Тогда
					МассивПодчиненныхПодразделений = Новый Массив;
				Иначе
					МассивПодчиненныхПодразделений = ПолучитьМассивПодчиненныхПодразделений(Объект.Исполнитель);
				КонецЕсли;
				
				Ремонты.Параметры.УстановитьЗначениеПараметра("Исполнитель", МассивПодчиненныхПодразделений);
				
			Иначе
				
				Если НЕ ЗначениеЗаполнено(Объект.Исполнитель) Тогда
					Исполнители = Новый Массив;
					Исполнители.Добавить(ОбщегоНазначенияКлиент.ПредопределенныйЭлемент(
						"Справочник.СтруктураПредприятия"));
				Иначе
					Исполнители = Объект.Исполнитель;	
				КонецЕсли;
				Ремонты.Параметры.УстановитьЗначениеПараметра("Исполнитель", Исполнители);
				
			КонецЕсли;
			
		Иначе
			Ремонты.Параметры.УстановитьЗначениеПараметра("Исполнитель", Новый Массив);
		КонецЕсли;
		
		КонстантыВыдРемонта = ПолучитьКонстантыВидРемонта();
		
		Ремонты.Параметры.УстановитьЗначениеПараметра("Завершенные", Объект.Завершенные);
		Ремонты.Параметры.УстановитьЗначениеПараметра("ПлановыйПериод", 
			КонецДня(Объект.ДатаАктуальности + ИтогоПлановыхДней * СекундВДне));
		Ремонты.Параметры.УстановитьЗначениеПараметра("ПоВсемОрганизациям", 
			?(Не ЗначениеЗаполнено(Объект.Организация), Истина, Ложь));
		Ремонты.Параметры.УстановитьЗначениеПараметра("ПоВсемПодразделениям", 
			НЕ Объект.ИспользоватьОтборПоПодразделению);
		Ремонты.Параметры.УстановитьЗначениеПараметра("ТекДата", ТекущаяДата());
		Ремонты.Параметры.УстановитьЗначениеПараметра("торо_ВидРемонтаВД", 
			КонстантыВыдРемонта.торо_ВидРемонтаПриВводеНаОснованииВыявленныхДефектов);
		Ремонты.Параметры.УстановитьЗначениеПараметра("торо_ВидРемонтаВО", 
			КонстантыВыдРемонта.торо_ВидРемонтаПриВводеНаОснованииВнешнихОснований);
		Ремонты.Параметры.УстановитьЗначениеПараметра("ФОИспользоватьВнешниеОснования", ФОИспользоватьВнешниеОснования);
		Ремонты.Параметры.УстановитьЗначениеПараметра("ФОИспользоватьДефекты", ФОИспользоватьДефекты);
		Ремонты.Параметры.УстановитьЗначениеПараметра("ФОИспользоватьППР", ФОИспользоватьППР);
		Ремонты.Параметры.УстановитьЗначениеПараметра("ИспользоватьСметы", ФОИспользоватьСметы);
		Ремонты.Параметры.УстановитьЗначениеПараметра("ИспользоватьСтатусыДокументов", ФОИспользоватьСтатусыДокументов);
		
		Если Не Ремонты.Параметры.Элементы.Найти("гкс_ПодразделениеВладелец") = Неопределено Тогда 
			СтруктураПроверки = Новый Структура("гкс_ИспользоватьОтборПодразделениеВладелец", Неопределено);
			ЗаполнитьЗначенияСвойств(СтруктураПроверки, ЭтотОбъект);
			Если Не СтруктураПроверки.гкс_ИспользоватьОтборПодразделениеВладелец = Неопределено 
				И СтруктураПроверки.гкс_ИспользоватьОтборПодразделениеВладелец = Истина Тогда 
				Ремонты.Параметры.УстановитьЗначениеПараметра("гкс_ИспользоватьПодразделениеВладелец", Истина);
				Ремонты.Параметры.УстановитьЗначениеПараметра("гкс_ПодразделениеВладелец", 
					ЭтотОбъект["гкс_ОтборПодразделениеВладелец"]);
			Иначе
				Ремонты.Параметры.УстановитьЗначениеПараметра("гкс_ИспользоватьПодразделениеВладелец", Ложь);
				Ремонты.Параметры.УстановитьЗначениеПараметра("гкс_ПодразделениеВладелец" , Неопределено);
			КонецЕсли;
		КонецЕсли;
		// гкс+ [8220] Тарасов 19.10.2020
		Если Не Ремонты.Параметры.Элементы.Найти("гкс_СрочностьВоздействия") = Неопределено Тогда 
			СтруктураПроверки = Новый Структура("гкс_ИспользоватьОтборСрочностьВоздействия", Неопределено);
			ЗаполнитьЗначенияСвойств(СтруктураПроверки, ЭтотОбъект);
			Если Не СтруктураПроверки.гкс_ИспользоватьОтборСрочностьВоздействия = Неопределено 
				И СтруктураПроверки.гкс_ИспользоватьОтборСрочностьВоздействия = Истина Тогда 
				Ремонты.Параметры.УстановитьЗначениеПараметра("гкс_ИспользоватьСрочностьВоздействия", Истина);
				Ремонты.Параметры.УстановитьЗначениеПараметра("гкс_СрочностьВоздействия", 
					ЭтотОбъект["гкс_ОтборСрочностьВоздействия"]);
			Иначе
				Ремонты.Параметры.УстановитьЗначениеПараметра("гкс_ИспользоватьСрочностьВоздействия", Ложь);
				Ремонты.Параметры.УстановитьЗначениеПараметра("гкс_СрочностьВоздействия", Неопределено);
			КонецЕсли;
		КонецЕсли;
		// гкс- [8220] Тарасов 19.10.2020
		
		Элементы.Ремонты.АвтоОбновление = Объект.АвтоматическоеОбновление;
		Элементы.Ремонты.ПериодАвтоОбновления = Объект.ПериодОбновления;
		
	КонецЕсли; 
	
	Если ОбновитьРегламентныеАкты Тогда
		
		Если Объект.ИспользоватьОтборПоПодразделению Тогда
			Если НЕ ЗначениеЗаполнено(Объект.Исполнитель) Тогда
				Исполнители = Новый Массив;
				Исполнители.Добавить(ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Справочник.СтруктураПредприятия"));
			Иначе
				Исполнители = Объект.Исполнитель;	
			КонецЕсли;
			Мероприятия.Параметры.УстановитьЗначениеПараметра("Исполнитель", Исполнители);
		Иначе	
			Мероприятия.Параметры.УстановитьЗначениеПараметра("Исполнитель", Объект.Исполнитель);
		КонецЕсли;
		
		Мероприятия.Параметры.УстановитьЗначениеПараметра("Организация", Объект.Организация);
		Мероприятия.Параметры.УстановитьЗначениеПараметра("Завершенные", Объект.Завершенные);
		Мероприятия.Параметры.УстановитьЗначениеПараметра("ПлановыйПериод", 
			КонецДня(Объект.ДатаАктуальности + ИтогоПлановыхДней * СекундВДне));
		Мероприятия.Параметры.УстановитьЗначениеПараметра("ПоВсемОрганизациям", 
			?(Не ЗначениеЗаполнено(Объект.Организация), Истина, Ложь));
		Мероприятия.Параметры.УстановитьЗначениеПараметра("ПоВсемПодразделениям", 
			НЕ Объект.ИспользоватьОтборПоПодразделению);
		Мероприятия.Параметры.УстановитьЗначениеПараметра("ФОИспользоватьРегламентныеМероприятия", 
			ФОИспользоватьРегламентныеМероприятия);
		
		УстановитьЗапросИПараметрыДинСпискаРегламентныхАктов();
	КонецЕсли;
	
	Если ФОИспользоватьРегламентныеМероприятия Тогда
		Элементы.Мероприятия.АвтоОбновление = Объект.АвтоматическоеОбновление;
		Элементы.Мероприятия.ПериодАвтоОбновления = Объект.ПериодОбновления;	
	КонецЕсли; 
	
	Если ОбновитьЗаявки Тогда
		УстановитьЗапросИПараметрыДинСпискаЗаявок();	
	КонецЕсли; 	
	
	Если ОбновитьНаряды Тогда
		УстановитьЗапросИПараметрыДинСпискаНарядов();
	КонецЕсли;
	
	Если ОбновитьАкты Тогда
		УстановитьЗапросИПараметрыДинСпискаАктов();
	КонецЕсли; 
	
	Если ОбновитьРегламентныеНаряды Тогда
		УстановитьЗапросИПараметрыДинСпискаРегламентныхНарядов(); 
	КонецЕсли;
			
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИтогПлановыхДней(Периодичность, ПлановыйПериод, ДатаАктуальности)	
			
	ИтогоПлановыхДней = 0;
	ПлановыйПериод = Формат(ПлановыйПериод, "ЧГ=");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РАЗНОСТЬДАТ(&ДатаНачала, ДОБАВИТЬКДАТЕ(&ДатаНачала, &Периодичность, &ПлановыйПериод), ДЕНЬ) КАК ПлановыйПериод";		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Периодичность", Строка(Периодичность));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПлановыйПериод", Строка(ПлановыйПериод));
 
	Запрос.УстановитьПараметр("ДатаНачала", ДатаАктуальности);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ИтогоПлановыхДней = Выборка.ПлановыйПериод;
	КонецЕсли;
	
	Возврат ИтогоПлановыхДней;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьМассивПодчиненныхПодразделений(Исполнитель) 
	
	МассивПодчиненныхПодразделений = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Подразделения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтруктураПредприятия КАК Подразделения
		|ГДЕ
		|	Подразделения.Ссылка В ИЕРАРХИИ(&Ссылка)";
	Запрос.УстановитьПараметр("Ссылка", Исполнитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивПодчиненныхПодразделений = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат МассивПодчиненныхПодразделений; 
					
КонецФункции  

&НаСервереБезКонтекста
Функция ПолучитьКонстантыВидРемонта()
	
	КонстантыВидРемонта = Новый Структура;
	КонстантыВидРемонта.Вставить("торо_ВидРемонтаПриВводеНаОснованииВыявленныхДефектов", 
		Константы.торо_ВидРемонтаПриВводеНаОснованииВыявленныхДефектов.Получить());
	КонстантыВидРемонта.Вставить("торо_ВидРемонтаПриВводеНаОснованииВнешнихОснований",
		Константы.торо_ВидРемонтаПриВводеНаОснованииВнешнихОснований.Получить());
		
	Возврат КонстантыВидРемонта; 
		
КонецФункции

// Заполняет заявки по выбранным ремонтам
//
&НаСервере
Процедура УстановитьЗапросИПараметрыДинСпискаЗаявок()
	
	Если Не ИспользоватьУправлениеРемонтами
		ИЛИ Не ФОИспользоватьСметы Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ID КАК ID_Ремонта,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка КАК ДокументЗаявка,
	|	ВЫБОР
	|		КОГДА торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка.Проведен
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Картинка,
	|	ЕСТЬNULL(торо_СтатусыРемонтовВЗаявкахСрезПоследних.Статус, торо_СтатусыДокументовЗаявокУстановленныеСрезПоследних.СтатусДокумента) КАК Статус
	|ИЗ
	|	Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК торо_ЗаявкаНаРемонтРемонтыОборудования
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОтмененныеЗаявки КАК торо_ОтмененныеЗаявки
	|		ПО торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка = торо_ОтмененныеЗаявки.Заявка 
	|			И торо_ЗаявкаНаРемонтРемонтыОборудования.ID = торо_ОтмененныеЗаявки.ИДРемонта 
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_СтатусыРемонтовВЗаявках.СрезПоследних КАК торо_СтатусыРемонтовВЗаявкахСрезПоследних
	|		ПО торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка = торо_СтатусыРемонтовВЗаявкахСрезПоследних.ЗаявкаНаРемонт
	|			И торо_ЗаявкаНаРемонтРемонтыОборудования.ID = торо_СтатусыРемонтовВЗаявкахСрезПоследних.ИДРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_СтатусыДокументовЗаявокУстановленные.СрезПоследних КАК торо_СтатусыДокументовЗаявокУстановленныеСрезПоследних
	|		ПО торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка = торо_СтатусыДокументовЗаявокУстановленныеСрезПоследних.ИзменяемыйДокумент
	|ГДЕ
	|	торо_ОтмененныеЗаявки.Заявка ЕСТЬ NULL
	|	И ВЫБОР
	|			КОГДА &ПоказыватьНепроведенные
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка.Проведен
	|		КОНЕЦ
	|	И НЕ торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка.ПометкаУдаления";
	
	ЗаявкиНаРемонт.ТекстЗапроса = Запрос.Текст;
	ЗаявкиНаРемонт.Параметры.УстановитьЗначениеПараметра("ПоказыватьНепроведенные", Объект.НеПроведенные);
	
	Элементы.ЗаявкиНаРемонт.АвтоОбновление = Объект.АвтоматическоеОбновление;
	Элементы.ЗаявкиНаРемонт.ПериодАвтоОбновления = Объект.ПериодОбновления;
	
КонецПроцедуры

&НаСервере
// Заполняет наряды по выбранным ремонтам
//
Процедура УстановитьЗапросИПараметрыДинСпискаНарядов()
		
	Если Не ИспользоватьУправлениеРемонтами
		ИЛИ Не ФОИспользоватьНаряды Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID КАК ID_Ремонта,
	|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка КАК ДокументНаряд,
	|	ВЫБОР
	|		КОГДА торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Проведен
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Картинка
	|ИЗ
	|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтыОборудования КАК торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ПоказыватьНепроведенные
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Проведен
	|		КОНЕЦ
	|	И НЕ торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.ПометкаУдаления";
	
	НарядыНаРемонт.ТекстЗапроса = Запрос.Текст;
	НарядыНаРемонт.Параметры.УстановитьЗначениеПараметра("ПоказыватьНепроведенные", Объект.НеПроведенные);

	Элементы.НарядыНаРемонт.АвтоОбновление = Объект.АвтоматическоеОбновление;
	Элементы.НарядыНаРемонт.ПериодАвтоОбновления = Объект.ПериодОбновления;	
	
КонецПроцедуры

&НаСервере
// Заполняет акты по выбранным ремонтам
//
Процедура УстановитьЗапросИПараметрыДинСпискаАктов()
	
	Если Не ИспользоватьУправлениеРемонтами Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ID КАК ID_Ремонта,
	|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка КАК ДокументАкт,
	|	ВЫБОР
	|		КОГДА торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка.Проведен
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Картинка
	|ИЗ
	|	Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК торо_АктОВыполненииЭтапаРаботРемонтыОборудования
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ПоказыватьНепроведенные
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка.Проведен
	|		КОНЕЦ
	|	И НЕ торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка.ПометкаУдаления";
	
	АктыНаРемонт.ТекстЗапроса = Запрос.Текст;
	АктыНаРемонт.Параметры.УстановитьЗначениеПараметра("ПоказыватьНепроведенные", Объект.НеПроведенные);

	Элементы.АктыНаРемонт.АвтоОбновление = Объект.АвтоматическоеОбновление;
	Элементы.АктыНаРемонт.ПериодАвтоОбновления = Объект.ПериодОбновления;
	
КонецПроцедуры

&НаСервере
// Заполняет Регламентные наряды по выбранным ремонтам
//
Процедура УстановитьЗапросИПараметрыДинСпискаРегламентныхНарядов()
	
	Если Не ФОИспользоватьРегламентныеМероприятия 
		ИЛИ Не ФОИспользоватьНарядыНаРегламентныеМероприятия Тогда
		Возврат;	
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	торо_Ремонты.Регистратор КАК ДокументНаряд,
	               |	торо_Ремонты.ID          КАК ID_Ремонта,
	               |	1                        КАК Картинка
	               |ИЗ
	               |	РегистрСведений.торо_Ремонты КАК торо_Ремонты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ГрафикРегламентныхМероприятийТОиР.ПланРемонтов КАК торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов
	               |		ПО торо_Ремонты.ID = торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов.ID
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗавершенныеМероприятия.СрезПоследних(&ПлановыйПериод, ) КАК торо_ЗавершенныеМероприятияСрезПоследних
	               |		ПО торо_Ремонты.ID = торо_ЗавершенныеМероприятияСрезПоследних.ID
	               |ГДЕ
	               |	ТИПЗНАЧЕНИЯ(торо_Ремонты.Регистратор) = ТИП(Документ.торо_НарядНаРегламентноеМероприятие)
	               |	И ВЫБОР
	               |			КОГДА НЕ &ПоВсемОрганизациям
	               |				ТОГДА торо_Ремонты.Регистратор.Организация = &Организация
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И НЕ торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов.Отменен
	               |	И НЕ торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов.Замещен
	               |	И торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов.ДатаНач <= &ПлановыйПериод
	              // |	И НЕ торо_Ремонты.Регистратор.Организация.Наименование ЕСТЬ NULL 
	               |	И ВЫБОР
	               |			КОГДА НЕ &Завершенные
	               |				ТОГДА торо_ЗавершенныеМероприятияСрезПоследних.ID ЕСТЬ NULL 
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ";
	
	// Выводим НеПроведенные документы, если включена такая настройка									  
	Если Объект.НеПроведенные Тогда
		Запрос.Текст = Запрос.Текст  +
          "
          |ОБЪЕДИНИТЬ ВСЕ
		  |" + 

		  
		  "ВЫБРАТЬ РАЗЛИЧНЫЕ
		  |	торо_НарядНаРегламентноеМероприятиеРегламентныеМероприятия.Ссылка КАК ДокументНаряд,
		  |	торо_НарядНаРегламентноеМероприятиеРегламентныеМероприятия.ID     КАК ID_Ремонта,
	      |	0                                                                 КАК Картинка
		  |ИЗ
		  |	Документ.торо_НарядНаРегламентноеМероприятие.РегламентныеМероприятия КАК торо_НарядНаРегламентноеМероприятиеРегламентныеМероприятия
		  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗавершенныеМероприятия.СрезПоследних(&ПлановыйПериод, ) КАК торо_ЗавершенныеМероприятияСрезПоследних
		  |		ПО торо_НарядНаРегламентноеМероприятиеРегламентныеМероприятия.ID = торо_ЗавершенныеМероприятияСрезПоследних.ID
		  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ГрафикРегламентныхМероприятийТОиР.ПланРемонтов КАК торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов
		  |		ПО торо_НарядНаРегламентноеМероприятиеРегламентныеМероприятия.ID = торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов.ID
		  |ГДЕ
		  |	торо_НарядНаРегламентноеМероприятиеРегламентныеМероприятия.Ссылка.Проведен = ЛОЖЬ
		  |	И торо_НарядНаРегламентноеМероприятиеРегламентныеМероприятия.Ссылка.ПометкаУдаления = ЛОЖЬ
		  |	И ВЫБОР
		  |			КОГДА НЕ &ПоВсемОрганизациям
		  |				ТОГДА торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов.Ссылка.Организация = &Организация
		  |			ИНАЧЕ ИСТИНА
		  |		КОНЕЦ
		  |	И НЕ торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов.Отменен
		  |	И НЕ торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов.Замещен
		  |	И торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов.ДатаНач <= &ПлановыйПериод
		  |	И НЕ торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов.Ссылка.Организация.Наименование ЕСТЬ NULL 
		  |	И ВЫБОР
		  |			КОГДА НЕ &Завершенные
		  |				ТОГДА торо_ЗавершенныеМероприятияСрезПоследних.ID ЕСТЬ NULL 
		  |			ИНАЧЕ ИСТИНА
		  |		КОНЕЦ";
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ * ИЗ ("+Запрос.Текст+") КАК Таблица";
	
	НарядыНаМероприятия.ТекстЗапроса = Запрос.Текст;
	НарядыНаМероприятия.Параметры.УстановитьЗначениеПараметра("Организация",          Объект.Организация);
	НарядыНаМероприятия.Параметры.УстановитьЗначениеПараметра("ПлановыйПериод",       КонецДня(Объект.ДатаАктуальности + (ИтогоПлановыхДней*60*60*24)));
	НарядыНаМероприятия.Параметры.УстановитьЗначениеПараметра("ПоВсемОрганизациям",   ?(Не ЗначениеЗаполнено(Объект.Организация), Истина, Ложь));
	НарядыНаМероприятия.Параметры.УстановитьЗначениеПараметра("Завершенные",          Объект.Завершенные);
	
	Элементы.НарядыНаМероприятия.АвтоОбновление = Объект.АвтоматическоеОбновление;
	Элементы.НарядыНаМероприятия.ПериодАвтоОбновления = Объект.ПериодОбновления;

КонецПроцедуры

&НаСервере
// Заполняет Регламентные акты по выбранным ремонтам
//
Процедура УстановитьЗапросИПараметрыДинСпискаРегламентныхАктов()
	
	Если Не ФОИспользоватьРегламентныеМероприятия Тогда
		Возврат;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	торо_Ремонты.Регистратор КАК ДокументАкт,
	               |	торо_Ремонты.ID КАК ID_Ремонта,
				   |	1 КАК Картинка
	               |ИЗ
	               |	РегистрСведений.торо_Ремонты КАК торо_Ремонты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ГрафикРегламентныхМероприятийТОиР.ПланРемонтов КАК торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов
	               |		ПО торо_Ремонты.ID = торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов.ID
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗавершенныеМероприятия.СрезПоследних(&ПлановыйПериод, ) КАК торо_ЗавершенныеМероприятияСрезПоследних
	               |		ПО торо_Ремонты.ID = торо_ЗавершенныеМероприятияСрезПоследних.ID
	               |ГДЕ
	               |	ТИПЗНАЧЕНИЯ(торо_Ремонты.Регистратор) = ТИП(Документ.торо_АктОВыполненииРегламентногоМероприятия)
	               |	И ВЫБОР
	               |			КОГДА НЕ &ПоВсемОрганизациям
	               |				ТОГДА торо_Ремонты.Регистратор.Организация = &Организация
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И НЕ торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов.Отменен
	               |	И НЕ торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов.Замещен
	               |	И торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов.ДатаНач <= &ПлановыйПериод
	              // |	И НЕ торо_Ремонты.Регистратор.Организация.Наименование ЕСТЬ NULL 
	               |	И ВЫБОР
	               |			КОГДА НЕ &Завершенные
	               |				ТОГДА торо_ЗавершенныеМероприятияСрезПоследних.ID ЕСТЬ NULL 
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ";
	
	// Выводим НеПроведенные документы, если включена такая настройка									  
	Если Объект.НеПроведенные Тогда
		Запрос.Текст = Запрос.Текст  +
          "
          |ОБЪЕДИНИТЬ ВСЕ
		  |" + 

		  
		  "ВЫБРАТЬ РАЗЛИЧНЫЕ

		  |	торо_АктОВыполненииРегламентногоМероприятияМероприятия.Ссылка КАК ДокументНаряд,
		  |	торо_АктОВыполненииРегламентногоМероприятияМероприятия.ID КАК ID_Ремонта,
	      |	0 КАК Картинка
		  |ИЗ
		  |	Документ.торо_АктОВыполненииРегламентногоМероприятия.Мероприятия КАК торо_АктОВыполненииРегламентногоМероприятияМероприятия
		  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗавершенныеМероприятия.СрезПоследних(&ПлановыйПериод, ) КАК торо_ЗавершенныеМероприятияСрезПоследних
		  |		ПО торо_АктОВыполненииРегламентногоМероприятияМероприятия.ID = торо_ЗавершенныеМероприятияСрезПоследних.ID
		  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ГрафикРегламентныхМероприятийТОиР.ПланРемонтов КАК торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов
		  |		ПО торо_АктОВыполненииРегламентногоМероприятияМероприятия.ID = торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов.ID
		  |ГДЕ
		  |	торо_АктОВыполненииРегламентногоМероприятияМероприятия.Ссылка.Проведен = ЛОЖЬ
		  |	И торо_АктОВыполненииРегламентногоМероприятияМероприятия.Ссылка.ПометкаУдаления = ЛОЖЬ
		  |	И ВЫБОР
		  |			КОГДА НЕ &ПоВсемОрганизациям
		  |				ТОГДА торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов.Ссылка.Организация = &Организация
		  |			ИНАЧЕ ИСТИНА
		  |		КОНЕЦ
		  |	И НЕ торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов.Отменен
		  |	И НЕ торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов.Замещен
		  |	И торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов.ДатаНач <= &ПлановыйПериод
		  |	И НЕ торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов.Ссылка.Организация.Наименование ЕСТЬ NULL 
		  |	И ВЫБОР
		  |			КОГДА НЕ &Завершенные
		  |				ТОГДА торо_ЗавершенныеМероприятияСрезПоследних.ID ЕСТЬ NULL 
		  |			ИНАЧЕ ИСТИНА
		  |		КОНЕЦ";
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ * ИЗ ("+Запрос.Текст+") КАК Таблица";
	
	АктыПоМероприятию.ТекстЗапроса = Запрос.Текст;
	АктыПоМероприятию.Параметры.УстановитьЗначениеПараметра("Организация",          Объект.Организация);
	АктыПоМероприятию.Параметры.УстановитьЗначениеПараметра("ПлановыйПериод",       КонецДня(Объект.ДатаАктуальности + (ИтогоПлановыхДней*60*60*24)));
	АктыПоМероприятию.Параметры.УстановитьЗначениеПараметра("ПоВсемОрганизациям",   ?(Не ЗначениеЗаполнено(Объект.Организация), Истина, Ложь));
	АктыПоМероприятию.Параметры.УстановитьЗначениеПараметра("Завершенные",          Объект.Завершенные);

	Элементы.АктыПоМероприятию.АвтоОбновление = Объект.АвтоматическоеОбновление;
	Элементы.АктыПоМероприятию.ПериодАвтоОбновления = Объект.ПериодОбновления;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуВводаНаОсновании()
	
	ТабНастроек = торо_ЗаполнениеДокументовПовторноеИспользование.ПолучитьТаблицуВводаНаОсновании();
	ВводНаОсновании.Загрузить(ТабНастроек);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	Если РежимВыделенияСтрок = "По критичности" Тогда
		Для каждого Стр Из ТаблицаКритичности Цикл
			
			ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
			
			ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле         = Новый ПолеКомпоновкиДанных("Ремонты");
			
			ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Ремонты.КритичностьДефекта");
			ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = Стр.Критичность;
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Стр.Цвет);
			
		КонецЦикла;
		
	ИначеЕсли РежимВыделенияСтрок = "По приоритету объекта ремонта" Тогда
		
		Для каждого Стр Из ТаблицаПриоритетностиОР Цикл
			
			ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
			
			ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле         = Новый ПолеКомпоновкиДанных("Ремонты");
			
			ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Ремонты.ПриоритетОР");
			ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = Стр.Приоритет;
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Стр.Цвет);
			
		КонецЦикла;
		
	ИначеЕсли РежимВыделенияСтрок = "По наработке объекта ремонта" Тогда
		
		Для каждого Стр Из ТаблицаНаработки Цикл
			
			ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
			
			ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле         = Новый ПолеКомпоновкиДанных("Ремонты");
			
			ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Ремонты.Отклонение");
			ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = Стр.Наработка;
			
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Стр.Цвет);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле         = Новый ПолеКомпоновкиДанных("Ремонты");
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Ремонты.Завершенные");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(201,226,255));
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ОформляемоеПоле  = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле         = Новый ПолеКомпоновкиДанных("Мероприятия");
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Мероприятия.Завершенные");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(201,226,255));
	
	// функциональные опции
	Элементы.СтраницаРемонты.Видимость                 = ИспользоватьУправлениеРемонтами;
	Элементы.СтраницаРегламентныеМероприятия.Видимость = ФОИспользоватьРегламентныеМероприятия;
	Элементы.ГруппаНарядыНаМероприятия.Видимость = ФОИспользоватьНарядыНаРегламентныеМероприятия;
	Элементы.РемонтыВведенаЗаявка.Видимость            = ИспользоватьУправлениеРемонтами И ФОИспользоватьСметы;
	Элементы.ГруппаЗаявкиНаРемонт.Видимость            = ИспользоватьУправлениеРемонтами И ФОИспользоватьСметы;
	Элементы.ГруппаНарядыНаРемонт.Видимость            = ИспользоватьУправлениеРемонтами И ФОИспользоватьНаряды;
	Элементы.ГруппаСтатусДокумента.Видимость = ФОИспользоватьСтатусыДокументов И (Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаРемонты);
	Элементы.РемонтыСтатусДокумента.Видимость = ФОИспользоватьСтатусыДокументов;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПриоритетностиОР()
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_ПриоритетыОбъектовРемонта.Ссылка КАК Приоритет
	|ИЗ
	|	Справочник.торо_ПриоритетыОбъектовРемонта КАК торо_ПриоритетыОбъектовРемонта
	|
	|УПОРЯДОЧИТЬ ПО
	|	торо_ПриоритетыОбъектовРемонта.Код";
	
	ЦветПоУмолчанию = Новый Цвет(255,255,255);
	
	Если ТаблицаПриоритетностиОР.Количество() = 0 Тогда
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Массив = Новый Массив;
		Массив.Добавить(Тип("Цвет"));
		РезультатЗапроса.Колонки.Добавить("Цвет",Новый ОписаниеТипов(Массив));
		
		РезультатЗапроса.ЗаполнитьЗначения(ЦветПоУмолчанию,"Цвет");
		
		ТаблицаКритичности.Загрузить(РезультатЗапроса);
		
	Иначе 
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() цикл
			Если ТаблицаПриоритетностиОР.НайтиСтроки(Новый Структура("Приоритет", Выборка.Приоритет)).Количество() = 0 Тогда
				НС = ТаблицаПриоритетностиОР.Добавить();
				НС.Приоритет = Выборка.Приоритет;
				НС.Цвет = ЦветПоУмолчанию;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьНастройкиЦвета(СтруктураПараметров)
	
	Если РежимВыделенияСтрок = "По критичности" Тогда
		СтруктураПараметров.Вставить("ТаблицаКритичности", ПоместитьВоВременноеХранилище(ТаблицаКритичности.Выгрузить(), ЭтаФорма.УникальныйИдентификатор));
	ИначеЕсли РежимВыделенияСтрок = "По приоритету объекта ремонта" Тогда
		СтруктураПараметров.Вставить("ТаблицаПриоритетностиОР", ПоместитьВоВременноеХранилище(ТаблицаПриоритетностиОР.Выгрузить(), ЭтаФорма.УникальныйИдентификатор));
	ИначеЕсли РежимВыделенияСтрок = "По наработке объекта ремонта" Тогда
		СтруктураПараметров.Вставить("ТаблицаНаработки", ПоместитьВоВременноеХранилище(ТаблицаНаработки.Выгрузить(), ЭтаФорма.УникальныйИдентификатор));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВызватьОбработчикОповещения(Результат, ДопПараметры) Экспорт
	ОбработкаОповещения(ДопПараметры.ИмяСобытия, Неопределено, ДопПараметры.Источник);
КонецПроцедуры
      
&НаКлиенте
Процедура УстановитьФильтрПоРемонту()
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.Страницы.ПодчиненныеЭлементы.СтраницаРемонты Тогда
		
		ВыделенныеСтроки = Элементы.Ремонты.ВыделенныеСтроки;
		
		ВыделенаОднаСтрока = (ВыделенныеСтроки.Количество() = 1);
		
		Если ВыделенаОднаСтрока Тогда
			
			ТекущиеДанные = Элементы.Ремонты.ТекущиеДанные;
			Если ТекущиеДанные <> Неопределено Тогда
				ТекID = ТекущиеДанные.ID_Ремонта;					
			КонецЕсли; 
			
		Иначе
			
			ТекID = Новый СписокЗначений;
			
			Для каждого НомСтр Из ВыделенныеСтроки Цикл
				Строка = Элементы.Ремонты.ДанныеСтроки(НомСтр);
				Если Строка <> Неопределено Тогда
					ТекID.Добавить(Строка.ID_Ремонта);
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		Если ТекID <> Неопределено Тогда
		
			УстановитьОтборВСписке(ЗаявкиНаРемонт, ТекID, ВыделенаОднаСтрока);
			УстановитьОтборВСписке(НарядыНаРемонт, ТекID, ВыделенаОднаСтрока);
			УстановитьОтборВСписке(АктыНаРемонт,   ТекID, ВыделенаОднаСтрока);    
		
		КонецЕсли; 
		
		
	Иначе
		
		ВыделенныеСтроки = Элементы.Мероприятия.ВыделенныеСтроки;
		
		ВыделенаОднаСтрока = (ВыделенныеСтроки.Количество() = 1);
	
		Если ВыделенаОднаСтрока Тогда
			
			//ТекID = Элементы.Мероприятия.ТекущиеДанные.ID_Ремонта;
			
			ТекущиеДанные = Элементы.Мероприятия.ТекущиеДанные;
			Если ТекущиеДанные <> Неопределено Тогда
				ТекID = ТекущиеДанные.ID_Ремонта;					
			КонецЕсли;
			
		Иначе
			
			ТекID = Новый СписокЗначений;
			
			Для каждого НомСтр Из ВыделенныеСтроки Цикл
				Строка = Элементы.Мероприятия.ДанныеСтроки(НомСтр);
				Если Строка <> Неопределено Тогда
					ТекID.Добавить(Строка.ID_Ремонта);
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		Если ТекID <> Неопределено Тогда
		
			УстановитьОтборВСписке(НарядыНаМероприятия, ТекID, ВыделенаОднаСтрока);
			УстановитьОтборВСписке(АктыПоМероприятию,   ТекID, ВыделенаОднаСтрока);
		
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура устанавливает доступность кнопок в зависимости от настроек ввода на основании.
//
&НаКлиенте
Функция ПроверитьВводНаОсновании(ДокументОснование, ДокументВводимый)
	
	МассивСтрок = ВводНаОсновании.НайтиСтроки(Новый Структура("ДокументОснование, ДокументВводимый", ДокументОснование, ДокументВводимый));
	
	Если МассивСтрок.Количество() > 0 Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;	
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура УстановитьОтборВСписке(Список, ТекID, ВыделенаОднаСтрока = Истина)
	
	Если ВыделенаОднаСтрока Тогда
		
		Список.Отбор.Элементы.Очистить();
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ID_Ремонта");
		ЭлементОтбора.ПравоеЗначение = ТекID;
		ЭлементОтбора.Использование = Истина;
		
	Иначе
		
		Список.Отбор.Элементы.Очистить();
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ID_Ремонта");
		ЭлементОтбора.ПравоеЗначение = ТекID;
		ЭлементОтбора.Использование = Истина;
				
	КонецЕсли;	
	
КонецПроцедуры
 
&НаКлиенте
Функция ПолучитьМассивВыделенныхСтрокРемонтов(ЭлементыРемонты)
	
	МассивВыделенныхСтрок = Новый Массив;	
	
	Для Каждого НомСтроки Из ЭлементыРемонты.ВыделенныеСтроки Цикл
		Строка = ЭлементыРемонты.ДанныеСтроки(НомСтроки);
		Если НЕ Строка = Неопределено Тогда 
			МассивВыделенныхСтрок.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;	
	
	Возврат МассивВыделенныхСтрок;
		
КонецФункции // ПолучитьМассивВыделенныхСтрокРемонтов()
 
&НаСервере
Функция ПолучитьСвязанныеДокументыПОID(МассивВыделенныхСтрок, ИмяТЧ, ВыгружатьВМассив = Ложь)
	
	ТаблицаВыделенныхСтрок = Новый ТаблицаЗначений;
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Строка"));
	
	ОписаниеТипов = Новый ОписаниеТипов(МассивТипов,,Новый КвалификаторыСтроки(36));
	
	ТаблицаВыделенныхСтрок.Колонки.Добавить("ID_Ремонта",ОписаниеТипов);
	
	Для Каждого Строка Из МассивВыделенныхСтрок Цикл
		НС = ТаблицаВыделенныхСтрок.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Строка);
	КонецЦикла;
	
	
		
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокID.ID_Ремонта
		|ПОМЕСТИТЬ ID_Ремонтов
		|ИЗ
		|	&СписокID КАК СписокID
		|;";

	Если ИмяТЧ = "ЗаявкиНаРемонт" Тогда
		
		Запрос.Текст = Запрос.Текст + 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_ЗаявкиПоРемонтам.Регистратор КАК Документ,
		|	торо_ЗаявкиПоРемонтам.IDРемонта КАК ID,
		|	""торо_ЗаявкаНаРемонт"" КАК ТипДокумента
		|ИЗ
		|	ID_Ремонтов КАК ID_Ремонтов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗаявкиПоРемонтам КАК торо_ЗаявкиПоРемонтам
		|		ПО (торо_ЗаявкиПоРемонтам.Регистратор ССЫЛКА Документ.торо_ЗаявкаНаРемонт)
		|			И ID_Ремонтов.ID_Ремонта = торо_ЗаявкиПоРемонтам.IDРемонта
		|			И (НЕ торо_ЗаявкиПоРемонтам.Регистратор В
		|					(ВЫБРАТЬ
		|						торо_ОтмененныеЗаявки.Заявка
		|					ИЗ
		|						РегистрСведений.торо_ОтмененныеЗаявки КАК торо_ОтмененныеЗаявки))";
		
	ИначеЕсли ИмяТЧ = "НарядыНаРемонт" Тогда
		
		Запрос.Текст = Запрос.Текст + 
		"////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_НарядыПоРемонтам.Регистратор        КАК Документ,
		|	торо_НарядыПоРемонтам.IDРемонта          КАК ID,
		|	""торо_НарядНаВыполнениеРемонтныхРабот"" КАК ТипДокумента
		|ИЗ
		|	ID_Ремонтов КАК ID_Ремонтов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_НарядыПоРемонтам КАК торо_НарядыПоРемонтам
		|		ПО ID_Ремонтов.ID_Ремонта = торо_НарядыПоРемонтам.IDРемонта";
		
	ИначеЕсли ИмяТЧ = "НарядыНаМероприятия" Тогда
		
		Запрос.Текст = Запрос.Текст + 
		"////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_Ремонты.Регистратор                КАК Документ,
		|	торо_Ремонты.ID                         КАК ID,
		|	""торо_НарядНаРегламентноеМероприятие"" КАК ТипДокумента
		|ИЗ
		|	ID_Ремонтов КАК ID_Ремонтов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_Ремонты КАК торо_Ремонты
		|		ПО ID_Ремонтов.ID_Ремонта = торо_Ремонты.ID
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(торо_Ремонты.Регистратор) = ТИП(Документ.торо_НарядНаРегламентноеМероприятие)";
		
		
	КонецЕсли; 	
	
	Запрос.УстановитьПараметр("СписокID",ТаблицаВыделенныхСтрок);
	
	РезультаЗапроса = Запрос.Выполнить();
	
	Если Не РезультаЗапроса.Пустой() Тогда
		Если ВыгружатьВМассив Тогда
			Возврат торо_ОбщегоНазначения.РезультатЗапросаВМассивСтруктур(РезультаЗапроса);
		Иначе
			ТабРезультата = Запрос.Выполнить().Выгрузить();
			Возврат ПоместитьВоВременноеХранилище(ТабРезультата, ЭтаФорма.УникальныйИдентификатор);
		КонецЕсли;
	Иначе
		Если ВыгружатьВМассив Тогда
			Возврат Новый Массив;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуКритичности()
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_КритичностьДефекта.Ссылка КАК Критичность
	|ИЗ
	|	Справочник.торо_КритичностьДефекта КАК торо_КритичностьДефекта
	|
	|УПОРЯДОЧИТЬ ПО
	|	торо_КритичностьДефекта.Код";
	
	ЦветПоУмолчанию = Новый Цвет(255,255,255);
	
	Если ТаблицаКритичности.Количество() = 0 Тогда
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		ТаблицаКритичности.Загрузить(РезультатЗапроса);
		
	Иначе 
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() цикл
			Если ТаблицаКритичности.НайтиСтроки(Новый Структура("Критичность", Выборка.Критичность)).Количество() = 0 Тогда
				Нс = ТаблицаКритичности.Добавить();
				Нс.Критичность = Выборка.Критичность;
				Нс.Цвет = ЦветПоУмолчанию;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки()
	
	СохраненнаяНастройка = Новый Структура;
	СохраненнаяНастройка.Вставить("Организация", Объект.Организация);
	СохраненнаяНастройка.Вставить("Исполнитель", Объект.Исполнитель);
	СохраненнаяНастройка.Вставить("ТаблицаКритичности", ТаблицаКритичности.Выгрузить());
	СохраненнаяНастройка.Вставить("РежимВыделенияСтрок", РежимВыделенияСтрок);
	СохраненнаяНастройка.Вставить("ТаблицаПриоритетностиОР", ТаблицаПриоритетностиОР.Выгрузить());
	СохраненнаяНастройка.Вставить("ТаблицаНаработки", ТаблицаНаработки.Выгрузить());
	СохраненнаяНастройка.Вставить("АвтоматическоеОбновление", Объект.АвтоматическоеОбновление);
	СохраненнаяНастройка.Вставить("ПериодОбновления", Объект.ПериодОбновления);
	СохраненнаяНастройка.Вставить("Завершенные", Объект.Завершенные);
	СохраненнаяНастройка.Вставить("ДанныеПоНаработке", Объект.ДанныеПоНаработке);
	СохраненнаяНастройка.Вставить("НеПроведенные", Объект.НеПроведенные);
	СохраненнаяНастройка.Вставить("ВидДаты",Объект.ВидДаты);
	СохраненнаяНастройка.Вставить("ДатаАктуальности", Объект.ДатаАктуальности);
	СохраненнаяНастройка.Вставить("ПлановыйПериод", Объект.ПлановыйПериод);
	СохраненнаяНастройка.Вставить("Периодичность", Объект.Периодичность);
	СохраненнаяНастройка.Вставить("ПодчиненныеПодразделения", Объект.ПодчиненныеПодразделения);
	
	СохраненнаяНастройка.Вставить("сзСтатусОР", сзСтатусОР);
	СохраненнаяНастройка.Вставить("ИспользоватьОтборПоСтатусуДокумента", ИспользоватьОтборПоСтатусуДокумента);
	СохраненнаяНастройка.Вставить("ОтборПоСтатусуДокумента", ОтборПоСтатусуДокумента);
	
	СохраненнаяНастройка.Вставить("ДатаКон", Объект.ДатаКон);
	СохраненнаяНастройка.Вставить("ДатаНач", Объект.ДатаНач);
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("Обработка.торо_РабочееМестоТехническогоСпециалиста", Пользователи.ТекущийПользователь().УникальныйИдентификатор(), СохраненнаяНастройка);
	
КонецПроцедуры

&НаСервере
Функция ВосстановитьНастройки()
	
	ЗначениеНастроек = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("Обработка.торо_РабочееМестоТехническогоСпециалиста", Пользователи.ТекущийПользователь().УникальныйИдентификатор());
	
	Если ТипЗнч(ЗначениеНастроек) = Тип("Структура") Тогда
		
		ЗаполнитьЗначенияСвойств(Объект, ЗначениеНастроек);
		ТаблицаКритичности.Загрузить(ЗначениеНастроек.ТаблицаКритичности);
		ТаблицаНаработки.Загрузить(ЗначениеНастроек.ТаблицаНаработки);
		ТаблицаПриоритетностиОР.Загрузить(ЗначениеНастроек.ТаблицаПриоритетностиОР);
		РежимВыделенияСтрок = ЗначениеНастроек.РежимВыделенияСтрок;
		
		ЗначениеНастроек.Свойство("ИспользоватьОтборПоСтатусуДокумента", ИспользоватьОтборПоСтатусуДокумента);
		ЗначениеНастроек.Свойство("ОтборПоСтатусуДокумента", ОтборПоСтатусуДокумента);
		
		сзТмпСтатусОР = "";
		ЗначениеНастроек.Свойство("сзСтатусОР", сзТмпСтатусОР);
		Если ЗначениеЗаполнено(сзТмпСтатусОР) Тогда
			сзСтатусОР = сзТмпСтатусОР;
		КонецЕсли;
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СоздатьДокументИОткрытьФорму(ИмяФормы, СоответствиеИДДокументам, ОписаниеОповещения = Неопределено)

	ОткрытьФорму(ИмяФормы, Новый Структура("Основание",СоответствиеИДДокументам),ЭтаФорма,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокумент(ИмяФормы, Ссылка, ОписаниеОповещения = Неопределено)

	ОткрытьФорму(ИмяФормы, Новый Структура("Ключ",Ссылка),ЭтаФорма,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборОснованийДляДокумента(Результат, ДопПараметры) Экспорт
	
	Если Не Результат = Неопределено 
		И ДопПараметры.Свойство("СоздаваемыйДокумент") Тогда
		
		СоответствиеИДДокументам = Новый Соответствие;
		Для каждого Элемент Из Результат Цикл
			СоответствиеИДДокументам.Вставить(Элемент.ID_Ремонта, Элемент.Документ);
		КонецЦикла; 
		
		Если ДопПараметры.СоздаваемыйДокумент = "торо_АктОВыполненииЭтапаРабот" Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ВызватьОбработчикОповещения",ЭтаФорма,Новый Структура("ИмяСобытия, Источник", "СозданДокументЧерезРМТехСпец", Тип("ДокументСсылка.торо_АктОВыполненииЭтапаРабот")));
			СоздатьДокументИОткрытьФорму("Документ.торо_АктОВыполненииЭтапаРабот.ФормаОбъекта",СоответствиеИДДокументам, ОписаниеОповещения);
		ИначеЕсли ДопПараметры.СоздаваемыйДокумент = "торо_НарядНаВыполнениеРемонтныхРабот" Тогда 
			ОписаниеОповещения = Новый ОписаниеОповещения("ВызватьОбработчикОповещения",ЭтаФорма,Новый Структура("ИмяСобытия, Источник", "СозданДокументЧерезРМТехСпец", Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот")));
			СоздатьДокументИОткрытьФорму("Документ.торо_НарядНаВыполнениеРемонтныхРабот.ФормаОбъекта",СоответствиеИДДокументам, ОписаниеОповещения);
		ИначеЕсли ДопПараметры.СоздаваемыйДокумент = "торо_АктОВыполненииРегламентногоМероприятия" Тогда 
			ОписаниеОповещения = Новый ОписаниеОповещения("ВызватьОбработчикОповещения",ЭтаФорма,Новый Структура("ИмяСобытия, Источник", "СозданДокументЧерезРМТехСпец", Тип("ДокументСсылка.торо_АктОВыполненииРегламентногоМероприятия")));
			СоздатьДокументИОткрытьФорму("Документ.торо_АктОВыполненииРегламентногоМероприятия.ФормаОбъекта",СоответствиеИДДокументам, ОписаниеОповещения);
		КонецЕсли; 

	КонецЕсли;
	
КонецПроцедуры

&НаСервере 
Процедура ВозвратСпискаСостояний(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 
	Если РезультатЗакрытия <> Неопределено Тогда
		сзСтатусОР = РезультатЗакрытия;
		УстановитьОтборыПоКолонкеСтатусОР();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборыПоКолонкеСтатусОР()
	
	СписокСтатусов = Новый СписокЗначений;
	стр = "";
	Для Каждого текСтат из сзСтатусОР Цикл
		Если текСтат.Пометка Тогда
			СписокСтатусов.Добавить(текСтат.Представление);
			стр = стр + текСтат.Представление + "; ";
		КонецЕсли;
	КонецЦикла;
	СтатусОР = стр;	

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Ремонты.Отбор, "СтатусОР", СписокСтатусов,ВидСравненияКомпоновкиДанных.ВСписке,,ИспользоватьОтборПоСтатусу);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокВыбораОтбораПоСтатусуДокумента()
	
	СписокЗначений = Элементы.ОтборПоСтатусуДокумента.СписокВыбора;
	СписокЗначений.Добавить("Статус не определен");
	СписокЗначений.Добавить(ПредопределенноеЗначение("Перечисление.торо_СтатусыДокументов.Зарегистрирован"));
	СписокЗначений.Добавить(ПредопределенноеЗначение("Перечисление.торо_СтатусыДокументов.ЗапланированоУстранение"));
	СписокЗначений.Добавить(ПредопределенноеЗначение("Перечисление.торо_СтатусыДокументов.Устраняется"));
	СписокЗначений.Добавить(ПредопределенноеЗначение("Перечисление.торо_СтатусыДокументов.Устранен"));
	СписокЗначений.Добавить(ПредопределенноеЗначение("Перечисление.торо_СтатусыДокументов.Отклонен"));
		
КонецПроцедуры

&НаКлиенте
Процедура СохранениеТекущихСтрок()

	Если НЕ СтруктураВыделенныхСтрок = Неопределено Тогда
		
		СтруктураВыделенныхСтрок.Очистить();
		
	КонецЕсли;
	
	СтруктураВыделенныхСтрок = Новый Структура;
	СтруктураТекущихСтрок = Новый Структура;
	
	СписокЭлементов = Новый СписокЗначений;
	
	СписокЭлементов.Добавить("Ремонты");
	СписокЭлементов.Добавить("ЗаявкиНаРемонт");
	СписокЭлементов.Добавить("НарядыНаРемонт");
	СписокЭлементов.Добавить("АктыНаРемонт");
	СписокЭлементов.Добавить("Мероприятия");
	СписокЭлементов.Добавить("НарядыНаМероприятия");
	СписокЭлементов.Добавить("АктыПоМероприятию");
	
	Для каждого ЭлементСписка Из СписокЭлементов Цикл
		
		ВыделенныеСтроки = Элементы[Строка(ЭлементСписка)].ВыделенныеСтроки;

		Если Не ВыделенныеСтроки = Неопределено Тогда
			
			НовыйМассив = Новый Массив;
			
			Для каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
				
				НовыйМассив.Добавить(ВыделеннаяСтрока);
				
			КонецЦикла;
				
			СтруктураВыделенныхСтрок.Вставить(Строка(ЭлементСписка), НовыйМассив);
			
		КонецЕсли;
		
		ТекущаяСтрока = Элементы[Строка(ЭлементСписка)].ТекущаяСтрока;
		
		Если Не ТекущаяСтрока = Неопределено Тогда
			
			СтруктураТекущихСтрок.Вставить(Строка(ЭлементСписка), ТекущаяСтрока);
			
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановлениеТекущихСтрок()

	Если СтруктураТекущихСтрок <> Неопределено Тогда 
		Для каждого ЭлементСтруктуры Из СтруктураТекущихСтрок Цикл
			Элементы[ЭлементСтруктуры.Ключ].ТекущаяСтрока = ЭлементСтруктуры.Значение;
		КонецЦикла;
	КонецЕсли;
	
	Если СтруктураВыделенныхСтрок <> Неопределено Тогда 
		Для каждого ЭлементСтруктуры Из СтруктураВыделенныхСтрок Цикл
				
			Элементы[ЭлементСтруктуры.Ключ].ВыделенныеСтроки.Очистить();
				
			Для каждого ВыделеннаяСтрока Из ЭлементСтруктуры.Значение Цикл
				
				Элементы[ЭлементСтруктуры.Ключ].ВыделенныеСтроки.Добавить(ВыделеннаяСтрока);
				
			КонецЦикла;
				
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВводДокументаНаОсновании(ТипВводимогоДокумента, ПредставлениеДокументаВВинПадеже)
	
	Если ТипВводимогоДокумента = "торо_НарядНаРегламентноеМероприятие"
		ИЛИ ТипВводимогоДокумента = "торо_АктОВыполненииРегламентногоМероприятия" Тогда
		ЭлементФормыТаблица = Элементы.Мероприятия;
	Иначе
		ЭлементФормыТаблица = Элементы.Ремонты;
	КонецЕсли;
	
	МассивДанныхСтрок = Новый Массив;
	Если НЕ ОбязательныеПроверкиПередВводомНаОсновании(ЭлементФормыТаблица, МассивДанныхСтрок) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТаблицуВводаНаОсновании();
	
	МассивРемонтовППР = Новый Массив;
	Для каждого Строка Из МассивДанныхСтрок Цикл
		Если ТипЗнч(Строка.Документ) = Тип("ДокументСсылка.торо_ПланГрафикРемонта")
			ИЛИ ТипЗнч(Строка.Документ) = Тип("ДокументСсылка.торо_ГрафикРегламентныхМероприятийТОиР") Тогда
			МассивРемонтовППР.Добавить(Строка.ID_Ремонта);
		КонецЕсли;
	КонецЦикла;
	
	СоответствиеКорректировокППР = Новый Соответствие;
	Если МассивРемонтовППР.Количество() > 0 Тогда
		ЗаполнитьСоответствиеКорректировокППР(МассивРемонтовППР, СоответствиеКорректировокППР);
	КонецЕсли;
	
	СоответствиеРемонтовИОснований = Новый Соответствие;
	
	// Добавление возможных оснований.
	Для каждого Строка Из МассивДанныхСтрок Цикл
		Если ПроверитьВводНаОсновании(Строка.ТипДокумента, ТипВводимогоДокумента) Тогда
			КорректировкаППР = СоответствиеКорректировокППР.Получить(Строка.ID_Ремонта);
			Если КорректировкаППР = Неопределено Тогда
				ВставитьЗначениеВСписокВСоответствии(СоответствиеРемонтовИОснований, Строка.ID_Ремонта, Строка.Документ);
			Иначе
				ВставитьЗначениеВСписокВСоответствии(СоответствиеРемонтовИОснований, Строка.ID_Ремонта, КорректировкаППР);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
	Если ПроверитьВводНаОсновании("торо_ЗаявкаНаРемонт", ТипВводимогоДокумента) И ФОИспользоватьСметы Тогда
		
		ТаблицаЗаявок = ПолучитьСвязанныеДокументыПОID(МассивДанныхСтрок, "ЗаявкиНаРемонт", Истина);
		Для каждого Строка из ТаблицаЗаявок Цикл
			ВставитьЗначениеВСписокВСоответствии(СоответствиеРемонтовИОснований, Строка.ID, Строка.Документ);
		КонецЦикла;
		
	КонецЕсли;
	
	Если ПроверитьВводНаОсновании("торо_НарядНаВыполнениеРемонтныхРабот", ТипВводимогоДокумента) И ФОИспользоватьНаряды Тогда
		
		ТаблицаНарядов = ПолучитьСвязанныеДокументыПОID(МассивДанныхСтрок, "НарядыНаРемонт", Истина);
		Для каждого Строка из ТаблицаНарядов Цикл
			ВставитьЗначениеВСписокВСоответствии(СоответствиеРемонтовИОснований, Строка.ID, Строка.Документ);
		КонецЦикла;
		
	КонецЕсли;
	
	Если ПроверитьВводНаОсновании("торо_НарядНаРегламентноеМероприятие", ТипВводимогоДокумента) И ФОИспользоватьНарядыНаРегламентныеМероприятия Тогда
		
		ТаблицаНарядов = ПолучитьСвязанныеДокументыПОID(МассивДанныхСтрок, "НарядыНаМероприятия", Истина);
		Для каждого Строка из ТаблицаНарядов Цикл
			ВставитьЗначениеВСписокВСоответствии(СоответствиеРемонтовИОснований, Строка.ID, Строка.Документ);
		КонецЦикла;
		
	КонецЕсли;
	
	Если НЕ ДляВсехРемонтовЕстьОснование(МассивДанныхСтрок, СоответствиеРемонтовИОснований, ПредставлениеДокументаВВинПадеже) Тогда
		Возврат;
	КонецЕсли;

	Если СоответствиеРемонтовИОснований.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Проверим, нужно ли открывать форму выбора основания.
	ОткрыватьФормуВыбораОснования = Ложь;
	Для каждого КлючИЗначение из СоответствиеРемонтовИОснований Цикл
		Если КлючИЗначение.Значение.Количество() > 1 Тогда
			ОткрыватьФормуВыбораОснования = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ОткрыватьФормуВыбораОснования Тогда
		
		Оповещение = Новый ОписаниеОповещения("ВыборОснованийДляДокумента",ЭтаФорма,Новый Структура("СоздаваемыйДокумент", ТипВводимогоДокумента));
		
		СтруктураДанныхДляВыбораОснований = Новый Структура;
		СтруктураДанныхДляВыбораОснований.Вставить("СоответствиеРемонтовИОснований" , СоответствиеРемонтовИОснований);
		СтруктураДанныхДляВыбораОснований.Вставить("МассивВыделенныхСтрок" , МассивДанныхСтрок);
		
		ОткрытьФорму("Обработка.торо_РабочееМестоТехническогоСпециалиста.Форма.ФормаВыбораОснования",СтруктураДанныхДляВыбораОснований,ЭтаФорма,,ВариантОткрытияОкна.ОтдельноеОкно,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВызватьОбработчикОповещения",ЭтаФорма,Новый Структура("ИмяСобытия, Источник", "СозданДокументЧерезРМТехСпец", Тип("ДокументСсылка."+ТипВводимогоДокумента)));
		
		СоответствиеИДДокументам = Новый Соответствие;
		Для каждого КлючИЗначение Из СоответствиеРемонтовИОснований Цикл
			Если КлючИЗначение.Значение.Количество() > 0 Тогда
				СоответствиеИДДокументам.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение[0]);
			КонецЕсли;
		КонецЦикла; 
		
		СоздатьДокументИОткрытьФорму("Документ."+ТипВводимогоДокумента+".ФормаОбъекта", СоответствиеИДДокументам, ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьОстановочныеРемонтыИЗакрытия(Массив)
	
	Для Каждого Строка Из Массив Цикл
		Если ТипЗнч(Строка.Документ) = Тип("ДокументСсылка.торо_ЗакрытиеЗаявокИРемонтов") Тогда
			Строка.Документ = Строка.Документ.ЗакрываемыеРемонты.Найти(Строка.ID_Ремонта, "ID").ДокументОснование;	
		ИначеЕсли ТипЗнч(Строка.Документ) = Тип("ДокументСсылка.торо_ОстановочныеРемонты") Тогда
			Если Строка.ID_Ремонта = Строка.Документ.IDОсновногоРемонта Тогда
				Источник = Строка.Документ.ДокументОснование;
			Иначе
				Источник = Строка.Документ.СвязанныеРемонты.Найти(Строка.ID_Ремонта, "ID").ДокументИсточник;
			КонецЕсли;
			Если ТипЗнч(Источник) = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") Тогда
				// Заявку обработаем позже, в ВыполнитьВводДокументаНаОсновании.
				Строка.Документ = Источник.РемонтыОборудования.Найти(Строка.ID_Ремонта, "ID").ДокументИсточник;
			Иначе	
				Строка.Документ = Источник;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ОбязательныеПроверкиПередВводомНаОсновании(ЭлементФормыТаблица, МассивДанныхСтрок)

	ТекДанные = ЭлементФормыТаблица.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Выберите ремонт!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецЕсли;
	
	МассивВыделенныхСтрок = ПолучитьМассивВыделенныхСтрокРемонтов(ЭлементФормыТаблица);
	
	ОбработатьОстановочныеРемонтыИЗакрытия(МассивВыделенныхСтрок);
	
	КолЗавершенных = 0;
	
	Для Каждого Строка Из МассивВыделенныхСтрок Цикл
		
		Если ЗначениеЗаполнено(Строка.Завершенные) Тогда
			Если ТипЗнч(Строка.Завершенные) = Тип("Строка")или Строка.Завершенные  Тогда
				КолЗавершенных = КолЗавершенных + 1;
			Иначе
				Структура = Новый Структура("ОбъектРемонта, ВидРемонта, ПланируемаяДатаНачалаРемонта, ID_Ремонта, Документ, ТипДокумента"
				, Строка.ОбъектРемонта
				, Строка.ВидРемонта
				, Строка.ПланируемаяДатаНачалаРемонта
				, Строка.ID_Ремонта
				, Строка.Документ
				, Строка.ТипДокумента);
				МассивДанныхСтрок.Добавить(Структура);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если КолЗавершенных > 0 Тогда
		ТекстСообщения = НСтр("ru = 'В списке выбранных ремонтов есть завершенные!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция ДляВсехРемонтовЕстьОснование(МассивДанныхСтрок, СоответствиеРемонтовИОснований, ПредставлениеДокументаДляПользователя)
	
	// Проверим, по всем ли ремонтам нашлось хотя бы одно основание.
	МассивДокументовБезОснований = Новый Массив;
	Для каждого Строка Из МассивДанныхСтрок Цикл
		МассивОснований = СоответствиеРемонтовИОснований[Строка.ID_Ремонта];
		Если МассивОснований = Неопределено И МассивДокументовБезОснований.Найти(Строка.Документ) = Неопределено Тогда
			МассивДокументовБезОснований.Добавить(Строка.Документ);                                
		КонецЕсли;
	КонецЦикла; 
	
	Если МассивДокументовБезОснований.Количество() > 0 Тогда
		Если МассивДанныхСтрок.Количество() = 1 Тогда
			ШаблонСообщения = НСтр("ru = 'Настроки ввода на основании запрещают ввести %1 на основании выбранного документа.
			|Настройка и администрирование -> Настройка параметров подсистемы ТОиР -> Интрерфейс и ввод документов -> Настройка ввода на основании.'");
		ИначеЕсли МассивДанныхСтрок.Количество() > 1 Тогда
			ШаблонСообщения = НСтр("ru = 'Настроки ввода на основании запрещают ввести %1 на основании некоторых выбранных документов.
			|Настройка и администрирование -> Настройка параметров подсистемы ТОиР -> Интрерфейс и ввод документов -> Настройка ввода на основании.'");
		КонецЕсли;
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ПредставлениеДокументаДляПользователя);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;
	
КонецФункции

&НаКлиентеНасервереБезКонтекста
Процедура ВставитьЗначениеВСписокВСоответствии(Соответствие, Ключ, Значение)
	
	ТекущееЗначение = Соответствие[Ключ];
	Если ТекущееЗначение = Неопределено Тогда
		ТекущееЗначение = Новый Массив;
	КонецЕсли;
	
	ТекущееЗначение.Добавить(Значение);
	
	Соответствие.Вставить(Ключ, ТекущееЗначение);	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораДоговора()
	
	МассивСвязей = Новый Массив;
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		
		Если ЗначениеЗаполнено(Объект.Договор) И Объект.Договор.Контрагент <> Объект.Контрагент Тогда
	 		Объект.Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		КонецЕсли;
		
		МассивСвязей.Добавить(Новый СвязьПараметраВыбора("Отбор.Контрагент", "Объект.Контрагент", РежимИзмененияСвязанногоЗначения.НеИзменять));
	КонецЕсли;
	
	Элементы.Договор.СвязиПараметровВыбора = Новый ФиксированныйМассив(МассивСвязей);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораБригады()
	
	МассивСвязей = Новый Массив;
	
	Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
		
		Если ЗначениеЗаполнено(Объект.Бригада) И Объект.Бригада.Подразделение <> Объект.Подразделение Тогда
			Объект.Бригада = Справочники.торо_РемонтныеБригады.ПустаяСсылка();
		КонецЕсли; 
	 
		МассивСвязей.Добавить(Новый СвязьПараметраВыбора("Отбор.Подразделение", "Объект.Подразделение", РежимИзмененияСвязанногоЗначения.НеИзменять));
		
	КонецЕсли;
	
	Элементы.Бригада.СвязиПараметровВыбора = Новый ФиксированныйМассив(МассивСвязей);
	
	
КонецПроцедуры

&НаКлиенте 
Процедура УстановитьОтборыПоАдресацииЗаявок()

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ремонты, "Исполнитель",	Неопределено,ВидСравненияКомпоновкиДанных.Равно,,Ложь, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ремонты, "Бригада",	Неопределено,,,Ложь, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ремонты, "СпособВыполнения", Неопределено,,,Ложь, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ремонты, "ВведенаЗаявка", Неопределено,,,Ложь, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
	Если Объект.ИспользоватьОтборПоПодразделениюИсполнителю Тогда
		
		ПустыеИсполнители = Новый Массив;
		ПустыеИсполнители.Добавить(Неопределено);
		ПустыеИсполнители.Добавить(ПредопределенноеЗначение("Справочник.СтруктураПредприятия.ПустаяСсылка"));
		
		Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ремонты, "Исполнитель", 
					Объект.Подразделение, ВидСравненияКомпоновкиДанных.Равно,,
					Объект.ИспользоватьОтборПоПодразделениюИсполнителю, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		Иначе
			
			ГруппаОтбораИли = Ремонты.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаОтбораИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИЛИ;
			
			ГруппаОтбораВД = ГруппаОтбораИли.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаОтбораВД.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
			
			ЭлементОтбора = ГруппаОтбораВД.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Исполнитель");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = ПредопределенноеЗначение("Справочник.СтруктураПредприятия.ПустаяСсылка");
			ЭлементОтбора.Использование = Объект.ИспользоватьОтборПоПодразделениюИсполнителю;
			
			ЭлементОтбора = ГруппаОтбораВД.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВведенаЗаявка");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = Ложь;
			ЭлементОтбора.Использование = Объект.ИспользоватьОтборПоПодразделениюИсполнителю;
			
			ГруппаОтбораППР = ГруппаОтбораИли.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаОтбораППР.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
			
			ЭлементОтбора = ГруппаОтбораППР.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Исполнитель");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = Неопределено;
			ЭлементОтбора.Использование = Объект.ИспользоватьОтборПоПодразделениюИсполнителю;
			
			ЭлементОтбора = ГруппаОтбораППР.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВведенаЗаявка");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = Истина;
			ЭлементОтбора.Использование = Объект.ИспользоватьОтборПоПодразделениюИсполнителю;
			
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ИспользоватьОтборПоБригаде Тогда	
		ПустыеБригады = Новый Массив;
		ПустыеБригады.Добавить(Неопределено);
		ПустыеБригады.Добавить(ПредопределенноеЗначение("Справочник.торо_РемонтныеБригады.ПустаяСсылка"));

		Если ЗначениеЗаполнено(Объект.Бригада) Тогда
		   ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ремонты, "Бригада", 
					Объект.Бригада,ВидСравненияКомпоновкиДанных.Равно,,
					Объект.ИспользоватьОтборПоБригаде, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		Иначе
		   ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ремонты, "Бригада", 
					ПустыеБригады,ВидСравненияКомпоновкиДанных.ВСписке,,
					Объект.ИспользоватьОтборПоБригаде, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		   ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ремонты, "СпособВыполнения", 
					ПредопределенноеЗначение("Перечисление.СпособыСтроительства.Хозспособ"), ВидСравненияКомпоновкиДанных.Равно,,
					Объект.ИспользоватьОтборПоБригаде, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ИспользоватьОтборПоКонтрагенту Тогда
		ПустыеИсполнители = Новый Массив;
		ПустыеИсполнители.Добавить(Неопределено);
		ПустыеИсполнители.Добавить(ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка"));
		
		Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ремонты, "Исполнитель", 
					Объект.Контрагент, ВидСравненияКомпоновкиДанных.Равно,,
					Объект.ИспользоватьОтборПоКонтрагенту, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ремонты, "Исполнитель", 
					ПустыеИсполнители, ВидСравненияКомпоновкиДанных.ВСписке,,
					Объект.ИспользоватьОтборПоКонтрагенту, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ИспользоватьОтборПоДоговору Тогда
		ПустыеДоговора = Новый Массив;
		ПустыеДоговора.Добавить(Неопределено);
		ПустыеДоговора.Добавить(ПредопределенноеЗначение("Справочник.ДоговорыКонтрагентов.ПустаяСсылка"));
		
		Если ЗначениеЗаполнено(Объект.Договор) Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ремонты, "Бригада", 
					Объект.Договор,ВидСравненияКомпоновкиДанных.Равно,,
					Объект.ИспользоватьОтборПоДоговору, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);		
		Иначе	
		    ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ремонты, "Бригада", 
					ПустыеДоговора,ВидСравненияКомпоновкиДанных.ВСписке,,
					Объект.ИспользоватьОтборПоДоговору, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		    ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Ремонты, "СпособВыполнения", 
					ПредопределенноеЗначение("Перечисление.СпособыСтроительства.Подрядный"), ВидСравненияКомпоновкиДанных.Равно,,
					Объект.ИспользоватьОтборПоДоговору, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьСоответствиеКорректировокППР(МассивРемонтовППР, СоответствиеКорректировокППР)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ПлановыеМероприятияСрезПоследних.ID КАК ID,
	|	торо_ПлановыеМероприятияСрезПоследних.Регистратор КАК Документ
	|ИЗ
	|	РегистрСведений.торо_ПлановыеМероприятия.СрезПоследних(, ID В (&МассивID)) КАК торо_ПлановыеМероприятияСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ID,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Регистратор
	|ИЗ
	|	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(
	|			,
	|			ID В (&МассивID)
	|				И Регистратор ССЫЛКА Документ.торо_ПланГрафикРемонта) КАК торо_ПлановыеРемонтныеРаботыСрезПоследних";
	
	Запрос.УстановитьПараметр("МассивID", МассивРемонтовППР);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СоответствиеКорректировокППР.Вставить(Выборка.ID, Выборка.Документ);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти