////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы ТОиР
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Сведения о библиотеке (или конфигурации).

// Заполняет основные сведения о библиотеке или основной конфигурации.
// Библиотека, имя которой имя совпадает с именем конфигурации в метаданных, определяется как основная конфигурация.
// 
// Параметры:
//  Описание - Структура - сведения о библиотеке:
//
//   * Имя                 - Строка - имя библиотеки, например, "СтандартныеПодсистемы".
//   * Версия              - Строка - версия в формате из 4-х цифр, например, "2.1.3.1".
//
//   * ТребуемыеПодсистемы - Массив - имена других библиотек (Строка), от которых зависит данная библиотека.
//                                    Обработчики обновления таких библиотек должны быть вызваны ранее
//                                    обработчиков обновления данной библиотеки.
//                                    При циклических зависимостях или, напротив, отсутствии каких-либо зависимостей,
//                                    порядок вызова обработчиков обновления определяется порядком добавления модулей
//                                    в процедуре ПриДобавленииПодсистем общего
//									  модуля ПодсистемыКонфигурацииПереопределяемый.
//
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	
	Описание.Имя    = "ТехническоеОбслуживаниеИРемонты20";
	Описание.Версия = "2.0.26.1";
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики обновления информационной базы.

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
// Параметры:
//  Обработчики - ТаблицаЗначений - описание полей, см. в процедуре
//                ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления.
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт                                              
	
	#Область Релиз_1_2051
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "1.0.0.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ЗаполнитьПредопределенныеВидыКонтактнойИнформацииФизЛиц";
	ОбработчикОбновления.НачальноеЗаполнение = Истина;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Заполнение видов контактной информации физических лиц...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.2.2";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ЗаполнитьОбъектыКонфигурацииДляПользовательскогоПредставления";
	ОбработчикОбновления.НачальноеЗаполнение = Истина;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Заполнение списка объектов конфигурации для пользовательских представлений...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.2.4";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ЗаполнениеСтатусовДокументов";
	ОбработчикОбновления.НачальноеЗаполнение = Истина;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Заполнение статусов документов...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.2.4";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ЗаполнениеСтатусовТехКарт";
	ОбработчикОбновления.НачальноеЗаполнение = Истина;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Заполнение статусов технологических карт...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.2.4";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ЗаполнениеСтатусовНормативныхРемонтовТиповыхОР";
	ОбработчикОбновления.НачальноеЗаполнение = Истина;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Заполнение статусов нормативных ремонтов типовых объектов ремонта...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.2.5";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ЗаполнитьНовыеРеквизитыВСправочникеТехКарты";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Заполнение новых реквизитов в справочнике ""Версии технологических карт ремонтов""";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.2.5";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ЗаполнитьКоличествоВДок_НарядНаРегламентноеМероприятие";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Заполнение новых реквизитов в документе ""Наряд на регламентное мероприятие""";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.2.5";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ДобавитьЗаписиВРСФИОФизЛиц";
	ОбработчикОбновления.НачальноеЗаполнение = Истина;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление данных в регистре сведений ""ФИОФизическихЛиц""";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.4.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ЗаполнитьПредопределенныеДанныеСценарияРаботы";
	ОбработчикОбновления.НачальноеЗаполнение = Истина;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Заполнение данных в предопределенном элементе справочника ""Предопределенные сценарии работы системы""";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.5.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.УдалитьДублиПоказателейНаработкиТиповыхОР";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление данных в регистре сведений ""торо_ПараметрыНаработкиОбъектовРемонта""";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.5.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ПереносСтатусовСогласованияДокументовВРегистры";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление механизма согласования документов";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.5.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ЗаполнитьРегистр_ПорядокОРПоИерархии";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление данных в регистре сведений ""Порядок ОР по иерархии"".";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.5.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ЗаполнитьРегистр_ОбъектыРемонтаГруппы";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление данных в регистре сведений ""Объекты ремонта группы"".";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.5.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ОбновитьДатыВыбытияВРегистре_торо_СтатусыОбъектовРемонтаВУчете";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление данных в регистре сведений ""Статусы объектов ремонта в учете"" по датам выбытия.";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.5.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ОбновитьДатыВыбытияВРегистре_торо_РегламентныеМероприятияИСпискиОбъектов";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление данных в регистре сведений ""Регламентные мероприятия и списки объектов"" по cпособe учета даты отсчета.";
	#КонецОбласти
	
	#Область Релиз_2061_2091
	
	// Обработчики из версии 2.0.2.3 перенесены в 2.0.5.1, поскольку
	// они не были вызваны ранее вообще, на демо-базе не выполнялись.
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.6.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ОбновитьКоличествоВТехКартах";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление тех. карт...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.6.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ПерезаписатьВидыРемонта";
	ОбработчикОбновления.НачальноеЗаполнение = Истина;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Перезапись флагов отбора для видов ремонта...";	
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.6.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.СформироватьДвиженияРегламентныхАктовПоРегиструФактическиеМатериальныеЗатратыРемонтныхРабот";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Формирование движений документов ""Акт о выполнении регламентного мероприятия"" по регистру фактических материальных затрат...";	
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.7.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.СформироватьДвиженияРегламентныхАктовПоРегиструФактическиеТрудовыеЗатратыРемонтныхРабот";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Формирование движений документов ""Акт о выполнении регламентного мероприятия"" по регистру фактических трудовых затрат...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.7.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.УстановитьПараметрыНаборовСвойств";
	ОбработчикОбновления.НачальноеЗаполнение = Истина;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление параметров наборов дополнительных свойств...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.7.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ОбновлениеДокументовЦелевыхЗначенийПоказателейKPI";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление установки целевых значений показателей KPI...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.7.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ЗагрузитьПоставляемуюМодельПоказателейKPI";
	ОбработчикОбновления.НачальноеЗаполнение = Истина;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Загрузка поставляемой модели показателей KPI...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.7.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.УстановитьОсновныеПоказателиНаработки";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Установка основных показателей наработки...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.7.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ОбнвлениеРегистра_ЗаказыНаРемонтВЕРП";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление регистра ...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.8.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ДозаполнениеРегистра_ВыявленныеДефекты";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление регистра ...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.8.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ЗаполнитьСвойстваВидовКонтактнойИнформации";
	ОбработчикОбновления.НачальноеЗаполнение = Истина;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление регистра ...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.8.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ЗаполнениеНастройки_ИерархияДляМобильногоПриложения";
	ОбработчикОбновления.НачальноеЗаполнение = Истина;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Заполнение настроек ...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.9.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ОбновлениеСправочника_КвалификацииРемонтногоПерсонала";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Заполнение кодов квалификаций ...";

	#КонецОбласти
	
	#Область Релиз_20101_20151
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.10.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ЗаписьНастроекПодключенияКСерверуСЛК";
	ОбработчикОбновления.НачальноеЗаполнение = Истина;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Запись настроек подключения к серверу СЛК ...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.10.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.УстановитьПараметрыНаборовСвойствДокументов";
	ОбработчикОбновления.НачальноеЗаполнение = Истина;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление параметров наборов дополнительных свойств...";

	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.10.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ОбновлениеСправочникаТехнологическихКарт";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление справочника технологических карт...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.10.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ОбновлениеДокументовЗакрытияЗаявокИРемонтов";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление документов закрытия заявок и ремонтов...";

	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.11.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ОбновлениеУпорядочиванияОбъектовРемонта";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление упорядочивания объектов ремонта...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.11.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ЗаполнениеРегистровУстановленныхСтатусовДокументов";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Заполнение регистров установленных статусов документов...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.11.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ЗаменаСпособаУчетаДатыОтсчетаРемонтныхРаботПоПоследнемуРемонту";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление способа учета даты отсчета ремонтных работ ""По последнему ремонту""...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.11.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ЗаполнениеТЧМероприятияОбъектовВДокументахНарядыИАктыРегМероприятий";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Заполнение таб. части ""Список объектов"" в Нарядах и Актах регламентных мероприятий.";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.11.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ОбновлениеЗначенияИспользованиеХарактеристикНоменклатуры";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление значения ИспользованиеХарактеристик элементов справочника Номенклатура...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.11.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.УстановкаКонстантыФОИспользоватьППРИОтменуРемонтов";
	ОбработчикОбновления.НачальноеЗаполнение = Истина;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Установка константы для функциональной опции ""Использовать ППР и отмену ремонтов""... ";

	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.11.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ОбновитьРегистр_торо_ПлановыеМероприятия";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Заполнение в регистре сведений ""Плановые мероприятия"" нового ресурса ""Способ выполнения"".";

	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.11.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ЗаполнитьСвойстваВидовКонтактнойИнформации";
	ОбработчикОбновления.НачальноеЗаполнение = Истина;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление регистра ...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.12.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.УдалениеБитыхСсылокИзНастроекРМТехСпециалиста";
	ОбработчикОбновления.НачальноеЗаполнение = Истина;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление регистра ...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.12.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ИсправлениеЗначенийРеквизитовСправочникаОбъектыРемонта";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление реквизитов справочника объекты ремонта ...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.13.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ОбновлениеПВХГраницыДопустимыхЗначений";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление границ допустимых значений ПВХ ...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.13.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.СформироватьДвиженияРегламентныхАктовПоРегиструЗатратыПоИсполнителямВыполненныхРемонтов";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Формирование движений документов ""Акт о выполнении регламентного мероприятия"" по регистру ""Затраты по исполнителям выполненных ремонтов"" ...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.13.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.СформироватьЗановоДвиженияВнешнихОснованийПоРегиструОперацийВнешнихОснований";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Формирование движений документов ""Внешние основания для работ"" по регистру ""Операции внешних оснований"" ...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.13.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.СформироватьЗановоДвиженияАктовПоРегиструФактическихТрудовыхЗатратРемонтныхРабот";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Формирование движений документов ""Акт о выполнении этапа работ"" по регистру ""Фактические трудовые затраты ремонтных работ"" ...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.13.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.СформироватьДвиженияПоРегиструВнешнихОснованийДляРабот";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Формирование движений документов по регистру ""Внешние основания для работ"" ...";

	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.13.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ДобавитьДокументыИзВнешнихОснованийВДокументыОснования";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Добавление документов с вкладки ""Внешние основания для работ"" на вкладку ""Документы-основания"" ...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.14.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.СформироватьЗановоДвиженияПоРегиструВнешнихОснованийДляРабот";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Формирование движений документов по регистру ""Внешние основания для работ"" ...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.14.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.УбратьЛишниеЗаписиИПереформироватьДвиженияДокументаУстановкаКоэффициентовРемонтныхОсобенностей";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Формирование движений документов по регистру ""Коэффициенты ремонтных особенностей"" ...";

	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.14.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ОбновитьРегистр_торо_ПлановыеМероприятия20141";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление регистра сведений ""Плановые мероприятия"" ...";

	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.14.1";
	ОбработчикОбновления.Процедура           = "Справочники.Организации.ЗаполнитьКонстантуИспользоватьНесколькоОрганизаций";
	ОбработчикОбновления.НачальноеЗаполнение = Истина;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Заполнение значения константы ""Использовать несколько организаций"" ...";

	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.14.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ЗаполнитьВидыЦенВУстановкеЦенНоменклатуры";
	ОбработчикОбновления.НачальноеЗаполнение = Истина;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Заполнение таблицы видов цен в документах ""Установка цен номенклатуры"" ...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.14.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.УстановитьПараметрыНабораСвойствСправочникаВидыРемонта";
	ОбработчикОбновления.НачальноеЗаполнение = Истина;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление параметров наборов дополнительных свойств...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.15.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ОбновитьДанныеРегистраМинимальныеОстаткиНоменклатуры";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление записей регистра сведений ""торо_МинимальныеОстаткиНоменклатуры""...";

	#КонецОбласти
	
	#Область Релиз_20161_20191
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.16.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ОбновитьДанныеРегистраИсторияЗапчастейОбъектаРемонта";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление записей регистра сведений ""торо_ИсторияЗапчастейОбъектаРемонта""...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.16.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ОбновитьНаименованияПрикреплённыхФотографийИзМобильногоПриложения";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление наименований прикреплённых фотографий из мобильного приложения...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.16.3";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ОбновитьРегистрЗапланированныеМероприятияОбъектов";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление заполнения регистра запланированных мероприятий объектов...";	
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.16.3";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ОбновлениеСправочникаТехнологическихКарт";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление справочника технологических карт...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.16.3";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ОбновлениеСправочникаУсловияВыявленияДефектов";
	ОбработчикОбновления.НачальноеЗаполнение = Истина;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление справочника условия выявления дефектов...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.17.0";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ЗаполнитьОбъектыКонфигурацииДляПользовательскогоПредставления";
	ОбработчикОбновления.НачальноеЗаполнение = Истина;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Заполнение списка объектов конфигурации для пользовательских представлений...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.17.0";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ОбновитьРегистрПараметрыЗамещенияПланированияРемонтныхРабот";
	ОбработчикОбновления.НачальноеЗаполнение = Истина;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление регистра ""Параметры замещения планирования ремонтных работ""...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия 			 = "2.0.18.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ОбновитьРегистрНастройкиУведомлений";
	ОбработчикОбновления.НачальноеЗаполнение = Истина;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление регистра ""Настройки уведомлений""...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия 			 = "2.0.18.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ОбновитьРегистрИсторияЗапчастейОбъектаРемонта";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление регистра ""История запчастей объекта ремонта""...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия 			 = "2.0.18.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ОбновитьРегистрОтмененныеЗаявки";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление регистра ""Отмененные заявки""...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия 			 = "2.0.19.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ПроставитьФлагиКонечныеЭлементыВДереве";
	ОбработчикОбновления.НачальноеЗаполнение = Истина;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление справочника ""Структуры иерархии объектов ремонта""...";
	
	#КонецОбласти
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия 			 = "2.0.20.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ПроставитьФлагНапоминатьЗафиксироватьПростой";
	ОбработчикОбновления.НачальноеЗаполнение = Истина;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Установка константы ""Напоминать о необходимости зафиксировать простой при вводе документов""...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия 			 = "2.0.21.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.УдалениеИДКорректировок_РегистрПлановыеРемонтныеРаботы";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление регистра ""Плановые ремонтные работы""...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия 			 = "2.0.21.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.СнятьФлагиКонечныеЭлементыВДереве";
	ОбработчикОбновления.НачальноеЗаполнение = Истина;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление справочника ""Структуры иерархии объектов ремонта""...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия 			 = "2.0.21.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.СформироватьДвиженияПоРегиструПроцентыВыполненияРемонтныхРабот";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Формирование движений по регистру ""Проценты выполнения работ""...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия 			 = "2.0.21.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.СоздатьДокументыПлановыхЗатрат";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Создание документов ""Плановые затраты""...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.21.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ЗаполнитьПредопределенныеВидыКонтактнойИнформацииОР";
	ОбработчикОбновления.НачальноеЗаполнение = Истина;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Заполнение видов контактной информации объекта ремонта...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.21.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ЗаполнитьПорядокПредопределенныхКритичностейДефектов";
	ОбработчикОбновления.НачальноеЗаполнение = Истина;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Заполнение порядка критичностей дефектов...";

	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.22.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.УдалениеИДКорректировок_РегистрПлановыеМероприятия";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление регистра ""Плановые мероприятия""...";

	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.22.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ПерезаполнитьРегистрПлановыхРемонтовОстановочными";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление регистра сведений ""Плановые ремонтые работы"" остановочными ремонтами...";

	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.22.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.УдалениеИДКорректировок_РегистрОстановочныеРемонты";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление регистра ""Остановочные ремонты""...";

	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.22.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.СформироватьДвиженияПоРегиструПроцентыВыполненияРемонтныхРабот";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление регистра ""Проценты выполнения работ""...";	
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.22.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.УдалитьОстановочныеИзРегистраЗаявкиПоРемонтам";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Удаление остановочных ремонтов из регистра сведений ""торо_ЗаявкиПоРемонтам""...";	
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.22.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ЗаполнитьИсполнителейВРегистреЗаявкиПоРемонтам";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Заполнение исполнителей в регистре сведений ""торо_ЗаявкиПоРемонтам""...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.22.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ЗаполнитьИерархиюВДокументахЖЦ";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Заполнение иерархии в документах Принятие объекта ремонта к учету и Выбытие объекта ремонта""...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.22.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ОбновлениеРегистраОтмененныеЗаявки";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Заполнение ремонтов и причин закрытия заявок в регистре сведений ""Отмененные заявки""...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.22.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ОбновлениеИсполнителейВДокументахЗаявки";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление исполнителей в документах ""Заявка на ремонт""...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.22.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ОбновлениеИсполнителейВДокументахНаряды";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление исполнителей в документах ""Наряд на выполнение ремонтных работ""...";

	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.22.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ОбновлениеИсполнителейВДокументахАкты";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление исполнителей в документах ""Акт о выполнении ремонтных работ""...";

	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.23.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ОбновитьКоличествоВЗаявках";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление количества операций в документах ""Заявка на ремонт""...";

	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.23.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ПеренестиИсполнителейПоРемонтамВЗаявках";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление исполнителей в документах ""Заявка на ремонт""...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.23.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ОбновлениеЗакрываемыхПредписанийВЗаявках";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление закрываемых предписаний в документах ""Заявка на ремонт""...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.23.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ОбновлениеЗакрываемыхПредписанийВАктах";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление закрываемых предписаний в документах ""Акт о выполнении этапа работ""...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.23.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ОбновлениеЗакрываемыхПредписанийВНарядах";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление закрываемых предписаний в документах ""Наряд на выполнение ремонтных работ""...";

	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.24.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ЗаполнениеВидовСкользящихПланов";
	ОбработчикОбновления.НачальноеЗаполнение = Истина;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Заполнение справочника ""Виды скользящих планов""...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.24.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ОбновлениеРегистраНакопленияВремяНахожденияВСостоянии";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление регистра накопления ""Время нахождения в состоянии""...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.24.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ОбновлениеДокументовПлановыхЗатрат";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление документов ""Плановые затраты""...";

	// Заполнение регистра торо_АктуальныеПлановыеДатыРемонтов.
	// В релизе 2.0.25.1 был отложенным с идентификатором "1112d525-24a2-4680-98ac-d328c8348aed".
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.26.1";
	ОбработчикОбновления.Процедура           = "торо_ПланированиеРемонтов.ЗаполнитьРегистрАктуальныхПлановыхДат_ВОиВД";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Заполнение регистра сведений ""Актуальные плановые даты ремонтов"" по данным ремонтов на основании выявленных дефектов и внешних оснований.";
	
	// В релизе 2.0.25.1 был отложенным с идентификатором "0a46ab6c-4f6f-4abd-8376-cf898e929361".
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.26.1";
	ОбработчикОбновления.Процедура           = "торо_ПланированиеРемонтов.ЗаполнитьРегистрАктуальныхПлановыхДат_ППР";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Заполнение регистра сведений ""Актуальные плановые даты ремонтов"" по данным ремонтов на основании графиков ППР.";
	
	// В релизе 2.0.25.1 был отложенным с идентификатором "cfb70e98-e8f9-4247-95cb-3223642398a8".
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.26.1";
	ОбработчикОбновления.Процедура           = "торо_ПланированиеРемонтов.ЗаполнитьРегистрАктуальныхПлановыхДат_ГрафикиРМ";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Заполнение регистра сведений ""Актуальные плановые даты ремонтов"" по данным ремонтов на основании графиков регламентных мероприятий.";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.25.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ОбновлениеРегистраСоставИерархическихТКРемонтов";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление регистра сведений ""Состав иерархических тех карт ремонтов""...";
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.26.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ПометкаНаУдалениеНаборовДопРеквизитовОР";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Отложенно";
	ОбработчикОбновления.Комментарий         = "Пометка на удаление индивидуальных наборов дополнительных реквизитов объектов ремонта";
	ОбработчикОбновления.Идентификатор = Новый УникальныйИдентификатор("2f2337ff-55d2-40ce-ad53-b961b133ee6b");
	
	ОбработчикОбновления = Обработчики.Добавить();
	ОбработчикОбновления.Версия              = "2.0.26.1";
	ОбработчикОбновления.Процедура           = "торо_ОбновлениеИнформационнойБазы.ОбновлениеРегистраНакопленияторо_ПлановыеЗатратыЗапчастей";
	ОбработчикОбновления.НачальноеЗаполнение = Ложь;
	ОбработчикОбновления.РежимВыполнения     = "Монопольно";
	ОбработчикОбновления.Комментарий         = "Обновление регистра накопления ""Плановые затраты запчастей""...";
	
	
КонецПроцедуры

// Вызывается перед процедурами-обработчиками обновления данных ИБ.
//
Процедура ПередОбновлениемИнформационнойБазы() Экспорт
	
КонецПроцедуры

// Вызывается после завершения обновления данных ИБ.
// 
// Параметры:
//   ПредыдущаяВерсия       - Строка - версия до обновления. "0.0.0.0" для "пустой" ИБ.
//   ТекущаяВерсия          - Строка - версия после обновления.
//   ВыполненныеОбработчики - ДеревоЗначений - список выполненных процедур-обработчиков обновления,
//                                             сгруппированных по номеру версии.
//   ВыводитьОписаниеОбновлений - Булево - если установить Истина, то будет выведена форма
//                                с описанием обновлений. По умолчанию, Истина.
//                                Возвращаемое значение.
//   МонопольныйРежим           - Булево - Истина, если обновление выполнялось в монопольном режиме.
//
Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия,
	Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
	
// Пример обхода выполненных обработчиков обновления:
//
//	Для Каждого Версия Из ВыполненныеОбработчики.Строки Цикл
//		
//		Если Версия.Версия = "*" Тогда
//			// Обработчик, который может выполнятся при каждой смене версии.
//		Иначе
//			// Обработчик, который выполняется для определенной версии.
//		КонецЕсли;
//		
//		Для Каждого Обработчик Из Версия.Строки Цикл
//			...
//		КонецЦикла;
//		
//	КонецЦикла;
//

КонецПроцедуры

// Вызывается при подготовке табличного документа с описанием изменений в программе.
//
// Параметры:
//   Макет - ТабличныйДокумент - описание обновления всех библиотек и конфигурации.
//           Макет можно дополнить или заменить.
//           См. также общий макет ОписаниеИзмененийСистемы.
//
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
	
	
КонецПроцедуры


// Вызывается при добалении при переходе с другой конфигурации
// Используется для добавления необходимых обработчиков.
// Параметры:
//  Обработчики - ТаблицаЗначений - описание полей, см. в процедуре
//                ОбновлениеИнформационнойБазыСлужебный.НоваяТаблицаОбработчиковПереходаСДругойПрограммы.
Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
	
КонецПроцедуры

// Вызывается при определнии режима обновления данных.
//
// Параметры:
//   РежимОбновленияДанных - Строка - режим обновления.
//   СтандартнаяОбработка - Булево - Ложь, если нужно изменить режим по умолчанию.
//  
Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОБработка) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Вызывается для выполения строк кода при завершении перехода с другой программы
Процедура ПриЗавершенииПереходаСДругойПрограммы(Знач ПредыдущееИмяКонфигурации, Знач ПредыдущаяВерсияКонфигурации, Параметры) Экспорт
	
КонецПроцедуры

// В справочник "торо_ТехКарты" в тч "МатериальныеЗатраты" были добавлены новые реквизиты 
// требуется их заполнить.
Процедура ЗаполнитьНовыеРеквизитыВСправочникеТехКарты() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	торо_ТехКартыМатериальныеЗатраты.Ссылка КАК Ссылка,
	|	торо_ТехКартыМатериальныеЗатраты.Количество,
	|	торо_ТехКартыМатериальныеЗатраты.Номенклатура,
	|	торо_ТехКартыМатериальныеЗатраты.КоличествоНаЕдиницу,
	|	торо_ТехКартыМатериальныеЗатраты.КоличествоУпаковок,
	|	торо_ТехКартыМатериальныеЗатраты.КоличествоУпаковокНаЕдиницу,
	|	торо_ТехКартыМатериальныеЗатраты.Упаковка,
	|	ЕСТЬNULL(торо_ТехКартыМатериальныеЗатраты.Упаковка.Коэффициент, 1) КАК Коэффициент,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(торо_ТехнологическиеОперацииМатериальныеЗатраты.Количество, 0) = 0
	|			ТОГДА 1
	|		ИНАЧЕ торо_ТехнологическиеОперацииМатериальныеЗатраты.Количество
	|	КОНЕЦ КАК КоличествоВОперации,
	|	торо_ТехКартыМатериальныеЗатраты.НомерСтроки,
	|	торо_ТехКартыМатериальныеЗатраты.ID,
	|	торо_ТехКартыМатериальныеЗатраты.ЕдиницаИзмерения,
	|	торо_ТехКартыМатериальныеЗатраты.Операция,
	|	торо_ТехКартыМатериальныеЗатраты.Качество
	|ИЗ
	|	Справочник.торо_ТехКарты.МатериальныеЗатраты КАК торо_ТехКартыМатериальныеЗатраты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ТехнологическиеОперации.МатериальныеЗатраты КАК торо_ТехнологическиеОперацииМатериальныеЗатраты
	|		ПО торо_ТехКартыМатериальныеЗатраты.Операция = торо_ТехнологическиеОперацииМатериальныеЗатраты.Ссылка
	|			И торо_ТехКартыМатериальныеЗатраты.Номенклатура = торо_ТехнологическиеОперацииМатериальныеЗатраты.Номенклатура";
	
	ВыборкаНоменклатуры = Запрос.Выполнить().Выгрузить();
	ВыборкаНоменклатуры.Индексы.Добавить("Ссылка, Номенклатура");
	
	ВыборкаКарт = ВыборкаНоменклатуры.Скопировать(,"Ссылка");
	ВыборкаКарт.свернуть("Ссылка");
	
	стрПоиска = Новый Структура("Ссылка, Номенклатура");
	
	Для каждого текКарта из ВыборкаКарт Цикл
		спрОбъект = текКарта.Ссылка.ПолучитьОбъект();
		
		НужноЗаписать = Ложь;
		Для каждого СтрокаТЧ из спрОбъект.МатериальныеЗатраты Цикл
			стрПоиска.Ссылка = текКарта.Ссылка;
			стрПоиска.Номенклатура = СтрокаТЧ.Номенклатура;
			НайС = ВыборкаНоменклатуры.НайтиСтроки(стрПоиска);
			
			Если Найс.Количество() > 0 Тогда
				текНом = Найс[0];
				
				Если ТекНом.Количество = 0 тогда
					СтрокаТЧ.Количество = текНом.КоличествоУпаковок * текНом.Коэффициент;
					СтрокаТЧ.КоличествоНаЕдиницу = СтрокаТЧ.Количество / текНом.КоличествоВОперации;
					СтрокаТЧ.КоличествоУпаковокНаЕдиницу = СтрокаТЧ.КоличествоУпаковок / текНом.КоличествоВОперации;
				Иначе
					СтрокаТЧ.КоличествоУпаковок = текНом.Количество / текНом.Коэффициент;
					СтрокаТЧ.КоличествоНаЕдиницу = текНом.Количество / текНом.КоличествоВОперации;
					СтрокаТЧ.КоличествоУпаковокНаЕдиницу = СтрокаТЧ.КоличествоУпаковок / текНом.КоличествоВОперации;
				КонецЕсли;
				нужноЗаписать = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если НужноЗаписать Тогда
			Попытка
				спрОбъект.Записать();
			Исключение
				ОписаниеОшибки = ОписаниеОшибки();
				ТекстОшибки = СтрШаблон(НСтр("es='El objeto: %1 _ошибка: ';ru='Объект: %1    _ошибка: ';en='Object:%1 _error: '"), спрОбъект);
				ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
					,, ТекстОшибки+ОписаниеОшибки);
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

// В документ "торо_НарядНаРегламентноеМероприятие" в тч "РемонтныеРаботы" был добавлен новый реквизит
// требуется его заполнить.
Процедура ЗаполнитьКоличествоВДок_НарядНаРегламентноеМероприятие() Экспорт
	
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	торо_НарядНаРегламентноеМероприятие.Ссылка,
	|	торо_НарядНаРегламентноеМероприятие.РемонтныеРаботы.(
	|		Ссылка,
	|		НомерСтроки,
	|		ID,
	|		РемонтнаяРабота,
	|		Родитель_ID,
	|		РемонтыОборудования_ID,
	|		Количество,
	|		Картинка,
	|		NULL КАК Выполнено,
	|		NULL КАК ПроцентВыполненияРабот,
	|		NULL КАК СдельныйНаряд,
	|		NULL КАК Сумма
	|	),
	|	торо_НарядНаРегламентноеМероприятие.Проведен
	|ИЗ
	|	Документ.торо_НарядНаРегламентноеМероприятие КАК торо_НарядНаРегламентноеМероприятие
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_АктОВыполненииРегламентногоМероприятия.Ссылка,
	|	торо_АктОВыполненииРегламентногоМероприятия.РемонтныеРаботы.(
	|		Ссылка,
	|		НомерСтроки,
	|		ID,
	|		РемонтнаяРабота,
	|		Родитель_ID,
	|		РемонтыОборудования_ID,
	|		Количество,
	|		Картинка,
	|		Выполнено,
	|		ПроцентВыполненияРабот,
	|		СдельныйНаряд,
	|		Сумма
	|	),
	|	торо_АктОВыполненииРегламентногоМероприятия.Проведен
	|ИЗ
	|	Документ.торо_АктОВыполненииРегламентногоМероприятия КАК торо_АктОВыполненииРегламентногоМероприятия";				   
	
	результат = Запрос.Выполнить();
	Выборка = результат.Выбрать();
	
	ПредКонстанта = Константы.торо_ИспользоватьСогласованиеДокументовМероприятий.Получить();
	Константы.торо_ИспользоватьСогласованиеДокументовМероприятий.Установить(Ложь);
	
	Попытка
		Пока Выборка.Следующий() Цикл
			ремРаботы = Выборка.РемонтныеРаботы.Выбрать().Количество();
			нужноЗаписать = Ложь;
			
			Если ремРаботы > 0 Тогда
				докОбъект = Выборка.Ссылка.ПолучитьОбъект();
				Для каждого текСтрока из докОбъект.РемонтныеРаботы Цикл 
					Если не ЗначениеЗаполнено(текСтрока.Количество) Тогда
						текСтрока.Количество = 1;
						нужноЗаписать = Истина;
					КонецЕсли;
				КонецЦикла;
				
				Если нужноЗаписать Тогда
					Попытка
						докОбъект.Записать();
					Исключение
						ОписаниеОшибки = ОписаниеОшибки();
						ТекстОшибки = СтрШаблон(НСтр("es='El objeto: %1 _ошибка: ';ru='Объект: %1    _ошибка: ';en='Object:%1 _error: '"), докОбъект);
						ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
							,,ТекстОшибки+ОписаниеОшибки);
					КонецПопытки;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	Исключение
		Константы.торо_ИспользоватьСогласованиеДокументовМероприятий.Установить(Истина);
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	Константы.торо_ИспользоватьСогласованиеДокументовМероприятий.Установить(Истина);
	
КонецПроцедуры

// Процедура выполняет начальное заполнение статусов документов.
Процедура ЗаполнениеСтатусовДокументов() Экспорт
	
	ОшибкаТранзакции = Ложь;
	НачатьТранзакцию();
	Попытка
		
		ТекстЗапроса = "ВЫБРАТЬ
		|	торо_ВыявленныеДефекты.Ссылка,
		|	торо_ВыявленныеДефекты.Дата КАК Дата
		|ИЗ
		|	Документ.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефекты
		|ГДЕ
		|	торо_ВыявленныеДефекты.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_ВнешнееОснованиеДляРабот.Ссылка,
		|	торо_ВнешнееОснованиеДляРабот.Дата
		|ИЗ
		|	Документ.торо_ВнешнееОснованиеДляРабот КАК торо_ВнешнееОснованиеДляРабот
		|ГДЕ
		|	торо_ВнешнееОснованиеДляРабот.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ЗаявкаНаРемонт.Ссылка,
		|	торо_ЗаявкаНаРемонт.Дата КАК Дата
		|ИЗ
		|	Документ.торо_ЗаявкаНаРемонт КАК торо_ЗаявкаНаРемонт
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_НарядНаВыполнениеРемонтныхРабот.Ссылка,
		|	торо_НарядНаВыполнениеРемонтныхРабот.Дата
		|ИЗ
		|	Документ.торо_НарядНаВыполнениеРемонтныхРабот КАК торо_НарядНаВыполнениеРемонтныхРабот
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_АктОВыполненииРегламентногоМероприятия.Ссылка,
		|	торо_АктОВыполненииРегламентногоМероприятия.Дата КАК Дата
		|ИЗ
		|	Документ.торо_АктОВыполненииРегламентногоМероприятия КАК торо_АктОВыполненииРегламентногоМероприятия
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_АктОВыполненииЭтапаРабот.Ссылка,
		|	торо_АктОВыполненииЭтапаРабот.Дата
		|ИЗ
		|	Документ.торо_АктОВыполненииЭтапаРабот КАК торо_АктОВыполненииЭтапаРабот
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		// Документы меняющие только свой статус
		Выборка = МассивРезультатов[0].Выбрать();
		Пока Выборка.Следующий() Цикл
			Ссылка = Выборка.Ссылка;
			ДокументОбъект = Ссылка.ПолучитьОбъект();
			Движения = ДокументОбъект.Движения;
			Выполнить("Движения." + торо_РаботаСоСтатусамиДокументовСервер.ПолучитьИмяРегистраПоСсылке(Ссылка) + ".Записывать = Истина");
			торо_РаботаСоСтатусамиДокументовСервер.УстановитьСтатусДокумента(Ссылка, Ссылка, Движения, Перечисления.торо_СтатусыДокументов.Зарегистрирован);
			Движения.Записать();
		КонецЦикла;
		
		// Документы меняющие свой статус и статус документов оснований
		Выборка = МассивРезультатов[1].Выбрать();
		Пока Выборка.Следующий() Цикл
			Ссылка = Выборка.Ссылка;
			ДокументОбъект = Ссылка.ПолучитьОбъект();
			Движения = ДокументОбъект.Движения;
			Выполнить("Движения." + торо_РаботаСоСтатусамиДокументовСервер.ПолучитьИмяРегистраПоСсылке(Ссылка) + ".Записывать = Истина");
			торо_РаботаСоСтатусамиДокументовСервер.УстановитьСтатусДокумента(Ссылка, Ссылка, Движения, Перечисления.торо_СтатусыДокументов.Зарегистрирован);			
			торо_РаботаСоСтатусамиДокументовСервер.ИзменитьСтатусыДокументовОснований(Ссылка);
			Движения.Записать();			
		КонецЦикла;
		
		// Документы меняющие только статус документов оснований
		Выборка = МассивРезультатов[2].Выбрать();
		Пока Выборка.Следующий() Цикл
			Ссылка = Выборка.Ссылка;
			торо_РаботаСоСтатусамиДокументовСервер.ИзменитьСтатусыДокументовОснований(Ссылка);
			Движения.Записать();			
		КонецЦикла;
		
		// Закрытие заявок и ремонтов меняет статусы для внешних оснований, дефектов и заявок.
		МассивИменРегистров = Новый Массив;
		МассивИменРегистров.Добавить("торо_СтатусыДокументовВыявленныхДефектов");
		МассивИменРегистров.Добавить("торо_СтатусыДокументовВнешнихОснований");
		МассивИменРегистров.Добавить("торо_СтатусыДокументовЗаявок");
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_Ремонты.Регистратор КАК ДокументОснование,
		|	торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеРемонты.Ссылка КАК Регистратор
		|ПОМЕСТИТЬ Регистраторы
		|ИЗ
		|	РегистрСведений.торо_Ремонты КАК торо_Ремонты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗакрытиеЗаявокИРемонтов.ЗакрываемыеРемонты КАК торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеРемонты
		|		ПО (торо_Ремонты.Регистратор ССЫЛКА Документ.торо_ВыявленныеДефекты
		|				ИЛИ торо_Ремонты.Регистратор ССЫЛКА Документ.торо_ВнешнееОснованиеДляРабот
		|				ИЛИ торо_Ремонты.Регистратор ССЫЛКА Документ.торо_ЗаявкаНаРемонт)
		|			И торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеРемонты.ID = торо_Ремонты.ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Регистраторы.ДокументОснование КАК ДокументОснование,
		|	Регистраторы.Регистратор КАК Регистратор
		|ИЗ
		|	Регистраторы КАК Регистраторы
		|ИТОГИ ПО
		|	Регистратор";
		Запрос = Новый Запрос(ТекстЗапроса);
		
		ВыборкаДокументыЗакрытия = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаДокументыЗакрытия.Следующий() Цикл
			
			Регистратор = ВыборкаДокументыЗакрытия.Регистратор;
			Движения = Регистратор.ПолучитьОбъект().Движения;
			
			Для Каждого ИмяРегистра Из МассивИменРегистров Цикл
				Выполнить("Движения." + ИмяРегистра + ".Записывать = Истина");
			КонецЦикла;
			
			ВыборкаДокументыОснования = ВыборкаДокументыЗакрытия.Выбрать();
			Пока ВыборкаДокументыОснования.Следующий() Цикл
				торо_РаботаСоСтатусамиДокументовСервер.УстановитьСтатусДокумента(ВыборкаДокументыОснования.ДокументОснование, Регистратор, Движения, Перечисления.торо_СтатусыДокументов.Отклонен);
			КонецЦикла;
			
			Для Каждого ИмяРегистра Из МассивИменРегистров Цикл
				Выполнить("Движения." + ИмяРегистра + ".Записать()");
			КонецЦикла;
			
		КонецЦикла;
		
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡El relleno inicial de los estatus de los documentos no es cumplido! Por la causa: ';ru='Начальное заполнение статусов документов НЕ выполнено! По причине: ';en='Initial filling of document statuses NOT completed! Because of: '")+ОписаниеОшибки);
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

// Процедура предназначена для начального заполнения реквизита Статус
// справочника торо_ИдентификаторыТехКарт.
Процедура ЗаполнениеСтатусовТехКарт() Экспорт
	
	ОшибкаТранзакции = Ложь;
	НачатьТранзакцию();
	Попытка
		
		Выборка = Справочники.торо_ИдентификаторыТехКарт.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Не Выборка.ЭтоГруппа Тогда
				СправочникОбъект = Выборка.ПолучитьОбъект();
				
				СправочникОбъект.Статус = Перечисления.торо_СтатусыНормативныхРемонтовИТехКарт.Действует;
				СправочникОбъект.Записать();
			КонецЕсли;
			
		КонецЦикла;
		
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='El relleno inicial de aquellos estatus. ¡Las tarjetas no es cumplido! Por la causa: ';ru='Начальное заполнение статусов тех. карт НЕ выполнено! По причине: ';en='Initial filling of the status of those. cards are NOT completed! Because of: '")+ОписаниеОшибки);
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

// Процедура выполняет начальное заполнение реквизита Статус табличной части
// НормативныеРемонты элементов справочника торо_ТиповыеОР.
Процедура ЗаполнениеСтатусовНормативныхРемонтовТиповыхОР() Экспорт
	
	ОшибкаТранзакции = Ложь;
	НачатьТранзакцию();
	Попытка
		
		Выборка = Справочники.торо_ТиповыеОР.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Не Выборка.ЭтоГруппа Тогда
				СправочникОбъект = Выборка.ПолучитьОбъект();
				Для Каждого НормативныйРемонт Из СправочникОбъект.НормативныеРемонты Цикл
					НормативныйРемонт.Статус = Перечисления.торо_СтатусыНормативныхРемонтовИТехКарт.Действует;
				КонецЦикла;	
				СправочникОбъект.Записать();
			КонецЕсли;
			
		КонецЦикла;
		
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡El relleno inicial de los estatus de las reparaciones normativas tipo ОР no es cumplido! Por la causa: ';ru='Начальное заполнение статусов нормативных ремонтов типовых ОР НЕ выполнено! По причине: ';en='Initial filling of the status of standard repairs of typical PRs is NOT completed! Because of: '")+ОписаниеОшибки);
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

// Процедура выполняет заполнение реквизита ТипКонтактнойИнформации
// для предопределенных элементов справочника ВидыКонтакнойИнформации
// вызывается при первом запуске конфигурации.
Процедура ЗаполнитьПредопределенныеВидыКонтактнойИнформацииФизЛиц() Экспорт
	
	// Справочник "Физические лица"
	
	ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.EmailФизическогоЛица,
	Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,	Истина, Ложь, Ложь, 19);
	ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица,
	Перечисления.ТипыКонтактнойИнформации.Телефон,					Истина, Ложь, Ложь, 20);
	ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица,
	Перечисления.ТипыКонтактнойИнформации.Телефон,					Истина, Ложь, Ложь, 22);
	ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.АдресДляИнформированияФизическиеЛица,
	Перечисления.ТипыКонтактнойИнформации.Адрес,					Истина, Ложь, Ложь, 23);
	ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.ТелефонДомашнийФизическиеЛица,
	Перечисления.ТипыКонтактнойИнформации.Телефон,					Истина, Ложь, Ложь, 24);
	ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.АдресЗаПределамиРФФизическиеЛица,
	Перечисления.ТипыКонтактнойИнформации.Адрес,					Истина, Ложь, Ложь, 25);
	ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица,
	Перечисления.ТипыКонтактнойИнформации.Адрес,					Истина, Ложь, Ложь, 26);
	ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица,
	Перечисления.ТипыКонтактнойИнформации.Адрес,					Истина, Ложь, Ложь, 27);
	
КонецПроцедуры

// Процедура заполняет РС ПараметрыПользовательскогоПредставленияОбъектов.
// Использование пользовательских представлений возможно только для объектов конфигурации, указанных в этом регистре.
// Пользовательское редактирование РС запрещено.
Процедура ЗаполнитьОбъектыКонфигурацииДляПользовательскогоПредставления() Экспорт
	
	ОшибкаТранзакции = Ложь;
	НачатьТранзакцию();
	Попытка
		
		НаборЗаписей = РегистрыСведений.торо_ПараметрыПользовательскогоПредставленияОбъектов.СоздатьНаборЗаписей();
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 0 Тогда
			
			НаборЗаписей.Очистить();
			
			// Объекты ремонта
			НС = НаборЗаписей.Добавить();
			НС.ОбъектКонфигурации 			= "Справочники.торо_ОбъектыРемонта";
			НС.ФорматнаяСтрокаПоУмолчанию	= "%Наименование%";
			НС.ОбъектКонфигурацииСиноним	= "Объекты ремонта";
			// Номенклатура
			НС = НаборЗаписей.Добавить();
			НС.ОбъектКонфигурации 			= "Справочники.Номенклатура";
			НС.ФорматнаяСтрокаПоУмолчанию	= "%Наименование%";
			НС.ОбъектКонфигурацииСиноним	= "Номенклатура";
			// Тех карты
			НС = НаборЗаписей.Добавить();
			НС.ОбъектКонфигурации 			= "Справочники.торо_ИдентификаторыТехКарт";
			НС.ФорматнаяСтрокаПоУмолчанию	= "%Наименование%";
			НС.ОбъектКонфигурацииСиноним	= "Технологические карты ремонтов";
			// Тех операции
			НС = НаборЗаписей.Добавить();
			НС.ОбъектКонфигурации 			= "Справочники.торо_ТехнологическиеОперации";
			НС.ФорматнаяСтрокаПоУмолчанию	= "%Наименование%";
			НС.ОбъектКонфигурацииСиноним	= "Технологические операции";
			// Виды ремонта
			НС = НаборЗаписей.Добавить();
			НС.ОбъектКонфигурации 			= "Справочники.торо_ВидыРемонтов";
			НС.ФорматнаяСтрокаПоУмолчанию	= "%Наименование%";
			НС.ОбъектКонфигурацииСиноним	= "Виды ремонтов";
			// Способы планирования
			НС = НаборЗаписей.Добавить();
			НС.ОбъектКонфигурации 			= "Справочники.торо_СпособыПланированияРемонтныхРабот";
			НС.ФорматнаяСтрокаПоУмолчанию	= "%Наименование%";
			НС.ОбъектКонфигурацииСиноним	= "Способы планирования работ";
			
			НаборЗаписей.Записать();
			
		КонецЕсли; 
		
	Исключение
		ОшибкаТранзакции = ИСтина;
		ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡El relleno inicial de los parámetros de la representación de usuario de los objetos no es cumplido! Por la causa: ';ru='Начальное заполнение параметров пользовательского представления объектов НЕ выполнено! По причине: ';en='Initial filling in the parameters of the custom representation of objects is NOT completed! Because of: '")+ОписаниеОшибки);
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

// Вспомогательная процедура вызывается из ЗаполнитьПредопределенныеВидыКонтактнойИнформацииФизЛиц.
Процедура ОбновитьВидКИ(ВидКИ, Тип, МожноИзменятьСпособРедактирования, РедактированиеТолькоВДиалоге, АдресТолькоРоссийский,	Порядок = Неопределено)
	
	НастройкиПроверки = Новый Структура;
	НастройкиПроверки.Вставить("ТолькоНациональныйАдрес", 		АдресТолькоРоссийский);
	НастройкиПроверки.Вставить("ПроверятьКорректность", 		Ложь);
	НастройкиПроверки.Вставить("СкрыватьНеактуальныеАдреса", 	Ложь);
	НастройкиПроверки.Вставить("ВключатьСтрануВПредставление", 	Ложь);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Тип);
	ПараметрыВида.Вид = ВидКИ;
	ПараметрыВида.Используется = Истина;
	ПараметрыВида.Тип = Тип;
	ПараметрыВида.МожноИзменятьСпособРедактирования = МожноИзменятьСпособРедактирования;
	ПараметрыВида.РедактированиеТолькоВДиалоге = РедактированиеТолькоВДиалоге;
	ПараметрыВида.ОбязательноеЗаполнение = Ложь;
	ПараметрыВида.Порядок = Порядок;
	ПараметрыВида.НастройкиПроверки = НастройкиПроверки;
	
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
		
КонецПроцедуры

Процедура ОбновитьКоличествоВТехКартах() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	торо_ТехКартыСписокОпераций.ID КАК ID,
	|	торо_ТехКартыСписокОпераций.Количество,
	|	торо_ТехКартыСписокОпераций.Ссылка
	|ПОМЕСТИТЬ ВТ_СписокОпераций
	|ИЗ
	|	Справочник.торо_ТехКарты.СписокОпераций КАК торо_ТехКартыСписокОпераций
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ТехКартыМатериальныеЗатраты.ID КАК ID,
	|	торо_ТехКартыМатериальныеЗатраты.КоличествоУпаковок КАК МЗКоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(торо_ТехКартыМатериальныеЗатраты.Упаковка.Коэффициент, 0) = 0
	|			ТОГДА 1
	|		ИНАЧЕ торо_ТехКартыМатериальныеЗатраты.Упаковка.Коэффициент
	|	КОНЕЦ КАК МЗУпаковкаКоэффициент,
	|	торо_ТехКартыМатериальныеЗатраты.Ссылка КАК Ссылка,
	|	торо_ТехКартыМатериальныеЗатраты.Номенклатура
	|ПОМЕСТИТЬ ВТ_МатЗатраты
	|ИЗ
	|	Справочник.торо_ТехКарты.МатериальныеЗатраты КАК торо_ТехКартыМатериальныеЗатраты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СписокОпераций.Ссылка,
	|	ВТ_СписокОпераций.ID,
	|	ВТ_МатЗатраты.МЗКоличествоУпаковок,
	|	ВТ_МатЗатраты.МЗУпаковкаКоэффициент,
	|	ВТ_МатЗатраты.МЗКоличествоУпаковок * ВТ_МатЗатраты.МЗУпаковкаКоэффициент КАК МЗКоличество,
	|	ВТ_СписокОпераций.Количество КАК ОперКоличество,
	|	ВТ_МатЗатраты.Номенклатура
	|ПОМЕСТИТЬ ВТ_Шаг1
	|ИЗ
	|	ВТ_СписокОпераций КАК ВТ_СписокОпераций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МатЗатраты КАК ВТ_МатЗатраты
	|		ПО ВТ_СписокОпераций.ID = ВТ_МатЗатраты.ID
	|			И ВТ_СписокОпераций.Ссылка = ВТ_МатЗатраты.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Шаг1.Ссылка КАК Ссылка,
	|	ВТ_Шаг1.ID,
	|	ВТ_Шаг1.Номенклатура КАК Номенклатура,
	|	ВТ_Шаг1.МЗКоличествоУпаковок,
	|	ВТ_Шаг1.МЗУпаковкаКоэффициент,
	|	ВТ_Шаг1.МЗКоличество,
	|	ВЫБОР
	|		КОГДА ВТ_Шаг1.ОперКоличество = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВТ_Шаг1.МЗКоличество / ВТ_Шаг1.ОперКоличество
	|	КОНЕЦ КАК МЗКНЕ,
	|	ВЫБОР
	|		КОГДА ВТ_Шаг1.ОперКоличество = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВТ_Шаг1.МЗКоличествоУпаковок / ВТ_Шаг1.ОперКоличество
	|	КОНЕЦ КАК МЗКУНЕ
	|ИЗ
	|	ВТ_Шаг1 КАК ВТ_Шаг1
	|ИТОГИ ПО
	|	Ссылка";
	
	Выборка = Запрос.Выполнить();
	ВыборкаПоДок = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	НачатьТранзакцию();
	ОбработчикВыполненУспешно = Истина;
	
	Пока ВыборкаПоДок.Следующий() Цикл
		Попытка 
			
			спрОбъект = ВыборкаПоДок.Ссылка.ПолучитьОбъект();
			мз = спрОбъект.МатериальныеЗатраты;
			стрОтборка = Новый Структура("ID, Номенклатура");
			
			ДетЗаписи = ВыборкаПоДок.Выбрать();
			нужноЗаписывать = Ложь;
			Пока ДетЗаписи.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(стрОтборка, ДетЗаписи);
				НайС = мз.найтиСтроки(стрОтборка);
				Если НайС.количество() > 0 Тогда
					Если НайС[0].Количество <> ДетЗаписи.МЗКоличество Тогда
						НайС[0].Количество = ДетЗаписи.МЗКоличество;
						нужноЗаписывать = Истина;
					КонецЕсли;
					Если НайС[0].КоличествоНаЕдиницу <> ДетЗаписи.МЗКНЕ Тогда
						НайС[0].КоличествоНаЕдиницу = ДетЗаписи.МЗКНЕ;
						нужноЗаписывать = Истина;
					КонецЕсли;
					Если НайС[0].КоличествоУпаковокНаЕдиницу <> ДетЗаписи.МЗКУНЕ Тогда
						НайС[0].КоличествоУпаковокНаЕдиницу = ДетЗаписи.МЗКУНЕ;
						нужноЗаписывать = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			Если нужноЗаписывать Тогда
				спрОбъект.ОбменДанными.Загрузка = Истина;
				спрОбъект.записать();
			КонецЕсли;
			
		Исключение
			ОбработчикВыполненУспешно = Ложь;
		КонецПопытки;
	КонецЦикла;
	
	Если ОбработчикВыполненУспешно Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка,,, 
		"Часть тех. карт не удалось обновить.");
	КонецЕсли; 
	
КонецПроцедуры 

Процедура ДобавитьЗаписиВРСФИОФизЛиц() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ФизическиеЛица.Ссылка,
	|	ФизическиеЛица.ФИО,
	|	ФизическиеЛица.ДатаРождения,
	|	ФизическиеЛица.Наименование
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц КАК ФИОФизическихЛиц
	|		ПО ФИОФизическихЛиц.ФизическоеЛицо = ФизическиеЛица.Ссылка
	|ГДЕ
	|	ФИОФизическихЛиц.ФизическоеЛицо ЕСТЬ NULL";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЕстьОшибки = Ложь;
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.Наименование) Тогда
			
			СтруктураФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(Выборка.Наименование);
			
			
			МенеджерЗаписиФИО = РегистрыСведений.ФИОФизическихЛиц.СоздатьМенеджерЗаписи();
			
			Если СтруктураФИО.Фамилия <> Неопределено Тогда
				
				МенеджерЗаписиФИО.Фамилия  = СтруктураФИО.Фамилия;
				
				Если СтруктураФИО.Имя <> Неопределено Тогда
					МенеджерЗаписиФИО.Имя = СтруктураФИО.Имя;
				КонецЕсли;
				
				Если СтруктураФИО.Отчество <> Неопределено Тогда
					МенеджерЗаписиФИО.Отчество = СтруктураФИО.Отчество;
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(МенеджерЗаписиФИО.Период) Тогда
					Если ЗначениеЗаполнено(Выборка.ДатаРождения) Тогда
						МенеджерЗаписиФИО.Период = Выборка.ДатаРождения;
					Иначе
						МенеджерЗаписиФИО.Период = '18991231000000';
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
			Попытка
				МенеджерЗаписиФИО.ФизическоеЛицо = Выборка.Ссылка;
				МенеджерЗаписиФИО.Записать(Истина);
				
			Исключение
				
				ЕстьОшибки = Истина;
				
			КонецПопытки;
			
			Если Не ЗначениеЗаполнено(Выборка.ФИО) Тогда
				ФизЛицоОбъект = Выборка.Ссылка.ПолучитьОбъект();
				ФизЛицоОбъект.ФИО = МенеджерЗаписиФИО.Имя + " " + МенеджерЗаписиФИО.Фамилия + " " + МенеджерЗаписиФИО.Отчество;
				Попытка
					ФизЛицоОбъект.Записать();
				Исключение
				КонецПопытки;
			КонецЕсли; 
			
			
		КонецЕсли; 
		
	КонецЦикла;  
	
	Если ЕстьОшибки Тогда
		
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка,,, "Для части физических лиц не удалось создать записи в регистре ФИО");
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ЗаполнитьПредопределенныеДанныеСценарияРаботы() Экспорт
	
	НачатьТранзакцию();
	ОбработчикВыполненУспешно = Истина;
	
	ПолныйФункционал = Справочники.торо_ПредопределенныеСценарииРаботыСистемы.ПолныйФункционал;
	
	СпрОбъект = ПолныйФункционал.ПолучитьОбъект();
	
	Для каждого Рекв Из Метаданные.Справочники.торо_ПредопределенныеСценарииРаботыСистемы.Реквизиты Цикл
		Если Рекв.Имя = "Описание" Тогда
			Продолжить;
		КонецЕсли;
		СпрОбъект[Рекв.Имя] = Истина;
	КонецЦикла;
	
	НС = СпрОбъект.ВводНаОсновании.Добавить();
	НС.Значение = Истина;
	НС.ПараДокументов = "торо_АктОВыполненииРегламентногоМероприятия_торо_СостоянияОбъектовРемонта";
	
	НС = СпрОбъект.ВводНаОсновании.Добавить();
	НС.Значение = Истина;
	НС.ПараДокументов = "торо_АктОВыполненииРегламентногоМероприятия_торо_УчетКонтролируемыхПоказателей";
	
	НС = СпрОбъект.ВводНаОсновании.Добавить();
	НС.Значение = Истина;
	НС.ПараДокументов = "торо_АктОВыполненииРегламентногоМероприятия_торо_УчетНаработкиОборудования";
	
	НС = СпрОбъект.ВводНаОсновании.Добавить();
	НС.Значение = Истина;
	НС.ПараДокументов = "торо_АктОВыполненииЭтапаРабот_торо_СостоянияОбъектовРемонта";
	
	НС = СпрОбъект.ВводНаОсновании.Добавить();
	НС.Значение = Истина;
	НС.ПараДокументов = "торо_АктОВыполненииЭтапаРабот_торо_УчетКонтролируемыхПоказателей";
	
	НС = СпрОбъект.ВводНаОсновании.Добавить();
	НС.Значение = Истина;
	НС.ПараДокументов = "торо_АктОВыполненииЭтапаРабот_торо_УчетНаработкиОборудования";
	
	НС = СпрОбъект.ВводНаОсновании.Добавить();
	НС.Значение = Истина;
	НС.ПараДокументов = "торо_АктОВыполненииЭтапаРабот_торо_АктПриемкиОборудования";
	
	НС = СпрОбъект.ВводНаОсновании.Добавить();
	НС.Значение = Истина;
	НС.ПараДокументов = "торо_ВнешнееОснованиеДляРабот_торо_АктОВыполненииЭтапаРабот";
	
	НС = СпрОбъект.ВводНаОсновании.Добавить();
	НС.Значение = Истина;
	НС.ПараДокументов = "торо_ВнешнееОснованиеДляРабот_торо_ВыявленныеДефекты";
	
	НС = СпрОбъект.ВводНаОсновании.Добавить();
	НС.Значение = Истина;
	НС.ПараДокументов = "торо_ВнешнееОснованиеДляРабот_торо_ЗаявкаНаРемонт";
	
	НС = СпрОбъект.ВводНаОсновании.Добавить();
	НС.Значение = Истина;
	НС.ПараДокументов = "торо_ВнешнееОснованиеДляРабот_торо_НарядНаВыполнениеРемонтныхРабот";
	
	НС = СпрОбъект.ВводНаОсновании.Добавить();
	НС.Значение = Истина;
	НС.ПараДокументов = "торо_ВнешнееОснованиеДляРабот_торо_АктПриемкиОборудования";
	
	НС = СпрОбъект.ВводНаОсновании.Добавить();
	НС.Значение = Истина;
	НС.ПараДокументов = "торо_ВыявленныеДефекты_торо_АктОВыполненииЭтапаРабот";
	
	НС = СпрОбъект.ВводНаОсновании.Добавить();
	НС.Значение = Истина;
	НС.ПараДокументов = "торо_ВыявленныеДефекты_торо_ЗаявкаНаРемонт";
	
	НС = СпрОбъект.ВводНаОсновании.Добавить();
	НС.Значение = Истина;
	НС.ПараДокументов = "торо_ВыявленныеДефекты_торо_НарядНаВыполнениеРемонтныхРабот";
	
	НС = СпрОбъект.ВводНаОсновании.Добавить();
	НС.Значение = Истина;
	НС.ПараДокументов = "торо_ВыявленныеДефекты_торо_СостоянияОбъектовРемонта";
	
	НС = СпрОбъект.ВводНаОсновании.Добавить();
	НС.Значение = Истина;
	НС.ПараДокументов = "торо_ВыявленныеДефекты_торо_УчетКонтролируемыхПоказателей";
	
	НС = СпрОбъект.ВводНаОсновании.Добавить();
	НС.Значение = Истина;
	НС.ПараДокументов = "торо_ВыявленныеДефекты_торо_УчетНаработкиОборудования";
	
	НС = СпрОбъект.ВводНаОсновании.Добавить();
	НС.Значение = Истина;
	НС.ПараДокументов = "торо_ВыявленныеДефекты_торо_АктПриемкиОборудования";
	
	НС = СпрОбъект.ВводНаОсновании.Добавить();
	НС.Значение = Истина;
	НС.ПараДокументов = "торо_ГрафикРегламентныхМероприятийТОиР_торо_АктОВыполненииРегламентногоМероприятия";
	
	НС = СпрОбъект.ВводНаОсновании.Добавить();
	НС.Значение = Истина;
	НС.ПараДокументов = "торо_ГрафикРегламентныхМероприятийТОиР_торо_НарядНаРегламентноеМероприятие";
	
	НС = СпрОбъект.ВводНаОсновании.Добавить();
	НС.Значение = Истина;
	НС.ПараДокументов = "торо_ЗаявкаНаРемонт_торо_АктОВыполненииЭтапаРабот";
	
	НС = СпрОбъект.ВводНаОсновании.Добавить();
	НС.Значение = Истина;
	НС.ПараДокументов = "торо_ЗаявкаНаРемонт_торо_НарядНаВыполнениеРемонтныхРабот";
	
	НС = СпрОбъект.ВводНаОсновании.Добавить();
	НС.Значение = Истина;
	НС.ПараДокументов = "торо_ЗаявкаНаРемонт_торо_АктПриемкиОборудования";
	
	НС = СпрОбъект.ВводНаОсновании.Добавить();
	НС.Значение = Истина;
	НС.ПараДокументов = "торо_НарядНаВыполнениеРемонтныхРабот_торо_АктОВыполненииЭтапаРабот";
	
	НС = СпрОбъект.ВводНаОсновании.Добавить();
	НС.Значение = Истина;
	НС.ПараДокументов = "торо_НарядНаРегламентноеМероприятие_торо_АктОВыполненииРегламентногоМероприятия";
	
	НС = СпрОбъект.ВводНаОсновании.Добавить();
	НС.Значение = Истина;
	НС.ПараДокументов = "торо_НарядНаРегламентноеМероприятие_торо_АктОВыполненииРегламентногоМероприятия";
	
	НС = СпрОбъект.ВводНаОсновании.Добавить();
	НС.Значение = Истина;
	НС.ПараДокументов = "торо_ПланГрафикРемонта_торо_АктОВыполненииЭтапаРабот";
	
	НС = СпрОбъект.ВводНаОсновании.Добавить();
	НС.Значение = Истина;
	НС.ПараДокументов = "торо_ПланГрафикРемонта_торо_ЗаявкаНаРемонт";
	
	НС = СпрОбъект.ВводНаОсновании.Добавить();
	НС.Значение = Истина;
	НС.ПараДокументов = "торо_ПланГрафикРемонта_торо_НарядНаВыполнениеРемонтныхРабот";
	
	НС = СпрОбъект.ВводНаОсновании.Добавить();
	НС.Значение = Истина;
	НС.ПараДокументов = "торо_ПланГрафикРемонта_торо_АктПриемкиОборудования";
	
	НС = СпрОбъект.ВводНаОсновании.Добавить();
	НС.Значение = Истина;
	НС.ПараДокументов = "торо_СостоянияОбъектовРемонта_торо_ВыявленныеДефекты";
	
	НС = СпрОбъект.ВводНаОсновании.Добавить();
	НС.Значение = Истина;
	НС.ПараДокументов = "торо_УчетКонтролируемыхПоказателей_торо_ВыявленныеДефекты";
	
	НС = СпрОбъект.ВводНаОсновании.Добавить();
	НС.Значение = Истина;
	НС.ПараДокументов = "торо_АктОВыполненииРегламентногоМероприятия_торо_ВыявленныеДефекты";
	
	НС = СпрОбъект.ВводНаОсновании.Добавить();
	НС.Значение = Истина;
	НС.ПараДокументов = "торо_АктОВыполненииРегламентногоМероприятия_торо_ВнешнееОснованиеДляРабот";
	
	Попытка
		
		СпрОбъект.Записать();
		
	Исключение
		
		ОбработчикВыполненУспешно = Ложь;
		
	КонецПопытки;
	
	Если ОбработчикВыполненУспешно Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка,,, "Не удалось заполнить и записать элемент справочника ""Предопределенные сценарии работы системы""");
	КонецЕсли;
	
КонецПроцедуры

// На форме типовых ОР в таблице "Показатели наработки" скрыто поле "Период". 
// Нужно оставить только последние записи, а остальные удалить.
Процедура УдалитьДублиПоказателейНаработкиТиповыхОР() Экспорт
	
	НачатьТранзакцию();
	ОбработчикВыполненУспешно = Истина;
	
	ЗапросДублей = Новый Запрос;
	ЗапросДублей.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ торо_ПараметрыНаработкиОбъектовРемонта.Период) КАК КоличествоЗаписей,
	|	торо_ПараметрыНаработкиОбъектовРемонта.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_ПараметрыНаработкиОбъектовРемонта.Показатель КАК Показатель,
	|	МАКСИМУМ(торо_ПараметрыНаработкиОбъектовРемонта.Период) КАК Период
	|ИЗ
	|	РегистрСведений.торо_ПараметрыНаработкиОбъектовРемонта КАК торо_ПараметрыНаработкиОбъектовРемонта
	|ГДЕ
	|	торо_ПараметрыНаработкиОбъектовРемонта.ОбъектРемонта ССЫЛКА Справочник.торо_ТиповыеОР
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_ПараметрыНаработкиОбъектовРемонта.ОбъектРемонта,
	|	торо_ПараметрыНаработкиОбъектовРемонта.Показатель
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ торо_ПараметрыНаработкиОбъектовРемонта.Период) > 1";
	
	Результат = ЗапросДублей.Выполнить();
	ВыборкаДублей = Результат.Выбрать();
	
	Пока ВыборкаДублей.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.торо_ПараметрыНаработкиОбъектовРемонта.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ОбъектРемонта.Установить(ВыборкаДублей.ОбъектРемонта);
		НаборЗаписей.Отбор.Показатель.Установить(ВыборкаДублей.Показатель);
		НаборЗаписей.Прочитать();
		
		МассивУдаляемых = Новый Массив;
		Для каждого Запись из НаборЗаписей Цикл 
			Если Запись.Период <> ВыборкаДублей.Период Тогда
				МассивУдаляемых.Добавить(Запись);
			КонецЕсли;
		КонецЦикла;
		
		Для каждого Запись из МассивУдаляемых Цикл 
			НаборЗаписей.Удалить(Запись);
		КонецЦикла;
		
		Попытка
			НаборЗаписей.Записать();
		Исключение
			ОбработчикВыполненУспешно = Ложь;
		КонецПопытки;
		
	КонецЦикла;
	
	Если ОбработчикВыполненУспешно Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка,,, "Не удалось очистить ненужные записи регистра ""Параметры наработки объектов ремонта"".");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПереносСтатусовСогласованияДокументовВРегистры() Экспорт
	
	НачатьТранзакцию();
	ОшибкаТранзакции = Ложь;
	
	Попытка
		ЗаполнитьРегистр_ИсторияСтатусовДокументов();
		ЗаполнитьРегистр_ТекущиеСтатусыДокументов();
		ЗаполнитьРегистр_ТекущиеСогласующиеДокументов();
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡La renovación del mecanismo de la coordinación no es cumplida!';ru='Обновление механизма согласования НЕ выполнено!';en='Updating the negotiation mechanism is NOT completed!'")+ОписаниеОшибки);
		ОшибкаТранзакции = Истина;
	КонецПопытки;
	
	Если НЕ ОшибкаТранзакции Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		ОтменитьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьРегистр_ИсторияСтатусовДокументов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_АктОВыполненииРегламентногоМероприятияИсторияСтатусов.Дата КАК Период,
	|	торо_АктОВыполненииРегламентногоМероприятияИсторияСтатусов.Ссылка КАК СогласуемыйДокумент,
	|	торо_АктОВыполненииРегламентногоМероприятияИсторияСтатусов.Пользователь КАК Пользователь,
	|	торо_АктОВыполненииРегламентногоМероприятияИсторияСтатусов.ЗаКого КАК ЗаКого,
	|	торо_АктОВыполненииРегламентногоМероприятияИсторияСтатусов.СтатусДокумента
	|ПОМЕСТИТЬ ВТ_ИсторияСтатусов
	|ИЗ
	|	Документ.торо_АктОВыполненииРегламентногоМероприятия.ИсторияСтатусов КАК торо_АктОВыполненииРегламентногоМероприятияИсторияСтатусов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_АктОВыполненииЭтапаРаботИсторияСтатусов.Дата,
	|	торо_АктОВыполненииЭтапаРаботИсторияСтатусов.Ссылка,
	|	торо_АктОВыполненииЭтапаРаботИсторияСтатусов.Пользователь,
	|	торо_АктОВыполненииЭтапаРаботИсторияСтатусов.ЗаКого,
	|	торо_АктОВыполненииЭтапаРаботИсторияСтатусов.СтатусДокумента
	|ИЗ
	|	Документ.торо_АктОВыполненииЭтапаРабот.ИсторияСтатусов КАК торо_АктОВыполненииЭтапаРаботИсторияСтатусов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ВыявленныеДефектыИсторияСтатусов.Дата,
	|	торо_ВыявленныеДефектыИсторияСтатусов.Ссылка,
	|	торо_ВыявленныеДефектыИсторияСтатусов.Пользователь,
	|	торо_ВыявленныеДефектыИсторияСтатусов.ЗаКого,
	|	торо_ВыявленныеДефектыИсторияСтатусов.СтатусДокумента
	|ИЗ
	|	Документ.торо_ВыявленныеДефекты.ИсторияСтатусов КАК торо_ВыявленныеДефектыИсторияСтатусов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ГрафикРегламентныхМероприятийТОиРИсторияСтатусов.Дата,
	|	торо_ГрафикРегламентныхМероприятийТОиРИсторияСтатусов.Ссылка,
	|	торо_ГрафикРегламентныхМероприятийТОиРИсторияСтатусов.Пользователь,
	|	торо_ГрафикРегламентныхМероприятийТОиРИсторияСтатусов.ЗаКого,
	|	торо_ГрафикРегламентныхМероприятийТОиРИсторияСтатусов.СтатусДокумента
	|ИЗ
	|	Документ.торо_ГрафикРегламентныхМероприятийТОиР.ИсторияСтатусов КАК торо_ГрафикРегламентныхМероприятийТОиРИсторияСтатусов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ЗаявкаНаРемонтИсторияСтатусов.Дата,
	|	торо_ЗаявкаНаРемонтИсторияСтатусов.Ссылка,
	|	торо_ЗаявкаНаРемонтИсторияСтатусов.Пользователь,
	|	торо_ЗаявкаНаРемонтИсторияСтатусов.ЗаКого,
	|	торо_ЗаявкаНаРемонтИсторияСтатусов.СтатусДокумента
	|ИЗ
	|	Документ.торо_ЗаявкаНаРемонт.ИсторияСтатусов КАК торо_ЗаявкаНаРемонтИсторияСтатусов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_НарядНаВыполнениеРемонтныхРаботИсторияСтатусов.Дата,
	|	торо_НарядНаВыполнениеРемонтныхРаботИсторияСтатусов.Ссылка,
	|	торо_НарядНаВыполнениеРемонтныхРаботИсторияСтатусов.Пользователь,
	|	торо_НарядНаВыполнениеРемонтныхРаботИсторияСтатусов.ЗаКого,
	|	торо_НарядНаВыполнениеРемонтныхРаботИсторияСтатусов.СтатусДокумента
	|ИЗ
	|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.ИсторияСтатусов КАК торо_НарядНаВыполнениеРемонтныхРаботИсторияСтатусов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_НарядНаРегламентноеМероприятиеИсторияСтатусов.Дата,
	|	торо_НарядНаРегламентноеМероприятиеИсторияСтатусов.Ссылка,
	|	торо_НарядНаРегламентноеМероприятиеИсторияСтатусов.Пользователь,
	|	торо_НарядНаРегламентноеМероприятиеИсторияСтатусов.ЗаКого,
	|	торо_НарядНаРегламентноеМероприятиеИсторияСтатусов.СтатусДокумента
	|ИЗ
	|	Документ.торо_НарядНаРегламентноеМероприятие.ИсторияСтатусов КАК торо_НарядНаРегламентноеМероприятиеИсторияСтатусов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ПланГрафикРемонтаИсторияСтатусов.Дата,
	|	торо_ПланГрафикРемонтаИсторияСтатусов.Ссылка,
	|	торо_ПланГрафикРемонтаИсторияСтатусов.Пользователь,
	|	торо_ПланГрафикРемонтаИсторияСтатусов.ЗаКого,
	|	торо_ПланГрафикРемонтаИсторияСтатусов.СтатусДокумента
	|ИЗ
	|	Документ.торо_ПланГрафикРемонта.ИсторияСтатусов КАК торо_ПланГрафикРемонтаИсторияСтатусов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ПредписаниеИсторияСтатусов.Дата,
	|	торо_ПредписаниеИсторияСтатусов.Ссылка,
	|	торо_ПредписаниеИсторияСтатусов.Пользователь,
	|	торо_ПредписаниеИсторияСтатусов.ЗаКого,
	|	торо_ПредписаниеИсторияСтатусов.СтатусДокумента
	|ИЗ
	|	Документ.торо_ВнешнееОснованиеДляРабот.ИсторияСтатусов КАК торо_ПредписаниеИсторияСтатусов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_АктПриемкиОборудованияИсторияСтатусов.Дата,
	|	торо_АктПриемкиОборудованияИсторияСтатусов.Ссылка,
	|	торо_АктПриемкиОборудованияИсторияСтатусов.Пользователь,
	|	торо_АктПриемкиОборудованияИсторияСтатусов.ЗаКого,
	|	торо_АктПриемкиОборудованияИсторияСтатусов.СтатусДокумента
	|ИЗ
	|	Документ.торо_АктПриемкиОборудования.ИсторияСтатусов КАК торо_АктПриемкиОборудованияИсторияСтатусов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ОстановочныеРемонтыИсторияСтатусов.Дата,
	|	торо_ОстановочныеРемонтыИсторияСтатусов.Ссылка,
	|	торо_ОстановочныеРемонтыИсторияСтатусов.Пользователь,
	|	торо_ОстановочныеРемонтыИсторияСтатусов.ЗаКого,
	|	торо_ОстановочныеРемонтыИсторияСтатусов.СтатусДокумента
	|ИЗ
	|	Документ.торо_ОстановочныеРемонты.ИсторияСтатусов КАК торо_ОстановочныеРемонтыИсторияСтатусов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	СогласуемыйДокумент,
	|	Пользователь,
	|	ЗаКого
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИсторияСтатусов.Период КАК Период,
	|	ВТ_ИсторияСтатусов.СогласуемыйДокумент КАК СогласуемыйДокумент,
	|	КОЛИЧЕСТВО(ВТ_ИсторияСтатусов.СтатусДокумента) КАК КоличествоДублей,
	|	ЛОЖЬ КАК УжеДобавлена,
	|	ВТ_ИсторияСтатусов.Пользователь КАК Пользователь,
	|	ВТ_ИсторияСтатусов.ЗаКого КАК ЗаКого
	|ПОМЕСТИТЬ ВТ_КоличествоДублей
	|ИЗ
	|	ВТ_ИсторияСтатусов КАК ВТ_ИсторияСтатусов
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ИсторияСтатусов.СогласуемыйДокумент,
	|	ВТ_ИсторияСтатусов.Период,
	|	ВТ_ИсторияСтатусов.Пользователь,
	|	ВТ_ИсторияСтатусов.ЗаКого
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ВТ_ИсторияСтатусов.СтатусДокумента) > 1
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	СогласуемыйДокумент,
	|	Пользователь,
	|	ЗаКого
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КоличествоДублей.Период,
	|	ВТ_КоличествоДублей.СогласуемыйДокумент,
	|	ВТ_КоличествоДублей.КоличествоДублей,
	|	ВТ_КоличествоДублей.УжеДобавлена,
	|	ВТ_КоличествоДублей.Пользователь,
	|	ВТ_КоличествоДублей.ЗаКого
	|ИЗ
	|	ВТ_КоличествоДублей КАК ВТ_КоличествоДублей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИсторияСтатусов.Период,
	|	ВТ_ИсторияСтатусов.СогласуемыйДокумент,
	|	ВТ_ИсторияСтатусов.Пользователь,
	|	ВТ_ИсторияСтатусов.ЗаКого,
	|	ВТ_ИсторияСтатусов.СтатусДокумента,
	|	ЕСТЬNULL(ВТ_КоличествоДублей.КоличествоДублей, 1) КАК КоличествоДублей
	|ИЗ
	|	ВТ_ИсторияСтатусов КАК ВТ_ИсторияСтатусов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоДублей КАК ВТ_КоличествоДублей
	|		ПО ВТ_ИсторияСтатусов.Период = ВТ_КоличествоДублей.Период
	|			И ВТ_ИсторияСтатусов.СогласуемыйДокумент = ВТ_КоличествоДублей.СогласуемыйДокумент
	|			И ВТ_ИсторияСтатусов.Пользователь = ВТ_КоличествоДублей.Пользователь
	|			И ВТ_ИсторияСтатусов.ЗаКого = ВТ_КоличествоДублей.ЗаКого";
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаДублей = Результат[2].Выгрузить();
	ТаблицаДублей.Индексы.Добавить("СогласуемыйДокумент, Период, Пользователь, ЗаКого");
	
	Выборка = Результат[3].Выбрать();
	
	НаборЗаписей = РегистрыСведений.торо_ИсторияСтатусовСогласованияДокументов.СоздатьНаборЗаписей();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.КоличествоДублей > 1 Тогда
			СтруктураПоиска = Новый Структура("СогласуемыйДокумент, Период, Пользователь, ЗаКого");
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, Выборка);
			СтрокаДублей = ТаблицаДублей.НайтиСтроки(СтруктураПоиска);
			Если СтрокаДублей.Количество() > 0 Тогда
				СтрокаДублей = СтрокаДублей[0];
				Если СтрокаДублей.УжеДобавлена = Истина Тогда
					Продолжить;
				КонецЕсли;
				СтрокаДублей.УжеДобавлена = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		
	КонецЦикла;
	
	// Здесь НЕТ попытки и НЕ НУЖНО ее добавлять. Т.к. транзакция и попытка написаны в другой функции:
	// ПереносСтатусовСогласованияДокументовВРегистры.
	// Если добавить здесь попытку, то можно получить ошибку "В данной транзакции уже происходили ошибки".
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Процедура ЗаполнитьРегистр_ТекущиеСтатусыДокументов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_АктОВыполненииРегламентногоМероприятия.Ссылка КАК СогласуемыйДокумент,
	|	торо_АктОВыполненииРегламентногоМероприятия.СтатусДокумента
	|ИЗ
	|	Документ.торо_АктОВыполненииРегламентногоМероприятия КАК торо_АктОВыполненииРегламентногоМероприятия
	|ГДЕ
	|	торо_АктОВыполненииРегламентногоМероприятия.СтатусДокумента <> &ПустойСтатус
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_АктОВыполненииЭтапаРабот.Ссылка,
	|	торо_АктОВыполненииЭтапаРабот.СтатусДокумента
	|ИЗ
	|	Документ.торо_АктОВыполненииЭтапаРабот КАК торо_АктОВыполненииЭтапаРабот
	|ГДЕ
	|	торо_АктОВыполненииЭтапаРабот.СтатусДокумента <> &ПустойСтатус
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ВыявленныеДефекты.Ссылка,
	|	торо_ВыявленныеДефекты.СтатусДокумента
	|ИЗ
	|	Документ.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефекты
	|ГДЕ
	|	торо_ВыявленныеДефекты.СтатусДокумента <> &ПустойСтатус
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ГрафикРегламентныхМероприятийТОиР.Ссылка,
	|	торо_ГрафикРегламентныхМероприятийТОиР.СтатусДокумента
	|ИЗ
	|	Документ.торо_ГрафикРегламентныхМероприятийТОиР КАК торо_ГрафикРегламентныхМероприятийТОиР
	|ГДЕ
	|	торо_ГрафикРегламентныхМероприятийТОиР.СтатусДокумента <> &ПустойСтатус
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ЗаявкаНаРемонт.Ссылка,
	|	торо_ЗаявкаНаРемонт.СтатусДокумента
	|ИЗ
	|	Документ.торо_ЗаявкаНаРемонт КАК торо_ЗаявкаНаРемонт
	|ГДЕ
	|	торо_ЗаявкаНаРемонт.СтатусДокумента <> &ПустойСтатус
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_НарядНаВыполнениеРемонтныхРабот.Ссылка,
	|	торо_НарядНаВыполнениеРемонтныхРабот.СтатусДокумента
	|ИЗ
	|	Документ.торо_НарядНаВыполнениеРемонтныхРабот КАК торо_НарядНаВыполнениеРемонтныхРабот
	|ГДЕ
	|	торо_НарядНаВыполнениеРемонтныхРабот.СтатусДокумента <> &ПустойСтатус
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_НарядНаРегламентноеМероприятие.Ссылка,
	|	торо_НарядНаРегламентноеМероприятие.СтатусДокумента
	|ИЗ
	|	Документ.торо_НарядНаРегламентноеМероприятие КАК торо_НарядНаРегламентноеМероприятие
	|ГДЕ
	|	торо_НарядНаРегламентноеМероприятие.СтатусДокумента <> &ПустойСтатус
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ПланГрафикРемонта.Ссылка,
	|	торо_ПланГрафикРемонта.СтатусДокумента
	|ИЗ
	|	Документ.торо_ПланГрафикРемонта КАК торо_ПланГрафикРемонта
	|ГДЕ
	|	торо_ПланГрафикРемонта.СтатусДокумента <> &ПустойСтатус
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_Предписание.Ссылка,
	|	торо_Предписание.СтатусДокумента
	|ИЗ
	|	Документ.торо_ВнешнееОснованиеДляРабот КАК торо_Предписание
	|ГДЕ
	|	торо_Предписание.СтатусДокумента <> &ПустойСтатус
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_АктПриемкиОборудования.Ссылка,
	|	торо_АктПриемкиОборудования.СтатусДокумента
	|ИЗ
	|	Документ.торо_АктПриемкиОборудования КАК торо_АктПриемкиОборудования
	|ГДЕ
	|	торо_АктПриемкиОборудования.СтатусДокумента <> &ПустойСтатус
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ОстановочныеРемонты.Ссылка,
	|	торо_ОстановочныеРемонты.СтатусДокумента
	|ИЗ
	|	Документ.торо_ОстановочныеРемонты КАК торо_ОстановочныеРемонты
	|ГДЕ
	|	торо_ОстановочныеРемонты.СтатусДокумента <> &ПустойСтатус";
	
	Запрос.УстановитьПараметр("ПустойСтатус", Справочники.торо_СтатусыСогласованияДокументовРемонтныхРабот.ПустаяСсылка());
	Выборка = Запрос.Выполнить().Выбрать();
	
	НаборЗаписей = РегистрыСведений.торо_ТекущиеСтатусыСогласованияДокументов.СоздатьНаборЗаписей();
	Пока Выборка.Следующий() Цикл
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
	КонецЦикла;
	
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	
  	// Здесь НЕТ попытки и НЕ НУЖНО ее добавлять. Т.к. транзакция и попытка написаны в другой функции:
	// ПереносСтатусовСогласованияДокументовВРегистры.
	// Если добавить здесь попытку, то можно получить ошибку "В данной транзакции уже происходили ошибки".
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Процедура ЗаполнитьРегистр_ТекущиеСогласующиеДокументов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_АктОВыполненииРегламентногоМероприятияСогласующие.Ссылка КАК СогласуемыйДокумент,
	|	торо_АктОВыполненииРегламентногоМероприятияСогласующие.Согласующий,
	|	торо_АктОВыполненииРегламентногоМероприятияСогласующие.Замещающий,
	|	торо_АктОВыполненииРегламентногоМероприятияСогласующие.СтатусДокумента
	|ИЗ
	|	Документ.торо_АктОВыполненииРегламентногоМероприятия.Согласующие КАК торо_АктОВыполненииРегламентногоМероприятияСогласующие
	|ГДЕ
	|	торо_АктОВыполненииРегламентногоМероприятияСогласующие.Согласовано = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_АктОВыполненииЭтапаРаботСогласующие.Ссылка,
	|	торо_АктОВыполненииЭтапаРаботСогласующие.Согласующий,
	|	торо_АктОВыполненииЭтапаРаботСогласующие.Замещающий,
	|	торо_АктОВыполненииЭтапаРаботСогласующие.СтатусДокумента
	|ИЗ
	|	Документ.торо_АктОВыполненииЭтапаРабот.Согласующие КАК торо_АктОВыполненииЭтапаРаботСогласующие
	|ГДЕ
	|	торо_АктОВыполненииЭтапаРаботСогласующие.Согласовано = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_ВыявленныеДефектыСогласующие.Ссылка,
	|	торо_ВыявленныеДефектыСогласующие.Согласующий,
	|	торо_ВыявленныеДефектыСогласующие.Замещающий,
	|	торо_ВыявленныеДефектыСогласующие.СтатусДокумента
	|ИЗ
	|	Документ.торо_ВыявленныеДефекты.Согласующие КАК торо_ВыявленныеДефектыСогласующие
	|ГДЕ
	|	торо_ВыявленныеДефектыСогласующие.Согласовано = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_ГрафикРегламентныхМероприятийТОиРСогласующие.Ссылка,
	|	торо_ГрафикРегламентныхМероприятийТОиРСогласующие.Согласующий,
	|	торо_ГрафикРегламентныхМероприятийТОиРСогласующие.Замещающий,
	|	торо_ГрафикРегламентныхМероприятийТОиРСогласующие.СтатусДокумента
	|ИЗ
	|	Документ.торо_ГрафикРегламентныхМероприятийТОиР.Согласующие КАК торо_ГрафикРегламентныхМероприятийТОиРСогласующие
	|ГДЕ
	|	торо_ГрафикРегламентныхМероприятийТОиРСогласующие.Согласовано = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_ЗаявкаНаРемонтСогласующие.Ссылка,
	|	торо_ЗаявкаНаРемонтСогласующие.Согласующий,
	|	торо_ЗаявкаНаРемонтСогласующие.Замещающий,
	|	торо_ЗаявкаНаРемонтСогласующие.СтатусДокумента
	|ИЗ
	|	Документ.торо_ЗаявкаНаРемонт.Согласующие КАК торо_ЗаявкаНаРемонтСогласующие
	|ГДЕ
	|	торо_ЗаявкаНаРемонтСогласующие.Согласовано = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_НарядНаВыполнениеРемонтныхРаботСогласующие.Ссылка,
	|	торо_НарядНаВыполнениеРемонтныхРаботСогласующие.Согласующий,
	|	торо_НарядНаВыполнениеРемонтныхРаботСогласующие.Замещающий,
	|	торо_НарядНаВыполнениеРемонтныхРаботСогласующие.СтатусДокумента
	|ИЗ
	|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.Согласующие КАК торо_НарядНаВыполнениеРемонтныхРаботСогласующие
	|ГДЕ
	|	торо_НарядНаВыполнениеРемонтныхРаботСогласующие.Согласовано = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_НарядНаРегламентноеМероприятиеСогласующие.Ссылка,
	|	торо_НарядНаРегламентноеМероприятиеСогласующие.Согласующий,
	|	торо_НарядНаРегламентноеМероприятиеСогласующие.Замещающий,
	|	торо_НарядНаРегламентноеМероприятиеСогласующие.СтатусДокумента
	|ИЗ
	|	Документ.торо_НарядНаРегламентноеМероприятие.Согласующие КАК торо_НарядНаРегламентноеМероприятиеСогласующие
	|ГДЕ
	|	торо_НарядНаРегламентноеМероприятиеСогласующие.Согласовано = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_ПланГрафикРемонтаСогласующие.Ссылка,
	|	торо_ПланГрафикРемонтаСогласующие.Согласующий,
	|	торо_ПланГрафикРемонтаСогласующие.Замещающий,
	|	торо_ПланГрафикРемонтаСогласующие.СтатусДокумента
	|ИЗ
	|	Документ.торо_ПланГрафикРемонта.Согласующие КАК торо_ПланГрафикРемонтаСогласующие
	|ГДЕ
	|	торо_ПланГрафикРемонтаСогласующие.Согласовано = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_ПредписаниеСогласующие.Ссылка,
	|	торо_ПредписаниеСогласующие.Согласующий,
	|	торо_ПредписаниеСогласующие.Замещающий,
	|	торо_ПредписаниеСогласующие.СтатусДокумента
	|ИЗ
	|	Документ.торо_ВнешнееОснованиеДляРабот.Согласующие КАК торо_ПредписаниеСогласующие
	|ГДЕ
	|	торо_ПредписаниеСогласующие.Согласовано = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_АктПриемкиОборудованияСогласующие.Ссылка,
	|	торо_АктПриемкиОборудованияСогласующие.Согласующий,
	|	торо_АктПриемкиОборудованияСогласующие.Замещающий,
	|	торо_АктПриемкиОборудованияСогласующие.СтатусДокумента
	|ИЗ
	|	Документ.торо_АктПриемкиОборудования.Согласующие КАК торо_АктПриемкиОборудованияСогласующие
	|ГДЕ
	|	торо_АктПриемкиОборудованияСогласующие.Согласовано = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_ОстановочныеРемонтыСогласующие.Ссылка,
	|	торо_ОстановочныеРемонтыСогласующие.Согласующий,
	|	торо_ОстановочныеРемонтыСогласующие.Замещающий,
	|	торо_ОстановочныеРемонтыСогласующие.СтатусДокумента
	|ИЗ
	|	Документ.торо_ОстановочныеРемонты.Согласующие КАК торо_ОстановочныеРемонтыСогласующие
	|ГДЕ
	|	торо_ОстановочныеРемонтыСогласующие.Согласовано = ИСТИНА";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НаборЗаписей = РегистрыСведений.торо_ТекущиеСогласующиеДокументов.СоздатьНаборЗаписей();
	Пока Выборка.Следующий() Цикл
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Согласовано = Истина;
	КонецЦикла;
	
	// Здесь НЕТ попытки и НЕ НУЖНО ее добавлять. Т.к. транзакция и попытка написаны в другой функции:
	// ПереносСтатусовСогласованияДокументовВРегистры.
	// Если добавить здесь попытку, то можно получить ошибку "В данной транзакции уже происходили ошибки".
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Процедура ЗаполнитьРегистр_ПорядокОРПоИерархии() Экспорт
	
	НачатьТранзакцию();
	ОшибкаТранзакции = Ложь;
	
	Запрос = Новый запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	торо_СтруктурыОР.Ссылка,
	|	торо_СтруктурыОР.ИзменяетсяДокументами КАК ИзменяетсяДокументами
	|ИЗ
	|	Справочник.торо_СтруктурыОР КАК торо_СтруктурыОР
	|ГДЕ
	|	торо_СтруктурыОР.СтроитсяАвтоматически = ЛОЖЬ
	|ИТОГИ ПО
	|	ИзменяетсяДокументами";
	
	Результат = Запрос.Выполнить();
	ВыборкаПоСИ = Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);	
	
	Попытка
		Для каждого текСИ из ВыборкаПоСИ.Строки Цикл
			МассивСИ = Новый Массив;
			Для каждого ТекСтрока из ТекСИ.Строки Цикл
				МассивСИ.Добавить(ТекСтрока.Ссылка);
			КонецЦикла;
			
			ОбработатьМассивСтруктурИерархии(МассивСИ, текСИ.ИзменяетсяДокументами, ОшибкаТранзакции);
		КонецЦикла;
	Исключение
		ОшибкаТранзакции = Истина;
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='La renovación del registro ""el Orden ОР por la jerarquía"" no es cumplida. ';ru='Обновление регистра ""Порядок ОР по иерархии"" НЕ выполнено. ';en='Updating the register ""Order of the hierarchy"" is NOT completed. '")+ОписаниеОшибки());
	КонецПопытки;	
	
	Если НЕ ОшибкаТранзакции Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		ОтменитьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьМассивСтруктурИерархии(масСИ, ИзменяетсяДокументами, ОшибкаТранзакции)
	
	Если ИзменяетсяДокументами Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ИерархическиеСтруктурыОР.СтруктураИерархии,
		|	торо_ИерархическиеСтруктурыОР.РодительИерархии,
		|	торо_ИерархическиеСтруктурыОР.ОбъектИерархии
		|ПОМЕСТИТЬ РасположениеОР
		|ИЗ
		|	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(, СтруктураИерархии В (&СтруктураИерархии)) КАК торо_ИерархическиеСтруктурыОР
		|
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.ОбъектИерархии,
		|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.СтруктураИерархии,
		|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.РодительИерархии
		|ПОМЕСТИТЬ ТабБезПорядка
		|ИЗ
		|	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(, СтруктураИерархии В (&СтруктураИерархии)) КАК торо_РасположениеОРВСтруктуреИерархииСрезПоследних
		|ГДЕ
		|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.РодительИерархии В
		|			(ВЫБРАТЬ
		|				РасположениеОР.ОбъектИерархии
		|			ИЗ
		|				РасположениеОР КАК РасположениеОР)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	РасположениеОР.ОбъектИерархии,
		|	РасположениеОР.СтруктураИерархии,
		|	РасположениеОР.РодительИерархии
		|ИЗ
		|	РасположениеОР КАК РасположениеОР
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабБезПорядка.ОбъектИерархии,
		|	ТабБезПорядка.СтруктураИерархии
		|ИЗ
		|	ТабБезПорядка КАК ТабБезПорядка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|		ПО ТабБезПорядка.ОбъектИерархии = торо_ОбъектыРемонта.Ссылка";
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ИерархическиеСтруктурыОР.СтруктураИерархии,
		|	торо_ИерархическиеСтруктурыОР.РодительИерархии,
		|	торо_ИерархическиеСтруктурыОР.ОбъектИерархии
		|ПОМЕСТИТЬ РасположениеОР
		|ИЗ
		|	РегистрСведений.торо_ИерархическиеСтруктурыОР КАК торо_ИерархическиеСтруктурыОР
		|ГДЕ
		|	торо_ИерархическиеСтруктурыОР.СтруктураИерархии В (&СтруктураИерархии)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	торо_ИерархическиеСтруктурыОР.СтруктураИерархии,
		|	торо_ИерархическиеСтруктурыОР.РодительИерархии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ИерархическиеСтруктурыОР.ОбъектИерархии,
		|	торо_ИерархическиеСтруктурыОР.СтруктураИерархии,
		|	торо_ИерархическиеСтруктурыОР.РодительИерархии
		|ПОМЕСТИТЬ ТабБезПорядка
		|ИЗ
		|	РегистрСведений.торо_ИерархическиеСтруктурыОР КАК торо_ИерархическиеСтруктурыОР
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РасположениеОР КАК РасположениеОР
		|		ПО торо_ИерархическиеСтруктурыОР.РодительИерархии = РасположениеОР.ОбъектИерархии
		|			И торо_ИерархическиеСтруктурыОР.СтруктураИерархии = РасположениеОР.СтруктураИерархии
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	РасположениеОР.ОбъектИерархии,
		|	РасположениеОР.СтруктураИерархии,
		|	РасположениеОР.РодительИерархии
		|ИЗ
		|	РасположениеОР КАК РасположениеОР
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабБезПорядка.ОбъектИерархии КАК ОбъектИерархии,
		|	ТабБезПорядка.СтруктураИерархии КАК СтруктураИерархии,
		|	ТабБезПорядка.РодительИерархии КАК РодительИерархии
		|ПОМЕСТИТЬ ВТ_ТабБезПорядка
		|ИЗ
		|	ТабБезПорядка КАК ТабБезПорядка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОбъектИерархии,
		|	СтруктураИерархии,
		|	РодительИерархии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабБезПорядка.ОбъектИерархии,
		|	ТабБезПорядка.СтруктураИерархии
		|ИЗ
		|	ВТ_ТабБезПорядка КАК ТабБезПорядка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|		ПО ТабБезПорядка.ОбъектИерархии = торо_ОбъектыРемонта.Ссылка";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("СтруктураИерархии", масСИ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выгрузить();
	ПарамТаб = Выборка.Скопировать(,"ОбъектИерархии,СтруктураИерархии");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Таб.ОбъектИерархии КАК ОбъектИерерахии,
	|	Таб.СтруктураИерархии КАК СтруктураИерархии
	|ПОМЕСТИТЬ ВТ_ВсеОР
	|ИЗ
	|	&Таб КАК Таб
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектИерерахии,
	|	СтруктураИерархии
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ПорядокОРПоИерархии.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_ПорядокОРПоИерархии.СтруктураИерархии КАК СтруктураИерархии,
	|	торо_ПорядокОРПоИерархии.РеквизитДопУпорядочиванияОР
	|ПОМЕСТИТЬ ВТ_ЗначениеРеквизитаУпорядочивания
	|ИЗ
	|	РегистрСведений.торо_ПорядокОРПоИерархии КАК торо_ПорядокОРПоИерархии
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектРемонта,
	|	СтруктураИерархии
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеОР.ОбъектИерерахии КАК ОбъектРемонта,
	|	ВТ_ВсеОР.СтруктураИерархии КАК СтруктураИерархии,
	|	ЕСТЬNULL(ВТ_ЗначениеРеквизитаУпорядочивания.РеквизитДопУпорядочиванияОР, -1) КАК РеквизитДопУпорядочиванияОР
	|ИЗ
	|	ВТ_ВсеОР КАК ВТ_ВсеОР
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗначениеРеквизитаУпорядочивания КАК ВТ_ЗначениеРеквизитаУпорядочивания
	|		ПО ВТ_ВсеОР.ОбъектИерерахии = ВТ_ЗначениеРеквизитаУпорядочивания.ОбъектРемонта
	|			И ВТ_ВсеОР.СтруктураИерархии = ВТ_ЗначениеРеквизитаУпорядочивания.СтруктураИерархии
	|
	|УПОРЯДОЧИТЬ ПО
	|	РеквизитДопУпорядочиванияОР УБЫВ
	|ИТОГИ ПО
	|	СтруктураИерархии";
	
	Запрос.УстановитьПараметр("Таб", ПарамТаб);
	
	Результат = Запрос.Выполнить();
	ВыборкаПОСИ = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Тз = Новый ТаблицаЗначений;
	Тз.Колонки.Добавить("ОбъектРемонта", Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта"));
	Тз.Колонки.Добавить("СтруктураИерархии", Новый ОписаниеТипов("СправочникСсылка.торо_СтруктурыОР"));
	Тз.Колонки.Добавить("РеквизитДопУпорядочиванияОР", Новый ОписаниеТипов("Число",,новый КвалификаторыЧисла(5,2)));
	
	Пока ВыборкаПоСИ.Следующий() Цикл 
		
		Выборка = ВыборкаПоСИ.Выбрать();
		
		НадоЗаписать = Ложь;
		ПерваяСтрока = Истина;
		тз.Очистить();
		Пока Выборка.Следующий() цикл
			Если перваяСтрока тогда
				текИндекс = Выборка.РеквизитДопУпорядочиванияОР;
				текИндекс = ?(текИндекс = -1, 0, текИндекс);
				ПерваяСтрока = Ложь;
			КонецЕсли;
			
			нс = тз.Добавить();
			ЗаполнитьЗначенияСвойств(нс, Выборка);
			
			Если Выборка.РеквизитДопУпорядочиванияОР > 0 Тогда Продолжить; КонецЕсли;
			текИндекс = текИндекс + 1;
			нс.РеквизитДопУпорядочиванияОР = текИндекс;
			
			НадоЗаписать = Истина;
		КонецЦикла;
		
		Если НадоЗаписать Тогда
			НаборЗаписей = РегистрыСведений.торо_ПорядокОРПоИерархии.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.СтруктураИерархии.Установить(ВыборкаПоСИ.СтруктураИерархии);
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			
			НаборЗаписей.Загрузить(тз);
			
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьРегистр_ОбъектыРемонтаГруппы() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Таб.СтруктураИерархии,
	|	Таб.РодительИерархии
	|ПОМЕСТИТЬ Вт_ОрыИИерархии
	|ИЗ
	|	РегистрСведений.торо_ИерархическиеСтруктурыОР КАК Таб
	|ГДЕ
	|	Таб.СтруктураИерархии.СтроитсяАвтоматически = ЛОЖЬ
	|	И Таб.СтруктураИерархии.ИзменяетсяДокументами = ЛОЖЬ
	|	И Таб.РодительИерархии <> ЗНАЧЕНИЕ(Справочник.торо_ОбъектыРемонта.ПустаяСсылка)
	|	И НЕ Таб.РодительИерархии.ЭтоГруппа
	|	И НЕ Таб.ОбъектИерархии.Наименование ЕСТЬ NULL 
	|
	|СГРУППИРОВАТЬ ПО
	|	Таб.СтруктураИерархии,
	|	Таб.РодительИерархии
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вт_ОрыИИерархии.РодительИерархии КАК ОбъектИерархии,
	|	Вт_ОрыИИерархии.СтруктураИерархии КАК СтруктураИерархии,
	|	ИСТИНА КАК ОбъектГруппа
	|ИЗ
	|	Вт_ОрыИИерархии КАК Вт_ОрыИИерархии
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОбъектыРемонтаГруппы КАК торо_ОбъектыРемонтаГруппы
	|		ПО Вт_ОрыИИерархии.РодительИерархии = торо_ОбъектыРемонтаГруппы.ОбъектИерархии
	|			И Вт_ОрыИИерархии.СтруктураИерархии = торо_ОбъектыРемонтаГруппы.СтруктураИерархии
	|ГДЕ
	|	торо_ОбъектыРемонтаГруппы.ОбъектИерархии ЕСТЬ NULL 
	|ИТОГИ ПО
	|	СтруктураИерархии";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаПоСИ = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	
	НачатьТранзакцию();
	ОбработчикВыполненУспешно = Истина;
	
	Пока ВыборкаПоСИ.Следующий() Цикл
		
		набор = РегистрыСведений.торо_ОбъектыРемонтаГруппы.СоздатьНаборЗаписей();
		набор.Отбор.СтруктураИерархии.Установить(ВыборкаПоСИ.СтруктураИерархии);
		набор.Прочитать();
		
		Выборка = ВыборкаПоСИ.Выбрать();
		Пока Выборка.Следующий() Цикл
			нс = набор.Добавить();
			ЗаполнитьЗначенияСвойств(нс, Выборка);
		КонецЦикла;
		
		Попытка
			набор.Записать();
		Исключение
			ОбработчикВыполненУспешно = Ложь;
		КонецПопытки;
	КонецЦикла;
	
	ОбработчикВыполненУспешно = Истина;
	Если ОбработчикВыполненУспешно Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка,,, НСтр("es='La falta a добалении de las anotaciones en рс ""los Objetos de la reparación del grupo"".';ru='Ошибка при добалении записей в рс ""Объекты ремонта группы"".';en='An error occurred while adding entries to the ps ""Repair objects of a group"".'") + ОписаниеОшибки());
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбновитьДатыВыбытияВРегистре_торо_СтатусыОбъектовРемонтаВУчете() Экспорт
	
	НачатьТранзакцию();
	ОшибкаТранзакции = Ложь;
	
	Попытка
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_ВыбытиеОбъектаРемонта.Ссылка
		|ИЗ
		|	РегистрСведений.торо_СтатусыОбъектовРемонтаВУчете КАК торо_СтатусыОбъектовРемонтаВУчете
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ВыбытиеОбъектаРемонта КАК торо_ВыбытиеОбъектаРемонта
		|		ПО торо_СтатусыОбъектовРемонтаВУчете.Регистратор = торо_ВыбытиеОбъектаРемонта.Ссылка
		|			И торо_СтатусыОбъектовРемонтаВУчете.ОбъектРемонта = торо_ВыбытиеОбъектаРемонта.ОбъектРемонта
		|			И торо_СтатусыОбъектовРемонтаВУчете.Период <> торо_ВыбытиеОбъектаРемонта.ДатаСписания
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_ВыбытиеОбъектаРемонта.Ссылка
		|ИЗ
		|	РегистрСведений.торо_СтатусыОбъектовРемонтаВУчете КАК торо_СтатусыОбъектовРемонтаВУчете
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ВыбытиеОбъектаРемонта.СписокПодчиненныхСнятыхСУчета КАК торо_ВыбытиеОбъектаРемонтаСписокПодчиненныхСнятыхСучета
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ВыбытиеОбъектаРемонта КАК торо_ВыбытиеОбъектаРемонта
		|			ПО торо_ВыбытиеОбъектаРемонтаСписокПодчиненныхСнятыхСучета.Ссылка = торо_ВыбытиеОбъектаРемонта.Ссылка
		|		ПО торо_СтатусыОбъектовРемонтаВУчете.Регистратор = торо_ВыбытиеОбъектаРемонтаСписокПодчиненныхСнятыхСучета.Ссылка
		|			И торо_СтатусыОбъектовРемонтаВУчете.ОбъектРемонта = торо_ВыбытиеОбъектаРемонтаСписокПодчиненныхСнятыхСучета.ОбъектРемонта
		|ГДЕ
		|	торо_СтатусыОбъектовРемонтаВУчете.Период <> торо_ВыбытиеОбъектаРемонта.ДатаСписания");
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ДокОбъект.БезусловнаяЗапись = Истина;
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла;
	Исключение	
		ТекстОшибки = ОписаниеОшибки();
		ОшибкаТранзакции = Истина;
	КонецПопытки;
	
	Если НЕ ОшибкаТранзакции Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка,,, НСтр("es='No consiguió renovar las fechas de la salida de los objetos de la reparación.';ru='Не удалось обновить даты выбытия объектов ремонта.';en='Failed to update retirement dates of repair objects.'") + Символы.ПС + ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьДатыВыбытияВРегистре_торо_РегламентныеМероприятияИСпискиОбъектов() Экспорт
	
	НачатьТранзакцию();
	ОшибкаТранзакции = Ложь;
	
	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	торо_РегламентныеМероприятияИСпискиОбъектов.СписокОбъектов,
		|	торо_РегламентныеМероприятияИСпискиОбъектов.ВидМероприятия,
		|	торо_РегламентныеМероприятияИСпискиОбъектов.СпособУчетаДатыОтсчета
		|ИЗ
		|	РегистрСведений.торо_РегламентныеМероприятияИСпискиОбъектов КАК торо_РегламентныеМероприятияИСпискиОбъектов
		|ГДЕ
		|	торо_РегламентныеМероприятияИСпискиОбъектов.СпособУчетаДатыОтсчета = &СпособУчетаДатыОтсчета";
		
		Запрос.УстановитьПараметр("СпособУчетаДатыОтсчета", Перечисления.торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот.ИспользоватьДатуВводаВЭксплуатацию);
		Результат = Запрос.Выполнить().Выгрузить();
		
		мз = РегистрыСведений.торо_РегламентныеМероприятияИСпискиОбъектов.СоздатьМенеджерЗаписи();
		
		Для каждого текЗапись из Результат Цикл
			мз.СписокОбъектов = текЗапись.СписокОбъектов;
			мз.ВидМероприятия = текЗапись.ВидМероприятия;
			мз.Прочитать();
			
			Если мз.Выбран() Тогда
				мз.СпособУчетаДатыОтсчета = Перечисления.торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот.НеИспользоватьДатуВводаВЭксплуатацию;
				мз.Записать(Истина);
			КонецЕсли;
		КонецЦикла;
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		ОшибкаТранзакции = Истина;
	КонецПопытки;
	
	Если НЕ ОшибкаТранзакции Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка,,, 
			Нстр("es='No consiguió renovar el registro de las noticias ""las medidas De reglamento y las listas de los objetos"".';ru='Не удалось обновить регистр сведений ""Регламентные мероприятия и списки объектов"".';en='Failed to update the ""Scheduled events and object lists"" information register.'")+Символы.ПС+ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПерезаписатьВидыРемонта() Экспорт
	
	НачатьТранзакцию();
	ОшибкаТранзакции = Ложь;
	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	торо_ВидыРемонтов.Ссылка
		|ИЗ
		|	Справочник.торо_ВидыРемонтов КАК торо_ВидыРемонтов
		|ГДЕ
		|	НЕ торо_ВидыРемонтов.ПланГрафикППР
		|	И НЕ торо_ВидыРемонтов.ГрафикМероприятий
		|	И НЕ торо_ВидыРемонтов.Непериодический
		|	И НЕ торо_ВидыРемонтов.ЭтоГруппа";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ВРОбъект = Выборка.ССылка.ПолучитьОбъект();
			ВРОбъект.Непериодический 	= Истина;
			ВРОбъект.ГрафикМероприятий 	= Истина;
			ВРОбъект.ПланГрафикППР 		= Истина;
			ВРОбъект.Записать();
		КонецЦикла;
		
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡Перезапись de los tipos de la reparación no es cumplido! Por la causa: ';ru='Перезапись видов ремонта не выполнена! По причине: ';en='Overwriting repair types failed! Due to: '")+ОписаниеОшибки);
	КонецПопытки;   
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли; 	
	
КонецПроцедуры

Процедура СформироватьДвиженияРегламентныхАктовПоРегиструФактическиеМатериальныеЗатратыРемонтныхРабот() Экспорт
	
	ОшибкаТранзакции = Ложь;
	НачатьТранзакцию();
	Попытка
		
		// Выбрать проведенные документы, где есть хотя бы одна строка материальных затрат. 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_АктОВыполненииРегламентногоМероприятияМатериальныеЗатраты.Ссылка
		|ИЗ
		|	Документ.торо_АктОВыполненииРегламентногоМероприятия.МатериальныеЗатраты КАК торо_АктОВыполненииРегламентногоМероприятияМатериальныеЗатраты
		|ГДЕ
		|	торо_АктОВыполненииРегламентногоМероприятияМатериальныеЗатраты.Ссылка.Проведен";
		
		ВыборкаДокументов = Запрос.Выполнить().Выбрать();
		
		Пока ВыборкаДокументов.Следующий() Цикл
			
			ТаблицаМатериальныхЗатрат 	= ДвиженияРегламентныхАктов_ПодготовитьТаблицуМатериальныхЗатрат(ВыборкаДокументов.Ссылка);
			
			НаборЗаписей = РегистрыНакопления.торо_ФактическиеМатериальныеЗатратыРемонтныхРабот.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаДокументов.Ссылка);
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			
			Для Каждого ЗаписьМатериальныеЗатраты ИЗ ТаблицаМатериальныхЗатрат Цикл
				Движение = НаборЗаписей.Добавить();
				Движение.Регистратор = ВыборкаДокументов.Ссылка;
				Движение.ID = ЗаписьМатериальныеЗатраты.ID;
				Движение.РемонтыОборудования_ID = ЗаписьМатериальныеЗатраты.РемонтыОборудования_ID;
				Движение.Количество = ЗаписьМатериальныеЗатраты.Количество;
				Движение.Номенклатура = ЗаписьМатериальныеЗатраты.Номенклатура;
				Движение.Период = ЗаписьМатериальныеЗатраты.Период;
				Движение.РемонтнаяРабота = ЗаписьМатериальныеЗатраты.РемонтнаяРабота;
				Движение.ХарактеристикаНоменклатуры = ЗаписьМатериальныеЗатраты.ХарактеристикаНоменклатуры;
			КонецЦикла;

			НаборЗаписей.Записать(Истина);
		
		КонецЦикла;
		
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡Los movimientos de los documentos ""el Acta sobre la ejecución de la medida de reglamento"" por el registro de los gastos reales no son formados! Por la causa: ';ru='Движения документов ""Акт о выполнении регламентного мероприятия"" по регистру фактических материальных затрат НЕ сформированы! По причине: ';en='Documents ""Act on the implementation of regulatory activities"" on the register of actual material costs are NOT formed! Due to: '")+ОписаниеОшибки);
	КонецПопытки;
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

// 2.0.7.1

Процедура СформироватьДвиженияРегламентныхАктовПоРегиструФактическиеТрудовыеЗатратыРемонтныхРабот() Экспорт
	
	ОшибкаТранзакции = Ложь;
	НачатьТранзакцию();
	Попытка
		
		// Выбрать проведенные документы, где есть хотя бы одна строка материальных затрат. 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_АктОВыполненииРегламентногоМероприятияТрудовыеЗатраты.Ссылка
		|ИЗ
		|	Документ.торо_АктОВыполненииРегламентногоМероприятия.ТрудовыеЗатраты КАК торо_АктОВыполненииРегламентногоМероприятияТрудовыеЗатраты
		|ГДЕ
		|	торо_АктОВыполненииРегламентногоМероприятияТрудовыеЗатраты.Ссылка.Проведен";
		
		ВыборкаДокументов = Запрос.Выполнить().Выбрать();
		
		Пока ВыборкаДокументов.Следующий() Цикл
			
			ТаблицаТрудовыхЗатрат 	= ДвиженияРегламентныхАктов_ПодготовитьТаблицуТрудовыхЗатрат(ВыборкаДокументов.Ссылка);
			
			НаборЗаписей = РегистрыНакопления.торо_ФактическиеТрудовыеЗатратыРемонтныхРабот.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаДокументов.Ссылка);
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			
			Для Каждого ЗаписьТрудовыеЗатраты ИЗ ТаблицаТрудовыхЗатрат Цикл
				Движение = НаборЗаписей.Добавить();
				Движение.Регистратор = ВыборкаДокументов.Ссылка;
				Движение.ID = ЗаписьТрудовыеЗатраты.ID;
				Движение.РемонтыОборудования_ID = ЗаписьТрудовыеЗатраты.РемонтыОборудования_ID;
				Движение.Количество = ЗаписьТрудовыеЗатраты.Количество;
				Движение.Сотрудник = ЗаписьТрудовыеЗатраты.Сотрудник;
				Движение.Квалификация = ЗаписьТрудовыеЗатраты.Квалификация;
				Движение.Период = ЗаписьТрудовыеЗатраты.ДатаНачала;
				Движение.РемонтнаяРабота = ЗаписьТрудовыеЗатраты.РемонтнаяРабота;
				Движение.Сумма = ЗаписьТрудовыеЗатраты.Сумма;
				Движение.ВремяРаботы = ЗаписьТрудовыеЗатраты.ВремяРаботы;
			КонецЦикла;

			НаборЗаписей.Записать(Истина);
		
		КонецЦикла;
		
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡Los movimientos de los documentos ""el Acta sobre la ejecución de la medida de reglamento"" por el registro de los gastos reales laborales no son formados! Por la causa: ';ru='Движения документов ""Акт о выполнении регламентного мероприятия"" по регистру фактических трудовых затрат НЕ сформированы! По причине: ';en='Documents ""Act on the implementation of regulatory activities"" on the register of actual labor costs are NOT formed! Due to: '")+ОписаниеОшибки);
	КонецПопытки;
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

Функция ДвиженияРегламентныхАктов_ПодготовитьТаблицуМатериальныхЗатрат(Ссылка)
	
	ТаблицаМатериальныхЗатрат = РегистрыНакопления.торо_ФактическиеМатериальныеЗатратыРемонтныхРабот.СоздатьНаборЗаписей().Выгрузить();
			
	Если Ссылка.МатериальныеЗатраты.Количество()=0 Тогда
		Возврат ТаблицаМатериальныхЗатрат;
	КонецЕсли; 
	
	БуферМЗ = Ссылка.МатериальныеЗатраты.Выгрузить();
	БуферМЗ.Колонки.Добавить("Период");
	Для Каждого СтрокаТЗ Из БуферМЗ Цикл
		КоэффициентЕИ = СтрокаТЗ.ЕдиницаИзмерения.Коэффициент;
		СтрокаТЗ.Количество = СтрокаТЗ.Количество * ?(КоэффициентЕИ = 0, 1, КоэффициентЕИ);
		
		СтрокаРемонта = Ссылка.Мероприятия.Найти(СтрокаТЗ.РемонтыОборудования_ID);
		Если СтрокаРемонта <> Неопределено Тогда
			СтрокаТЗ.Период = СтрокаРемонта.ДатаОкончания;
		КонецЕсли;
	КонецЦикла;
	
	БуферМЗ.Свернуть("ID, РемонтыОборудования_ID, Номенклатура, ХарактеристикаНоменклатуры,Период", "Количество");
	
	Для Каждого СтрокаТЗ Из БуферМЗ Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЗ.ID) Тогда
			Продолжить;
		КонецЕсли;
		
		НайденнаяСтрокаТЗ = Ссылка.РемонтныеРаботы.Найти(СтрокаТЗ.ID, "ID");
		Если Не НайденнаяСтрокаТЗ = Неопределено Тогда
			НовСтрокаТЗ = ТаблицаМатериальныхЗатрат.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрокаТЗ, СтрокаТЗ);
			НовСтрокаТЗ.РемонтнаяРабота = НайденнаяСтрокаТЗ.РемонтнаяРабота;
		КонецЕсли; 
		
	КонецЦикла; 
	
	ТаблицаМатериальныхЗатрат.Свернуть("ID, РемонтыОборудования_ID, Номенклатура, ХарактеристикаНоменклатуры,Период, РемонтнаяРабота", "Количество");
	
	Возврат ТаблицаМатериальныхЗатрат;
	
КонецФункции

Функция ДвиженияРегламентныхАктов_ПодготовитьТаблицуТрудовыхЗатрат(Ссылка)
	
	ТаблицаТрудовыхЗатрат = РегистрыНакопления.торо_ФактическиеМатериальныеЗатратыРемонтныхРабот.СоздатьНаборЗаписей().Выгрузить();
			
	Если Ссылка.ТрудовыеЗатраты.Количество()=0 Тогда
		Возврат ТаблицаТрудовыхЗатрат;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.ID,
	               |	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.Родитель_ID,
	               |	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.РемонтыОборудования_ID,
	               |	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.РемонтнаяРабота
	               |ПОМЕСТИТЬ ТаблицаРемонтныхРаботНачало
	               |ИЗ
	               |	Документ.торо_АктОВыполненииРегламентногоМероприятия.РемонтныеРаботы КАК торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы
	               |ГДЕ
	               |	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	торо_АктОВыполненииРегламентногоМероприятияМероприятия.ID,
	               |	торо_АктОВыполненииРегламентногоМероприятияМероприятия.ДатаНачала
	               |ПОМЕСТИТЬ ТаблицаРемонтов
	               |ИЗ
	               |	Документ.торо_АктОВыполненииРегламентногоМероприятия.Мероприятия КАК торо_АктОВыполненииРегламентногоМероприятияМероприятия
	               |ГДЕ
	               |	торо_АктОВыполненииРегламентногоМероприятияМероприятия.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаДвижений.ID,
	               |	ТаблицаДвижений.Родитель_ID,
	               |	ТаблицаДвижений.РемонтыОборудования_ID,
	               |	ТаблицаДвижений.РемонтнаяРабота,
	               |	ТаблицаРемонтов.ДатаНачала
	               |ПОМЕСТИТЬ ТаблицаРемонтныхРабот
	               |ИЗ
	               |	ТаблицаРемонтныхРаботНачало КАК ТаблицаДвижений
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРемонтов КАК ТаблицаРемонтов
	               |		ПО ТаблицаДвижений.РемонтыОборудования_ID = ТаблицаРемонтов.ID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	торо_АктОВыполненииРегламентногоМероприятияТрудовыеЗатраты.Квалификация,
	               |	СУММА(торо_АктОВыполненииРегламентногоМероприятияТрудовыеЗатраты.СуммаКНачислению) КАК СуммаКНачислению,
	               |	СУММА(1) КАК Количество,
	               |	СУММА(торо_АктОВыполненииРегламентногоМероприятияТрудовыеЗатраты.ВремяРаботы) КАК ВремяРаботы,
	               |	торо_АктОВыполненииРегламентногоМероприятияТрудовыеЗатраты.ID,
	               |	торо_АктОВыполненииРегламентногоМероприятияТрудовыеЗатраты.РемонтыОборудования_ID,
	               |	торо_АктОВыполненииРегламентногоМероприятияТрудовыеЗатраты.Сотрудник
	               |ПОМЕСТИТЬ ТаблицаТрудозатратАкт
	               |ИЗ
	               |	Документ.торо_АктОВыполненииРегламентногоМероприятия.ТрудовыеЗатраты КАК торо_АктОВыполненииРегламентногоМероприятияТрудовыеЗатраты
	               |ГДЕ
	               |	торо_АктОВыполненииРегламентногоМероприятияТрудовыеЗатраты.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	торо_АктОВыполненииРегламентногоМероприятияТрудовыеЗатраты.Квалификация,
	               |	торо_АктОВыполненииРегламентногоМероприятияТрудовыеЗатраты.ID,
	               |	торо_АктОВыполненииРегламентногоМероприятияТрудовыеЗатраты.Сотрудник,
	               |	торо_АктОВыполненииРегламентногоМероприятияТрудовыеЗатраты.РемонтыОборудования_ID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаТрудозатратАкт.Квалификация,
	               |	СУММА(ТаблицаТрудозатратАкт.СуммаКНачислению) КАК Сумма,
	               |	СУММА(ТаблицаТрудозатратАкт.Количество) КАК Количество,
	               |	СУММА(ТаблицаТрудозатратАкт.ВремяРаботы) КАК ВремяРаботы,
	               |	ТаблицаТрудозатратАкт.ID,
	               |	ТаблицаРемонтныхРабот.РемонтнаяРабота,
	               |	ТаблицаТрудозатратАкт.Сотрудник,
	               |	ТаблицаТрудозатратАкт.РемонтыОборудования_ID,
	               |	ТаблицаРемонтныхРабот.ДатаНачала
	               |ИЗ
	               |	ТаблицаРемонтныхРабот КАК ТаблицаРемонтныхРабот
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТрудозатратАкт КАК ТаблицаТрудозатратАкт
	               |		ПО ТаблицаРемонтныхРабот.ID = ТаблицаТрудозатратАкт.ID
	               |			И ТаблицаРемонтныхРабот.РемонтыОборудования_ID = ТаблицаТрудозатратАкт.РемонтыОборудования_ID
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТаблицаТрудозатратАкт.Квалификация,
	               |	ТаблицаТрудозатратАкт.ID,
	               |	ТаблицаТрудозатратАкт.РемонтыОборудования_ID,
	               |	ТаблицаРемонтныхРабот.РемонтнаяРабота,
	               |	ТаблицаРемонтныхРабот.ДатаНачала,
	               |	ТаблицаТрудозатратАкт.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	Возврат Результат.Выгрузить();

	
КонецФункции

Процедура УстановитьПараметрыНаборовСвойств() Экспорт
	
	НачатьТранзакцию();
	ОшибкаТранзакции = Ложь;
	Попытка
		
		ПараметрыНабора = УправлениеСвойствами.СтруктураПараметровНабораСвойств();
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_КадровыйПеревод", ПараметрыНабора);
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_торо_ГрафикРегламентныхМероприятийТОиР", ПараметрыНабора);
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Справочник_СерииНоменклатуры", ПараметрыНабора);
		
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡La renovación de los parámetros de los juegos de las propiedades adicionales no es cumplido! Por la causa: ';ru='Обновление параметров наборов дополнительных свойств не выполнена! По причине: ';en='Updating parameters of sets of additional properties failed! Because of: '")+ОписаниеОшибки);
	КонецПопытки;   
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли; 	
	
КонецПроцедуры

Процедура ОбновлениеДокументовЦелевыхЗначенийПоказателейKPI() Экспорт
	
	НачатьТранзакцию();
	ОшибкаТранзакции = Ложь;
	Попытка
		
   	Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_УстановкаЦелевыхЗначенийПоказателейKPIКлючевыеПоказатели.Ссылка
		|ИЗ
		|	Документ.торо_УстановкаЦелевыхЗначенийПоказателейKPI.КлючевыеПоказатели КАК торо_УстановкаЦелевыхЗначенийПоказателейKPIКлючевыеПоказатели
		|ГДЕ
		|	торо_УстановкаЦелевыхЗначенийПоказателейKPIКлючевыеПоказатели.Ссылка.Проведен
		|	И торо_УстановкаЦелевыхЗначенийПоказателейKPIКлючевыеПоказатели.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяССылка)
		|	И торо_УстановкаЦелевыхЗначенийПоказателейKPIКлючевыеПоказатели.Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяССылка)
		|	И торо_УстановкаЦелевыхЗначенийПоказателейKPIКлючевыеПоказатели.ОбъектРемонта = ЗНАЧЕНИЕ(Справочник.торо_ОбъектыРемонта.ПустаяССылка)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
			Для каждого Строка из ДокОбъект.КлючевыеПоказатели Цикл
				Если НЕ ЗначениеЗаполнено(Строка.Организация) 
					И НЕ ЗначениеЗаполнено(Строка.Подразделение) 
					И НЕ ЗначениеЗаполнено(Строка.ОбъектРемонта) Тогда
					Строка.Организация = ДокОбъект.Организация;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡La renovación de la instalación de los significados con destinación especial de los índices KPI no es cumplida! Por la causa: ';ru='Обновление установки целевых значений показателей KPI не выполнено! По причине: ';en='KPI target setting update failed! Due to: '")+ОписаниеОшибки);
	КонецПопытки;   
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли; 	
	
КонецПроцедуры

Процедура ЗагрузитьПоставляемуюМодельПоказателейKPI() Экспорт
	
	НачатьТранзакцию();
	ОшибкаТранзакции = Ложь;
	Попытка
		
		торо_ПоказателиKPI.ВосстановитьПоставляемуюМодельПоказателей();
				
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡La carga del modelo suministrado de los índices KPI no es cumplida! Por la causa: ';ru='Загрузка поставляемой модели показателей KPI не выполнена! По причине: ';en='Downloading the supplied KPI scorecard failed! Due to: '")+ОписаниеОшибки);
	КонецПопытки;   
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли; 	
	
КонецПроцедуры

Процедура УстановитьОсновныеПоказателиНаработки() Экспорт
	
	НачатьТранзакцию();
	ОшибкаТранзакции = Ложь;
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ПараметрыНаработкиОбъектовРемонтаСрезПоследних.Период КАК Период,
		|	торо_ПараметрыНаработкиОбъектовРемонтаСрезПоследних.ОбъектРемонта КАК ОбъектРемонта,
		|	торо_ПараметрыНаработкиОбъектовРемонтаСрезПоследних.Показатель,
		|	торо_ПараметрыНаработкиОбъектовРемонтаСрезПоследних.ПлановаяНаработка,
		|	торо_ПараметрыНаработкиОбъектовРемонтаСрезПоследних.ПериодПлановойНаработки,
		|	торо_ПараметрыНаработкиОбъектовРемонтаСрезПоследних.ПродолжительностьПериодаПлановойНаработки,
		|	торо_ПараметрыНаработкиОбъектовРемонтаСрезПоследних.КоэффициентИспользованияОборудования
		|ПОМЕСТИТЬ ВТ_Срез
		|ИЗ
		|	РегистрСведений.торо_ПараметрыНаработкиОбъектовРемонта.СрезПоследних(, ОбъектРемонта ССЫЛКА Справочник.торо_ОбъектыРемонта) КАК торо_ПараметрыНаработкиОбъектовРемонтаСрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОбъектРемонта,
		|	Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Срез.ОбъектРемонта КАК ОбъектРемонта,
		|	МИНИМУМ(ВТ_Срез.Период) КАК Период
		|ПОМЕСТИТЬ ВТ_МинДаты
		|ИЗ
		|	ВТ_Срез КАК ВТ_Срез
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Срез.ОбъектРемонта
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОбъектРемонта,
		|	Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Срез.Период,
		|	ВТ_Срез.ОбъектРемонта,
		|	ВТ_Срез.Показатель,
		|	ВТ_Срез.ПлановаяНаработка,
		|	ВТ_Срез.ПериодПлановойНаработки,
		|	ВТ_Срез.ПродолжительностьПериодаПлановойНаработки,
		|	ВТ_Срез.КоэффициентИспользованияОборудования
		|ИЗ
		|	ВТ_МинДаты КАК ВТ_МинДаты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Срез КАК ВТ_Срез
		|		ПО ВТ_МинДаты.ОбъектРемонта = ВТ_Срез.ОбъектРемонта
		|			И ВТ_МинДаты.Период = ВТ_Срез.Период";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Запись = РегистрыСведений.торо_ПараметрыНаработкиОбъектовРемонта.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись,Выборка);
			Запись.Основной = Истина;
			Запись.Записать(Истина);
		КонецЦикла;
		
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡La instalación de los índices básicos de la elaboración no es cumplida! Por la causa: ';ru='Установка основных показателей наработки не выполнена! По причине: ';en='Setting the key operating indicators has not been completed! Due to: '")+ОписаниеОшибки);
	КонецПопытки;   
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли; 	
	
КонецПроцедуры

Процедура ОбнвлениеРегистра_ЗаказыНаРемонтВЕРП() Экспорт
	
	НачатьТранзакцию();
	ОшибкаТранзакции = Ложь;
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	торо_ЗаказыНаРемонтВЕРП.УникальныйИдентификатор КАК УникальныйИдентификатор
		               |ПОМЕСТИТЬ ЗаказыВЕРП
		               |ИЗ
		               |	РегистрСведений.торо_ЗаказыНаРемонтВЕРП КАК торо_ЗаказыНаРемонтВЕРП
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	УникальныйИдентификатор
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	торо_РемонтыСрезПоследних.Регистратор КАК Регистратор,
		               |	торо_РемонтыСрезПоследних.ID КАК ID,
		               |	ВЫБОР
		               |		КОГДА ТИПЗНАЧЕНИЯ(торо_РемонтыСрезПоследних.Регистратор) = ТИП(Документ.торо_ВнешнееОснованиеДляРабот)
		               |			ТОГДА 0
		               |		КОГДА ТИПЗНАЧЕНИЯ(торо_РемонтыСрезПоследних.Регистратор) = ТИП(Документ.торо_ВыявленныеДефекты)
		               |			ТОГДА 1
		               |		КОГДА ТИПЗНАЧЕНИЯ(торо_РемонтыСрезПоследних.Регистратор) = ТИП(Документ.торо_ЗаявкаНаРемонт)
		               |			ТОГДА 2
		               |		КОГДА ТИПЗНАЧЕНИЯ(торо_РемонтыСрезПоследних.Регистратор) = ТИП(Документ.торо_НарядНаВыполнениеРемонтныхРабот)
		               |			ТОГДА 4
		               |		КОГДА ТИПЗНАЧЕНИЯ(торо_РемонтыСрезПоследних.Регистратор) = ТИП(Документ.торо_АктОВыполненииЭтапаРабот)
		               |			ТОГДА 5
		               |		КОГДА ТИПЗНАЧЕНИЯ(торо_РемонтыСрезПоследних.Регистратор) = ТИП(Документ.торо_ПланГрафикРемонта)
		               |			ТОГДА 0
		               |		ИНАЧЕ 0
		               |	КОНЕЦ КАК Приоритет
		               |ПОМЕСТИТЬ ВсеДокументыВЦепочке
		               |ИЗ
		               |	РегистрСведений.торо_Ремонты.СрезПоследних(
		               |			&Период,
		               |			ID В
		               |				(ВЫБРАТЬ
		               |					Таб.УникальныйИдентификатор
		               |				ИЗ
		               |					ЗаказыВЕРП КАК Таб)) КАК торо_РемонтыСрезПоследних
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ID,
		               |	Приоритет
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВсеДокументыВЦепочке.Регистратор КАК Регистратор,
		               |	ВсеДокументыВЦепочке.ID КАК ID,
		               |	МАКСИМУМ(ВсеДокументыВЦепочке.Приоритет) КАК Приоритет
		               |ПОМЕСТИТЬ МаксПриоритетВЦепочке
		               |ИЗ
		               |	ВсеДокументыВЦепочке КАК ВсеДокументыВЦепочке
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВсеДокументыВЦепочке.Регистратор,
		               |	ВсеДокументыВЦепочке.ID
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ID,
		               |	Приоритет
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ВсеДокументыВЦепочке.Регистратор КАК Регистратор,
		               |	ВсеДокументыВЦепочке.ID КАК ID
		               |ПОМЕСТИТЬ СписокПроведенныхДокументов
		               |ИЗ
		               |	ВсеДокументыВЦепочке КАК ВсеДокументыВЦепочке
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксПриоритетВЦепочке КАК МаксПриоритетВЦепочке
		               |		ПО ВсеДокументыВЦепочке.ID = МаксПриоритетВЦепочке.ID
		               |			И ВсеДокументыВЦепочке.Приоритет = МаксПриоритетВЦепочке.Приоритет
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ID
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЕСТЬNULL(СписокПроведенныхДокументов.ID, ЗаказыВЕРП.УникальныйИдентификатор) КАК ID,
		               |	ЕСТЬNULL(СписокПроведенныхДокументов.Регистратор, ЗНАЧЕНИЕ(Документ.торо_ВыявленныеДефекты.ПустаяСсылка)) КАК Регистратор,
		               |	ВЫБОР
		               |		КОГДА СписокПроведенныхДокументов.Регистратор ЕСТЬ NULL
		               |			ТОГДА ИСТИНА
		               |		ИНАЧЕ ЛОЖЬ
		               |	КОНЕЦ КАК ОтменаПроведения
		               |ИЗ
		               |	СписокПроведенныхДокументов КАК СписокПроведенныхДокументов
		               |		ПОЛНОЕ СОЕДИНЕНИЕ ЗаказыВЕРП КАК ЗаказыВЕРП
		               |		ПО СписокПроведенныхДокументов.ID = ЗаказыВЕРП.УникальныйИдентификатор
		               |ИТОГИ
		               |	МАКСИМУМ(ОтменаПроведения)
		               |ПО
		               |	Регистратор";
					   
		Запрос.УстановитьПараметр("Период", ТекущаяДата());
		резЗапроса = Запрос.Выполнить();
		Если НЕ резЗапроса.Пустой() Тогда
			Таблица_ID = Новый ТаблицаЗначений;
			Таблица_ID.Колонки.Добавить("ID", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(36, ДопустимаяДлина.Фиксированная)));
			ВыборкаПоДок = резЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоДок.Следующий() Цикл
				ВыборкаДЗ = ВыборкаПоДок.Выбрать();
				Таблица_ID.Очистить();
				Пока ВыборкаДЗ.Следующий() Цикл
					нс = Таблица_ID.Добавить();
					нс.ID = ВыборкаДЗ.ID;
				КонецЦикла;
				РегистрыСведений.торо_ЗаказыНаРемонтВЕРП.АктуализироватьЗаписиРегистра(ВыборкаПоДок.Регистратор, ВыборкаПоДок.ОтменаПроведения, Таблица_ID);
			КонецЦикла;
		КонецЕсли;			
		
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,, НСтр("es='¡La renovación del registro ""los Encargos de la reparación ВЕРП"" no es cumplida! Por la causa: ';ru='Обновление регистра ""Заказы на ремонт ВЕРП"" не выполнено! По причине: ';en='Updating the VERP Repair Orders register failed! Due to: '")+ОписаниеОшибки);
	КонецПопытки;   
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли; 	
	
КонецПроцедуры

// 2.0.8.1

Процедура ДозаполнениеРегистра_ВыявленныеДефекты() Экспорт
	
	НачатьТранзакцию();
	ОшибкаТранзакции = Ложь;
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ВыявленныеДефектыСписокДефектов.Ссылка КАК Ссылка,
		|	торо_ВыявленныеДефектыСписокДефектов.ID,
		|	торо_ВыявленныеДефектыСписокДефектов.ДефектОписание,
		|	торо_ВыявленныеДефектыСписокДефектов.НаправлениеНаУстранение
		|ИЗ
		|	Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов
		|ГДЕ
		|	(торо_ВыявленныеДефектыСписокДефектов.ДефектОписание <> """"
		|			ИЛИ торо_ВыявленныеДефектыСписокДефектов.НаправлениеНаУстранение <> """")
		|	И торо_ВыявленныеДефектыСписокДефектов.Ссылка.Проведен = ИСТИНА
		|ИТОГИ ПО
		|	Ссылка";
		
		Результат = Запрос.Выполнить();
		ВыборкаСсылок = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
		
		Пока ВыборкаСсылок.Следующий() Цикл
			ВыборкаДеталей = ВыборкаСсылок.Выбрать(ОбходРезультатаЗапроса.Прямой);
			
			НаборЗаписей = РегистрыСведений.торо_ВыявленныеДефекты.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаСсылок.Ссылка);
			НаборЗаписей.Прочитать();
			
			Для Каждого Запись из НаборЗаписей Цикл
				ВыборкаДеталей.Сбросить();
				Если ВыборкаДеталей.НайтиСледующий(Запись.ID, "ID") Тогда
					Запись.ДефектОписание = ВыборкаДеталей.ДефектОписание;
					Запись.НаправлениеНаУстранение = ВыборкаДеталей.НаправлениеНаУстранение;
				КонецЕсли;
			КонецЦикла;
			
			НаборЗаписей.Записать(Истина);
				
		КонецЦикла;
		
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡Дозаполнение del registro ""los defectos Revelados"" no es cumplido! Por la causa: ';ru='Дозаполнение регистра ""Выявленные дефекты"" не выполнено! По причине: ';en='Filling of the register ""Identified defects"" failed! Due to: '")+ОписаниеОшибки);
	КонецПопытки;   
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли; 	
	
КонецПроцедуры

Процедура ЗаполнитьСвойстваВидовКонтактнойИнформации() Экспорт
	
	НачатьТранзакцию();
	ОшибкаТранзакции = Ложь;
	Попытка
		// СтандартныеПодсистемы 
		// СтандартныеПодсистемы.Пользователи.
		ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.EmailПользователя,
			Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, 	Истина, Ложь, Ложь, 1);
		ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.ТелефонПользователя,
			Перечисления.ТипыКонтактнойИнформации.Телефон,               	Истина, Ложь, Ложь, 2);
		// Конец СтандартныеПодсистемы.Пользователи
		
		// СтандартныеПодсистемы.Организации
		ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации,
			Перечисления.ТипыКонтактнойИнформации.Адрес,                 	Истина, Ложь, Истина, 12);
		ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации,
			Перечисления.ТипыКонтактнойИнформации.Адрес,                 	Истина, Ложь,   Ложь, 13);
		ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации,
			Перечисления.ТипыКонтактнойИнформации.Телефон,               	Истина, Ложь,   Ложь, 14);
		ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.ФаксОрганизации,
			Перечисления.ТипыКонтактнойИнформации.Факс,                  	Истина, Ложь,   Ложь, 15);
		ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.EmailОрганизации,
			Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, 	Истина, Ложь,   Ложь, 16);
		ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресОрганизации,
			Перечисления.ТипыКонтактнойИнформации.Адрес,                 	Истина, Ложь,   Ложь, 17);
		ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.ДругаяИнформацияОрганизации,
			Перечисления.ТипыКонтактнойИнформации.Другое,                	Истина, Ложь,   Ложь, 18);
		// Конец СтандартныеПодсистемы.Организации
		// Конец СтандартныеПодсистемы 
		
		// Справочник "Физические лица"
		ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица,
			Перечисления.ТипыКонтактнойИнформации.Телефон,					Истина, Ложь, Ложь, 20);
		ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица,
			Перечисления.ТипыКонтактнойИнформации.Телефон,					Истина, Ложь, Ложь, 22);
		ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.АдресДляИнформированияФизическиеЛица,
			Перечисления.ТипыКонтактнойИнформации.Адрес,					Истина, Ложь, Ложь, 23);
		ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.ТелефонДомашнийФизическиеЛица,
			Перечисления.ТипыКонтактнойИнформации.Телефон,					Истина, Ложь, Ложь, 24);
		ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.АдресЗаПределамиРФФизическиеЛица,
			Перечисления.ТипыКонтактнойИнформации.Адрес,					Истина, Ложь, Ложь, 25);
		ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица,
			Перечисления.ТипыКонтактнойИнформации.Адрес,					Истина, Ложь, Ложь, 26);
		ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица,
			Перечисления.ТипыКонтактнойИнформации.Адрес,					Истина, Ложь, Ложь, 27);
		
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,, НСтр("es='¡La renovación de los tipos de la información de contacto no es cumplida! Por la causa: ';ru='Обновление типов контактной информации не выполнено! По причине: ';en='Contact types update failed! Due to: '")+ОписаниеОшибки);
	КонецПопытки;   
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли; 	
		
КонецПроцедуры

Процедура ЗаполнениеНастройки_ИерархияДляМобильногоПриложения() Экспорт
	
	НачатьТранзакцию();
	ОшибкаТранзакции = Ложь;
	Попытка

	СписокПользователей = ПользователиИнформационнойБазы.ПолучитьПользователей();
	
	Для каждого ПользовательИБ из СписокПользователей Цикл
		ОсновнаяСтруктураИерархии = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			"НастройкиТОиР",
			"ОсновнаяСтруктураИерархии",
			Справочники.торо_СтруктурыОР.ПустаяСсылка(),,
			ПользовательИБ.Имя);

		Если ЗначениеЗаполнено(ОсновнаяСтруктураИерархии) И НЕ ОсновнаяСтруктураИерархии.СтроитсяАвтоматически Тогда
			ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
				"НастройкиТОиР",
				"ИерархияДляМобильногоПриложения",
				ОсновнаяСтруктураИерархии,,
				ПользовательИБ.Имя, Истина);
		КонецЕсли;
	КонецЦикла;
	
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡El relleno del ajuste ""la Jerarquía para мобльного las aplicaciones"" no es cumplido! Por la causa: ';ru='Заполнение настройки ""Иерархия для мобльного приложения"" не выполнено! По причине: ';en='Filling in the ""Hierarchy for mobile application"" setting failed! Because of: '")+ОписаниеОшибки);
	КонецПопытки;   
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли; 	
	
КонецПроцедуры

// 2.0.9.1
Процедура ОбновлениеСправочника_КвалификацииРемонтногоПерсонала() Экспорт
	
	НачатьТранзакцию();
	ОшибкаТранзакции = Ложь;
	Попытка
		ВыборкаКвалификаций = Справочники.торо_КвалификацииРемонтногоПерсонала.Выбрать();
		НеобработанныеОбъекты = Новый Массив;
		МассивИспользованныхКодов = Новый Массив;
		КоличествоОбъектов = 0;
		Пока ВыборкаКвалификаций.Следующий() Цикл
			Код = СокрЛП(Строка(ВыборкаКвалификаций.Код));
			КоличествоОбъектов = КоличествоОбъектов + 1;
			Разница = 9 - СтрДлина(Код);
			Если Разница > 0 Тогда
				Для Счетчик = 0 По Разница-1 Цикл
					Код = "0" + Код;	
				КонецЦикла;
				НайденныйОбъект = Справочники.торо_КвалификацииРемонтногоПерсонала.НайтиПоКоду(Код);
				ОбъектКвалификации = ВыборкаКвалификаций.ПолучитьОбъект();
				Если НайденныйОбъект = Неопределено Тогда
					ОбъектКвалификации.Код = Код;
					МассивИспользованныхКодов.Добавить(Код);
				Иначе
					НеобработанныеОбъекты.Добавить(ОбъектКвалификации);
				КонецЕсли; 
				ОбъектКвалификации.Записать();
			Иначе
				МассивИспользованныхКодов.Добавить(Код);
			КонецЕсли;
		КонецЦикла;
		Для каждого Квалификация Из НеобработанныеОбъекты Цикл
			Для Счетчик = 1 По КоличествоОбъектов + 1 Цикл
				ПробныйКод = Формат(Счетчик, "ЧЦ=9; ЧВН=; ЧГ=0");
				НайденныйКод = МассивИспользованныхКодов.Найти(ПробныйКод);
				Если НайденныйКод = Неопределено Тогда
					Квалификация.Код = ПробныйКод;
					Квалификация.Записать();
					МассивИспользованныхКодов.Добавить(ПробныйКод);
					Прервать;
				КонецЕсли; 
			КонецЦикла; 		
		КонецЦикла;  
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡La renovación de los códigos de las calificaciones no es cumplida! Por la causa: ';ru='Обновление кодов квалификаций не выполнено! По причине: ';en='Qualification code update failed! Due to: '")+ОписаниеОшибки);
	КонецПопытки;   
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли; 	

КонецПроцедуры

// 2.0.10.1
Процедура ЗаписьНастроекПодключенияКСерверуСЛК() Экспорт
	
	НачатьТранзакцию();
	ОшибкаТранзакции = Ложь;
	Попытка
		ПараметрыПодключения = Новый Структура;
		ПараметрыПодключения.Вставить("Host", Константы.торо_АдресСервераСЛК.Получить());
		ПараметрыПодключения.Вставить("Port", СтрЗаменить(Константы.торо_ПортСервераСЛК.Получить(), " ", ""));
		ПараметрыПодключения.Вставить("ФайлыДанных", Новый Соответствие);
		слкМенеджерЗащитыСервер.СохранитьНастройкиМенеджераСерииЗащиты("28DD", ПараметрыПодключения);
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡La anotación de los ajustes de la conexión al servidor СЛК no es cumplido! Por la causa: ';ru='Запись настроек подключения к серверу СЛК не выполнено! По причине: ';en='Writing of settings for connecting to the SLK server failed! Because of: '")+ОписаниеОшибки);
	КонецПопытки;   
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли; 	
	
КонецПроцедуры

Процедура УстановитьПараметрыНаборовСвойствДокументов() Экспорт
	
	НачатьТранзакцию();
	ОшибкаТранзакции = Ложь;
	Попытка
		
		ПараметрыНабора = УправлениеСвойствами.СтруктураПараметровНабораСвойств();
		
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_торо_АктОВыполненииРегламентногоМероприятия", ПараметрыНабора);
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_торо_АктОВыполненииЭтапаРабот", ПараметрыНабора);
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_торо_АктПриемкиОборудования", ПараметрыНабора);
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_торо_ВводНачальныхДанных", ПараметрыНабора);
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_торо_ВнешнееОснованиеДляРабот", ПараметрыНабора);
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_ВнутреннееПотреблениеТоваров", ПараметрыНабора);
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_торо_ВыбытиеОбъектаРемонта", ПараметрыНабора);
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_торо_ВыявленныеДефекты", ПараметрыНабора);
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_торо_ГрафикРегламентныхМероприятийТОиР", ПараметрыНабора);
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_ЗаказНаВнутреннееПотребление", ПараметрыНабора);
		
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_торо_ЗакрытиеЗаявокИРемонтов", ПараметрыНабора);
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_торо_КомиссионноеРассмотрение", ПараметрыНабора);
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_торо_ЗаявкаНаРемонт", ПараметрыНабора);
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_торо_ИзменениеПоложенияВСтруктуреИерархии", ПараметрыНабора);
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_торо_ИзменениеСоставаРемонтнойБригады", ПараметрыНабора);
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_КадровыйПеревод", ПараметрыНабора);
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_торо_НарядНаВыполнениеРемонтныхРабот", ПараметрыНабора);
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_торо_НарядНаРегламентноеМероприятие", ПараметрыНабора);
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_торо_НастройкаРегистрацииНаработкиЗависимыхОР", ПараметрыНабора);
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_ОприходованиеИзлишковТоваров", ПараметрыНабора);
		
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_торо_ОстановочныеРемонты", ПараметрыНабора);
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_торо_ОценкаРаботыПодрядчика", ПараметрыНабора);
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_ПеремещениеТоваров", ПараметрыНабора);
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_торо_ПланГрафикРемонта", ПараметрыНабора);
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_ПоступлениеТоваровУслуг", ПараметрыНабора);
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_ПриемНаРаботу", ПараметрыНабора);
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_торо_ПринятиеОРКУчету", ПараметрыНабора);
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_торо_ПрисвоениеКвалификацийСотрудникам", ПараметрыНабора);
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_торо_РегистрацияЗначенийВнешнихПоказателейKPI", ПараметрыНабора);
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_торо_СостоянияОбъектовРемонта", ПараметрыНабора);
		
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_СписаниеНедостачТоваров", ПараметрыНабора);
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_Увольнение", ПараметрыНабора);
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_торо_УстановкаАналоговНоменклатурыДляРемонтов", ПараметрыНабора);
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_торо_УстановкаКоэффициентовПереводаСтоимостейРемонтов", ПараметрыНабора);
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_торо_УстановкаКоэффициентовРемонтныхОсобенностей", ПараметрыНабора);
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_торо_УстановкаЛимитаНаПлановыеРемонтныеРаботы", ПараметрыНабора);
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_торо_УстановкаМинимальногоОстаткаНоменклатуры", ПараметрыНабора);
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_торо_УстановкаПроизвольногоЗначенияНаработки", ПараметрыНабора);
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_торо_УстановкаСтоимостейКвалификаций", ПараметрыНабора);
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_торо_УстановкаЦелевыхЗначенийПоказателейKPI", ПараметрыНабора);
		
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_УстановкаЦенНоменклатуры", ПараметрыНабора);
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_торо_УчетКонтролируемыхПоказателей", ПараметрыНабора);
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_торо_УчетНаработкиОборудования", ПараметрыНабора);
		
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡La renovación de los parámetros de los juegos de las propiedades adicionales no es cumplido! Por la causa: ';ru='Обновление параметров наборов дополнительных свойств не выполнена! По причине: ';en='Updating parameters of sets of additional properties failed! Because of: '")+ОписаниеОшибки);		
	КонецПопытки;   
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли; 	
	
КонецПроцедуры

Процедура ОбновлениеСправочникаТехнологическихКарт() Экспорт
	
	НачатьТранзакцию();
	ОшибкаТранзакции = Ложь;
	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ТехКартыМатериальныеЗатраты.Ссылка КАК Ссылка,
		|	торо_ТехКартыМатериальныеЗатраты.НомерСтроки КАК НомерСтроки,
		|	торо_ТехКартыМатериальныеЗатраты.ID КАК ID,
		|	торо_ТехКартыМатериальныеЗатраты.Операция КАК Операция
		|ПОМЕСТИТЬ ВТ_Ссылки
		|ИЗ
		|	Справочник.торо_ТехКарты.МатериальныеЗатраты КАК торо_ТехКартыМатериальныеЗатраты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ТехКарты.СписокОпераций КАК торо_ТехКартыСписокОпераций
		|		ПО торо_ТехКартыМатериальныеЗатраты.ID = торо_ТехКартыСписокОпераций.ID
		|ГДЕ
		|	торо_ТехКартыСписокОпераций.ID ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_ТехКартыТрудовыеЗатраты.Ссылка,
		|	торо_ТехКартыТрудовыеЗатраты.НомерСтроки,
		|	торо_ТехКартыТрудовыеЗатраты.ID,
		|	торо_ТехКартыТрудовыеЗатраты.Операция
		|ИЗ
		|	Справочник.торо_ТехКарты.ТрудовыеЗатраты КАК торо_ТехКартыТрудовыеЗатраты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ТехКарты.СписокОпераций КАК торо_ТехКартыСписокОпераций
		|		ПО торо_ТехКартыТрудовыеЗатраты.ID = торо_ТехКартыСписокОпераций.ID
		|ГДЕ
		|	торо_ТехКартыСписокОпераций.ID ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_ТехКартыИнструментыИТехника.Ссылка,
		|	торо_ТехКартыИнструментыИТехника.НомерСтроки,
		|	торо_ТехКартыИнструментыИТехника.ID,
		|	торо_ТехКартыИнструментыИТехника.Операция
		|ИЗ
		|	Справочник.торо_ТехКарты.ИнструментыИТехника КАК торо_ТехКартыИнструментыИТехника
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ТехКарты.СписокОпераций КАК торо_ТехКартыСписокОпераций
		|		ПО торо_ТехКартыИнструментыИТехника.ID = торо_ТехКартыСписокОпераций.ID
		|ГДЕ
		|	торо_ТехКартыСписокОпераций.ID ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Ссылки.Ссылка КАК Ссылка,
		|	ВТ_Ссылки.ID КАК Айди,
		|	ВТ_Ссылки.Операция КАК Операция
		|ИЗ
		|	ВТ_Ссылки КАК ВТ_Ссылки
		|ИТОГИ ПО
		|	Ссылка";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаПоСсылке = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПоСсылке.Следующий() Цикл
			ВыборкаЗатрат = ВыборкаПоСсылке.Выбрать();
			ТехКарта = ВыборкаПоСсылке.Ссылка.ПолучитьОбъект();
			Пока ВыборкаЗатрат.Следующий() Цикл
				МассивМатЗатрат = ТехКарта.МатериальныеЗатраты.НайтиСтроки(Новый Структура("ID, Операция", ВыборкаЗатрат.Айди, ВыборкаЗатрат.Операция));
				Для каждого Элемент Из МассивМатЗатрат Цикл
					ТехКарта.МатериальныеЗатраты.Удалить(Элемент);	
				КонецЦикла;			
				
				МассивТрудЗатрат = ТехКарта.ТрудовыеЗатраты.НайтиСтроки(Новый Структура("ID, Операция", ВыборкаЗатрат.Айди, ВыборкаЗатрат.Операция));
				Для каждого Элемент Из МассивТрудЗатрат Цикл
					ТехКарта.ТрудовыеЗатраты.Удалить(Элемент);	
				КонецЦикла;
				
				МассивИнструментов = ТехКарта.ИнструментыИТехника.НайтиСтроки(Новый Структура("ID, Операция", ВыборкаЗатрат.Айди, ВыборкаЗатрат.Операция));
				Для каждого Элемент Из МассивИнструментов Цикл
					ТехКарта.ИнструментыИТехника.Удалить(Элемент);	
				КонецЦикла;			
				
			КонецЦикла; 
			ТехКарта.Записать();
		КонецЦикла;

	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡La renovación de las partes tabulares de las tarjetas tecnológicas no es cumplida! Por la causa: ';ru='Обновление табличных частей технологических карт не выполнено! По причине: ';en='Updating the tabular parts of the technological maps failed! Due to: '")+ОписаниеОшибки);		
	КонецПопытки;   
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли; 	

КонецПроцедуры

Процедура ОбновлениеДокументовЗакрытияЗаявокИРемонтов() Экспорт
	
	НачатьТранзакцию();
	ОшибкаТранзакции = Ложь;
	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеРемонты.Ссылка КАК ЗакрытиеСсылка,
		               |	торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеРемонты.ID КАК ID,
		               |	ЕСТЬNULL(торо_ПлановыеРемонтныеРаботыСрезПоследних.Регистратор, торо_ВыявленныеДефектыСписокДефектов.Ссылка) КАК ДокументОснование
		               |ИЗ
		               |	Документ.торо_ЗакрытиеЗаявокИРемонтов.ЗакрываемыеРемонты КАК торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеРемонты
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(, Регистратор ССЫЛКА Документ.торо_ПланГрафикРемонта) КАК торо_ПлановыеРемонтныеРаботыСрезПоследних
		               |		ПО торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеРемонты.ID = торо_ПлановыеРемонтныеРаботыСрезПоследних.ID
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов
		               |		ПО торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеРемонты.ID = торо_ВыявленныеДефектыСписокДефектов.ID
		               |ГДЕ
		               |	торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеРемонты.ДокументОснование = НЕОПРЕДЕЛЕНО
		               |ИТОГИ ПО
		               |	ЗакрытиеСсылка";
					   
		ВыборкаЗакрытия = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаЗакрытия.Следующий() Цикл
			ДокЗакрытия = ВыборкаЗакрытия.ЗакрытиеСсылка.ПолучитьОбъект();
			ВыборкаОснований = ВыборкаЗакрытия.Выбрать();
			Пока ВыборкаОснований.Следующий() Цикл
				МассивСтрок = ДокЗакрытия.ЗакрываемыеРемонты.НайтиСтроки(Новый Структура("ID", ВыборкаОснований.ID));
				Для каждого Строка Из МассивСтрок Цикл
					Строка.ДокументОснование = ВыборкаОснований.ДокументОснование;
				КонецЦикла; 
			КонецЦикла; 
			ДокЗакрытия.Записать();
		КонецЦикла; 		
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡La renovación de los documentos del cierre de las demandas y las reparaciones no es cumplida! Por la causa: ';ru='Обновление документов закрытия заявок и ремонтов не выполнено! По причине: ';en='Updating of documents for closing applications and repairs failed! Due to: '")+ОписаниеОшибки);		
	КонецПопытки;   
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли; 	
	
КонецПроцедуры

// 2.0.11.1
Процедура ОбновлениеУпорядочиванияОбъектовРемонта() Экспорт
	
	НачатьТранзакцию();
	ОшибкаТранзакции = Ложь;
	
	Попытка
	
		ВыборкаСтруктурОР = Справочники.торо_СтруктурыОР.Выбрать();
		
		Пока ВыборкаСтруктурОР.Следующий() Цикл
			
			ЗапросДляПроверкиНаличияДублей = Новый Запрос;
			ЗапросДляПроверкиНаличияДублей.Текст = 
			"ВЫБРАТЬ
			|	торо_ПорядокОРПоИерархии.РеквизитДопУпорядочиванияОР КАК РеквизитДопУпорядочиванияОР,
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ торо_ПорядокОРПоИерархии.ОбъектРемонта) КАК ОбъектРемонта
			|ИЗ
			|	РегистрСведений.торо_ПорядокОРПоИерархии КАК торо_ПорядокОРПоИерархии
			|ГДЕ
			|	торо_ПорядокОРПоИерархии.СтруктураИерархии = &СтруктураИерархии
			|
			|СГРУППИРОВАТЬ ПО
			|	торо_ПорядокОРПоИерархии.РеквизитДопУпорядочиванияОР
			|
			|ИМЕЮЩИЕ
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ торо_ПорядокОРПоИерархии.ОбъектРемонта) > 1";
												   
			ЗапросДляПроверкиНаличияДублей.Параметры.Вставить("СтруктураИерархии", ВыборкаСтруктурОР.Ссылка);
			РезультатЗапросаДляПроверкиНаличияДублей = ЗапросДляПроверкиНаличияДублей.Выполнить();
			
			Если НЕ РезультатЗапросаДляПроверкиНаличияДублей.Пустой() ИЛИ ВыборкаСтруктурОР.ИзменяетсяДокументами Тогда
				торо_НастройкаПорядкаЭлементовСлужебныйВызовСервера.ПерезаполнитьПорядокЭлементовВИерархии(ВыборкаСтруктурОР.Ссылка);
			КонецЕсли;
			
		КонецЦикла;
	
	Исключение
		
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡La renovación упорядочивания de los objetos de la reparación no es cumplida! Por la causa: ';ru='Обновление упорядочивания объектов ремонта не выполнено! По причине: ';en='Updating ordering of repair objects failed! Due to: '")+ОписаниеОшибки);
		
	КонецПопытки;  
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнениеРегистровУстановленныхСтатусовДокументов() Экспорт
	
	ЗаполнитьОдинРегистрУстановленныхСтатусовДокументов("торо_СтатусыДокументовВнешнихОснований");
	ЗаполнитьОдинРегистрУстановленныхСтатусовДокументов("торо_СтатусыДокументовВыявленныхДефектов");
	ЗаполнитьОдинРегистрУстановленныхСтатусовДокументов("торо_СтатусыДокументовЗаявок");
	ЗаполнитьОдинРегистрУстановленныхСтатусовДокументов("торо_СтатусыДокументовНарядовНаМероприятия");
	ЗаполнитьОдинРегистрУстановленныхСтатусовДокументов("торо_СтатусыДокументовНарядовНаРемонтныеРаботы");
	
КонецПроцедуры

Процедура ЗаполнитьОдинРегистрУстановленныхСтатусовДокументов(ИмяРегистра)
	
	НачатьТранзакцию();
	ОшибкаТранзакции = Ложь;
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_СтатусыДокументов.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений."+ИмяРегистра+" КАК торо_СтатусыДокументов
		|ГДЕ
		|	НЕ торо_СтатусыДокументов.Регистратор В
		|				(ВЫБРАТЬ
		|					торо_СтатусыДокументовУстановленные.Регистратор
		|				ИЗ
		|					РегистрСведений."+ИмяРегистра+"Установленные КАК торо_СтатусыДокументовУстановленные)";
		
		ВыборкаРегистраторов = Запрос.Выполнить().Выбрать();
		Пока ВыборкаРегистраторов.Следующий() Цикл
			НаборЗаписейИсходный = Вычислить("РегистрыСведений."+ИмяРегистра+".СоздатьНаборЗаписей()");
			НаборЗаписейИсходный.Отбор.Регистратор.Установить(ВыборкаРегистраторов.Регистратор);
			НаборЗаписейИсходный.Прочитать();
			
			НаборЗаписейНовый = Вычислить("РегистрыСведений."+ИмяРегистра+"Установленные.СоздатьНаборЗаписей()");
			НаборЗаписейНовый.Отбор.Регистратор.Установить(ВыборкаРегистраторов.Регистратор);
			НаборЗаписейНовый.Прочитать();
			НаборЗаписейНовый.Очистить();
			
			Для каждого ЗаписьИсходная из НаборЗаписейИсходный Цикл
				Если ЗаписьИсходная.СтатусУстановлен Тогда
					ЗаписьНовая = НаборЗаписейНовый.Добавить();
					ЗаполнитьЗначенияСвойств(ЗаписьНовая, ЗаписьИсходная);
				КонецЕсли;
			КонецЦикла;
			
			НаборЗаписейНовый.Записать(Истина);
		КонецЦикла;
		
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	СтрШаблон(НСтр("es='¡El relleno del registro %1 no es cumplido! Por la causa: ';ru='Заполнение регистра %1 не выполнено! По причине: ';en='Filling register%1 failed! Due to: '"), ИмяРегистра+"Установленные")+ОписаниеОшибки);
	КонецПопытки;   
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли; 
	
КонецПроцедуры

Процедура ЗаменаСпособаУчетаДатыОтсчетаРемонтныхРаботПоПоследнемуРемонту() Экспорт
	
	НачатьТранзакцию();
	ОшибкаТранзакции = Ложь;
	
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_НормативныеРемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта,
		|	торо_НормативныеРемонтыОборудования.ВидРемонта КАК ВидРемонта,
		|	торо_НормативныеРемонтыОборудования.ТиповойОР КАК ТиповойОР
		|ИЗ
		|	РегистрСведений.торо_НормативныеРемонтыОборудования КАК торо_НормативныеРемонтыОборудования
		|ГДЕ
		|	торо_НормативныеРемонтыОборудования.СпособУчетаДатыОтсчета = &СпособУчетаДатыОтсчета";
		
		Запрос.УстановитьПараметр("СпособУчетаДатыОтсчета", Перечисления.торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот.НеИспользоватьДатуВводаВЭксплуатацию);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Запись = РегистрыСведений.торо_НормативныеРемонтыОборудования.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			Запись.Прочитать();
			Если Запись.Выбран() Тогда
				Запись.СпособУчетаДатыОтсчета = Перечисления.торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот.ПоПоследнемуРемонтуИлиДатеПланирования;
				Запись.Записать(Истина);
			КонецЕсли;
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_РегламентныеМероприятияИСпискиОбъектов.СписокОбъектов КАК СписокОбъектов,
		|	торо_РегламентныеМероприятияИСпискиОбъектов.ВидМероприятия КАК ВидМероприятия
		|ИЗ
		|	РегистрСведений.торо_РегламентныеМероприятияИСпискиОбъектов КАК торо_РегламентныеМероприятияИСпискиОбъектов
		|ГДЕ
		|	торо_РегламентныеМероприятияИСпискиОбъектов.СпособУчетаДатыОтсчета = &СпособУчетаДатыОтсчета";
		
		Запрос.УстановитьПараметр("СпособУчетаДатыОтсчета", Перечисления.торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот.НеИспользоватьДатуВводаВЭксплуатацию);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Запись = РегистрыСведений.торо_РегламентныеМероприятияИСпискиОбъектов.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			Запись.Прочитать();
			Если Запись.Выбран() Тогда
				Запись.СпособУчетаДатыОтсчета = Перечисления.торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот.ПоПоследнемуРемонтуИлиДатеПланирования;
				Запись.Записать(Истина);
			КонецЕсли;
		КонецЦикла;

	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡La renovación del modo del recuento de la fecha de la lectura de los trabajos de reparación ""Por la última reparación"" no es cumplida! Por la causa: ';ru='Обновление способа учета даты отсчета ремонтных работ ""По последнему ремонту"" не выполнено! По причине: ';en='Updating the method for recording the countdown date for repair work ""Last Repair"" has not been completed! Due to: '")+ОписаниеОшибки);
	КонецПопытки;   
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли; 	
	
КонецПроцедуры

Процедура ЗаполнениеТЧМероприятияОбъектовВДокументахНарядыИАктыРегМероприятий() Экспорт
	
	НачатьТранзакцию();
	ОшибкаТранзакции = Ложь;
	
	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Док.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ СписокНарядов
		               |ИЗ
		               |	Документ.торо_НарядНаРегламентноеМероприятие КАК Док
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_НарядНаРегламентноеМероприятие.МероприятияОбъектов КАК Меро
		               |		ПО Док.Ссылка = Меро.Ссылка
		               |ГДЕ
		               |	ВЫБОР
		               |			КОГДА Меро.Ссылка ЕСТЬ NULL
		               |				ТОГДА ИСТИНА
		               |			ИНАЧЕ ЛОЖЬ
		               |		КОНЕЦ
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Док.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ СписокАктов
		               |ИЗ
		               |	Документ.торо_АктОВыполненииРегламентногоМероприятия КАК Док
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииРегламентногоМероприятия.МероприятияОбъектов КАК Меро
		               |		ПО Док.Ссылка = Меро.Ссылка
		               |ГДЕ
		               |	ВЫБОР
		               |			КОГДА Меро.Ссылка ЕСТЬ NULL
		               |				ТОГДА ИСТИНА
		               |			ИНАЧЕ ЛОЖЬ
		               |		КОНЕЦ
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	торо_НарядНаРегламентноеМероприятиеРегламентныеМероприятия.ОбъектРемонта КАК ОбъектРемонта,
		               |	торо_НарядНаРегламентноеМероприятиеРегламентныеМероприятия.Ссылка КАК Ссылка,
		               |	торо_НарядНаРегламентноеМероприятиеРегламентныеМероприятия.ID КАК ID
		               |ПОМЕСТИТЬ СпискиОбъектовНарядов
		               |ИЗ
		               |	Документ.торо_НарядНаРегламентноеМероприятие.РегламентныеМероприятия КАК торо_НарядНаРегламентноеМероприятиеРегламентныеМероприятия
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокНарядов КАК СписокНарядов
		               |		ПО торо_НарядНаРегламентноеМероприятиеРегламентныеМероприятия.Ссылка = СписокНарядов.Ссылка
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ОбъектРемонта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	СпискиОбъектовНарядов.Ссылка КАК Ссылка,
		               |	торо_МаршрутыРегламентныхМероприятий.ОбъектРемонта КАК ОбъектРемонта,
		               |	СпискиОбъектовНарядов.ID КАК ID
		               |ПОМЕСТИТЬ НарядыПредварительно
		               |ИЗ
		               |	СпискиОбъектовНарядов КАК СпискиОбъектовНарядов
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_МаршрутыРегламентныхМероприятий КАК торо_МаршрутыРегламентныхМероприятий
		               |		ПО СпискиОбъектовНарядов.ОбъектРемонта = торо_МаршрутыРегламентныхМероприятий.СписокОбъектов
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	торо_АктОВыполненииРегламентногоМероприятияМероприятия.ОбъектРемонта КАК ОбъектРемонта,
		               |	торо_АктОВыполненииРегламентногоМероприятияМероприятия.ID КАК ID,
		               |	торо_АктОВыполненииРегламентногоМероприятияМероприятия.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ СпискиОбъектовАктов
		               |ИЗ
		               |	Документ.торо_АктОВыполненииРегламентногоМероприятия.Мероприятия КАК торо_АктОВыполненииРегламентногоМероприятияМероприятия
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокАктов КАК СписокАктов
		               |		ПО торо_АктОВыполненииРегламентногоМероприятияМероприятия.Ссылка = СписокАктов.Ссылка
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ОбъектРемонта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	СпискиОбъектовАктов.ID КАК ID,
		               |	СпискиОбъектовАктов.Ссылка КАК Ссылка,
		               |	торо_МаршрутыРегламентныхМероприятий.ОбъектРемонта КАК ОбъектРемонта
		               |ПОМЕСТИТЬ АктыПредварительно
		               |ИЗ
		               |	СпискиОбъектовАктов КАК СпискиОбъектовАктов
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_МаршрутыРегламентныхМероприятий КАК торо_МаршрутыРегламентныхМероприятий
		               |		ПО СпискиОбъектовАктов.ОбъектРемонта = торо_МаршрутыРегламентныхМероприятий.СписокОбъектов
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ID,
		               |	ОбъектРемонта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	НарядыПредварительно.Ссылка КАК Ссылка,
		               |	НарядыПредварительно.ОбъектРемонта КАК ОбъектРемонта,
		               |	НарядыПредварительно.ОбъектРемонта.ИнвентарныйНомер КАК ИнвНомер,
		               |	НарядыПредварительно.ОбъектРемонта.ЗаводскойНомер КАК ЗаводскойНомер,
		               |	НарядыПредварительно.ОбъектРемонта.ТехНомер КАК ТехНомер,
		               |	НарядыПредварительно.ID КАК Мероприятие_ID
		               |ИЗ
		               |	НарядыПредварительно КАК НарядыПредварительно
		               |ИТОГИ ПО
		               |	Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	АктыПредварительно.Ссылка КАК Ссылка,
		               |	АктыПредварительно.ID КАК Мероприятие_ID,
		               |	ВЫБОР
		               |		КОГДА торо_ВыполненныеМероприятияОбъектов.ОбъектРемонта ЕСТЬ NULL
		               |			ТОГДА ЛОЖЬ
		               |		ИНАЧЕ ИСТИНА
		               |	КОНЕЦ КАК ЕстьВыпМероприятия,
		               |	АктыПредварительно.ОбъектРемонта КАК ОбъектРемонта,
		               |	АктыПредварительно.ОбъектРемонта.ЗаводскойНомер КАК ЗаводскойНомер,
		               |	АктыПредварительно.ОбъектРемонта.ИнвентарныйНомер КАК ИнвНомер,
		               |	АктыПредварительно.ОбъектРемонта.ТехНомер КАК ТехНомер
		               |ИЗ
		               |	АктыПредварительно КАК АктыПредварительно
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВыполненныеМероприятияОбъектов КАК торо_ВыполненныеМероприятияОбъектов
		               |		ПО АктыПредварительно.ID = торо_ВыполненныеМероприятияОбъектов.ID
		               |			И АктыПредварительно.ОбъектРемонта = торо_ВыполненныеМероприятияОбъектов.ОбъектРемонта
		               |ИТОГИ ПО
		               |	Ссылка";
					   
		рз = Запрос.ВыполнитьПакет();
		
		СписокНарядов = рз[6].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		СписокАктов = рз[7].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока СписокНарядов.Следующий() Цикл
			
			докОб = СписокНарядов.Ссылка.ПолучитьОбъект();
			
			Выборка = СписокНарядов.Выбрать();
			Пока Выборка.Следующий() Цикл
				нс = ДокОб.МероприятияОбъектов.Добавить();
				ЗаполнитьЗначенияСвойств(нс, выборка);
			КонецЦикла;
			
			докОб.БезусловнаяЗапись = Истина;
			Если докОб.Проведен Тогда 
				докОб.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				докОб.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
			
		КонецЦикла;
		
		Пока СписокАктов.Следующий() Цикл
			
			докОб = СписокАктов.Ссылка.ПолучитьОбъект();
			
			Выборка = СписокАктов.Выбрать();
			Пока Выборка.Следующий() Цикл
				нс = ДокОб.МероприятияОбъектов.Добавить();
				ЗаполнитьЗначенияСвойств(нс, выборка);
				нс.Выполнено = НЕ Выборка.ЕстьВыпМероприятия;
			КонецЦикла;
			
			докОб.БезусловнаяЗапись = Истина;
			Если докОб.Проведен Тогда 
				докОб.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				докОб.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
		
		КонецЦикла;		
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡El relleno de la parte tabular ""la Lista de los objetos"" en los Vestidos y las Actas de las medidas de reglamento no es cumplido! Por la causa: ';ru='Заполнение табличной части ""Список объектов"" в Нарядах и Актах регламентных мероприятий не выполнено! По причине: ';en='Filling in the tabular part “List of objects” in the Orders and Regulatory Acts has not been completed! Because of: '")+ОписаниеОшибки);
	КонецПопытки;   
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли; 	
	
КонецПроцедуры

Процедура ОбновлениеЗначенияИспользованиеХарактеристикНоменклатуры() Экспорт
	
	НачатьТранзакцию();
	ОшибкаТранзакции = Ложь;
	
	Попытка
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Номенклатура.Ссылка КАК Ссылка,
			|	ВидыНоменклатуры.ИспользованиеХарактеристик КАК ИспользованиеХарактеристик
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
			|		ПО Номенклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка
			|ГДЕ
			|	Номенклатура.ИспользованиеХарактеристик <> ВидыНоменклатуры.ИспользованиеХарактеристик";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

			РедактируемыйОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			РедактируемыйОбъект.ИспользованиеХарактеристик = ВыборкаДетальныеЗаписи.ИспользованиеХарактеристик;
			РедактируемыйОбъект.Записать();
			
		КонецЦикла;
	
	Исключение
		
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡La renovación del significado de IspolzovanieHarakteristik de los elementos de la guía la Nomenclatura no es cumplida! Por la causa: ';ru='Обновление значения ИспользованиеХарактеристик элементов справочника Номенклатура не выполнено! По причине: ';en='Updating the value ИспользованиеХарактеристик of the elements of the directory Nomenclature not fulfilled! Due to: '")+ОписаниеОшибки);
			
	КонецПопытки;  
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;

КонецПроцедуры

Процедура УстановкаКонстантыФОИспользоватьППРИОтменуРемонтов() Экспорт
	
	НачатьТранзакцию();
	ОшибкаТранзакции = Ложь;
	
	Попытка
		
		Использование = Константы.торо_ИспользоватьППРИОтменуРемонтов.СоздатьМенеджерЗначения();
		Использование.Прочитать();
		Использование.Значение = Константы.торо_ИспользоватьППР.Получить() И Константы.торо_ИспользоватьВозможностьОтменыРемонтов.Получить();
		Использование.Записать();

	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡La instalación de la constante para la opción funcional ""Usar ППР y la anulación de las reparaciones"" no es cumplido! Por la causa: ';ru='Установка константы для функциональной опции ""Использовать ППР и отмену ремонтов"" не выполнена! По причине: ';en='Setting a constant for the functional option “Use maintenance and repair cancellation” failed! Because of: '")+ОписаниеОшибки);
	КонецПопытки;   
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбновитьРегистр_торо_ПлановыеМероприятия() Экспорт
	
	НачатьТранзакцию();
	ОшибкаТранзакции = Ложь;
	
	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	торо_ПлановыеМероприятия.Регистратор КАК Регистратор
		               |ПОМЕСТИТЬ СписокДок
		               |ИЗ
		               |	РегистрСведений.торо_ПлановыеМероприятия КАК торо_ПлановыеМероприятия
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Регистратор
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	СписокДок.Регистратор КАК Регистратор,
		               |	торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов.ID КАК ID,
		               |	торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов.СпособВыполнения КАК СпособВыполнения,
		               |	торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов.СуммаРемонта КАК СуммаРемонта
		               |ИЗ
		               |	СписокДок КАК СписокДок
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ГрафикРегламентныхМероприятийТОиР.ПланРемонтов КАК торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов
		               |		ПО СписокДок.Регистратор = торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов.Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	СписокДок.Регистратор КАК Регистратор
		               |ИЗ
		               |	СписокДок КАК СписокДок";
					   
					   
		результаты = Запрос.ВыполнитьПакет();
		рСпособы = результаты[1];
		рДокументы = результаты[2];
		
		Если НЕ рСпособы.Пустой() Тогда 
			Способы = рСпособы.Выгрузить();
			Способы.Индексы.Добавить("Регистратор, ID");
			СписокДокументов = рДокументы.Выгрузить();
			струкПоиска = Новый Структура("Регистратор, ID");
			
			Для каждого текДок из СписокДокументов цикл
				нз = РегистрыСведений.торо_ПлановыеМероприятия.СоздатьНаборЗаписей();
				нз.Отбор.Регистратор.Установить(текДок.Регистратор);
				нз.Прочитать();
				
				НадоЗаписать = Ложь;
				Для каждого текСтрока из нз Цикл
					ЗаполнитьЗначенияСвойств(струкПоиска, текСтрока);
					НайС = Способы.найтиСтроки(струкПоиска);
					Если НайС.количество() > 0 Тогда
						текСтрока.СпособВыполнения = НайС[0].СпособВыполнения;
						текСтрока.СтоимостьРемонта = НайС[0].СуммаРемонта;
					КонецЕсли;
					
					НадоЗаписать = Истина;
				КонецЦикла;
				
				Если НадоЗаписать Тогда
					нз.Записать();
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡El relleno del nuevo recurso ""el Modo de la ejecución"" en el registro de las noticias ""las medidas Planificadas"" no es cumplido! Por la causa: ';ru='Заполнение нового ресурса ""Способ выполнения"" в регистре сведений ""Плановые мероприятия"" не выполнено! По причине: ';en='Filling in the new resource “Execution method” in the “Scheduled events” information register has not been completed! Because of: '")+ОписаниеОшибки);
	КонецПопытки;   
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;	
	
КонецПроцедуры

// 2.0.12.1
Процедура УдалениеБитыхСсылокИзНастроекРМТехСпециалиста() Экспорт
	
	Ошибка = Ложь;
	
	Попытка
		
		ВыборкаПользователей = Справочники.Пользователи.Выбрать();
		
		Пока ВыборкаПользователей.Следующий() Цикл
			
			УИД = ВыборкаПользователей.Ссылка.УникальныйИдентификатор();
			
			ЗначениеНастроек = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("Обработка.торо_РабочееМестоТехническогоСпециалиста", УИД);
			Если ЗначениеНастроек = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если ЗначениеНастроек.Свойство("ТаблицаКритичности") Тогда
				МассивКУдалению = Новый Массив;
				Для каждого Строка из ЗначениеНастроек.ТаблицаКритичности Цикл
					СправочникОбъект = Строка.Критичность.ПолучитьОбъект();
					Если СправочникОбъект = Неопределено Тогда
						МассивКУдалению.Добавить(Строка);
					КонецЕсли;
				КонецЦикла;
				
				Для каждого Строка из МассивКУдалению Цикл
					ЗначениеНастроек.ТаблицаКритичности.Удалить(Строка);
				КонецЦикла;
				
				Если МассивКУдалению.Количество() > 0 Тогда
					ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("Обработка.торо_РабочееМестоТехническогоСпециалиста", УИД, ЗначениеНастроек);
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
	Исключение
		Ошибка = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,ОписаниеОшибки);
	КонецПопытки;  
	
КонецПроцедуры

Процедура ИсправлениеЗначенийРеквизитовСправочникаОбъектыРемонта() Экспорт
	
	НачатьТранзакцию();
	ОшибкаТранзакции = Ложь;
	
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	торо_ОбъектыРемонта.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		               |ГДЕ
		               |	(торо_ОбъектыРемонта.ВнешнийОбъект = ИСТИНА
		               |				И (НЕ торо_ОбъектыРемонта.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		               |					ИЛИ НЕ торо_ОбъектыРемонта.Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
		               |			ИЛИ торо_ОбъектыРемонта.ВнешнийОбъект = ЛОЖЬ
		               |				И (НЕ торо_ОбъектыРемонта.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		               |					ИЛИ НЕ торо_ОбъектыРемонта.ДоговорКонтрагента = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)))";
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ОбъектРемонта = Выборка.Ссылка.ПолучитьОбъект();
			
			Если ОбъектРемонта.ВнешнийОбъект Тогда
				
				ОбъектРемонта.Организация = Неопределено;
				ОбъектРемонта.Подразделение = Неопределено;
				
			Иначе
				
				ОбъектРемонта.Контрагент = Неопределено;
				ОбъектРемонта.ДоговорКонтрагента = Неопределено;
				
			КонецЕсли;
			
			ОбъектРемонта.Записать();
			
		КонецЦикла;
		
	Исключение
		
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡La corrección de los significados de los requisitos de la guía los objetos de la reparación no es cumplida! Por la causa: ';ru='Исправление значений реквизитов справочника объекты ремонта не выполнено! По причине: ';en='Correction of the values of the details of the directory objects of repair not completed! Because of: '")+ОписаниеОшибки);
		
	КонецПопытки;  
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

// 2.0.13.1

Процедура ОбновлениеПВХГраницыДопустимыхЗначений() Экспорт
	
	НачатьТранзакцию();
	ОшибкаТранзакции = Ложь;
	
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	торо_ИзмеряемыеПоказателиОбъектовРемонта.Ссылка КАК Ссылка,
		               |	торо_ИзмеряемыеПоказателиОбъектовРемонта.ДопустимыйМаксимум КАК ДопустимыйМаксимум,
		               |	торо_ИзмеряемыеПоказателиОбъектовРемонта.ДопустимыйМинимум КАК ДопустимыйМинимум,
		               |	торо_ИзмеряемыеПоказателиОбъектовРемонта.КритическийМаксимум КАК КритическийМаксимум,
		               |	торо_ИзмеряемыеПоказателиОбъектовРемонта.КритическийМинимум КАК КритическийМинимум
		               |ИЗ
		               |	ПланВидовХарактеристик.торо_ИзмеряемыеПоказателиОбъектовРемонта КАК торо_ИзмеряемыеПоказателиОбъектовРемонта
		               |ГДЕ
		               |	(торо_ИзмеряемыеПоказателиОбъектовРемонта.ДопустимыйМаксимум = НЕОПРЕДЕЛЕНО
		               |			ИЛИ торо_ИзмеряемыеПоказателиОбъектовРемонта.ДопустимыйМинимум = НЕОПРЕДЕЛЕНО
		               |			ИЛИ торо_ИзмеряемыеПоказателиОбъектовРемонта.КритическийМаксимум = НЕОПРЕДЕЛЕНО
		               |			ИЛИ торо_ИзмеряемыеПоказателиОбъектовРемонта.КритическийМинимум = НЕОПРЕДЕЛЕНО)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ПВХ = Выборка.Ссылка.ПолучитьОбъект();
			
			Если Выборка.ДопустимыйМаксимум = Неопределено Тогда
				ПВХ.ДопустимыйМаксимум = 0;
			КонецЕсли;
			
			Если Выборка.ДопустимыйМинимум = Неопределено Тогда
				ПВХ.ДопустимыйМинимум = 0;
			КонецЕсли;
			
			Если Выборка.КритическийМаксимум = Неопределено Тогда
				ПВХ.КритическийМаксимум = 0;
			КонецЕсли;
			
			Если Выборка.КритическийМинимум = Неопределено Тогда
				ПВХ.КритическийМинимум = 0;
			КонецЕсли;
			
			ПВХ.Записать();
			
		КонецЦикла;
		
	Исключение
		
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡La renovación de las fronteras de los significados ПВХ admisibles no es cumplida! Por la causa: ';ru='Обновление границ допустимых значений ПВХ не выполнено! По причине: ';en='PVC limits update failed! Due to: '")+ОписаниеОшибки);
		
	КонецПопытки;  
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьДвиженияРегламентныхАктовПоРегиструЗатратыПоИсполнителямВыполненныхРемонтов() Экспорт
	
	ОшибкаТранзакции = Ложь;
	НачатьТранзакцию();
	Попытка
		
		// Выбрать проведенные документы, где есть хотя бы одна строка материальных затрат. 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_АктОВыполненииРегламентногоМероприятияПодрядчикиРемонтныхРабот.Ссылка КАК Ссылка,
		|	торо_АктОВыполненииРегламентногоМероприятияПодрядчикиРемонтныхРабот.ID КАК ID,
		|	торо_АктОВыполненииРегламентногоМероприятияПодрядчикиРемонтныхРабот.Контрагент КАК Контрагент,
		|	СУММА(торо_АктОВыполненииРегламентногоМероприятияПодрядчикиРемонтныхРабот.Сумма) КАК Сумма,
		|	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.РемонтнаяРабота КАК РемонтнаяРабота,
		|	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		|	торо_АктОВыполненииРегламентногоМероприятияПодрядчикиРемонтныхРабот.Ссылка.Дата КАК Дата
		|ИЗ
		|	Документ.торо_АктОВыполненииРегламентногоМероприятия.ПодрядчикиРемонтныхРабот КАК торо_АктОВыполненииРегламентногоМероприятияПодрядчикиРемонтныхРабот
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииРегламентногоМероприятия.РемонтныеРаботы КАК торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы
		|		ПО торо_АктОВыполненииРегламентногоМероприятияПодрядчикиРемонтныхРабот.ID = торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.ID
		|ГДЕ
		|	торо_АктОВыполненииРегламентногоМероприятияПодрядчикиРемонтныхРабот.Ссылка.Проведен
		|	И торо_АктОВыполненииРегламентногоМероприятияПодрядчикиРемонтныхРабот.Сумма <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	торо_АктОВыполненииРегламентногоМероприятияПодрядчикиРемонтныхРабот.Контрагент,
		|	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.РемонтыОборудования_ID,
		|	торо_АктОВыполненииРегламентногоМероприятияПодрядчикиРемонтныхРабот.ID,
		|	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.РемонтнаяРабота,
		|	торо_АктОВыполненииРегламентногоМероприятияПодрядчикиРемонтныхРабот.Ссылка
		|ИТОГИ ПО
		|	Ссылка";
		
		ВыборкаДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
		
		Пока ВыборкаДокументов.Следующий() Цикл
			
			ВыборкаПодрядчиков = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.Прямой); 
			
			НаборЗаписей = РегистрыНакопления.торо_ЗатратыПоИсполнителямВыполненныхРемонтов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаДокументов.Ссылка);
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			
			Пока ВыборкаПодрядчиков.Следующий() Цикл
				Движение = НаборЗаписей.Добавить();
				Движение.Регистратор = ВыборкаДокументов.Ссылка;
				Движение.Период = ВыборкаПодрядчиков.Дата;
				Движение.Исполнитель = ВыборкаПодрядчиков.Контрагент;
				Движение.Сумма = ВыборкаПодрядчиков.Сумма;
				Движение.УникальныйИдентификатор = ВыборкаПодрядчиков.ID;
				Движение.ТехнологическаяОперация = ВыборкаПодрядчиков.РемонтнаяРабота;
				Движение.РемонтыОборудования_ID = ВыборкаПодрядчиков.РемонтыОборудования_ID;
			КонецЦикла;

			НаборЗаписей.Записать(Истина);
		
		КонецЦикла;
		
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡Los movimientos de los documentos ""el Acta sobre la ejecución de la medida de reglamento"" por el registro ""los Gastos por los ejecutores de las reparaciones cumplidas"" no son formados! Por la causa: ';ru='Движения документов ""Акт о выполнении регламентного мероприятия"" по регистру ""Затраты по исполнителям выполненных ремонтов"" НЕ сформированы! По причине: ';en='Documents “Act on the implementation of regulatory activities” in the register “Costs for executors of completed repairs” are NOT formed! Due to: '")+ОписаниеОшибки);
	КонецПопытки;
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьЗановоДвиженияВнешнихОснованийПоРегиструОперацийВнешнихОснований() Экспорт
	
	ОшибкаТранзакции = Ложь;
	НачатьТранзакцию();
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ВнешнееОснованиеДляРаботРемонтныеРаботы.Ссылка КАК Ссылка,
		|	торо_ВнешнееОснованиеДляРаботРемонтныеРаботы.ID КАК ID,
		|	торо_ВнешнееОснованиеДляРаботРемонтныеРаботы.РемонтнаяРабота КАК РемонтнаяРабота,
		|	торо_ВнешнееОснованиеДляРаботРемонтныеРаботы.Количество КАК Количество,
		|	торо_ВнешнееОснованиеДляРаботРемонтныеРаботы.Предписание_ID КАК Предписание_ID,
		|	торо_ВнешнееОснованиеДляРаботРемонтныеРаботы.Родитель_ID КАК Родитель_ID
		|ИЗ
		|	Документ.торо_ВнешнееОснованиеДляРабот.РемонтныеРаботы КАК торо_ВнешнееОснованиеДляРаботРемонтныеРаботы
		|ГДЕ
		|	торо_ВнешнееОснованиеДляРаботРемонтныеРаботы.Ссылка.Проведен = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	торо_ВнешнееОснованиеДляРаботРемонтныеРаботы.ID,
		|	торо_ВнешнееОснованиеДляРаботРемонтныеРаботы.РемонтнаяРабота,
		|	торо_ВнешнееОснованиеДляРаботРемонтныеРаботы.Количество,
		|	торо_ВнешнееОснованиеДляРаботРемонтныеРаботы.Предписание_ID,
		|	торо_ВнешнееОснованиеДляРаботРемонтныеРаботы.Ссылка,
		|	торо_ВнешнееОснованиеДляРаботРемонтныеРаботы.Родитель_ID
		|ИТОГИ ПО
		|	Ссылка";
		
		ВыборкаДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
		
		Пока ВыборкаДокументов.Следующий() Цикл
			
			ВыборкаОпераций = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.Прямой); 
			
			НаборЗаписей = РегистрыСведений.торо_ОперацииВнешнихОснованийДляРабот.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаДокументов.Ссылка);
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			
			Пока ВыборкаОпераций.Следующий() Цикл
				Движение = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(Движение, ВыборкаОпераций);
			КонецЦикла;

			НаборЗаписей.Записать(Истина);
		
		КонецЦикла;
		
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡Los movimientos de los documentos ""las razones Exteriores para los trabajos"" por el registro ""las Operaciones de las razones exteriores para los trabajos"" no son reformados! Por la causa: ';ru='Движения документов ""Внешние основания для работ"" по регистру ""Операции внешних оснований для работ"" НЕ переформированы! По причине: ';en='The movements of the documents “External bases for work” in the register “Operations of external bases for work” are NOT reorganized! Due to: '")+ОписаниеОшибки);
	КонецПопытки;
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьЗановоДвиженияАктовПоРегиструФактическихТрудовыхЗатратРемонтныхРабот() Экспорт
		
	ОшибкаТранзакции = Ложь;
	НачатьТранзакцию();
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		|	ВЫБОР
		|		КОГДА торо_АктОВыполненииЭтапаРаботТрудовыеЗатраты.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ДатаНачала
		|		ИНАЧЕ торо_АктОВыполненииЭтапаРаботТрудовыеЗатраты.ДатаНачала
		|	КОНЕЦ КАК ДатаНачала,
		|	торо_АктОВыполненииЭтапаРаботТрудовыеЗатраты.Квалификация КАК Квалификация,
		|	торо_АктОВыполненииЭтапаРаботТрудовыеЗатраты.Сотрудник КАК Сотрудник,
		|	торо_АктОВыполненииЭтапаРаботТрудовыеЗатраты.СуммаКНачислению КАК СуммаКНачислению,
		|	торо_АктОВыполненииЭтапаРаботТрудовыеЗатраты.ВремяРаботы КАК ВремяРаботы,
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Ссылка КАК Ссылка,
		|	торо_АктОВыполненииЭтапаРаботТрудовыеЗатраты.ID КАК ID,
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтнаяРабота КАК РемонтнаяРабота,
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Количество КАК Количество
		|ИЗ
		|	Документ.торо_АктОВыполненииЭтапаРабот.РемонтныеРаботы КАК торо_АктОВыполненииЭтапаРаботРемонтныеРаботы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.ТрудовыеЗатраты КАК торо_АктОВыполненииЭтапаРаботТрудовыеЗатраты
		|		ПО торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Ссылка = торо_АктОВыполненииЭтапаРаботТрудовыеЗатраты.Ссылка
		|			И торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтыОборудования_ID = торо_АктОВыполненииЭтапаРаботТрудовыеЗатраты.РемонтыОборудования_ID
		|			И торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.ID = торо_АктОВыполненииЭтапаРаботТрудовыеЗатраты.ID
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК торо_АктОВыполненииЭтапаРаботРемонтыОборудования
		|		ПО торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтыОборудования_ID = торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ID
		|ГДЕ
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Ссылка.Проведен = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтыОборудования_ID,
		|	торо_АктОВыполненииЭтапаРаботТрудовыеЗатраты.Квалификация,
		|	торо_АктОВыполненииЭтапаРаботТрудовыеЗатраты.Сотрудник,
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Ссылка,
		|	торо_АктОВыполненииЭтапаРаботТрудовыеЗатраты.ID,
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтнаяРабота,
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Количество,
		|	ВЫБОР
		|		КОГДА торо_АктОВыполненииЭтапаРаботТрудовыеЗатраты.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ДатаНачала
		|		ИНАЧЕ торо_АктОВыполненииЭтапаРаботТрудовыеЗатраты.ДатаНачала
		|	КОНЕЦ,
		|	торо_АктОВыполненииЭтапаРаботТрудовыеЗатраты.ВремяРаботы,
		|	торо_АктОВыполненииЭтапаРаботТрудовыеЗатраты.СуммаКНачислению
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.РемонтыОборудования_ID,
		|	ВЫБОР
		|		КОГДА торо_АктОВыполненииРегламентногоМероприятияТрудовыеЗатраты.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА торо_АктОВыполненииРегламентногоМероприятияМероприятия.ДатаНачала
		|		ИНАЧЕ торо_АктОВыполненииРегламентногоМероприятияТрудовыеЗатраты.ДатаНачала
		|	КОНЕЦ,
		|	торо_АктОВыполненииРегламентногоМероприятияТрудовыеЗатраты.Квалификация,
		|	торо_АктОВыполненииРегламентногоМероприятияТрудовыеЗатраты.Сотрудник,
		|	торо_АктОВыполненииРегламентногоМероприятияТрудовыеЗатраты.СуммаКНачислению,
		|	торо_АктОВыполненииРегламентногоМероприятияТрудовыеЗатраты.ВремяРаботы,
		|	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.Ссылка,
		|	торо_АктОВыполненииРегламентногоМероприятияТрудовыеЗатраты.ID,
		|	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.РемонтнаяРабота,
		|	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.Количество
		|ИЗ
		|	Документ.торо_АктОВыполненииРегламентногоМероприятия.РемонтныеРаботы КАК торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииРегламентногоМероприятия.ТрудовыеЗатраты КАК торо_АктОВыполненииРегламентногоМероприятияТрудовыеЗатраты
		|		ПО торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.Ссылка = торо_АктОВыполненииРегламентногоМероприятияТрудовыеЗатраты.Ссылка
		|			И торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.РемонтыОборудования_ID = торо_АктОВыполненииРегламентногоМероприятияТрудовыеЗатраты.РемонтыОборудования_ID
		|			И торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.ID = торо_АктОВыполненииРегламентногоМероприятияТрудовыеЗатраты.ID
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииРегламентногоМероприятия.Мероприятия КАК торо_АктОВыполненииРегламентногоМероприятияМероприятия
		|		ПО торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.РемонтыОборудования_ID = торо_АктОВыполненииРегламентногоМероприятияМероприятия.ID
		|ГДЕ
		|	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.Ссылка.Проведен = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.РемонтыОборудования_ID,
		|	торо_АктОВыполненииРегламентногоМероприятияТрудовыеЗатраты.Квалификация,
		|	торо_АктОВыполненииРегламентногоМероприятияТрудовыеЗатраты.Сотрудник,
		|	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.Ссылка,
		|	торо_АктОВыполненииРегламентногоМероприятияТрудовыеЗатраты.ID,
		|	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.РемонтнаяРабота,
		|	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.Количество,
		|	ВЫБОР
		|		КОГДА торо_АктОВыполненииРегламентногоМероприятияТрудовыеЗатраты.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА торо_АктОВыполненииРегламентногоМероприятияМероприятия.ДатаНачала
		|		ИНАЧЕ торо_АктОВыполненииРегламентногоМероприятияТрудовыеЗатраты.ДатаНачала
		|	КОНЕЦ,
		|	торо_АктОВыполненииРегламентногоМероприятияТрудовыеЗатраты.ВремяРаботы,
		|	торо_АктОВыполненииРегламентногоМероприятияТрудовыеЗатраты.СуммаКНачислению
		|ИТОГИ ПО
		|	Ссылка";
		
		ВыборкаДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
		
		Пока ВыборкаДокументов.Следующий() Цикл
			
			ВыборкаИсполнителей = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.Прямой); 
			
			НаборЗаписей = РегистрыНакопления.торо_ФактическиеТрудовыеЗатратыРемонтныхРабот.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаДокументов.Ссылка);
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			
			Пока ВыборкаИсполнителей.Следующий() Цикл
				Движение = НаборЗаписей.Добавить();
				Движение.Регистратор = ВыборкаДокументов.Ссылка;
				Движение.Период = ВыборкаИсполнителей.ДатаНачала;
				Движение.РемонтыОборудования_ID = ВыборкаИсполнителей.РемонтыОборудования_ID;
				Движение.ID = ВыборкаИсполнителей.ID;
				Движение.РемонтнаяРабота = ВыборкаИсполнителей.РемонтнаяРабота;
				Движение.Квалификация = ВыборкаИсполнителей.Квалификация;
				Движение.Сотрудник = ВыборкаИсполнителей.Сотрудник;
				Движение.Количество = ВыборкаИсполнителей.Количество;
				Движение.Сумма = ВыборкаИсполнителей.СуммаКНачислению;
				Движение.ВремяРаботы = ВыборкаИсполнителей.ВремяРаботы;
			КонецЦикла;

			НаборЗаписей.Записать(Истина);
		
		КонецЦикла;
		
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡Los movimientos de los documentos ""el Acta sobre la ejecución de la etapa de los trabajos"" por el registro ""los gastos Reales laborales de los trabajos"" no son formados! Por la causa: ';ru='Движения документов ""Акт о выполнении этапа работ"" по регистру ""Фактические трудовые затраты работ"" НЕ сформированы! По причине: ';en='Documents movement ""Act on the implementation of the work phase"" in the register ""Actual labor costs of work"" is NOT formed! Due to: '")+ОписаниеОшибки);
	КонецПопытки;
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;

КонецПроцедуры

Процедура СформироватьДвиженияПоРегиструВнешнихОснованийДляРабот() Экспорт
		
	ОшибкаТранзакции = Ложь;
	НачатьТранзакцию();
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ВыявленныеДефектыДокументыОснования.ДокументОснование КАК ДокументОснование,
		|	торо_ВыявленныеДефектыДокументыОснования.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Основания
		|ИЗ
		|	Документ.торо_ВыявленныеДефекты.ДокументыОснования КАК торо_ВыявленныеДефектыДокументыОснования
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_АктОВыполненииЭтапаРаботДокументыОснования.ДокументОснование,
		|	торо_АктОВыполненииЭтапаРаботДокументыОснования.Ссылка
		|ИЗ
		|	Документ.торо_АктОВыполненииЭтапаРабот.ДокументыОснования КАК торо_АктОВыполненииЭтапаРаботДокументыОснования
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_ЗаявкаНаРемонтДокументыОснования.ДокументОснование,
		|	торо_ЗаявкаНаРемонтДокументыОснования.Ссылка
		|ИЗ
		|	Документ.торо_ЗаявкаНаРемонт.ДокументыОснования КАК торо_ЗаявкаНаРемонтДокументыОснования
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_НарядНаВыполнениеРемонтныхРаботДокументыОснования.ДокументОснование,
		|	торо_НарядНаВыполнениеРемонтныхРаботДокументыОснования.Ссылка
		|ИЗ
		|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.ДокументыОснования КАК торо_НарядНаВыполнениеРемонтныхРаботДокументыОснования
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Основания.ДокументОснование КАК ДокументОснование,
		|	ВТ_Основания.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ПредписанияИзОснований
		|ИЗ
		|	ВТ_Основания КАК ВТ_Основания
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(ВТ_Основания.ДокументОснование) = ТИП(Документ.торо_ВнешнееОснованиеДляРабот)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ID КАК ID,
		|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка КАК Ссылка,
		|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта
		|ПОМЕСТИТЬ ВТ_РемонтныеРаботы
		|ИЗ
		|	Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК торо_АктОВыполненииЭтапаРаботРемонтыОборудования
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_ЗаявкаНаРемонтРемонтыОборудования.ID,
		|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка,
		|	торо_ЗаявкаНаРемонтРемонтыОборудования.ОбъектРемонта
		|ИЗ
		|	Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК торо_ЗаявкаНаРемонтРемонтыОборудования
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_ВыявленныеДефектыСписокДефектов.ID,
		|	торо_ВыявленныеДефектыСписокДефектов.Ссылка,
		|	торо_ВыявленныеДефектыСписокДефектов.ОбъектРемонта
		|ИЗ
		|	Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID,
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка,
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОбъектРемонта
		|ИЗ
		|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтыОборудования КАК торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ЗаявкаНаРемонтЗакрываемыеПредписания.ID КАК ID,
		|	торо_ЗаявкаНаРемонтЗакрываемыеПредписания.ОбъектРемонта КАК ОбъектРемонта,
		|	торо_ЗаявкаНаРемонтЗакрываемыеПредписания.Описание КАК Описание,
		|	торо_ЗаявкаНаРемонтЗакрываемыеПредписания.ПлановаяДатаРемонта КАК ПлановаяДатаРемонта,
		|	торо_ЗаявкаНаРемонтЗакрываемыеПредписания.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		|	торо_ЗаявкаНаРемонтЗакрываемыеПредписания.Ссылка КАК Ссылка,
		|	торо_ЗаявкаНаРемонтЗакрываемыеПредписания.Ссылка.Подразделение КАК Подразделение,
		|	торо_ЗаявкаНаРемонтЗакрываемыеПредписания.Ссылка.Организация КАК Организация
		|ПОМЕСТИТЬ ВТ_ЗакрываемыеПредписания
		|ИЗ
		|	Документ.торо_ЗаявкаНаРемонт.ЗакрываемыеПредписания КАК торо_ЗаявкаНаРемонтЗакрываемыеПредписания
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_АктОВыполненииЭтапаРаботЗакрываемыеПредписания.ID,
		|	торо_АктОВыполненииЭтапаРаботЗакрываемыеПредписания.ОбъектРемонта,
		|	торо_АктОВыполненииЭтапаРаботЗакрываемыеПредписания.Описание,
		|	торо_АктОВыполненииЭтапаРаботЗакрываемыеПредписания.ПлановаяДатаРемонта,
		|	торо_АктОВыполненииЭтапаРаботЗакрываемыеПредписания.РемонтыОборудования_ID,
		|	торо_АктОВыполненииЭтапаРаботЗакрываемыеПредписания.Ссылка,
		|	торо_АктОВыполненииЭтапаРаботЗакрываемыеПредписания.Ссылка.Подразделение,
		|	торо_АктОВыполненииЭтапаРаботЗакрываемыеПредписания.Ссылка.Организация
		|ИЗ
		|	Документ.торо_АктОВыполненииЭтапаРабот.ЗакрываемыеПредписания КАК торо_АктОВыполненииЭтапаРаботЗакрываемыеПредписания
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_НарядНаВыполнениеРемонтныхРаботЗакрываемыеПредписания.ID,
		|	торо_НарядНаВыполнениеРемонтныхРаботЗакрываемыеПредписания.ОбъектРемонта,
		|	торо_НарядНаВыполнениеРемонтныхРаботЗакрываемыеПредписания.Описание,
		|	торо_НарядНаВыполнениеРемонтныхРаботЗакрываемыеПредписания.ПлановаяДатаРемонта,
		|	торо_НарядНаВыполнениеРемонтныхРаботЗакрываемыеПредписания.РемонтыОборудования_ID,
		|	торо_НарядНаВыполнениеРемонтныхРаботЗакрываемыеПредписания.Ссылка,
		|	торо_НарядНаВыполнениеРемонтныхРаботЗакрываемыеПредписания.Ссылка.Подразделение,
		|	торо_НарядНаВыполнениеРемонтныхРаботЗакрываемыеПредписания.Ссылка.Организация
		|ИЗ
		|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.ЗакрываемыеПредписания КАК торо_НарядНаВыполнениеРемонтныхРаботЗакрываемыеПредписания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПредписанияИзОснований.Ссылка.Дата КАК Дата,
		|	ВТ_ПредписанияИзОснований.Ссылка КАК Ссылка,
		|	торо_ВнешниеОснованияДляРабот.ОбъектРемонта КАК ОбъектРемонта,
		|	торо_ВнешниеОснованияДляРабот.ID КАК ID,
		|	торо_ВнешниеОснованияДляРабот.Описание КАК Описание,
		|	торо_ВнешниеОснованияДляРабот.ПлановаяДатаРемонта КАК ПлановаяДатаРемонта,
		|	ВТ_ПредписанияИзОснований.Ссылка.Организация КАК Организация,
		|	ВТ_ПредписанияИзОснований.Ссылка.Подразделение КАК Подразделение,
		|	торо_ВнешниеОснованияДляРабот.РемонтыОборудования_id КАК РемонтыОборудования_id
		|ПОМЕСТИТЬ ВТ_ИспользуемыеВнешниеОснования
		|ИЗ
		|	РегистрСведений.торо_ВнешниеОснованияДляРабот КАК торо_ВнешниеОснованияДляРабот
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПредписанияИзОснований КАК ВТ_ПредписанияИзОснований
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РемонтныеРаботы КАК ВТ_РемонтныеРаботы
		|			ПО ВТ_ПредписанияИзОснований.Ссылка = ВТ_РемонтныеРаботы.Ссылка
		|		ПО торо_ВнешниеОснованияДляРабот.Регистратор = ВТ_ПредписанияИзОснований.ДокументОснование
		|ГДЕ
		|	торо_ВнешниеОснованияДляРабот.ID = ВТ_РемонтныеРаботы.ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ИспользуемыеВнешниеОснования.Дата КАК Дата,
		|	ВТ_ИспользуемыеВнешниеОснования.Ссылка КАК Ссылка,
		|	ВТ_ИспользуемыеВнешниеОснования.ОбъектРемонта КАК ОбъектРемонта,
		|	ВТ_ИспользуемыеВнешниеОснования.ID КАК ID,
		|	ВТ_ИспользуемыеВнешниеОснования.Описание КАК Описание,
		|	ВТ_ИспользуемыеВнешниеОснования.ПлановаяДатаРемонта КАК ПлановаяДатаРемонта,
		|	ВТ_ИспользуемыеВнешниеОснования.Организация КАК Организация,
		|	ВТ_ИспользуемыеВнешниеОснования.Подразделение КАК Подразделение,
		|	ВТ_ИспользуемыеВнешниеОснования.РемонтыОборудования_id КАК РемонтыОборудования_id
		|ИЗ
		|	ВТ_ИспользуемыеВнешниеОснования КАК ВТ_ИспользуемыеВнешниеОснования
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ЗакрываемыеПредписания.Ссылка.Дата,
		|	ВТ_ЗакрываемыеПредписания.Ссылка,
		|	ВТ_ЗакрываемыеПредписания.ОбъектРемонта,
		|	ВТ_ЗакрываемыеПредписания.ID,
		|	ВТ_ЗакрываемыеПредписания.Описание,
		|	ВТ_ЗакрываемыеПредписания.ПлановаяДатаРемонта,
		|	ВТ_ЗакрываемыеПредписания.Организация,
		|	ВТ_ЗакрываемыеПредписания.Подразделение,
		|	ВТ_ЗакрываемыеПредписания.РемонтыОборудования_ID
		|ИЗ
		|	ВТ_ЗакрываемыеПредписания КАК ВТ_ЗакрываемыеПредписания
		|ИТОГИ ПО
		|	Ссылка";
		
		ВыборкаДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
		
		Пока ВыборкаДокументов.Следующий() Цикл
			
			ВнешнееОснование = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.Прямой); 
			
			НаборЗаписей = РегистрыСведений.торо_ВнешниеОснованияДляРабот.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаДокументов.Ссылка);
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			
			Пока ВнешнееОснование.Следующий() Цикл
				Движение = НаборЗаписей.Добавить();
				Движение.Период = ВнешнееОснование.Дата;
				Движение.Регистратор = ВнешнееОснование.Ссылка;
				Движение.ОбъектРемонта = ВнешнееОснование.ОбъектРемонта;
				Движение.ID = ВнешнееОснование.ID;
				Движение.Описание = ВнешнееОснование.Описание;
				Движение.ПлановаяДатаРемонта = ВнешнееОснование.ПлановаяДатаРемонта;
				Движение.Обработано = Истина;
				Движение.Организация = ВнешнееОснование.Организация;
				Движение.Подразделение = ВнешнееОснование.Подразделение;
			КонецЦикла;

			НаборЗаписей.Записать(Истина);
		
		КонецЦикла;
		
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡Los movimientos de los documentos por el registro ""las razones Exteriores para los trabajos"" no son formados! Por la causa: ';ru='Движения документов по регистру ""Внешние основания для работ"" НЕ сформированы! По причине: ';en='Documents movements on the register ""External grounds for work"" are NOT formed! Due to: '")+ОписаниеОшибки);
	КонецПопытки;
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьДокументыИзВнешнихОснованийВДокументыОснования() Экспорт
		
	ОшибкаТранзакции = Ложь;
	НачатьТранзакцию();
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ЗаявкаНаРемонтЗакрываемыеПредписания.ID КАК ID,
		|	торо_ЗаявкаНаРемонтЗакрываемыеПредписания.ОбъектРемонта КАК ОбъектРемонта,
		|	торо_ЗаявкаНаРемонтЗакрываемыеПредписания.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ЗакрываемыеПредписания
		|ИЗ
		|	Документ.торо_ЗаявкаНаРемонт.ЗакрываемыеПредписания КАК торо_ЗаявкаНаРемонтЗакрываемыеПредписания
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_АктОВыполненииЭтапаРаботЗакрываемыеПредписания.ID,
		|	торо_АктОВыполненииЭтапаРаботЗакрываемыеПредписания.ОбъектРемонта,
		|	торо_АктОВыполненииЭтапаРаботЗакрываемыеПредписания.Ссылка
		|ИЗ
		|	Документ.торо_АктОВыполненииЭтапаРабот.ЗакрываемыеПредписания КАК торо_АктОВыполненииЭтапаРаботЗакрываемыеПредписания
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_НарядНаВыполнениеРемонтныхРаботЗакрываемыеПредписания.ID,
		|	торо_НарядНаВыполнениеРемонтныхРаботЗакрываемыеПредписания.ОбъектРемонта,
		|	торо_НарядНаВыполнениеРемонтныхРаботЗакрываемыеПредписания.Ссылка
		|ИЗ
		|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.ЗакрываемыеПредписания КАК торо_НарядНаВыполнениеРемонтныхРаботЗакрываемыеПредписания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ВнешниеОснованияДляРабот.Регистратор КАК Регистратор,
		|	ВТ_ЗакрываемыеПредписания.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрСведений.торо_ВнешниеОснованияДляРабот КАК торо_ВнешниеОснованияДляРабот
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗакрываемыеПредписания КАК ВТ_ЗакрываемыеПредписания
		|		ПО торо_ВнешниеОснованияДляРабот.ID = ВТ_ЗакрываемыеПредписания.ID
		|			И торо_ВнешниеОснованияДляРабот.ОбъектРемонта = ВТ_ЗакрываемыеПредписания.ОбъектРемонта
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(торо_ВнешниеОснованияДляРабот.Регистратор) = ТИП(Документ.торо_ВнешнееОснованиеДляРабот)
		|
		|СГРУППИРОВАТЬ ПО
		|	торо_ВнешниеОснованияДляРабот.Регистратор,
		|	ВТ_ЗакрываемыеПредписания.Ссылка
		|ИТОГИ ПО
		|	Ссылка";
		
		ВыборкаДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
		
		Пока ВыборкаДокументов.Следующий() Цикл
			
			ВнешнееОснование = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.Прямой); 
			
			ОбъектДокумента = ВыборкаДокументов.Ссылка.ПолучитьОбъект();
			
			Пока ВнешнееОснование.Следующий() Цикл
				ТЧДокументовОснований = ОбъектДокумента.ДокументыОснования;
				Если ТЧДокументовОснований.Найти(ВнешнееОснование.Регистратор, "ДокументОснование") = Неопределено Тогда
					НоваяСтрока = ОбъектДокумента.ДокументыОснования.Добавить();
					НоваяСтрока.ДокументОснование = ВнешнееОснование.Регистратор;
				КонецЕсли; 
				
			КонецЦикла;
			
			ОбъектДокумента.Записать();
		КонецЦикла;
		
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡Los documentos con вкладки ""las razones Exteriores para los trabajos"" en вкладку ""los Documentos de la razón"" no son añadidos! Por la causa: ';ru='Документы с вкладки ""Внешние основания для работ"" на вкладку ""Документы основания"" НЕ добавлены! По причине: ';en='Documents from the tab ""External basis for work"" to the tab ""Documents of the basis"" are NOT added! Because of: '")+ОписаниеОшибки);
	КонецПопытки;
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;

КонецПроцедуры

// 2.0.14.1

Процедура СформироватьЗановоДвиженияПоРегиструВнешнихОснованийДляРабот() Экспорт
		
	ОшибкаТранзакции = Ложь;
	НачатьТранзакцию();
	Попытка
		
		// удаление возможных лишних движений, сделанных в 13ом релизе
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	торо_ВнешниеОснованияДляРабот.Регистратор КАК Регистратор
		               |ИЗ
		               |	РегистрСведений.торо_ВнешниеОснованияДляРабот КАК торо_ВнешниеОснованияДляРабот
		               |ГДЕ
		               |	торо_ВнешниеОснованияДляРабот.Регистратор.Проведен = ЛОЖЬ";
		
		ВыборкаДокументов = Запрос.Выполнить().Выбрать();
		
		Пока ВыборкаДокументов.Следующий() Цикл
			
			НаборЗаписей = РегистрыСведений.торо_ВнешниеОснованияДляРабот.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаДокументов.Регистратор);
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			НаборЗаписей.Записать(Истина);
		
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ВыявленныеДефектыДокументыОснования.ДокументОснование КАК ДокументОснование,
		|	торо_ВыявленныеДефектыДокументыОснования.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Основания
		|ИЗ
		|	Документ.торо_ВыявленныеДефекты.ДокументыОснования КАК торо_ВыявленныеДефектыДокументыОснования
		|ГДЕ
		|	торо_ВыявленныеДефектыДокументыОснования.Ссылка.Проведен = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_АктОВыполненииЭтапаРаботДокументыОснования.ДокументОснование,
		|	торо_АктОВыполненииЭтапаРаботДокументыОснования.Ссылка
		|ИЗ
		|	Документ.торо_АктОВыполненииЭтапаРабот.ДокументыОснования КАК торо_АктОВыполненииЭтапаРаботДокументыОснования
		|ГДЕ
		|	торо_АктОВыполненииЭтапаРаботДокументыОснования.Ссылка.Проведен = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_ЗаявкаНаРемонтДокументыОснования.ДокументОснование,
		|	торо_ЗаявкаНаРемонтДокументыОснования.Ссылка
		|ИЗ
		|	Документ.торо_ЗаявкаНаРемонт.ДокументыОснования КАК торо_ЗаявкаНаРемонтДокументыОснования
		|ГДЕ
		|	торо_ЗаявкаНаРемонтДокументыОснования.Ссылка.Проведен = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_НарядНаВыполнениеРемонтныхРаботДокументыОснования.ДокументОснование,
		|	торо_НарядНаВыполнениеРемонтныхРаботДокументыОснования.Ссылка
		|ИЗ
		|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.ДокументыОснования КАК торо_НарядНаВыполнениеРемонтныхРаботДокументыОснования
		|ГДЕ
		|	торо_НарядНаВыполнениеРемонтныхРаботДокументыОснования.Ссылка.Проведен = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Основания.ДокументОснование КАК ДокументОснование,
		|	ВТ_Основания.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ПредписанияИзОснований
		|ИЗ
		|	ВТ_Основания КАК ВТ_Основания
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(ВТ_Основания.ДокументОснование) = ТИП(Документ.торо_ВнешнееОснованиеДляРабот)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ID КАК ID,
		|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка КАК Ссылка,
		|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта
		|ПОМЕСТИТЬ ВТ_РемонтныеРаботы
		|ИЗ
		|	Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК торо_АктОВыполненииЭтапаРаботРемонтыОборудования
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_ЗаявкаНаРемонтРемонтыОборудования.ID,
		|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка,
		|	торо_ЗаявкаНаРемонтРемонтыОборудования.ОбъектРемонта
		|ИЗ
		|	Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК торо_ЗаявкаНаРемонтРемонтыОборудования
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_ВыявленныеДефектыСписокДефектов.ID,
		|	торо_ВыявленныеДефектыСписокДефектов.Ссылка,
		|	торо_ВыявленныеДефектыСписокДефектов.ОбъектРемонта
		|ИЗ
		|	Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID,
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка,
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОбъектРемонта
		|ИЗ
		|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтыОборудования КАК торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ЗаявкаНаРемонтЗакрываемыеПредписания.ID КАК ID,
		|	торо_ЗаявкаНаРемонтЗакрываемыеПредписания.ОбъектРемонта КАК ОбъектРемонта,
		|	торо_ЗаявкаНаРемонтЗакрываемыеПредписания.Описание КАК Описание,
		|	торо_ЗаявкаНаРемонтЗакрываемыеПредписания.ПлановаяДатаРемонта КАК ПлановаяДатаРемонта,
		|	торо_ЗаявкаНаРемонтЗакрываемыеПредписания.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		|	торо_ЗаявкаНаРемонтЗакрываемыеПредписания.Ссылка КАК Ссылка,
		|	торо_ЗаявкаНаРемонтЗакрываемыеПредписания.Ссылка.Подразделение КАК Подразделение,
		|	торо_ЗаявкаНаРемонтЗакрываемыеПредписания.Ссылка.Организация КАК Организация
		|ПОМЕСТИТЬ ВТ_ЗакрываемыеПредписания
		|ИЗ
		|	Документ.торо_ЗаявкаНаРемонт.ЗакрываемыеПредписания КАК торо_ЗаявкаНаРемонтЗакрываемыеПредписания
		|ГДЕ
		|	торо_ЗаявкаНаРемонтЗакрываемыеПредписания.Ссылка.Проведен = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_АктОВыполненииЭтапаРаботЗакрываемыеПредписания.ID,
		|	торо_АктОВыполненииЭтапаРаботЗакрываемыеПредписания.ОбъектРемонта,
		|	торо_АктОВыполненииЭтапаРаботЗакрываемыеПредписания.Описание,
		|	торо_АктОВыполненииЭтапаРаботЗакрываемыеПредписания.ПлановаяДатаРемонта,
		|	торо_АктОВыполненииЭтапаРаботЗакрываемыеПредписания.РемонтыОборудования_ID,
		|	торо_АктОВыполненииЭтапаРаботЗакрываемыеПредписания.Ссылка,
		|	торо_АктОВыполненииЭтапаРаботЗакрываемыеПредписания.Ссылка.Подразделение,
		|	торо_АктОВыполненииЭтапаРаботЗакрываемыеПредписания.Ссылка.Организация
		|ИЗ
		|	Документ.торо_АктОВыполненииЭтапаРабот.ЗакрываемыеПредписания КАК торо_АктОВыполненииЭтапаРаботЗакрываемыеПредписания
		|ГДЕ
		|	торо_АктОВыполненииЭтапаРаботЗакрываемыеПредписания.Ссылка.Проведен = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_НарядНаВыполнениеРемонтныхРаботЗакрываемыеПредписания.ID,
		|	торо_НарядНаВыполнениеРемонтныхРаботЗакрываемыеПредписания.ОбъектРемонта,
		|	торо_НарядНаВыполнениеРемонтныхРаботЗакрываемыеПредписания.Описание,
		|	торо_НарядНаВыполнениеРемонтныхРаботЗакрываемыеПредписания.ПлановаяДатаРемонта,
		|	торо_НарядНаВыполнениеРемонтныхРаботЗакрываемыеПредписания.РемонтыОборудования_ID,
		|	торо_НарядНаВыполнениеРемонтныхРаботЗакрываемыеПредписания.Ссылка,
		|	торо_НарядНаВыполнениеРемонтныхРаботЗакрываемыеПредписания.Ссылка.Подразделение,
		|	торо_НарядНаВыполнениеРемонтныхРаботЗакрываемыеПредписания.Ссылка.Организация
		|ИЗ
		|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.ЗакрываемыеПредписания КАК торо_НарядНаВыполнениеРемонтныхРаботЗакрываемыеПредписания
		|ГДЕ
		|	торо_НарядНаВыполнениеРемонтныхРаботЗакрываемыеПредписания.Ссылка.Проведен = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПредписанияИзОснований.Ссылка.Дата КАК Дата,
		|	ВТ_ПредписанияИзОснований.Ссылка КАК Ссылка,
		|	торо_ВнешниеОснованияДляРабот.ОбъектРемонта КАК ОбъектРемонта,
		|	торо_ВнешниеОснованияДляРабот.ID КАК ID,
		|	торо_ВнешниеОснованияДляРабот.Описание КАК Описание,
		|	торо_ВнешниеОснованияДляРабот.ПлановаяДатаРемонта КАК ПлановаяДатаРемонта,
		|	ВТ_ПредписанияИзОснований.Ссылка.Организация КАК Организация,
		|	ВТ_ПредписанияИзОснований.Ссылка.Подразделение КАК Подразделение,
		|	торо_ВнешниеОснованияДляРабот.РемонтыОборудования_id КАК РемонтыОборудования_id
		|ПОМЕСТИТЬ ВТ_ИспользуемыеВнешниеОснования
		|ИЗ
		|	РегистрСведений.торо_ВнешниеОснованияДляРабот КАК торо_ВнешниеОснованияДляРабот
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПредписанияИзОснований КАК ВТ_ПредписанияИзОснований
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РемонтныеРаботы КАК ВТ_РемонтныеРаботы
		|			ПО ВТ_ПредписанияИзОснований.Ссылка = ВТ_РемонтныеРаботы.Ссылка
		|		ПО торо_ВнешниеОснованияДляРабот.Регистратор = ВТ_ПредписанияИзОснований.ДокументОснование
		|ГДЕ
		|	торо_ВнешниеОснованияДляРабот.ID = ВТ_РемонтныеРаботы.ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ИспользуемыеВнешниеОснования.Дата КАК Дата,
		|	ВТ_ИспользуемыеВнешниеОснования.Ссылка КАК Ссылка,
		|	ВТ_ИспользуемыеВнешниеОснования.ОбъектРемонта КАК ОбъектРемонта,
		|	ВТ_ИспользуемыеВнешниеОснования.ID КАК ID,
		|	ВТ_ИспользуемыеВнешниеОснования.Описание КАК Описание,
		|	ВТ_ИспользуемыеВнешниеОснования.ПлановаяДатаРемонта КАК ПлановаяДатаРемонта,
		|	ВТ_ИспользуемыеВнешниеОснования.Организация КАК Организация,
		|	ВТ_ИспользуемыеВнешниеОснования.Подразделение КАК Подразделение,
		|	ВТ_ИспользуемыеВнешниеОснования.РемонтыОборудования_id КАК РемонтыОборудования_id
		|ПОМЕСТИТЬ СДублями
		|ИЗ
		|	ВТ_ИспользуемыеВнешниеОснования КАК ВТ_ИспользуемыеВнешниеОснования
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ЗакрываемыеПредписания.Ссылка.Дата,
		|	ВТ_ЗакрываемыеПредписания.Ссылка,
		|	ВТ_ЗакрываемыеПредписания.ОбъектРемонта,
		|	ВТ_ЗакрываемыеПредписания.ID,
		|	ВТ_ЗакрываемыеПредписания.Описание,
		|	ВТ_ЗакрываемыеПредписания.ПлановаяДатаРемонта,
		|	ВТ_ЗакрываемыеПредписания.Организация,
		|	ВТ_ЗакрываемыеПредписания.Подразделение,
		|	ВТ_ЗакрываемыеПредписания.РемонтыОборудования_ID
		|ИЗ
		|	ВТ_ЗакрываемыеПредписания КАК ВТ_ЗакрываемыеПредписания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СДублями.Дата КАК Дата,
		|	СДублями.Ссылка КАК Ссылка,
		|	СДублями.ОбъектРемонта КАК ОбъектРемонта,
		|	СДублями.ID КАК ID,
		|	СДублями.ПлановаяДатаРемонта КАК ПлановаяДатаРемонта,
		|	СДублями.Организация КАК Организация,
		|	СДублями.Подразделение КАК Подразделение,
		|	СДублями.РемонтыОборудования_id КАК РемонтыОборудования_id,
		|	ВЫРАЗИТЬ(СДублями.Описание КАК СТРОКА(1000)) КАК Описание
		|ИЗ
		|	СДублями КАК СДублями
		|
		|СГРУППИРОВАТЬ ПО
		|	СДублями.Дата,
		|	СДублями.Ссылка,
		|	СДублями.ОбъектРемонта,
		|	СДублями.ID,
		|	СДублями.ПлановаяДатаРемонта,
		|	СДублями.Организация,
		|	СДублями.Подразделение,
		|	СДублями.РемонтыОборудования_id,
		|	ВЫРАЗИТЬ(СДублями.Описание КАК СТРОКА(1000))
		|ИТОГИ ПО
		|	Ссылка";
		
		ВыборкаДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
		
		Пока ВыборкаДокументов.Следующий() Цикл
			
			ВнешнееОснование = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.Прямой); 
			
			НаборЗаписей = РегистрыСведений.торо_ВнешниеОснованияДляРабот.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаДокументов.Ссылка);
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			
			Пока ВнешнееОснование.Следующий() Цикл
				Движение = НаборЗаписей.Добавить();
				Движение.Период = ВнешнееОснование.Дата;
				Движение.Регистратор = ВнешнееОснование.Ссылка;
				Движение.ОбъектРемонта = ВнешнееОснование.ОбъектРемонта;
				Движение.ID = ВнешнееОснование.ID;
				Движение.Описание = ВнешнееОснование.Описание;
				Движение.ПлановаяДатаРемонта = ВнешнееОснование.ПлановаяДатаРемонта;
				Движение.Обработано = Истина;
				Движение.Организация = ВнешнееОснование.Организация;
				Движение.Подразделение = ВнешнееОснование.Подразделение;
			КонецЦикла;

			НаборЗаписей.Записать(Истина);
		
		КонецЦикла;
		
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡Los movimientos de los documentos por el registro ""las razones Exteriores para los trabajos"" no son formados! Por la causa: ';ru='Движения документов по регистру ""Внешние основания для работ"" НЕ сформированы! По причине: ';en='Documents movements on the register ""External grounds for work"" are NOT formed! Due to: '")+ОписаниеОшибки);
	КонецПопытки;
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

Процедура УбратьЛишниеЗаписиИПереформироватьДвиженияДокументаУстановкаКоэффициентовРемонтныхОсобенностей() Экспорт
		
	ОшибкаТранзакции = Ложь;
	НачатьТранзакцию();
	Попытка
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	торо_УстановкаКоэффициентовРемонтныхОсобенностей.Ссылка КАК Ссылка,
		               |	торо_УстановкаКоэффициентовРемонтныхОсобенностей.Проведен КАК Проведен
		               |ПОМЕСТИТЬ ВТ_ВсеДокументы
		               |ИЗ
		               |	Документ.торо_УстановкаКоэффициентовРемонтныхОсобенностей КАК торо_УстановкаКоэффициентовРемонтныхОсобенностей
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ВсеДокументы.Ссылка КАК Ссылка,
		               |	торо_УстановкаКоэффициентовРемонтныхОсобенностейОбъектыРемонта.ОбъектРемонта КАК ОбъектРемонта,
		               |	ВТ_ВсеДокументы.Проведен КАК Проведен
		               |ПОМЕСТИТЬ ВТ_ВведенныеОР
		               |ИЗ
		               |	ВТ_ВсеДокументы КАК ВТ_ВсеДокументы
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_УстановкаКоэффициентовРемонтныхОсобенностей.ОбъектыРемонта КАК торо_УстановкаКоэффициентовРемонтныхОсобенностейОбъектыРемонта
		               |		ПО ВТ_ВсеДокументы.Ссылка = торо_УстановкаКоэффициентовРемонтныхОсобенностейОбъектыРемонта.Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ВведенныеОР.Ссылка КАК Ссылка,
		               |	ВТ_ВведенныеОР.ОбъектРемонта КАК ОбъектРемонта,
		               |	торо_УстановкаКоэффициентовРемонтныхОсобенностейКоэффициентыРемонтныхОсобенностей.ВидКоэффициента КАК ВидКоэффициента,
		               |	торо_УстановкаКоэффициентовРемонтныхОсобенностейКоэффициентыРемонтныхОсобенностей.ЗначениеКоэффициента КАК ЗначениеКоэффициента,
		               |	торо_УстановкаКоэффициентовРемонтныхОсобенностейКоэффициентыРемонтныхОсобенностей.ДатаНачалаИспользования КАК ДатаНачалаИспользования,
		               |	торо_УстановкаКоэффициентовРемонтныхОсобенностейКоэффициентыРемонтныхОсобенностей.Использование КАК Использование,
		               |	торо_УстановкаКоэффициентовРемонтныхОсобенностейКоэффициентыРемонтныхОсобенностей.РаспространятьНаПодчиненных КАК РаспространятьНаПодчиненных,
		               |	торо_УстановкаКоэффициентовРемонтныхОсобенностейКоэффициентыРемонтныхОсобенностей.Иерархия КАК Иерархия,
		               |	ВТ_ВведенныеОР.Проведен КАК Проведен
		               |ПОМЕСТИТЬ ВТ_КРООбъектов
		               |ИЗ
		               |	ВТ_ВведенныеОР КАК ВТ_ВведенныеОР
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_УстановкаКоэффициентовРемонтныхОсобенностей.КоэффициентыРемонтныхОсобенностей КАК торо_УстановкаКоэффициентовРемонтныхОсобенностейКоэффициентыРемонтныхОсобенностей
		               |		ПО ВТ_ВведенныеОР.Ссылка = торо_УстановкаКоэффициентовРемонтныхОсобенностейКоэффициентыРемонтныхОсобенностей.Ссылка
		               |			И ВТ_ВведенныеОР.ОбъектРемонта = торо_УстановкаКоэффициентовРемонтныхОсобенностейКоэффициентыРемонтныхОсобенностей.ОбъектРемонта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_КРООбъектов.Ссылка КАК Ссылка,
		               |	ВТ_КРООбъектов.ОбъектРемонта КАК ОбъектРемонта,
		               |	ВТ_КРООбъектов.ВидКоэффициента КАК ВидКоэффициента,
		               |	ВТ_КРООбъектов.ЗначениеКоэффициента КАК ЗначениеКоэффициента,
		               |	ВТ_КРООбъектов.ДатаНачалаИспользования КАК ДатаНачалаИспользования,
		               |	ВТ_КРООбъектов.Использование КАК Использование,
		               |	ВТ_КРООбъектов.РаспространятьНаПодчиненных КАК РаспространятьНаПодчиненных,
		               |	ВТ_КРООбъектов.Иерархия КАК Иерархия,
		               |	торо_УстановкаКоэффициентовРемонтныхОсобенностейКоэффициентыРемонтныхОсобенностейПодчиненных.ОбъектРемонта КАК ОбъектРемонтаПодчиненный,
		               |	торо_УстановкаКоэффициентовРемонтныхОсобенностейКоэффициентыРемонтныхОсобенностейПодчиненных.РодительИерархии КАК РодительИерархии,
		               |	ВТ_КРООбъектов.Проведен КАК Проведен
		               |ПОМЕСТИТЬ ВТ_ВсеДанные
		               |ИЗ
		               |	ВТ_КРООбъектов КАК ВТ_КРООбъектов
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_УстановкаКоэффициентовРемонтныхОсобенностей.КоэффициентыРемонтныхОсобенностейПодчиненных КАК торо_УстановкаКоэффициентовРемонтныхОсобенностейКоэффициентыРемонтныхОсобенностейПодчиненных
		               |		ПО ВТ_КРООбъектов.Ссылка = торо_УстановкаКоэффициентовРемонтныхОсобенностейКоэффициентыРемонтныхОсобенностейПодчиненных.Ссылка
		               |			И ВТ_КРООбъектов.ОбъектРемонта = торо_УстановкаКоэффициентовРемонтныхОсобенностейКоэффициентыРемонтныхОсобенностейПодчиненных.РодительИерархии
		               |			И (торо_УстановкаКоэффициентовРемонтныхОсобенностейКоэффициентыРемонтныхОсобенностейПодчиненных.ВидКоэффициента = ВТ_КРООбъектов.ВидКоэффициента)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ВсеДанные.Ссылка КАК Ссылка,
		               |	ВТ_ВсеДанные.ОбъектРемонта КАК ОбъектРемонта,
		               |	ЕСТЬNULL(ВТ_ВсеДанные.ВидКоэффициента, ЗНАЧЕНИЕ(Справочник.торо_ВидыКоэффициентовРемонтныхОсобенностей.ПустаяСсылка)) КАК ВидКоэффициента,
		               |	ВТ_ВсеДанные.ЗначениеКоэффициента КАК ЗначениеКоэффициента,
		               |	ВТ_ВсеДанные.ДатаНачалаИспользования КАК ДатаНачалаИспользования,
		               |	ВТ_ВсеДанные.Использование КАК Использование,
		               |	ВТ_ВсеДанные.РаспространятьНаПодчиненных КАК РаспространятьНаПодчиненных,
		               |	ВТ_ВсеДанные.Иерархия КАК Иерархия
		               |ИЗ
		               |	ВТ_ВсеДанные КАК ВТ_ВсеДанные
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВТ_ВсеДанные.Ссылка,
		               |	ВТ_ВсеДанные.ОбъектРемонта,
		               |	ЕСТЬNULL(ВТ_ВсеДанные.ВидКоэффициента, ЗНАЧЕНИЕ(Справочник.торо_ВидыКоэффициентовРемонтныхОсобенностей.ПустаяСсылка)),
		               |	ВТ_ВсеДанные.ЗначениеКоэффициента,
		               |	ВТ_ВсеДанные.ДатаНачалаИспользования,
		               |	ВТ_ВсеДанные.Использование,
		               |	ВТ_ВсеДанные.РаспространятьНаПодчиненных,
		               |	ВТ_ВсеДанные.Иерархия
		               |ИТОГИ ПО
		               |	Ссылка";
		
		// записи в регистр
		РезультатЗапроса = Запрос.Выполнить();
		
		// Удаление лишних записей из документов, должны обойти все документы, но сделать только верные записи.
		ВыборкаДокументов = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
		
		Пока ВыборкаДокументов.Следующий() Цикл
			
			ДокВыборка = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.Прямой); 
			ДокументОбъект = ВыборкаДокументов.Ссылка.ПолучитьОбъект();
			ДокументОбъект.КоэффициентыРемонтныхОсобенностей.Очистить();
			
			Пока ДокВыборка.Следующий() Цикл
				Если ЗначениеЗаполнено(ДокВыборка.ВидКоэффициента) Тогда
					НоваяСтрока = ДокументОбъект.КоэффициентыРемонтныхОсобенностей.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ДокВыборка);				
				КонецЕсли; 
			КонецЦикла;
			
			ДокументОбъект.Записать();
			
			// формирование движений 
			НаборЗаписей = РегистрыСведений.торо_ЗначенияКоэффициентовРемонтныхОсобенностей.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаДокументов.Ссылка);
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			Если ДокументОбъект.Проведен Тогда
			 
				Для каждого Коэффициент Из ДокументОбъект.КоэффициентыРемонтныхОсобенностей Цикл
					
					Движение = НаборЗаписей.Добавить();
					
					Движение.Период = Коэффициент.ДатаНачалаИспользования;
					Движение.ОбъектРемонта = Коэффициент.ОбъектРемонта;
					Движение.ВидКоэффициента = Коэффициент.ВидКоэффициента;
					Движение.ЗначениеКоэффициента = Коэффициент.ЗначениеКоэффициента;
					Движение.Использование = Коэффициент.Использование;
					
					Если Коэффициент.РаспространятьНаПодчиненных Тогда
						// получить список подчиненных
						СписокОР = торо_РаботаСИерархией20.ПолучитьМассивПодчиненныхОбъектов(Коэффициент.ОбъектРемонта, Коэффициент.Иерархия);
						Для каждого ОбъектРемонта Из СписокОР Цикл
							Движение = НаборЗаписей.Добавить();
							
							Движение.Период = Коэффициент.ДатаНачалаИспользования;
							Движение.ОбъектРемонта = ОбъектРемонта;
							Движение.ВидКоэффициента = Коэффициент.ВидКоэффициента;
							Движение.ЗначениеКоэффициента = Коэффициент.ЗначениеКоэффициента;
							Движение.Использование = Коэффициент.Использование;				
						КонецЦикла; 
					КонецЕсли; 
				КонецЦикла; 
				
			КонецЕсли; 
			НаборЗаписей.Записать(Истина);			
		КонецЦикла;		
	
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡Los movimientos de los documentos por el registro ""la Instalación de los coeficientes de los rasgos de reparación"" no son formados! Por la causa: ';ru='Движения документов по регистру ""Установка коэффициентов ремонтных особенностей"" НЕ сформированы! По причине: ';en='Documents movements in the register ""Installation of repair features coefficients"" are NOT formed! Due to: '")+ОписаниеОшибки);
	КонецПопытки;
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьРегистр_торо_ПлановыеМероприятия20141() экспорт
	
	ОшибкаТранзакции = Ложь;
	НачатьТранзакцию();

	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	торо_ПлановыеМероприятия.СписокОбъектов КАК СписокОбъектов,
		               |	торо_ПлановыеМероприятия.ВидМероприятия КАК ВидМероприятия,
		               |	торо_ПлановыеМероприятия.ID КАК ID,
		               |	торо_ПлановыеМероприятия.Подразделение КАК Подразделение,
		               |	торо_ПлановыеМероприятия.Организация КАК Организация,
		               |	торо_ПлановыеМероприятия.ДатаНачала КАК ДатаНачала,
		               |	торо_ПлановыеМероприятия.ДатаОкончания КАК ДатаОкончания,
		               |	торо_ПлановыеМероприятия.Исполнитель КАК Исполнитель,
		               |	торо_ПлановыеМероприятия.Отменен КАК Отменен,
		               |	торо_ПлановыеМероприятия.СпособВыполнения КАК СпособВыполнения,
		               |	торо_ПлановыеМероприятия.СтоимостьРемонта КАК СтоимостьРемонта,
		               |	торо_ПлановыеМероприятия.МоментВремени КАК МоментВремени,
		               |	торо_ПлановыеМероприятия.Регистратор КАК Регистратор
		               |ПОМЕСТИТЬ Регистр
		               |ИЗ
		               |	РегистрСведений.торо_ПлановыеМероприятия КАК торо_ПлановыеМероприятия
		               |ГДЕ
		               |	торо_ПлановыеМероприятия.СпособВыполнения = &СпособВыполнения
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Регистратор,
		               |	ID
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Регистр.СписокОбъектов КАК СписокОбъектов,
		               |	Регистр.ВидМероприятия КАК ВидМероприятия,
		               |	Регистр.ID КАК ID,
		               |	Регистр.Подразделение КАК Подразделение,
		               |	Регистр.Организация КАК Организация,
		               |	Регистр.ДатаНачала КАК ДатаНачала,
		               |	Регистр.ДатаОкончания КАК ДатаОкончания,
		               |	Регистр.Исполнитель КАК Исполнитель,
		               |	Регистр.Отменен КАК Отменен,
		               |	Регистр.СтоимостьРемонта КАК СтоимостьРемонта,
		               |	Регистр.МоментВремени КАК МоментВремени,
		               |	торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов.СпособВыполнения КАК СпособВыполнения,
		               |	Регистр.Регистратор КАК Регистратор
		               |ИЗ
		               |	Регистр КАК Регистр
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ГрафикРегламентныхМероприятийТОиР.ПланРемонтов КАК торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов
		               |		ПО Регистр.Регистратор = торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов.Ссылка
		               |			И Регистр.ID = торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов.ID
		               |ИТОГИ ПО
		               |	Регистратор";
		
		Запрос.УстановитьПараметр("СпособВыполнения", Перечисления.СпособыСтроительства.ПустаяСсылка());
		
		резЗапроса = Запрос.Выполнить();
		
		Если НЕ резЗапроса.Пустой() Тогда
			
			струкПоиска = Новый Структура("СписокОбъектов, ВидМероприятия, ID, Организация");
			
			ВыборкаПоРег = резЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоРег.Следующий() Цикл
				Выборка = ВыборкаПоРег.Выбрать();
				нз = РегистрыСведений.торо_ПлановыеМероприятия.СоздатьНаборЗаписей();
				нз.Отбор.Регистратор.установить(ВыборкаПоРег.Регистратор);
				нз.Прочитать();
				тз = нз.выгрузить();
				датаДок = ВыборкаПоРег.Регистратор.Дата;
				
				Пока Выборка.Следующий() Цикл
					ЗаполнитьЗначенияСвойств(струкПоиска, Выборка);
					мас = тз.найтиСтроки(струкПоиска);
					Если мас.Количество() = 1 И ЗначениеЗаполнено(Выборка.СпособВыполнения) Тогда
						мас[0].СпособВыполнения = Выборка.СпособВыполнения;
					КонецЕсли;
				КонецЦикла;
				
				Для каждого текСтрока из тз Цикл
					Если НЕ ЗначениеЗаполнено(текСтрока.Период) Тогда
						текСтрока.Период = датаДок;
					КонецЕсли;
				КонецЦикла;
				
				нз.Загрузить(тз);
				нз.Записать();
			КонецЦикла;
		КонецЕсли;		
		
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡La renovación del registro de las noticias ""las medidas Planificadas"" no es cumplido! Por la causa: ';ru='Обновление регистра сведений ""Плановые мероприятия"" НЕ выполнена! По причине: ';en='Updating the register of information ""Planned events"" NOT completed! Due to: '")+ОписаниеОшибки);
	КонецПопытки;
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьВидыЦенВУстановкеЦенНоменклатуры() экспорт
	
	ОшибкаТранзакции = Ложь;
	НачатьТранзакцию();

	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	УстановкаЦенНоменклатурыТовары.Ссылка КАК Ссылка,
		|	УстановкаЦенНоменклатурыТовары.ВидЦены КАК ВидЦены
		|ИЗ
		|	Документ.УстановкаЦенНоменклатуры.Товары КАК УстановкаЦенНоменклатурыТовары
		|ГДЕ
		|	УстановкаЦенНоменклатурыТовары.ВидЦены <> &ПустоеЗначение
		|ИТОГИ ПО
		|	Ссылка";
		
		Запрос.УстановитьПараметр("ПустоеЗначение", Справочники.ВидыЦен.ПустаяСсылка());
		ВыборкаДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
		
		Пока ВыборкаДокументов.Следующий() Цикл
			ВыборкаВидовЦен = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.Прямой);
			ДокОбъект = ВыборкаДокументов.Ссылка.ПолучитьОбъект();
			ДокОбъект.ВидыЦен.Очистить();
			Пока ВыборкаВидовЦен.Следующий() Цикл
				НовСтр = ДокОбъект.ВидыЦен.Добавить();
				НовСтр.ВидЦены = ВыборкаВидовЦен.ВидЦены;
			КонецЦикла;
			ДокОбъект.ОбменДанными.Загрузка = Истина;
			ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЦикла;
		
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡El relleno de la tabla de los tipos de los precios en los documentos ""la Instalación de los precios de la nomenclatura"" no es cumplido! Por la causa: ';ru='Заполнение таблицы видов цен в документах ""Установка цен номенклатуры"" НЕ выполнено! По причине: ';en='Filling the table of price types in the documents ""Setting the prices of the item"" is NOT completed! Due to: '")+ОписаниеОшибки);
	КонецПопытки;
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьПараметрыНабораСвойствСправочникаВидыРемонта() Экспорт
	
	НачатьТранзакцию();
	ОшибкаТранзакции = Ложь;
	Попытка
		
		ПараметрыНабора = УправлениеСвойствами.СтруктураПараметровНабораСвойств();
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Справочник_торо_ВидыРемонтов", ПараметрыНабора);
		
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡La renovación de los parámetros de los juegos de las propiedades adicionales no es cumplido! Por la causa: ';ru='Обновление параметров наборов дополнительных свойств не выполнена! По причине: ';en='Updating parameters of sets of additional properties failed! Because of: '")+ОписаниеОшибки);
	КонецПопытки;   
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли; 	
	
КонецПроцедуры

// 2.0.15.1

Процедура ОбновитьДанныеРегистраМинимальныеОстаткиНоменклатуры() Экспорт
	
	НачатьТранзакцию();
	ОшибкаТранзакции = Ложь;
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	торо_УстановкаМинимальногоОстаткаНоменклатурыНоменклатура.МинимальныйОстаток КАК МинимальныйОстатокНоменклатура,
		               |	торо_МинимальныеОстаткиНоменклатуры.МинимальныйОстаток КАК МинимальныйОстатокРегистр,
		               |	торо_МинимальныеОстаткиНоменклатуры.Регистратор КАК Регистратор,
		               |	торо_МинимальныеОстаткиНоменклатуры.Номенклатура КАК Номенклатура
		               |ИЗ
		               |	РегистрСведений.торо_МинимальныеОстаткиНоменклатуры КАК торо_МинимальныеОстаткиНоменклатуры
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_УстановкаМинимальногоОстаткаНоменклатуры.Номенклатура КАК торо_УстановкаМинимальногоОстаткаНоменклатурыНоменклатура
		               |		ПО торо_МинимальныеОстаткиНоменклатуры.Регистратор.Ссылка = торо_УстановкаМинимальногоОстаткаНоменклатурыНоменклатура.Ссылка
		               |			И торо_МинимальныеОстаткиНоменклатуры.Номенклатура = торо_УстановкаМинимальногоОстаткаНоменклатурыНоменклатура.Номенклатура
		               |ГДЕ
		               |	торо_МинимальныеОстаткиНоменклатуры.МинимальныйОстаток = 0
		               |ИТОГИ ПО
		               |	Регистратор";
		
		Результат = Запрос.Выполнить();
		Если не Результат.Пустой() Тогда
			ВыборкаПоРег = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаПоРег.Следующий() Цикл		
				Выборка = ВыборкаПоРег.Выбрать(); 		
				НЗ = РегистрыСведений.торо_МинимальныеОстаткиНоменклатуры.СоздатьНаборЗаписей();
				НЗ.Отбор.Регистратор.Установить(ВыборкаПоРег.Регистратор);
				НЗ.Прочитать();
				ТЗ = НЗ.Выгрузить(); 	
				Пока Выборка.Следующий() Цикл 				
					Строка = ТЗ.Найти(Выборка.Номенклатура, "Номенклатура");
					Строка.МинимальныйОстаток = Выборка.МинимальныйОстатокНоменклатура;
				КонецЦикла;	
				НЗ.Загрузить(ТЗ);
				НЗ.Записать();
			КонецЦикла;
		КонецЕсли;
				
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡La renovación del registro de las noticias ""MinimalnyeOstatkiNomenklatury"" no es cumplida! Por la causa: ';ru='Обновление регистра сведений ""МинимальныеОстаткиНоменклатуры"" НЕ выполнено! По причине: ';en='Update of the Minimum Residues of Nomenclature information register is NOT completed! Due to: '")+ОписаниеОшибки);
	КонецПопытки;   
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли; 	

КонецПроцедуры 

Процедура УдалениеЛишнихЗаписейИзРемонтныхРаботАктаРегламентногоМероприятия() Экспорт
	
	ОшибкаТранзакции = Ложь;
	НачатьТранзакцию();
	
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.Ссылка КАК Ссылка,
		|	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.НомерСтроки КАК НомерСтроки,
		|	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.ID КАК ID,
		|	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.Выполнено КАК Выполнено,
		|	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.ПроцентВыполненияРабот КАК ПроцентВыполненияРабот,
		|	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.РемонтнаяРабота КАК РемонтнаяРабота,
		|	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.Родитель_ID КАК Родитель_ID,
		|	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.СдельныйНаряд КАК СдельныйНаряд,
		|	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.Сумма КАК Сумма,
		|	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		|	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.Картинка КАК Картинка,
		|	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.Количество КАК Количество
		|ИЗ
		|	Документ.торо_АктОВыполненииРегламентногоМероприятия.РемонтныеРаботы КАК торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииРегламентногоМероприятия.Мероприятия КАК торо_АктОВыполненииРегламентногоМероприятияМероприятия
		|		ПО торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.РемонтыОборудования_ID = торо_АктОВыполненииРегламентногоМероприятияМероприятия.ID
		|			И торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.Ссылка = торо_АктОВыполненииРегламентногоМероприятияМероприятия.Ссылка
		|ИТОГИ ПО
		|	Ссылка";
		
		ВыборкаДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаДокументов.Следующий() Цикл
			
			ДокументАкта = ВыборкаДокументов.Ссылка.ПолучитьОбъект();
			ДокументАкта.РемонтныеРаботы.Очистить();
			
			ВыборкаЗаписей = ВыборкаДокументов.Выбрать();
			Пока ВыборкаЗаписей.Следующий() Цикл
				НС = ДокументАкта.РемонтныеРаботы.Добавить();
				ЗаполнитьЗначенияСвойств(НС, ВыборкаЗаписей);
			КонецЦикла;
		    ДокументАкта.Записать(РежимЗаписиДокумента.Запись);
		КонецЦикла;
		
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='La renovación de los documentos de las actas sobre la ejecución de la medida de reglamento no es cumplida. Por la causa: ';ru='Обновление документов актов о выполнении регламентного мероприятия НЕ выполнено. По причине: ';en='Updating the documents of acts on the implementation of the regulatory action is NOT completed. Due to: '")+ОписаниеОшибки);
	КонецПопытки;
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;

КонецПроцедуры
 
Процедура СформироватьДвиженияАктовПоРегиструПроцентыВыполненияРемонтныхРабот() Экспорт
	
	ОшибкаТранзакции = Ложь;
	НачатьТранзакцию();
	
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.Ссылка КАК Ссылка,
		|	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.ID КАК ID,
		|	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.Родитель_ID КАК Родитель_ID,
		|	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.РемонтнаяРабота КАК РемонтнаяРабота,
		|	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.ПроцентВыполненияРабот КАК ПроцентВыполненияРабот,
		|	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.Выполнено КАК Выполнено,
		|	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.РемонтыОборудования_ID КАК РемонтыОборудования_ID
		|ПОМЕСТИТЬ СписокСсылок
		|ИЗ
		|	Документ.торо_АктОВыполненииРегламентногоМероприятия.РемонтныеРаботы КАК торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииРегламентногоМероприятия.РемонтныеРаботы КАК торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы1
		|		ПО торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.Ссылка = торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы1.Ссылка
		|			И торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.ID = торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы1.Родитель_ID
		|			И торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.РемонтыОборудования_ID = торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы1.РемонтыОборудования_ID
		|ГДЕ
		|	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.ПроцентВыполненияРабот <> 0
		|	И торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы1.РемонтнаяРабота ЕСТЬ NULL
		|	И торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.Ссылка.Проведен = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Ссылка,
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.ID,
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Родитель_ID,
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтнаяРабота,
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.ПроцентВыполненияРабот,
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Выполнено,
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтыОборудования_ID
		|ИЗ
		|	Документ.торо_АктОВыполненииЭтапаРабот.РемонтныеРаботы КАК торо_АктОВыполненииЭтапаРаботРемонтныеРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтныеРаботы КАК торо_АктОВыполненииЭтапаРаботРемонтныеРаботы1
		|		ПО торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Ссылка = торо_АктОВыполненииЭтапаРаботРемонтныеРаботы1.Ссылка
		|			И торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.ID = торо_АктОВыполненииЭтапаРаботРемонтныеРаботы1.Родитель_ID
		|			И торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтыОборудования_ID = торо_АктОВыполненииЭтапаРаботРемонтныеРаботы1.РемонтыОборудования_ID
		|ГДЕ
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.ПроцентВыполненияРабот <> 0
		|	И торо_АктОВыполненииЭтапаРаботРемонтныеРаботы1.РемонтнаяРабота ЕСТЬ NULL
		|	И торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Ссылка.Проведен = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписокСсылок.Ссылка КАК Регистратор,
		|	СписокСсылок.ID КАК ИДОперации,
		|	СписокСсылок.Родитель_ID КАК ИДРодителя,
		|	СписокСсылок.РемонтнаяРабота КАК Операция,
		|	СписокСсылок.РемонтыОборудования_ID КАК ИДРемонта,
		|	ВЫБОР
		|		КОГДА торо_ИспользоватьУсложненнуюСхемуЗакрытияНарядов.Значение = ИСТИНА
		|			ТОГДА СписокСсылок.ПроцентВыполненияРабот
		|		ИНАЧЕ ВЫБОР
		|				КОГДА СписокСсылок.Выполнено
		|					ТОГДА 100
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|	КОНЕЦ КАК Процент,
		|	СписокСсылок.Ссылка.Дата КАК Период
		|ИЗ
		|	СписокСсылок КАК СписокСсылок,
		|	Константа.торо_ИспользоватьУсложненнуюСхемуЗакрытияНарядов КАК торо_ИспользоватьУсложненнуюСхемуЗакрытияНарядов
		|ИТОГИ
		|	МАКСИМУМ(Период)
		|ПО
		|	Регистратор";
		
		ВыборкаДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаДокументов.Следующий() Цикл
			
			НаборЗаписей = РегистрыНакопления.торо_ПроцентВыполненныхРабот.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаДокументов.Регистратор);
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			
			ВыборкаЗаписей = ВыборкаДокументов.Выбрать();
			Пока ВыборкаЗаписей.Следующий() Цикл
				Движение = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(Движение, ВыборкаЗаписей);
			КонецЦикла;

			НаборЗаписей.Записать(Истина);
		
		КонецЦикла;
		
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡Los movimientos de los documentos ""el Acta sobre la ejecución de la medida de reglamento"" y ""el Acta sobre la ejecución de la etapa de los trabajos"" por el registro del por ciento de los trabajos cumplidos no son formados! Por la causa: ';ru='Движения документов ""Акт о выполнении регламентного мероприятия"" и ""Акт о выполнении этапа работ"" по регистру процента выполненных работ НЕ сформированы! По причине: ';en='Documents ""Act on the implementation of regulatory activities"" and ""Act on the implementation of the stage of work"" on the register of the percentage of completed work are NOT formed! Due to: '")+ОписаниеОшибки);
	КонецПопытки;
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

// 2.0.16.1

Процедура ОбновитьДанныеРегистраИсторияЗапчастейОбъектаРемонта() Экспорт
	
	НачатьТранзакцию();
	ОшибкаТранзакции = Ложь;
	
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_ИсторияЗапчастейОбъектаРемонта.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.торо_ИсторияЗапчастейОбъектаРемонта КАК торо_ИсторияЗапчастейОбъектаРемонта";
		Результат = Запрос.Выполнить();
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			НаборЗаписей = РегистрыСведений.торо_ИсторияЗапчастейОбъектаРемонта.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
			НаборЗаписей.Прочитать();
			
			Для Каждого Запись Из НаборЗаписей Цикл
				Запись.Установлена = Запись.УдалитьРесурс;
			КонецЦикла;	
			
			НаборЗаписей.Записать();
		КонецЦикла;
		
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡La renovación de los datos de los movimientos de las partes de recambio de los objetos de la reparación no es cumplida! Por la causa: ';ru='Обновление данных по движениям запчастей объектов ремонта НЕ выполнено! По причине: ';en='Updating data on movements of spare parts of repair objects is NOT completed! Because of: '")+ОписаниеОшибки);
	КонецПопытки;   

	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли; 	

КонецПроцедуры

Процедура ОбновитьНаименованияПрикреплённыхФотографийИзМобильногоПриложения() Экспорт
	
	НачатьТранзакцию();
	ОшибкаТранзакции = Ложь;
	
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	торо_ВыявленныеДефектыПрисоединенныеФайлы.Ссылка КАК Ссылка,
		               |	торо_ВыявленныеДефектыПрисоединенныеФайлы.Наименование КАК Наименование
		               |ИЗ
		               |	Справочник.торо_ВыявленныеДефектыПрисоединенныеФайлы КАК торо_ВыявленныеДефектыПрисоединенныеФайлы
		               |ГДЕ
		               |	торо_ВыявленныеДефектыПрисоединенныеФайлы.Наименование ПОДОБНО ""%:%""";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ОбъектВыборки = Выборка.Ссылка.ПолучитьОбъект();
			ОбъектВыборки.Наименование = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ОбъектВыборки.Наименование, ".");
			ОбъектВыборки.Записать();
			
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	торо_ОбъектыРемонтаПрисоединенныеФайлы.Ссылка КАК Ссылка,
		               |	торо_ОбъектыРемонтаПрисоединенныеФайлы.Наименование КАК Наименование
		               |ИЗ
		               |	Справочник.торо_ОбъектыРемонтаПрисоединенныеФайлы КАК торо_ОбъектыРемонтаПрисоединенныеФайлы
		               |ГДЕ
		               |	торо_ОбъектыРемонтаПрисоединенныеФайлы.Наименование ПОДОБНО ""%:%""";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ОбъектВыборки = Выборка.Ссылка.ПолучитьОбъект();
			ОбъектВыборки.Наименование = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ОбъектВыборки.Наименование, ".");
			ОбъектВыборки.Записать();
			
		КонецЦикла;
		
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡La renovación de los nombres de las fotografías sujetadas de la aplicación móvil no es cumplida! Por la causa: ';ru='Обновление наименований прикреплённых фотографий из мобильного приложения НЕ выполнено! По причине: ';en='Updating the names of attached photos from the mobile application is NOT completed! Because of: '")+ОписаниеОшибки);
	КонецПопытки;
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

// 2.0.16.3
Процедура ОбновитьРегистрЗапланированныеМероприятияОбъектов() Экспорт
		
	ОшибкаТранзакции = Ложь;
	НачатьТранзакцию();
	
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов.Ссылка КАК Ссылка,
		|	торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов.ID КАК ID,
		|	торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов.СписокОбъектовРемонта КАК СписокОбъектовРемонта,
		|	торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов.Ссылка.Дата КАК ДатаНач
		|ПОМЕСТИТЬ ДанныеИзПланаРемонтов
		|ИЗ
		|	Документ.торо_ГрафикРегламентныхМероприятийТОиР.ПланРемонтов КАК торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов
		|ГДЕ
		|	торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов.Ссылка.Проведен = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_МаршрутыРегламентныхМероприятий.ОбъектРемонта КАК ОбъектРемонта,
		|	ДанныеИзПланаРемонтов.СписокОбъектовРемонта КАК СписокОбъектовРемонта
		|ПОМЕСТИТЬ ДанныеИзОбъектовМаршрутов
		|ИЗ
		|	ДанныеИзПланаРемонтов КАК ДанныеИзПланаРемонтов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_МаршрутыРегламентныхМероприятий КАК торо_МаршрутыРегламентныхМероприятий
		|		ПО ДанныеИзПланаРемонтов.СписокОбъектовРемонта = торо_МаршрутыРегламентныхМероприятий.СписокОбъектов
		|
		|СГРУППИРОВАТЬ ПО
		|	торо_МаршрутыРегламентныхМероприятий.ОбъектРемонта,
		|	ДанныеИзПланаРемонтов.СписокОбъектовРемонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеИзПланаРемонтов.ID КАК ID,
		|	ИСТИНА КАК Активность,
		|	ДанныеИзОбъектовМаршрутов.ОбъектРемонта КАК ОбъектРемонта,
		|	ДанныеИзПланаРемонтов.Ссылка КАК Ссылка,
		|	ДанныеИзПланаРемонтов.ДатаНач КАК Период
		|ИЗ
		|	ДанныеИзПланаРемонтов КАК ДанныеИзПланаРемонтов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеИзОбъектовМаршрутов КАК ДанныеИзОбъектовМаршрутов
		|		ПО ДанныеИзПланаРемонтов.СписокОбъектовРемонта = ДанныеИзОбъектовМаршрутов.СписокОбъектовРемонта
		|ИТОГИ ПО
		|	Ссылка";
		
		ВыборкаДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
		
		Пока ВыборкаДокументов.Следующий() Цикл
			
			Выборка = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.Прямой); 
			НаборЗаписей = РегистрыСведений.торо_ЗапланированныеМероприятияОбъектов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаДокументов.Ссылка);
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			
			Пока Выборка.Следующий() Цикл
				Движение = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(Движение, Выборка);
				Движение.Регистратор = Выборка.Ссылка;
			КонецЦикла;

			НаборЗаписей.Записать(Истина);
		
		КонецЦикла;
		
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡Los movimientos de los documentos por el registro ""Zaplanirovannnye de la medida de los objetos"" no son formados! Por la causa: ';ru='Движения документов по регистру ""Запланированнные мероприятия объектов"" НЕ сформированы! По причине: ';en='Documents movements in the register ""Planned events of objects"" are NOT formed! Due to: '")+ОписаниеОшибки);
	КонецПопытки;
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновлениеСправочникаУсловияВыявленияДефектов() Экспорт
	
	ОшибкаТранзакции = Ложь;
	НачатьТранзакцию();
	
	Попытка
		спрСс = Справочники.торо_УсловияВыявленияДефекта.НайтиПоНаименованию("По данным АСУ ТП");
		Если ЗначениеЗаполнено(спрСс) Тогда
			спрОб = спрСс.ПолучитьОбъект();
			спрОб.УстановитьНовыйКод();
			спрОб.Записать();	
		КонецЕсли;
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡La renovación de la guía ""la Condición de la revelación de los defectos"" no es cumplida! Por la causa: ';ru='Обновление справочника ""Условия выявления дефектов"" не выполнено! По причине: ';en='The update of the ""Defect Detection Conditions"" directory has not been completed! Due to: '")+ОписаниеОшибки);
	КонецПопытки;
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

//2.0.17.1
Процедура ОбновитьРегистрПараметрыЗамещенияПланированияРемонтныхРабот() Экспорт
		
	ОшибкаТранзакции = Ложь;
	НачатьТранзакцию();
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_НормативныеРемонтыОборудования.ВидРемонта КАК ВидРемонта,
		|	торо_НормативныеРемонтыОборудования.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ДействующиеВР
		|ИЗ
		|	Справочник.торо_ТиповыеОР.НормативныеРемонты КАК торо_НормативныеРемонтыОборудования
		|ГДЕ
		|	торо_НормативныеРемонтыОборудования.Статус = ЗНАЧЕНИЕ(Перечисление.торо_СтатусыНормативныхРемонтовИТехКарт.Действует)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ВидРемонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ТиповыеОРЗамещаемыеРемонты.ВидРемонта КАК ВидРемонта,
		|	торо_ОбъектыРемонта.Ссылка КАК ОбъектРемонта,
		|	торо_ТиповыеОРЗамещаемыеРемонты.ЗамещаемыйВидРемонта КАК ЗамещаемыйВидРемонта,
		|	торо_ТиповыеОРЗамещаемыеРемонты.Ссылка КАК ТиповойОР,
		|	торо_ТиповыеОРЗамещаемыеРемонты.СпособЗамещения КАК СпособЗамещения,
		|	торо_ТиповыеОРЗамещаемыеРемонты.НачальнаяГраница КАК НачальнаяГраница,
		|	торо_ТиповыеОРЗамещаемыеРемонты.КонечнаяГраница КАК КонечнаяГраница,
		|	0 КАК Приоритет
		|ПОМЕСТИТЬ ТабБазПриоритетов
		|ИЗ
		|	Справочник.торо_ТиповыеОР.НормативныеРемонты КАК торо_ТиповыеОРНормативныеРемонты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|		ПО торо_ТиповыеОРНормативныеРемонты.Ссылка = торо_ОбъектыРемонта.ТиповойОР
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТиповыеОР.ЗамещаемыеРемонты КАК торо_ТиповыеОРЗамещаемыеРемонты
		|		ПО торо_ТиповыеОРНормативныеРемонты.Ссылка = торо_ТиповыеОРЗамещаемыеРемонты.Ссылка
		|			И торо_ТиповыеОРНормативныеРемонты.ВидРемонта = торо_ТиповыеОРЗамещаемыеРемонты.ВидРемонта
		|			И (торо_ТиповыеОРЗамещаемыеРемонты.ЗамещаемыйВидРемонта В
		|				(ВЫБРАТЬ
		|					ДействующиеВР.ВидРемонта
		|				ИЗ
		|					ДействующиеВР КАК ДействующиеВР))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.ВидРемонта,
		|	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.ОбъектРемонта,
		|	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.ЗамещаемыйВидРемонта,
		|	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.ТиповойОР,
		|	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.СпособЗамещения,
		|	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.НачальнаяГраница,
		|	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.КонечнаяГраница,
		|	1
		|ИЗ
		|	РегистрСведений.торо_ПараметрыЗамещенияПланированияРемонтныхРабот КАК торо_ПараметрыЗамещенияПланированияРемонтныхРабот
		|ГДЕ
		|	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.ТиповойОР = ЗНАЧЕНИЕ(Справочник.торо_ТиповыеОР.ПустаяСсылка)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОбъектРемонта,
		|	ВидРемонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабБазПриоритетов.ВидРемонта КАК ВидРемонта,
		|	ТабБазПриоритетов.ОбъектРемонта КАК ОбъектРемонта,
		|	МАКСИМУМ(ТабБазПриоритетов.Приоритет) КАК Приоритет
		|ПОМЕСТИТЬ ТабПриоритетов
		|ИЗ
		|	ТабБазПриоритетов КАК ТабБазПриоритетов
		|
		|СГРУППИРОВАТЬ ПО
		|	ТабБазПриоритетов.ВидРемонта,
		|	ТабБазПриоритетов.ОбъектРемонта
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОбъектРемонта,
		|	ВидРемонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабБазПриоритетов.ВидРемонта КАК ВидРемонта,
		|	ТабБазПриоритетов.ОбъектРемонта КАК ОбъектРемонта,
		|	ТабБазПриоритетов.ЗамещаемыйВидРемонта КАК ЗамещаемыйВидРемонта,
		|	ТабБазПриоритетов.ТиповойОР КАК ТиповойОР,
		|	ТабБазПриоритетов.СпособЗамещения КАК СпособЗамещения,
		|	ТабБазПриоритетов.НачальнаяГраница КАК НачальнаяГраница,
		|	ТабБазПриоритетов.КонечнаяГраница КАК КонечнаяГраница,
		|	ВЫБОР
		|		КОГДА ТабПриоритетов.Приоритет ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Приоритет
		|ИЗ
		|	ТабБазПриоритетов КАК ТабБазПриоритетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТабПриоритетов КАК ТабПриоритетов
		|		ПО ТабБазПриоритетов.ОбъектРемонта = ТабПриоритетов.ОбъектРемонта
		|			И ТабБазПриоритетов.ВидРемонта = ТабПриоритетов.ВидРемонта
		|			И ТабБазПриоритетов.Приоритет = ТабПриоритетов.Приоритет
		|ИТОГИ ПО
		|	ТиповойОР";
		
		
		резЗапроса = Запрос.Выполнить();
		Если НЕ резЗапроса.Пустой() Тогда
			ВыборкаПоТОР = резЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоТОР.Следующий() Цикл
				нз = РегистрыСведений.торо_ПараметрыЗамещенияПланированияРемонтныхРабот.СоздатьНаборЗаписей();
				нз.Отбор.ТиповойОР.Установить(ВыборкаПоТОР.ТиповойОР);
				
				Выборка = ВыборкаПоТОР.Выбрать();
				Пока Выборка.Следующий() Цикл
					нс = нз.Добавить();
					ЗаполнитьЗначенияСвойств(нс, Выборка);
				КонецЦикла;
				нз.Записать(Истина);
			КонецЦикла;
		КонецЕсли;
		
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡Las anotaciones en el registro ""los Parámetros de la sustitución de la planificación de los trabajos de reparación"" no son renovadas! Por la causa: ';ru='Записи в регистре ""Параметры замещения планирования ремонтных работ "" НЕ обновлены! По причине: ';en='Entriess in the register ""Replacement parameters of repair planning"" are NOT updated! Because of: '")+ОписаниеОшибки);
	КонецПопытки;
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

//2.0.18.1
Процедура ОбновитьРегистрИсторияЗапчастейОбъектаРемонта() Экспорт
		
	ОшибкаТранзакции = Ложь;
	НачатьТранзакцию();
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_АктОВыполненииЭтапаРаботСерийныеЗапчасти.Ссылка КАК Ссылка,
		|	торо_АктОВыполненииЭтапаРаботСерийныеЗапчасти.Номенклатура КАК Номенклатура,
		|	торо_АктОВыполненииЭтапаРаботСерийныеЗапчасти.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	торо_АктОВыполненииЭтапаРаботСерийныеЗапчасти.СерияНоменклатуры КАК СерияНоменклатуры,
		|	торо_АктОВыполненииЭтапаРаботСерийныеЗапчасти.СтатусДвиженияСерийныхЗЧ КАК СтатусДвиженияСерийныхЗЧ,
		|	торо_АктОВыполненииЭтапаРаботСерийныеЗапчасти.Количество КАК Количество,
		|	торо_АктОВыполненииЭтапаРаботСерийныеЗапчасти.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		|	ЛОЖЬ КАК Установлена
		|ПОМЕСТИТЬ ВТ_Запчасти
		|ИЗ
		|	Документ.торо_АктОВыполненииЭтапаРабот.СерийныеЗапчасти КАК торо_АктОВыполненииЭтапаРаботСерийныеЗапчасти
		|ГДЕ
		|	торо_АктОВыполненииЭтапаРаботСерийныеЗапчасти.Ссылка.Проведен = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_АктОВыполненииЭтапаРаботСерийныеЗапчасти.Ссылка,
		|	торо_АктОВыполненииЭтапаРаботСерийныеЗапчасти.НоменклатураНовая,
		|	торо_АктОВыполненииЭтапаРаботСерийныеЗапчасти.ХарактеристикаНоменклатурыНовая,
		|	торо_АктОВыполненииЭтапаРаботСерийныеЗапчасти.СерияНоменклатурыНовая,
		|	торо_АктОВыполненииЭтапаРаботСерийныеЗапчасти.СтатусДвиженияНовойЗЧ,
		|	торо_АктОВыполненииЭтапаРаботСерийныеЗапчасти.КоличествоНовое,
		|	торо_АктОВыполненииЭтапаРаботСерийныеЗапчасти.РемонтыОборудования_ID,
		|	ИСТИНА
		|ИЗ
		|	Документ.торо_АктОВыполненииЭтапаРабот.СерийныеЗапчасти КАК торо_АктОВыполненииЭтапаРаботСерийныеЗапчасти
		|ГДЕ
		|	торо_АктОВыполненииЭтапаРаботСерийныеЗапчасти.Ссылка.Проведен = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта,
		|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ID КАК ID,
		|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка КАК Ссылка,
		|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка.Дата КАК Дата
		|ПОМЕСТИТЬ ВТ_ОбъектыРемонта
		|ИЗ
		|	Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК торо_АктОВыполненииЭтапаРаботРемонтыОборудования
		|ГДЕ
		|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка.Проведен = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Запчасти.Ссылка КАК Ссылка,
		|	ВТ_Запчасти.Номенклатура КАК Запчасть,
		|	ВТ_Запчасти.ХарактеристикаНоменклатуры КАК Характеристика,
		|	ВТ_Запчасти.СерияНоменклатуры КАК СерийныйНомер,
		|	ВТ_Запчасти.СтатусДвиженияСерийныхЗЧ КАК СтатусДвиженияЗЧ,
		|	СУММА(ВТ_Запчасти.Количество) КАК Количество,
		|	ВТ_ОбъектыРемонта.ОбъектРемонта КАК ОбъектРемонта,
		|	ВТ_Запчасти.Установлена КАК Установлена,
		|	ВТ_ОбъектыРемонта.Дата КАК Период
		|ИЗ
		|	ВТ_Запчасти КАК ВТ_Запчасти
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОбъектыРемонта КАК ВТ_ОбъектыРемонта
		|		ПО ВТ_Запчасти.РемонтыОборудования_ID = ВТ_ОбъектыРемонта.ID
		|			И ВТ_Запчасти.Ссылка = ВТ_ОбъектыРемонта.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Запчасти.Ссылка,
		|	ВТ_Запчасти.Номенклатура,
		|	ВТ_Запчасти.ХарактеристикаНоменклатуры,
		|	ВТ_Запчасти.СерияНоменклатуры,
		|	ВТ_Запчасти.СтатусДвиженияСерийныхЗЧ,
		|	ВТ_ОбъектыРемонта.ОбъектРемонта,
		|	ВТ_Запчасти.Установлена,
		|	ВТ_ОбъектыРемонта.Дата
		|ИТОГИ ПО
		|	Ссылка";
		
		ВыборкаДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
		
		Пока ВыборкаДокументов.Следующий() Цикл
			
			Выборка = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.Прямой); 
			НаборЗаписей = РегистрыСведений.торо_ИсторияЗапчастейОбъектаРемонта.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаДокументов.Ссылка);
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			
			Пока Выборка.Следующий() Цикл
				Движение = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(Движение, Выборка);
				Движение.Регистратор = Выборка.Ссылка;
			КонецЦикла;

			НаборЗаписей.Записать(Истина);
		
		КонецЦикла;
		
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡Los movimientos de los documentos por el registro ""la Historia de las partes de recambio de los objetos de la reparación"" no son formados! Por la causa: ';ru='Движения документов по регистру ""История запчастей объектов ремонта"" НЕ сформированы! По причине: ';en='Documents movements in the register ""History of spare parts for repair objects"" are NOT formed! Due to: '")+ОписаниеОшибки);
	КонецПопытки;
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьРегистрОтмененныеЗаявки() Экспорт
	
	ОшибкаТранзакции = Ложь;
	НачатьТранзакцию();
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеЗаявки.Заявка КАК Заявка,
		|	торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеЗаявки.ПричинаЗакрытия КАК ПричинаЗакрытия,
		|	торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеЗаявки.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.торо_ЗакрытиеЗаявокИРемонтов.ЗакрываемыеЗаявки КАК торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеЗаявки
		|ИТОГИ ПО
		|	торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеЗаявки.Ссылка";
		
		ВыборкаДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
		
		Пока ВыборкаДокументов.Следующий() Цикл
			
			Выборка = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.Прямой); 
			НаборЗаписей = РегистрыСведений.торо_ОтмененныеЗаявки.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаДокументов.Ссылка);
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			
			Пока Выборка.Следующий() Цикл
				Движение = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(Движение, Выборка);
				Движение.Регистратор = Выборка.Ссылка;
			КонецЦикла;

			НаборЗаписей.Записать(Истина);
		
		КонецЦикла;
		
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡Los movimientos de los documentos por el registro ""las demandas Anuladas"" no son formados! Por la causa: ';ru='Движения документов по регистру ""Отмененные заявки"" НЕ сформированы! По причине: ';en='Documents movement on the register ""Canceled applications"" are NOT formed! Due to: '")+ОписаниеОшибки);
	КонецПопытки;
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры	

Процедура ОбновитьРегистрНастройкиУведомлений() Экспорт
	
	ОшибкаТранзакции = Ложь;
	НачатьТранзакцию();
	Попытка
		
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
					   |  	Уведомления.ВидДокумента КАК ВидДокумента,
					   |  	Уведомления.СобытиеПоДокументу КАК СобытиеПоДокументу,
					   |  	Уведомления.Событие КАК Событие
					   |ИЗ
					   |  	РегистрСведений.торо_НастройкиУведомлений КАК Уведомления
					   |ГДЕ
					   |	Уведомления.Событие = ЗНАЧЕНИЕ(Перечисление.торо_СобытияУведомленийПользователей.ИзменениеДокумента)";

		СобытиеИзмененияДокумента = Перечисления.торо_СобытияУведомленийПользователей.РегистрацияДокумента;
		Выборка = Запрос.Выполнить().Выбрать();
		НаборЗаписей = РегистрыСведений.торо_НастройкиУведомлений.СоздатьНаборЗаписей();
		Пока Выборка.Следующий() Цикл
			СтрокаНабора = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНабора, Выборка);
			СтрокаНабора.Событие = СобытиеИзмененияДокумента;
		КонецЦикла;
		НаборЗаписей.Записать(Ложь);
		
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡Los cambios en el registro ""el Ajuste de los avisos"" no son formados! Por la causa: ';ru='Изменения в регистре ""Настройки уведомлений"" НЕ сформированы! По причине: ';en='Changes in the ""Notification Settings"" register are NOT generated! Due to: '")+ОписаниеОшибки);
	КонецПопытки;
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
		
КонецПроцедуры

// 2.0.19.1
Процедура ПроставитьФлагиКонечныеЭлементыВДереве() Экспорт
	
	ОшибкаТранзакции = Ложь;
	НачатьТранзакцию();
	Попытка

		Выборка = Справочники.торо_СтруктурыОР.Выбрать();
		Пока Выборка.Следующий() Цикл 
			Если Выборка.СтроитсяАвтоматически И ЗначениеЗаполнено(Выборка.ТипРеквизитаОР) Тогда
				Иерархический = Метаданные.Справочники[Выборка.ТипРеквизитаОР].Иерархический;
				Если НЕ Иерархический Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			ИерархияОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ИерархияОбъект.КонечныеЭлементыВДереве = Истина;
			ИерархияОбъект.Записать();
		КонецЦикла;
	
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡La guía ""la Estructura de la jerarquía de los objetos de la reparación"" no es renovada! Por la causa: ';ru='Справочник ""Структуры иерархии объектов ремонта"" НЕ обновлен! По причине: ';en='Directory ""Structures of the hierarchy of repair objects"" is NOT updated! Because of: '")+ОписаниеОшибки);
	КонецПопытки;
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
		
КонецПроцедуры

// 2.0.20.1
Процедура ПроставитьФлагНапоминатьЗафиксироватьПростой() Экспорт
	
	ОшибкаТранзакции = Ложь;
	НачатьТранзакцию();
	Попытка

		Константы.торо_НапоминатьЗафиксироватьПростой.Установить(Истина);
	
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡La constante ""Recordar la necesidad de fijar las horas muertas a la introducción de los documentos"" no es establecido! Por la causa: ';ru='Константа ""Напоминать о необходимости зафиксировать простой при вводе документов"" НЕ установлена! По причине: ';en='The Constant ""Remind me to fix the downtime when entering documents"" is NOT installed! Due to: '")+ОписаниеОшибки);
	КонецПопытки;
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;

КонецПроцедуры

// 2.0.21.1
Процедура УдалениеИДКорректировок_РегистрПлановыеРемонтныеРаботы() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ПлановыеРемонтныеРаботы.Регистратор КАК Регистратор,
	|	торо_ПлановыеРемонтныеРаботы.ID КАК ID,
	|	МАКСИМУМ(торо_ПлановыеРемонтныеРаботы.НомерСтроки) КАК НомерСтроки,
	|	МАКСИМУМ(торо_ПлановыеРемонтныеРаботы.Период) КАК ПериодМаксимум,
	|	МИНИМУМ(торо_ПлановыеРемонтныеРаботы.Период) КАК ПериодМинимум,
	|	КОЛИЧЕСТВО(торо_ПлановыеРемонтныеРаботы.Удалить_ID_Корректировок) КАК КоличествоКорректировок
	|ИЗ
	|	РегистрСведений.торо_ПлановыеРемонтныеРаботы КАК торо_ПлановыеРемонтныеРаботы
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_ПлановыеРемонтныеРаботы.Регистратор,
	|	торо_ПлановыеРемонтныеРаботы.ID
	|ИТОГИ
	|	МАКСИМУМ(КоличествоКорректировок)
	|ПО
	|	Регистратор";
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ДокВТранзакции = 50;
	Счетчик = 0;
	ОшибкаВТранзакции = Ложь;
	
	Попытка
		
		Пока Выборка.Следующий() Цикл
			Если НЕ ТранзакцияАктивна() Тогда
				НачатьТранзакцию();
			КонецЕсли;
			
			НужнаЗапись = Ложь;
			
			НаборЗаписей = РегистрыСведений.торо_ПлановыеРемонтныеРаботы.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
			НаборЗаписей.Прочитать();
			
			Для каждого Запись из НаборЗаписей Цикл
				Если ЗначениеЗаполнено(Запись.Удалить_ID_Корректировок) Тогда
					Запись.Удалить_ID_Корректировок = "";
					НужнаЗапись = Истина;
				КонецЕсли;
				Если ЗначениеЗаполнено(Запись.УдалитьПериодичностьДетализации) Тогда
					Запись.УдалитьПериодичностьДетализации = Неопределено;
					НужнаЗапись = Истина;
				КонецЕсли;
				Если ЗначениеЗаполнено(Запись.УдалитьПодразделение) Тогда
					Запись.Подразделение = Запись.УдалитьПодразделение;
					Запись.УдалитьПодразделение = Неопределено;
					НужнаЗапись = Истина;
				КонецЕсли;
			КонецЦикла;
			
			Если Выборка.КоличествоКорректировок > 1 Тогда
				
				СтрокиКУдалению = Новый Массив;
				
				ВыборкаИД = Выборка.Выбрать(ОбходРезультатаЗапроса.Прямой);
				Пока ВыборкаИД.Следующий() Цикл
					Если ВыборкаИД.КоличествоКорректировок > 1 Тогда
						ПроверятьПоДате =  ВыборкаИД.ПериодМаксимум <> ВыборкаИД.ПериодМинимум;
						
						Для каждого Запись из НаборЗаписей Цикл
							Если Запись.ID <> ВыборкаИД.ID Тогда
								Продолжить;	
							КонецЕсли;
							
							Если (ПроверятьПоДате И Запись.Период <> ВыборкаИД.ПериодМаксимум)
								ИЛИ (НЕ ПроверятьПоДате И Запись.НомерСтроки <> ВыборкаИД.НомерСтроки) Тогда
								СтрокиКУдалению.Добавить(Запись);
								НужнаЗапись = Истина;
							КонецЕсли;
						КонецЦикла;
						
					КонецЕсли;
				КонецЦикла;
				
				Для каждого СтрокаКУдалению из СтрокиКУдалению Цикл
					НаборЗаписей.Удалить(СтрокаКУдалению);
				КонецЦикла;
				
			КонецЕсли;
			
			Если НужнаЗапись Тогда
				НаборЗаписей.Записать(Истина);
			КонецЕсли;
			
			Счетчик = Счетчик + 1;
			Если Счетчик = ДокВТранзакции Тогда
				ЗафиксироватьТранзакцию();
				Счетчик = 0;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ТранзакцияАктивна() Тогда
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		
	Исключение
		ОшибкаВТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка,
			,,	НСтр("es='¡La renovación del registro ""los trabajos de reparación Planificados"" no es cumplida! Por la causa: ';ru='Обновление регистра ""Плановые ремонтные работы"" не выполнено! По причине: ';en='Register update ""Planned repair work"" failed! Due to: '")+ОписаниеОшибки);
	КонецПопытки;
	
	Если ТранзакцияАктивна() И ОшибкаВТранзакции Тогда
		ОтменитьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

Процедура СнятьФлагиКонечныеЭлементыВДереве() Экспорт
	
	ОшибкаТранзакции = Ложь;
	НачатьТранзакцию();
	Попытка

		Выборка = Справочники.торо_СтруктурыОР.Выбрать();
		Пока Выборка.Следующий() Цикл 
			ИерархияОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ИерархияОбъект.КонечныеЭлементыВДереве = Ложь;
			ИерархияОбъект.Записать();
		КонецЦикла;
	
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡La guía ""la Estructura de la jerarquía de los objetos de la reparación"" no es renovada! Por la causa: ';ru='Справочник ""Структуры иерархии объектов ремонта"" НЕ обновлен! По причине: ';en='Directory ""Structures of the hierarchy of repair objects"" is NOT updated! Because of: '")+ОписаниеОшибки);
	КонецПопытки;
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
		
КонецПроцедуры

Процедура СформироватьДвиженияПоРегиструПроцентыВыполненияРемонтныхРабот() Экспорт
	
	ОшибкаТранзакции = Ложь;
	НачатьТранзакцию();
	Попытка
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеЗаявки.Заявка КАК Заявка,
		|	торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеЗаявки.Регистратор КАК Ссылка,
		|	торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеЗаявки.Регистратор.Дата КАК Дата
		|ПОМЕСТИТЬ ВТ_ЗакрытияСоСметами
		|ИЗ
		|	РегистрСведений.торо_ОтмененныеЗаявки КАК торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеЗаявки
		|ГДЕ
		|	торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеЗаявки.Регистратор.Проведен = ИСТИНА
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Заявка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.Ссылка КАК Ссылка,
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.ID КАК IDОперации,
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтнаяРабота КАК Операция,
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.Родитель_ID КАК IDРодителя,
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.Количество * 100 КАК Процент,
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтыОборудования_ID КАК IDРемонта,
		|	ЗНАЧЕНИЕ(Перечисление.торо_ВидДокумента.ЗаявкаНаРемонт) КАК ВидДокумента,
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.Ссылка.Дата КАК Дата
		|ПОМЕСТИТЬ ВТ_ВсеРР
		|ИЗ
		|	Документ.торо_ЗаявкаНаРемонт.РемонтныеРаботы КАК торо_ЗаявкаНаРемонтРемонтныеРаботы
		|ГДЕ
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.Ссылка.Проведен = ИСТИНА
		|	И ТИПЗНАЧЕНИЯ(торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтнаяРабота) = ТИП(Справочник.торо_ТехнологическиеОперации)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ЗакрытияСоСметами.Ссылка,
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.ID,
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтнаяРабота,
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.Родитель_ID,
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.Количество * 100 * -1,
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтыОборудования_ID,
		|	ЗНАЧЕНИЕ(Перечисление.торо_ВидДокумента.ЗакрытиеЗаявокИРемонтов),
		|	ВТ_ЗакрытияСоСметами.Дата
		|ИЗ
		|	Документ.торо_ЗаявкаНаРемонт.РемонтныеРаботы КАК торо_ЗаявкаНаРемонтРемонтныеРаботы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗакрытияСоСметами КАК ВТ_ЗакрытияСоСметами
		|		ПО торо_ЗаявкаНаРемонтРемонтныеРаботы.Ссылка = ВТ_ЗакрытияСоСметами.Заявка
		|ГДЕ
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.Ссылка.Проведен = ИСТИНА
		|	И ТИПЗНАЧЕНИЯ(торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтнаяРабота) = ТИП(Справочник.торо_ТехнологическиеОперации)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.Ссылка,
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.ID,
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.РемонтнаяРабота,
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.Родитель_ID,
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.Количество * 100,
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.РемонтыОборудования_ID,
		|	ЗНАЧЕНИЕ(Перечисление.торо_ВидДокумента.НарядНаВыполнениеРемонтныхРабот),
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.Ссылка.Дата
		|ИЗ
		|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтныеРаботы КАК торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы
		|ГДЕ
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.Ссылка.Проведен = ИСТИНА
		|	И ТИПЗНАЧЕНИЯ(торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.РемонтнаяРабота) = ТИП(Справочник.торо_ТехнологическиеОперации)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_НарядНаРегламентноеМероприятиеРемонтныеРаботы.Ссылка,
		|	торо_НарядНаРегламентноеМероприятиеРемонтныеРаботы.ID,
		|	торо_НарядНаРегламентноеМероприятиеРемонтныеРаботы.РемонтнаяРабота,
		|	торо_НарядНаРегламентноеМероприятиеРемонтныеРаботы.Родитель_ID,
		|	торо_НарядНаРегламентноеМероприятиеРемонтныеРаботы.Количество * 100,
		|	торо_НарядНаРегламентноеМероприятиеРемонтныеРаботы.РемонтыОборудования_ID,
		|	ЗНАЧЕНИЕ(Перечисление.торо_ВидДокумента.НарядНаВыполнениеРегламентногоМероприятия),
		|	торо_НарядНаРегламентноеМероприятиеРемонтныеРаботы.Ссылка.Дата
		|ИЗ
		|	Документ.торо_НарядНаРегламентноеМероприятие.РемонтныеРаботы КАК торо_НарядНаРегламентноеМероприятиеРемонтныеРаботы
		|ГДЕ
		|	торо_НарядНаРегламентноеМероприятиеРемонтныеРаботы.Ссылка.Проведен = ИСТИНА
		|	И ТИПЗНАЧЕНИЯ(торо_НарядНаРегламентноеМероприятиеРемонтныеРаботы.РемонтнаяРабота) = ТИП(Справочник.торо_ТехнологическиеОперации)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.Ссылка,
		|	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.ID,
		|	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.РемонтнаяРабота,
		|	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.Родитель_ID,
		|	ВЫБОР
		|		КОГДА торо_ИспользоватьУсложненнуюСхемуЗакрытияНарядов.Значение = ИСТИНА
		|			ТОГДА торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.ПроцентВыполненияРабот
		|		ИНАЧЕ ВЫБОР
		|				КОГДА торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.Выполнено
		|					ТОГДА 100
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|	КОНЕЦ * -1,
		|	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.РемонтыОборудования_ID,
		|	ЗНАЧЕНИЕ(Перечисление.торо_ВидДокумента.АктОВыполненииРегламентногоМероприятия),
		|	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.Ссылка.Дата
		|ИЗ
		|	Документ.торо_АктОВыполненииРегламентногоМероприятия.РемонтныеРаботы КАК торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы,
		|	Константа.торо_ИспользоватьУсложненнуюСхемуЗакрытияНарядов КАК торо_ИспользоватьУсложненнуюСхемуЗакрытияНарядов
		|ГДЕ
		|	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.ПроцентВыполненияРабот <> 0
		|	И ТИПЗНАЧЕНИЯ(торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.РемонтнаяРабота) = ТИП(Справочник.торо_ТехнологическиеОперации)
		|	И торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.Ссылка.Проведен = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Ссылка,
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.ID,
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтнаяРабота,
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Родитель_ID,
		|	ВЫБОР
		|		КОГДА торо_ИспользоватьУсложненнуюСхемуЗакрытияНарядов.Значение = ИСТИНА
		|			ТОГДА торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.ПроцентВыполненияРабот
		|		ИНАЧЕ ВЫБОР
		|				КОГДА торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Выполнено
		|					ТОГДА 100
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|	КОНЕЦ * -1,
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтыОборудования_ID,
		|	ЗНАЧЕНИЕ(Перечисление.торо_ВидДокумента.АктОВыполненииЭтапаРабот),
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Ссылка.Дата
		|ИЗ
		|	Документ.торо_АктОВыполненииЭтапаРабот.РемонтныеРаботы КАК торо_АктОВыполненииЭтапаРаботРемонтныеРаботы,
		|	Константа.торо_ИспользоватьУсложненнуюСхемуЗакрытияНарядов КАК торо_ИспользоватьУсложненнуюСхемуЗакрытияНарядов
		|ГДЕ
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.ПроцентВыполненияРабот <> 0
		|	И ТИПЗНАЧЕНИЯ(торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтнаяРабота) = ТИП(Справочник.торо_ТехнологическиеОперации)
		|	И торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Ссылка.Проведен = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВсеРР.Ссылка КАК Ссылка,
		|	ВТ_ВсеРР.IDОперации КАК IDОперации,
		|	ВТ_ВсеРР.Операция КАК Операция,
		|	ВТ_ВсеРР.IDРодителя КАК IDРодителя,
		|	ВТ_ВсеРР.Процент КАК Процент,
		|	ВТ_ВсеРР.IDРемонта КАК IDРемонта,
		|	ВТ_ВсеРР.ВидДокумента КАК ВидДокумента,
		|	ВТ_ВсеРР.Дата КАК Период
		|ИЗ
		|	ВТ_ВсеРР КАК ВТ_ВсеРР
		|ГДЕ
		|	ВТ_ВсеРР.IDОперации <> """"
		|	И ВТ_ВсеРР.Операция <> ЗНАЧЕНИЕ(Справочник.торо_ТехнологическиеОперации.ПустаяСсылка)
		|
		|ИТОГИ ПО
		|	Ссылка";		
		
		ВыборкаДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаДокументов.Следующий() Цикл
			
			НаборЗаписей = РегистрыНакопления.торо_ПроцентВыполненныхРабот.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаДокументов.Ссылка);
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			
			ВыборкаЗаписей = ВыборкаДокументов.Выбрать();
			Пока ВыборкаЗаписей.Следующий() Цикл
				Движение = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(Движение, ВыборкаЗаписей);
			КонецЦикла;

			НаборЗаписей.Записать(Истина);
		
		КонецЦикла;
		
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡Los movimientos de los documentos por el registro del por ciento de los trabajos cumplidos no son formados! Por la causa: ';ru='Движения документов по регистру процента выполненных работ НЕ сформированы! По причине: ';en='Documents movements on the register of the percentage of completed work are NOT formed! Due to: '")+ОписаниеОшибки);
	КонецПопытки;
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьДокументыПлановыхЗатрат() Экспорт
	
	ОшибкаТранзакции = Ложь;
	НачатьТранзакцию();
	Попытка

		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ID КАК ID,
		|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта,
		|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ДатаНачала КАК Дата,
		|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ДокументИсточник КАК ДокументИсточник,
		|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_РемонтыИзАкта
		|ИЗ
		|	Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК торо_АктОВыполненииЭтапаРаботРемонтыОборудования
		|ГДЕ
		|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка.Проведен = ИСТИНА
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID,
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ID КАК ID
		|ПОМЕСТИТЬ ВТ_ППР
		|ИЗ
		|	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(
		|			,
		|			ID В
		|				(ВЫБРАТЬ
		|					ВТ_РемонтыИзАкта.ID КАК ID
		|				ИЗ
		|					ВТ_РемонтыИзАкта КАК ВТ_РемонтыИзАкта)) КАК торо_ПлановыеРемонтныеРаботыСрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_ЗаявкиПоРемонтамСрезПоследних.IDРемонта КАК IDРемонта
		|ПОМЕСТИТЬ ВТ_Заявки
		|ИЗ
		|	РегистрСведений.торо_ЗаявкиПоРемонтам.СрезПоследних(
		|			,
		|			IDРемонта В
		|				(ВЫБРАТЬ
		|					ВТ_РемонтыИзАкта.ID КАК ID
		|				ИЗ
		|					ВТ_РемонтыИзАкта КАК ВТ_РемонтыИзАкта)) КАК торо_ЗаявкиПоРемонтамСрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	IDРемонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ОтмененныеРемонтыСрезПоследних.ID КАК ID
		|ПОМЕСТИТЬ ВТ_Отмененные
		|ИЗ
		|	РегистрСведений.торо_ОтмененныеРемонты.СрезПоследних(
		|			,
		|			ID В
		|				(ВЫБРАТЬ
		|					ВТ_РемонтыИзАкта.ID КАК ID
		|				ИЗ
		|					ВТ_РемонтыИзАкта КАК ВТ_РемонтыИзАкта)) КАК торо_ОтмененныеРемонтыСрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Заявки.IDРемонта КАК IDРемонта
		|ПОМЕСТИТЬ ВТ_НеОтмененныеЗаявки
		|ИЗ
		|	ВТ_Заявки КАК ВТ_Заявки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Отмененные КАК ВТ_Отмененные
		|		ПО ВТ_Заявки.IDРемонта = ВТ_Отмененные.ID
		|ГДЕ
		|	ВТ_Отмененные.ID ЕСТЬ NULL
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	IDРемонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ППР.ID КАК ID
		|ПОМЕСТИТЬ ВТ_АктыИзППРБезСмет
		|ИЗ
		|	ВТ_ППР КАК ВТ_ППР
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НеОтмененныеЗаявки КАК ВТ_НеОтмененныеЗаявки
		|		ПО (ВТ_НеОтмененныеЗаявки.IDРемонта = ВТ_ППР.ID)
		|ГДЕ
		|	ВТ_НеОтмененныеЗаявки.IDРемонта ЕСТЬ NULL
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_АктОВыполненииРегламентногоМероприятияМероприятия.ID КАК ID,
		|	торо_АктОВыполненииРегламентногоМероприятияМероприятия.ОбъектРемонта КАК ОбъектРемонта,
		|	торо_АктОВыполненииРегламентногоМероприятияМероприятия.ДатаНачала КАК Дата,
		|	торо_АктОВыполненииРегламентногоМероприятияМероприятия.ДокументИсточник КАК ДокументИсточник,
		|	торо_АктОВыполненииРегламентногоМероприятияМероприятия.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_РемонтыИзАктаРМ
		|ИЗ
		|	Документ.торо_АктОВыполненииРегламентногоМероприятия.Мероприятия КАК торо_АктОВыполненииРегламентногоМероприятияМероприятия
		|ГДЕ
		|	торо_АктОВыполненииРегламентногоМероприятияМероприятия.Ссылка.Проведен = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_РемонтыИзАкта.ID КАК ID,
		|	ВТ_РемонтыИзАкта.ОбъектРемонта КАК ОбъектРемонта,
		|	ВТ_РемонтыИзАкта.Дата КАК Дата,
		|	ВТ_РемонтыИзАкта.ДокументИсточник КАК ДокументИсточник,
		|	ВТ_РемонтыИзАкта.Ссылка КАК Ссылка,
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.ID КАК ID_РР,
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтнаяРабота КАК РемонтнаяРабота
		|ИЗ
		|	ВТ_РемонтыИзАкта КАК ВТ_РемонтыИзАкта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтныеРаботы КАК торо_АктОВыполненииЭтапаРаботРемонтныеРаботы
		|		ПО ВТ_РемонтыИзАкта.ID = торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтыОборудования_ID
		|			И ВТ_РемонтыИзАкта.Ссылка = торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_АктыИзППРБезСмет КАК ВТ_АктыИзППРБезСмет
		|		ПО ВТ_РемонтыИзАкта.ID = ВТ_АктыИзППРБезСмет.ID
		|			И (ТИПЗНАЧЕНИЯ(торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтнаяРабота) = ТИП(Справочник.торо_ИдентификаторыТехКарт))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_РемонтыИзАктаРМ.ID,
		|	ВТ_РемонтыИзАктаРМ.ОбъектРемонта,
		|	ВТ_РемонтыИзАктаРМ.Дата,
		|	ВТ_РемонтыИзАктаРМ.ДокументИсточник,
		|	ВТ_РемонтыИзАктаРМ.Ссылка,
		|	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.ID,
		|	торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.РемонтнаяРабота
		|ИЗ
		|	ВТ_РемонтыИзАктаРМ КАК ВТ_РемонтыИзАктаРМ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииРегламентногоМероприятия.РемонтныеРаботы КАК торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы
		|		ПО ВТ_РемонтыИзАктаРМ.Ссылка = торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.Ссылка
		|			И ВТ_РемонтыИзАктаРМ.ID = торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.РемонтыОборудования_ID
		|			И (ТИПЗНАЧЕНИЯ(торо_АктОВыполненииРегламентногоМероприятияРемонтныеРаботы.РемонтнаяРабота) = ТИП(Справочник.торо_ИдентификаторыТехКарт))
		|ИТОГИ ПО
		|	ДокументИсточник,
		|	ID,
		|	ОбъектРемонта,
		|	Дата";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДокумент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаДокумент.Следующий() Цикл
			ВыборкаИД = ВыборкаДокумент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
			Пока ВыборкаИД.Следующий() Цикл
				ВыборкаОбъект = ВыборкаИД.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаОбъект.Следующий() Цикл
					ВыборкаДата = ВыборкаОбъект.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаДата.Следующий() Цикл
						Если ЗначениеЗаполнено(ВыборкаДата.ДокументИсточник) //И 
							//НЕ ТипЗнч(ВыборкаДата.ДокументИсточник) = Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот") И
							//НЕ ТипЗнч(ВыборкаДата.ДокументИсточник) = Тип("ДокументСсылка.торо_НарядНаРегламентноеМероприятие") 
							Тогда
							
							НовыйДокумент = Документы.торо_ПлановыеЗатраты.СоздатьДокумент();
							НовыйДокумент.Дата = ВыборкаДата.Дата;
							НовыйДокумент.ДокументПлана = ВыборкаДата.ДокументИсточник;
							НовыйДокумент.ОбъектРемонта = ВыборкаДата.ОбъектРемонта;
							НовыйДокумент.РемонтыОборудования_ID = ВыборкаДата.ID;
							
							Выборка = ВыборкаДата.Выбрать();
							Пока Выборка.Следующий() Цикл
								НоваяСтрока = НовыйДокумент.ТехКарты.Добавить();
								НоваяСтрока.ТехКарта = Выборка.РемонтнаяРабота;
								НоваяСтрока.ТехКарта_ID = Выборка.ID_РР;
							КонецЦикла;
							НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла; 
		КонецЦикла; 	
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡Los documentos ""los gastos Planificados"" no son formados! Por la causa: ';ru='Документы ""Плановые затраты"" НЕ сформированы! По причине: ';en='Documents ""Planned costs"" are NOT generated! Due to: '")+ОписаниеОшибки);
	КонецПопытки;
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
		
КонецПроцедуры

// Процедура выполняет заполнение реквизита ТипКонтактнойИнформации
// для предопределенных элементов справочника ВидыКонтакнойИнформации
// вызывается при первом запуске конфигурации.
Процедура ЗаполнитьПредопределенныеВидыКонтактнойИнформацииОР() Экспорт
	
	Попытка
		// Справочник "торо_ОбъектыРемонта"
		ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.АдресОР,
		Перечисления.ТипыКонтактнойИнформации.Адрес, Истина, Ложь, Ложь);
		
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡El relleno de los tipos de la información de contacto para los objetos de la reparación no es cumplido! Por la causa: ';ru='Заполнение видов контактной информации для объектов ремонта не выполнено! По причине: ';en='Filling in the types of contact information for the repair objects is not completed! Due to: '")+ОписаниеОшибки);
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьПорядокПредопределенныхКритичностейДефектов() Экспорт
	
	Попытка

		СпрОбъект = Справочники.торо_КритичностьДефекта.Высокая.ПолучитьОбъект();
		СпрОбъект.Порядок = 30;
		СпрОбъект.Записать();
		
		СпрОбъект = Справочники.торо_КритичностьДефекта.Средняя.ПолучитьОбъект();
		СпрОбъект.Порядок = 20;
		СпрОбъект.Записать();
		
		СпрОбъект = Справочники.торо_КритичностьДефекта.Низкая.ПолучитьОбъект();
		СпрОбъект.Порядок = 10;
		СпрОбъект.Записать();
		
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡El relleno del orden критичностей de los defectos no es cumplido! Por la causa: ';ru='Заполнение порядка критичностей дефектов не выполнено! По причине: ';en='Filling the criticality order of defects failed! Due to: '")+ОписаниеОшибки);
	КонецПопытки;
	
КонецПроцедуры

// 2.0.22.1

Процедура УдалениеИДКорректировок_РегистрПлановыеМероприятия() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ПлановыеМероприятия.Регистратор КАК Регистратор,
	|	торо_ПлановыеМероприятия.ID КАК ID,
	|	МАКСИМУМ(торо_ПлановыеМероприятия.НомерСтроки) КАК НомерСтроки,
	|	МАКСИМУМ(торо_ПлановыеМероприятия.Период) КАК ПериодМаксимум,
	|	МИНИМУМ(торо_ПлановыеМероприятия.Период) КАК ПериодМинимум,
	|	КОЛИЧЕСТВО(торо_ПлановыеМероприятия.Удалить_ID_Корректировок) КАК КоличествоКорректировок
	|ИЗ
	|	РегистрСведений.торо_ПлановыеМероприятия КАК торо_ПлановыеМероприятия
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_ПлановыеМероприятия.Регистратор,
	|	торо_ПлановыеМероприятия.ID
	|ИТОГИ
	|	МАКСИМУМ(КоличествоКорректировок)
	|ПО
	|	Регистратор";
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ДокВТранзакции = 50;
	Счетчик = 0;
	ОшибкаВТранзакции = Ложь;
	
	Попытка
		
		Пока Выборка.Следующий() Цикл
			Если НЕ ТранзакцияАктивна() Тогда
				НачатьТранзакцию();
			КонецЕсли;
			
			НужнаЗапись = Ложь;
			
			НаборЗаписей = РегистрыСведений.торо_ПлановыеМероприятия.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
			НаборЗаписей.Прочитать();
			
			Для каждого Запись из НаборЗаписей Цикл
				Если ЗначениеЗаполнено(Запись.Удалить_ID_Корректировок) Тогда
					Запись.Удалить_ID_Корректировок = "";
					НужнаЗапись = Истина;
				КонецЕсли;
				Если ЗначениеЗаполнено(Запись.УдалитьПодразделение) Тогда
					Запись.Подразделение = Запись.УдалитьПодразделение;
					Запись.УдалитьПодразделение = Неопределено;
					НужнаЗапись = Истина;
				КонецЕсли;
			КонецЦикла;
			
			Если Выборка.КоличествоКорректировок > 1 Тогда
				
				СтрокиКУдалению = Новый Массив;
				
				ВыборкаИД = Выборка.Выбрать(ОбходРезультатаЗапроса.Прямой);
				Пока ВыборкаИД.Следующий() Цикл
					Если ВыборкаИД.КоличествоКорректировок > 1 Тогда
						ПроверятьПоДате =  ВыборкаИД.ПериодМаксимум <> ВыборкаИД.ПериодМинимум;
						
						Для каждого Запись из НаборЗаписей Цикл
							Если Запись.ID <> ВыборкаИД.ID Тогда
								Продолжить;	
							КонецЕсли;
							
							Если (ПроверятьПоДате И Запись.Период <> ВыборкаИД.ПериодМаксимум)
								ИЛИ (НЕ ПроверятьПоДате И Запись.НомерСтроки <> ВыборкаИД.НомерСтроки) Тогда
								СтрокиКУдалению.Добавить(Запись);
								НужнаЗапись = Истина;
							КонецЕсли;
						КонецЦикла;
						
					КонецЕсли;
				КонецЦикла;
				
				Для каждого СтрокаКУдалению из СтрокиКУдалению Цикл
					НаборЗаписей.Удалить(СтрокаКУдалению);
				КонецЦикла;
				
			КонецЕсли;
			
			Если НужнаЗапись Тогда
				НаборЗаписей.Записать(Истина);
			КонецЕсли;
			
			Счетчик = Счетчик + 1;
			Если Счетчик = ДокВТранзакции Тогда
				ЗафиксироватьТранзакцию();
				Счетчик = 0;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ТранзакцияАктивна() Тогда
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		
	Исключение
		ОшибкаВТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка,
			,,	НСтр("es='¡La renovación del registro ""las medidas Planificadas"" no es cumplida! Por la causa: ';ru='Обновление регистра ""Плановые мероприятия"" не выполнено! По причине: ';en='Register update for ""Planned events"" failed! Due to: '")+ОписаниеОшибки);
	КонецПопытки;
	
	Если ТранзакцияАктивна() И ОшибкаВТранзакции Тогда
		ОтменитьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПерезаполнитьРегистрПлановыхРемонтовОстановочными() Экспорт
	
НачатьТранзакцию();
	ОшибкаТранзакции = Ложь;
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	торо_ОстановочныеРемонтыСвязанныеРемонты.Ссылка КАК Ссылка,
		               |	торо_ОстановочныеРемонтыСвязанныеРемонты.ID КАК ID,
		               |	торо_ОстановочныеРемонтыСвязанныеРемонты.ОбъектРемонта КАК ОбъектРемонта,
		               |	торо_ОстановочныеРемонтыСвязанныеРемонты.ВидРемонта КАК ВидРемонта,
		               |	торо_ОстановочныеРемонтыСвязанныеРемонты.ДатаНачалаРемонта КАК ДатаНачалаРемонта,
		               |	торо_ОстановочныеРемонтыСвязанныеРемонты.ДатаОкончанияРемонта КАК ДатаОкончанияРемонта,
		               |	торо_ОстановочныеРемонтыСвязанныеРемонты.ДатаНачалаРемонтаСтарая КАК ДатаНачалаРемонтаСтарая,
		               |	торо_ОстановочныеРемонтыСвязанныеРемонты.ДатаОкончанияРемонтаСтарая КАК ДатаОкончанияРемонтаСтарая,
		               |	торо_ОстановочныеРемонтыСвязанныеРемонты.Отвязать КАК Отвязать,
		               |	торо_ОстановочныеРемонтыСвязанныеРемонты.ДокументИсточник КАК ДокументИсточник
		               |ПОМЕСТИТЬ СвязанныеРемонты
		               |ИЗ
		               |	Документ.торо_ОстановочныеРемонты.СвязанныеРемонты КАК торо_ОстановочныеРемонтыСвязанныеРемонты
		               |ГДЕ
		               |	торо_ОстановочныеРемонтыСвязанныеРемонты.Ссылка.Проведен = ИСТИНА
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	торо_ОстановочныеРемонты.Ссылка,
		               |	торо_ОстановочныеРемонты.IDОсновногоРемонта,
		               |	торо_ОстановочныеРемонты.ОбъектРемонта,
		               |	торо_ОстановочныеРемонты.ВидРемонта,
		               |	торо_ОстановочныеРемонты.ДатаНачалаРемонта,
		               |	торо_ОстановочныеРемонты.ДатаОкончанияРемонта,
		               |	торо_ОстановочныеРемонты.ДатаНачалаРемонтаСт,
		               |	торо_ОстановочныеРемонты.ДатаОкончанияРемонтаСт,
		               |	ЛОЖЬ,
		               |	торо_ОстановочныеРемонты.ДокументОснование
		               |ИЗ
		               |	Документ.торо_ОстановочныеРемонты КАК торо_ОстановочныеРемонты
		               |ГДЕ
		               |	торо_ОстановочныеРемонты.Проведен = ИСТИНА
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ID
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаID.ID КАК ID
		               |ПОМЕСТИТЬ ТаблицаID
		               |ИЗ
		               |	СвязанныеРемонты КАК ТаблицаID
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ID
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	торо_СоответствиеКорректировокДокументамППР.Корректировка КАК Корректировка
		               |ПОМЕСТИТЬ торо_СоответствиеКорректировокДокументамППР
		               |ИЗ
		               |	РегистрСведений.торо_СоответствиеКорректировокДокументамППР КАК торо_СоответствиеКорректировокДокументамППР
		               |ГДЕ
		               |	торо_СоответствиеКорректировокДокументамППР.Корректируемый В
		               |			(ВЫБРАТЬ
		               |				СвязанныеРемонты.Ссылка
		               |			ИЗ
		               |				СвязанныеРемонты КАК СвязанныеРемонты)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	торо_ПланГрафикРемонтаПланРемонтов.ID КАК ID
		               |ПОМЕСТИТЬ РемонтыКорректировок
		               |ИЗ
		               |	Документ.торо_ОстановочныеРемонты.СвязанныеРемонты КАК торо_ПланГрафикРемонтаПланРемонтов
		               |ГДЕ
		               |	торо_ПланГрафикРемонтаПланРемонтов.Ссылка В
		               |			(ВЫБРАТЬ
		               |				торо_СоответствиеКорректировокДокументамППР.Корректировка
		               |			ИЗ
		               |				торо_СоответствиеКорректировокДокументамППР КАК торо_СоответствиеКорректировокДокументамППР)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаID.ID КАК ID
		               |ПОМЕСТИТЬ РемонтыСКорректировкой
		               |ИЗ
		               |	ТаблицаID КАК ТаблицаID
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РемонтыКорректировок КАК РемонтыКорректировок
		               |		ПО ТаблицаID.ID = РемонтыКорректировок.ID
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ID
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	торо_ЗавершенныеРемонтныеРаботыСрезПоследних.ID КАК ID
		               |ПОМЕСТИТЬ ЗавершенныеРемонты
		               |ИЗ
		               |	РегистрСведений.торо_ЗавершенныеРемонтныеРаботы.СрезПоследних(
		               |			,
		               |			ID В
		               |				(ВЫБРАТЬ
		               |					ТаблицаID.ID КАК ID
		               |				ИЗ
		               |					ТаблицаID КАК ТаблицаID)) КАК торо_ЗавершенныеРемонтныеРаботыСрезПоследних
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ID
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаID.ID КАК ID,
		               |	МИНИМУМ(ВЫБОР
		               |			КОГДА РемонтыСКорректировкой.ID ЕСТЬ NULL
		               |					И ЗавершенныеРемонты.ID ЕСТЬ NULL
		               |				ТОГДА ИСТИНА
		               |			ИНАЧЕ ЛОЖЬ
		               |		КОНЕЦ) КАК ДоступенДляРедактирования
		               |ПОМЕСТИТЬ ТабДоступность
		               |ИЗ
		               |	ТаблицаID КАК ТаблицаID
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РемонтыСКорректировкой КАК РемонтыСКорректировкой
		               |		ПО (РемонтыСКорректировкой.ID = ТаблицаID.ID)
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ЗавершенныеРемонты КАК ЗавершенныеРемонты
		               |		ПО (ЗавершенныеРемонты.ID = ТаблицаID.ID)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТаблицаID.ID
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	торо_ПланГрафикРемонтаПланРемонтов.ID КАК ID,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
		               |	торо_ПланГрафикРемонтаПланРемонтов.Исполнитель КАК Исполнитель,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
		               |	торо_ПланГрафикРемонтаПланРемонтов.СпособВыполнения КАК СпособВыполнения,
		               |	торо_ПланГрафикРемонтаПланРемонтов.Замещен КАК Замещен,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ID_базы_расчета КАК ID_базы_расчета,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ID_замещающего КАК ID_замещающего,
		               |	торо_ПланГрафикРемонтаПланРемонтов.СтоимостьРемонта КАК СтоимостьРемонта,
		               |	торо_ПланГрафикРемонтаПланРемонтов.Организация КАК Организация,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ДатаНачалаРасчетная КАК ДатаНачалаРасчетная,
		               |	торо_ПланГрафикРемонтаПланРемонтов.Подразделение КАК Подразделение,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ДатаНачалаРемонтныхРабот КАК ДатаНачалаРемонтныхРабот,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ДатаОкончанияРемонтныхРабот КАК ДатаОкончанияРемонтныхРабот,
		               |	торо_ПланГрафикРемонтаПланРемонтов.Отменен КАК Отменен,
		               |	СвязанныеРемонты.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ ПланРемонтовОтвязанные
		               |ИЗ
		               |	СвязанныеРемонты КАК СвязанныеРемонты
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(
		               |				,
		               |				ID В
		               |						(ВЫБРАТЬ
		               |							СвязанныеРемонты.ID КАК ID
		               |						ИЗ
		               |							СвязанныеРемонты КАК СвязанныеРемонты
		               |						ГДЕ
		               |							СвязанныеРемонты.Отвязать = ИСТИНА)
		               |					И ТИПЗНАЧЕНИЯ(Регистратор) <> ТИП(Документ.торо_ОстановочныеРемонты)) КАК торо_ПланГрафикРемонтаПланРемонтов
		               |		ПО СвязанныеРемонты.ID = торо_ПланГрафикРемонтаПланРемонтов.ID
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ID
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	торо_ПланГрафикРемонтаПланРемонтов.ID КАК ID,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
		               |	торо_ПланГрафикРемонтаПланРемонтов.Исполнитель КАК Исполнитель,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
		               |	торо_ПланГрафикРемонтаПланРемонтов.СпособВыполнения КАК СпособВыполнения,
		               |	торо_ПланГрафикРемонтаПланРемонтов.Замещен КАК Замещен,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ID_базы_расчета КАК ID_базы_расчета,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ID_замещающего КАК ID_замещающего,
		               |	торо_ПланГрафикРемонтаПланРемонтов.СтоимостьРемонта КАК СтоимостьРемонта,
		               |	торо_ПланГрафикРемонтаПланРемонтов.Организация КАК Организация,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ДатаНачалаРасчетная КАК ДатаНачалаРасчетная,
		               |	торо_ПланГрафикРемонтаПланРемонтов.Подразделение КАК Подразделение,
		               |	торо_ПланГрафикРемонтаПланРемонтов.Отменен КАК Отменен,
		               |	СвязанныеРемонты.ДатаНачалаРемонта КАК ДатаНачалаРемонтныхРабот,
		               |	СвязанныеРемонты.ДатаОкончанияРемонта КАК ДатаОкончанияРемонтныхРабот,
		               |	СвязанныеРемонты.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ ПланРемонтовНеОтвязанные
		               |ИЗ
		               |	СвязанныеРемонты КАК СвязанныеРемонты
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(
		               |				,
		               |				ID В
		               |					(ВЫБРАТЬ
		               |						СвязанныеРемонты.ID КАК ID
		               |					ИЗ
		               |						СвязанныеРемонты КАК СвязанныеРемонты
		               |					ГДЕ
		               |						СвязанныеРемонты.Отвязать = ЛОЖЬ)) КАК торо_ПланГрафикРемонтаПланРемонтов
		               |		ПО СвязанныеРемонты.ID = торо_ПланГрафикРемонтаПланРемонтов.ID
		               |			И СвязанныеРемонты.ОбъектРемонта = торо_ПланГрафикРемонтаПланРемонтов.ОбъектРемонтныхРабот
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ID
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ПланРемонтовОтвязанные.ID КАК ID,
		               |	ПланРемонтовОтвязанные.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
		               |	ПланРемонтовОтвязанные.Исполнитель КАК Исполнитель,
		               |	ПланРемонтовОтвязанные.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
		               |	ПланРемонтовОтвязанные.СпособВыполнения КАК СпособВыполнения,
		               |	ПланРемонтовОтвязанные.Замещен КАК Замещен,
		               |	ПланРемонтовОтвязанные.ID_базы_расчета КАК ID_базы_расчета,
		               |	ПланРемонтовОтвязанные.ID_замещающего КАК ID_замещающего,
		               |	ПланРемонтовОтвязанные.СтоимостьРемонта КАК СтоимостьРемонта,
		               |	ПланРемонтовОтвязанные.Организация КАК Организация,
		               |	ПланРемонтовОтвязанные.ДатаНачалаРасчетная КАК ДатаНачалаРасчетная,
		               |	ПланРемонтовОтвязанные.Подразделение КАК Подразделение,
		               |	ПланРемонтовОтвязанные.ДатаНачалаРемонтныхРабот КАК ДатаНачалаРемонтныхРабот,
		               |	ПланРемонтовОтвязанные.ДатаОкончанияРемонтныхРабот КАК ДатаОкончанияРемонтныхРабот,
		               |	ПланРемонтовОтвязанные.Отменен КАК Отменен,
		               |	ПланРемонтовОтвязанные.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ ПланРемонтов
		               |ИЗ
		               |	ПланРемонтовОтвязанные КАК ПланРемонтовОтвязанные
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ПланРемонтовНеОтвязанные.ID,
		               |	ПланРемонтовНеОтвязанные.ВидРемонтныхРабот,
		               |	ПланРемонтовНеОтвязанные.Исполнитель,
		               |	ПланРемонтовНеОтвязанные.ОбъектРемонтныхРабот,
		               |	ПланРемонтовНеОтвязанные.СпособВыполнения,
		               |	ПланРемонтовНеОтвязанные.Замещен,
		               |	ПланРемонтовНеОтвязанные.ID_базы_расчета,
		               |	ПланРемонтовНеОтвязанные.ID_замещающего,
		               |	ПланРемонтовНеОтвязанные.СтоимостьРемонта,
		               |	ПланРемонтовНеОтвязанные.Организация,
		               |	ПланРемонтовНеОтвязанные.ДатаНачалаРасчетная,
		               |	ПланРемонтовНеОтвязанные.Подразделение,
		               |	ПланРемонтовНеОтвязанные.ДатаНачалаРемонтныхРабот,
		               |	ПланРемонтовНеОтвязанные.ДатаОкончанияРемонтныхРабот,
		               |	ПланРемонтовНеОтвязанные.Отменен,
		               |	ПланРемонтовНеОтвязанные.Ссылка
		               |ИЗ
		               |	ПланРемонтовНеОтвязанные КАК ПланРемонтовНеОтвязанные
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ID
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		               |	торо_ПланГрафикРемонтаПланРемонтов.ID КАК ID,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ДатаНачалаРемонтныхРабот КАК ДатаНачалаРемонтныхРабот,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ДатаОкончанияРемонтныхРабот КАК ДатаОкончанияРемонтныхРабот,
		               |	торо_ПланГрафикРемонтаПланРемонтов.Исполнитель КАК Исполнитель,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
		               |	торо_ПланГрафикРемонтаПланРемонтов.СпособВыполнения КАК СпособВыполнения,
		               |	торо_ПланГрафикРемонтаПланРемонтов.Отменен КАК Отменен,
		               |	торо_ПланГрафикРемонтаПланРемонтов.Замещен КАК Замещен,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ID_базы_расчета КАК ID_базы_расчета,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ID_замещающего КАК ID_замещающего,
		               |	торо_ПланГрафикРемонтаПланРемонтов.СтоимостьРемонта КАК СтоимостьРемонта,
		               |	торо_ПланГрафикРемонтаПланРемонтов.Организация КАК Организация,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ДатаНачалаРасчетная КАК ДатаНачалаРасчетная,
		               |	торо_ПланГрафикРемонтаПланРемонтов.Подразделение КАК Подразделение,
		               |	торо_ПланГрафикРемонтаПланРемонтов.Ссылка КАК Регистратор
		               |ИЗ
		               |	ПланРемонтов КАК торо_ПланГрафикРемонтаПланРемонтов
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабДоступность КАК ТабДоступность
		               |		ПО торо_ПланГрафикРемонтаПланРемонтов.ID = ТабДоступность.ID
		               |ГДЕ
		               |	ТабДоступность.ДоступенДляРедактирования
		               |ИТОГИ ПО
		               |	Ссылка";
		
		Результат = Запрос.Выполнить();
		Если не Результат.Пустой() Тогда
			ВыборкаПоРег = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаПоРег.Следующий() Цикл		
				Выборка = ВыборкаПоРег.Выбрать(); 		
				НаборЗаписей = РегистрыСведений.торо_ПлановыеРемонтныеРаботы.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаПоРег.Регистратор);
				НаборЗаписей.Прочитать();
				ТабЗначений = НаборЗаписей.Выгрузить(); 	
				Пока Выборка.Следующий() Цикл 				
					Строка = ТабЗначений.Найти(Выборка.ID, "ID");
					Строка.ДатаНачалаРемонтныхРабот = Выборка.ДатаНачалаРемонтныхРабот;
					Строка.ДатаОкончанияРемонтныхРабот = Выборка.ДатаОкончанияРемонтныхРабот;
					Строка.Отменен = ЛОЖЬ;
				КонецЦикла;	
				НаборЗаписей.Загрузить(ТабЗначений);
				НаборЗаписей.Записать();
			КонецЦикла;
		КонецЕсли;
				
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡La renovación del registro de las noticias ""Planificado ремонтые los trabajos"" por las reparaciones de parada no es cumplida! Por la causa: ';ru='Обновление регистра сведений ""Плановые ремонтые работы"" остановочными ремонтами НЕ выполнено! По причине: ';en='Updating the register of information ""Scheduled repairs"" stopping repairs NOT completed! Due to: '")+ОписаниеОшибки);
	КонецПопытки;   
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли; 	

	
КонецПроцедуры

Процедура УдалениеИДКорректировок_РегистрОстановочныеРемонты() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	торо_ОстановочныеРемонты.Ссылка КАК Регистратор,
	|	торо_ОстановочныеРемонты.Дата КАК Период,
	|	торо_ОстановочныеРемонты.IDОсновногоРемонта КАК IDОсновного,
	|	торо_ОстановочныеРемонты.IDОсновногоРемонта КАК IDЗависимого,
	|	торо_ОстановочныеРемонты.ДатаНачалаРемонта КАК ДатаНачалаРемонта,
	|	торо_ОстановочныеРемонты.ДатаОкончанияРемонта КАК ДатаОкончанияРемонта,
	|	ЛОЖЬ КАК Отвязан
	|ПОМЕСТИТЬ ВТ_Остановочные
	|ИЗ
	|	Документ.торо_ОстановочныеРемонты КАК торо_ОстановочныеРемонты
	|ГДЕ
	|	торо_ОстановочныеРемонты.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ОстановочныеРемонтыСвязанныеРемонты.Ссылка,
	|	торо_ОстановочныеРемонтыСвязанныеРемонты.Ссылка.Дата,
	|	торо_ОстановочныеРемонтыСвязанныеРемонты.Ссылка.IDОсновногоРемонта,
	|	торо_ОстановочныеРемонтыСвязанныеРемонты.ID,
	|	торо_ОстановочныеРемонтыСвязанныеРемонты.ДатаНачалаРемонта,
	|	торо_ОстановочныеРемонтыСвязанныеРемонты.ДатаОкончанияРемонта,
	|	торо_ОстановочныеРемонтыСвязанныеРемонты.Отвязать
	|ИЗ
	|	Документ.торо_ОстановочныеРемонты.СвязанныеРемонты КАК торо_ОстановочныеРемонтыСвязанныеРемонты
	|ГДЕ
	|	торо_ОстановочныеРемонтыСвязанныеРемонты.Ссылка.Проведен
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	IDОсновного,
	|	IDЗависимого
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Остановочные.Регистратор КАК Регистратор,
	|	ВТ_Остановочные.Период КАК Период,
	|	ВТ_Остановочные.IDОсновного КАК IDОсновного,
	|	ВТ_Остановочные.IDЗависимого КАК IDЗависимого,
	|	ВТ_Остановочные.ДатаНачалаРемонта КАК ДатаНачалаРемонта,
	|	ВТ_Остановочные.ДатаОкончанияРемонта КАК ДатаОкончанияРемонта,
	|	ВТ_Остановочные.Отвязан КАК Отвязан
	|ИЗ
	|	ВТ_Остановочные КАК ВТ_Остановочные
	|ГДЕ
	|	(ВТ_Остановочные.Регистратор, ВТ_Остановочные.IDОсновного, ВТ_Остановочные.IDЗависимого) В
	|			(ВЫБРАТЬ
	|				торо_ОстановочныеРемонты.Регистратор КАК Регистратор,
	|				торо_ОстановочныеРемонты.IDОсновного КАК IDОсновного,
	|				торо_ОстановочныеРемонты.IDЗависимого КАК IDЗависимого
	|			ИЗ
	|				РегистрСведений.торо_ОстановочныеРемонты КАК торо_ОстановочныеРемонты)
	|ИТОГИ ПО
	|	Регистратор";
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ДокВТранзакции = 50;
	Счетчик = 0;
	ОшибкаВТранзакции = Ложь;
	
	Попытка
		
		Пока Выборка.Следующий() Цикл
			Если НЕ ТранзакцияАктивна() Тогда
				НачатьТранзакцию();
			КонецЕсли;
			
			НаборЗаписей = РегистрыСведений.торо_ОстановочныеРемонты.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
			НаборЗаписей.Прочитать();
			
			НаборЗаписей.Очистить();
			
			ВыборкаИД = Выборка.Выбрать(ОбходРезультатаЗапроса.Прямой);
			Пока ВыборкаИД.Следующий() Цикл
				Запись = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(Запись, ВыборкаИД);
			КонецЦикла;
				
			НаборЗаписей.Записать(Истина);
			
			Счетчик = Счетчик + 1;
			Если Счетчик = ДокВТранзакции Тогда
				ЗафиксироватьТранзакцию();
				Счетчик = 0;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ТранзакцияАктивна() Тогда
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		
	Исключение
		ОшибкаВТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка,
			,,	НСтр("es='¡La renovación del registro ""las reparaciones De parada"" no es cumplida! Por la causa: ';ru='Обновление регистра ""Остановочные ремонты"" не выполнено! По причине: ';en='Updating the Stop Repair register failed! Due to: '")+ОписаниеОшибки);
	КонецПопытки;
	
	Если ТранзакцияАктивна() И ОшибкаВТранзакции Тогда
		ОтменитьТранзакцию();
	КонецЕсли;
	
КонецПРоцедуры

Процедура УдалениеЛишнихДокументовПлановыхЗатрат() Экспорт
	
	ОшибкаТранзакции = Ложь;
	НачатьТранзакцию();
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ПлановыеЗатраты.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ торо_ПлановыеЗатраты.Ссылка) КАК КоличествоСсылок
		|ПОМЕСТИТЬ ВТ_Все
		|ИЗ
		|	Документ.торо_ПлановыеЗатраты КАК торо_ПлановыеЗатраты
		|
		|СГРУППИРОВАТЬ ПО
		|	торо_ПлановыеЗатраты.РемонтыОборудования_ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Все.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		|	ВТ_Все.КоличествоСсылок КАК КоличествоСсылок
		|ПОМЕСТИТЬ ВТ_СДУблями
		|ИЗ
		|	ВТ_Все КАК ВТ_Все
		|ГДЕ
		|	ВТ_Все.КоличествоСсылок > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ПлановыеЗатраты.Ссылка КАК Ссылка,
		|	торо_ПлановыеЗатраты.РемонтыОборудования_ID КАК РемонтыОборудования_ID
		|ИЗ
		|	ВТ_СДУблями КАК ВТ_СДУблями
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ПлановыеЗатраты КАК торо_ПлановыеЗатраты
		|		ПО (торо_ПлановыеЗатраты.РемонтыОборудования_ID = ВТ_СДУблями.РемонтыОборудования_ID)
		|ИТОГИ ПО
		|	РемонтыОборудования_ID";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаРемонтыОборудования_ID = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаРемонтыОборудования_ID.Следующий() Цикл
			
			ВыборкаДетальныеЗаписи = ВыборкаРемонтыОборудования_ID.Выбрать();
			
			Первый = Истина;
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Если НЕ Первый Тогда
					ОбъектДок = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();	
					ОбъектДок.Удалить();
				КонецЕсли; 
				Первый = Ложь;
			КонецЦикла;
		КонецЦикла;
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡Los documentos ""los gastos Planificados"" no son quitados! Por la causa: ';ru='Документы ""Плановые затраты"" НЕ удалены! По причине: ';en='Documents ""Planned Costs"" are NOT deleted! Due to: '")+ОписаниеОшибки);
	КонецПопытки;
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;

КонецПроцедуры

Процедура ПерепровестиДокументыПлановыхЗатратДляРегламентныхМероприятий() Экспорт
	
	ОшибкаТранзакции = Ложь;
	НачатьТранзакцию();
	Попытка

		Запрос = Новый Запрос;
		Запрос.Текст =  "ВЫБРАТЬ
		                |	торо_ПлановыеЗатраты.Ссылка КАК Ссылка
		                |ИЗ
		                |	Документ.торо_ПлановыеЗатраты КАК торо_ПлановыеЗатраты
		                |ГДЕ
		                |	ТИПЗНАЧЕНИЯ(торо_ПлановыеЗатраты.ДокументПлана) = ТИП(Документ.торо_АктОВыполненииРегламентногоМероприятия)";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДокумент = РезультатЗапроса.Выбрать();
		Пока ВыборкаДокумент.Следующий() Цикл
						
			Документ = ВыборкаДокумент.Ссылка.ПолучитьОбъект();
			Документ.Записать(РежимЗаписиДокумента.Проведение);
						
		КонецЦикла; 	
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡Los documentos ""los gastos Planificados"" NO перепроведены! Por la causa: ';ru='Документы ""Плановые затраты"" НЕ перепроведены! По причине: ';en='Documents ""Planned costs"" are NOT retransmitted! Due to: '")+ОписаниеОшибки);
	КонецПопытки;
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
		
КонецПроцедуры

Процедура УдалитьОстановочныеИзРегистраЗаявкиПоРемонтам() Экспорт
	
	ОшибкаТранзакции = Ложь;
	НачатьТранзакцию();
	Попытка
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_ЗаявкиПоРемонтам.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.торо_ЗаявкиПоРемонтам КАК торо_ЗаявкиПоРемонтам
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(торо_ЗаявкиПоРемонтам.Регистратор) = ТИП(Документ.торо_ОстановочныеРемонты)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			НаборЗаписей = РегистрыСведений.торо_ЗаявкиПоРемонтам.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			НаборЗаписей.Записать(Истина);
		КонецЦикла;
	
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡La desaparición de las reparaciones de parada del registro de las noticias ""торо_ЗаявкиПоРемонтам"" no es cumplida! Por la causa: ';ru='Удаление остановочных ремонтов из регистра сведений ""торо_ЗаявкиПоРемонтам"" НЕ выполнено! По причине: ';en='Deleting stop repairs from the information register ""торо_ЗаявкиПоРемонтам"" failed! Due to: '")+ОписаниеОшибки);
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьИсполнителейВРегистреЗаявкиПоРемонтам() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ID КАК IDРемонта,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаНачала КАК ДатаНачала,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаОкончания КАК ДатаОкончания,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка КАК Регистратор,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка.Дата КАК Период
	|ПОМЕСТИТЬ ВТ_РемонтыОборудования
	|ИЗ
	|	Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК торо_ЗаявкаНаРемонтРемонтыОборудования
	|ГДЕ
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка.Проведен
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	IDРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	торо_ЗаявкаНаРемонтИсполнителиРемонтныхРабот.РемонтыОборудования_ID КАК IDРемонта,
	|	торо_ЗаявкаНаРемонтИсполнителиРемонтныхРабот.Исполнитель КАК Исполнитель,
	|	торо_ЗаявкаНаРемонтИсполнителиРемонтныхРабот.ДоговорКонтрагента КАК УточнениеИсполнителя,
	|	торо_ЗаявкаНаРемонтИсполнителиРемонтныхРабот.Ссылка КАК Регистратор
	|ПОМЕСТИТЬ ВТ_Исполнители
	|ИЗ
	|	Документ.торо_ЗаявкаНаРемонт.УдалитьИсполнителиРемонтныхРабот КАК торо_ЗаявкаНаРемонтИсполнителиРемонтныхРабот
	|ГДЕ
	|	торо_ЗаявкаНаРемонтИсполнителиРемонтныхРабот.Ссылка.Проведен
	|	И (торо_ЗаявкаНаРемонтИсполнителиРемонтныхРабот.Исполнитель ССЫЛКА Справочник.СтруктураПредприятия
	|			ИЛИ торо_ЗаявкаНаРемонтИсполнителиРемонтныхРабот.Исполнитель ССЫЛКА Справочник.Контрагенты)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	IDРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РемонтыОборудования.IDРемонта КАК IDРемонта,
	|	ВТ_РемонтыОборудования.ДатаНачала КАК ДатаНачалаРемонтныхРабот,
	|	ВТ_РемонтыОборудования.ДатаОкончания КАК ДатаОкончанияРемонтныхРабот,
	|	ВТ_Исполнители.Исполнитель КАК Исполнитель,
	|	ВТ_Исполнители.УточнениеИсполнителя КАК УточнениеИсполнителя,
	|	ВТ_РемонтыОборудования.Регистратор КАК Регистратор,
	|	ВТ_РемонтыОборудования.Период КАК Период
	|ИЗ
	|	ВТ_РемонтыОборудования КАК ВТ_РемонтыОборудования
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Исполнители КАК ВТ_Исполнители
	|		ПО ВТ_РемонтыОборудования.Регистратор = ВТ_Исполнители.Регистратор
	|			И ВТ_РемонтыОборудования.IDРемонта = ВТ_Исполнители.IDРемонта
	|ИТОГИ ПО
	|	Регистратор";
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ДокВТранзакции = 50;
	Счетчик = 0;
	ОшибкаВТранзакции = Ложь;
	
	Попытка
		
		Пока Выборка.Следующий() Цикл
			Если НЕ ТранзакцияАктивна() Тогда
				НачатьТранзакцию();
			КонецЕсли;
			
			НаборЗаписей = РегистрыСведений.торо_ЗаявкиПоРемонтам.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
			НаборЗаписей.Прочитать();
			
			НаборЗаписей.Очистить();
			
			ВыборкаИД = Выборка.Выбрать(ОбходРезультатаЗапроса.Прямой);
			Пока ВыборкаИД.Следующий() Цикл
				Запись = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(Запись, ВыборкаИД);
			КонецЦикла;
				
			НаборЗаписей.Записать(Истина);
			
			Счетчик = Счетчик + 1;
			Если Счетчик = ДокВТранзакции Тогда
				ЗафиксироватьТранзакцию();
				Счетчик = 0;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ТранзакцияАктивна() Тогда
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		
	Исключение
		ОшибкаВТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка,
			,,	НСтр("es='¡El relleno de los ejecutores en el registro de las noticias ""торо_ЗаявкиПоРемонтам"" no es cumplido! Por la causa: ';ru='Заполнение исполнителей в регистре сведений ""торо_ЗаявкиПоРемонтам"" не выполнено! По причине: ';en='Filling of the performers in the register of information ""торо_ЗаявкиПоРемонтам"" has not been completed! Due to: '")+ОписаниеОшибки);
	КонецПопытки;
	
	Если ТранзакцияАктивна() И ОшибкаВТранзакции Тогда
		ОтменитьТранзакцию();
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьИерархиюВДокументахЖЦ() Экспорт
	
	ОшибкаТранзакции = Ложь;
	НачатьТранзакцию();
	Попытка
		ТекСтруктураИерархии = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
															"НастройкиТОиР",
															"ОсновнаяСтруктураИерархии",
															Справочники.торо_СтруктурыОР.ПустаяСсылка());
	
		// документ выбытие
		СписокРодителей = Новый ТаблицаЗначений;
		СписокРодителей.Колонки.Добавить("Номер");
		СписокРодителей.Колонки.Добавить("ТекстовоеОписание");
			
		Запрос = Новый Запрос;
		Запрос.Текст =  "ВЫБРАТЬ
		                |	торо_ВыбытиеОбъектаРемонта.Ссылка КАК Ссылка,
		                |	торо_ВыбытиеОбъектаРемонта.ОбъектРемонта КАК ОбъектРемонта
		                |ИЗ
		                |	Документ.торо_ВыбытиеОбъектаРемонта КАК торо_ВыбытиеОбъектаРемонта
		                |ГДЕ
		                |	торо_ВыбытиеОбъектаРемонта.ТекСтруктураИерархии = ЗНАЧЕНИЕ(Справочник.торо_СтруктурыОР.ПустаяСсылка)";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДокумент = РезультатЗапроса.Выбрать();
		Пока ВыборкаДокумент.Следующий() Цикл
						
			МассивРодителей = Новый Массив;
			СписокРодителей.Очистить();
			торо_РаботаСИерархией20.ЗаполнитьМассивРодителейОбъектаРемонта(ВыборкаДокумент.ОбъектРемонта, МассивРодителей, ТекСтруктураИерархии);
			
			Номер = 1;
			Для каждого Родитель из МассивРодителей Цикл
				НоваяСтрока = СписокРодителей.Добавить();
				НоваяСтрока.ТекстовоеОписание = Строка(Родитель);
				НоваяСтрока.Номер = Номер;
				Номер = Номер + 1;
			КонецЦикла;
			
			СписокРодителей.Сортировать("Номер Убыв");
			ТекстовоеОписаниеПоложения = "";
			КолТабов = 0;
			
			Для каждого Строка Из СписокРодителей Цикл
				КолОтступов = КолТабов;
				СтрокаОтступа = "";
				Пока Не КолОтступов = 0 Цикл
					СтрокаОтступа = СтрокаОтступа + "ˡ-->";
					КолОтступов = КолОтступов -1;
				КонецЦикла;
				Если КолТабов = 0 Тогда
					ТекстовоеОписаниеПоложения = СтрокаОтступа + Строка(Строка.ТекстовоеОписание);
				Иначе
					ТекстовоеОписаниеПоложения = ТекстовоеОписаниеПоложения + Символы.ПС + СтрокаОтступа + Строка(Строка.ТекстовоеОписание);
				КонецЕсли;
				КолТабов = КолТабов + 1;
			КонецЦикла;
			
			Документ = ВыборкаДокумент.Ссылка.ПолучитьОбъект();
			Документ.ТекСтруктураИерархии 	= ТекСтруктураИерархии;
			Документ.ВходилВСостав 			= ТекстовоеОписаниеПоложения;
			Документ.Записать(РежимЗаписиДокумента.Запись);
						
		КонецЦикла;
		
		// документ принятие к учету
		Запрос = Новый Запрос;
		Запрос.Текст =  "ВЫБРАТЬ
		                |	торо_ПринятиеОРКУчету.Ссылка КАК Ссылка,
		                |	торо_ПринятиеОРКУчету.ОбъектРемонта КАК ОбъектРемонта
		                |ИЗ
		                |	Документ.торо_ПринятиеОРКУчету КАК торо_ПринятиеОРКУчету
		                |ГДЕ
		                |	торо_ПринятиеОРКУчету.ТекСтруктураИерархии = ЗНАЧЕНИЕ(Справочник.торо_СтруктурыОР.ПустаяСсылка)";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДокумент = РезультатЗапроса.Выбрать();
		Пока ВыборкаДокумент.Следующий() Цикл
						
			МассивРодителей = Новый Массив;
			СписокРодителей.Очистить();
			торо_РаботаСИерархией20.ЗаполнитьМассивРодителейОбъектаРемонта(ВыборкаДокумент.ОбъектРемонта, МассивРодителей, ТекСтруктураИерархии);
			
			Номер = 1;
			Для каждого Родитель из МассивРодителей Цикл
				НоваяСтрока = СписокРодителей.Добавить();
				НоваяСтрока.ТекстовоеОписание = Строка(Родитель);
				НоваяСтрока.Номер = Номер;
				Номер = Номер + 1;
			КонецЦикла;
			
			СписокРодителей.Сортировать("Номер Убыв");
			ТекстовоеОписаниеПоложения = "";
			КолТабов = 0;
			
			Для каждого Строка Из СписокРодителей Цикл
				КолОтступов = КолТабов;
				СтрокаОтступа = "";
				Пока Не КолОтступов = 0 Цикл
					СтрокаОтступа = СтрокаОтступа + "ˡ-->";
					КолОтступов = КолОтступов -1;
				КонецЦикла;
				Если КолТабов = 0 Тогда
					ТекстовоеОписаниеПоложения = СтрокаОтступа + Строка(Строка.ТекстовоеОписание);
				Иначе
					ТекстовоеОписаниеПоложения = ТекстовоеОписаниеПоложения + Символы.ПС + СтрокаОтступа + Строка(Строка.ТекстовоеОписание);
				КонецЕсли;
				КолТабов = КолТабов + 1;
			КонецЦикла;
			
			Документ = ВыборкаДокумент.Ссылка.ПолучитьОбъект();
			Документ.ТекСтруктураИерархии 	= ТекСтруктураИерархии;
			Документ.ВходитВСостав 			= ТекстовоеОписаниеПоложения;
			Документ.Записать(РежимЗаписиДокумента.Запись);
						
		КонецЦикла;
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡Los documentos ""la Aceptación del objeto de la reparación al recuento"" y ""la Salida del objeto de la reparación"" no son renovados! Por la causa: ';ru='Документы ""Принятие объекта ремонта к учету"" и ""Выбытие объекта ремонта"" НЕ обновлены! По причине: ';en='The documents ""Acceptance of the repair object for accounting"" and ""Retirement of the repair object"" are NOT updated! Due to: '") + ОписаниеОшибки);
	КонецПопытки;   
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
КонецПроцедуры

Процедура ОбновлениеРегистраОтмененныеЗаявки() Экспорт
	ОшибкаТранзакции = Ложь;
	НачатьТранзакцию();
	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеЗаявки.Ссылка КАК Ссылка,
		               |	торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеЗаявки.Заявка КАК Заявка,
		               |	торо_ЗаявкиПоРемонтам.IDРемонта КАК ID,
		               |	ЕСТЬNULL(торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеРемонты.Отменен, ЛОЖЬ) КАК Отменен,
		               |	ЕСТЬNULL(торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеРемонты.Перенесен, ЛОЖЬ) КАК Перенесен
		               |ИЗ
		               |	Документ.торо_ЗакрытиеЗаявокИРемонтов.ЗакрываемыеЗаявки КАК торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеЗаявки
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗаявкиПоРемонтам КАК торо_ЗаявкиПоРемонтам
		               |		ПО торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеЗаявки.Заявка = торо_ЗаявкиПоРемонтам.Регистратор
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ЗакрытиеЗаявокИРемонтов.ЗакрываемыеРемонты КАК торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеРемонты
		               |		ПО торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеЗаявки.Ссылка = торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеРемонты.Ссылка
		               |			И (торо_ЗаявкиПоРемонтам.IDРемонта = торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеРемонты.ID)
		               |ГДЕ
		               |	торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеЗаявки.Ссылка.Проведен
		               |ИТОГИ ПО
		               |	Ссылка,
		               |	Заявка";
		
		ВыборкаДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
		
		Пока ВыборкаДокументов.Следующий() Цикл
			НаборЗаписей = РегистрыСведений.торо_ОтмененныеЗаявки.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаДокументов.Ссылка);
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			
			ВыборкаЗаявок = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Заявка");
			Пока ВыборкаЗаявок.Следующий() Цикл
				ВыборкаРемонтов = ВыборкаЗаявок.Выбрать();
				Пока ВыборкаРемонтов.Следующий() Цикл
					Запись = НаборЗаписей.Добавить();
					Запись.ИДРемонта = ВыборкаРемонтов.ID;
					Запись.Регистратор = ВыборкаДокументов.Ссылка;
					Запись.Заявка = ВыборкаЗаявок.Заявка;
					Если ВыборкаРемонтов.Отменен Тогда
						Запись.ПричинаЗакрытия = Справочники.торо_ПричиныЗакрытияЗаявок.ОтменаРемонта;
					ИначеЕсли ВыборкаРемонтов.Перенесен Тогда
						Запись.ПричинаЗакрытия = Справочники.торо_ПричиныЗакрытияЗаявок.ПереносРемонта;
					Иначе
						Запись.ПричинаЗакрытия = Справочники.торо_ПричиныЗакрытияЗаявок.ПустаяСсылка();
					КонецЕсли;
				КонецЦикла;	
			КонецЦикла;
			НаборЗаписей.Записать();
		КонецЦикла;
		
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡Los movimientos de los documentos por el registro ""las demandas Anuladas"" no son formados! Por la causa: ';ru='Движения документов по регистру ""Отмененные заявки"" НЕ сформированы! По причине: ';en='Documents movement on the register ""Canceled applications"" are NOT formed! Due to: '")+ОписаниеОшибки);
	КонецПопытки;
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
КонецПроцедуры

Процедура ОбновлениеИсполнителейВДокументахЗаявки() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РемонтныеРаботы.Ссылка КАК Ссылка,
	|	РемонтныеРаботы.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	РемонтныеРаботы.ID КАК ID,
	|	Исполнители.НомерСтроки КАК НомерСтроки,
	|	Исполнители.Исполнитель КАК Исполнитель,
	|	Исполнители.ДоговорКонтрагента КАК ДоговорБригада
	|ПОМЕСТИТЬ ВТ_ИсполнителиРемРаботВсе
	|ИЗ
	|	Документ.торо_ЗаявкаНаРемонт.УдалитьИсполнителиРемонтныхРабот КАК Исполнители
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтныеРаботы КАК РемонтныеРаботы
	|		ПО Исполнители.Ссылка = РемонтныеРаботы.Ссылка
	|			И Исполнители.РемонтыОборудования_ID = РемонтныеРаботы.РемонтыОборудования_ID
	|			И Исполнители.ID = РемонтныеРаботы.ID
	|			И (РемонтныеРаботы.Исполнитель = НЕОПРЕДЕЛЕНО)
	|			И (РемонтныеРаботы.РемонтнаяРабота ССЫЛКА Справочник.торо_ИдентификаторыТехКарт)
	|			И (Исполнители.Исполнитель ССЫЛКА Справочник.Контрагенты
	|				ИЛИ Исполнители.Исполнитель ССЫЛКА Справочник.СтруктураПредприятия)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	РемонтыОборудования_ID,
	|	ID,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИсполнителиРемРаботВсе.Ссылка КАК Ссылка,
	|	ВТ_ИсполнителиРемРаботВсе.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	ВТ_ИсполнителиРемРаботВсе.ID КАК ID,
	|	МИНИМУМ(ВТ_ИсполнителиРемРаботВсе.НомерСтроки) КАК НомерСтроки
	|ПОМЕСТИТЬ ВТ_МинНомерСтроки
	|ИЗ
	|	ВТ_ИсполнителиРемРаботВсе КАК ВТ_ИсполнителиРемРаботВсе
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ИсполнителиРемРаботВсе.Ссылка,
	|	ВТ_ИсполнителиРемРаботВсе.РемонтыОборудования_ID,
	|	ВТ_ИсполнителиРемРаботВсе.ID
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	РемонтыОборудования_ID,
	|	ID,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИсполнителиРемРаботВсе.Ссылка КАК Ссылка,
	|	ВТ_ИсполнителиРемРаботВсе.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	ВТ_ИсполнителиРемРаботВсе.ID КАК ID,
	|	ВТ_ИсполнителиРемРаботВсе.Исполнитель КАК Исполнитель,
	|	ВТ_ИсполнителиРемРаботВсе.ДоговорБригада КАК ДоговорБригада
	|ИЗ
	|	ВТ_ИсполнителиРемРаботВсе КАК ВТ_ИсполнителиРемРаботВсе
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МинНомерСтроки КАК ВТ_МинНомерСтроки
	|		ПО ВТ_ИсполнителиРемРаботВсе.Ссылка = ВТ_МинНомерСтроки.Ссылка
	|			И ВТ_ИсполнителиРемРаботВсе.РемонтыОборудования_ID = ВТ_МинНомерСтроки.РемонтыОборудования_ID
	|			И ВТ_ИсполнителиРемРаботВсе.ID = ВТ_МинНомерСтроки.ID
	|			И ВТ_ИсполнителиРемРаботВсе.НомерСтроки = ВТ_МинНомерСтроки.НомерСтроки
	|ИТОГИ ПО
	|	Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ДокВТранзакции = 500;
	Счетчик = 0;
	ОшибкаВТранзакции = Ложь;
	
	Попытка
		
		Пока Выборка.Следующий() Цикл
			Если НЕ ТранзакцияАктивна() Тогда
				НачатьТранзакцию();
			КонецЕсли;
			
			ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			// Дозаполнение исполнителей в дереве рем. работ.
			ВыборкаДеталейОперации = Выборка.Выбрать(ОбходРезультатаЗапроса.Прямой);
			СтруктураПоиска = Новый Структура("РемонтыОборудования_ID, ID");
			
			Пока ВыборкаДеталейОперации.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(СтруктураПоиска, ВыборкаДеталейОперации);
				СтрокиРемРабот = ДокументОбъект.РемонтныеРаботы.НайтиСтроки(СтруктураПоиска);
				Для каждого СтрокаРемРабот из СтрокиРемРабот Цикл
					СтрокаРемРабот.Исполнитель = ВыборкаДеталейОперации.Исполнитель;
					СтрокаРемРабот.ДоговорБригада = ВыборкаДеталейОперации.ДоговорБригада;
				КонецЦикла;
			КонецЦикла;
			
			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			
			Счетчик = Счетчик + 1;
			Если Счетчик = ДокВТранзакции Тогда
				ЗафиксироватьТранзакцию();
				Счетчик = 0;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ТранзакцияАктивна() Тогда
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		
	Исключение
		ОшибкаВТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка,
				,,	НСтр("es='¡La renovación de los ejecutores en los documentos ""la Demanda por la reparación"" no es cumplida! Por la causa: ';ru='Обновление исполнителей в документах ""Заявка на ремонт"" не выполнено! По причине: ';en='Update performers in the documents ""Request for repair"" is not completed! Due to: '")+ОписаниеОшибки);
	КонецПопытки;
	
	Если ТранзакцияАктивна() И ОшибкаВТранзакции Тогда
		ОтменитьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновлениеИсполнителейВДокументахНаряды() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РемонтныеРаботы.Ссылка КАК Ссылка,
	|	РемонтныеРаботы.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	РемонтныеРаботы.ID КАК ID,
	|	Исполнители.НомерСтроки КАК НомерСтроки,
	|	Исполнители.Контрагент КАК Исполнитель,
	|	Исполнители.ДоговорКонтрагента КАК ДоговорБригада
	|ПОМЕСТИТЬ ВТ_ИсполнителиРемРаботВсе
	|ИЗ
	|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.УдалитьПодрядчики КАК Исполнители
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтныеРаботы КАК РемонтныеРаботы
	|		ПО Исполнители.Ссылка = РемонтныеРаботы.Ссылка
	|			И Исполнители.РемонтыОборудования_ID = РемонтныеРаботы.РемонтыОборудования_ID
	|			И Исполнители.ID = РемонтныеРаботы.ID
	|			И (РемонтныеРаботы.Исполнитель = НЕОПРЕДЕЛЕНО)
	|			И (РемонтныеРаботы.РемонтнаяРабота ССЫЛКА Справочник.торо_ИдентификаторыТехКарт)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	РемонтыОборудования_ID,
	|	ID,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИсполнителиРемРаботВсе.Ссылка КАК Ссылка,
	|	ВТ_ИсполнителиРемРаботВсе.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	ВТ_ИсполнителиРемРаботВсе.ID КАК ID,
	|	МИНИМУМ(ВТ_ИсполнителиРемРаботВсе.НомерСтроки) КАК НомерСтроки
	|ПОМЕСТИТЬ ВТ_МинНомерСтроки
	|ИЗ
	|	ВТ_ИсполнителиРемРаботВсе КАК ВТ_ИсполнителиРемРаботВсе
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ИсполнителиРемРаботВсе.Ссылка,
	|	ВТ_ИсполнителиРемРаботВсе.РемонтыОборудования_ID,
	|	ВТ_ИсполнителиРемРаботВсе.ID
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	РемонтыОборудования_ID,
	|	ID,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИсполнителиРемРаботВсе.Ссылка КАК Ссылка,
	|	ВТ_ИсполнителиРемРаботВсе.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	ВТ_ИсполнителиРемРаботВсе.ID КАК ID,
	|	ВТ_ИсполнителиРемРаботВсе.Исполнитель КАК Исполнитель,
	|	ВТ_ИсполнителиРемРаботВсе.ДоговорБригада КАК ДоговорБригада
	|ИЗ
	|	ВТ_ИсполнителиРемРаботВсе КАК ВТ_ИсполнителиРемРаботВсе
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МинНомерСтроки КАК ВТ_МинНомерСтроки
	|		ПО ВТ_ИсполнителиРемРаботВсе.Ссылка = ВТ_МинНомерСтроки.Ссылка
	|			И ВТ_ИсполнителиРемРаботВсе.РемонтыОборудования_ID = ВТ_МинНомерСтроки.РемонтыОборудования_ID
	|			И ВТ_ИсполнителиРемРаботВсе.ID = ВТ_МинНомерСтроки.ID
	|			И ВТ_ИсполнителиРемРаботВсе.НомерСтроки = ВТ_МинНомерСтроки.НомерСтроки
	|ИТОГИ ПО
	|	Ссылка";
	
	ВыборкаОперации = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Исполнители.Ссылка КАК Ссылка,
	|	Исполнители.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	Исполнители.Контрагент КАК Исполнитель,
	|	Исполнители.ДоговорКонтрагента КАК УточнениеИсполнителя,
	|	Исполнители.ДатаНачала КАК ДатаНачала,
	|	Исполнители.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.УдалитьПодрядчики КАК Исполнители
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_НарядНаВыполнениеРемонтныхРабот.ИсполнителиПоРемонтам КАК ИсполнителиПоРемонтам
	|		ПО Исполнители.Ссылка = ИсполнителиПоРемонтам.Ссылка
	|			И Исполнители.РемонтыОборудования_ID = ИсполнителиПоРемонтам.РемонтыОборудования_ID
	|			И Исполнители.Контрагент = ИсполнителиПоРемонтам.Исполнитель
	|			И Исполнители.ДоговорКонтрагента = ИсполнителиПоРемонтам.УточнениеИсполнителя
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтыОборудования КАК РемонтыОборудования
	|		ПО Исполнители.Ссылка = РемонтыОборудования.Ссылка
	|			И Исполнители.РемонтыОборудования_ID = РемонтыОборудования.ID
	|ГДЕ
	|	ИсполнителиПоРемонтам.РемонтыОборудования_ID ЕСТЬ NULL
	|ИТОГИ ПО
	|	Ссылка";
	
	ВыборкаРемонты = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Исполнители.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.УдалитьПодрядчики КАК Исполнители
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтыОборудования КАК РемонтыОборудования
	|		ПО Исполнители.Ссылка = РемонтыОборудования.Ссылка
	|			И Исполнители.РемонтыОборудования_ID = РемонтыОборудования.ID";
	
	ВыборкаДокументы = Запрос.Выполнить().Выбрать();
	
	ДокВТранзакции = 500;
	Счетчик = 0;
	ОшибкаВТранзакции = Ложь;
	
	Попытка
		
		Пока ВыборкаДокументы.Следующий() Цикл
			Если НЕ ТранзакцияАктивна() Тогда
				НачатьТранзакцию();
			КонецЕсли;
			
			ВыборкаРемонты.Сбросить();
			ЕстьВыборкаРемонты = ВыборкаРемонты.НайтиСледующий(Новый Структура("Ссылка", ВыборкаДокументы.Ссылка));
			
			ВыборкаОперации.Сбросить();
			ЕстьВыборкаОперации = ВыборкаОперации.НайтиСледующий(Новый Структура("Ссылка", ВыборкаДокументы.Ссылка));
			
			Если НЕ ЕстьВыборкаРемонты И НЕ ЕстьВыборкаОперации Тогда
				Продолжить;
			КонецЕсли;
			
			ДокументОбъект = ВыборкаДокументы.Ссылка.ПолучитьОбъект();
			
			// Перенос исполнителей в другую ТЧ.
			Если ЕстьВыборкаРемонты Тогда
				ВыборкаДеталей = ВыборкаРемонты.Выбрать(ОбходРезультатаЗапроса.Прямой);
				Пока ВыборкаДеталей.Следующий() Цикл
					НоваяСтрока = ДокументОбъект.ИсполнителиПоРемонтам.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДеталей);
				КонецЦикла;
			КонецЕсли;
			
			// Дозаполнение исполнителей в дереве рем. работ.
			Если ЕстьВыборкаОперации Тогда
				
				ВыборкаДеталейОперации = ВыборкаОперации.Выбрать(ОбходРезультатаЗапроса.Прямой);
				СтруктураПоиска = Новый Структура("РемонтыОборудования_ID, ID");
				
				Пока ВыборкаДеталейОперации.Следующий() Цикл
					ЗаполнитьЗначенияСвойств(СтруктураПоиска, ВыборкаДеталейОперации);
					СтрокиРемРабот = ДокументОбъект.РемонтныеРаботы.НайтиСтроки(СтруктураПоиска);
					Для каждого СтрокаРемРабот из СтрокиРемРабот Цикл
						СтрокаРемРабот.Исполнитель = ВыборкаДеталейОперации.Исполнитель;
						СтрокаРемРабот.ДоговорБригада = ВыборкаДеталейОперации.ДоговорБригада;
					КонецЦикла;
				КонецЦикла;
				
			КонецЕсли;
			
			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			
			Счетчик = Счетчик + 1;
			Если Счетчик = ДокВТранзакции Тогда
				ЗафиксироватьТранзакцию();
				Счетчик = 0;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ТранзакцияАктивна() Тогда
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		
	Исключение
		ОшибкаВТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка,
				,,	НСтр("es='¡La renovación de los ejecutores en los documentos ""el Vestido de la ejecución de los trabajos de reparación"" no es cumplida! Por la causa: ';ru='Обновление исполнителей в документах ""Наряд на выполнение ремонтных работ"" не выполнено! По причине: ';en='Updating of the performers in the documents “Order for repair work” has not been completed! Due to: '")+ОписаниеОшибки);
	КонецПопытки;
	
	Если ТранзакцияАктивна() И ОшибкаВТранзакции Тогда
		ОтменитьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновлениеИсполнителейВДокументахАкты() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РемонтныеРаботы.Ссылка КАК Ссылка,
	|	РемонтныеРаботы.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	РемонтныеРаботы.ID КАК ID,
	|	Исполнители.НомерСтроки КАК НомерСтроки,
	|	Исполнители.Контрагент КАК Исполнитель,
	|	Исполнители.ДоговорКонтрагента КАК ДоговорБригада
	|ПОМЕСТИТЬ ВТ_ИсполнителиРемРаботВсе
	|ИЗ
	|	Документ.торо_АктОВыполненииЭтапаРабот.УдалитьПодрядчикиРемонтныхРабот КАК Исполнители
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтныеРаботы КАК РемонтныеРаботы
	|		ПО Исполнители.Ссылка = РемонтныеРаботы.Ссылка
	|			И Исполнители.РемонтыОборудования_ID = РемонтныеРаботы.РемонтыОборудования_ID
	|			И Исполнители.ID = РемонтныеРаботы.ID
	|			И (РемонтныеРаботы.Исполнитель = НЕОПРЕДЕЛЕНО)
	|			И (РемонтныеРаботы.РемонтнаяРабота ССЫЛКА Справочник.торо_ИдентификаторыТехКарт)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	РемонтыОборудования_ID,
	|	ID,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИсполнителиРемРаботВсе.Ссылка КАК Ссылка,
	|	ВТ_ИсполнителиРемРаботВсе.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	ВТ_ИсполнителиРемРаботВсе.ID КАК ID,
	|	МИНИМУМ(ВТ_ИсполнителиРемРаботВсе.НомерСтроки) КАК НомерСтроки
	|ПОМЕСТИТЬ ВТ_МинНомерСтроки
	|ИЗ
	|	ВТ_ИсполнителиРемРаботВсе КАК ВТ_ИсполнителиРемРаботВсе
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ИсполнителиРемРаботВсе.Ссылка,
	|	ВТ_ИсполнителиРемРаботВсе.РемонтыОборудования_ID,
	|	ВТ_ИсполнителиРемРаботВсе.ID
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	РемонтыОборудования_ID,
	|	ID,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИсполнителиРемРаботВсе.Ссылка КАК Ссылка,
	|	ВТ_ИсполнителиРемРаботВсе.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	ВТ_ИсполнителиРемРаботВсе.ID КАК ID,
	|	ВТ_ИсполнителиРемРаботВсе.Исполнитель КАК Исполнитель,
	|	ВТ_ИсполнителиРемРаботВсе.ДоговорБригада КАК ДоговорБригада
	|ИЗ
	|	ВТ_ИсполнителиРемРаботВсе КАК ВТ_ИсполнителиРемРаботВсе
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МинНомерСтроки КАК ВТ_МинНомерСтроки
	|		ПО ВТ_ИсполнителиРемРаботВсе.Ссылка = ВТ_МинНомерСтроки.Ссылка
	|			И ВТ_ИсполнителиРемРаботВсе.РемонтыОборудования_ID = ВТ_МинНомерСтроки.РемонтыОборудования_ID
	|			И ВТ_ИсполнителиРемРаботВсе.ID = ВТ_МинНомерСтроки.ID
	|			И ВТ_ИсполнителиРемРаботВсе.НомерСтроки = ВТ_МинНомерСтроки.НомерСтроки
	|ИТОГИ ПО
	|	Ссылка";
	
	ВыборкаОперации = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Исполнители.Ссылка КАК Ссылка,
	|	Исполнители.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	Исполнители.Контрагент КАК Исполнитель,
	|	Исполнители.ДоговорКонтрагента КАК УточнениеИсполнителя,
	|	Исполнители.ДатаНачала КАК ДатаНачала,
	|	Исполнители.ДатаОкончания КАК ДатаОкончания,
	|	Исполнители.Сумма КАК Сумма
	|ИЗ
	|	Документ.торо_АктОВыполненииЭтапаРабот.УдалитьПодрядчикиРемонтныхРабот КАК Исполнители
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.ИсполнителиПоРемонтам КАК ИсполнителиПоРемонтам
	|		ПО Исполнители.Ссылка = ИсполнителиПоРемонтам.Ссылка
	|			И Исполнители.РемонтыОборудования_ID = ИсполнителиПоРемонтам.РемонтыОборудования_ID
	|			И Исполнители.Контрагент = ИсполнителиПоРемонтам.Исполнитель
	|			И Исполнители.ДоговорКонтрагента = ИсполнителиПоРемонтам.УточнениеИсполнителя
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК РемонтыОборудования
	|		ПО Исполнители.Ссылка = РемонтыОборудования.Ссылка
	|			И Исполнители.РемонтыОборудования_ID = РемонтыОборудования.ID
	|ГДЕ
	|	ИсполнителиПоРемонтам.РемонтыОборудования_ID ЕСТЬ NULL
	|ИТОГИ ПО
	|	Ссылка";
	
	ВыборкаРемонты = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Исполнители.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.торо_АктОВыполненииЭтапаРабот.УдалитьПодрядчикиРемонтныхРабот КАК Исполнители
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК РемонтыОборудования
	|		ПО Исполнители.Ссылка = РемонтыОборудования.Ссылка
	|			И Исполнители.РемонтыОборудования_ID = РемонтыОборудования.ID";
	
	ВыборкаДокументы = Запрос.Выполнить().Выбрать();
	
	ДокВТранзакции = 500;
	Счетчик = 0;
	ОшибкаВТранзакции = Ложь;
	
	Попытка
		
		Пока ВыборкаДокументы.Следующий() Цикл
			Если НЕ ТранзакцияАктивна() Тогда
				НачатьТранзакцию();
			КонецЕсли;
			
			ВыборкаРемонты.Сбросить();
			ЕстьВыборкаРемонты = ВыборкаРемонты.НайтиСледующий(Новый Структура("Ссылка", ВыборкаДокументы.Ссылка));
			
			ВыборкаОперации.Сбросить();
			ЕстьВыборкаОперации = ВыборкаОперации.НайтиСледующий(Новый Структура("Ссылка", ВыборкаДокументы.Ссылка));
			
			Если НЕ ЕстьВыборкаРемонты И НЕ ЕстьВыборкаОперации Тогда
				Продолжить;
			КонецЕсли;
			
			ДокументОбъект = ВыборкаДокументы.Ссылка.ПолучитьОбъект();
			
			// Перенос исполнителей в другую ТЧ.
			Если ЕстьВыборкаРемонты Тогда
				ВыборкаДеталей = ВыборкаРемонты.Выбрать(ОбходРезультатаЗапроса.Прямой);
				Пока ВыборкаДеталей.Следующий() Цикл
					НоваяСтрока = ДокументОбъект.ИсполнителиПоРемонтам.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДеталей);
				КонецЦикла;
			КонецЕсли;
			
			// Дозаполнение исполнителей в дереве рем. работ.
			Если ЕстьВыборкаОперации Тогда
				
				ВыборкаДеталейОперации = ВыборкаОперации.Выбрать(ОбходРезультатаЗапроса.Прямой);
				СтруктураПоиска = Новый Структура("РемонтыОборудования_ID, ID");
				
				Пока ВыборкаДеталейОперации.Следующий() Цикл
					ЗаполнитьЗначенияСвойств(СтруктураПоиска, ВыборкаДеталейОперации);
					СтрокиРемРабот = ДокументОбъект.РемонтныеРаботы.НайтиСтроки(СтруктураПоиска);
					Для каждого СтрокаРемРабот из СтрокиРемРабот Цикл
						СтрокаРемРабот.Исполнитель = ВыборкаДеталейОперации.Исполнитель;
						СтрокаРемРабот.ДоговорБригада = ВыборкаДеталейОперации.ДоговорБригада;
					КонецЦикла;
				КонецЦикла;
				
			КонецЕсли;
			
			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			
			Счетчик = Счетчик + 1;
			Если Счетчик = ДокВТранзакции Тогда
				ЗафиксироватьТранзакцию();
				Счетчик = 0;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ТранзакцияАктивна() Тогда
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		
	Исключение
		ОшибкаВТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка,
				,,	НСтр("es='¡La renovación de los ejecutores en los documentos ""el Acta sobre la ejecución de los trabajos de reparación"" no es cumplida! Por la causa: ';ru='Обновление исполнителей в документах ""Акт о выполнении ремонтных работ"" не выполнено! По причине: ';en='Updating the performers in the documents ""Act on the performance of repair work"" has not been completed! Due to: '")+ОписаниеОшибки);
	КонецПопытки;
	
	Если ТранзакцияАктивна() И ОшибкаВТранзакции Тогда
		ОтменитьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

// 2.0.23.1
Процедура ОбновитьКоличествоВЗаявках() Экспорт
	
	ОшибкаТранзакции = Ложь;
	НачатьТранзакцию();
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст =  "ВЫБРАТЬ РАЗЛИЧНЫЕ
		                |	торо_ЗаявкаНаРемонтРемонтныеРаботы.Ссылка КАК Ссылка
		                |ИЗ
		                |	Документ.торо_ЗаявкаНаРемонт.РемонтныеРаботы КАК торо_ЗаявкаНаРемонтРемонтныеРаботы
		                |ГДЕ
		                |	торо_ЗаявкаНаРемонтРемонтныеРаботы.Количество = 0";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДокумент = РезультатЗапроса.Выбрать();
		Пока ВыборкаДокумент.Следующий() Цикл
						
			Документ = ВыборкаДокумент.Ссылка.ПолучитьОбъект();
			РемонтныеРаботы = Документ.РемонтныеРаботы;
			Для каждого Строка Из РемонтныеРаботы Цикл
				Если Строка.Количество = 0 Тогда
					Строка.Количество = 1;
				КонецЕсли; 
			КонецЦикла;  
			Документ.Записать(РежимЗаписиДокумента.Запись);
			
			НаборЗаписей = РегистрыНакопления.торо_ПроцентВыполненныхРабот.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаДокумент.Ссылка);
			НаборЗаписей.Прочитать();
			
			Для каждого Строка Из НаборЗаписей Цикл
				Если Строка.Процент = 0 Тогда
					Строка.Процент = 100;
				КонецЕсли; 
			КонецЦикла; 
			НаборЗаписей.Записать(Истина);
		КонецЦикла;
		
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
			,,	НСтр("es='¡Los documentos ""la Demanda por la reparación"" no son renovados! Por la causa: ';ru='Документы ""Заявка на ремонт"" НЕ обновлены! По причине: ';en='Documents ""Request for repair"" are NOT updated! Due to: '") + ОписаниеОшибки);
	КонецПопытки;   
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
КонецПроцедуры

Процедура ПеренестиИсполнителейПоРемонтамВЗаявках() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Исполнители.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	Исполнители.Исполнитель КАК Исполнитель,
	|	Исполнители.ДоговорКонтрагента КАК УточнениеИсполнителя,
	|	Исполнители.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.торо_ЗаявкаНаРемонт.УдалитьИсполнителиРемонтныхРабот КАК Исполнители
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.ИсполнителиПоРемонтам КАК ИсполнителиПоРемонтам
	|		ПО Исполнители.Ссылка = ИсполнителиПоРемонтам.Ссылка
	|			И Исполнители.РемонтыОборудования_ID = ИсполнителиПоРемонтам.РемонтыОборудования_ID
	|			И Исполнители.Исполнитель = ИсполнителиПоРемонтам.Исполнитель
	|			И Исполнители.ДоговорКонтрагента = ИсполнителиПоРемонтам.УточнениеИсполнителя
	|ГДЕ
	|	(Исполнители.Исполнитель ССЫЛКА Справочник.Контрагенты
	|			ИЛИ Исполнители.Исполнитель ССЫЛКА Справочник.СтруктураПредприятия)
	|	И ИсполнителиПоРемонтам.РемонтыОборудования_ID ЕСТЬ NULL
	|	И Исполнители.РемонтыОборудования_ID <> """"
	|ИТОГИ ПО
	|	Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ДокВТранзакции = 500;
	Счетчик = 0;
	ОшибкаВТранзакции = Ложь;
	
	Попытка
		
		Пока Выборка.Следующий() Цикл
			Если НЕ ТранзакцияАктивна() Тогда
				НачатьТранзакцию();
			КонецЕсли;
			
			ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ВыборкаДеталей = Выборка.Выбрать(ОбходРезультатаЗапроса.Прямой);
			
			Пока ВыборкаДеталей.Следующий() Цикл
				НоваяСтрока = ДокументОбъект.ИсполнителиПоРемонтам.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДеталей);
			КонецЦикла;
			
			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			
			Счетчик = Счетчик + 1;
			Если Счетчик = ДокВТранзакции Тогда
				ЗафиксироватьТранзакцию();
				Счетчик = 0;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ТранзакцияАктивна() Тогда
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		
	Исключение
		ОшибкаВТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка,
				,,	НСтр("es='¡La renovación de los ejecutores en los documentos ""la Demanda por la reparación"" no es cumplida! Por la causa: ';ru='Обновление исполнителей в документах ""Заявка на ремонт"" не выполнено! По причине: ';en='Update performers in the documents ""Request for repair"" is not completed! Due to: '")+ОписаниеОшибки);
	КонецПопытки;
	
	Если ТранзакцияАктивна() И ОшибкаВТранзакции Тогда
		ОтменитьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновлениеЗакрываемыхПредписанийВЗаявках() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ЗаявкаНаРемонтЗакрываемыеПредписания.Ссылка КАК Ссылка,
	|	торо_ЗаявкаНаРемонтЗакрываемыеПредписания.ID КАК ID,
	|	торо_ЗаявкаНаРемонтЗакрываемыеПредписания.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_ЗаявкаНаРемонтЗакрываемыеПредписания.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	торо_ВнешниеОснованияДляРабот.Регистратор КАК ДокументВнешнегоОснования,
	|	торо_ВнешниеОснованияДляРабот.Описание КАК Описание,
	|	торо_ВнешниеОснованияДляРабот.ПлановаяДатаРемонта КАК ПлановаяДатаРемонта
	|ИЗ
	|	Документ.торо_ЗаявкаНаРемонт.ЗакрываемыеПредписания КАК торо_ЗаявкаНаРемонтЗакрываемыеПредписания
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВнешниеОснованияДляРабот КАК торо_ВнешниеОснованияДляРабот
	|		ПО торо_ЗаявкаНаРемонтЗакрываемыеПредписания.ОбъектРемонта = торо_ВнешниеОснованияДляРабот.ОбъектРемонта
	|			И торо_ЗаявкаНаРемонтЗакрываемыеПредписания.ID = торо_ВнешниеОснованияДляРабот.ID
	|			И (торо_ВнешниеОснованияДляРабот.Регистратор ССЫЛКА Документ.торо_ВнешнееОснованиеДляРабот)
	|ИТОГИ ПО
	|	Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ДокВТранзакции = 500;
	Счетчик = 0;
	ОшибкаВТранзакции = Ложь;
	
	Попытка
		
		Пока Выборка.Следующий() Цикл
			Если НЕ ТранзакцияАктивна() Тогда
				НачатьТранзакцию();
			КонецЕсли;
			
			ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ВыборкаДеталей = Выборка.Выбрать(ОбходРезультатаЗапроса.Прямой);
			
			ДокументОбъект.ЗакрываемыеПредписания.Очистить();
			
			Пока ВыборкаДеталей.Следующий() Цикл
				НоваяСтрока = ДокументОбъект.ЗакрываемыеПредписания.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДеталей);
			КонецЦикла;
			
			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			
			Счетчик = Счетчик + 1;
			Если Счетчик = ДокВТранзакции Тогда
				ЗафиксироватьТранзакцию();
				Счетчик = 0;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ТранзакцияАктивна() Тогда
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		
	Исключение
		ОшибкаВТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка,
				,,	НСтр("es='¡La renovación de las prescripciones cerradas en los documentos ""la Demanda por la reparación"" no es cumplida! Por la causa: ';ru='Обновление закрываемых предписаний в документах ""Заявка на ремонт"" не выполнено! По причине: ';en='Updating of closed prescriptions in the “Request for Repair” documents has not been completed! Due to: '")+ОписаниеОшибки);
	КонецПопытки;
	
	Если ТранзакцияАктивна() И ОшибкаВТранзакции Тогда
		ОтменитьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновлениеЗакрываемыхПредписанийВАктах() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_АктОВыполненииЭтапаРаботЗакрываемыеПредписания.Ссылка КАК Ссылка,
	|	торо_АктОВыполненииЭтапаРаботЗакрываемыеПредписания.ID КАК ID,
	|	торо_АктОВыполненииЭтапаРаботЗакрываемыеПредписания.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_АктОВыполненииЭтапаРаботЗакрываемыеПредписания.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	торо_ВнешниеОснованияДляРабот.Регистратор КАК ДокументВнешнегоОснования,
	|	торо_ВнешниеОснованияДляРабот.Описание КАК Описание,
	|	торо_ВнешниеОснованияДляРабот.ПлановаяДатаРемонта КАК ПлановаяДатаРемонта
	|ИЗ
	|	Документ.торо_АктОВыполненииЭтапаРабот.ЗакрываемыеПредписания КАК торо_АктОВыполненииЭтапаРаботЗакрываемыеПредписания
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВнешниеОснованияДляРабот КАК торо_ВнешниеОснованияДляРабот
	|		ПО торо_АктОВыполненииЭтапаРаботЗакрываемыеПредписания.ОбъектРемонта = торо_ВнешниеОснованияДляРабот.ОбъектРемонта
	|			И торо_АктОВыполненииЭтапаРаботЗакрываемыеПредписания.ID = торо_ВнешниеОснованияДляРабот.ID
	|			И (торо_ВнешниеОснованияДляРабот.Регистратор ССЫЛКА Документ.торо_ВнешнееОснованиеДляРабот)
	|ИТОГИ ПО
	|	Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ДокВТранзакции = 500;
	Счетчик = 0;
	ОшибкаВТранзакции = Ложь;
	
	Попытка
		
		Пока Выборка.Следующий() Цикл
			Если НЕ ТранзакцияАктивна() Тогда
				НачатьТранзакцию();
			КонецЕсли;
			
			ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ВыборкаДеталей = Выборка.Выбрать(ОбходРезультатаЗапроса.Прямой);
			
			ДокументОбъект.ЗакрываемыеПредписания.Очистить();
			
			Пока ВыборкаДеталей.Следующий() Цикл
				НоваяСтрока = ДокументОбъект.ЗакрываемыеПредписания.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДеталей);
			КонецЦикла;
			
			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			
			Счетчик = Счетчик + 1;
			Если Счетчик = ДокВТранзакции Тогда
				ЗафиксироватьТранзакцию();
				Счетчик = 0;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ТранзакцияАктивна() Тогда
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		
	Исключение
		ОшибкаВТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка,
				,, НСтр("es='¡La renovación de las prescripciones cerradas en los documentos ""el Acta sobre la ejecución de la etapa de los trabajos"" no es cumplida! Por la causa: ';ru='Обновление закрываемых предписаний в документах ""Акт о выполнении этапа работ"" не выполнено! По причине: ';en='Updating closed prescriptions in the documents ""Act on the implementation of the work phase"" has not been completed! Due to: '")+ОписаниеОшибки);
	КонецПопытки;
	
	Если ТранзакцияАктивна() И ОшибкаВТранзакции Тогда
		ОтменитьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновлениеЗакрываемыхПредписанийВНарядах() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_НарядНаВыполнениеРемонтныхРаботЗакрываемыеПредписания.Ссылка КАК Ссылка,
	|	торо_НарядНаВыполнениеРемонтныхРаботЗакрываемыеПредписания.ID КАК ID,
	|	торо_НарядНаВыполнениеРемонтныхРаботЗакрываемыеПредписания.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_НарядНаВыполнениеРемонтныхРаботЗакрываемыеПредписания.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	торо_ВнешниеОснованияДляРабот.Регистратор КАК ДокументВнешнегоОснования,
	|	торо_ВнешниеОснованияДляРабот.Описание КАК Описание,
	|	торо_ВнешниеОснованияДляРабот.ПлановаяДатаРемонта КАК ПлановаяДатаРемонта
	|ИЗ
	|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.ЗакрываемыеПредписания КАК торо_НарядНаВыполнениеРемонтныхРаботЗакрываемыеПредписания
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВнешниеОснованияДляРабот КАК торо_ВнешниеОснованияДляРабот
	|		ПО торо_НарядНаВыполнениеРемонтныхРаботЗакрываемыеПредписания.ОбъектРемонта = торо_ВнешниеОснованияДляРабот.ОбъектРемонта
	|			И торо_НарядНаВыполнениеРемонтныхРаботЗакрываемыеПредписания.ID = торо_ВнешниеОснованияДляРабот.ID
	|			И (торо_ВнешниеОснованияДляРабот.Регистратор ССЫЛКА Документ.торо_ВнешнееОснованиеДляРабот)
	|ИТОГИ ПО
	|	Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ДокВТранзакции = 500;
	Счетчик = 0;
	ОшибкаВТранзакции = Ложь;
	
	Попытка
		
		Пока Выборка.Следующий() Цикл
			Если НЕ ТранзакцияАктивна() Тогда
				НачатьТранзакцию();
			КонецЕсли;
			
			ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ВыборкаДеталей = Выборка.Выбрать(ОбходРезультатаЗапроса.Прямой);
			
			ДокументОбъект.ЗакрываемыеПредписания.Очистить();
			
			Пока ВыборкаДеталей.Следующий() Цикл
				НоваяСтрока = ДокументОбъект.ЗакрываемыеПредписания.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДеталей);
			КонецЦикла;
			
			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			
			Счетчик = Счетчик + 1;
			Если Счетчик = ДокВТранзакции Тогда
				ЗафиксироватьТранзакцию();
				Счетчик = 0;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ТранзакцияАктивна() Тогда
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		
	Исключение
		ОшибкаВТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка,
				,, НСтр("es='¡La renovación de las prescripciones cerradas en los documentos ""el Vestido de la ejecución de los trabajos de reparación"" no es cumplida! Por la causa: ';ru='Обновление закрываемых предписаний в документах ""Наряд на выполнение ремонтных работ"" не выполнено! По причине: ';en='Updating of closed prescriptions in the documents “Order for repair work” has not been completed! Due to: '")+ОписаниеОшибки);
	КонецПопытки;
	
	Если ТранзакцияАктивна() И ОшибкаВТранзакции Тогда
		ОтменитьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

// 2.0.24.1
Процедура ЗаполнениеВидовСкользящихПланов() Экспорт
	
	ОшибкаТранзакции = Ложь;
	НачатьТранзакцию();
	
	Попытка
		
		// Стратегический
		ВидПлана = Справочники.торо_ВидыСкользящихПланов.Стратегический.ПолучитьОбъект();
		ВидПлана.Использование             = Истина;
		ВидПлана.ПериодичностьПланирования = Перечисления.Периодичность.Год;
		ВидПлана.ЧислоОтображаемыхПериодов = 10;
		ВидПлана.ТочностьПланирования      = Перечисления.торо_ДетализацияПлана.Год;
		ВидПлана.ВидИсполнителяРабот       = Перечисления.торо_ДетализацияИсполнителя.Подразделение;
		
		ВидПлана.Записать();
		
		// Долгосрочный
		ВидПлана = Справочники.торо_ВидыСкользящихПланов.Долгосрочный.ПолучитьОбъект();
		ВидПлана.Использование             = Истина;
		ВидПлана.ПериодичностьПланирования = Перечисления.Периодичность.Год;
		ВидПлана.ЧислоОтображаемыхПериодов = 5;
		ВидПлана.ТочностьПланирования      = Перечисления.торо_ДетализацияПлана.Месяц;
		ВидПлана.ВидИсполнителяРабот       = Перечисления.торо_ДетализацияИсполнителя.Подразделение;
		
		ВидПлана.Записать();

		// Годовой
		ВидПлана = Справочники.торо_ВидыСкользящихПланов.Годовой.ПолучитьОбъект();
		ВидПлана.Использование             = Истина;
		ВидПлана.ПериодичностьПланирования = Перечисления.Периодичность.Год;
		ВидПлана.ЧислоОтображаемыхПериодов = 2;
		ВидПлана.ТочностьПланирования      = Перечисления.торо_ДетализацияПлана.Неделя;
		ВидПлана.ВидИсполнителяРабот       = Перечисления.торо_ДетализацияИсполнителя.Подразделение;
		
		ВидПлана.Записать();

		// Среднесрочный
		ВидПлана = Справочники.торо_ВидыСкользящихПланов.Среднесрочный.ПолучитьОбъект();
		ВидПлана.Использование             = Истина;
		ВидПлана.ПериодичностьПланирования = Перечисления.Периодичность.Месяц;
		ВидПлана.ЧислоОтображаемыхПериодов = 3;
		ВидПлана.ТочностьПланирования      = Перечисления.торо_ДетализацияПлана.Неделя;
		ВидПлана.ВидИсполнителяРабот       = Перечисления.торо_ДетализацияИсполнителя.Бригада;

		ВидПлана.Записать();

		// Оперативный
		ВидПлана = Справочники.торо_ВидыСкользящихПланов.Оперативный.ПолучитьОбъект();
		ВидПлана.Использование             = Истина;
		ВидПлана.ПериодичностьПланирования = Перечисления.Периодичность.Неделя;
		ВидПлана.ЧислоОтображаемыхПериодов = 2;
		ВидПлана.ТочностьПланирования      = Перечисления.торо_ДетализацияПлана.Час;
		ВидПлана.ВидИсполнителяРабот       = Перечисления.торо_ДетализацияИсполнителя.Бригада;
		
		ВидПлана.Записать();

	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
									,, НСтр("es='¡La guía ""los Tipos de los planes que se deslizan"" no es rellenada! Por la causa: ';ru='Справочник ""Виды скользящих планов"" НЕ заполнен! По причине: ';en='Directory ""Types of Moving Plans"" is NOT filled! Due to: '") + ОписаниеОшибки);
	КонецПопытки;   
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;

КонецПроцедуры

Процедура ОбновлениеРегистраНакопленияВремяНахожденияВСостоянии() Экспорт
	
	ОшибкаТранзакции = Ложь;
	НачатьТранзакцию();
	
	Попытка
	
		ТаблицаОбъектовРемонта = Новый ТаблицаЗначений;
		ТаблицаОбъектовРемонта.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Строка"));
		ТаблицаОбъектовРемонта.Колонки.Добавить("ДатаОкончания", Новый ОписаниеТипов("Дата"));
		ТаблицаОбъектовРемонта.Колонки.Добавить("ДатаНачала", Новый ОписаниеТипов("Дата"));
		ТаблицаОбъектовРемонта.Колонки.Добавить("ОбъектРемонта", Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта"));
		ТаблицаОбъектовРемонта.Колонки.Добавить("ПричинаПростоя", Новый ОписаниеТипов("СправочникСсылка.торо_ПричиныПростояОборудования"));
		ТаблицаОбъектовРемонта.Колонки.Добавить("ИзменятьСостояниеПодчиненныхОР", Новый ОписаниеТипов("Булево"));
		ТаблицаОбъектовРемонта.Колонки.Добавить("ВидЭксплуатации", Новый ОписаниеТипов("СправочникСсылка.торо_ВидыЭксплуатации"));
		ТаблицаОбъектовРемонта.Колонки.Добавить("ВидПуска", Новый ОписаниеТипов("СправочникСсылка.торо_ВидыПусковОР"));
		ТаблицаОбъектовРемонта.Колонки.Добавить("ВидЭксплуатацииНаПериод", Новый ОписаниеТипов("СправочникСсылка.торо_ВидыЭксплуатации"));
		ТаблицаОбъектовРемонта.Колонки.Добавить("ВидПускаНаПериод", Новый ОписаниеТипов("СправочникСсылка.торо_ВидыПусковОР"));
		ТаблицаОбъектовРемонта.Колонки.Добавить("Иерархия", Новый ОписаниеТипов("СправочникСсылка.торо_СтруктурыОР"));
		ТаблицаОбъектовРемонта.Колонки.Добавить("ВнешнийОР", Новый ОписаниеТипов("Булево"));
		ТаблицаОбъектовРемонта.Колонки.Добавить("Примечание", Новый ОписаниеТипов("Строка"));
		ТаблицаОбъектовРемонта.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ДокументСсылка.торо_СостоянияОбъектовРемонта"));
		
		ТаблицаОбъектовРемонтаНаПериод = ТаблицаОбъектовРемонта.СкопироватьКолонки();
		 
		ТекстЗапроса =
			"ВЫБРАТЬ
			|	торо_СостоянияОбъектовРемонтаОбъектыРемонта.Ссылка КАК Ссылка,
			|	торо_СостоянияОбъектовРемонтаОбъектыРемонта.НомерСтроки КАК НомерСтроки,
			|	торо_СостоянияОбъектовРемонтаОбъектыРемонта.ДатаОкончания КАК ДатаОкончания,
			|	торо_СостоянияОбъектовРемонтаОбъектыРемонта.ДатаНачала КАК ДатаНачала,
			|	торо_СостоянияОбъектовРемонтаОбъектыРемонта.ОбъектРемонта КАК ОбъектРемонта,
			|	торо_СостоянияОбъектовРемонтаОбъектыРемонта.ПричинаПростоя КАК ПричинаПростоя,
			|	торо_СостоянияОбъектовРемонтаОбъектыРемонта.ИзменятьСостояниеПодчиненныхОР КАК ИзменятьСостояниеПодчиненныхОР,
			|	торо_СостоянияОбъектовРемонтаОбъектыРемонта.ВидЭксплуатации КАК ВидЭксплуатации,
			|	торо_СостоянияОбъектовРемонтаОбъектыРемонта.ВидПуска КАК ВидПуска,
			|	торо_СостоянияОбъектовРемонтаОбъектыРемонта.ВидЭксплуатацииНаПериод КАК ВидЭксплуатацииНаПериод,
			|	торо_СостоянияОбъектовРемонтаОбъектыРемонта.ВидПускаНаПериод КАК ВидПускаНаПериод,
			|	торо_СостоянияОбъектовРемонтаОбъектыРемонта.Иерархия КАК Иерархия,
			|	торо_СостоянияОбъектовРемонтаОбъектыРемонта.ВнешнийОР КАК ВнешнийОР,
			|	торо_СостоянияОбъектовРемонтаОбъектыРемонта.Примечание КАК Примечание,
			|	торо_СостоянияОбъектовРемонта.Дата КАК Дата
			|ИЗ
			|	Документ.торо_СостоянияОбъектовРемонта.ОбъектыРемонта КАК торо_СостоянияОбъектовРемонтаОбъектыРемонта
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_СостоянияОбъектовРемонта КАК торо_СостоянияОбъектовРемонта
			|		ПО торо_СостоянияОбъектовРемонтаОбъектыРемонта.Ссылка = торо_СостоянияОбъектовРемонта.Ссылка
			|		И торо_СостоянияОбъектовРемонта.ВидОперации = &ВидОперации
			|ГДЕ
			|	торо_СостоянияОбъектовРемонта.Проведен = ИСТИНА";
			
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		
		// Вид эксплуатации
		Запрос.УстановитьПараметр("ВидОперации", Перечисления.торо_ВидыОперацийОтклоненияВРаботеОборудования.ВидЭксплуатации);
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		ПолучитьТаблицуОбъектовРемонта(ТаблицаОбъектовРемонта, РезультатЗапроса);
		ПредыдущиеЭксплуатации = ОпределитьСостоянияОбъектов(ТаблицаОбъектовРемонта, ТаблицаОбъектовРемонта.ВыгрузитьКолонку("ОбъектРемонта"));
		ТаблицаВремяНахожденияВСостоянии = ОпределитьВремяНахожденияВСостоянии(ТаблицаОбъектовРемонта, ПредыдущиеЭксплуатации);
		ДобавитьЗаписиВРегистр(ТаблицаВремяНахожденияВСостоянии);
		
		// Вид эксплуатации на период
		Запрос.УстановитьПараметр("ВидОперации", Перечисления.торо_ВидыОперацийОтклоненияВРаботеОборудования.ВидЭксплуатацииНаПериод);
		РезультатЗапросаНаПериод = Запрос.Выполнить().Выгрузить();
		
		ПолучитьТаблицуОбъектовРемонта(ТаблицаОбъектовРемонтаНаПериод, РезультатЗапросаНаПериод);
		ПредыдущиеЭксплуатацииНаПериод = ОпределитьСостоянияОбъектов(ТаблицаОбъектовРемонтаНаПериод, ТаблицаОбъектовРемонтаНаПериод.ВыгрузитьКолонку("ОбъектРемонта"), Истина);
		ТаблицаВремяНахожденияВСостоянииНаПериод = ОпределитьВремяНахожденияВСостоянии(ТаблицаОбъектовРемонтаНаПериод, ПредыдущиеЭксплуатацииНаПериод);
		ДобавитьЗаписиВРегистр(ТаблицаВремяНахожденияВСостоянииНаПериод);
		
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
									,,НСтр("es='¡El registro de la acumulación ""el Tiempo de la posición en el estado"" no es renovado! Por la causa: ';ru='Регистр накопления ""Время нахождения в состоянии"" НЕ обновлен! По причине: ';en='Accumulation register ""Time in state"" is NOT updated! Due to: '") + ОписаниеОшибки);
	КонецПопытки;   
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;

КонецПроцедуры

Процедура ПолучитьТаблицуОбъектовРемонта(ТаблицаОбъектовРемонта, ОбъектыРемонта)	
	
	Для каждого ТекСтрока из ОбъектыРемонта Цикл
		Если НЕ ТекСтрока.ИзменятьСостояниеПодчиненныхОР Тогда
			НС = ТаблицаОбъектовРемонта.Добавить();
			ЗаполнитьЗначенияСвойств(НС , ТекСтрока);
			
		Иначе
			
			СтруктураПоиска = Новый Структура();
			
			СтруктураПоиска.Вставить("ОбъектРемонта",			ТекСтрока.ОбъектРемонта);
			СтруктураПоиска.Вставить("ДатаНачала",				ТекСтрока.ДатаНачала);
			СтруктураПоиска.Вставить("ДатаОкончания",			ТекСтрока.ДатаОкончания);
			СтруктураПоиска.Вставить("ПричинаПростоя",			ТекСтрока.ПричинаПростоя);
			СтруктураПоиска.Вставить("ВидЭксплуатации",			ТекСтрока.ВидЭксплуатации);
			СтруктураПоиска.Вставить("ВидЭксплуатацииНаПериод",	ТекСтрока.ВидЭксплуатацииНаПериод);
			СтруктураПоиска.Вставить("ВидПуска",				ТекСтрока.ВидПуска);
			СтруктураПоиска.Вставить("ВидПускаНаПериод",		ТекСтрока.ВидПускаНаПериод);
						
			Если ТаблицаОбъектовРемонта.НайтиСтроки(СтруктураПоиска).Количество() Тогда
				Продолжить;
			КонецЕсли;	
			
			НС = ТаблицаОбъектовРемонта.Добавить();
			ЗаполнитьЗначенияСвойств(НС , ТекСтрока);
			
			МассивПодчиненных = торо_РаботаСИерархией20.ПолучитьМассивПодчиненныхОбъектов(ТекСтрока.ОбъектРемонта, ТекСтрока.Иерархия, ТекСтрока.Дата);
			
			Для Каждого ЭлементСписка Из МассивПодчиненных Цикл
				
				   СтруктураПоиска = Новый Структура();
					
					СтруктураПоиска.Вставить("ОбъектРемонта",			ЭлементСписка);
					СтруктураПоиска.Вставить("ДатаНачала",				ТекСтрока.ДатаНачала);
					СтруктураПоиска.Вставить("ДатаОкончания",			ТекСтрока.ДатаОкончания);
					СтруктураПоиска.Вставить("ПричинаПростоя",			ТекСтрока.ПричинаПростоя);
					СтруктураПоиска.Вставить("ВидЭксплуатации",			ТекСтрока.ВидЭксплуатации);
					СтруктураПоиска.Вставить("ВидЭксплуатацииНаПериод",	ТекСтрока.ВидЭксплуатацииНаПериод);
					СтруктураПоиска.Вставить("ВидПуска",				ТекСтрока.ВидПуска);
					СтруктураПоиска.Вставить("ВидПускаНаПериод",		ТекСтрока.ВидПускаНаПериод);
					
					Если ТаблицаОбъектовРемонта.НайтиСтроки(СтруктураПоиска).Количество() Тогда
						Продолжить;
					КонецЕсли;	
					
					НС = ТаблицаОбъектовРемонта.Добавить();
					
					ЗаполнитьЗначенияСвойств(НС , ТекСтрока);
					НС.ОбъектРемонта		 	= ЭлементСписка;
					
			КонецЦикла;	
 				
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция	ОпределитьСостоянияОбъектов(ТаблицаОбъектовРемонта, СписокОР, ВидЭксплуатацииНаПериод = Ложь) 
	
	Если ВидЭксплуатацииНаПериод Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВременнаяТаблица.ОбъектРемонта КАК ОбъектРемонта,
			|	ВременнаяТаблица.ДатаНачала КАК ДатаНачала,
			|	ВременнаяТаблица.ДатаОкончания КАК ДатаОкончания,
			|	ВременнаяТаблица.ВидЭксплуатации КАК ВидЭксплуатации,
			|	ВременнаяТаблица.ВидЭксплуатацииНаПериод КАК ВидЭксплуатацииНаПериод,
			|	ВременнаяТаблица.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ ТаблицаОбъектовРемонта
			|ИЗ
			|	&ТаблицаОР КАК ВременнаяТаблица
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ОбъектРемонта
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВременнаяТаблица.ОбъектРемонта КАК ОбъектРемонта,
			|	ВременнаяТаблица.ДатаНачала КАК ДатаНачала,
			|	ВременнаяТаблица.ДатаОкончания КАК ДатаОкончания,
			|	ВременнаяТаблица.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ ТаблицаОбъектовРемонтаДляЗаполнения
			|ИЗ
			|	ТаблицаОбъектовРемонта КАК ВременнаяТаблица
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ОбъектРемонта
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаОбъектыРемонта.ОбъектРемонта КАК ОбъектРемонта,
			|	ТаблицаОбъектыРемонта.ДатаНачала КАК Период,
			|	ТаблицаОбъектыРемонта.ВидЭксплуатацииНаПериод КАК ВидЭксплуатации
			|ПОМЕСТИТЬ ТаблицаПроведенияНачало
			|ИЗ
			|	ТаблицаОбъектовРемонта КАК ТаблицаОбъектыРемонта
			|ГДЕ
			|	ТаблицаОбъектыРемонта.ВидЭксплуатацииНаПериод <> ЗНАЧЕНИЕ(Справочник.торо_ВидыЭксплуатации.ПустаяСсылка)
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ОбъектРемонта,
			|	Период
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ТаблицаОбъектыРемонта.ОбъектРемонта КАК ОбъектРемонта,
			|	ТаблицаОбъектыРемонта.ДатаОкончания КАК Дата,
			|	ТаблицаОбъектыРемонта.ВидЭксплуатации КАК ВидЭксплуатации
			|ПОМЕСТИТЬ ТаблицаПредыдущиеЭксплуатации
			|ИЗ
			|	ТаблицаОбъектовРемонта КАК ТаблицаОбъектыРемонта
			|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПроведенияНачало КАК ТаблицаПроведенияНачало
			|		ПО ТаблицаОбъектыРемонта.ОбъектРемонта = ТаблицаПроведенияНачало.ОбъектРемонта
			|			И ТаблицаОбъектыРемонта.ДатаОкончания = ТаблицаПроведенияНачало.Период
			|ГДЕ
			|	ТаблицаПроведенияНачало.Период ЕСТЬ NULL
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ТаблицаОбъектыРемонта.ОбъектРемонта,
			|	ТаблицаОбъектыРемонта.Период,
			|	ТаблицаОбъектыРемонта.ВидЭксплуатации
			|ИЗ
			|	ТаблицаПроведенияНачало КАК ТаблицаОбъектыРемонта
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ТаблицаРегистрСведений.ОбъектРемонта,
			|	ТаблицаРегистрСведений.Период,
			|	ТаблицаРегистрСведений.ВидЭксплуатации
			|ИЗ
			|	ТаблицаОбъектовРемонта КАК ТаблицаОбъектыРемонта
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ТекущееСостояниеОР КАК ТаблицаРегистрСведений
			|		ПО ТаблицаОбъектыРемонта.ОбъектРемонта = ТаблицаРегистрСведений.ОбъектРемонта
			|			И (ТаблицаРегистрСведений.Период < ТаблицаОбъектыРемонта.ДатаНачала
			|				ИЛИ ТаблицаРегистрСведений.Период > ТаблицаОбъектыРемонта.ДатаОкончания)
			|ГДЕ
			|	ТаблицаРегистрСведений.ОбъектРемонта В(&ОР)
			|	И ТаблицаРегистрСведений.Регистратор <> ТаблицаОбъектыРемонта.Ссылка
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ОбъектРемонта,
			|	Дата
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаОбъектовРемонта.ОбъектРемонта КАК ОбъектРемонта,
			|	ТаблицаОбъектовРемонта.ДатаНачала КАК ДатаНачала,
			|	ТаблицаОбъектовРемонта.ДатаОкончания КАК ДатаОкончания,
			|	МАКСИМУМ(ТаблицаПредыдущиеЭксплуатации.Дата) КАК ДатаСреза1,
			|	ТаблицаОбъектовРемонта.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ ТаблицаСреза1
			|ИЗ
			|	ТаблицаОбъектовРемонтаДляЗаполнения КАК ТаблицаОбъектовРемонта
			|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПредыдущиеЭксплуатации КАК ТаблицаПредыдущиеЭксплуатации
			|		ПО (ТаблицаПредыдущиеЭксплуатации.Дата < ТаблицаОбъектовРемонта.ДатаНачала)
			|			И (ТаблицаПредыдущиеЭксплуатации.ОбъектРемонта = ТаблицаОбъектовРемонта.ОбъектРемонта)
			|
			|СГРУППИРОВАТЬ ПО
			|	ТаблицаОбъектовРемонта.ОбъектРемонта,
			|	ТаблицаОбъектовРемонта.ДатаНачала,
			|	ТаблицаОбъектовРемонта.ДатаОкончания,
			|	ТаблицаОбъектовРемонта.Ссылка
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ОбъектРемонта,
			|	ДатаСреза1
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаОбъектовРемонта.ОбъектРемонта КАК ОбъектРемонта,
			|	ТаблицаОбъектовРемонта.ДатаНачала КАК ДатаНачала,
			|	ТаблицаОбъектовРемонта.ДатаОкончания КАК ДатаОкончания,
			|	ТаблицаОбъектовРемонта.ДатаСреза1 КАК ДатаСреза1,
			|	МАКСИМУМ(ТаблицаПредыдущиеЭксплуатации.Дата) КАК ДатаСреза2,
			|	ТаблицаОбъектовРемонта.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ ТаблицаСреза
			|ИЗ
			|	ТаблицаСреза1 КАК ТаблицаОбъектовРемонта
			|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПредыдущиеЭксплуатации КАК ТаблицаПредыдущиеЭксплуатации
			|		ПО (ТаблицаПредыдущиеЭксплуатации.Дата < ТаблицаОбъектовРемонта.ДатаОкончания)
			|			И (ТаблицаПредыдущиеЭксплуатации.ОбъектРемонта = ТаблицаОбъектовРемонта.ОбъектРемонта)
			|
			|СГРУППИРОВАТЬ ПО
			|	ТаблицаОбъектовРемонта.ОбъектРемонта,
			|	ТаблицаОбъектовРемонта.ДатаНачала,
			|	ТаблицаОбъектовРемонта.ДатаОкончания,
			|	ТаблицаОбъектовРемонта.ДатаСреза1,
			|	ТаблицаОбъектовРемонта.Ссылка
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ОбъектРемонта,
			|	ДатаСреза1
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаОбъектовРемонта.ОбъектРемонта КАК ОбъектРемонта,
			|	ТаблицаОбъектовРемонта.ДатаНачала КАК ДатаНачала,
			|	ТаблицаОбъектовРемонта.ДатаОкончания КАК ДатаОкончания,
			|	ТаблицаОбъектовРемонта.ДатаСреза1 КАК ДатаСреза1,
			|	ТаблицаОбъектовРемонта.ДатаСреза2 КАК ДатаСреза2,
			|	ТаблицаПредыдущиеЭксплуатации.ВидЭксплуатации КАК ВидЭксплуатации1,
			|	ТаблицаОбъектовРемонта.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ ТаблицаЭксплутации1
			|ИЗ
			|	ТаблицаСреза КАК ТаблицаОбъектовРемонта
			|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПредыдущиеЭксплуатации КАК ТаблицаПредыдущиеЭксплуатации
			|		ПО (ТаблицаПредыдущиеЭксплуатации.Дата = ТаблицаОбъектовРемонта.ДатаСреза1)
			|			И (ТаблицаПредыдущиеЭксплуатации.ОбъектРемонта = ТаблицаОбъектовРемонта.ОбъектРемонта)
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ОбъектРемонта,
			|	ДатаСреза2
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ТаблицаОбъектовРемонта.ОбъектРемонта КАК ОбъектРемонта,
			|	ТаблицаОбъектовРемонта.ДатаНачала КАК ДатаНачала,
			|	ТаблицаОбъектовРемонта.ДатаОкончания КАК ДатаОкончания,
			|	ЕСТЬNULL(ТаблицаОбъектовРемонта.ДатаСреза1, ВЫРАЗИТЬ(ТаблицаОбъектовРемонта.ОбъектРемонта КАК Справочник.торо_ОбъектыРемонта).ДатаВводаВЭксплуатацию) КАК ДатаСреза1,
			|	ЕСТЬNULL(ТаблицаОбъектовРемонта.ДатаСреза2, ВЫРАЗИТЬ(ТаблицаОбъектовРемонта.ОбъектРемонта КАК Справочник.торо_ОбъектыРемонта).ДатаВводаВЭксплуатацию) КАК ДатаСреза2,
			|	ТаблицаОбъектовРемонта.ВидЭксплуатации1 КАК ВидЭксплуатации1,
			|	ТаблицаПредыдущиеЭксплуатации.ВидЭксплуатации КАК ВидЭксплуатации2,
			|	ЗНАЧЕНИЕ(Справочник.торо_ПричиныПростояОборудования.ПустаяСсылка) КАК ПричинаПростоя,
			|	ТаблицаОбъектовРемонта.Ссылка КАК Ссылка
			|ИЗ
			|	ТаблицаЭксплутации1 КАК ТаблицаОбъектовРемонта
			|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПредыдущиеЭксплуатации КАК ТаблицаПредыдущиеЭксплуатации
			|		ПО (ТаблицаПредыдущиеЭксплуатации.Дата = ТаблицаОбъектовРемонта.ДатаСреза2)
			|			И (ТаблицаПредыдущиеЭксплуатации.ОбъектРемонта = ТаблицаОбъектовРемонта.ОбъектРемонта)";
		
		Запрос.УстановитьПараметр("ТаблицаОР",ТаблицаОбъектовРемонта);
		Запрос.УстановитьПараметр("ОР",СписокОР);
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВременнаяТаблица.ОбъектРемонта КАК ОбъектРемонта,
			|	ВременнаяТаблица.ДатаНачала КАК ДатаНачала,
			|	ВременнаяТаблица.ДатаОкончания КАК ДатаОкончания,
			|	ВременнаяТаблица.ВидЭксплуатации КАК ВидЭксплуатации,
			|	ВременнаяТаблица.ПричинаПростоя КАК ПричинаПростоя,
			|	ВременнаяТаблица.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ ТаблицаОбъектовРемонта
			|ИЗ
			|	&ТаблицаОР КАК ВременнаяТаблица
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ОбъектРемонта,
			|	ДатаОкончания
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаРегистрСведений.ОбъектРемонта КАК ОбъектРемонта,
			|	МАКСИМУМ(ТаблицаРегистрСведений.Период) КАК Период,
			|	ТаблицаОбъектовРемонта.ДатаОкончания КАК ДатаОкончания,
			|	ТаблицаОбъектовРемонта.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ ПериодыПредшествующихЭксплуатацийМакс
			|ИЗ
			|	ТаблицаОбъектовРемонта КАК ТаблицаОбъектовРемонта
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ТекущееСостояниеОР КАК ТаблицаРегистрСведений
			|		ПО ТаблицаОбъектовРемонта.ОбъектРемонта = ТаблицаРегистрСведений.ОбъектРемонта
			|			И (ТаблицаРегистрСведений.Период < ТаблицаОбъектовРемонта.ДатаОкончания)
			|ГДЕ
			|	ТаблицаРегистрСведений.Регистратор <> ТаблицаОбъектовРемонта.Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ТаблицаРегистрСведений.ОбъектРемонта,
			|	ТаблицаОбъектовРемонта.ДатаОкончания,
			|	ТаблицаОбъектовРемонта.Ссылка
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ОбъектРемонта,
			|	Период
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ПериодыПредшествующихЭксплуатацийМакс.ОбъектРемонта КАК ОбъектРемонта,
			|	торо_ТекущееСостояниеОР.ВидЭксплуатации КАК ВидЭксплуатации,
			|	торо_ТекущееСостояниеОР.Период КАК Период,
			|	ПериодыПредшествующихЭксплуатацийМакс.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ ТабРегистра
			|ИЗ
			|	ПериодыПредшествующихЭксплуатацийМакс КАК ПериодыПредшествующихЭксплуатацийМакс
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ТекущееСостояниеОР КАК торо_ТекущееСостояниеОР
			|		ПО ПериодыПредшествующихЭксплуатацийМакс.ОбъектРемонта = торо_ТекущееСостояниеОР.ОбъектРемонта
			|			И ПериодыПредшествующихЭксплуатацийМакс.Период = торо_ТекущееСостояниеОР.Период
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ОбъектРемонта,
			|	Период
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаОбъектовРемонта.ОбъектРемонта КАК ОбъектРемонта,
			|	ТаблицаОбъектовРемонта.ДатаОкончания КАК Период,
			|	ТаблицаОбъектовРемонта.ВидЭксплуатации КАК ВидЭксплуатации,
			|	ТаблицаОбъектовРемонта.ПричинаПростоя КАК ПричинаПростоя,
			|	ТаблицаОбъектовРемонта.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ ТабРегистраСведений
			|ИЗ
			|	ТаблицаОбъектовРемонта КАК ТаблицаОбъектовРемонта
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ТабРегистра.ОбъектРемонта,
			|	ТабРегистра.Период,
			|	ТабРегистра.ВидЭксплуатации,
			|	торо_ОстановленноеОборудование.ПричинаПростоя,
			|	ТабРегистра.Ссылка
			|ИЗ
			|	ТабРегистра КАК ТабРегистра
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.торо_ОстановленноеОборудование КАК торо_ОстановленноеОборудование
			|		ПО ТабРегистра.ОбъектРемонта = торо_ОстановленноеОборудование.ОбъектРемонта
			|			И ТабРегистра.Период = торо_ОстановленноеОборудование.Период
			|			И (торо_ОстановленноеОборудование.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ОбъектРемонта,
			|	Период
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ТабРегистра.Период КАК ДатаНачала,
			|	МИНИМУМ(ТабРегистра1.Период) КАК ДатаОкончания,
			|	ТабРегистра.ОбъектРемонта КАК ОбъектРемонта,
			|	ТабРегистра.ВидЭксплуатации КАК ВидЭксплуатации1,
			|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ДатаСреза1,
			|	ТабРегистра.Период КАК ДатаСреза2,
			|	ТабРегистра.ВидЭксплуатации КАК ВидЭксплуатации2,
			|	ТабРегистра.ПричинаПростоя КАК ПричинаПростоя,
			|	ТабРегистра.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ ИтоговыеСостояния
			|ИЗ
			|	ТабРегистраСведений КАК ТабРегистра
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабРегистраСведений КАК ТабРегистра1
			|		ПО ТабРегистра.ОбъектРемонта = ТабРегистра1.ОбъектРемонта
			|			И ТабРегистра.Период < ТабРегистра1.Период
			|
			|СГРУППИРОВАТЬ ПО
			|	ТабРегистра.Период,
			|	ТабРегистра.ОбъектРемонта,
			|	ТабРегистра.ВидЭксплуатации,
			|	ТабРегистра.ПричинаПростоя,
			|	ТабРегистра.Ссылка,
			|	ТабРегистра.Период,
			|	ТабРегистра.ВидЭксплуатации
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ОбъектРемонта,
			|	ДатаОкончания
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ИтоговыеСостояния.ДатаНачала КАК ДатаНачала,
			|	ИтоговыеСостояния.ДатаОкончания КАК ДатаОкончания,
			|	ИтоговыеСостояния.ОбъектРемонта КАК ОбъектРемонта,
			|	ИтоговыеСостояния.ВидЭксплуатации1 КАК ВидЭксплуатации1,
			|	ИтоговыеСостояния.ДатаСреза1 КАК ДатаСреза1,
			|	ИтоговыеСостояния.ДатаСреза2 КАК ДатаСреза2,
			|	ИтоговыеСостояния.ВидЭксплуатации2 КАК ВидЭксплуатации2,
			|	ИтоговыеСостояния.ПричинаПростоя КАК ПричинаПростоя,
			|	ТаблицаОбъектовРемонта.Ссылка КАК Ссылка
			|ИЗ
			|	ИтоговыеСостояния КАК ИтоговыеСостояния
			|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОбъектовРемонта КАК ТаблицаОбъектовРемонта
			|		ПО ИтоговыеСостояния.ОбъектРемонта = ТаблицаОбъектовРемонта.ОбъектРемонта
			|			И ИтоговыеСостояния.ДатаОкончания = ТаблицаОбъектовРемонта.ДатаОкончания
			|ГДЕ
			|	НЕ ТаблицаОбъектовРемонта.Ссылка ЕСТЬ NULL
			|
			|СГРУППИРОВАТЬ ПО
			|	ИтоговыеСостояния.ДатаНачала,
			|	ИтоговыеСостояния.ДатаОкончания,
			|	ИтоговыеСостояния.ОбъектРемонта,
			|	ИтоговыеСостояния.ВидЭксплуатации1,
			|	ИтоговыеСостояния.ВидЭксплуатации2,
			|	ИтоговыеСостояния.ДатаСреза1,
			|	ИтоговыеСостояния.ДатаСреза2,
			|	ИтоговыеСостояния.ПричинаПростоя,
			|	ТаблицаОбъектовРемонта.Ссылка";
		
		Запрос.УстановитьПараметр("ТаблицаОР",ТаблицаОбъектовРемонта);
		Запрос.УстановитьПараметр("ОР",ТаблицаОбъектовРемонта.ВыгрузитьКолонку("ОбъектРемонта"));
		
	КонецЕсли;
	
	Таб = Запрос.Выполнить().Выгрузить();
	
	Возврат Таб;
	
КонецФункции

Функция ОпределитьВремяНахожденияВСостоянии(ТаблицаОбъектовРемонта, ПредыдущиеЭксплуатации)
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.Календари"));
	
	Если ПредыдущиеЭксплуатации.Колонки.Найти("ПлановыйГрафикРаботы") = Неопределено Тогда
		ПредыдущиеЭксплуатации.Колонки.Добавить("ПлановыйГрафикРаботы", Новый ОписаниеТипов(МассивТипов));
	КонецЕсли;
	
	Для Каждого СтрокаТО Из ПредыдущиеЭксплуатации Цикл
		
		СтрокаТО.ПлановыйГрафикРаботы = СтрокаТО.ОбъектРемонта.ПлановыйГрафикРаботы;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаОбъектовРемонта.ОбъектРемонта,
		|	ТаблицаОбъектовРемонта.ДатаНачала,
		|	ТаблицаОбъектовРемонта.ДатаОкончания,
		|	ТаблицаОбъектовРемонта.ДатаСреза1,
		|	ТаблицаОбъектовРемонта.ДатаСреза2,
		|	ТаблицаОбъектовРемонта.ВидЭксплуатации1,
		|	ТаблицаОбъектовРемонта.ВидЭксплуатации2,
		|	ТаблицаОбъектовРемонта.ПлановыйГрафикРаботы,
		|	ТаблицаОбъектовРемонта.ПричинаПростоя,
		|	ТаблицаОбъектовРемонта.Ссылка
		|ПОМЕСТИТЬ ИсходныеДанные
		|ИЗ
		|	&ПредыдущиеЭксплуатации КАК ТаблицаОбъектовРемонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаОбъектовРемонта.ОбъектРемонта,
		|	ТаблицаОбъектовРемонта.ДатаНачала КАК ДатаОкончания,
		|	ТаблицаОбъектовРемонта.ДатаСреза1 КАК ДатаНачала,
		|	ТаблицаОбъектовРемонта.ВидЭксплуатации1 КАК ВидЭксплуатации,
		|	ТаблицаОбъектовРемонта.ПлановыйГрафикРаботы,
		|	ТаблицаОбъектовРемонта.ПричинаПростоя,
		|	ТаблицаОбъектовРемонта.Ссылка
		|ИЗ
		|	ИсходныеДанные КАК ТаблицаОбъектовРемонта
		|ГДЕ
		|	ТаблицаОбъектовРемонта.ДатаНачала > ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|	И ТаблицаОбъектовРемонта.ДатаСреза1 > ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|	И ТаблицаОбъектовРемонта.ВидЭксплуатации1.ТипЭксплуатации = ЗНАЧЕНИЕ(Перечисление.торо_ТипЭксплуатации.Эксплуатация)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ТаблицаОбъектовРемонта.ОбъектРемонта,
		|	ТаблицаОбъектовРемонта.ДатаОкончания,
		|	ТаблицаОбъектовРемонта.ДатаСреза2,
		|	ТаблицаОбъектовРемонта.ВидЭксплуатации2,
		|	ТаблицаОбъектовРемонта.ПлановыйГрафикРаботы,
		|	ТаблицаОбъектовРемонта.ПричинаПростоя,
		|	ТаблицаОбъектовРемонта.Ссылка
		|ИЗ
		|	ИсходныеДанные КАК ТаблицаОбъектовРемонта
		|ГДЕ
		|	ТаблицаОбъектовРемонта.ДатаОкончания > ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|	И ТаблицаОбъектовРемонта.ДатаСреза2 > ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|	И ТаблицаОбъектовРемонта.ВидЭксплуатации2.ТипЭксплуатации = ЗНАЧЕНИЕ(Перечисление.торо_ТипЭксплуатации.Эксплуатация)";
				   
				   
	Запрос.УстановитьПараметр("ПредыдущиеЭксплуатации", ПредыдущиеЭксплуатации);
	ВремяНахожденияВСостоянии = Запрос.Выполнить().Выгрузить();
	
	ВременнаяТаблица = СоздатьТаблицуЧасовСохранениеЭксплуатации(ВремяНахожденияВСостоянии);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаОбъектыРемонта.ОбъектРемонта КАК ОбъектРемонта,
		|	ТаблицаОбъектыРемонта.ДатаНачала КАК ДатаНачала,
		|	ТаблицаОбъектыРемонта.ДатаОкончания КАК ДатаОкончания,
		|	ТаблицаОбъектыРемонта.ПричинаПростоя
		|ПОМЕСТИТЬ ТаблицаОР
		|ИЗ
		|	&ТаблицаОбъектыРемонта КАК ТаблицаОбъектыРемонта
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОбъектРемонта,
		|	ДатаНачала,
		|	ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблица.ОбъектРемонта КАК ОбъектРемонта,
		|	ВременнаяТаблица.Период КАК Период,
		|	ВременнаяТаблица.ВремяПростоя,
		|	ВременнаяТаблица.ДатаОкончания,
		|	ВременнаяТаблица.ВидЭксплуатации,
		|	ВременнаяТаблица.ПричинаПростоя,
		|	ВременнаяТаблица.Ссылка
		|ПОМЕСТИТЬ ТаблицаВременПростоя
		|ИЗ
		|	&ВременнаяТаблица КАК ВременнаяТаблица
		|ИНДЕКСИРОВАТЬ ПО
		|	ОбъектРемонта,
		|	Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаВременПростоя.ОбъектРемонта КАК ОбъектРемонта,
		|	ТаблицаВременПростоя.Период КАК Период,
		|	ТаблицаВременПростоя.ВремяПростоя,
		|	ТаблицаВременПростоя.ДатаОкончания,
		|	ТаблицаВременПростоя.ВидЭксплуатации,
		|	ТаблицаВременПростоя.Ссылка,
		|	ТаблицаОР.ДатаОкончания КАК ДатаОкончания1,
		|	ВЫБОР
		|		КОГДА ТаблицаВременПростоя.ПричинаПростоя <> ЗНАЧЕНИЕ(Справочник.торо_ПричиныПростояОборудования.ПустаяСсылка)
		|			ТОГДА ТаблицаВременПростоя.ПричинаПростоя
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ТаблицаВременПростоя.Период = ТаблицаОР.ДатаНачала
		|					ТОГДА ТаблицаОР.ПричинаПростоя
		|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.торо_ПричиныПростояОборудования.ПустаяСсылка)
		|			КОНЕЦ
		|	КОНЕЦ КАК ПричинаПростоя,
		|	ТаблицаОР.ДатаНачала
		|ПОМЕСТИТЬ ТаблицаВременПростояСДатамиИсходногоИнтервала
		|ИЗ
		|	ТаблицаВременПростоя КАК ТаблицаВременПростоя
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОР КАК ТаблицаОР
		|		ПО ТаблицаВременПростоя.ОбъектРемонта = ТаблицаОР.ОбъектРемонта
		|			И ТаблицаВременПростоя.Период >= ТаблицаОР.ДатаНачала
		|			И ТаблицаВременПростоя.Период < ТаблицаОР.ДатаОкончания
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОбъектРемонта,
		|	Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаВременПростоя.ОбъектРемонта КАК ОбъектРемонта,
		|	ТаблицаВременПростоя.Период КАК Период,
		|	ТаблицаВременПростоя.ВремяПростоя,
		|	ТаблицаВременПростоя.ДатаОкончания,
		|	ТаблицаВременПростоя.ВидЭксплуатации,
		|	ТаблицаВременПростоя.ДатаОкончания1 КАК ДатаОкончания1,
		|	ВЫБОР
		|		КОГДА ТаблицаВременПростоя.ПричинаПростоя = ЗНАЧЕНИЕ(Справочник.торо_ПричиныПростояОборудования.ПустаяСсылка)
		|			ТОГДА ТаблицаОР.ПричинаПростоя
		|		ИНАЧЕ ТаблицаВременПростоя.ПричинаПростоя
		|	КОНЕЦ КАК ПричинаПростоя,
		|	ТаблицаВременПростоя.ДатаНачала,
		|	ТаблицаВременПростоя.Ссылка
		|ПОМЕСТИТЬ ТаблицаВременПростояСДатамиИсходногоИнтервалаДополненная
		|ИЗ
		|	ТаблицаВременПростояСДатамиИсходногоИнтервала КАК ТаблицаВременПростоя
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОР КАК ТаблицаОР
		|		ПО ТаблицаВременПростоя.ОбъектРемонта = ТаблицаОР.ОбъектРемонта
		|			И ТаблицаВременПростоя.Период = ТаблицаОР.ДатаОкончания
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОбъектРемонта,
		|	Период,
		|	ДатаОкончания1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаВременПростоя.ОбъектРемонта КАК ОбъектРемонта,
		|	ТаблицаВременПростоя.Период КАК Период,
		|	ТаблицаВременПростоя.ВремяПростоя,
		|	ТаблицаВременПростоя.ДатаОкончания КАК ДатаОкончания,
		|	ТаблицаВременПростоя.ВидЭксплуатации,
		|	МИНИМУМ(ТаблицаВременПростоя.ДатаОкончания1) КАК ДатаОкончаниямин,
		|	ТаблицаВременПростоя.Ссылка
		|ПОМЕСТИТЬ ДатаОкончанияМинимальногоИнтервала
		|ИЗ
		|	ТаблицаВременПростояСДатамиИсходногоИнтервалаДополненная КАК ТаблицаВременПростоя
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаВременПростоя.ОбъектРемонта,
		|	ТаблицаВременПростоя.Период,
		|	ТаблицаВременПростоя.ВремяПростоя,
		|	ТаблицаВременПростоя.ДатаОкончания,
		|	ТаблицаВременПростоя.ВидЭксплуатации,
		|	ТаблицаВременПростоя.Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОбъектРемонта,
		|	Период,
		|	ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДатаОкончанияМинимальногоИнтервала.ОбъектРемонта КАК ОбъектРемонта,
		|	ДатаОкончанияМинимальногоИнтервала.Период КАК Период,
		|	ДатаОкончанияМинимальногоИнтервала.ВремяПростоя,
		|	ДатаОкончанияМинимальногоИнтервала.ДатаОкончания,
		|	ДатаОкончанияМинимальногоИнтервала.ВидЭксплуатации,
		|	ДатаОкончанияМинимальногоИнтервала.Ссылка,
		|	ТаблицаВременПростояСДатамиИсходногоИнтервала.ДатаНачала,
		|	ТаблицаВременПростояСДатамиИсходногоИнтервала.ПричинаПростоя
		|ПОМЕСТИТЬ ВТ_ДанныеПоОР
		|ИЗ
		|	ДатаОкончанияМинимальногоИнтервала КАК ДатаОкончанияМинимальногоИнтервала
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаВременПростояСДатамиИсходногоИнтервалаДополненная КАК ТаблицаВременПростояСДатамиИсходногоИнтервала
		|		ПО ДатаОкончанияМинимальногоИнтервала.ОбъектРемонта = ТаблицаВременПростояСДатамиИсходногоИнтервала.ОбъектРемонта
		|			И ДатаОкончанияМинимальногоИнтервала.Период = ТаблицаВременПростояСДатамиИсходногоИнтервала.Период
		|			И ДатаОкончанияМинимальногоИнтервала.ДатаОкончаниямин = ТаблицаВременПростояСДатамиИсходногоИнтервала.ДатаОкончания1
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОбъектРемонта,
		|	Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеПоОР.ОбъектРемонта КАК ОбъектРемонта,
		|	ВТ_ДанныеПоОР.Период КАК ПериодОР,
		|	МАКСИМУМ(торо_ТекущееСостояниеОР.Период) КАК Период
		|ПОМЕСТИТЬ ВТ_СрезДат
		|ИЗ
		|	ВТ_ДанныеПоОР КАК ВТ_ДанныеПоОР
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ТекущееСостояниеОР КАК торо_ТекущееСостояниеОР
		|		ПО ВТ_ДанныеПоОР.ОбъектРемонта = торо_ТекущееСостояниеОР.ОбъектРемонта
		|			И ВТ_ДанныеПоОР.Период >= торо_ТекущееСостояниеОР.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ДанныеПоОР.ОбъектРемонта,
		|	ВТ_ДанныеПоОР.Период
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОбъектРемонта,
		|	Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_СрезДат.ОбъектРемонта КАК ОбъектРемонта,
		|	ВТ_СрезДат.ПериодОР КАК ПериодОР,
		|	торо_ТекущееСостояниеОР.ПричинаПростоя
		|ПОМЕСТИТЬ ВТ_СрезПричинПоОрам
		|ИЗ
		|	ВТ_СрезДат КАК ВТ_СрезДат
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ТекущееСостояниеОР КАК торо_ТекущееСостояниеОР
		|		ПО ВТ_СрезДат.ОбъектРемонта = торо_ТекущееСостояниеОР.ОбъектРемонта
		|			И ВТ_СрезДат.Период = торо_ТекущееСостояниеОР.Период
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОбъектРемонта,
		|	ПериодОР
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеПоОР.ОбъектРемонта,
		|	ВТ_ДанныеПоОР.Период,
		|	ВТ_ДанныеПоОР.ВремяПростоя,
		|	ВТ_ДанныеПоОР.ДатаОкончания,
		|	ВТ_ДанныеПоОР.ВидЭксплуатации,
		|	ВТ_ДанныеПоОР.ДатаНачала,
		|	ВЫБОР
		|		КОГДА ВТ_ДанныеПоОР.ПричинаПростоя <> ЗНАЧЕНИЕ(Справочник.торо_ПричиныПростояОборудования.ПустаяСсылка)
		|				ИЛИ ВТ_СрезПричинПоОрам.ПричинаПростоя ЕСТЬ NULL 
		|			ТОГДА ВТ_ДанныеПоОР.ПричинаПростоя
		|		ИНАЧЕ ВТ_СрезПричинПоОрам.ПричинаПростоя
		|	КОНЕЦ КАК ПричинаПростоя,
		|	ВТ_ДанныеПоОР.Ссылка
		|ИЗ
		|	ВТ_ДанныеПоОР КАК ВТ_ДанныеПоОР
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СрезПричинПоОрам КАК ВТ_СрезПричинПоОрам
		|		ПО ВТ_ДанныеПоОР.ОбъектРемонта = ВТ_СрезПричинПоОрам.ОбъектРемонта
		|			И ВТ_ДанныеПоОР.Период = ВТ_СрезПричинПоОрам.ПериодОР";
	
	Запрос.УстановитьПараметр("ТаблицаОбъектыРемонта",ТаблицаОбъектовРемонта);
	Запрос.УстановитьПараметр("ВременнаяТаблица",ВременнаяТаблица);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция СоздатьТаблицуЧасовСохранениеЭксплуатации(ТаблицаПериодовПростоя)
	
	Если ТаблицаПериодовПростоя.Количество() Тогда
		
		МенеджерВТ = Новый МенеджерВременныхТаблиц;
		
		МассивГрафиков = ТаблицаПериодовПростоя.ВыгрузитьКолонку("ПлановыйГрафикРаботы");
		
		ТаблицаПериодовПростоя.Сортировать("ДатаНачала Возр");
		
		МинДата = ТаблицаПериодовПростоя[0].ДатаНачала;
		
		ТаблицаПериодовПростоя.Сортировать("ДатаОкончания Убыв");
		
		МаксДата = ТаблицаПериодовПростоя[0].ДатаОкончания;
		
		КалендарныеГрафики.СоздатьВТРасписанияРаботыНаПериод(МенеджерВТ, МассивГрафиков, НачалоДня(МинДата), МаксДата);
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТаблицаПериодовПростоя.ОбъектРемонта КАК ОбъектРемонта,
			|	ТаблицаПериодовПростоя.ДатаНачала КАК ДатаНачала,
			|	ТаблицаПериодовПростоя.ДатаОкончания КАК ДатаОкончания,
			|	ТаблицаПериодовПростоя.ПричинаПростоя КАК ПричинаПростоя,
			|	ТаблицаПериодовПростоя.ПлановыйГрафикРаботы КАК ПлановыйГрафикРаботы,
			|	ТаблицаПериодовПростоя.ВидЭксплуатации КАК ВидЭксплуатации,
			|	ТаблицаПериодовПростоя.Ссылка
			|ПОМЕСТИТЬ ТаблицаПериодовПростоя
			|ИЗ
			|	&ТаблицаПериодовПростоя КАК ТаблицаПериодовПростоя
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ПлановыйГрафикРаботы
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТРасписанияРаботы.ГрафикРаботы КАК ГрафикРаботы,
			|	ВТРасписанияРаботы.ДатаГрафика КАК ДатаГрафика,
			|	ВТРасписанияРаботы.ВремяНачала КАК ВремяНачала,
			|	ВТРасписанияРаботы.ВремяОкончания КАК ВремяОкончания
			|ПОМЕСТИТЬ ВТРасписанияРаботыИзм
			|ИЗ
			|	ВТРасписанияРаботы КАК ВТРасписанияРаботы
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ГрафикРаботы,
			|	ДатаГрафика
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТРасписанияРаботыИзм.ГрафикРаботы КАК ГрафикРаботы,
			|	ВТРасписанияРаботыИзм.ДатаГрафика КАК ДатаГрафика,
			|	РАЗНОСТЬДАТ(ВТРасписанияРаботыИзм.ВремяНачала, ВТРасписанияРаботыИзм.ВремяОкончания, СЕКУНДА) КАК Секунды,
			|	РАЗНОСТЬДАТ(ВТРасписанияРаботыИзм.ВремяНачала, ВТРасписанияРаботыИзм.ВремяОкончания, ЧАС) КАК Часы
			|ПОМЕСТИТЬ ВремТабРаботы
			|ИЗ
			|	ВТРасписанияРаботыИзм КАК ВТРасписанияРаботыИзм
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ГрафикРаботы
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаПериодовПростоя.ОбъектРемонта КАК ОбъектРемонта,
			|	ЕСТЬNULL(ГрафикиРаботыПоСменам.Секунды, 0) КАК Секунды,
			|	ТаблицаПериодовПростоя.ДатаНачала КАК ДатаНачала,
			|	ЕСТЬNULL(ГрафикиРаботыПоСменам.Часы, 0) КАК Часы,
			|	ТаблицаПериодовПростоя.ДатаОкончания КАК ДатаОкончания,
			|	ТаблицаПериодовПростоя.ПричинаПростоя КАК ПричинаПростоя,
			|	ТаблицаПериодовПростоя.ВидЭксплуатации КАК ВидЭксплуатации,
			|	ЕСТЬNULL(ГрафикиРаботыПоСменам.ДатаГрафика, ДатаВремя(1,1,1,0,0,0)) КАК ДатаГрафика,
			|	ТаблицаПериодовПростоя.ПлановыйГрафикРаботы КАК ПлановыйГрафикРаботы,
			|	ТаблицаПериодовПростоя.Ссылка
			|ПОМЕСТИТЬ ПростойОборудованияПолныеДни
			|ИЗ
			|	ТаблицаПериодовПростоя КАК ТаблицаПериодовПростоя
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВремТабРаботы КАК ГрафикиРаботыПоСменам
			|		ПО ТаблицаПериодовПростоя.ПлановыйГрафикРаботы = ГрафикиРаботыПоСменам.ГрафикРаботы
			|			И (КОНЕЦПЕРИОДА(ТаблицаПериодовПростоя.ДатаНачала, ДЕНЬ) < ГрафикиРаботыПоСменам.ДатаГрафика)
			|			И (НАЧАЛОПЕРИОДА(ТаблицаПериодовПростоя.ДатаОкончания, ДЕНЬ) > ГрафикиРаботыПоСменам.ДатаГрафика)
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ПлановыйГрафикРаботы,
			|	ДатаГрафика
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Расписание.ГрафикРаботы КАК ГрафикРаботы,
			|	Расписание.ДатаГрафика КАК ДатаГрафика,
			|	ДОБАВИТЬКДАТЕ(Расписание.ДатаГрафика, СЕКУНДА, РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), Расписание.ВремяНачала, СЕКУНДА)) КАК НачалоРасписания,
			|	ДОБАВИТЬКДАТЕ(Расписание.ДатаГрафика, СЕКУНДА, РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), Расписание.ВремяОкончания, СЕКУНДА)) КАК КонецРасписания
			|ПОМЕСТИТЬ НеПолныеДни
			|ИЗ
			|	ВТРасписанияРаботыИзм КАК Расписание
			|		ЛЕВОЕ СОЕДИНЕНИЕ ПростойОборудованияПолныеДни КАК ПолныеДни
			|		ПО Расписание.ГрафикРаботы = ПолныеДни.ПлановыйГрафикРаботы
			|			И Расписание.ДатаГрафика = ПолныеДни.ДатаГрафика
			|ГДЕ
			|	ПолныеДни.ДатаГрафика ЕСТЬ NULL
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ГрафикРаботы
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаПериодовПростоя.ОбъектРемонта КАК ОбъектРемонта,
			|	ТаблицаПериодовПростоя.ДатаНачала КАК Период,
			|	РАЗНОСТЬДАТ(ВЫБОР
			|			КОГДА ТаблицаПериодовПростоя.ДатаНачала >= НеПолныеДни.НачалоРасписания
			|				ТОГДА ТаблицаПериодовПростоя.ДатаНачала
			|			ИНАЧЕ НеПолныеДни.НачалоРасписания
			|		КОНЕЦ, ВЫБОР
			|			КОГДА ТаблицаПериодовПростоя.ДатаОкончания >= НеПолныеДни.КонецРасписания
			|				ТОГДА НеПолныеДни.КонецРасписания
			|			ИНАЧЕ ТаблицаПериодовПростоя.ДатаОкончания
			|		КОНЕЦ, СЕКУНДА) КАК ВремяПростоя,
			|	ТаблицаПериодовПростоя.ДатаОкончания КАК ДатаОкончания,
			|	ТаблицаПериодовПростоя.ПричинаПростоя КАК ПричинаПростоя,
			|	ТаблицаПериодовПростоя.ВидЭксплуатации КАК ВидЭксплуатации,
			|	ТаблицаПериодовПростоя.Ссылка
			|ПОМЕСТИТЬ Финальная
			|ИЗ
			|	НеПолныеДни КАК НеПолныеДни
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПериодовПростоя КАК ТаблицаПериодовПростоя
			|		ПО НеПолныеДни.ГрафикРаботы = ТаблицаПериодовПростоя.ПлановыйГрафикРаботы
			|			И (НеПолныеДни.НачалоРасписания >= ТаблицаПериодовПростоя.ДатаНачала
			|					И НеПолныеДни.НачалоРасписания <= ТаблицаПериодовПростоя.ДатаОкончания
			|				ИЛИ НеПолныеДни.КонецРасписания >= ТаблицаПериодовПростоя.ДатаНачала
			|					И НеПолныеДни.КонецРасписания <= ТаблицаПериодовПростоя.ДатаОкончания
			|				ИЛИ НеПолныеДни.НачалоРасписания <= ТаблицаПериодовПростоя.ДатаНачала
			|					И НеПолныеДни.КонецРасписания >= ТаблицаПериодовПростоя.ДатаОкончания)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ПолныеДни.ОбъектРемонта,
			|	ПолныеДни.ДатаНачала,
			|	ПолныеДни.Секунды,
			|	ПолныеДни.ДатаОкончания,
			|	ПолныеДни.ПричинаПростоя,
			|	ПолныеДни.ВидЭксплуатации,
			|	ПолныеДни.Ссылка
			|ИЗ
			|	ПростойОборудованияПолныеДни КАК ПолныеДни
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Финальная.ОбъектРемонта КАК ОбъектРемонта,
			|	Финальная.Период КАК Период,
			|	СУММА(Финальная.ВремяПростоя) КАК ВремяПростоя,
			|	Финальная.ДатаОкончания КАК ДатаОкончания,
			|	Финальная.ПричинаПростоя КАК ПричинаПростоя,
			|	Финальная.ВидЭксплуатации КАК ВидЭксплуатации,
			|	Финальная.Ссылка
			|ИЗ
			|	Финальная КАК Финальная
			|
			|СГРУППИРОВАТЬ ПО
			|	Финальная.ОбъектРемонта,
			|	Финальная.Период,
			|	Финальная.ДатаОкончания,
			|	Финальная.ПричинаПростоя,
			|	Финальная.ВидЭксплуатации,
			|	Финальная.Ссылка
			|";
		
		Запрос.УстановитьПараметр("ТаблицаПериодовПростоя", ТаблицаПериодовПростоя);
		
		Возврат Запрос.Выполнить().Выгрузить();
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ТаблицаПериодовПростоя.ОбъектРемонта,
			|	ТаблицаПериодовПростоя.ДатаНачала,
			|	ТаблицаПериодовПростоя.ДатаОкончания,
			|	ТаблицаПериодовПростоя.ПричинаПростоя,
			|	ТаблицаПериодовПростоя.ПлановыйГрафикРаботы,
			|	ТаблицаПериодовПростоя.ВидЭксплуатации,
			|	ТаблицаПериодовПростоя.Ссылка
			|ПОМЕСТИТЬ ТаблицаПериодовПростоя
			|ИЗ
			|	&ТаблицаПериодовПростоя КАК ТаблицаПериодовПростоя
			|;
			|
			|ВЫБРАТЬ
			|	ТаблицаПериодовПростоя.ОбъектРемонта,
			|	ТаблицаПериодовПростоя.ДатаНачала КАК Период,
			|	0 КАК ВремяПростоя,
			|	ТаблицаПериодовПростоя.ДатаОкончания,
			|	ТаблицаПериодовПростоя.ПричинаПростоя,
			|	ТаблицаПериодовПростоя.ВидЭксплуатации,
			|	ТаблицаПериодовПростоя.Ссылка
			|ИЗ
			|	ТаблицаПериодовПростоя КАК ТаблицаПериодовПростоя";
		
		Запрос.УстановитьПараметр("ТаблицаПериодовПростоя", ТаблицаПериодовПростоя);
		Возврат Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
КонецФункции

Процедура ДобавитьЗаписиВРегистр(ТаблицаВремяНахожденияВСостоянии)
	
	Для Каждого СтрокаТЗ Из ТаблицаВремяНахожденияВСостоянии Цикл
		
		Эксплуатация = СтрокаТЗ.ВидЭксплуатации;
		
		Если ЗначениеЗаполнено(Эксплуатация) Тогда
						
			Если Эксплуатация.ТипЭксплуатации = Перечисления.торо_ТипЭксплуатации.Эксплуатация Тогда
				
				Если СтрокаТЗ.ВремяПростоя > 0 Тогда
					Движение = РегистрыНакопления.торо_ВремяНахожденияВСостоянии.СоздатьНаборЗаписей();
					Движение.Отбор.Регистратор.Установить(СтрокаТЗ.Ссылка);
					Движение.Прочитать();
					ЗаписьРегистра = Движение.Добавить();
					ЗаписьРегистра.Регистратор 					= СтрокаТЗ.Ссылка;
					ЗаписьРегистра.ВремяНахожденияВСостоянии 	= СтрокаТЗ.ВремяПростоя;
					ЗаписьРегистра.ДатаИзмененияСостояния 		= СтрокаТЗ.ДатаОкончания;
					ЗаписьРегистра.ОбъектРемонта 				= СтрокаТЗ.ОбъектРемонта;
					ЗаписьРегистра.ВидЭксплуатации 				= Эксплуатация;
					ЗаписьРегистра.Период						= СтрокаТЗ.Период;
					Движение.Записать(Истина);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновлениеДокументовПлановыхЗатрат() Экспорт 
	
	ОшибкаТранзакции = Ложь;
	НачатьТранзакцию();
	
	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		                |	торо_ПлановыеЗатраты.Ссылка КАК Ссылка
		                |ИЗ
		                |	Документ.торо_ПлановыеЗатраты КАК торо_ПлановыеЗатраты
		                |ГДЕ
		                |	торо_ПлановыеЗатраты.Проведен";
		
		Результат = Запрос.Выполнить();
		ВыборкаДокументов = Результат.Выбрать();
		
		Пока ВыборкаДокументов.Следующий() Цикл
			Док = ВыборкаДокументов.Ссылка.ПолучитьОбъект();
			Если НЕ Док = Неопределено Тогда
				Док.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
		КонецЦикла;
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	АктРМ_Мероприятия.Ссылка КАК Ссылка
		               |ИЗ
		               |	Документ.торо_АктОВыполненииРегламентногоМероприятия.Мероприятия КАК АктРМ_Мероприятия
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.торо_ПроцентВыполненныхРабот КАК торо_ПроцентВыполненныхРабот
		               |		ПО АктРМ_Мероприятия.ID = торо_ПроцентВыполненныхРабот.IDРемонта
		               |			И (торо_ПроцентВыполненныхРабот.Регистратор ССЫЛКА Документ.торо_ПлановыеЗатраты)
		               |ГДЕ
					   |    торо_ПроцентВыполненныхРабот.Регистратор ЕСТЬ NULL
		               |	И АктРМ_Мероприятия.Ссылка.Проведен
		               |
					   |СГРУППИРОВАТЬ ПО
					   |	АктРМ_Мероприятия.Ссылка";
		
		Результат = Запрос.Выполнить();
		ВыборкаАктов = Результат.Выбрать();
		
		Пока ВыборкаАктов.Следующий() Цикл
			ДокАкт = ВыборкаАктов.Ссылка.ПолучитьОбъект();
			Если НЕ ДокАкт = Неопределено Тогда
				торо_ПроцентыВыполнения.СоздатьДокументыПлановыхЗатрат(ДокАкт.Мероприятия, ДокАкт.РемонтныеРаботы, Истина);
			КонецЕсли;	
		КонецЦикла;
				
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
									,, НСтр("es='¡La renovación de los documentos ""los gastos Planificados"" no es cumplida! Por la causa: ';ru='Обновление документов ""Плановые затраты"" не выполнено! По причине: ';en='Updating planned cost documents failed! Due to: '") + ОписаниеОшибки);
	КонецПопытки;   
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновлениеРегистраСоставИерархическихТКРемонтов() Экспорт        
	
	ОшибкаТранзакции = Ложь;
	НачатьТранзакцию();
	
	Попытка
		
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		               |	торо_СоставИерархическихТехКартРемонтов.ТехКарта КАК ТехКарта
		               |ИЗ
		               |	РегистрСведений.торо_СоставИерархическихТехКартРемонтов КАК торо_СоставИерархическихТехКартРемонтов
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	торо_СоставИерархическихТехКартРемонтов.ТехКарта";
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ТехКарта = Выборка.ТехКарта.ПолучитьОбъект();
			Если НЕ ТехКарта = Неопределено Тогда
				ТехКарта.Записать();
			КонецЕсли;
		КонецЦикла;
				
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
									,, НСтр("es='¡La renovación del registro de las noticias ""la Composición de aquellas tarjetas jerárquicas de las reparaciones"" no es cumplida! Por la causa: ';ru='Обновление регистра сведений ""Состав иерархических тех карт ремонтов"" не выполнено! По причине: ';en='Updating the register of information ""Composition of hierarchical repair cards"" failed! Due to: '") + ОписаниеОшибки);
	КонецПопытки;   
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;

КонецПроцедуры

// 2.0.26.1
Процедура ПометкаНаУдалениеНаборовДопРеквизитовОР(Параметры = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НаборыДополнительныхРеквизитовИСведений.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Наборы
	|ИЗ
	|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НаборыДополнительныхРеквизитовИСведений КАК НаборыДополнительныхРеквизитовИСведений
	|		ПО торо_ОбъектыРемонта.УдалитьНаборСвойств = НаборыДополнительныхРеквизитовИСведений.Ссылка
	|			И (НаборыДополнительныхРеквизитовИСведений.ПометкаУдаления = ЛОЖЬ)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Наборы.Ссылка КАК Ссылка,
	|	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство КАК Свойство
	|ИЗ
	|	ВТ_Наборы КАК ВТ_Наборы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты
	|		ПО ВТ_Наборы.Ссылка = НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Ссылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_Наборы.Ссылка,
	|	НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Свойство
	|ИЗ
	|	ВТ_Наборы КАК ВТ_Наборы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеСведения КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения
	|		ПО ВТ_Наборы.Ссылка = НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Ссылка
	|ИТОГИ ПО
	|	Ссылка";
	
	ВыборкаНаборов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
	
	Пока ВыборкаНаборов.Следующий() Цикл
		Попытка
			НачатьТранзакцию();
			
			НаборОбъект = ВыборкаНаборов.Ссылка.ПолучитьОбъект();
			Для каждого Строка из НаборОбъект.ДополнительныеРеквизиты Цикл
				Строка.ПометкаУдаления = Истина;
			КонецЦикла;
			Для каждого Строка из НаборОбъект.ДополнительныеСведения Цикл
				Строка.ПометкаУдаления = Истина;
			КонецЦикла;
			НаборОбъект.Записать();
			НаборОбъект.УстановитьПометкуУдаления(Истина);
			
			ВыборкаСвойств = ВыборкаНаборов.Выбрать(ОбходРезультатаЗапроса.Прямой);
			Пока ВыборкаСвойств.Следующий() Цикл
				Если ЗначениеЗаполнено(ВыборкаСвойств.Свойство) Тогда
					СвойствоОбъект = ВыборкаСвойств.Свойство.ПолучитьОбъект();
					СвойствоОбъект.УстановитьПометкуУдаления(Истина);
				КонецЕсли;
			КонецЦикла;
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
			ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
					ВыборкаНаборов.Ссылка,,
					НСтр("es='No consiguió поменить a la desaparición el juego de los requisitos adicionales por la causa: ';ru='Не удалось поменить на удаление набор дополнительных реквизитов по причине: ';en='Failed to change the set of additional details for deletion due to: '") + ОписаниеОшибки);
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновлениеРегистраНакопленияторо_ПлановыеЗатратыЗапчастей() Экспорт
	
	ОшибкаТранзакции = Ложь;
	НачатьТранзакцию();
	
	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ТаблицаЗапчастей.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		               |	ТаблицаЗапчастей.Номенклатура КАК Номенклатура,
		               |	ТаблицаЗапчастей.Количество КАК Количество,
		               |	ТаблицаЗапчастей.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		               |	ТаблицаЗапчастей.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		               |	ТаблицаЗапчастей.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ ТаблицаЗатратЗапчастей
		               |ИЗ
		               |	Документ.торо_ЗаявкаНаРемонт.ЗапчастиРемонта КАК ТаблицаЗапчастей
		               |ГДЕ
		               |	ТаблицаЗапчастей.Ссылка.Проведен = ИСТИНА
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	торо_ЗаявкаНаРемонтРемонтыОборудования.ID КАК РемонтыОборудования_ID,
		               |	торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаНачала КАК ДатаНачала
		               |ПОМЕСТИТЬ ТаблицаРемонтовОборудования
		               |ИЗ
		               |	Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК торо_ЗаявкаНаРемонтРемонтыОборудования
		               |ГДЕ
		               |	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка.Проведен = ИСТИНА
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаЗатратЗапчастей.Номенклатура КАК Номенклатура,
		               |	СУММА(ВЫБОР
		               |			КОГДА ЕСТЬNULL(ТаблицаЗатратЗапчастей.ЕдиницаИзмерения.Коэффициент, 0) = 0
		               |				ТОГДА 1
		               |			ИНАЧЕ ТаблицаЗатратЗапчастей.ЕдиницаИзмерения.Коэффициент
		               |		КОНЕЦ * ТаблицаЗатратЗапчастей.Количество) КАК Количество,
		               |	ТаблицаЗатратЗапчастей.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		               |	ТаблицаЗатратЗапчастей.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		               |	ТаблицаЗатратЗапчастей.Ссылка КАК Регистратор,
		               |	торо_ЗаявкаНаРемонтРемонтныеРаботы.ДатаНачала КАК Период
		               |ИЗ
		               |	ТаблицаЗатратЗапчастей КАК ТаблицаЗатратЗапчастей
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаРемонтовОборудования КАК торо_ЗаявкаНаРемонтРемонтныеРаботы
		               |		ПО ТаблицаЗатратЗапчастей.РемонтыОборудования_ID = торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтыОборудования_ID
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТаблицаЗатратЗапчастей.Номенклатура,
		               |	ТаблицаЗатратЗапчастей.ХарактеристикаНоменклатуры,
		               |	ТаблицаЗатратЗапчастей.РемонтыОборудования_ID,
		               |	ТаблицаЗатратЗапчастей.Ссылка,
		               |	торо_ЗаявкаНаРемонтРемонтныеРаботы.ДатаНачала
		               |ИТОГИ ПО
		               |	Регистратор";
		
		ВыборкаДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Регистратор");
		
		Пока ВыборкаДокументов.Следующий() Цикл
			НаборЗаписей = РегистрыНакопления.торо_ПлановыеЗатратыЗапчастей.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаДокументов.Регистратор);
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			
			ВыборкаЗатрат = ВыборкаДокументов.Выбрать();
			Пока ВыборкаЗатрат.Следующий() Цикл
				Запись = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(Запись, ВыборкаЗатрат);
			КонецЦикла;	
			НаборЗаписей.Записать();
		КонецЦикла;
			
	Исключение
		ОшибкаТранзакции = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("es='La renovación de la base informativa';ru='Обновление информационной базы';en='Infobase update'"), УровеньЖурналаРегистрации.Ошибка, 
									,,НСтр("es='¡El registro de la acumulación ""los gastos Planificados de las partes de recambio"" no es renovado! Por la causa: ';ru='Регистр накопления ""Плановые затраты запчастей"" НЕ обновлен! По причине: ';en='Accumulation register ""Planned costs of spare parts"" is NOT updated! Due to: '") + ОписаниеОшибки);
	КонецПопытки;   
	
	Если ОшибкаТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;

КонецПроцедуры


#КонецОбласти