
#Область ПрограммныйИнтерфейс

// Функция выделяет в строке формата литералы, выполняет подсчет знакомест, 
// формирует на основании строки формата маску ввода.
Функция РазобратьЭлементыФорматнойСтроки(Формат, Отказ, МассивОшибок) Экспорт
	
	МаскаПоляВвода = "";
	ЛитералыСтроки = Новый Массив;
	КолВоЗнакомест = 0;
	ДопКолВоЗнакомест = 0;
	
	ЧтениеЛитерала = 0;
	ТекЛитерал = "";
	ПозицияЛитерала = 0;
	ПреобразованиеРегистра = 0;
	
	СлужебныеСимволы = "!9#NUX^h@";
	Местознаки       = "L?Aa";
	СимволыНеВлияющиеНаРазбор = "!()";
	
	СоответствиеСимволовФормата = Новый Соответствие;
	СоответствиеСимволовФормата.Вставить("0", "9");
	СоответствиеСимволовФормата.Вставить("9", "9");
	СоответствиеСимволовФормата.Вставить("#", "#");
	СоответствиеСимволовФормата.Вставить("&", "X");
	СоответствиеСимволовФормата.Вставить("C", "X");
	
	СоответствиеРазделителей = ПолучитьСоответствиеРазделителей();
	
	ДлинаФормата = СтрДлина(Формат);
	
	Для Н = 1 По ДлинаФормата Цикл
		ТекСимволФормата = Сред(Формат, Н, 1);
		Если ЧтениеЛитерала = 1 Тогда
			ЛитералыСтроки.Добавить(Новый Структура("Позиция, Литерал", Н - 1, ТекСимволФормата));
			МаскаПоляВвода = МаскаПоляВвода + ?(Найти(СлужебныеСимволы, ТекСимволФормата) > 0, "\", "") + ТекСимволФормата;
			КолВоЗнакомест = КолВоЗнакомест + 1;
			ЧтениеЛитерала = 0;
			
		ИначеЕсли ЧтениеЛитерала = 2 Тогда
			Если ТекСимволФормата = """" Тогда
				ЛитералыСтроки.Добавить(Новый Структура("Позиция, Литерал", ПозицияЛитерала, ТекЛитерал));
				КолВоЗнакомест = КолВоЗнакомест + СтрДлина(ТекЛитерал);
				ЧтениеЛитерала = 0;
			Иначе
				ТекЛитерал = ТекЛитерал + ТекСимволФормата;
				МаскаПоляВвода = МаскаПоляВвода + ?(Найти(СлужебныеСимволы, ТекСимволФормата) > 0, "\", "") + ТекСимволФормата;
			КонецЕсли;
			
		ИначеЕсли ТекСимволФормата = """" Тогда
			ЧтениеЛитерала = 2;
			ПозицияЛитерала = Н;
			ТекЛитерал = "";
			
		ИначеЕсли ТекСимволФормата = "\" Тогда
			ЧтениеЛитерала = 1;
			
		ИначеЕсли ТекСимволФормата = "<" Тогда
			ПреобразованиеРегистра = ?(ПреобразованиеРегистра = 2, 0, 1);
			
		ИначеЕсли ТекСимволФормата = ">" Тогда
			ПреобразованиеРегистра = ?(ПреобразованиеРегистра = 1, 0, 2);
			
		ИначеЕсли Найти(Местознаки, ТекСимволФормата) > 0 Тогда
			МаскаПоляВвода = МаскаПоляВвода + ?(ПреобразованиеРегистра = 2, "U", "N");
			КолВоЗнакомест = КолВоЗнакомест + 1;
			
		ИначеЕсли Найти(СимволыНеВлияющиеНаРазбор, ТекСимволФормата) = 0 Тогда
			СимволМаски = СоответствиеСимволовФормата[ТекСимволФормата];
			ЭтоРазделитель = Ложь;
			Если СимволМаски = Неопределено Тогда
				СимволМаски = СоответствиеРазделителей[ТекСимволФормата];
				ЭтоРазделитель = Истина;
			КонецЕсли;
			Если НЕ СимволМаски = Неопределено Тогда
				МаскаПоляВвода = МаскаПоляВвода + ?(ЭтоРазделитель, "\", "") + СимволМаски;
				Если ЭтоРазделитель Тогда
					ЛитералыСтроки.Добавить(Новый Структура("Позиция, Литерал", Н, СимволМаски));
				КонецЕсли;
				Если НЕ ТекСимволФормата = "C" Тогда
					КолВоЗнакомест = КолВоЗнакомест + 1;
				Иначе
					ДопКолВоЗнакомест = ДопКолВоЗнакомест + 1;
				КонецЕсли;
			Иначе
				ТекстОшибки = УправлениеНСИФункцииКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
					НСтр("ru='Недопустимый символ формата ''%1'' (поз. %2) не внесен под знак литерала.'"),
					ТекСимволФормата, Н);
				МассивОшибок.Добавить(ТекстОшибки);
				Отказ = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЧтениеЛитерала = 2 Тогда
		ТекстОшибки = УправлениеНСИФункцииКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
			НСтр("ru='В строке формата ожидается закрывающая ковычка ("", поз. %1)'"), ПозицияЛитерала);
		МассивОшибок.Добавить(ТекстОшибки);
		Отказ = Истина;
	КонецЕсли;
	
	Возврат Новый Структура("МаскаПоляВвода, ЛитералыСтроки, КолВоЗнакомест, ДопКолВоЗнакомест", 
		МаскаПоляВвода, ЛитералыСтроки, КолВоЗнакомест, ДопКолВоЗнакомест);
	
КонецФункции

Функция ФорматироватьСтроку(СтрокаТекста, Формат, Отказ=Ложь, МассивОшибок=Неопределено, ПропускатьНедостающие=Истина) Экспорт
	
	Если МассивОшибок = Неопределено Тогда
		МассивОшибок = Новый Массив;
	КонецЕсли;
	
	ПараметрыЗаполнения = Новый Структура(
		"ДопустимаЦифра, ДопустимПробел, ДопустимЗнак, ДопустимаБуква");
	УстановитьФлагиФормата(ПараметрыЗаполнения);
	ПараметрыЗаполнения.Вставить("ПреобразованиеРегистра", 0);    // Признак, что в строке формата есть "<" или ">"
	ПараметрыЗаполнения.Вставить("ЧтениеЛитерала",         0);    // Признак, что в строке формата открыты ковычки (") или "\"
	ПараметрыЗаполнения.Вставить("СправаНалево",           Ложь); // Признак, что в строке формата есть "!" (режим "Справа налево")
	ПараметрыЗаполнения.Вставить("СтрокаПроверки",         "");   // Буфер для чтения литерала или для проверки режима "Справа налево"
	ПараметрыЗаполнения.Вставить("КолВоЗнакомест",         0);    // Счетчик знакомест для выравнивания текста в режиме "Справа налево"
	ПараметрыЗаполнения.Вставить("ПропускСимволов",        Ложь); // Признак пропуска символов форматируемого текста, попадающих в скобки "(", ")"
	ПараметрыЗаполнения.Вставить("ОчисткаПропускаемых",    Ложь); // Признак очистки символов в круглых скобках с учетом режима "Справа налево"
	ПараметрыЗаполнения.Вставить("ЗаполнениеДоПозиции",    Ложь); // Признак, что нужно пропустить заполнение знакомест до указанной позиции
	ПараметрыЗаполнения.Вставить("НоваяПозиция",           0);    // Позиция, до которой нужно пропускать заполнение знакомест
	
	СоответствиеПараметров = Новый Соответствие;
	СоответствиеПараметров.Вставить("0", "ДопустимаЦифра");
	СоответствиеПараметров.Вставить("9", "ДопустимаЦифра, ДопустимПробел");
	СоответствиеПараметров.Вставить("#", "ДопустимаЦифра, ДопустимПробел, ДопустимЗнак");
	СоответствиеПараметров.Вставить("L", "ДопустимаБуква");
	СоответствиеПараметров.Вставить("?", "ДопустимаБуква, ДопустимПробел");
	СоответствиеПараметров.Вставить("A", "ДопустимаБуква, ДопустимаЦифра");
	СоответствиеПараметров.Вставить("a", "ДопустимаБуква, ДопустимаЦифра, ДопустимПробел");
	
	Разделители = ПолучитьСистемныеРазделители();
	ЗнакиРазделителейВФормате = "/:,.";
	
	СтруктураФорматнойСтроки = РазобратьЭлементыФорматнойСтроки(Формат, Отказ, МассивОшибок);
	ОстатокЗнакомест    = СтруктураФорматнойСтроки.КолВоЗнакомест;
	ОстатокДопЗнакомест = СтруктураФорматнойСтроки.ДопКолВоЗнакомест;
	
	ДлинаФормата = СтрДлина(Формат);
	ДлинаТекста  = СтрДлина(СтрокаТекста);
	ФорматированнаяСтрока = "";
	
	Поз = 1;
	Н   = 1;
	
	Пока Н <= ДлинаФормата Цикл
		ТекСимволТекста = Сред(СтрокаТекста, Поз, 1);
		ТекСимволФормата = Сред(Формат, Н, 1);
		
		Если ПараметрыЗаполнения.ЗаполнениеДоПозиции И ПараметрыЗаполнения.НоваяПозиция = Н Тогда
			ПараметрыЗаполнения.ЗаполнениеДоПозиции = Ложь;
		КонецЕсли;
		
		СбросСправаНалево = Ложь;
		
		Если ПараметрыЗаполнения.ЧтениеЛитерала = 1 Тогда // литерал-символ
			Если НРег(ТекСимволТекста) = НРег(ТекСимволФормата) Тогда
				Поз = Поз + 1;
			КонецЕсли;
			ПараметрыЗаполнения.ЧтениеЛитерала = 0;
			ФорматированнаяСтрока = ФорматированнаяСтрока + ТекСимволФормата;
			ОстатокЗнакомест = ОстатокЗнакомест - 1;
			
		ИначеЕсли ПараметрыЗаполнения.ЧтениеЛитерала = 2 Тогда // литерал-строка (в ковычках)
			Если ТекСимволФормата = """" Тогда
				ДлинаСтрокиПроверки = СтрДлина(ПараметрыЗаполнения.СтрокаПроверки);
				СтрокаСравнения = Сред(СтрокаТекста, Поз, ДлинаСтрокиПроверки);
				Если НРег(СтрокаСравнения) = НРег(ПараметрыЗаполнения.СтрокаПроверки) Тогда
					Поз = Поз + ДлинаСтрокиПроверки;
				КонецЕсли;
				ПараметрыЗаполнения.ЧтениеЛитерала = 0;
				ФорматированнаяСтрока = ФорматированнаяСтрока + ПараметрыЗаполнения.СтрокаПроверки;
				ОстатокЗнакомест = ОстатокЗнакомест - ДлинаСтрокиПроверки;
			Иначе
				ПараметрыЗаполнения.СтрокаПроверки = ПараметрыЗаполнения.СтрокаПроверки + ТекСимволФормата;
			КонецЕсли;
			
		ИначеЕсли ТекСимволФормата = """" Тогда // начальная ковычка литерала-строки
			ПараметрыЗаполнения.ЧтениеЛитерала = 2;
			ПараметрыЗаполнения.СтрокаПроверки = "";
			СбросСправаНалево = Истина;
			
		ИначеЕсли ТекСимволФормата = "\" Тогда // знак литерала-символа
			ПараметрыЗаполнения.ЧтениеЛитерала = 1;
			СбросСправаНалево = Истина;
			
		ИначеЕсли ТекСимволФормата = "<" Тогда // режим преобразования символов к нижнему регистру
			ПараметрыЗаполнения.ПреобразованиеРегистра = ?(ПараметрыЗаполнения.ПреобразованиеРегистра = 2, 0, 1);
			СбросСправаНалево = Истина;
			
		ИначеЕсли ТекСимволФормата = ">" Тогда // режим преобразования символов к верхнему регистру
			ПараметрыЗаполнения.ПреобразованиеРегистра = ?(ПараметрыЗаполнения.ПреобразованиеРегистра = 1, 0, 2);
			СбросСправаНалево = Истина;
			
		ИначеЕсли ТекСимволФормата = "." Тогда // разделитель дробной части
			Если ТекСимволТекста = Разделители.РазделительДробнойЧасти Тогда
				Поз = Поз + 1;
			КонецЕсли;
			ФорматированнаяСтрока = ФорматированнаяСтрока + Разделители.РазделительДробнойЧасти;
			ОстатокЗнакомест = ОстатокЗнакомест - 1;
			СбросСправаНалево = Истина;
			
		ИначеЕсли ТекСимволФормата = "," Тогда // разделитель групп
			Если ТекСимволТекста = Разделители.РазделительГрупп Тогда
				Поз = Поз + 1;
			КонецЕсли;
			ФорматированнаяСтрока = ФорматированнаяСтрока + Разделители.РазделительГрупп;
			ОстатокЗнакомест = ОстатокЗнакомест - 1;
			СбросСправаНалево = Истина;
			
		ИначеЕсли ТекСимволФормата = "/" Тогда // разделитель даты
			Если ТекСимволТекста = Разделители.РазделительДаты Тогда
				Поз = Поз + 1;
			КонецЕсли;
			ФорматированнаяСтрока = ФорматированнаяСтрока + Разделители.РазделительДаты;
			ОстатокЗнакомест = ОстатокЗнакомест - 1;
			СбросСправаНалево = Истина;
			
		ИначеЕсли ТекСимволФормата = ":" Тогда // разделитель времени
			Если ТекСимволТекста = Разделители.РазделительВремени Тогда
				Поз = Поз + 1;
			КонецЕсли;
			ФорматированнаяСтрока = ФорматированнаяСтрока + Разделители.РазделительВремени;
			ОстатокЗнакомест = ОстатокЗнакомест - 1;
			СбросСправаНалево = Истина;
			
		ИначеЕсли ТекСимволФормата = "&" Тогда // произвольный символ или пробел
			СбросСправаНалево = НЕ (ПараметрыЗаполнения.СтрокаПроверки = ТекСимволФормата);
			Если ПараметрыЗаполнения.СправаНалево И НЕ СбросСправаНалево Тогда
				ПараметрыЗаполнения.КолВоЗнакомест = ПараметрыЗаполнения.КолВоЗнакомест + 1;
			КонецЕсли;
			
			ОстатокЗнакомест = ОстатокЗнакомест - 1;
			
			Если НЕ ТекСимволТекста = "" И НЕ ПараметрыЗаполнения.ЗаполнениеДоПозиции Тогда
				Если ПараметрыЗаполнения.ПреобразованиеРегистра = 1 Тогда
					ТекСимволТекста = НРег(ТекСимволТекста);
				ИначеЕсли ПараметрыЗаполнения.ПреобразованиеРегистра = 2 Тогда
					ТекСимволТекста = ВРег(ТекСимволТекста);
				КонецЕсли;
				ФорматированнаяСтрока = ФорматированнаяСтрока + ТекСимволТекста;
				
				Поз = Поз + 1;
				
			Иначе
				ФорматированнаяСтрока = ФорматированнаяСтрока + " ";
			КонецЕсли;
			
		ИначеЕсли ТекСимволФормата = "C" Тогда // необязательный символ (произвольный символ или пробел)
			СбросСправаНалево = НЕ (ПараметрыЗаполнения.СтрокаПроверки = ТекСимволФормата);
			Если ПараметрыЗаполнения.СправаНалево И НЕ СбросСправаНалево Тогда
				ПараметрыЗаполнения.КолВоЗнакомест = ПараметрыЗаполнения.КолВоЗнакомест + 1;
			КонецЕсли;
			
			Если НЕ ТекСимволТекста = "" И НЕ ПараметрыЗаполнения.ЗаполнениеДоПозиции Тогда
				ОстатокСтроки = ДлинаТекста - Поз + 1;
				// Если оставшаяся для форматирования часть строки текста длиньше предполагаемого количества знакомест
				// согласно оставшейся части маски, то подставляем очередной символ текста на дополнительное знакоместо.
				Если ОстатокСтроки >= ОстатокЗнакомест + ОстатокДопЗнакомест Тогда
					Если ПараметрыЗаполнения.ПреобразованиеРегистра = 1 Тогда
						ТекСимволТекста = НРег(ТекСимволТекста);
					ИначеЕсли ПараметрыЗаполнения.ПреобразованиеРегистра = 2 Тогда
						ТекСимволТекста = ВРег(ТекСимволТекста);
					КонецЕсли;
					ФорматированнаяСтрока = ФорматированнаяСтрока + ТекСимволТекста;
					Поз = Поз + 1;
				ИначеЕсли НЕ ПропускатьНедостающие Тогда
					ФорматированнаяСтрока = ФорматированнаяСтрока + " ";
				КонецЕсли;
				
			ИначеЕсли НЕ ПропускатьНедостающие Тогда
				ФорматированнаяСтрока = ФорматированнаяСтрока + " ";
			КонецЕсли;
			
			ОстатокДопЗнакомест = ОстатокДопЗнакомест - 1;
			
		ИначеЕсли ТекСимволФормата = "!" Тогда // заполнение маски справа налево
			ПараметрыЗаполнения.СправаНалево   = Истина;
			СледСимвол = Сред(Формат, Н + 1, 1);
			ПараметрыЗаполнения.СтрокаПроверки = ?(СледСимвол = "(", Сред(Формат, Н + 2, 1), СледСимвол);
			ПараметрыЗаполнения.КолВоЗнакомест = 0;
			ПараметрыЗаполнения.Вставить("НачПозицияСправаНалево", СтрДлина(ФорматированнаяСтрока) + 1);
			
		ИначеЕсли ТекСимволФормата = "(" Тогда // пропуск символов
			Если ПараметрыЗаполнения.ПропускСимволов Тогда
				ТекстОшибки = УправлениеНСИФункцииКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
					НСтр("ru='Недопустимо использовать круглые скобки внутри скобок (поз. %1).'"), Н);
				МассивОшибок.Добавить(ТекстОшибки);
				Отказ = Истина;
			Иначе
				ПараметрыЗаполнения.ПропускСимволов = Истина;
				ПараметрыЗаполнения.Вставить("НачПозицияСкобок", СтрДлина(ФорматированнаяСтрока) + 1);
			КонецЕсли;
			
		ИначеЕсли ТекСимволФормата = ")" Тогда // окончание области пропуска символов
			Если НЕ ПараметрыЗаполнения.ПропускСимволов Тогда
				ТекстОшибки = УправлениеНСИФункцииКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
					НСтр("ru='Найдена закрывающая круглая скобка без соответствующей открывающей скобки (поз. %1).'"), Н);
				МассивОшибок.Добавить(ТекстОшибки);
				Отказ = Истина;
			Иначе
				ПараметрыЗаполнения.ПропускСимволов = Ложь;
				ПараметрыЗаполнения.Вставить("КонПозицияСкобок", СтрДлина(ФорматированнаяСтрока));
				Если НЕ ПараметрыЗаполнения.СправаНалево Тогда
					ФорматированнаяСтрока = Лев(ФорматированнаяСтрока, ПараметрыЗаполнения.НачПозицияСкобок - 1);
				Иначе
					ПараметрыЗаполнения.ОчисткаПропускаемых = Истина;
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			СимволПараметров = СоответствиеПараметров[ТекСимволФормата]; // знакоместо (цифра, буква или пробел)
			Если НЕ СимволПараметров = Неопределено Тогда
				СбросСправаНалево = НЕ (ПараметрыЗаполнения.СтрокаПроверки = ТекСимволФормата);
				Если ПараметрыЗаполнения.СправаНалево И НЕ СбросСправаНалево Тогда
					ПараметрыЗаполнения.КолВоЗнакомест = ПараметрыЗаполнения.КолВоЗнакомест + 1;
				КонецЕсли;
				
				Если НЕ ТекСимволТекста = "" И НЕ ПараметрыЗаполнения.ЗаполнениеДоПозиции Тогда
					УстановитьФлагиФормата(ПараметрыЗаполнения, СимволПараметров);
					Если СимволСоответствуетФормату(ТекСимволТекста, ПараметрыЗаполнения) Тогда
						
						Если ПараметрыЗаполнения.ПреобразованиеРегистра = 1 Тогда
							ТекСимволТекста = НРег(ТекСимволТекста);
						ИначеЕсли ПараметрыЗаполнения.ПреобразованиеРегистра = 2 Тогда
							ТекСимволТекста = ВРег(ТекСимволТекста);
						КонецЕсли;
						ФорматированнаяСтрока = ФорматированнаяСтрока + ТекСимволТекста;
						Поз = Поз + 1;
						
					Иначе // Если символ не соответствует форматной строке.
						НайденЛитерал = НайтиЛитерал(ТекСимволТекста, СтруктураФорматнойСтроки.ЛитералыСтроки, Н);
						Если НЕ НайденЛитерал = Неопределено 
								И НРег(Сред(СтрокаТекста, Поз, СтрДлина(НайденЛитерал.Литерал))) = НРег(НайденЛитерал.Литерал) Тогда
							// Надо "дошагать" до литерала, а потом уже двигать Поз.
							ПараметрыЗаполнения.ЗаполнениеДоПозиции = Истина;
							ПараметрыЗаполнения.НоваяПозиция = НайденЛитерал.Позиция;
							Если НЕ ПараметрыЗаполнения.СправаНалево ИЛИ СбросСправаНалево Тогда
								ФорматированнаяСтрока = ФорматированнаяСтрока + " ";
							КонецЕсли;
							
						Иначе
							// Двигаем Поз, пока не найдем символ, который соответствует формату.
							// Если подходящих символов нет, м.б. надо перейти к следующему символу форматной строки.
							НоваяПозицияВТексте = ДлинаТекста + 1;
							Для М = Поз + 1 По ДлинаТекста Цикл
								НовыйСимвол = Сред(СтрокаТекста, М, 1);
								Если СимволСоответствуетФормату(НовыйСимвол, ПараметрыЗаполнения) Тогда
									НоваяПозицияВТексте = М;
									Прервать;
								КонецЕсли;
							КонецЦикла;
							
							НовыеПараметры = Новый Структура();
							НовыйОстатокЗнакомест = ОстатокЗнакомест + ОстатокДопЗнакомест - 1;
							НоваяПозицияВФормате = ДлинаФормата + 1;
							Для М = Н + 1 По ДлинаФормата Цикл
								НовыйСимвол = Сред(Формат, М, 1);
								Если НовыйСимвол = "&" ИЛИ НовыйСимвол = "C" Тогда
									НоваяПозицияВФормате = М;
									Прервать;
									
								ИначеЕсли НЕ НовыйСимвол = ТекСимволФормата Тогда
									СимволПараметров = СоответствиеПараметров[НовыйСимвол];
									Если НЕ СимволПараметров = Неопределено Тогда
										УстановитьФлагиФормата(НовыеПараметры, СимволПараметров);
										Если СимволСоответствуетФормату(ТекСимволТекста, НовыеПараметры) Тогда
											НоваяПозицияВФормате = М;
											Прервать;
										Иначе
											НовыйОстатокЗнакомест = НовыйОстатокЗнакомест - 1;
										КонецЕсли;
									ИначеЕсли Найти(ЗнакиРазделителейВФормате, НовыйСимвол) > 0 Тогда
										НовыйОстатокЗнакомест = НовыйОстатокЗнакомест - 1;
									КонецЕсли;
								Иначе
									НовыйОстатокЗнакомест = НовыйОстатокЗнакомест - 1;
								КонецЕсли;
							КонецЦикла;
							
							ДлинаОстаткаТекста = ?(НоваяПозицияВТексте <= ДлинаТекста, ДлинаТекста - НоваяПозицияВТексте + 1, 0);
							Если НовыйОстатокЗнакомест >= ДлинаОстаткаТекста Тогда
								ПараметрыЗаполнения.ЗаполнениеДоПозиции = Истина;
								ПараметрыЗаполнения.НоваяПозиция = НоваяПозицияВФормате;
								ФорматированнаяСтрока = ФорматированнаяСтрока + " ";
							ИначеЕсли НоваяПозицияВТексте <= ДлинаТекста Тогда
								// Часть текста теряем при форматировании.
								СимволыПропустить = Сред(СтрокаТекста, Поз, НоваяПозицияВТексте - Поз);
								ТекстОшибки = УправлениеНСИФункцииКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
									НСтр("ru='Значение заполнения не соответствует формату: ""%1"" (поз. %2).
										|  Значение заполнения: ""%3""; формат: ""%4"".'"), СимволыПропустить, Поз, СтрокаТекста, Формат);
								МассивОшибок.Добавить(ТекстОшибки);
								Отказ = Истина;
								
								Поз = НоваяПозицияВТексте;
								ТекСимволТекста = Сред(СтрокаТекста, Поз, 1);
								Если ПараметрыЗаполнения.ПреобразованиеРегистра = 1 Тогда
									ТекСимволТекста = НРег(ТекСимволТекста);
								ИначеЕсли ПараметрыЗаполнения.ПреобразованиеРегистра = 2 Тогда
									ТекСимволТекста = ВРег(ТекСимволТекста);
								КонецЕсли;
								ФорматированнаяСтрока = ФорматированнаяСтрока + ТекСимволТекста;
								Поз = Поз + 1;
							Иначе
								ФорматированнаяСтрока = ФорматированнаяСтрока + " ";
								Поз = Поз + 1;
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;
					
				Иначе
					Если НЕ ПараметрыЗаполнения.СправаНалево ИЛИ СбросСправаНалево Тогда
						ФорматированнаяСтрока = ФорматированнаяСтрока + " ";
					ИначеЕсли ТекСимволТекста = "" И ПараметрыЗаполнения.СправаНалево Тогда
						ПервыйСимвол = Сред(ФорматированнаяСтрока, ПараметрыЗаполнения.НачПозицияСправаНалево, 1);
						Если ПервыйСимвол >= "0" И ПервыйСимвол <= "9" Тогда
							СимволСдвига = "0";
						Иначе
							СимволСдвига = " ";
						КонецЕсли;
						ФорматированнаяСтрока = Лев(ФорматированнаяСтрока, ПараметрыЗаполнения.НачПозицияСправаНалево - 1) 
							+ СимволСдвига + Сред(ФорматированнаяСтрока, ПараметрыЗаполнения.НачПозицияСправаНалево);
					КонецЕсли;
				КонецЕсли;
				
				ОстатокЗнакомест = ОстатокЗнакомест - 1;
				
			Иначе // Если в строке формата неизвестный символ, неподведенный под знак литерала. 
				// Ничего не делаем. Такие ситуации мы должны были выявить при выполнении функции РазобратьЭлементыФорматнойСтроки.
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПараметрыЗаполнения.СправаНалево И СбросСправаНалево Тогда
			ДлинаСтроки = СтрДлина(ФорматированнаяСтрока) - ПараметрыЗаполнения.НачПозицияСправаНалево + 1;
			Если ДлинаСтроки < ПараметрыЗаполнения.КолВоЗнакомест Тогда
				ПервыйСимвол = Сред(ФорматированнаяСтрока, ПараметрыЗаполнения.НачПозицияСправаНалево, 1);
				Если ПервыйСимвол >= "0" И ПервыйСимвол <= "9" Тогда
					СимволСдвига = "0";
				Иначе
					СимволСдвига = " ";
				КонецЕсли;
				
				СтрокаСдвига = "";
				ДлинаСдвига = ПараметрыЗаполнения.КолВоЗнакомест - ДлинаСтроки;
				Для М = 1 По ДлинаСдвига Цикл
					СтрокаСдвига = СтрокаСдвига + СимволСдвига;
				КонецЦикла;
				ФорматированнаяСтрока = Лев(ФорматированнаяСтрока, ПараметрыЗаполнения.НачПозицияСправаНалево - 1)
					+ СтрокаСдвига + Сред(ФорматированнаяСтрока, ПараметрыЗаполнения.НачПозицияСправаНалево);
				
				Если ПараметрыЗаполнения.ОчисткаПропускаемых Тогда
					Если ПараметрыЗаполнения.НачПозицияСкобок > ПараметрыЗаполнения.НачПозицияСправаНалево Тогда
						ПараметрыЗаполнения.НачПозицияСкобок = ПараметрыЗаполнения.НачПозицияСкобок + ДлинаСдвига;
						ПараметрыЗаполнения.КонПозицияСкобок = ПараметрыЗаполнения.КонПозицияСкобок + ДлинаСдвига;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
			Если ПараметрыЗаполнения.ОчисткаПропускаемых Тогда
				ФорматированнаяСтрока = Лев(ФорматированнаяСтрока, ПараметрыЗаполнения.НачПозицияСкобок - 1)
					+ Сред(ФорматированнаяСтрока, ПараметрыЗаполнения.КонПозицияСкобок + 1);
				ПараметрыЗаполнения.ОчисткаПропускаемых = Ложь;
			КонецЕсли;
			
			ПараметрыЗаполнения.СправаНалево = Ложь;
			
		КонецЕсли;
		
		Н = Н + 1;
	КонецЦикла;
	
	Если ПараметрыЗаполнения.ПропускСимволов Тогда
		ТекстОшибки = НСтр("ru='В строке формата не найдена закрывающая круглая скобка.'");
		МассивОшибок.Добавить(ТекстОшибки);
		Отказ = Истина;
	КонецЕсли;
	
	Если ПараметрыЗаполнения.СправаНалево Тогда
		ДлинаСтроки = СтрДлина(ФорматированнаяСтрока) - ПараметрыЗаполнения.НачПозицияСправаНалево + 1;
		Если ДлинаСтроки < ПараметрыЗаполнения.КолВоЗнакомест Тогда
			ПервыйСимвол = Сред(ФорматированнаяСтрока, ПараметрыЗаполнения.НачПозицияСправаНалево, 1);
			Если ПервыйСимвол >= "0" И ПервыйСимвол <= "9" Тогда
				СимволСдвига = "0";
			Иначе
				СимволСдвига = " ";
			КонецЕсли;
			
			СтрокаСдвига = "";
			ДлинаСдвига = ПараметрыЗаполнения.КолВоЗнакомест - ДлинаСтроки;
			Для М = 1 По ДлинаСдвига Цикл
				СтрокаСдвига = СтрокаСдвига + СимволСдвига;
			КонецЦикла;
			ФорматированнаяСтрока = Лев(ФорматированнаяСтрока, ПараметрыЗаполнения.НачПозицияСправаНалево - 1)
				+ СтрокаСдвига + Сред(ФорматированнаяСтрока, ПараметрыЗаполнения.НачПозицияСправаНалево);
			
			Если ПараметрыЗаполнения.ОчисткаПропускаемых Тогда
				Если ПараметрыЗаполнения.НачПозицияСкобок > ПараметрыЗаполнения.НачПозицияСправаНалево Тогда
					ПараметрыЗаполнения.НачПозицияСкобок = ПараметрыЗаполнения.НачПозицияСкобок + ДлинаСдвига;
					ПараметрыЗаполнения.КонПозицияСкобок = ПараметрыЗаполнения.КонПозицияСкобок + ДлинаСдвига;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПараметрыЗаполнения.ОчисткаПропускаемых Тогда
			ФорматированнаяСтрока = Лев(ФорматированнаяСтрока, ПараметрыЗаполнения.НачПозицияСкобок - 1)
				+ Сред(ФорматированнаяСтрока, ПараметрыЗаполнения.КонПозицияСкобок + 1);
			ПараметрыЗаполнения.ОчисткаПропускаемых = Ложь;
		КонецЕсли;
		
		ПараметрыЗаполнения.СправаНалево = Ложь;
		
	КонецЕсли;
	
	Если Поз <= ДлинаТекста Тогда
		СимволыОстатка = Сред(СтрокаТекста, Поз);
		ТекстОшибки = УправлениеНСИФункцииКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
			НСтр("ru='Окончание значения заполнения не соответствует формату: ""%1"" (поз. %2).
				|  Значение заполнения: ""%3""; формат: ""%4"".'"), СимволыОстатка, Поз, СтрокаТекста, Формат);
		МассивОшибок.Добавить(ТекстОшибки);
		Отказ = Истина;
	КонецЕсли;
	
	Возврат ФорматированнаяСтрока;
	
КонецФункции

Функция УдалитьНезначащиеНули(СтрокаИсходная) Экспорт
	
	СимволыЦифры = "0123456789";
	
	СтрокаРезультирующая = "";
	НезначащиеНули = Неопределено;
	КолВоСимв = СтрДлина(СтрокаИсходная);
	Для Н = 1 По КолВоСимв Цикл
		ТекСимвол = Сред(СтрокаИсходная, КолВоСимв - Н + 1, 1);
		Если ТекСимвол = "0" Тогда
			ТекСимвол = "";
			Если НезначащиеНули = Неопределено Тогда
				НезначащиеНули = Н;
			КонецЕсли;
			
		ИначеЕсли НЕ Найти(СимволыЦифры, ТекСимвол) = 0 Тогда
			Если НЕ НезначащиеНули = Неопределено Тогда
				Для М = 1 По Н - НезначащиеНули Цикл
					ТекСимвол = ТекСимвол + "0";
				КонецЦикла;
				НезначащиеНули = Неопределено;
			КонецЕсли;
		Иначе
			НезначащиеНули = Неопределено;
		КонецЕсли;
		СтрокаРезультирующая = ТекСимвол + СтрокаРезультирующая;
	КонецЦикла;
	
	Возврат СтрокаРезультирующая;
	
КонецФункции

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСистемныеРазделители()
	
	СтруктураРезультат = Новый Структура();
	
	СтрокаДата = СтрЗаменить(Строка(Дата(1,2,3,4,5,6)), "0", "");
	Массив = Новый Массив;
	Для Н = 1 По 6 Цикл
		Массив.Добавить(Найти(СтрокаДата, Строка(Н)));
	КонецЦикла;
	
	МаксПоз = Макс(Массив[0], Массив[1], Массив[2]);
	НомерЭлемента = Массив.Найти(МаксПоз);
	Массив.Удалить(НомерЭлемента);
	Второй = Макс(Массив[0], Массив[1]);
	
	СтруктураРезультат.Вставить("РазделительДаты", Сред(СтрокаДата, Второй + 1, МаксПоз - Второй - 1));
	
	МаксПоз = Макс(Массив[2], Массив[3], Массив[4]);
	НомерЭлемента = Массив.Найти(МаксПоз);
	Массив.Удалить(НомерЭлемента);
	Второй = Макс(Массив[2], Массив[3]);
	
	СтруктураРезультат.Вставить("РазделительВремени", Сред(СтрокаДата, Второй + 1, МаксПоз - Второй - 1));
	
	ЧислоСтрокой = Строка(5432.1);
	ПозТысяч   = Найти(ЧислоСтрокой, "5");
	ПозСотен   = Найти(ЧислоСтрокой, "4");
	ПозЕдиниц  = Найти(ЧислоСтрокой, "2");
	ПозДесятых = Найти(ЧислоСтрокой, "1");
	
	СтруктураРезультат.Вставить("РазделительГрупп", Сред(ЧислоСтрокой, ПозТысяч + 1, ПозСотен - ПозТысяч - 1));
	
	СтруктураРезультат.Вставить("РазделительДробнойЧасти", Сред(ЧислоСтрокой, ПозЕдиниц + 1, ПозДесятых - ПозЕдиниц - 1));
	
	СтруктураРезультат.Вставить("ВсеРазделители", 
		СтруктураРезультат.РазделительДаты + СтруктураРезультат.РазделительВремени
		+ СтруктураРезультат.РазделительГрупп + СтруктураРезультат.РазделительДробнойЧасти);
	
	Возврат СтруктураРезультат;
	
КонецФункции

Процедура УстановитьФлагиФормата(ПараметрыЗаполнения, ФлагиУстановить="")
	
	СтруктураУстановить = Новый Структура(ФлагиУстановить);
	ФлагиВсе = Новый Структура(
		"ДопустимаЦифра, ДопустимПробел, ДопустимЗнак, ДопустимаБуква");
	Для Каждого КлючИЗначение ИЗ ФлагиВсе Цикл
		Значение = СтруктураУстановить.Свойство(КлючИЗначение.Ключ);
		ПараметрыЗаполнения.Вставить(КлючИЗначение.Ключ, Значение);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСоответствиеРазделителей()
	
	Разделители = ПолучитьСистемныеРазделители();
	
	СоответствиеРазделителей = Новый Соответствие;
	СоответствиеРазделителей.Вставить(".", Разделители.РазделительДробнойЧасти);
	СоответствиеРазделителей.Вставить(",", Разделители.РазделительГрупп);
	СоответствиеРазделителей.Вставить("/", Разделители.РазделительДаты);
	СоответствиеРазделителей.Вставить(":", Разделители.РазделительВремени);
	
	Возврат СоответствиеРазделителей;
	
КонецФункции

Функция НайтиЛитерал(Символ, Литералы, НачПозиция)
	
	Найдено = Неопределено;
	Для Каждого ТекЛитерал ИЗ Литералы Цикл
		Если НачПозиция <= ТекЛитерал.Позиция И Символ = Лев(ТекЛитерал.Литерал, 1) Тогда
			Найдено = ТекЛитерал;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Найдено;
	
КонецФункции

Функция СимволСоответствуетФормату(Символ, ПараметрыЗаполнения)
	
	Результат = (Символ >= "0" И Символ <= "9" И ПараметрыЗаполнения.ДопустимаЦифра
		ИЛИ (Символ = "+" ИЛИ Символ = "-") И ПараметрыЗаполнения.ДопустимЗнак 
		ИЛИ Символ = " " И ПараметрыЗаполнения.ДопустимПробел
		ИЛИ НРег(Символ) >= "a" И НРег(Символ) <= "z" И ПараметрыЗаполнения.ДопустимаБуква);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти 
