
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТекЭлемент = ПараметрКоманды;
	ЭтоГруппа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекЭлемент, "ЭтоГруппа");
	
	Если НЕ ЭтоГруппа тогда
		ДанныеЗаполнения = Новый Структура;
		ДанныеЗаполнения.Вставить("Основание", ТекЭлемент);
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ДанныеЗаполнения);
		ОткрытьФорму("Справочник.торо_ОбъектыРемонта.ФормаОбъекта", ПараметрыФормы);	
	Иначе 
		ТекстСообщения = НСтр("es='El objeto de la reparación no puede ser creado en razon del grupo, escogeréis el elemento.';ru='Объект ремонта не может быть создан на основании группы, выберете элемент.';en='A repair object cannot be created based on a group, select an item.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
