#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	торо_СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка, Новый Структура("УстановитьСвойствоЭлементовФормыОтПрав", Истина));
	
	Если Параметры.Свойство("ВидОперации") И НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Объект.ВидОперации = Параметры.ВидОперации;
	ИначеЕсли НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда 
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Объект.ВидОперации = Перечисления.торо_ВидыДокументаВводНачДанных.ПоОбъектуРемонта;
		КонецЕсли;
	КонецЕсли;
	
	торо_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(Объект, ЭтаФорма, Строка(Объект.ВидОперации));
	
	Если Объект.ВидОперации = Перечисления.торо_ВидыДокументаВводНачДанных.ПоОбъектуРемонта Тогда
		Элементы.СтраницыПоВидуОперации.ПодчиненныеЭлементы.СтраницаСпискиОбъектов.Видимость = Ложь;
		Элементы.СтраницыПоВидуОперации.ПодчиненныеЭлементы.СтраницаОбъектыРемонта.Видимость = Истина;
	Иначе
		Элементы.СтраницыПоВидуОперации.ПодчиненныеЭлементы.СтраницаСпискиОбъектов.Видимость = Истина;
		Элементы.СтраницыПоВидуОперации.ПодчиненныеЭлементы.СтраницаОбъектыРемонта.Видимость = Ложь;
	КонецЕсли;

	ТекСтруктураИерархии = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР", "ОсновнаяСтруктураИерархии", Истина);
	мОтображатьПоложение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР", "ПоказыватьПоложениеОР", Истина);
	
	Элементы.ОбъектыРемонтаОтображатьПоложение.Пометка = мОтображатьПоложение;
	Элементы.ОбъектыРемонтаПоложение.Видимость = мОтображатьПоложение;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СлужебныеРеквизитыЗаполнитьНаСервере();
	КонецЕсли;
	
	// функциональные опции
	ФОУчетЗапчастей = ПолучитьФункциональнуюОпцию("торо_УчетЗапчастей");
	ФОУчетКонтролируемыхПоказателей = ПолучитьФункциональнуюОпцию("торо_УчетКонтролируемыхПоказателей");
	ФОУчетНаработкиОборудования = ПолучитьФункциональнуюОпцию("торо_УчетНаработкиОборудования");
	ФОУчетПусковОборудования = ПолучитьФункциональнуюОпцию("торо_УчетПусковОборудования");
	ФОУчетСостоянияОборудования = ПолучитьФункциональнуюОпцию("торо_УчетСостоянияОборудования");
	
	Элементы.ГруппаЗапчастиОбъектаРемонта.Видимость = ФОУчетЗапчастей;
	Элементы.ГруппаПоказателиОбъектыРемонта.Видимость = ФОУчетКонтролируемыхПоказателей;
	Элементы.ГруппаНаработкаОбъектыРемонта.Видимость = ФОУчетНаработкиОборудования;
	Элементы.ГруппаПускиОР.Видимость = ФОУчетПусковОборудования;
	Элементы.ОбъектыРемонта.ПодчиненныеЭлементы.ИзменятьСостояниеПодчиненных.Видимость = ФОУчетСостоянияОборудования;
	
	Для Каждого Строка Из Объект.ПоказателиОбъектыРемонта Цикл
		СтруктураВозврата = ПолучитьЗначенияИзмеряемыхПоказателейНаСервере(Строка.ОбъектРемонта, ?(ЗначениеЗаполнено(Строка.ДатаКонтроля),Строка.ДатаКонтроля,Объект.Дата), Строка.Показатель);
		ЗаполнитьЗначенияСвойств(Строка, СтруктураВозврата,, ?(СтруктураВозврата.Свойство("ОбъектРемонта"), "ОбъектРемонта", ""));
	КонецЦикла;
	
	Если мОтображатьПоложение Тогда	
		ЗаполнитьПоложенияОР();
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	СлужебныеРеквизитыЗаполнитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
    УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ЗаполнитьТаблицуПодчиненныхОР();
	УстановитьВидимостьКолонкиПричина();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	торо_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(Объект, ЭтаФорма, Строка(Объект.ВидОперации));
	
	Для Каждого Строка Из Объект.ПоказателиОбъектыРемонта Цикл
		СтруктураВозврата = ПолучитьЗначенияИзмеряемыхПоказателейНаСервере(Строка.ОбъектРемонта, ?(ЗначениеЗаполнено(Строка.ДатаКонтроля),Строка.ДатаКонтроля,Объект.Дата), Строка.Показатель);
		ЗаполнитьЗначенияСвойств(Строка, СтруктураВозврата,, ?(СтруктураВозврата.Свойство("ОбъектРемонта"), "ОбъектРемонта", ""));
	КонецЦикла;
	
	СлужебныеРеквизитыЗаполнитьНаСервере();
	
	Если мОтображатьПоложение Тогда
		ЗаполнитьПоложенияОР(); 	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
    СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОбъектыРемонта
&НаКлиенте
Процедура ОбъектыРемонтаПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.ОбъектыРемонта.ТекущиеДанные;
	СтрокаВыбрана = Не (ТекущаяСтрока = Неопределено);
	Элементы.ВыполненныеРаботыДобавить.Доступность = СтрокаВыбрана;
	Элементы.ПоказателиОбъектыРемонтаДобавить.Доступность = СтрокаВыбрана;
	Элементы.НаработкаОбъектыРемонтаДобавить.Доступность = СтрокаВыбрана;
	Элементы.ЗапчастиОбъектаРемонтаДобавить.Доступность = СтрокаВыбрана;
	
	Если СтрокаВыбрана Тогда 
		ТекОбъект = ТекущаяСтрока.ОбъектРемонта;
		Элементы.ВыполненныеРаботы.ОтборСтрок = Новый ФиксированнаяСтруктура("ОбъектРемонта", ТекОбъект);
		Элементы.НаработкаОбъектыРемонта.ОтборСтрок = Новый ФиксированнаяСтруктура("ОбъектРемонта", ТекОбъект);
		Элементы.ПоказателиОбъектыРемонта.ОтборСтрок = Новый ФиксированнаяСтруктура("ОбъектРемонта", ТекОбъект);
		Элементы.ЗапчастиОбъектаРемонта.ОтборСтрок = Новый ФиксированнаяСтруктура("ОбъектРемонта", ТекОбъект);
		Элементы.ПускиОР.ОтборСтрок = Новый ФиксированнаяСтруктура("ОбъектРемонта", ТекОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРемонтаПередУдалением(Элемент, Отказ)
	
	ТекДанные = Элементы.ОбъектыРемонта.ТекущиеДанные;
	
	мСтруктураСвязанныхТЧ = Новый Структура();
	мСтруктураСвязанныхТЧ.Вставить("ВыполненныеРаботы");
	мСтруктураСвязанныхТЧ.Вставить("ПоказателиОбъектыРемонта");
	мСтруктураСвязанныхТЧ.Вставить("НаработкаОбъектыРемонта");
	мСтруктураСвязанныхТЧ.Вставить("ЗапчастиОбъектаРемонта");
	
	Для Каждого КлючИЗначение Из мСтруктураСвязанныхТЧ Цикл
		МассивСтрок = Объект[КлючИЗначение.Ключ].НайтиСтроки(Новый Структура("ОбъектРемонта", ТекДанные.ОбъектРемонта));
		Для Каждого ЭлементМассива Из МассивСтрок Цикл
			Объект[КлючИЗначение.Ключ].Удалить(ЭлементМассива);
		КонецЦикла; 
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРемонтаПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если Не ОтменаРедактирования Тогда 
		СтрокаТЧ = Элементы.ОбъектыРемонта.ТекущиеДанные;
		Отбор = Новый Структура;
		Отбор.Вставить("ОбъектРемонта",СтрокаТЧ.ОбъектРемонта);
		Строки = Объект.ОбъектыРемонта.НайтиСтроки(Отбор);
		Если Строки.Количество() > 1 Тогда
			ТекстСообщения = НСтр("es='¡El objeto dado asiste ya en el documento!';ru='Данный объект уже присутствует в документе!';en='This object is already in the document!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРемонтаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если Не ОтменаРедактирования Тогда 
		ОбъектыРемонтаПриАктивизацииСтроки(Элементы.ОбъектыРемонта);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРемонтаОбъектРемонтаПриИзменении(Элемент)
	
	Если мОтображатьПоложение Тогда
		ЗаполнитьПоложениеОРВстроке(Элементы.ОбъектыРемонта.ТекущиеДанные);
	КонецЕсли;
	
	Если Элементы.ОбъектыРемонта.ТекущиеДанные.ИзменятьСостояниеПодчиненныхОР Тогда
		ПроверитьРаспространениеНаПодчиненных();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРемонтаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		
		СписокДобавленныхОбъектов = Новый массив;
		
		Если ВыбранноеЗначение.Свойство("ОбъектРемонта") Тогда
			
			Если ТипЗнч(ВыбранноеЗначение.ОбъектРемонта) = Тип("Массив") Тогда
				
				Для каждого ОбъектРемонта из ВыбранноеЗначение.ОбъектРемонта Цикл
					Если НЕ ОбъектРемонтаУжеДобавлен(ОбъектРемонта) Тогда
						НС = Объект.ОбъектыРемонта.Добавить();
						НС.ОбъектРемонта = ОбъектРемонта;
						НС.Иерархия = ТекСтруктураИерархии;
						
						Элементы.ОбъектыРемонта.ТекущаяСтрока = НС.ПолучитьИдентификатор();
						ОбъектыРемонтаОбъектРемонтаПриИзменении(Элементы.ОбъектыРемонта);
						
						СписокДобавленныхОбъектов.Добавить(ОбъектРемонта);
					КонецЕсли;
				КонецЦикла;
				
			Иначе
				
				Если НЕ ОбъектРемонтаУжеДобавлен(ВыбранноеЗначение.ОбъектРемонта) Тогда
					НС = Объект.ОбъектыРемонта.Добавить();
					НС.ОбъектРемонта = ВыбранноеЗначение.ОбъектРемонта;
					НС.Иерархия = ТекСтруктураИерархии;
					
					Элементы.ОбъектыРемонта.ТекущаяСтрока = НС.ПолучитьИдентификатор();
					ОбъектыРемонтаОбъектРемонтаПриИзменении(Элементы.ОбъектыРемонта);
					
					СписокДобавленныхОбъектов.Добавить(ВыбранноеЗначение.ОбъектРемонта);
				КонецЕсли;
				
			КонецЕсли;
				
		КонецЕсли;
		
		Если ВыбранноеЗначение.Свойство("ЗаполнитьПоНормативам") И ВыбранноеЗначение.ЗаполнитьПоНормативам = Истина Тогда
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("МассивОР", СписокДобавленныхОбъектов);
			
			СтруктураПараметров.Вставить("ЗапрашиватьВидРемонтныхРабот", ВыбранноеЗначение.ЗапрашиватьВидРемонтныхРабот);
			СтруктураПараметров.Вставить("ЗапрашиватьВидПараметровНаработки", ВыбранноеЗначение.ЗапрашиватьВидПараметровНаработки);
			СтруктураПараметров.Вставить("ЗапрашиватьВидИзмеряемыхПоказателей", ВыбранноеЗначение.ЗапрашиватьВидИзмеряемыхПоказателей);
			
			СтруктураПараметров.Вставить("СоответствиеОР_ВидыРемонта", ВыбранноеЗначение.СоответствиеОР_ВидыРемонта);
			СтруктураПараметров.Вставить("СоответствиеОР_ПараметрыНаработки", ВыбранноеЗначение.СоответствиеОР_ПараметрыНаработки);
			СтруктураПараметров.Вставить("СоответствиеОР_ИзмеряемыеПоказатели", ВыбранноеЗначение.СоответствиеОР_ИзмеряемыеПоказатели);
			
			НачатьЗаполнениеяПоНормативамПослеПодбора(СтруктураПараметров);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//////////////////////////////////////////////

&НаКлиенте
Процедура НачатьЗаполнениеяПоНормативамПослеПодбора(СтруктураПараметров)

	Если СтруктураПараметров.ЗапрашиватьВидРемонтныхРабот И СтруктураПараметров.СоответствиеОР_ВидыРемонта.Количество() > 0 Тогда
		ОбщийСписокВидовРемонта = ПолучитьСписокРазличныхЗначенийИзСоответствия(СтруктураПараметров.СоответствиеОР_ВидыРемонта);
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораВидовРемонта", ЭтотОбъект, СтруктураПараметров);
		
		ТекстЗаголовкаОкна = НСтр("es='Escojan los tipos de los trabajos de reparación';ru='Выберите виды ремонтных работ';en='Choose types of repair work'");
		ОбщийСписокВидовРемонта.ПоказатьОтметкуЭлементов(ОписаниеОповещения, ТекстЗаголовкаОкна);
	Иначе
		ПослеВыбораВидовРемонта(Неопределено, СтруктураПараметров);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораВидовРемонта(ОбщийСписокВидовРемонта, СтруктураПараметров) Экспорт

	Если СтруктураПараметров.ЗапрашиватьВидРемонтныхРабот Тогда
		Если ОбщийСписокВидовРемонта = Неопределено Тогда
			СтруктураПараметров.Вставить("СоответствиеОР_ВидыРемонта", Неопределено);
		Иначе
			ОтфильтрованноеСоответствиеОР = ОтфильтроватьСоответствиеОРПоМассивуВыбранныхЗначений(СтруктураПараметров.СоответствиеОР_ВидыРемонта, ОбщийСписокВидовРемонта);
			СтруктураПараметров.Вставить("СоответствиеОР_ВидыРемонта", ОтфильтрованноеСоответствиеОР);
		КонецЕсли;
	КонецЕсли;
	
	Если СтруктураПараметров.ЗапрашиватьВидИзмеряемыхПоказателей И СтруктураПараметров.СоответствиеОР_ИзмеряемыеПоказатели.Количество() > 0 Тогда
		ОбщийСписокКонтролируемыхПоказателей = ПолучитьСписокРазличныхЗначенийИзСоответствия(СтруктураПараметров.СоответствиеОР_ИзмеряемыеПоказатели);
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораКонтролируемыхПоказателей", ЭтотОбъект, СтруктураПараметров);
		
		ТекстЗаголовкаОкна = НСтр("es='Escojan los tipos de los índices controlados';ru='Выберите виды контролируемых показателей';en='Choose types of indicators to be monitored'");
		ОбщийСписокКонтролируемыхПоказателей.ПоказатьОтметкуЭлементов(ОписаниеОповещения, ТекстЗаголовкаОкна);
	Иначе
		ПослеВыбораКонтролируемыхПоказателей(Неопределено, СтруктураПараметров);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКонтролируемыхПоказателей(ОбщийСписокКонтролируемыхПоказателей, СтруктураПараметров) Экспорт

	Если СтруктураПараметров.ЗапрашиватьВидИзмеряемыхПоказателей Тогда
		Если ОбщийСписокКонтролируемыхПоказателей = Неопределено Тогда
			СтруктураПараметров.Вставить("СоответствиеОР_ИзмеряемыеПоказатели", Неопределено);
		Иначе
			ОтфильтрованноеСоответствиеОР = ОтфильтроватьСоответствиеОРПоМассивуВыбранныхЗначений(СтруктураПараметров.СоответствиеОР_ИзмеряемыеПоказатели, ОбщийСписокКонтролируемыхПоказателей);
			СтруктураПараметров.Вставить("СоответствиеОР_ИзмеряемыеПоказатели", ОтфильтрованноеСоответствиеОР);
		КонецЕсли;
	КонецЕсли;

	Если СтруктураПараметров.ЗапрашиватьВидПараметровНаработки И СтруктураПараметров.СоответствиеОР_ПараметрыНаработки.Количество() > 0 Тогда
		ОбщийСписокПараметровНаработки = ПолучитьСписокРазличныхЗначенийИзСоответствия(СтруктураПараметров.СоответствиеОР_ПараметрыНаработки);
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораПараметровНаработки", ЭтотОбъект, СтруктураПараметров);
		
		ТекстЗаголовкаОкна = НСтр("es='Escojan los tipos de los parámetros de la elaboración';ru='Выберите виды параметров наработки';en='Select the types of running hours'");
		ОбщийСписокПараметровНаработки.ПоказатьОтметкуЭлементов(ОписаниеОповещения, ТекстЗаголовкаОкна);
	Иначе
		ПослеВыбораПараметровНаработки(Неопределено, СтруктураПараметров);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПараметровНаработки(ОбщийСписокПараметровНаработки, СтруктураПараметров) Экспорт

	Если СтруктураПараметров.ЗапрашиватьВидПараметровНаработки Тогда
		Если ОбщийСписокПараметровНаработки = Неопределено Тогда
			СтруктураПараметров.Вставить("СоответствиеОР_ПараметрыНаработки", Неопределено);
		Иначе
			ОтфильтрованноеСоответствиеОР = ОтфильтроватьСоответствиеОРПоМассивуВыбранныхЗначений(СтруктураПараметров.СоответствиеОР_ПараметрыНаработки, ОбщийСписокПараметровНаработки);
			СтруктураПараметров.Вставить("СоответствиеОР_ПараметрыНаработки", ОтфильтрованноеСоответствиеОР);
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьДанныеПоОбъектамРемонтов(СтруктураПараметров);
	
КонецПроцедуры

/////////////////////////////////////////////

&НаКлиенте
Процедура ОбъектыРемонтаТекущееСостояниеПриИзменении(Элемент)
	
	УстановитьВидимостьКолонкиПричина();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРемонтаПричинаПростояПриИзменении(Элемент)
	УстановитьВидимостьКолонкиПричина();
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРемонтаОбъектРемонтаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СписокДоступныхСтатусов = торо_СтатусыОРВУчете.СписокСтатусовДляПодбора(Истина);
	
	ПараметрыОтбора = Новый Структура("СписокСтатусов", СписокДоступныхСтатусов);
	ПараметрыОтбора.Вставить("СтруктураИерархии",       ТекСтруктураИерархии);
	
	ОткрытьФорму("Справочник.торо_ОбъектыРемонта.ФормаВыбора",ПараметрыОтбора,Элемент,,ВариантОткрытияОкна.ОтдельноеОкно,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРемонтаОбъектРемонтаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыВыбора, Ожидание, СтандартнаяОбработка)
	ПараметрыВыбора.Отбор.Вставить("Документ", Строка(ТипЗнч(Объект.Ссылка)));
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРемонтаОбъектРемонтаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыВыбора, СтандартнаяОбработка)
	ПараметрыВыбора.Отбор.Вставить("Документ", Строка(ТипЗнч(Объект.Ссылка)));
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРемонтаИзменятьСостояниеПодчиненныхОРПриИзменении(Элемент)
	
	Если Элементы.ОбъектыРемонта.ТекущиеДанные.Иерархия <> ПредопределенноеЗначение("Справочник.торо_СтруктурыОР.ПустаяСсылка") Тогда
		ПроверитьРаспространениеНаПодчиненных();
	Иначе
		Элементы.ОбъектыРемонта.ТекущиеДанные.ИзменятьСостояниеПодчиненныхОР = Ложь;
		ТекстСообщения = НСтр("es='¡Es imposible determinar los objetos subordinados de la reparación no es escogida la jerarquía! ¡Escojan la jerarquía!';ru='Невозможно определить подчиненные объекты ремонта пока не выбрана иерархия! Выберите иерархию!';en='Unable to define subordinate repair objects until a hierarchy is selected! Choose a hierarchy!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРемонтаИерархияПриИзменении(Элемент)
	
	Если Элементы.ОбъектыРемонта.ТекущиеДанные.Иерархия <> ПредопределенноеЗначение("Справочник.торо_СтруктурыОР.ПустаяСсылка") Тогда
		Если Элементы.ОбъектыРемонта.ТекущиеДанные.ИзменятьСостояниеПодчиненныхОР Тогда
			ПроверитьРаспространениеНаПодчиненных();
		КонецЕсли;
	Иначе
		Элементы.ОбъектыРемонта.ТекущиеДанные.ИзменятьСостояниеПодчиненныхОР = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРемонтаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.Иерархия = ТекСтруктураИерархии;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРемонтаОбъектРемонтаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.ОбъектыРемонта.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ОбъектРемонта) Тогда
		ПараметрыФормы = Новый Структура("Ключ, СтруктураИерархии", ТекущиеДанные.ОбъектРемонта, ТекСтруктураИерархии);
		ОткрытьФорму("Справочник.торо_ОбъектыРемонта.ФормаОбъекта", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВыполненныеРаботы
&НаКлиенте
Процедура ВыполненныеРаботыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если Не Копирование Тогда 
		ТекущаяСтрока = Элементы.ОбъектыРемонта.ТекущиеДанные;
		Если ТекущаяСтрока = Неопределено Или Не ЗначениеЗаполнено(ТекущаяСтрока.ОбъектРемонта) Тогда 
			
			Отказ = Истина;
			ПоказатьПредупреждение(Неопределено, НСтр("es='¡Indiquen el Objeto de la reparación!';ru='Укажите Объект ремонта!';en='Specify the object of repair!'"), 20);
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполненныеРаботыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		
		ТекДанные = Элемент.ТекущиеДанные;
		
		Если Не Копирование Тогда
			
			ТекСтрока = Элементы.ОбъектыРемонта.ТекущиеДанные;
			ТекДанные.ОбъектРемонта = ТекСтрока.ОбъектРемонта;
			Если Элемент = Элементы.НаработкаОбъектыРемонта Тогда 
				ТекДанные.ДатаРаботыС	= ПолучитьДатуВводаВЭксплуатацию(ТекСтрока.ОбъектРемонта);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполненныеРаботыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если Не (НоваяСтрока И ОтменаРедактирования) Тогда
		ДатаВыпуска = ПолучитьДатуВыпуска(Элемент.ТекущиеДанные.ОбъектРемонта);
		Если Элемент.ТекущиеДанные.ДатаОкончанияРемонта < ДатаВыпуска Тогда
			ТекстСообщения = НСтр("es='¡La fecha de la terminación de la reparación no puede ser menos de fechas de la salida del objeto de la reparación!';ru='Дата окончания ремонта не может быть меньше даты выпуска объекта ремонта!';en='The end date of the repair cannot be less than the date of issue of the repair object!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЕсли;
		
		ТекДанные = Элементы.ВыполненныеРаботы.ТекущиеДанные;
		Если НЕ ЗначениеЗаполнено(ТекДанные.ВидРемонтныхРабот) Тогда
			ТекстСообщения = НСтр("es='¡Es necesario rellenar ""el Tipo de los trabajos de reparación""!';ru='Необходимо заполнить ""Вид ремонтных работ""!';en='Required to fill in the ""Type of repair work""!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		Иначе
			СтруктураПоиска = Новый Структура("ОбъектРемонта, ВидРемонтныхРабот, ДатаОкончанияРемонта", ТекДанные.ОбъектРемонта, ТекДанные.ВидРемонтныхРабот, ТекДанные.ДатаОкончанияРемонта);
			НайденныеСтроки = Объект.ВыполненныеРаботы.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() > 1 Тогда
				ШаблонСообщения = НСтр("es='¡Para el objeto de la reparación ""%1"" son indicados ya los datos por la forma los trabajos de reparación ""%2""!';ru='Для объекта ремонта ""%1"" уже указаны данные по виду ремонтных работ ""%2""!';en='For repair object ""%1"" data for repair type ""%2"" is already indicated!'");
				ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекДанные.ОбъектРемонта, ТекДанные.ВидРемонтныхРабот);
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРегламентныеМероприятия
&НаКлиенте
Процедура РегламентныеМероприятияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если Не Копирование Тогда 
		ТекущаяСтрока = Элементы.СпискиОбъектовРемонта.ТекущиеДанные;
		Если ТекущаяСтрока = Неопределено Или Не ЗначениеЗаполнено(ТекущаяСтрока.СписокОбъектов) Тогда 
			
			Отказ = Истина;
			ПоказатьПредупреждение(Неопределено, НСтр("es='¡Indiquen la lista de los objetos de la reparación!';ru='Укажите список объектов ремонта!';en='Specify the list of repair objects!'"), 20);
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РегламентныеМероприятияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекДанные = Элемент.ТекущиеДанные;
		Если Не Копирование Тогда
			ТекСтрока = Элементы.СпискиОбъектовРемонта.ТекущиеДанные;
			ТекДанные.СписокОбъектов = ТекСтрока.СписокОбъектов;
		КонецЕсли;		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РегламентныеМероприятияПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
		
	Если Не (НоваяСтрока И ОтменаРедактирования) Тогда
		ТекДанные = Элементы.РегламентныеМероприятия.ТекущиеДанные;
		Если НЕ ЗначениеЗаполнено(ТекДанные.ВидМероприятия) Тогда
			ТекстСообщения = НСтр("es='¡Es necesario rellenar ""el Tipo de la medida""!';ru='Необходимо заполнить ""Вид мероприятия""!';en='Required to fill in the ""Event Type""!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		Иначе
			СтруктураПоиска = Новый Структура("СписокОбъектов, ВидМероприятия, ДатаПоследнегоМероприятия", ТекДанные.СписокОбъектов, ТекДанные.ВидМероприятия, ТекДанные.ДатаПоследнегоМероприятия);
			НайденныеСтроки = Объект.РегламентныеМероприятия.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() > 1 Тогда
				ШаблонСообщения = НСтр("es='¡Para la lista de los objetos de la reparación ""%1"" son indicadas ya las medidas dadas por la forma ""%2""!';ru='Для списка объектов ремонта ""%1"" уже указаны данные по виду мероприятия ""%2""!';en='The list of repair objects ""%1"" already contains data on the type of event ""%2""!'");
				ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекДанные.СписокОбъектов, ТекДанные.ВидМероприятия);
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНаработкаОбъектыРемонта
&НаКлиенте
Процедура НаработкаОбъектыРемонтаПоказательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекСтрока = Элементы.ОбъектыРемонта.ТекущиеДанные;
	
	СписокОтбора = ПолучитьПоказателиНаработкиОР(ТекСтрока.ОбъектРемонта);
	ФормаВыбораПоказателя = ПолучитьФорму("Справочник.ПараметрыВыработкиОС.ФормаВыбора", Новый Структура("СписокПараметровНаработки", СписокОтбора),Элемент, Объект.Ссылка);
	
	ФормаВыбораПоказателя.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура НаработкаОбъектыРемонтаПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если НЕ (НоваяСтрока И ОтменаРедактирования) И ЗначениеЗаполнено(Элемент.ТекущиеДанные.ДатаРаботыПо) Тогда
		ТекСтрока = Элемент.ТекущиеДанные;
		ДатаВвода = ТекСтрока.ДатаРаботыС;
		ДатаРаботыПо = ТекСтрока.ДатаРаботыПо;
		Если ДатаВвода >= ДатаРаботыПо Тогда
			ТекстСообщения = НСтр("es='""¡La fecha del trabajo por"" no puede ser menos de fechas de la introducción en la explotación!';ru='""Дата работы по"" не может быть меньше даты ввода в эксплуатацию!';en='""Date of work on"" can not be less than the date of commissioning!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЕсли;
		
		Показатель = ТекСтрока.Показатель;
		ОбъектРемонта = ТекСтрока.ОбъектРемонта;
		Если ЗначениеЗаполнено(Показатель) Тогда
			Отбор = Новый Структура("ОбъектРемонта,Показатель",ОбъектРемонта,Показатель);
			МассивСрезПервых = ПолучитьНачалоДействияПоказателяНаработки(Отбор);
			Если МассивСрезПервых.Количество() = 0 ИЛИ МассивСрезПервых[0] > ДатаРаботыПо Тогда
				ТекстСообщения = НСтр("es='""¡La fecha del trabajo por"" no puede ser menos de fechas del comienzo de la acción del índice de la elaboración!';ru='""Дата работы по"" не может быть меньше даты начала действия показателя наработки!';en='""Date of work on"" can not be less than the start date of the operating time indicator!'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			КонецЕсли;
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура("ОбъектРемонта, Показатель, ДатаРаботыПо",
			ТекСтрока.ОбъектРемонта, ТекСтрока.Показатель, ТекСтрока.ДатаРаботыПо);
		НайденныеСтроки = Объект.НаработкаОбъектыРемонта.НайтиСтроки(СтруктураПоиска);
		
		Если НайденныеСтроки.Количество() > 1 Тогда
			ШаблонСообщения = НСтр("es='¡Para el objeto de la reparación ""%1"" es indicada ya la elaboración por el índice ""%2"" a la fecha de %3!';ru='Для объекта ремонта ""%1"" уже указана наработка по показателю ""%2"" на дату %3!';en='For repair object ""%1"", the operating time for the indicator ""%2"" on the date%3 has already been indicated!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекСтрока.ОбъектРемонта, ТекСтрока.Показатель, ТекСтрока.ДатаРаботыПо);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,Отказ);	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаработкаОбъектыРемонтаПоказательАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.ОбъектыРемонта.ТекущиеДанные;
	СписокОтбора = ПолучитьПоказателиНаработкиОР(ТекСтрока.ОбъектРемонта);
	Параметры.Отбор.Вставить("Ссылка", СписокОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура НаработкаОбъектыРемонтаПоказательОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		ТекСтрока = Элементы.ОбъектыРемонта.ТекущиеДанные;
		СписокОтбора = ПолучитьПоказателиНаработкиОР(ТекСтрока.ОбъектРемонта);
		Если СписокОтбора.НайтиПоЗначению(ВыбранноеЗначение) = Неопределено Тогда
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПоказателиОбъектыРемонта

&НаКлиенте
Процедура ПоказателиОбъектыРемонтаПоказательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элементы.ПоказателиОбъектыРемонта.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено И Не ЗначениеЗаполнено(ТекДанные.ОбъектРемонта) Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("es='¡Para la elección del significado del índice controlado es necesario indicar el objeto de la reparación!';ru='Для выбора значения контролируемого показателя необходимо указать объект ремонта!';en='To select the value of the controlled indicator, the object of repair must be specified!'"), 60);
		Возврат;
	КонецЕсли;
	
	СписокПоказателей = ПолучитьИзмеряемыеПоказателиОР(ТекДанные.ОбъектРемонта);
	
	ПараметрыОтбора = Новый Структура("Ссылка", СписокПоказателей);
	ПараметрыФормы = Новый Структура("Отбор", ПараметрыОтбора);
	
	ОткрытьФорму("ПланВидовХарактеристик.торо_ИзмеряемыеПоказателиОбъектовРемонта.ФормаВыбора", ПараметрыФормы, Элемент, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиОбъектыРемонтаПоказательАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.ОбъектыРемонта.ТекущиеДанные;
	СписокОтбора = ПолучитьИзмеряемыеПоказателиОР(ТекСтрока.ОбъектРемонта);
	Параметры.Отбор.Вставить("Ссылка", СписокОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиОбъектыРемонтаПоказательОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		ТекСтрока = Элементы.ОбъектыРемонта.ТекущиеДанные;
		СписокОтбора = ПолучитьИзмеряемыеПоказателиОР(ТекСтрока.ОбъектРемонта);
		Если СписокОтбора.НайтиПоЗначению(ВыбранноеЗначение) = Неопределено Тогда
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиОбъектыРемонтаПоказательОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.ОбъектыРемонта.ТекущиеДанные;
	СписокОтбора = ПолучитьИзмеряемыеПоказателиОР(ТекСтрока.ОбъектРемонта);
	ПараметрыПолученияДанных.Отбор.Вставить("Ссылка", СписокОтбора);

КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗапчастиОбъектаРемонта
&НаКлиенте
Процедура ЗапчастиОбъектаРемонтаПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если Не (НоваяСтрока И ОтменаРедактирования) Тогда
	
		ТекДанные = Элемент.ТекущиеДанные;
		Если ТекДанные <> Неопределено Тогда
			
			Если НЕ ЗначениеЗаполнено(ТекДанные.Номенклатура) Тогда
				ТекстСообщения = НСтр("es='¡Es necesario rellenar el campo ""la Nomenclatura""!';ru='Необходимо заполнить поле ""Номенклатура""!';en='Required to fill in the field ""Nomenclature""!'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ТекДанные.Количество) Тогда
				ТекстСообщения = НСтр("es='¡Es necesario rellenar ""la Cantidad""!';ru='Необходимо заполнить ""Количество""!';en='Required to fill in the ""Quantity""!'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			КонецЕсли;
			
			СтруктураПоиска = Новый Структура("ОбъектРемонта, Номенклатура, СерийныйНомер, СтатусДвиженияЗЧ",
									ТекДанные.ОбъектРемонта, ТекДанные.Номенклатура, ТекДанные.СерийныйНомер,ТекДанные.СтатусДвиженияЗЧ);
			НайденныеСтроки = Объект.ЗапчастиОбъектаРемонта.НайтиСтроки(СтруктураПоиска);
			
			Если НайденныеСтроки.Количество() > 1 Тогда
				Если ЗначениеЗаполнено(ТекДанные.СерийныйНомер) Тогда
					ШаблонСообщения = НСтр("es='¡Para el objeto de la reparación ""%1"" son indicados ya los datos de las partes de recambio ""%2"" con serie ""%3"" y el estatus del movimiento ""%4""!';ru='Для объекта ремонта ""%1"" уже указаны данные по запчасти ""%2"" с серией ""%3"" и статусом движения ""%4""!';en='For repair object ""%1"" the data for spare part ""%2"" with series ""%3"" and movement status ""%4"" is already indicated!'");
					ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекДанные.ОбъектРемонта,ТекДанные.Номенклатура,ТекДанные.СерийныйНомер,ТекДанные.СтатусДвиженияЗЧ);
				Иначе
					ШаблонСообщения = НСтр("es='¡Para el objeto de la reparación ""%1"" son indicados ya los datos de las partes de recambio ""%2"" con el estatus del movimiento ""%3""!';ru='Для объекта ремонта ""%1"" уже указаны данные по запчасти ""%2"" со статусом движения ""%3""!';en='For repair object ""%1"", the data for spare part ""%2"" with movement status ""%3"" is already indicated!'");
					ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекДанные.ОбъектРемонта,ТекДанные.Номенклатура,ТекДанные.СтатусДвиженияЗЧ);
				КонецЕсли;
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,Отказ);	
			КонецЕсли;
		
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапчастиОбъектаРемонтаНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ЗапчастиОбъектаРемонта.ТекущиеДанные;

	ТекущаяСтрока.СерииИспользуются = ПолучитьСерииИспользуются(ТекущаяСтрока.Номенклатура);
	ТекущаяСтрока.СерийныйНомер = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапчастиОбъектаРемонтаНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "ВидНоменклатуры");
		ТипНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидНоменклатуры, "ТипНоменклатуры");
		Если ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга") Тогда
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапчастиОбъектаРемонтаНоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	РазрешенныеВмдыНоменклатуры = ПолучитьВидыНоменклатурыНеУслуги();
	ПараметрыПолученияДанных.Отбор.Вставить("ВидНоменклатуры", РазрешенныеВмдыНоменклатуры);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВидыНоменклатурыНеУслуги()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыНоменклатуры.Ссылка
	|ИЗ
	|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|ГДЕ
	|	ВидыНоменклатуры.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)";
	
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат.ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаКлиенте
Процедура ЗапчастиОбъектаРемонтаСерийныйНомерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ЗапчастиОбъектаРемонта.ТекущиеДанные;
	
	Если Не ТекДанные = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		Форма = ПолучитьФорму("Справочник.СерииНоменклатуры.ФормаВыбора",,Элемент);
		
		ПользовательскийОтбор = Форма.Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Форма.Список.КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки);
		ПользовательскийОтбор.Элементы.Очистить();
		
		ЭлементОтбора = ПользовательскийОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение     = Новый ПолеКомпоновкиДанных("ВидНоменклатуры");
		ЭлементОтбора.ВидСравнения      = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование 	= Истина;
		ЭлементОтбора.ПравоеЗначение 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекДанные.Номенклатура, "ВидНоменклатуры");
		
		Форма.Открыть();
		
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапчастиОбъектаРемонтаСерийныйНомерОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ЗапчастиОбъектаРемонта.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущиеДанные.Номенклатура, "ВидНоменклатуры");
		ВидНоменклатурыВыбранный = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "ВидНоменклатуры");
		Если ВидНоменклатуры <> ВидНоменклатурыВыбранный Тогда
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗапчастиОбъектаРемонтаСерийныйНомерАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если Ожидание > 0 Тогда
		ТекущиеДанные = Элементы.ЗапчастиОбъектаРемонта.ТекущиеДанные;
		ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущиеДанные.Номенклатура, "ВидНоменклатуры");
		ПараметрыПолученияДанных.Отбор.Вставить("ВидНоменклатуры",ВидНоменклатуры);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗапчастиОбъектаРемонтаСерийныйНомерОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ЗапчастиОбъектаРемонта.ТекущиеДанные;
	ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущиеДанные.Номенклатура, "ВидНоменклатуры");
	ПараметрыПолученияДанных.Отбор.Вставить("ВидНоменклатуры",ВидНоменклатуры);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПоказателиОбъектыРемонта
&НаКлиенте
Процедура ПоказателиОбъектыРемонтаДатаКонтроляПриИзменении(Элемент)
	
	ТекДанные = Элементы.ПоказателиОбъектыРемонта.ТекущиеДанные;
	Если ТекДанные <> Неопределено И ЗначениеЗаполнено(ТекДанные.Показатель) Тогда
		СтруктураВозврата = ПолучитьЗначенияИзмеряемыхПоказателейНаСервере(ТекДанные.ОбъектРемонта, ?(ЗначениеЗаполнено(ТекДанные.ДатаКонтроля),ТекДанные.ДатаКонтроля, Объект.Дата), ТекДанные.Показатель);
		ЗаполнитьЗначенияСвойств(ТекДанные, СтруктураВозврата);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиОбъектыРемонтаПоказательПриИзменении(Элемент)
	
	ТекДанные = Элементы.ПоказателиОбъектыРемонта.ТекущиеДанные;
	Если ТекДанные <> Неопределено И ЗначениеЗаполнено(ТекДанные.Показатель) Тогда
		СтруктураВозврата = ПолучитьЗначенияИзмеряемыхПоказателейНаСервере(ТекДанные.ОбъектРемонта, ?(ЗначениеЗаполнено(ТекДанные.ДатаКонтроля),ТекДанные.ДатаКонтроля, Объект.Дата), ТекДанные.Показатель);
		ЗаполнитьЗначенияСвойств(ТекДанные, СтруктураВозврата);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиОбъектыРемонтаПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекДанные = Элементы.ПоказателиОбъектыРемонта.ТекущиеДанные;
	Если Элементы.ОбъектыРемонта.ТекущиеДанные <> Неопределено Тогда
		ТекДанные.ОбъектРемонта = Элементы.ОбъектыРемонта.ТекущиеДанные.ОбъектРемонта;
	КонецЕсли; 
	
	Если Не ((НоваяСтрока И ОтменаРедактирования) ИЛИ ТекДанные = Неопределено) Тогда
		Если Не ЗначениеЗаполнено(ТекДанные.Показатель) Тогда
			ТекстСообщения = НСтр("es='¡Escojan el índice controlado!';ru='Выберите контролируемый показатель!';en='Choose a controlled indicator!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ТекДанные.ДатаКонтроля) Тогда
			ТекстСообщения = НСтр("es='¡Indiquen la fecha del control!';ru='Укажите дату контроля!';en='Specify the date of control!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЕсли;
		СтруктураПоиска = Новый Структура("ОбъектРемонта, ДатаКонтроля, Показатель", ТекДанные.ОбъектРемонта, ТекДанные.ДатаКонтроля, ТекДанные.Показатель);
		Если Объект.ПоказателиОбъектыРемонта.НайтиСтроки(СтруктураПоиска).Количество() > 1 Тогда
			ШаблонСообщения = НСтр("es='¡Para el objeto de la reparación ""%1"" a la fecha del control ""%2"" es indicado ya el significado del índice ""%3""!';ru='Для объекта ремонта ""%1"" на дату контроля ""%2"" уже указано значение показателя ""%3""!';en='For the repair object ""%1"", the value of the indicator ""%3"" is already indicated on the inspection date ""%2!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекДанные.ОбъектРемонта, ТекДанные.ДатаКонтроля, ТекДанные.Показатель);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПускиОР

&НаКлиенте
Процедура ПускиОРПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекДанные = Элементы.ПускиОР.ТекущиеДанные;
	Если ТекДанные <> Неопределено И НЕ ОтменаРедактирования Тогда 
		Если НЕ ЗначениеЗаполнено(ТекДанные.ВидПуска) Тогда
			ТекстСообщения = НСтр("es='¡Es necesario rellenar ""el Tipo de la puesta en marcha""!';ru='Необходимо заполнить ""Вид пуска""!';en='Required to fill in the ""Startup Type""!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		Иначе
			СтруктураПоиска = Новый Структура("ОбъектРемонта, ВидПуска", ТекДанные.ОбъектРемонта, ТекДанные.ВидПуска);
			НайденныеСтроки = Объект.ПускиОР.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() > 1 Тогда
				ШаблонСообщения = НСтр("es='¡Para el objeto de la reparación ""%1"" son indicados ya los datos por la forma la puesta en marcha ""%2""!';ru='Для объекта ремонта ""%1"" уже указаны данные по виду пуска ""%2""!';en='For repair object ""%1"" data for start-up type ""%2"" is already indicated!'");
				ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекДанные.ОбъектРемонта, ТекДанные.ВидПуска);
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			КонецЕсли;
		КонецЕсли;
		
		Если ТекДанные.Количество = 0 Тогда
			ТекстСообщения = НСтр("es='¡Es necesario rellenar ""la Cantidad""!';ru='Необходимо заполнить ""Количество""!';en='Required to fill in the ""Quantity""!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура НастройкаИерархии(Команда)
	
	ПараметрыДляПередачи = Новый Структура("ТекСтруктураИерархии", ТекСтруктураИерархии);
	ОткрытьФорму("Документ.торо_ВыявленныеДефекты.Форма.ФормаНастройкиВидаИерархии", ПараметрыДляПередачи, ЭтаФорма, Объект.Ссылка,,,Новый ОписаниеОповещения("НастройкаИерархииЗавершение",ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьПоложение(Команда)
	
	Кнопка = Элементы.ОбъектыРемонтаОтображатьПоложение;
	Кнопка.Пометка = НЕ Кнопка.Пометка;	
	Элементы.ОбъектыРемонтаПоложение.Видимость = Кнопка.Пометка;
	Если Кнопка.Пометка Тогда
		ЗаполнитьПоложенияОР(); 
	КонецЕсли;
	
	мОтображатьПоложение = Кнопка.Пометка;
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КлючНазначенияИспользования", "торо_ВводНачальныхДанных");
	ПараметрыФормы.Вставить("ДатаДокумента", Объект.Дата);
	ПараметрыФормы.Вставить("СтруктураИерархии", ТекСтруктураИерархии);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	
	ОткрытьФорму("Обработка.торо_ПодборОбъектовРемонтныхРабот.Форма.ФормаПодбораОбъектовДляПланаГрафикаППР",
		ПараметрыФормы, Элементы.ОбъектыРемонта, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// Оформление поля Серия для запчастей.	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗапчастиОбъектаРемонтаСерийныйНомер.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ЗапчастиОбъектаРемонта.СерииИспользуются");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.НейтральноСерый);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("es='<unas series no se usan>';ru='<серии не используются>';en='<серии не используются>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного",Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность",Ложь);
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначенияИзмеряемыхПоказателейНаСервере(ОбъектРемонта, ДатаКонтроля, Показатель = Неопределено)
	
	МассивПоказателей = ПланыВидовХарактеристик.торо_ИзмеряемыеПоказателиОбъектовРемонта.ПолучитьСтруктуруИзмеряемыхПоказателейОбъектовРемонта(ОбъектРемонта,Показатель,Истина);
	
	Если МассивПоказателей.Количество() > 0 Тогда
		СтруктураВозврата = МассивПоказателей[0];
	Иначе
		СтруктураВозврата = Новый Структура;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПоложенияОР()
	
	МассивОР = Новый Массив;
	Для каждого Стр Из Объект.ОбъектыРемонта Цикл
		МассивОР.Добавить(Стр.ОбъектРемонта);		
	КонецЦикла; 
	
	СтруктураПоложений = торо_РаботаСИерархией20.ПолучитьТекущихРодителейВИерархии(МассивОР, ТекСтруктураИерархии,,Истина,Истина);
	
	Для каждого Строка из Объект.ОбъектыРемонта Цикл
		Строка.Положение = СтруктураПоложений[Строка.ОбъектРемонта];
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоложениеОРВстроке(ТекущиеДанные)
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Положение = торо_РаботаСИерархией20.ПолучитьТекущегоРодителяВИерархии(ТекущиеДанные.ОбъектРемонта, ТекСтруктураИерархии,,Истина,Истина);
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьТаблицуПодчиненныхОР()
	
	Для Каждого Строка Из Объект.ОбъектыРемонта Цикл
		Если Строка.ИзменятьСостояниеПодчиненныхОР Тогда
			МассивПодчиненных = торо_РаботаСИерархией20.ПолучитьМассивПодчиненныхОбъектов(Строка.ОбъектРемонта, Строка.Иерархия, Объект.Дата);
			ПроверитьРаспространениеНаПодчиненныхЗаполнитьПодчиненными(МассивПодчиненных, Строка.ОбъектРемонта);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьРаспространениеНаПодчиненных()
	
	ТекДанные = Элементы.ОбъектыРемонта.ТекущиеДанные;
	Если ТекДанные.ИзменятьСостояниеПодчиненныхОР Тогда
		СписокПодчиненныхОбъектов = торо_РаботаСИерархией20.ПолучитьМассивПодчиненныхОбъектов(ТекДанные.ОбъектРемонта, ТекДанные.Иерархия, Объект.Дата);
		
		ОРРодители = Новый Массив;
		
		Для Каждого ПодчиненныйОбъект Из СписокПодчиненныхОбъектов Цикл
			
			СтруктураОтбора = Новый Структура("ОбъектРемонта", ПодчиненныйОбъект);
			
			НайденныеСтроки = ТаблицаПодчиненныхОбъектов.НайтиСтроки(СтруктураОтбора);
			Для Каждого Строка Из НайденныеСтроки Цикл
				Если ОРРодители.Найти(Строка.Родитель) = Неопределено Тогда
					ОРРодители.Добавить(Строка.Родитель);
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
		
		Если ОРРодители.Количество() Тогда
			
			Если ОРРодители.Количество() = 1 Тогда
				ШаблонВопроса = НСтр("es='En unos o plusieurs los objetos de la reparación de los subordinados %1 se distribuyen ya los estados del objeto ';ru='На один или несколько объектов ремонта подчиненных %1 уже распространяются состояния из объекта ';en='One or more repair objects of subordinates%1 are already subject to condition from the object '");
				ТекстВопроса = СтрШаблон(ШаблонВопроса, ТекДанные.ОбъектРемонта);
				Для Каждого Родитель Из ОРРодители Цикл
					ТекстВопроса = ТекстВопроса + Родитель + ", ";
				КонецЦикла;
				ТекстВопроса = Лев(ТекстВопроса,СтрДлина(ТекстВопроса) - 2);
				ТекстВопроса = ТекстВопроса + НСтр("es='. Si continuar esto el objeto dado difundir los estados en subordinado dejará. ¿De continuar?';ru='. Если продолжить то данный объект распространять состояния на подчиненные перестанет. Продолжить?';en='. If continuing, this object will no longer distribute the state to subordinates. Continuing?'");
			Иначе
				ШаблонВопроса = НСтр("es='En unos o plusieurs los objetos de la reparación de los subordinados %1 se distribuyen ya los estados de los objetos ';ru='На один или несколько объектов ремонта подчиненных %1 уже распространяются состояния из объектов ';en='One or more repair objects of subordinates%1 are already subject to condition from the objects '");
				ТекстВопроса = СтрШаблон(ШаблонВопроса, ТекДанные.ОбъектРемонта);
				Для Каждого Родитель Из ОРРодители Цикл
					ТекстВопроса = ТекстВопроса + Родитель + ", ";
				КонецЦикла;
				ТекстВопроса = Лев(ТекстВопроса,СтрДлина(ТекстВопроса) - 2);
				ТекстВопроса = ТекстВопроса + НСтр("es='. Si continuar esto los objetos arriba indicados difundir los estados en subordinado dejarán. ¿De continuar?';ru='. Если продолжить то вышеперечисленные объекты распространять состояния на подчиненные перестанут. Продолжить?';en='. If continuing then the above objects to distribute the state to subordinates cease. Continuing?'");
			КонецЕсли;
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ПроверитьРаспространениеНаПодчиненныхВопрос", ЭтаФорма, 
														Новый Структура("СписокПодчиненныхОбъектов, ОРРодители, ТекДанные", СписокПодчиненныхОбъектов, ОРРодители, ТекДанные));
			
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			
		Иначе
			
			ПроверитьРаспространениеНаПодчиненныхЗаполнитьПодчиненными(СписокПодчиненныхОбъектов, ТекДанные.ОбъектРемонта);
			
		КонецЕсли;
		
	Иначе
		СтруктураОтбора = Новый Структура("Родитель", ТекДанные.ОбъектРемонта);
		НайденныеСтрокиДляУдаления = ТаблицаПодчиненныхОбъектов.НайтиСтроки(СтруктураОтбора);
		
		Для Каждого Строка Из НайденныеСтрокиДляУдаления Цикл
			ТаблицаПодчиненныхОбъектов.Удалить(Строка);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьРаспространениеНаПодчиненныхВопрос(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	СписокПодчиненныхОбъектов 	= ДополнительныеПараметры.СписокПодчиненныхОбъектов;
	ОРРодители 					= ДополнительныеПараметры.ОРРодители;
	ТекДанные 					= ДополнительныеПараметры.ТекДанные;
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		СтруктураОтбораТаблПодчиненных 	= Новый Структура("Родитель");
		СтруктураОтбораТаблОбъектов 	= Новый Структура("ОбъектРемонта");
		
		Для Каждого Родитель Из ОРРодители Цикл
			
			СтруктураОтбораТаблПодчиненных.Родитель = Родитель;
			НайденныеСтроки = ТаблицаПодчиненныхОбъектов.НайтиСтроки(СтруктураОтбораТаблПодчиненных);
			Для Каждого Строка Из НайденныеСтроки Цикл
				ТаблицаПодчиненныхОбъектов.Удалить(Строка);
			КонецЦикла;
			
			СтруктураОтбораТаблОбъектов.ОбъектРемонта = Родитель;
			НайденныеСтроки = Объект.ОбъектыРемонта.НайтиСтроки(СтруктураОтбораТаблОбъектов);
			Для Каждого Строка Из НайденныеСтроки Цикл
				Строка.ИзменятьСостояниеПодчиненныхОР = Ложь;
			КонецЦикла;
			
		КонецЦикла;
		
		ПроверитьРаспространениеНаПодчиненныхЗаполнитьПодчиненными(СписокПодчиненныхОбъектов, ТекДанные.ОбъектРемонта);
		
	Иначе
		ТекДанные.ИзменятьСостояниеПодчиненныхОР = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьРаспространениеНаПодчиненныхЗаполнитьПодчиненными(СписокПодчиненныхОбъектов, Родитель)
	
	Для Каждого ОбъектРемонта Из СписокПодчиненныхОбъектов Цикл
		НС = ТаблицаПодчиненныхОбъектов.Добавить();
		НС.ОбъектРемонта = ОбъектРемонта;
		НС.Родитель = Родитель;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаИерархииЗавершение(РезультатЗакрытия,ДополнительныеПараметры) Экспорт
	
	ТекСтруктураИерархии = РезультатЗакрытия;
	
	Если мОтображатьПоложение Тогда	
		ЗаполнитьПоложенияОР();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДатуВводаВЭксплуатацию(ОбъектРемонта)
	
	Возврат ОбъектРемонта.ДатаВводаВЭксплуатацию;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДатуВыпуска(ОбъектРемонта)
	
	Возврат ОбъектРемонта.ДатаВыпуска;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьНачалоДействияПоказателяНаработки(СтруктураОтбора)

	ПерваяЗапись = РегистрыСведений.торо_ПараметрыНаработкиОбъектовРемонта.СрезПервых(,СтруктураОтбора);

	Возврат ПерваяЗапись.ВыгрузитьКолонку("Период");
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПоказателиНаработкиОР(ОР)
	
	НаборЗаписейПН = РегистрыСведений.торо_ПараметрыНаработкиОбъектовРемонта.СоздатьНаборЗаписей();
	НаборЗаписейПН.Отбор.ОбъектРемонта.Установить(ОР);
	НаборЗаписейПН.Прочитать();
	СписокОтбора = Новый СписокЗначений;
	Для Каждого ЗаписьНабора Из НаборЗаписейПН Цикл
	    СписокОтбора.Добавить(ЗаписьНабора.Показатель);
	КонецЦикла;
	
	Возврат СписокОтбора;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьИзмеряемыеПоказателиОР(ОбъектРемонта)
	
	СписокОтбора = Новый СписокЗначений;
	
	МассивПоказателей = ПланыВидовХарактеристик.торо_ИзмеряемыеПоказателиОбъектовРемонта.ПолучитьСтруктуруИзмеряемыхПоказателейОбъектовРемонта(ОбъектРемонта);
	
	Для Каждого СтруктураПоказателя Из МассивПоказателей Цикл
		СписокОтбора.Добавить(СтруктураПоказателя.Показатель);
	КонецЦикла;
	
	Возврат СписокОтбора;
	
КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьКолонкиПричина()
	
	ВидимостьКолонкиПричина = Ложь;
	Для Каждого Строка ИЗ Объект.ОбъектыРемонта Цикл
		Если ЗначениеЗаполнено(Строка.ТекущееСостояние) И торо_ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(Строка.ТекущееСостояние,"ТипЭксплуатации") = ПредопределенноеЗначение("Перечисление.торо_ТипЭксплуатации.Простой") Тогда
			ВидимостьКолонкиПричина = Истина;
			Строка.СостояниеПростой = НЕ ЗначениеЗаполнено(Строка.ПричинаПростоя);
		Иначе
			Строка.СостояниеПростой = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ОбъектыРемонтаПричинаПростоя.Видимость = ВидимостьКолонкиПричина;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСерииИспользуются(Номенклатура)
	
	Возврат Номенклатура.ВидНоменклатуры.ИспользоватьСерии;
	
КонецФункции

&НаСервере
Процедура СлужебныеРеквизитыЗаполнитьНаСервере()
	
	НоменклатураСервер.ЗаполнитьСлужебныеРеквизитыПоНоменклатуреВКоллекции(
	Объект.ЗапчастиОбъектаРемонта,
	Новый Структура("ЗаполнитьПризнакСерииИспользуются",
	Новый Структура("Номенклатура", "СерииИспользуются")));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаКлиенте
Процедура ЗапчастиОбъектаРемонтаСерийныйНомерСоздание(Элемент, СтандартнаяОбработка)
	Если Элементы.ЗапчастиОбъектаРемонта.ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(Элементы.ЗапчастиОбъектаРемонта.ТекущиеДанные.Номенклатура) Тогда
		СтруктураПараметров = Новый Структура("ВидНоменклатуры", торо_ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(Элементы.ЗапчастиОбъектаРемонта.ТекущиеДанные.Номенклатура, "ВидНоменклатуры"));
		ОткрытьФорму("Справочник.СерииНоменклатуры.Форма.ФормаЭлемента", СтруктураПараметров);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеПоОбъектамРемонтов(СтруктураПараметров)

	Если СтруктураПараметров.СоответствиеОР_ВидыРемонта <> Неопределено Тогда
		
		Для каждого КлючИЗначение из СтруктураПараметров.СоответствиеОР_ВидыРемонта Цикл 
			Для каждого ВидРемонта из КлючИЗначение.Значение Цикл
				НайденныеСтроки = Объект.ВыполненныеРаботы.НайтиСтроки(Новый Структура("ОбъектРемонта, ВидРемонтныхРабот", КлючИЗначение.Ключ, ВидРемонта));
				Если НайденныеСтроки.Количество() = 0 Тогда
					НовСтрокаПоказателей = Объект.ВыполненныеРаботы.Добавить();
					НовСтрокаПоказателей.ОбъектРемонта = КлючИЗначение.Ключ;
					НовСтрокаПоказателей.ВидРемонтныхРабот = ВидРемонта;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	
	КонецЕсли;

	Если СтруктураПараметров.СоответствиеОР_ИзмеряемыеПоказатели <> Неопределено Тогда
		
		Для каждого КлючИЗначение из СтруктураПараметров.СоответствиеОР_ИзмеряемыеПоказатели Цикл 
			Для каждого ИзмеряемыйПоказатель из КлючИЗначение.Значение Цикл
				НайденныеСтроки = Объект.ПоказателиОбъектыРемонта.НайтиСтроки(Новый Структура("ОбъектРемонта, Показатель", КлючИЗначение.Ключ, ИзмеряемыйПоказатель));
				Если НайденныеСтроки.Количество() = 0 Тогда
					НовСтрокаПоказателей = Объект.ПоказателиОбъектыРемонта.Добавить();
					НовСтрокаПоказателей.ОбъектРемонта = КлючИЗначение.Ключ;
					НовСтрокаПоказателей.Показатель = ИзмеряемыйПоказатель;
					НовСтрокаПоказателей.ДатаКонтроля = Объект.Дата;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;

	Если СтруктураПараметров.СоответствиеОР_ПараметрыНаработки <> Неопределено Тогда
		
		Для каждого КлючИЗначение из СтруктураПараметров.СоответствиеОР_ПараметрыНаработки Цикл 
			Для каждого ПараметрНаработки из КлючИЗначение.Значение Цикл
				НайденныеСтроки = Объект.НаработкаОбъектыРемонта.НайтиСтроки(Новый Структура("ОбъектРемонта, Показатель", КлючИЗначение.Ключ, ПараметрНаработки));
				Если НайденныеСтроки.Количество() = 0 Тогда
					НовСтрокаПоказателей = Объект.НаработкаОбъектыРемонта.Добавить();
					НовСтрокаПоказателей.ОбъектРемонта = КлючИЗначение.Ключ;
					НовСтрокаПоказателей.Показатель = ПараметрНаработки;
					НовСтрокаПоказателей.ДатаРаботыПо = Объект.Дата;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;
	
	ЗаполнитьЗапчастиОбъектовРемонта(СтруктураПараметров.МассивОР);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗапчастиОбъектовРемонта(МассивОР)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_Запчасти.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_Запчасти.Номенклатура КАК Номенклатура,
	|	торо_Запчасти.Количество КАК Количество
	|ИЗ
	|	РегистрСведений.торо_Запчасти КАК торо_Запчасти
	|ГДЕ
	|	торо_Запчасти.ОбъектРемонта В(&СписокОбъектов)
	|	И торо_Запчасти.ОбъектРемонта.ВестиУчетСерийныхЗапчастей
	|	И торо_Запчасти.Приоритет";
	
	Запрос.УстановитьПараметр("СписокОбъектов", МассивОР);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Для Инд = 1 по Выборка.Количество цикл
			НовСтрокаЗапчастей = Объект.ЗапчастиОбъектаРемонта.Добавить();
			НовСтрокаЗапчастей.Номенклатура = Выборка.Номенклатура;
			НовСтрокаЗапчастей.ОбъектРемонта = Выборка.ОбъектРемонта;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ОбъектРемонтаУжеДобавлен(ОбъектРемонта)
	
	МассивСтрок = Объект.ОбъектыРемонта.НайтиСтроки(Новый Структура("ОбъектРемонта", ОбъектРемонта));
	Если МассивСтрок.Количество() > 0 Тогда
		ШаблонСообщения = НСтр("es='¡El objeto de la reparación %1 asiste ya en el campo tabular!';ru='Объект ремонта %1 уже присутствует в табличном поле!';en='Repair object %1 is already in the table field!'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ОбъектРемонта);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);	
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСписокРазличныхЗначенийИзСоответствия(СоответствиеОР)
	
	ОбщийСписок = Новый СписокЗначений;
	Для каждого КлючИЗначение из СоответствиеОР Цикл
		Для каждого ЭлементМассива из КлючИЗначение.Значение Цикл
			Если ОбщийСписок.НайтиПоЗначению(ЭлементМассива) = Неопределено Тогда
				ОбщийСписок.Добавить(ЭлементМассива,,Истина);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ОбщийСписок.СортироватьПоЗначению();

	Возврат ОбщийСписок;
	
КонецФункции

&НаКлиенте
Функция ОтфильтроватьСоответствиеОРПоМассивуВыбранныхЗначений(СоответствиеОР, СписокЗначенийСПометками)
	
	ОтфильтрованноеСоответствиеОР = Новый Соответствие;
	
	ВыбранныеЗначения = Новый Массив;
	Для каждого ЭлементСписка из СписокЗначенийСПометками Цикл
		Если ЭлементСписка.Пометка Тогда
			ВыбранныеЗначения.Добавить(ЭлементСписка.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Если ВыбранныеЗначения.Количество() = 0 Тогда
		Возврат ОтфильтрованноеСоответствиеОР;
	КонецЕсли;
	
	Для каждого КлючИЗначение из СоответствиеОР Цикл
		ОтобранныеЗначения = Новый Массив;
		Для каждого ЭлементМассива из КлючИЗначение.Значение Цикл
			Если ВыбранныеЗначения.Найти(ЭлементМассива) <> Неопределено Тогда
				ОтобранныеЗначения.Добавить(ЭлементМассива);
			КонецЕсли;
		КонецЦикла;
		
		Если ОтобранныеЗначения.Количество() > 0 Тогда
			ОтфильтрованноеСоответствиеОР.Вставить(КлючИЗначение.Ключ, ОтобранныеЗначения);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОтфильтрованноеСоответствиеОР;
	
КонецФункции

#КонецОбласти