//// Общий модуль "Строковые строковые функции"
//// содержит замены популярных строковых функции на конфигурациях с режимом совместимости < 8.3.6
//// При внедрении в конфигурацию с режимом совместимости >= 8.3.6 данный модуль переносить не нужно
//
//#Область ПрограммныйИнтерфейс
//
//
//Функция СтрШаблон(Знач СтрокаШаблон, Знач Парам1 = Неопределено, Знач Парам2 = Неопределено, Знач Парам3 = Неопределено, 
//	Знач Парам4 = Неопределено) Экспорт
//		
//	МассивПараметров = Новый Массив;
//	
//	МассивПараметров.Добавить(Парам1);
//	МассивПараметров.Добавить(Парам2);
//	МассивПараметров.Добавить(Парам3);
//	МассивПараметров.Добавить(Парам4);
//	
//	Для Сч = 1 По МассивПараметров.Количество() Цикл
//		
//		ТекЗначение = МассивПараметров[Сч-1];
//		
//		Если ЗначениеЗаполнено(ТекЗначение) Тогда
//			
//			СтрокаШаблон = СтрЗаменить(СтрокаШаблон, "%"+Сч, ТекЗначение);
//			
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//	Возврат СтрокаШаблон;
//	
//КонецФункции
//
//Функция СтрНачинаетсяС(Строка, СтрокаПоиска) Экспорт
//	
//	Возврат Найти(Строка, СтрокаПоиска) = 1;
//	
//КонецФункции
//
//Функция СтрРазделить(знач Строка, Разделитель, ВключатьПустые = Истина) Экспорт
//	
//	Результат = Новый Массив;
//	
//	Если Строка = "" Тогда 
//		
//		Если ВключатьПустые Тогда
//			
//			Результат.Добавить(Строка);
//			
//		КонецЕсли;
//		
//		Возврат Результат;
//		
//	КонецЕсли;
//	
//	Позиция = Найти(Строка, Разделитель);
//	
//	Пока Позиция > 0 Цикл
//		
//		Подстрока = Лев(Строка, Позиция - 1);
//		
//		Если ВключатьПустые ИЛИ НЕ Подстрока = "" Тогда
//			
//			Результат.Добавить(Подстрока);
//			
//		КонецЕсли;
//		
//		Строка = Сред(Строка, Позиция + СтрДлина(Разделитель));
//		Позиция = Найти(Строка, Разделитель);
//		
//	КонецЦикла;
//	
//	Если ВключатьПустые ИЛИ НЕ Строка = "" Тогда
//		
//		Результат.Добавить(Строка);
//		
//	КонецЕсли;
//	
//	Возврат Результат;
//	
//КонецФункции
//
//Функция СтрСоединить(Строки, знач Разделитель = Неопределено) Экспорт
//	
//	Результат = "";
//	
//	Если Разделитель = Неопределено Тогда
//		
//		Разделитель = "";
//		
//	КонецЕсли;
//	
//	Если Строки.Количество() Тогда
//		
//		Результат = Строки[0];
//		
//	КонецЕсли;
//	
//	Для Сч = 1 По Строки.ВГраница() Цикл
//		
//		Результат = Результат + Разделитель + Строки[Сч];
//		
//	КонецЦикла;
//	
//	Возврат Результат;
//	
//КонецФункции
//
//Функция СтрНайти(Строка, ПодстрокаПоиска, НаправлениеПоиска = Неопределено, НачальнаяПозиция = Неопределено, 
//	НомерВхождения = 1) Экспорт
//	
//	Если Строка = "" и ПодстрокаПоиска = "" Тогда
//		
//		Если НаправлениеПоиска = "СКонца" Тогда
//			
//			Если НомерВхождения = 1 Тогда
//				
//				Возврат 1;
//				
//			Иначе
//				
//				Возврат 0;
//				
//			КонецЕсли;
//			
//		Иначе
//			
//			Возврат Мин(НомерВхождения, ?(НачальнаяПозиция = Неопределено, 1, НачальнаяПозиция));
//			
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//	Если НачальнаяПозиция = Неопределено Тогда
//		
//		Если НаправлениеПоиска = "СКонца" Тогда
//			
//			лНачальнаяПозиция = СтрДлина(Строка);
//			
//		Иначе
//			
//			лНачальнаяПозиция = 1;
//			
//		КонецЕсли;
//		
//	Иначе
//		
//		лНачальнаяПозиция = НачальнаяПозиция;
//		
//	КонецЕсли;
//	
//	Если НаправлениеПоиска = "СКонца" Тогда
//		
//		лСтрока = "";
//		
//		Для сч = 1 По СтрДлина(Строка) Цикл
//			
//			лСтрока = Сред(Строка, сч, 1) + лСтрока;
//			
//		КонецЦикла;
//		
//		лПодстрокаПоиска = "";
//		
//		Для сч = 1 По СтрДлина(ПодстрокаПоиска) Цикл
//			
//			лПодстрокаПоиска = Сред(ПодстрокаПоиска, сч, 1) + лПодстрокаПоиска;
//			
//		КонецЦикла;
//		
//		лНачальнаяПозиция = макс(1, СтрДлина(Строка)- лНачальнаяПозиция-СтрДлина(ПодстрокаПоиска)+2);
//		
//	Иначе
//		
//		лСтрока = Строка;
//		лПодстрокаПоиска = ПодстрокаПоиска;
//		
//	КонецЕсли;
//	
//	лНомерВхождения = 0;
//	Результат = Найти(Сред(лСтрока, лНачальнаяПозиция), лПодстрокаПоиска);
//	
//	Пока Результат Цикл
//		
//		лНачальнаяПозиция = Результат + лНачальнаяПозиция + СтрДлина(ПодстрокаПоиска)-1;
//		лНомерВхождения = лНомерВхождения + 1;
//		
//		Если лНомерВхождения = НомерВхождения Тогда
//			
//			Прервать;
//			
//		КонецЕсли;
//		
//		Результат = Найти(Сред(лСтрока, лНачальнаяПозиция), лПодстрокаПоиска);
//		
//	КонецЦикла;
//	
//	Если лНомерВхождения = НомерВхождения Тогда
//		
//		Результат = лНачальнаяПозиция - СтрДлина(ПодстрокаПоиска);
//		
//	Иначе
//		
//		Результат = 0;
//		
//	КонецЕсли;
//		
//	Если НаправлениеПоиска = "СКонца" И Результат<>0 Тогда
//		
//		Результат = СтрДлина(Строка) - Результат - СтрДлина(ПодстрокаПоиска) + 2;
//		
//	КонецЕсли;
//	
//	Возврат Результат;
//	
//КонецФункции
//
//#КонецОбласти 
