#Область ПрограммныйИнтерфейс

// [Обработчик события НачалоВыбора элементов строковых реквизитов] 
Процедура НачалоВыбора(ЭтаФорма, Элемент, ДанныеВыбора, СтандартнаяОбработка, ОткрытьПринудительно = Ложь) Экспорт
	Если ЭтоСоставнойРеквизит(Элемент, ЭтаФорма) Тогда
		Значение = ПолучитьЗначениеТекущегоПоля(ЭтаФорма);

		Если (ТипЗнч(Значение) = Тип("Строка")) Или ОткрытьПринудительно Тогда
			ОткрытьФормуПереводов(Элемент, ЭтаФорма, СтандартнаяОбработка);
		КонецЕсли;
	Иначе
		ОткрытьФормуПереводов(Элемент, ЭтаФорма, СтандартнаяОбработка);
	КонецЕсли;
КонецПроцедуры

// [Обработчик события ОбработкаВыбора элементов строковых реквизитов] 
Процедура ОбработкаВыбора(ЭтаФорма, Элемент, ВыбранноеЗначение, СтандартнаяОбработка) Экспорт
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		УстановитьПереводы(ЭтаФорма, ВыбранноеЗначение, Элемент);
		ЭтаФорма.Модифицированность = Истина;
	ИначеЕсли Не ЭтоСоставнойРеквизит(Элемент, ЭтаФорма) Или ВыбранноеЗначение = Тип("Строка") Тогда
		СтандартнаяОбработка = Ложь;
		НачалоВыбора(ЭтаФорма, Элемент, Неопределено,СтандартнаяОбработка, Истина);
	КонецЕсли;
КонецПроцедуры

// >> [Деснол] [Ушаков А.Д.] [06.11.2019] 
Процедура ОбновитьФормуОР(ЭтаФорма) Экспорт
	ФормаМодифицирована = ЭтаФорма.Модифицированность;
	
	Переводы = Новый Соответствие;
	ЛокализованныеРеквизиты = СтрРазделить(ЭтаФорма.дс_СписокЛокализованныхРеквизитов, ",");
	Для каждого ЛокализованныйРеквизит Из ЛокализованныеРеквизиты Цикл
		Переводы.Вставить(ЛокализованныйРеквизит, ЭтаФорма.Объект[ЛокализованныйРеквизит]);
	КонецЦикла; 
	
	ЭтаФорма.Прочитать();
	
	ЭтаФорма.Модифицированность = ФормаМодифицирована;
	
	Для каждого Перевод Из Переводы Цикл
		ЭтаФорма.Объект[Перевод.Ключ] = Перевод.Значение;
	КонецЦикла;
КонецПроцедуры
// << [Деснол] [Ушаков А.Д.] [06.11.2019] 

#КонецОбласти 

#Область Вспомогательное 

Процедура ОткрытьФормуПереводов(Элемент, ЭтаФорма, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекущаяСтрока = Элемент.ТекстРедактирования;
	ПолеСПереводами = ПолучитьПолеСПереводами(ЭтаФорма, ТекущаяСтрока);
	ОткрытьФорму("ОбщаяФорма.торо_ВводПеревода", ПолеСПереводами, Элемент);
КонецПроцедуры

Функция ПолучитьПолеСПереводами(ЭтаФорма, ТекущаяСтрока)
	Результат = Новый Структура("ИмяРеквизита,Переводы");
	
	ИмяРеквизита = ПолучитьИмяРеквизитаТекущегоПоля(ЭтаФорма);
	Результат.ИмяРеквизита = ИмяРеквизита;
	
	Языки = торо_Локализация.ПолучитьЯзыкиМассивом();
	ЯзыкПоУмолчанию = торо_Локализация.ТекущийЯзыкИБ();
	Переводы = Новый Соответствие();
	
	Для каждого Язык Из Языки Цикл
		ЯзыкСсылка = Язык.Ссылка;
		
		Если ЯзыкСсылка = ЯзыкПоУмолчанию Тогда
			Значение = ТекущаяСтрока;
		Иначе
			НаименованиеРеквизита = СтрШаблон("Объект_%1", Язык.Код);
			Значение = ЭтаФорма[НаименованиеРеквизита][ИмяРеквизита];
		КонецЕсли;
		
		Переводы.Вставить(ЯзыкСсылка, Значение);
	КонецЦикла;
	
	Результат.Переводы = Переводы;
	
	Возврат Результат;
КонецФункции

Функция ПолучитьИмяРеквизитаТекущегоПоля(ЭтаФорма)
	Пути = торо_Локализация.ПолучитьЗначениеИзСтроки(ЭтаФорма.дс_ПутиЛокализованныхРеквизитов);
	ПутьКДанным = Пути[ЭтаФорма.ТекущийЭлемент.Имя];
	ПодстрокиРеквизита = СтрРазделить(ПутьКДанным, ".");
	ИмяРеквизита = ПодстрокиРеквизита[ПодстрокиРеквизита.ВГраница()];
	
	Возврат ИмяРеквизита;
КонецФункции

Функция ПолучитьЗначениеТекущегоПоля(ЭтаФорма)
	ИмяРеквизита = ПолучитьИмяРеквизитаТекущегоПоля(ЭтаФорма);
	Значение = ЭтаФорма.Объект[ИмяРеквизита];
	
	Возврат Значение;
КонецФункции

Функция ЭтоСоставнойРеквизит(Элемент, ЭтаФорма)
	СоставныеРеквизиты = СтрРазделить(ЭтаФорма.дс_СоставныеРеквизиты, ",");
	ЭтоСоставнойРеквизит = Ложь;
	
	Если СоставныеРеквизиты.Найти(Элемент.Имя) <> Неопределено Тогда
		ЭтоСоставнойРеквизит = Истина;
	КонецЕсли; 
	
	Возврат ЭтоСоставнойРеквизит;
КонецФункции

Процедура УстановитьПереводы(ЭтаФорма, ВыбранноеЗначение, Элемент)
	ИмяРеквизита 	= ВыбранноеЗначение.ИмяРеквизита;
	Переводы 		= ВыбранноеЗначение.Переводы;
	Языки 			= ВыбранноеЗначение.Языки;
	
	ЯзыкПоУмолчанию = торо_Локализация.ТекущийЯзыкИБ();
	
	Для каждого Перевод Из Переводы Цикл
		Язык = Перевод.Ключ;
		Если Язык = ЯзыкПоУмолчанию Тогда
			ЭтаФорма.Объект[ИмяРеквизита] = Перевод.Значение;
		Иначе
			НаименованиеРеквизита = СтрШаблон("Объект_%1", Языки[Язык]);
			ЭтаФорма[НаименованиеРеквизита][ИмяРеквизита] = Перевод.Значение;
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

#КонецОбласти 
