#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УстановкаЦенНоменклатурыТовары.Номенклатура КАК Номенклатура,
	               |	УстановкаЦенНоменклатурыТовары.ВидЦены КАК ВидЦены,
	               |	УстановкаЦенНоменклатурыТовары.Характеристика КАК Характеристика,
	               |	УстановкаЦенНоменклатурыТовары.Цена КАК Цена,
	               |	УстановкаЦенНоменклатурыТовары.Валюта КАК Валюта,
	               |	УстановкаЦенНоменклатурыТовары.ЕдиницаИзмерения КАК ДокЕдиницаИзмерения,
	               |	УстановкаЦенНоменклатурыТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ВЫБОР
	               |		КОГДА УстановкаЦенНоменклатурыТовары.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяССылка)
	               |			ТОГДА 1
	               |		ИНАЧЕ УстановкаЦенНоменклатурыТовары.ЕдиницаИзмерения.Коэффициент
	               |	КОНЕЦ КАК Коэффициент
	               |ИЗ
	               |	Документ.УстановкаЦенНоменклатуры.Товары КАК УстановкаЦенНоменклатурыТовары
	               |ГДЕ
	               |	УстановкаЦенНоменклатурыТовары.Ссылка = &Ссылка";
				   
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	резЗапроса = Запрос.Выполнить();
	
	Если резЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = резЗапроса.Выбрать();
	
	// регистр ЦеныНоменклатуры
	Движения.ЦеныНоменклатуры.Записывать = Истина;
	Движения.ЦеныНоменклатуры.Очистить();
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ЦеныНоменклатуры.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		
		Движение.Период = Дата;
		Если Выборка.ЕдиницаИзмерения <> Выборка.ДокЕдиницаИзмерения Тогда
			Движение.Цена = ?(Выборка.Коэффициент = 0, 0, Движение.Цена / Выборка.Коэффициент);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
		|	ПоступлениеТоваровУслугТовары.Характеристика КАК Характеристика,
		|	ПоступлениеТоваровУслугТовары.Упаковка КАК ЕдиницаИзмерения,
		|	ПоступлениеТоваровУслугТовары.Цена КАК Цена,
		|	ПоступлениеТоваровУслугТовары.Номенклатура.ВидНоменклатуры.ИспользоватьХарактеристики КАК ХарактеристикиИспользуются,
		|	ПоступлениеТоваровУслугТовары.Ссылка.Валюта КАК Валюта
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
		|ГДЕ
		|	ПоступлениеТоваровУслугТовары.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				НоваяСтрока = Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			КонецЦикла; 
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОприходованиеИзлишковТоваров") Тогда 
		
		Валюта = ДанныеЗаполнения.ВидЦены.ВалютаЦены;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ОприходованиеИзлишковТовары.Номенклатура КАК Номенклатура,
		|	ОприходованиеИзлишковТовары.Характеристика КАК Характеристика,
		|	ОприходованиеИзлишковТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ОприходованиеИзлишковТовары.Цена КАК Цена,
		|	ОприходованиеИзлишковТовары.Номенклатура.ВидНоменклатуры.ИспользоватьХарактеристики КАК ХарактеристикиИспользуются 
		|ИЗ
		|	Документ.ОприходованиеИзлишковТоваров.Товары КАК ОприходованиеИзлишковТовары
		|ГДЕ
		|	ОприходованиеИзлишковТовары.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				НоваяСтрока = Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				НоваяСтрока.Валюта = Валюта;
			КонецЦикла; 
		КонецЕсли;
				
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли