
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
    СтандартнаяОбработка = Ложь;
    Схема = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
    
    Настройки = КомпоновщикНастроек.ПолучитьНастройки();
    ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
    
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, ДанныеРасшифровки);
	
	ЗапросДанныхДляERP = Новый Запрос;
	ЗапросДанныхДляERP.Текст = "ВЫБРАТЬ
	|	торо_ЗаявкаНаРемонт.Ссылка КАК Ссылка,
	|	торо_ЗаявкаНаРемонтМатериальныеЗатраты.Номенклатура КАК Номенклатура
	|ИЗ
	|	Документ.торо_ЗаявкаНаРемонт КАК торо_ЗаявкаНаРемонт
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.МатериальныеЗатраты КАК торо_ЗаявкаНаРемонтМатериальныеЗатраты
	|		ПО торо_ЗаявкаНаРемонт.Ссылка = торо_ЗаявкаНаРемонтМатериальныеЗатраты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК торо_ЗаявкаНаРемонтРемонтыОборудования
	|		ПО торо_ЗаявкаНаРемонт.Ссылка = торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка
	|ГДЕ 
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаНачала МЕЖДУ &ДатаНачала И &ДатаОкончания";	
	
	ПараметрПериод = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	ПараметрСсылка = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Документ"));
	ПараметрОрганизация = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Организация"));
	ПараметрПодразделение = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Подразделение"));
	
	ЗапросДанныхДляERP.УстановитьПараметр("ДатаНачала", ПараметрПериод.Значение.ДатаНачала);
	ЗапросДанныхДляERP.УстановитьПараметр("ДатаОкончания", ПараметрПериод.Значение.ДатаОкончания);
	  
	Если ПараметрСсылка.Значение <> Неопределено И ПараметрСсылка.Использование Тогда
		ЗапросДанныхДляERP.Текст = ЗапросДанныхДляERP.Текст + " И торо_ЗаявкаНаРемонт.Ссылка В (&Ссылка)";	
		ЗапросДанныхДляERP.УстановитьПараметр("Ссылка", ПараметрСсылка.Значение);
	КонецЕсли;

	Если ПараметрОрганизация.Значение <> Неопределено И ПараметрОрганизация.Использование Тогда 
		ЗапросДанныхДляERP.Текст = ЗапросДанныхДляERP.Текст + " И торо_ЗаявкаНаРемонт.Организация В (&Организация)";
		ЗапросДанныхДляERP.УстановитьПараметр("Организация", ПараметрОрганизация.Значение);
	КонецЕсли; 

	Если ПараметрПодразделение.Значение <> Неопределено И ПараметрПодразделение.Использование Тогда										
		ЗапросДанныхДляERP.Текст = ЗапросДанныхДляERP.Текст + " И торо_ЗаявкаНаРемонт.Подразделение В (&Подразделение)";
		ЗапросДанныхДляERP.УстановитьПараметр("Подразделение", ПараметрПодразделение.Значение);
	КонецЕсли;
	
	РезультатЗапросаДанныхДляERP = ЗапросДанныхДляERP.Выполнить().Выгрузить();
	// Гкс+[TOIR20-517] Льговский Р.Н. от 03.02.2025. Добавлено:{
	СписокНоменклатурыТаблица = РезультатЗапросаДанныхДляERP.Скопировать(, "Номенклатура");
	СписокНоменклатурыТаблица.Свернуть("Номенклатура");
	
	СписокНоменклатуры	= Новый СписокЗначений; 
	Для Каждого Строка Из СписокНоменклатурыТаблица Цикл
		Если Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда 
			Продолжить;
		КонецЕсли;
		СписокНоменклатуры.Добавить(Строка.Номенклатура);	
	КонецЦикла;	
	// } Гкс-[TOIR20-517] Льговский Р.Н от 03.02.2025.
	
	СписокДокументов = Новый СписокЗначений;
	Для Каждого СтрокаРезультата Из РезультатЗапросаДанныхДляERP Цикл
		//СписокНоменклатуры.Добавить(СтрокаРезультата.Номенклатура);
		Если СписокДокументов.НайтиПоЗначению(СтрокаРезультата.Ссылка) = Неопределено Тогда
			СписокДокументов.Добавить(СтрокаРезультата.Ссылка);	
		КонецЕсли;
	КонецЦикла;
	
	ТЗДанныеИзERP = гкс_ИнтеграцияERP2.ПолучитьДанныеОтчетОбеспечениеРемонтовТМЦ(СписокДокументов, СписокНоменклатуры);
	// Гкс+[TOIR20-517] Льговский Р.Н. от 03.02.2025. Добавлено:{
	ТЗРасшифровкаНоменклатуры = гкс_ИнтеграцияERP2.ПолучитьДанныеПоНоменклатуре(,,СписокНоменклатуры); 
	// } Гкс-[TOIR20-517] Льговский Р.Н от 03.02.2025.
    
    ВнешниеНаборыДанных = Новый Структура;
    ВнешниеНаборыДанных.Вставить("ТЗДанныеИзERP", ТЗДанныеИзERP);
	// Гкс+[TOIR20-517] Льговский Р.Н. от 03.02.2025. Добавлено:{
	ВнешниеНаборыДанных.Вставить("ТЗРасшифровкаНоменклатуры", ТЗРасшифровкаНоменклатуры);
	// } Гкс-[TOIR20-517] Льговский Р.Н от 03.02.2025.
    
    ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);

    ДокументРезультат.Очистить();

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ДокументРезультат.ПоказатьУровеньГруппировокСтрок(0);
    ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры
