#Область ОбработчикиСобытийФормы

&НаСервере
Процедура гкс_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// Гкс+[TOIR20-582] Зозуля А.В. от 27.05.2025. Добавлено:{
	ДобавитьНовыеЭлементы();
	// } Гкс-[TOIR20-582] Зозуля А.В. от 27.05.2025.
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьНовыеЭлементы()   
    // Гкс+[TOIR20-582] Зозуля А.В. от 27.05.2025. Добавлено:{
	НовыйЭлемент = Элементы.Добавить("гкс_Организация", Тип("ПолеФормы"), Элементы.Список);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Список.гкс_Организация";
	// } Гкс-[TOIR20-582] Зозуля А.В. от 27.05.2025.
КонецПроцедуры
 
#КонецОбласти
