///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОписаниеПеременных

// Хранение контекста взаимодействия с сервисом
&НаКлиенте
Перем КонтекстВзаимодействия Экспорт;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МестоЗапуска = Параметры.МестоЗапуска;
	
	Элементы.НадписьСообщенияВТехПоддержку.Заголовок =
		ИнтернетПоддержкаПользователейКлиентСервер.ФорматированныйЗаголовок(
			ИнтернетПоддержкаПользователейКлиентСервер.ПодставитьДомен(
				НСтр("es='<body> Durante el surgimiento de los problemas envíen la carta a su destino <a href = ""SendMail""> webits-info@1c.ru </a> </body>';ru='<body>При возникновении проблем отправьте письмо по адресу <a href=""SendMail"">webits-info@1c.ru</a></body>';en='<body> If you have problems, send an email to <a href=""SendMail""> webits-info@1c.ru </a> </body>'"),
				ИнтернетПоддержкаПользователей.НастройкиСоединенияССерверами().ДоменРасположенияСерверовИПП));
	
	ОписаниеОшибки = Параметры.ОписаниеОшибки;
	ОписаниеОшибкиЗаполнено = НЕ ПустаяСтрока(ОписаниеОшибки);
	КлючСохраненияПоложенияОкна = МестоЗапуска + Строка(ОписаниеОшибкиЗаполнено);
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, "ПодробноеОписаниеОшибки, ПриНачалеРаботыСистемы, Логин");
	
	Если ТипЗнч(Параметры.СтартовыеПараметры) = Тип("Структура") Тогда
		СтартовыеПараметры = Параметры.СтартовыеПараметры;
	Иначе
		СтартовыеПараметры = Новый Структура;
	КонецЕсли;
	
	Элементы.ОписаниеОшибки.Видимость = ОписаниеОшибкиЗаполнено;
	
	Если Параметры.ПриНачалеРаботыСистемы Тогда
		ЗапускатьПриСтарте = Истина;
	Иначе
		Элементы.ЗапускатьПриСтарте.Видимость = Ложь;
	КонецЕсли;
	
	// Настройка внешнего вида формы
	Если КлиентскоеПриложение.ТекущийВариантИнтерфейса() = ВариантИнтерфейсаКлиентскогоПриложения.Такси Тогда
		Элементы.ГруппаЗаголовка.Отображение           = ОтображениеОбычнойГруппы.СлабоеВыделение;
		Элементы.ГруппаИнформационнойЧасти.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьСообщенияВТехПоддержкуОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "SendMail" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если МестоЗапуска = "handStartNew"
			Или МестоЗапуска = "systemStartNew" Тогда
			
			Тема = НСтр("es='El apoyo de Internet. El recurso al monitor del Apoyo De Internet.';ru='Интернет-поддержка. Обращение к монитору Интернет-поддержки.';en='Online support. Accessing the Internet Support Monitor.'");
			Тело = НСтр("es='Surge la falta del recurso al monitor del Apoyo De Internet.';ru='Возникает ошибка обращения к монитору Интернет-поддержки.';en='There is an error accessing the Internet support monitor.'");
			
		ИначеЕсли МестоЗапуска = "taxcomGetID" Тогда
			
			Тема = НСтр("es='El apoyo de Internet. El recurso a 1S-Takskom';ru='Интернет-поддержка. Обращение к 1С-Такском';en='Online support. Appeal to 1C-Tax'");
			Тело = НСтр("es='Surge la falta al recurso al servicio de la recepción del identificador 1S-Takskom.';ru='Возникает ошибка при обращении к сервису получения идентификатора 1С-Такском.';en='An error occurs while accessing the service of obtaining the identifier 1C-Taxkom.'");
			
		ИначеЕсли МестоЗапуска = "taxcomPrivat" Тогда
			
			Тема = НСтр("es='El apoyo de Internet. El recurso a 1S-Takskom';ru='Интернет-поддержка. Обращение к 1С-Такском';en='Online support. Appeal to 1C-Tax'");
			Тело = НСтр("es='Surge la falta al recurso al servicio de la recepción del identificador 1S-Takskom.';ru='Возникает ошибка при обращении к сервису получения идентификатора 1С-Такском.';en='An error occurs while accessing the service of obtaining the identifier 1C-Taxkom.'");
			
		Иначе
			
			// В случае, если имя бизнес-процесса не было передано до возникновения ошибки
			Тема = НСтр("es='El apoyo de Internet. La falta del recurso al servicio';ru='Интернет-поддержка. Ошибка обращения к сервису';en='Online support. Error accessing the service'");
			Тело = НСтр("es='Surge la falta al recurso al servicio del Apoyo De Internet.';ru='Возникает ошибка при обращении к сервису Интернет-поддержки.';en='An error occurs while accessing the Internet support service.'");
			
		КонецЕсли;
		
		
		Если Не ПустаяСтрока(ПодробноеОписаниеОшибки) Тогда
			Тело = Тело + Символы.ПС + НСтр("es='La descripción de la falta:';ru='Описание ошибки:';en='Error Description:'")
				+ Символы.ПС + ПодробноеОписаниеОшибки;
		ИначеЕсли Не ПустаяСтрока(ОписаниеОшибки) Тогда
			Тело = Тело + Символы.ПС + НСтр("es='La descripción de la falta:';ru='Описание ошибки:';en='Error Description:'")
				+ Символы.ПС + ОписаниеОшибки;
		КонецЕсли;
		
		ИнтернетПоддержкаПользователейКлиент.ОтправитьСообщениеВТехПоддержку(
			Тема,
			Тело,
			,
			,
			Новый Структура("Логин, Пароль",
				?(КонтекстВзаимодействия = Неопределено,
					"",
					Подключение1СТакскомКлиент.ЗначениеСессионногоПараметра(КонтекстВзаимодействия.КСКонтекст, "login")),
				?(КонтекстВзаимодействия = Неопределено,
					"",
					Подключение1СТакскомКлиент.ЗначениеСессионногоПараметра(КонтекстВзаимодействия.КСКонтекст, "password"))));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапускатьПриСтартеПриИзменении(Элемент)
	
	УстановитьНастройкуЗапускатьПриСтарте(ЗапускатьПриСтарте);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнформацияИнформационнойЧастиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "open:log" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму("Обработка.ЖурналРегистрации.Форма", Новый Структура("Пользователь", ИмяПользователя()));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПовторитьПопыткуПодключения(Команда)
	
	Закрыть();
	Подключение1СТакскомКлиент.СтартоватьМеханизм(МестоЗапуска, СтартовыеПараметры, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура УстановитьНастройкуЗапускатьПриСтарте(ЗначениеНастройки)
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		"ИнтернетПоддержкаПользователей",
		"ВсегдаПоказыватьПриСтартеПрограммы",
		ЗначениеНастройки);
	
КонецПроцедуры

#КонецОбласти
