#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьДокумент(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена организация", , "Объект.Организация");
		Возврат;
	КонецЕсли; 
	Если Не ЗначениеЗаполнено(Объект.Подразделение) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено подразделение", , "Объект.Подразделение");
		Возврат;
	КонецЕсли; 
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьТЧДокумента", ЭтотОбъект), 
					НСтр("es='Se borrará la sección tabular. ¿Continuar la operación?';"
							"ru='Табличная часть будет очищена. Продолжить операцию?';"
							"en='The tabular section will be cleared. Continue the operation?'"), 
					РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьТЧДокумента(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Объект.Квалификации.Очистить();
		ЗаполнитьТЧДокументаНаСервере()
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧДокументаНаСервере()
	
	ДанныеСоответствияКвалификацийИДолжностей 
		= РегистрыСведений.гкс_СоответствияДолжностейИКвалификаций.ПолучитьДанныеРегистра(Объект.Организация,
																						  Объект.Подразделение,
																						  , 
																						  Объект.Дата);
	Объект.Квалификации.Загрузить(ДанныеСоответствияКвалификацийИДолжностей);
	
КонецПроцедуры

#КонецОбласти


