#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Описание: Возвращает текущий статус документа.
//
//
// Параметры:
//	СогласуемыйДокумент - ОпределяемыйТип.торо_СогласуемыеДокументы - СогласуемыйДокумент. 
//
// Возвращаемое значение: 
//	СправочникСсылка.торо_СтатусыСогласованияДокументовРемонтныхРабот - СтатусДокумента.
//
Функция ТекущийСтатусДокумента(СогласуемыйДокумент) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ТекущиеСтатусыСогласованияДокументов.СтатусДокумента КАК СтатусДокумента
		|ИЗ
		|	РегистрСведений.торо_ТекущиеСтатусыСогласованияДокументов КАК торо_ТекущиеСтатусыСогласованияДокументов
		|ГДЕ
		|	торо_ТекущиеСтатусыСогласованияДокументов.СогласуемыйДокумент = &СогласуемыйДокумент";
	
	Запрос.УстановитьПараметр("СогласуемыйДокумент", СогласуемыйДокумент);
	Выборка = Запрос.Выполнить().Выбрать();   	
	Выборка.Следующий();
	
	Возврат Выборка.СтатусДокумента; 
		
КонецФункции      

#КонецОбласти

#Конецесли
