
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрОтбор = Неопределено;
	ОтборКласс = Неопределено;
	Если Параметры.Свойство("Отбор", ПараметрОтбор) 
			И ПараметрОтбор.Свойство("Класс", ОтборКласс)
			И ТипЗнч(ОтборКласс) = Тип("СправочникСсылка.Классы") Тогда
		Элементы.Класс.Видимость = Ложь;
		Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Номенклатура класса: %1'"),
			Строка(ОтборКласс));
	Иначе
		Заголовок = НСтр("ru = 'Номенклатура класса'");
	КонецЕсли;
	
КонецПроцедуры
