////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПЕРЕМЕННЫЕ
&НаКлиенте
Перем РемонтОборудованияУдаляется;

&НаКлиенте
Перем СтруктураДанныхДоРедактирования;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Основание") И ТипЗнч(Параметры.Основание) <> Тип("Соответствие") Тогда
		торо_ЗаполнениеДокументов.ПроверитьВозможностьВводаНаОсновании(Параметры.Основание,Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	
	Если Параметры.Свойство("Основание") И Параметры.Свойство("ВыделенныеСтроки") Тогда
		ДокОснованиеППР = Параметры.Основание;
		МассивIDИзППР.ЗагрузитьЗначения(Параметры.ВыделенныеСтроки);
	КонецЕсли;
	
	Если Параметры.Свойство("ID") Тогда
		
		Строки = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", Параметры.ID));
		Если Строки.Количество() Тогда
			Элементы.РемонтыОборудования.ТекущаяСтрока = Строки[0].ПолучитьИдентификатор();
		КонецЕсли;
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	УстановитьУсловноеОформление();
	
	// функциональные опции
	ФОУчетЗапчастей             = ПолучитьФункциональнуюОпцию("торо_УчетЗапчастей");
	ФОУчетСостоянияОборудования = ПолучитьФункциональнуюОпцию("торо_УчетСостоянияОборудования");
	ФОИспользоватьГарантии      = ПолучитьФункциональнуюОпцию("торо_ИспользоватьГарантии");
	ФОЗапретитьРемонтГарантийногоОборудованияХозспособом = ПолучитьФункциональнуюОпцию("торо_ЗапретитьРемонтГарантийногоОборудованияХозспособом");
	ФОИспользоватьОстановочные	= ПолучитьФункциональнуюОпцию("торо_ИспользоватьОстановочныеРемонты");
	ФОНапоминатьЗафиксироватьПростой = ПолучитьФункциональнуюОпцию("торо_НапоминатьЗафиксироватьПростой");
	ФОВводПотребленияНаОснованииПроведенного = Константы.торо_ВводПотребленияНаОснованииПроведенногоАкта.Получить();
	ФОВводОприходованияНаОснованииПроведенного = Константы.торо_ВводОприходованияНаОснованииПроведенногоАкта.Получить();
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ОписаниеОшибки = "";
		Если слкМенеджерЗащиты.ПроверитьЛицензииСеанса(ОписаниеОшибки) <> Истина Тогда
			ТекстСообщения = НСтр("es='¡La licencia no es descubierta! La creación del documento es imposible.';ru='Лицензия не обнаружена! Создание документа невозможно.';en='No license found! Creating a document is not possible.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Возврат;
		КонецЕсли;				
				
		СлужебныеРеквизитыЗаполнитьНаСервере();
		
		Если ФОИспользоватьГарантии Тогда
			Для каждого ТекСтрока из Объект.РемонтыОборудования Цикл
				ТекСтрока.ГарантийныйРемонт = торо_ГарантийноеОбслуживание.ПолучитьЗначениеФлагаГарантийныйРемонтДляОбъектаРемонта(
					ТекСтрока.ОбъектРемонта, ТекСтрока.ДатаНачала, ТекСтрока.ДатаОкончания);
			КонецЦикла;
		КонецЕсли;			
		
	КонецЕсли;
	
	ЗаполнитьДеревоРемонтныхРаботНаСервере();
	
	ФОИспользоватьУсложненнуюСхемуЗакрытияНарядов = ПолучитьФункциональнуюОпцию("торо_ИспользоватьУсложненнуюСхемуЗакрытияНарядов");
	Элементы.ДеревоРемонтныхРаботВыполнено.Видимость = НЕ ФОИспользоватьУсложненнуюСхемуЗакрытияНарядов;
	
	ОбновитьДокументыВнутреннегоПотребленияСервер();
	ОбновитьДокументыОприходованияИзлишковСервер();
	
	// Заголовок формы++
	торо_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(Объект, ЭтаФорма, "");
	// Заголовок формы--
	
	// Согласование++
	ВидДокумента = Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_АктОВыполненииЭтапаРабот;
	торо_РаботаССогласованиями.ПриСозданииНаСервере(ЭтаФорма, ВидДокумента);
	// Согласование --
	
	ОтметитьНаличиеАналогов();
	
	РемонтыОборудованияОбновитьДокументыИсточники();
	
	ПравоРедактирование = ПравоДоступа("Редактирование", Метаданные.Документы.торо_АктОВыполненииЭтапаРабот);
	ПравоИнтерактивноеДобвалениеВнутреннихПотреблений = ПравоДоступа("ИнтерактивноеДобавление", Метаданные.Документы.ВнутреннееПотреблениеТоваров);
	ПравоИнтерактивнаяПометкаУдаленияВнутреннихПотреблений = ПравоДоступа("ИнтерактивнаяПометкаУдаления", Метаданные.Документы.ВнутреннееПотреблениеТоваров);
	ПравоИнтерактивноеДобвалениеОприходованияИзлишков = ПравоДоступа("ИнтерактивноеДобавление", Метаданные.Документы.ОприходованиеИзлишковТоваров);
	ПравоИнтерактивнаяПометкаУдаленияОприходованияИзлишков = ПравоДоступа("ИнтерактивнаяПометкаУдаления", Метаданные.Документы.ОприходованиеИзлишковТоваров);
	
	Элементы.СтраницаЗапчасти.Видимость = ФОУчетЗапчастей;
	
	// Ограничение ввода на основании
	торо_СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка, Новый Структура("ОграничитьВводНаОсновании, ДокументыОснования, УстановитьСвойствоЭлементовФормыОтПрав",Истина, Истина, Истина));
	// Конец ограничение ввода на основании
	
	ФОИспользоватьНарядДопуск = ПолучитьФункциональнуюОпцию("торо_ИспользоватьНарядДопускНаРаботыПовышеннойОпасностиОбязательно");
	
	Если Параметры.Свойство("Основание") и ТипЗнч(Параметры.Основание) = Тип("Соответствие") Тогда
		ВТ_ТабОперацийБезНаряда = ЭтотОбъект.ТабОперацийБезНаряда.Выгрузить();
		Для каждого Стр Из Параметры.Основание Цикл
			ДокОснованиеЗаявка = Стр.Значение;
			Если ФОИспользоватьНарядДопуск И ЗначениеЗаполнено(ДокОснованиеЗаявка) И НЕ ТипЗнч(ДокОснованиеЗаявка) = Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот") Тогда
				ЗаполнитьТабОперацийБезНаряда(ДокОснованиеЗаявка, Стр.Ключ);
				Для Каждого Строка Из ТабОперацийБезНаряда Цикл
					НС= ВТ_ТабОперацийБезНаряда.Добавить();
					ЗаполнитьЗначенияСвойств(НС, Строка);
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		ТабОперацийБезНаряда.Загрузить(ВТ_ТабОперацийБезНаряда);
	Иначе
		ДокОснованиеЗаявка = Параметры.Основание;
		Если ФОИспользоватьНарядДопуск И ЗначениеЗаполнено(ДокОснованиеЗаявка) И НЕ ТипЗнч(ДокОснованиеЗаявка) = Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот") Тогда
			ЗаполнитьТабОперацийБезНаряда(ДокОснованиеЗаявка);
		КонецЕсли;
	КонецЕсли;
	
	
	Для каждого Строка Из Объект.ТрудовыеЗатраты Цикл
		Если НЕ ЗначениеЗаполнено(Строка.ВремяРаботы) Тогда
			Строка.ВремяРаботы = Строка.ДатаОкончания - Строка.ДатаНачала;
		КонецЕсли;
		Строка.ВремяРаботыТекст = СформироватьПродолжительность(Строка.ВремяРаботы);
	КонецЦикла;
	
	ОбновитьДоступностьДляРедактирования();
	
	Если ФОИспользоватьОстановочные Тогда
		ОбновитьОстановочные();
	КонецЕсли;
	
	ОбновитьЗависимыеЛоты();
	
	УправлениеВидимостью(ЭтотОбъект);
	
	ЭтоПервыйДокументВЦепочке = ЭтоПервыйДокументВЦепочке();
	ЭтоПоследнийДокументВЦепочке = ЭтоПоследнийДокументВЦепочке();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	СлужебныеРеквизитыЗаполнитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
    УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	Если ТабОперацийБезНаряда.Количество() = 0 Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И Объект.РемонтыОборудования.Количество() = 0 И Объект.ДокументыОснования.Количество() > 0 Тогда
			
			Если МассивIDИзППР.Количество() = 0 Тогда
				ПодключитьОбработчикОжидания("ПодборРемонтовОбработчикОжидания",0.5,Истина);
			Иначе
				ВыбранноеЗначение = ЗаполнитьДанныеНаОснованииППРВыделенныеСтроки();
				ОбработкаВыбора(ВыбранноеЗначение, ЭтаФорма);
			КонецЕсли;
			
		//ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Ссылка) И Объект.РемонтыОборудования.Количество() > 0 Тогда
		//	РемОборудования = Объект.РемонтыОборудования[0].ID;
		//	НайденныеСтрокиМатериала = Объект.МатериальныеЗатраты.НайтиСтроки( Новый Структура("РемонтыОборудования_ID", РемОборудования )); 
		//	НайденныеСтрокиРемонта = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", РемОборудования ));
		//	Если НайденныеСтрокиРемонта.Количество() <> 0 И НайденныеСтрокиМатериала.Количество() = 0 Тогда
		//		НомерСтроки = НайденныеСтрокиРемонта[0].ПолучитьИдентификатор();
		//		ЗаполнитьМатериалыПоНормамНаСервере(Неопределено, НомерСтроки);
		//	КонецЕсли; 
		КонецЕсли;
	Иначе
		
		Отказ = Истина;
		ОткрытьФорму("ОбщаяФорма.торо_ФормаОперацийБезНарядов", Новый Структура("ТабОперацийБезНаряда, ДокОснование", ТабОперацийБезНаряда, ДокОснованиеЗаявка),,,ВариантОткрытияОкна.ОтдельноеОкно,,);
		
	КонецЕсли;
	
	// Имена элементов формы типа ТаблицаФормы, в которых необходимо обрабатывать события изменения строк.
	Массив = Новый Массив;
	Массив.Добавить("ДокументыОснования");
	торо_СобытияФормКлиент.ЗаполнитьСтруктуруДанныхДоРедактирования(СтруктураДанныхДоРедактирования,Массив);
	
	Для каждого Строка Из Объект.ТрудовыеЗатраты Цикл
		Строка.ВремяРаботыТекст = СформироватьПродолжительность(Строка.ВремяРаботы);
	КонецЦикла;
	ЗаполнитьИспользованиеХарактеристикЗапчастей();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства

	ШаблонСообщения = НСтр("es='En la línea el número %1 listas de las reparaciones de la maquinaria la fecha del comienzo del período de los trabajos de reparación es más grande que la fecha de la terminación (%2 - %3).';ru='В строке номер %1 списка ремонтов оборудования дата начала периода ремонтных работ больше даты окончания (%2 - %3).';en='In line number%1 of the equipment repair list, the start date of the repair period is greater than the end date (%2 -%3).'");
	Для Каждого Строка Из Объект.РемонтыОборудования Цикл
		Если Строка.ДатаНачала > Строка.ДатаОкончания Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщения,	Строка.НомерСтроки, Строка.ДатаНачала, Строка.ДатаОкончания);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЕсли;
	КонецЦикла;
	
	Если ФОИспользоватьГарантии И ФОЗапретитьРемонтГарантийногоОборудованияХозспособом Тогда
		торо_ГарантийноеОбслуживание.ПроверитьНаличиеКонтрагентов(Объект, "ИсполнителиПоРемонтам", "Исполнитель", Отказ);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	КонтролироватьВремяРаботы = ПолучитьКонстантуКонтролироватьВремяРаботы();
	
	Если КонтролироватьВремяРаботы Тогда
		
		СчётчикРем = 1;
		
		Для Каждого СтрокаРем Из Объект.РемонтыОборудования Цикл
			
			ДатаНач = СтрокаРем.ДатаНачала;
			ДатаКон = СтрокаРем.ДатаОкончания;
			
			СчётчикИсп = 1;
			
			Для Каждого СтрокаИсп Из Объект.ТрудовыеЗатраты Цикл
				
				Если СтрокаРем.ID = СтрокаИсп.РемонтыОборудования_ID Тогда
					
					ВводДатаНач = СтрокаИсп.ДатаНачала;
					ВводДатаКон = СтрокаИсп.ДатаОкончания;
					
					Если ВводДатаНач < ДатаНач Тогда
						ТекстСообщения = НСтр("ru = 'В табличной части ""Трудовые Затраты"" на закладке Исполнители->Хозспособ в строке №" + СчётчикИсп + " дата начала не может быть меньше даты начала ремонта строки №" + СчётчикРем + "'");
						ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
					КонецЕсли;
					
					Если ВводДатаКон > ДатаКон Тогда
						ТекстСообщения = НСтр("ru = 'В табличной части ""Трудовые Затраты"" на закладке Исполнители->Хозспособ в строке №" + СчётчикИсп + " дата окончания не может быть больше даты окончания ремонта строки №" + СчётчикРем + "'");
						ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
					КонецЕсли;
					
					СчётчикИсп = СчётчикИсп + 1;
					
				КонецЕсли;
				
			КонецЦикла;
			
			СчётчикРем = СчётчикРем + 1;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

	// Согласование++
	торо_РаботаССогласованиями.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	// Согласование--
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение
		И ФОИспользоватьГарантии Тогда
		торо_ГарантийноеОбслуживание.СформироватьПредупрежденияОРекламационныхАктах(Объект, "РемонтыОборудования");
	КонецЕсли;
	
	Если торо_ОбщегоНазначения.ПроверитьВремяРаботыСотрудников(Объект, "ТрудовыеЗатраты") Тогда 
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Согласование++
	торо_РаботаССогласованиями.ПриЗаписиНаСервере(ЭтаФорма, ТекущийОбъект);
	// Согласование--
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// Заголовок формы++
	торо_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(Объект, ЭтаФорма, "");
	// Заголовок формы--
	
	СлужебныеРеквизитыЗаполнитьНаСервере();
	
	ОтметитьНаличиеАналогов();
	
	Для каждого Строка Из Объект.ТрудовыеЗатраты Цикл
		Строка.ВремяРаботыТекст = СформироватьПродолжительность(Строка.ВремяРаботы);
	КонецЦикла; 
	
	РемонтыОборудованияОбновитьДокументыИсточники();
	
	Если ФОИспользоватьОстановочные Тогда
		ОбновитьОстановочные();
	КонецЕсли;
	ОбновитьЗависимыеЛоты();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("СозданДокументЧерезРМТехСпец", Объект.Ссылка);
	ЗаполнитьИспользованиеХарактеристикЗапчастей();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ФОУчетСостоянияОборудования И ФОНапоминатьЗафиксироватьПростой И Объект.Проведен И НЕ ЗавершениеРаботы Тогда
		
		МассивОбъектов = ПроверитьНаличиеДокументаПростоя();
		
		Если МассивОбъектов.Количество() > 0 Тогда
			ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект, Новый Структура("МассивОбъектов", МассивОбъектов)), НСтр("es='¿Fijar las horas muertas reales de los objetos?';ru='Зафиксировать фактический простой объектов?';en='Lock actual downtime to objects?'"), РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура")
		И ВыбранноеЗначение.Свойство("ВыполняемаяОперация")
		И ВыбранноеЗначение.ВыполняемаяОперация = "ВыборАналогаНоменклатурыДляРемонта" Тогда
		ЗаменитьМатериалыНаАналоги(ВыбранноеЗначение.АдресВХранилище);
		ТекДанныеРемРаб = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
		МассивID = Новый Массив;
		ЗаполнитьМассивID(МассивID,ТекДанныеРемРаб);
		ОтметитьНаличиеАналогов(МассивID);
		Модифицированность = Истина;
		
	ИначеЕсли ИсточникВыбора.Имяформы = "Обработка.торо_ПодборНоменклатуры.Форма.Форма" Тогда
		
		ТекДанныеРемРаб = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
		
		Если ТекДанныеРемРаб = Неопределено Тогда 
			Возврат;
		КонецЕсли;
		
		ИмяТЧ = "МатериальныеЗатраты";
		ИмяРеквизита = "Номенклатура";
		СтруктураСтрокиОпераций = Новый Структура("РемонтыОборудования_ID, ID, Количество", ТекДанныеРемРаб.РемонтыОборудования_ID, ТекДанныеРемРаб.ID, ТекДанныеРемРаб.Количество);
		ДобавитьНоменклатуруИзПодбора(ВыбранноеЗначение, СтруктураСтрокиОпераций, ИмяТЧ, ИмяРеквизита);
		ОтметитьНаличиеАналогов(ТекДанныеРемРаб.ID);
		Модифицированность = Истина;
	
	Иначе
		
		ЕстьДокументы = Ложь;
		
		Если ПолучитьФОПовышеннаяОпасность() Тогда
			Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") И ВыбранноеЗначение.Свойство("ДокументОснование") Тогда
				Если ТипЗнч(ВыбранноеЗначение.ДокументОснование) <> Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот") Тогда
					ЗаполнитьТабОперацийБезНаряда(ВыбранноеЗначение.ДокументОснование, ВыбранноеЗначение.СтрокаРемонтовОборудования.ID);
					
					Если ТабОперацийБезНаряда.Количество() > 0 Тогда
						ЕстьДокументы = Истина;
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли  ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
				Для каждого Элемент Из ВыбранноеЗначение Цикл
					Если ТипЗнч(Элемент.ДокументОснование) <> Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот") Тогда
						ЗаполнитьТабОперацийБезНаряда(Элемент.ДокументОснование);
						
						Если ТабОперацийБезНаряда.Количество() > 0 Тогда
							ЕстьДокументы = Истина;
							Прервать;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
			
		Если Не ЕстьДокументы Тогда
			
			ЭтоРемонтнаяРабота = Ложь;
			РемонтУжеДобавлен = Ложь;
			МассивИДДобавленныхРемонтов = Новый Массив;
			Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") И ВыбранноеЗначение.Количество() > 0 Тогда 
				Для каждого ЭлементМассива Из ВыбранноеЗначение Цикл
					Если ТипЗнч(ЭлементМассива) = Тип("Структура") И ЭлементМассива.Свойство("СтрокаРемонтовОборудования") Тогда 
						НайденныеРемонты = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", ЭлементМассива.СтрокаРемонтовОборудования.ID));
						Если НайденныеРемонты.Количество() > 0 Тогда
							РемонтУжеДобавлен = Истина;
							МассивИДДобавленныхРемонтов.Добавить(ЭлементМассива.СтрокаРемонтовОборудования.ID);
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				
				Если РемонтУжеДобавлен Тогда 
					Вопрос = НСтр("es='Algunos de las reparaciones escogidas son añadidos ya. Los trabajos de reparación vinculados serán limpiados y añadidos de nuevo. ¿Continuar?';ru='Некоторые из выбранных ремонтов уже добавлены. Связанные ремонтные работы будут очищены и добавлены заново. Продолжить?';en='Some of the selected repairs have already been added. Associated repairs will be cleaned and re-added. Continue?'");
				КонецЕсли;
			КонецЕсли;
						
			Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") И ВыбранноеЗначение.Свойство("СтрокаРемонтовОборудования") 
				И ВыбранноеЗначение.Количество() > 0 Тогда 
				ЭтоРемонтнаяРабота = ВыбранноеЗначение.ЭтоРемонтнаяРабота;
				НайденныеРемонты = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", ВыбранноеЗначение.СтрокаРемонтовОборудования.ID));
				Если НайденныеРемонты.Количество() > 0 Тогда
					РемонтУжеДобавлен = Истина;
					МассивИДДобавленныхРемонтов.Добавить(ВыбранноеЗначение.СтрокаРемонтовОборудования.ID);
				КонецЕсли;
				
				Если РемонтУжеДобавлен Тогда 
					Вопрос = НСтр("es='Esta reparación es añadida ya. Los trabajos de reparación vinculados serán limpiados y añadidos de nuevo. ¿Continuar?';ru='Этот ремонт уже добавлен. Связанные ремонтные работы будут очищены и добавлены заново. Продолжить?';en='This repair has already been added. Associated repairs will be cleaned and re-added. Continue?'");
				КонецЕсли;
			КонецЕсли;
			
			Если РемонтУжеДобавлен И НЕ ЭтоРемонтнаяРабота Тогда
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("ВыбранноеЗначение", ВыбранноеЗначение);
				СтруктураПараметров.Вставить("МассивИДДобавленныхРемонтов", МассивИДДобавленныхРемонтов);
				ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаВыбораПослеВопроса", ЭтотОбъект, СтруктураПараметров),
				Вопрос, РежимДиалогаВопрос.ДаНет);
				Возврат;
			Иначе
				ОбработкаВыбораЗавершение(ВыбранноеЗначение);
				Возврат;
			КонецЕсли;
				
		Иначе
			
			Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") И ВыбранноеЗначение.Свойство("ДокументОснование") Тогда
				Если ТипЗнч(ВыбранноеЗначение.ДокументОснование) <> Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот") Тогда
					ЗаполнитьТабОперацийБезНаряда(ВыбранноеЗначение.ДокументОснование, ВыбранноеЗначение.СтрокаРемонтовОборудования.ID);
					ОткрытьФорму("ОбщаяФорма.торо_ФормаОперацийБезНарядов", Новый Структура("ТабОперацийБезНаряда, ДокОснование", ТабОперацийБезНаряда, ВыбранноеЗначение.ДокументОснование), ИсточникВыбора,,ВариантОткрытияОкна.ОтдельноеОкно,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				КонецЕсли;
			ИначеЕсли  ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
				
				МассивДокументов = Новый Массив;
				
				Для каждого Элемент Из ВыбранноеЗначение Цикл
					Если ТипЗнч(Элемент.ДокументОснование) <> Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот") Тогда
						Если МассивДокументов.Найти(Элемент.ДокументОснование) = Неопределено Тогда
							МассивДокументов.Добавить(Элемент.ДокументОснование);
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				
				Для каждого Элемент Из МассивДокументов Цикл
					ЗаполнитьТабОперацийБезНаряда(Элемент);
					ОткрытьФорму("ОбщаяФорма.торо_ФормаОперацийБезНарядов", Новый Структура("ТабОперацийБезНаряда, ДокОснование", ТабОперацийБезНаряда, Элемент), ИсточникВыбора,,ВариантОткрытияОкна.ОтдельноеОкно,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЭтоПервыйДокументВЦепочке = ЭтоПервыйДокументВЦепочке();
	ЭтоПоследнийДокументВЦепочке = ЭтоПоследнийДокументВЦепочке();
	РемонтыОборудованияОбновитьДокументыИсточники();
	ЗаполнитьЕдиницыИзмерения(ДеревоРемонтныхРабот);
	ЗаполнитьИспользованиеХарактеристикЗапчастей();
	
	Для каждого Строка Из Объект.ТрудовыеЗатраты Цикл
		Строка.ВремяРаботыТекст = СформироватьПродолжительность(Строка.ВремяРаботы);
	КонецЦикла;
	
	Для Каждого Строка Из ДеревоРемонтныхРабот.ПолучитьЭлементы() Цикл
		РазвернутьДеревоРемонтныхРабот(Строка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	// Согласование++
	Если ИмяСобытия = "УтверждениеСтатусаСогласования" Тогда
		Если Параметр.Документ = Объект.Ссылка Тогда
			ЗавершитьУтверждениеСтатусаДокумента(Параметр);
		КонецЕсли;
	КонецЕсли;
	// Согласование--
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ЗавершитьРемонтныеРаботыПриИзменении(Элемент)
	
	Если Объект.ЗавершитьРемонтныеРаботы Тогда
		
		Элементы.ДеревоРемонтныхРаботПроцентВыполненияРабот.ТолькоПросмотр = Истина;
		
		Для каждого Стр Из Объект.РемонтыОборудования Цикл
			
			Стр.ЗавершитьРемонт = Истина;	
			
		КонецЦикла; 
		
		УстановитьОставшиесяПроцентыРабот();
		
		РемонтыОборудованияПриАктивизацииСтроки(Элементы.РемонтыОборудования);
		
		СлужебныеРеквизитыЗаполнитьНаСервере();
		
		Для каждого Строка Из Объект.ТрудовыеЗатраты Цикл
			Строка.ВремяРаботыТекст = СформироватьПродолжительность(Строка.ВремяРаботы);
		КонецЦикла;
		
	Иначе
		
		Если Объект.РемонтыОборудования.Количество() <> 0 Тогда
			
			Для каждого Стр Из ДеревоРемонтныхРабот.ПолучитьЭлементы() Цикл
				//Стр.ПроцентВыполненияРабот = 0;
				Стр.Выполнено = Ложь;
				
				ПроставитьГалкиВВетке(Стр, Ложь, 0);
				
			КонецЦикла;
			
		КонецЕсли;
		
		Для каждого Стр Из Объект.РемонтныеРаботы Цикл
			
			//Стр.ПроцентВыполненияРабот = 0;
			Стр.Выполнено = Ложь;
			
		КонецЦикла;
		
		Для каждого Стр Из Объект.РемонтыОборудования Цикл
			
			Стр.ЗавершитьРемонт = Ложь;
			
		КонецЦикла; 
		
		Элементы.ДеревоРемонтныхРаботПроцентВыполненияРабот.ТолькоПросмотр = Ложь;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СпособСогласованияПриИзменении(Элемент)
	
	Если фПослеОчистки = Ложь Тогда
		ОбновитьДеревоСогласующих(Истина);
		торо_РаботаССогласованиямиКлиентСервер.ДобавитьСтрокуВИсториюСтатусов(ЭтаФорма, СтатусДокументаРегистр,, Истина);
	Иначе
		фПослеОчистки = Ложь;
	КонецЕсли;
	
	УправлениеВидимостью(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СпособСогласованияОчистка(Элемент, СтандартнаяОбработка)
	Если Элемент.Значение = ПредопределенноеЗначение("Справочник.торо_СпособыСогласованияДокументов.ПустаяСсылка") Тогда
		фПослеОчистки = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СпособСогласованияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если СогласующиеРегистр.Количество() > 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("СпособСогласованияНачалоВыбораЗавершение", ЭтаФорма, Новый Структура("Элемент",Элемент)),
		НСтр("es='¡Los datos de los estatus establecidos del documento serán limpiados! ¿Continuar?';ru='Данные по установленным статусам документа будут очищены! Продолжить?';en='Data on the established statuses of the document will be cleared! Continue?'"),
		РежимДиалогаВопрос.ДаНет, 60);		
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СпособСогласованияНачалоВыбораЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		СогласующиеРегистр.Очистить();
		Если мХранитьИсториюСогласованияВДокументах Тогда
			Объект.Согласующие.Очистить();
		КонецЕсли;
		ОткрытьФорму("Справочник.торо_СпособыСогласованияДокументов.ФормаВыбора",,ДополнительныеПараметры.Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоРемонтныхРабот
&НаКлиенте
Процедура ДеревоРемонтныхРаботПроцентВыполненияРаботПриИзменении(Элемент)
	
	ПерерасчитатьПроцентыВыполненияРабот();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерерасчитатьПроцентыВыполненияРабот()

	ТекСтрокаДерева = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	
	Если ТекСтрокаДерева = Неопределено Тогда
		 ТекСтрокаДерева = ДеревоРемонтныхРабот.ПолучитьЭлементы()[0];
	КонецЕсли; 
	 
	ТекСтрокаДерева.ПроцентВыполненияРабот = мин(100, ТекСтрокаДерева.ПроцентВыполненияРабот);
	ТекСтрокаДерева.Выполнено = (ТекСтрокаДерева.ПроцентВыполненияРабот = 100);
	СтруктураСтроки = Новый Структура("ID, РемонтыОборудования_ID, Родитель_ID", ТекСтрокаДерева.ID, ТекСтрокаДерева.РемонтыОборудования_ID, ТекСтрокаДерева.Родитель_ID);
	
	СтрокаРодДерева = ТекСтрокаДерева.ПолучитьРодителя();
	Если Не СтрокаРодДерева = Неопределено Тогда
		СтруктураРодСтроки = Новый Структура("ID, РемонтыОборудования_ID, Родитель_ID", ТекСтрокаДерева.ID, ТекСтрокаДерева.РемонтыОборудования_ID, ТекСтрокаДерева.Родитель_ID);
	Иначе
		СтруктураРодСтроки = Неопределено;
	КонецЕсли;
	ЗаполнитьПроцентВыполненияРемонтныхРаботВСтрокахДерева(СтруктураСтроки, СтруктураРодСтроки);
	
	ОбновитьПроцентВыполненияВСтрокахТЧ(ДеревоРемонтныхРабот.ПолучитьЭлементы()[0]);	
	
	Строка = ВыполнитьПоискПоДереву(СтруктураСтроки);
	Элементы.ДеревоРемонтныхРабот.ТекущаяСтрока = Строка.ПолучитьИдентификатор();
	
	Для Каждого Строка Из ДеревоРемонтныхРабот.ПолучитьЭлементы() Цикл
		РазвернутьДеревоРемонтныхРабот(Строка);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Функция ВыполнитьПоискПоДереву(СтруктураСтроки)
	
	Для каждого СтрокаДерева из ДеревоРемонтныхРабот.ПолучитьЭлементы() Цикл
		Соответствие = Истина;
		Для каждого ЭлементСтруктуры из СтруктураСтроки Цикл
			Если ЭлементСтруктуры.Значение <> СтрокаДерева[ЭлементСтруктуры.Ключ] Тогда
				Соответствие = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Соответствие Тогда
			Возврат СтрокаДерева;
		КонецЕсли;
		
		Результат = РекурсивныйПоискПоСтрокеДерева(СтруктураСтроки, СтрокаДерева);
		Если Результат <> Неопределено Тогда
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Функция РекурсивныйПоискПоСтрокеДерева(СтруктураСтроки, СтрокаДерева)
	
	Для каждого Подстрока из СтрокаДерева.ПолучитьЭлементы() Цикл
		Соответствие = Истина;
		Для каждого ЭлементСтруктуры из СтруктураСтроки Цикл
			Если ЭлементСтруктуры.Значение <> Подстрока[ЭлементСтруктуры.Ключ] Тогда
				Соответствие = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Соответствие Тогда
			Возврат Подстрока;
		КонецЕсли;
		
		Результат = РекурсивныйПоискПоСтрокеДерева(СтруктураСтроки, Подстрока); 
		Если Результат <> Неопределено Тогда
			Возврат Результат;
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура ДеревоРемонтныхРаботОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекСтрокаДерева = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	
	Если ТекСтрокаДерева = Неопределено Тогда
		СтрокаРодитель = Новый Структура("ID, РемонтыОборудования_ID, Родитель_ID", "", "", "");
		ИДВыбраннойСтроки = "";
	Иначе
		СтрокаРодитель = ТекСтрокаДерева;
		ИДВыбраннойСтроки = ТекСтрокаДерева.ID;
	КонецЕсли;
	
	ТекРемонт = Элементы.РемонтыОборудования.ТекущиеДанные;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") И ВыбранноеЗначение.Количество() > 0 И ТипЗнч(ВыбранноеЗначение[0]) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда
		ТекущийРемонт = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
		Пока ТекущийРемонт <> Неопределено И ТипЗнч(ТекущийРемонт.РемонтнаяРабота) <> Тип("Строка") Цикл
			Если ТекущийРемонт.РемонтнаяРабота = ВыбранноеЗначение[0] Тогда
				ШаблонСообщения = НСтр("es='El significado escogido ""%1"" no puede ser incluido en la composición.';ru='Выбранное значение ""%1"" не может быть включено в состав самого себя.';en='The selected value ""%1"" cannot be included in itself.'");
				ТекстСообщения = СтрШаблон(ШаблонСообщения, ВыбранноеЗначение[0]);
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
				Возврат;
			КонецЕсли; 
			ТекущийРемонт = ТекущийРемонт.ПолучитьРодителя();	
		КонецЦикла; 	
	КонецЕсли; 
			
	Если ТекРемонт <> Неопределено Тогда
		РемонтыОборудования_ID = ТекРемонт.ID;
		ДатаНачалаРемонта      = ТекРемонт.ДатаНачала;
	Иначе
		РемонтыОборудования_ID = "";
		ДатаНачалаРемонта      = Неопределено;       
	КонецЕсли;
	
	ТекущиеДанные = Новый Структура("ТекущийРемонт_ID, СтрокаРодитель_ID, СтрокаРодительРемонтыОборудования_ID, СтрокаРодительРодитель_ID, ДатаНачалаРемонта", 
		РемонтыОборудования_ID, СтрокаРодитель.ID, СтрокаРодитель.РемонтыОборудования_ID, СтрокаРодитель.Родитель_ID, ДатаНачалаРемонта);
	СтруктураПараметры = Новый Структура;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		МассивСтруктурВозврата = ДеревоРемонтныхРаботОбработкаВыбораНаСервереДляМассива(ВыбранноеЗначение, ТекущиеДанные, СтруктураПараметры);
		Если ФОИспользоватьОстановочные Тогда
			ОбновитьОстановочные();
		КонецЕсли;
	Иначе
		СтруктураВозврата = ДеревоРемонтныхРаботОбработкаВыбораНаСервере(ВыбранноеЗначение, ТекущиеДанные, СтруктураПараметры);
		МассивСтруктурВозврата = Новый Массив;
		МассивСтруктурВозврата.Добавить(СтруктураВозврата);
		Если ФОИспользоватьОстановочные Тогда
			ОбновитьОстановочные();
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого СтруктураВозврата Из МассивСтруктурВозврата Цикл
		Если ТипЗнч(СтруктураВозврата) = Тип("Строка") Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтруктураВозврата);
		КонецЕсли;
	КонецЦикла;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		Массивстрок = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", ВыбранноеЗначение.СтрокаРемонтовОборудования.ID));
		Если МассивСтрок.Количество() Тогда
			Идентиф = МассивСтрок[0].ПолучитьИдентификатор();
			Элементы.РемонтыОборудования.ТекущаяСтрока = Идентиф;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Массив") И ВыбранноеЗначение.Количество() > 0 И 
		НЕ ТипЗнч(ВыбранноеЗначение[0])= Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") И
		НЕ ТипЗнч(ВыбранноеЗначение[0])= Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
		Массивстрок = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", ВыбранноеЗначение[0].СтрокаРемонтовОборудования.ID));
		Если МассивСтрок.Количество() Тогда
			Идентиф = МассивСтрок[0].ПолучитьИдентификатор();
			Элементы.РемонтыОборудования.ТекущаяСтрока = Идентиф;
		КонецЕсли;		
	КонецЕсли;
	
	ОбновитьЗависимыеЛоты();
	РемонтыОборудованияПриАктивизацииСтроки(Элементы.РемонтыОборудования);
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		МассивID = Новый Массив;
		Для Каждого СтрокаРР Из ВыбранноеЗначение.МассивСтрокРемонтныхРабот Цикл
			МассивID.Добавить(СтрокаРР.ID);
		КонецЦикла;
		ОтметитьНаличиеАналогов(МассивID);
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда
		ОтметитьНаличиеАналогов();
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
		Для Каждого СтрокаРР Из Объект.РемонтныеРаботы Цикл
			Если СтрокаРР.РемонтнаяРабота = ВыбранноеЗначение Тогда
				ОтметитьНаличиеАналогов(СтрокаРР.ID);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Для каждого Строка Из Объект.ТрудовыеЗатраты Цикл
		Строка.ВремяРаботыТекст = СформироватьПродолжительность(Строка.ВремяРаботы);
	КонецЦикла;
	
	Для каждого Строка из Объект.МатериальныеЗатраты Цикл
		Строка.ХарактеристикиИспользуются = торо_НоменклатураСервер.ПолучитьХарактеристикиИспользуются(Строка.Номенклатура);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ИДВыбраннойСтроки) Тогда
		Идентификатор = Неопределено;
		ОбщегоНазначенияКлиентСервер.ПолучитьИдентификаторСтрокиДереваПоЗначениюПоля("ID", Идентификатор, ДеревоРемонтныхРабот.ПолучитьЭлементы(), ИДВыбраннойСтроки, Ложь);
		Если Идентификатор <> Неопределено Тогда
			Элементы.ДеревоРемонтныхРабот.ТекущаяСтрока = Идентификатор;
		КонецЕсли;
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗависимыеЛоты()
	Если Константы.торо_ИспользоватьЛоты.Получить() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	торо_ЗапланированныеПодрядчикиРемонтовСрезПоследних.ID КАК ID
		               |ИЗ
		               |	РегистрСведений.торо_ЗапланированныеПодрядчикиРемонтов.СрезПоследних КАК торо_ЗапланированныеПодрядчикиРемонтовСрезПоследних
		               |ГДЕ
		               |	торо_ЗапланированныеПодрядчикиРемонтовСрезПоследних.ID В(&МассивID)";
		Запрос.УстановитьПараметр("МассивID", Объект.РемонтыОборудования.Выгрузить().ВыгрузитьКолонку("ID"));
		МассивСвязанныхЛотов = Запрос.Выполнить().Выгрузить();
		МассивIDЛотов.Очистить();
		Для каждого Ремонт Из МассивСвязанныхЛотов Цикл
			 МассивIDЛотов.Добавить(Ремонт.ID);
		КонецЦикла; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРемонтныхРаботПередУдалением(Элемент, Отказ)
	
	ТекСтрокаДРР = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	
	мСтруктураТабличныхЧастейСвязанныхСДеревомРемонтныхРабот = Новый Структура();
	мСтруктураТабличныхЧастейСвязанныхСДеревомРемонтныхРабот.Вставить("МатериальныеЗатраты");
	мСтруктураТабличныхЧастейСвязанныхСДеревомРемонтныхРабот.Вставить("СерийныеЗапчасти");
	мСтруктураТабличныхЧастейСвязанныхСДеревомРемонтныхРабот.Вставить("ТрудовыеЗатраты");
	мСтруктураТабличныхЧастейСвязанныхСДеревомРемонтныхРабот.Вставить("РемонтныеРаботы");
	
	СтруктураСвязанныхТЧ = Новый Структура();
	СтруктураСвязанныхТЧ.Вставить("МатериальныеЗатраты");
	СтруктураСвязанныхТЧ.Вставить("СерийныеЗапчасти");
	СтруктураСвязанныхТЧ.Вставить("ТрудовыеЗатраты");
	СтруктураСвязанныхТЧ.Вставить("РемонтныеРаботы");
	
	Если НЕ ЗначениеЗаполнено(ТекСтрокаДРР.Родитель_ID) И ТекСтрокаДРР.РемонтнаяРабота = "Ремонтные работы" Тогда
			
		ТекСтрокаДРР.ПолучитьЭлементы().Очистить();
		
		Для Каждого КлючИЗначение Из СтруктураСвязанныхТЧ Цикл
			
			ТабличнаяЧасть = Объект[КлючИЗначение.Ключ];
		
			ПараметрыПоиска = Новый Структура;
			ПараметрыПоиска.Вставить("РемонтыОборудования_ID", Элементы.РемонтыОборудования.ТекущиеДанные.ID);
		
			СтрокиКУдалению = ТабличнаяЧасть.НайтиСтроки(ПараметрыПоиска);
			
			Для Каждого Строка Из СтрокиКУдалению Цикл
				
				ТабличнаяЧасть.Удалить(Строка);
				
			КонецЦикла;		    
						
		КонецЦикла;

		Модифицированность = Истина;
		
		Отказ = Истина;

	Иначе
		
		ВыделенныеСтроки = Элементы.ДеревоРемонтныхРабот.ВыделенныеСтроки;
		МассивСтрокДляУдаления = Новый Массив;
		
		Для каждого Стр Из ВыделенныеСтроки Цикл 
			Строка = ДеревоРемонтныхРабот.НайтиПоИдентификатору(Стр);
			Если Строка <> Неопределено И Строка.РемонтнаяРабота <> "Ремонтные работы" Тогда 
				МассивСтрокДляУдаления.Добавить(Строка);
			КонецЕсли;
		КонецЦикла;		
		
		Для каждого Элемент Из МассивСтрокДляУдаления Цикл
							
			СтруктурыДляПередачи = Новый Структура("ID, РемонтыОборудования_ID, Родитель_ID, РемонтнаяРабота",
			Элемент.ID, Элемент.РемонтыОборудования_ID, Элемент.Родитель_ID, Элемент.РемонтнаяРабота);
			УдалитьДанныеТЧПоIDСтрокиДереваНаСервере(СтруктурыДляПередачи, СтруктураСвязанныхТЧ);
			
			СтрокаРодителя = Элемент.ПолучитьРодителя();
			Если СтрокаРодителя <> Неопределено Тогда 
				СтрокаРодителя.ПолучитьЭлементы().Удалить(Элемент); 
			КонецЕсли;
		КонецЦикла;
		
		
		Модифицированность = Истина;
		Отказ = Истина;  
		
	КонецЕсли;
	
	ПересчитатьПроцентыВыполненияВДеревеНаСервере();
	РазвернутьДеревоРемонтныхРабот(ДеревоРемонтныхРабот.ПолучитьЭлементы()[0]);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРемонтныхРаботПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	
	Если НЕ ТекДанные = Неопределено Тогда
		УстановитьОтборСтрокПоЗатратам();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРемонтныхРаботПриИзменении(Элемент)
	
	Если Объект.РемонтныеРаботы.Количество() > 1 Тогда 
		торо_ДанныеФормыДеревоКлиентСервер.УпорядочитьРемонтныеРаботы(ДеревоРемонтныхРабот, Объект.РемонтныеРаботы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРемонтныхРаботПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРемонтныхРаботКоличествоПриИзменении(Элемент)
	ТекСтрока = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	Если ТекСтрока.Количество <= 0 Тогда
		ТекСтрока.Количество = 1;
	КонецЕсли;
	
	ID = ТекСтрока.ID;
	РемID = ТекСтрока.РемонтыОборудования_ID;
	СтрукПоиска = Новый Структура("ID, РемонтыОборудования_ID", ID, РемID);
	
	МассивСтрТЧ = Объект.РемонтныеРаботы.НайтиСтроки(СтрукПоиска);
	Если МассивСтрТЧ.Количество() Тогда
		СтрТЧ = МассивСтрТЧ[0];
		
		КоличествоБуфер = ?(СтрТЧ.Количество = 0, 1, СтрТЧ.Количество);
		Коэффициент = ТекСтрока.Количество / КоличествоБуфер;
		СтрТЧ.Количество = ТекСтрока.Количество;
		
		ПересчитатьЗатратыПоКоличеству(СтрукПоиска, Коэффициент);
		
		ПересчитатьКоличествоВПодчиненныхСтроках(ТекСтрока, Коэффициент);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРемонтныхРаботВыполненоПриИзменении(Элемент)
	
	ТекСтрокаДерева = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	
	ТекСтрокаДерева.ПроцентВыполненияРабот = ?(ТекСтрокаДерева.Выполнено, 100, 0);
	СтруктураСтроки = Новый Структура("ID, РемонтыОборудования_ID, Родитель_ID", ТекСтрокаДерева.ID, ТекСтрокаДерева.РемонтыОборудования_ID, ТекСтрокаДерева.Родитель_ID);
	СтрокаРодДерева = ТекСтрокаДерева.ПолучитьРодителя();
	Если Не СтрокаРодДерева = Неопределено Тогда
		СтруктураРодСтроки = Новый Структура("ID, РемонтыОборудования_ID, Родитель_ID", ТекСтрокаДерева.ID, ТекСтрокаДерева.РемонтыОборудования_ID, ТекСтрокаДерева.Родитель_ID);
	Иначе
		СтруктураРодСтроки = Неопределено;
	КонецЕсли;
	
	Если НЕ ТекСтрокаДерева = Неопределено Тогда 
		МассивСтрок = Объект.РемонтныеРаботы.НайтиСтроки(СтруктураСтроки);
		Если МассивСтрок.Количество() Тогда
			МассивСтрок[0].Выполнено = ТекСтрокаДерева.Выполнено;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьПроцентВыполненияРемонтныхРаботВСтрокахДерева(СтруктураСтроки, СтруктураРодСтроки);
	
	ОбновитьПроцентВыполненияВСтрокахТЧ(ДеревоРемонтныхРабот.ПолучитьЭлементы()[0]);
	
	Если Не ТекСтрокаДерева.Выполнено Тогда
		
		Объект.ЗавершитьРемонтныеРаботы = Ложь;
		Если НЕ Элементы.РемонтыОборудования.ТекущиеДанные = Неопределено Тогда
			МасСтр = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", Элементы.РемонтыОборудования.ТекущиеДанные.ID));
			Если МасСтр.Количество() > 0 Тогда
				МасСтр[0].ЗавершитьРемонт = Ложь;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого Строка Из ДеревоРемонтныхРабот.ПолучитьЭлементы() Цикл
		РазвернутьДеревоРемонтныхРабот(Строка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРемонтныхРаботПослеУдаления(Элемент)
	
	ЗаполнитьИспользованиеХарактеристикЗапчастей();
	
	Для каждого СтрокаМатЗатрат Из Объект.МатериальныеЗатраты Цикл
		
		условие1 = ЗначениеЗаполнено(СтрокаМатЗатрат.ХарактеристикаНоменклатуры);
		условие2 = торо_НоменклатураСервер.ПолучитьХарактеристикиИспользуются(СтрокаМатЗатрат.Номенклатура);
		Если условие1  Или условие2 Тогда
			СтрокаМатЗатрат.ХарактеристикиИспользуются = Истина;
		КонецЕсли; 
		
	КонецЦикла;
	
	Для каждого Строка Из Объект.ТрудовыеЗатраты Цикл
		Строка.ВремяРаботыТекст = СформироватьПродолжительность(Строка.ВремяРаботы);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРемонтныхРаботНоваяОперацияПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		СтарыйID = ТекущиеДанные.ID;
		МассивВозврата = торо_ПроцентыВыполнения.НайтиОперациюВРегистре(ТекущиеДанные.РемонтнаяРабота, ТекущиеДанные.Родитель_ID, ТекущиеДанные.РемонтыОборудования_ID, ТекущиеДанные.НоваяОперация, Объект.Ссылка);
		Если МассивВозврата.Количество() = 1 И МассивВозврата[0].Новая = Истина И ТекущиеДанные.НоваяОперация = Ложь Тогда
			ТекстСообщения = НСтр("es='¡La operación no es encontrada!';ru='Операция не найдена!';en='Operation not found!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			ТекущиеДанные.НоваяОперация = Истина;
			ИзменитьIDВТабличныхЧастях(МассивВозврата[0].ID, СтарыйID);
			ПерерасчитатьПроцентыВыполненияРабот();
		ИначеЕсли МассивВозврата.Количество() = 1 Тогда
			СтруктураПоиска = Новый Структура("ID", МассивВозврата[0].ID);
			Имеющиеся = Объект.РемонтныеРаботы.НайтиСтроки(СтруктураПоиска);
			Если Имеющиеся.Количество() = 0 Тогда
				ТекущиеДанные.ID = МассивВозврата[0].ID;
				Если МассивВозврата[0].Процент < 0 Тогда
					ТекущиеДанные.ПроцентВыполненияРабот = (100 + МассивВозврата[0].Процент) / ТекущиеДанные.Количество;
				Иначе
					ТекущиеДанные.ПроцентВыполненияРабот = МассивВозврата[0].Процент / ТекущиеДанные.Количество;
				КонецЕсли;				
				ИзменитьIDВТабличныхЧастях(МассивВозврата[0].ID, СтарыйID);
				ПерерасчитатьПроцентыВыполненияРабот();
			Иначе
				ТекстСообщения = НСтр("es='¡Esta operación es añadida ya!';ru='Эта операция уже добавлена!';en='This operation has already been added!'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
				ТекущиеДанные.НоваяОперация = Истина;
			КонецЕсли;
		Иначе
			Оповещение = Новый ОписаниеОповещения("ОбработкаВыбораIDОперации", ЭтотОбъект, Новый Структура("Элемент", Элемент));
			СтруктураЗаполнения = Новый Структура("МассивВозврата", МассивВозврата); 
			ОткрытьФорму("ОбщаяФорма.торо_ФормаВыбораОперации", СтруктураЗаполнения,,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРемонтныхРаботИсполнительПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.ДоговорБригада = Неопределено;
		УстановитьПараметрыВыбораДоговораБригады_ДляРемонтныхРабот(ТекущиеДанные.Исполнитель, ТекущиеДанные.РемонтыОборудования_ID);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДеревоРемонтныхРаботПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		УстановитьПараметрыВыбораИсполнителя_ДляРемонтныхРабот(ТекущиеДанные.РемонтыОборудования_ID);
		УстановитьПараметрыВыбораДоговораБригады_ДляРемонтныхРабот(ТекущиеДанные.Исполнитель, ТекущиеДанные.РемонтыОборудования_ID);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРемонтыОборудования
&НаКлиенте
Процедура РемонтыОборудованияЗавершитьРемонтПриИзменении(Элемент)
	
	ТекДанные = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если НЕ ТекДанные = Неопределено Тогда
		Если ТекДанные.ЗавершитьРемонт Тогда
			
			Элементы.ДеревоРемонтныхРаботПроцентВыполненияРабот.ТолькоПросмотр = Истина;
			УстановитьОставшиесяПроцентыРабот(ТекДанные.ID); 
			РемонтыОборудованияПриАктивизацииСтроки(Элементы.РемонтыОборудования);
			
			ФлВсеРемонтыЗавершены = Истина;
			
			Для каждого Стр Из Объект.РемонтыОборудования Цикл
				Если НЕ Стр.ЗавершитьРемонт Тогда
					ФлВсеРемонтыЗавершены = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если ФлВсеРемонтыЗавершены Тогда 
				Объект.ЗавершитьРемонтныеРаботы = Истина;
			КонецЕсли;
			
			СлужебныеРеквизитыЗаполнитьНаСервере();
			
			Для каждого Строка Из Объект.ТрудовыеЗатраты Цикл
				Строка.ВремяРаботыТекст = СформироватьПродолжительность(Строка.ВремяРаботы);
			КонецЦикла;
			
		Иначе
			
			Для каждого Стр Из ДеревоРемонтныхРабот.ПолучитьЭлементы() Цикл
				
				//Стр.ПроцентВыполненияРабот = 0;
				Стр.Выполнено = Ложь;
				
				ПроставитьГалкиВВетке(Стр, Ложь, 0);
				
			КонецЦикла; 
			
			Объект.ЗавершитьРемонтныеРаботы = Ложь;
			
			МассивСтрок = Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", ТекДанные.ID));
			
			Для каждого Стр Из МассивСтрок Цикл
				
				//Стр.ПроцентВыполненияРабот = 0;
				Стр.Выполнено = Ложь;
				
			КонецЦикла;
			
			Элементы.ДеревоРемонтныхРаботПроцентВыполненияРабот.ТолькоПросмотр = Ложь;
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РемонтыОборудованияПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда
		ЗаполнитьДеревоРемонтныхРаботНаСервере(Элементы.РемонтыОборудования.ТекущиеДанные.ID);
		Элементы.ДеревоРемонтныхРабот.Развернуть(ДеревоРемонтныхРабот.ПолучитьЭлементы()[0].ПолучитьИдентификатор(),Истина);
		
		Если ТекДанные.ЗавершитьРемонт Тогда
			Строки = ДеревоРемонтныхРабот.ПолучитьЭлементы();
			//Строки[0].ПроцентВыполненияРабот = 100;
			Строки[0].Выполнено = Истина;
		КонецЕсли;
		
		УстановитьДоступностьДляРедактированияПоТекРемонту(ТекДанные.БлокироватьДляИзменения, ТекДанные.ОбъектРемонта);
		
		Найденный = МассивIDЛотов.НайтиПоЗначению(ТекДанные.ID);
		Если Найденный <> Неопределено Тогда
			Элементы.ИсполнителиПоРемонтамЗаполнитьИзЛотов.Доступность = Истина;
		Иначе
			Элементы.ИсполнителиПоРемонтамЗаполнитьИзЛотов.Доступность = Ложь;
		КонецЕсли;

	Иначе
		ЗаполнитьДеревоРемонтныхРаботНаСервере();
	КонецЕсли;
	
	ЗаполнитьЕдиницыИзмерения(ДеревоРемонтныхРабот);
	
	Для Каждого Строка Из ДеревоРемонтныхРабот.ПолучитьЭлементы() Цикл
		РазвернутьДеревоРемонтныхРабот(Строка);
	КонецЦикла;
	
	Если ТекДанные <> Неопределено Тогда
		Элементы.ДеревоРемонтныхРаботПроцентВыполненияРабот.ТолькоПросмотр = ТекДанные.ЗавершитьРемонт;
	КонецЕсли;
	
	УстановитьОтборыСвязанныхТаблицРемонты();
	УстановитьПараметрыВыбораНоменклатуры();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЕдиницыИзмерения(Дерево)
	Для Каждого РемРабота Из Дерево.ПолучитьЭлементы() Цикл
		Если ТипЗнч(РемРабота.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
			РемРабота.ТехОперация = РемРабота.РемонтнаяРабота;
		КонецЕсли;
		ЗаполнитьЕдиницыИзмерения(РемРабота);
	КонецЦикла;
КонецПроцедуры
	
&НаКлиенте
Процедура РемонтыОборудованияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
	ПодборРемонтов(Элементы.РемонтыОборудованияПодборРемонтов);
КонецПроцедуры

&НаКлиенте
Процедура РемонтыОборудованияПередНачаломИзменения(Элемент, Отказ)
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если Не ТекДанные = Неопределено И ТекДанные.БлокироватьДляИзменения Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РемонтыОборудованияПередУдалением(Элемент, Отказ)
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если Не ТекДанные = Неопределено И ТекДанные.БлокироватьДляИзменения Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Вопрос = НСтр("es='Los trabajos de reparación vinculados serán limpiados. ¿Continuar?';ru='Связанные ремонтные работы будут очищены. Продолжить?';en='Related repairs will be cleared. Continue?'");
	
	Если НЕ РемонтОборудованияУдаляется Тогда
		Отказ = Истина;
		ПоказатьВопрос(Новый ОписаниеОповещения("РемонтыОборудованияПередУдалениемЗавершение",ЭтаФорма,Новый Структура("Элемент",Элемент)),
		Вопрос,РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РемонтыОборудованияПередУдалениемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Строки = ДополнительныеПараметры.Элемент.ВыделенныеСтроки;
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Для каждого идСтрока из Строки Цикл
			
			текСтрока = Объект.РемонтыОборудования.НайтиПоИдентификатору(идСтрока);
			
			ОчиститьСвязанныеТабличныеЧасти(, , текСтрока.ID);
			РемонтОборудованияУдаляется = Истина;
			Объект.РемонтыОборудования.Удалить(текСтрока);
			РемонтОборудованияУдаляется = Ложь;
		КонецЦикла;
		
		Модифицированность = Истина;
		
		Для Каждого Строка Из ДеревоРемонтныхРабот.ПолучитьЭлементы() Цикл
			РазвернутьДеревоРемонтныхРабот(Строка);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РемонтыОборудованияДатаНачалаПриИзменении(Элемент)
	ТекРемонтID = Элементы.РемонтыОборудования.ТекущиеДанные.ID;
	МассивID = ПолучитьIDОперацийПоIDРемонта(Объект, ТекРемонтID);
	ОтметитьНаличиеАналогов(МассивID);
КонецПроцедуры

&НаКлиенте
Процедура РемонтыОборудованияПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекДанные = Элементы.РемонтыОборудования.ТекущиеДанные;
	
	Если Не ТекДанные = Неопределено Тогда
		Если ФОИспользоватьГарантии Тогда
			
			ТекДанные.ГарантийныйРемонт = торо_ГарантийноеОбслуживание.ПолучитьЗначениеФлагаГарантийныйРемонтДляОбъектаРемонта(ТекДанные.ОбъектРемонта, ТекДанные.ДатаНачала, ТекДанные.ДатаОкончания);
			
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура РемонтыОборудованияОбъектРемонтаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура РемонтыОборудованияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Если Поле.Имя = "РемонтыОборудованияВРамкахОстановочного" И ЗначениеЗаполнено(ТекДанные.ВРамкахОстановочного) Тогда
			ОткрытьФорму("Документ.торо_ОстановочныеРемонты.Форма.ФормаДокумента", Новый Структура("Ключ, ID", ТекДанные.ВРамкахОстановочного, ТекДанные.ID), ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыМатериальныеЗатраты
&НаКлиенте
Процедура МатериальныеЗатратыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	ТекСтрокаДереваРемонтныхРабот = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	ТекстПредупреждения = НСтр("es='¡Se puede indicar los gastos solamente para las operaciones tecnológicas!';ru='Материальные затраты можно указывать только для технологических операций!';en='Material costs can only be indicated for technological operations!'");
	ПроверкаТипаВСтрокеДереваРемонтныхРабот(ТекСтрокаДереваРемонтныхРабот, Тип("СправочникСсылка.торо_ТехнологическиеОперации"), ТекстПредупреждения, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура МатериальныеЗатратыКоличествоПриИзменении(Элемент)
	
	ТекДанные = Элементы.МатериальныеЗатраты.ТекущиеДанные;
	Если НЕ ТекДанные = Неопределено Тогда
		ПриСменеЗначенийКоличестваИлиУпаковки(ТекДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериальныеЗатратыЕдиницаИзмеренияПриИзменении(Элемент)
	
	ТекДанные = Элементы.МатериальныеЗатраты.ТекущиеДанные;
	Если НЕ ТекДанные = Неопределено Тогда
		ПриСменеЗначенийКоличестваИлиУпаковки(ТекДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериальныеЗатратыПередНачаломИзменения(Элемент, Отказ)
	Если Элемент.ТекущийЭлемент.Имя = "МатериальныеЗатратыЕстьАналоги" Тогда
		ПодобратьАналогиНаКлиенте();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МатериальныеЗатратыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если НоваяСтрока И Не ОтменаРедактирования Тогда 
		//
		ТекСтрокаДереваРемонтныхРабот = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
		Элемент.ТекущиеДанные.ID = ТекСтрокаДереваРемонтныхРабот.ID;
		Элемент.ТекущиеДанные.РемонтыОборудования_ID = ТекСтрокаДереваРемонтныхРабот.РемонтыОборудования_ID;
		
	КонецЕсли;
	
	Если НЕ ОтменаРедактирования Тогда
		ТекСтрока = Элементы.МатериальныеЗатраты.ТекущиеДанные;
		ОтметитьНаличиеАналогов(ТекСтрока.ID);
	КонецЕсли;
	
	Если НЕ НоваяСтрока ИЛИ (НоваяСтрока И Не ОтменаРедактирования) Тогда
		ТекСтрокаНоменклатура = Элементы.МатериальныеЗатраты.ТекущиеДанные;
		СтруктураПоиска = Новый Структура("ID,РемонтыОборудования_ID,Номенклатура,ХарактеристикаНоменклатуры",
		ТекСтрокаНоменклатура.ID,
		ТекСтрокаНоменклатура.РемонтыОборудования_ID, 
		ТекСтрокаНоменклатура.Номенклатура,
		ТекСтрокаНоменклатура.ХарактеристикаНоменклатуры);
		
		Если Объект.МатериальныеЗатраты.НайтиСтроки(СтруктураПоиска).Количество() > 1 Тогда
			Если НЕ ЗначениеЗаполнено(СтруктураПоиска.ХарактеристикаНоменклатуры) Тогда
				ТекстПредупреждения = СтрШаблон(
				НСтр("es='¡Para la operación tecnológica la nomenclatura %1 es añadida ya!';ru='Для технологической операции номенклатура %1 уже добавлена!';en='For process operation, item%1 has already been added!'"),СтруктураПоиска.Номенклатура);
			Иначе
				ТекстПредупреждения = СтрШаблон(
				НСтр("es='¡Para la operación tecnológica la nomenclatura %1 con la característica %2 es añadida ya!';ru='Для технологической операции номенклатура %1 с характеристикой %2 уже добавлена!';en='For process operation, item%1 with characteristic%2 has already been added!'"),СтруктураПоиска.Номенклатура,СтруктураПоиска.ХарактеристикаНоменклатуры);
			КонецЕсли;
			ПоказатьПредупреждение(Неопределено, ТекстПредупреждения);
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериальныеЗатратыНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.МатериальныеЗатраты.ТекущиеДанные;
	
	ТекущаяСтрока.ХарактеристикиИспользуются = торо_НоменклатураСервер.ПолучитьХарактеристикиИспользуются(ТекущаяСтрока.Номенклатура);
	
	Если Не ТекущаяСтрока.ХарактеристикиИспользуются Тогда
		ТекущаяСтрока.ХарактеристикаНоменклатуры = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериальныеЗатратыЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗаполнитьДанныеВыбораУпаковки(Элементы.МатериальныеЗатраты.ТекущиеДанные.Номенклатура, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура МатериальныеЗатратыХарактеристикаНоменклатурыАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.МатериальныеЗатраты.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущиеДанные.Номенклатура, "ВидНоменклатуры");
		ИспользованиеХарактеристик = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидНоменклатуры, "ИспользованиеХарактеристик");
		ПараметрыПолученияДанных.Отбор.Очистить();
		Если ИспользованиеХарактеристик = ПредопределенноеЗначение("Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры") Тогда
			ПараметрыПолученияДанных.Отбор.Вставить("Владелец", ВидНоменклатуры);
		Иначе
			ПараметрыПолученияДанных.Отбор.Вставить("Владелец", ТекущиеДанные.Номенклатура);
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МатериальныеЗатратыХарактеристикаНоменклатурыОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.МатериальныеЗатраты.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущиеДанные.Номенклатура, "ВидНоменклатуры");
		ИспользованиеХарактеристик = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидНоменклатуры, "ИспользованиеХарактеристик");
		ПараметрыПолученияДанных.Отбор.Очистить();
		Если ИспользованиеХарактеристик = ПредопределенноеЗначение("Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры") Тогда
			ПараметрыПолученияДанных.Отбор.Вставить("Владелец", ВидНоменклатуры);
		Иначе
			ПараметрыПолученияДанных.Отбор.Вставить("Владелец", ТекущиеДанные.Номенклатура);
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МатериальныеЗатратыХарактеристикаНоменклатурыСоздание(Элемент, СтандартнаяОбработка)
	Если Элементы.МатериальныеЗатраты.ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(Элементы.МатериальныеЗатраты.ТекущиеДанные.Номенклатура) Тогда
		Вид = торо_ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(Элементы.МатериальныеЗатраты.ТекущиеДанные.Номенклатура, "ВидНоменклатуры");
		СтруктураПараметров = Новый Структура("ВидНоменклатуры, Владелец", Вид, Элементы.МатериальныеЗатраты.ТекущиеДанные.Номенклатура);
		ОткрытьФорму("Справочник.ХарактеристикиНоменклатуры.Форма.ФормаЭлемента", СтруктураПараметров);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИсполнителиПоРемонтам

&НаКлиенте
Процедура ИсполнителиПоРемонтамПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Элементы.РемонтыОборудования.ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиПоРемонтамПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И НЕ Копирование Тогда
		ТекущиеДанные = Элемент.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			СтрокаРемонта = Элементы.РемонтыОборудования.ТекущиеДанные;
			Если СтрокаРемонта <> Неопределено Тогда
				ТекущиеДанные.ДатаНачала = СтрокаРемонта.ДатаНачала;
				ТекущиеДанные.ДатаОкончания = СтрокаРемонта.ДатаОкончания;
				ТекущиеДанные.РемонтыОборудования_ID = СтрокаРемонта.ID;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиПоРемонтамИсполнительОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ИсполнителиПоРемонтам.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Исполнитель) ИЛИ ТекущиеДанные.Исполнитель = ВыбранноеЗначение Тогда
		Возврат;
	КонецЕсли; 	
	
	МассивСтрокДереваРР = НайтиРемонтныеРаботыДляОчисткиИсполнителей(ТекущиеДанные.РемонтыОборудования_ID, ТекущиеДанные.ПолучитьИдентификатор());
	
	Если МассивСтрокДереваРР.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		
		ШаблонВопроса = НСтр("es='El ejecutor %1 es indicado para el trabajo de reparación. Con el cambio el ejecutor dado será limpiado en el árbol de los trabajos de reparación. ¿Continuar?';ru='Исполнитель %1 указан для ремонтной работы. При изменении данный исполнитель будет очищен в дереве ремонтных работ. Продолжить?';en='Executor %1 is listed for repair work. When changing, this contractor will be cleared in the repair tree. Continue?'");
		ТекстВопроса = СтрШаблон(ШаблонВопроса, ТекущиеДанные.Исполнитель);
		
		ДополнительныеПараметры = Новый Структура("ТекущиеДанные, ИсполнительНовый, МассивСтрокДереваРР", ТекущиеДанные, ВыбранноеЗначение, МассивСтрокДереваРР);
		ОписаниеОповещения = Новый ОписаниеОповещения("ИсполнителиПоРемонтамИсполнительОбработкаВыбораПослеВопроса", ЭтотОбъект, ДополнительныеПараметры);
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиПоРемонтамИсполнительОбработкаВыбораПослеВопроса(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
		ИсполнительНовый = ДополнительныеПараметры.ИсполнительНовый;
		МассивСтрокДереваРР = ДополнительныеПараметры.МассивСтрокДереваРР;
		МассивСтрокРРОтбор = Новый Структура("РемонтыОборудования_ID, Исполнитель", ТекущиеДанные.РемонтыОборудования_ID, ТекущиеДанные.Исполнитель);
		МассивСтрокРР = Объект.РемонтныеРаботы.НайтиСтроки(МассивСтрокРРОтбор);
		
		Для каждого Строка из МассивСтрокРР Цикл
			Строка.Исполнитель = Неопределено;
			Строка.ДоговорБригада = Неопределено;
		КонецЦикла;
		
		Для каждого Строка из МассивСтрокДереваРР Цикл
			Строка.Исполнитель = Неопределено;
			Строка.ДоговорБригада = Неопределено;
		КонецЦикла;
		
		ТекущиеДанные.Исполнитель = ИсполнительНовый;
		ИсполнителиПоРемонтамИсполнительПриИзменении(Элементы.ИсполнителиПоРемонтам);
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиПоРемонтамИсполнительОчистка(Элемент, СтандартнаяОбработка)
	
	ИсполнителиПоРемонтамИсполнительОбработкаВыбора(Элемент, Неопределено, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиПоРемонтамИсполнительОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Текст) Тогда
		// Если сделать так, то вызывается событие ОбработкаВыбора, в противном случае - не вызывается. 
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиПоРемонтамИсполнительПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ИсполнителиПоРемонтам.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.УточнениеИсполнителя = Неопределено;
		УстановитьПараметрыВыбораДоговораБригады(ТекущиеДанные.Исполнитель, Элементы.ИсполнителиПоРемонтамУточнениеИсполнителя);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиПоРемонтамПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ИсполнителиПоРемонтам.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		УстановитьПараметрыВыбораДоговораБригады(ТекущиеДанные.Исполнитель, Элементы.ИсполнителиПоРемонтамУточнениеИсполнителя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиПоРемонтамПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ИсполнителиПоРемонтам.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Исполнитель) Тогда
		Возврат;
	КонецЕсли; 	
	
	МассивСтрокДереваРР = НайтиРемонтныеРаботыДляОчисткиИсполнителей(ТекущиеДанные.РемонтыОборудования_ID, ТекущиеДанные.ПолучитьИдентификатор());
	
	Если МассивСтрокДереваРР.Количество() > 0 Тогда
		Отказ = Истина;
		
		ШаблонВопроса = НСтр("es='El ejecutor %1 es indicado para el trabajo de reparación. Con el cambio el ejecutor dado será limpiado en el árbol de los trabajos de reparación. ¿Continuar?';ru='Исполнитель %1 указан для ремонтной работы. При изменении данный исполнитель будет очищен в дереве ремонтных работ. Продолжить?';en='Executor %1 is listed for repair work. When changing, this contractor will be cleared in the repair tree. Continue?'");
		ТекстВопроса = СтрШаблон(ШаблонВопроса, ТекущиеДанные.Исполнитель);
		
		ДополнительныеПараметры = Новый Структура("ТекущиеДанные, МассивСтрокДереваРР", ТекущиеДанные, МассивСтрокДереваРР);
		ОписаниеОповещения = Новый ОписаниеОповещения("ИсполнителиПоРемонтамПередУдалениемПослеВопроса", ЭтотОбъект, ДополнительныеПараметры);
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиПоРемонтамПередУдалениемПослеВопроса(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
		МассивСтрокДереваРР = ДополнительныеПараметры.МассивСтрокДереваРР;
		МассивСтрокРРОтбор = Новый Структура("РемонтыОборудования_ID, Исполнитель", ТекущиеДанные.РемонтыОборудования_ID, ТекущиеДанные.Исполнитель);
		МассивСтрокРР = Объект.РемонтныеРаботы.НайтиСтроки(МассивСтрокРРОтбор);
		
		Для каждого Строка из МассивСтрокРР Цикл
			Строка.Исполнитель = Неопределено;
			Строка.ДоговорБригада = Неопределено;
		КонецЦикла;
		
		Для каждого Строка из МассивСтрокДереваРР Цикл
			Строка.Исполнитель = Неопределено;
			Строка.ДоговорБригада = Неопределено;
		КонецЦикла;
		
		Модифицированность = Истина;
		Объект.ИсполнителиПоРемонтам.Удалить(ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиПоРемонтамУточнениеИсполнителяОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ИсполнителиПоРемонтам.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.УточнениеИсполнителя) ИЛИ ТекущиеДанные.УточнениеИсполнителя = ВыбранноеЗначение Тогда
		Возврат;
	КонецЕсли; 	
	
	МассивСтрокДереваРР = НайтиРемонтныеРаботыДляОчисткиДоговораБригады(ТекущиеДанные.РемонтыОборудования_ID, ТекущиеДанные.ПолучитьИдентификатор());
	
	Если МассивСтрокДереваРР.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		
		ШаблонВопроса = НСтр("es='El contracto/brigada %1 es indicado para el trabajo de reparación. Con el cambio el contracto/brigada dado será limpiado en el árbol de los trabajos de reparación. ¿Continuar?';ru='Договор/бригада %1 указан для ремонтной работы. При изменении данный договор/бригада будет очищен в дереве ремонтных работ. Продолжить?';en='Contract / brigade %1 is indicated for repair work. Upon amendment, this contract / brigade will be cleared in the repair tree. Continue?'");
		ТекстВопроса = СтрШаблон(ШаблонВопроса, ТекущиеДанные.УточнениеИсполнителя);
		
		ДополнительныеПараметры = Новый Структура("ТекущиеДанные, ИсполнительНовый, МассивСтрокДереваРР", ТекущиеДанные, ВыбранноеЗначение, МассивСтрокДереваРР);
		ОписаниеОповещения = Новый ОписаниеОповещения("ИсполнителиПоРемонтамУточнениеИсполнителяОбработкаВыбораПослеВопроса", ЭтотОбъект, ДополнительныеПараметры);
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиПоРемонтамУточнениеИсполнителяОбработкаВыбораПослеВопроса(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
		ИсполнительНовый = ДополнительныеПараметры.ИсполнительНовый;
		МассивСтрокДереваРР = ДополнительныеПараметры.МассивСтрокДереваРР;
		МассивСтрокРРОтбор = Новый Структура("РемонтыОборудования_ID, ДоговорБригада", ТекущиеДанные.РемонтыОборудования_ID, ТекущиеДанные.УточнениеИсполнителя);
		МассивСтрокРР = Объект.РемонтныеРаботы.НайтиСтроки(МассивСтрокРРОтбор);
		
		Для каждого Строка из МассивСтрокРР Цикл
			Строка.ДоговорБригада = Неопределено;
		КонецЦикла;
		
		Для каждого Строка из МассивСтрокДереваРР Цикл
			Строка.ДоговорБригада = Неопределено;
		КонецЦикла;
		
		Модифицированность = Истина;
		ТекущиеДанные.УточнениеИсполнителя = ИсполнительНовый;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиПоРемонтамУточнениеИсполнителяОчистка(Элемент, СтандартнаяОбработка)
	
	ИсполнителиПоРемонтамУточнениеИсполнителяОбработкаВыбора(Элемент, Неопределено, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиПоРемонтамУточнениеИсполнителяОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Текст) Тогда
		// Если сделать так, то вызывается событие ОбработкаВыбора, в противном случае - не вызывается. 
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(Неопределено);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТрудовыеЗатраты
&НаКлиенте
Процедура ТрудовыеЗатратыСотрудникПриИзменении(Элемент)
	ТекДанныеРабот = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	МассивID = Новый Массив;
	ЗаполнитьМассивID(МассивID,ТекДанныеРабот);
	ОтметитьНаличиеАналогов(МассивID);
КонецПроцедуры

&НаКлиенте
Процедура ТрудовыеЗатратыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если Не ОтменаРедактирования Тогда
		
		Если НоваяСтрока Тогда
			ТекСтрокаДереваРемонтныхРабот = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
			Элемент.ТекущиеДанные.ID = ТекСтрокаДереваРемонтныхРабот.ID;
			Элемент.ТекущиеДанные.РемонтыОборудования_ID = ТекСтрокаДереваРемонтныхРабот.РемонтыОборудования_ID;
		КонецЕсли;
		
		ТЧ = Объект.РемонтыОборудования;
		ДатаНачалаРемонта = торо_ЗаполнениеДокументов.ПолучитьДатуРемонтаПоID(ТЧ, Элементы.ДеревоРемонтныхРабот.ТекущиеДанные.РемонтыОборудования_ID);
		торо_ЗаполнениеДокументов.ВыполнитьАвтоподставлениеСотрудникаИКвалификации(Элемент.ТекущиеДанные.Сотрудник, Элемент.ТекущиеДанные.Квалификация, ДатаНачалаРемонта);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудовыеЗатратыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	ТекСтрокаДереваРемонтныхРабот = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	ТекстПредупреждения = НСтр("es='¡Se puede indicar a los ejecutores de los trabajos de reparación solamente para las operaciones tecnológicas!';ru='Исполнителей ремонтных работ можно указывать только для технологических операций!';en='Executors of repair work can be specified only for technological operations!'");
	ПроверкаТипаВСтрокеДереваРемонтныхРабот(ТекСтрокаДереваРемонтныхРабот, Тип("СправочникСсылка.торо_ТехнологическиеОперации"), ТекстПредупреждения, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ТрудовыеЗатратыВремяРаботыТекстНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ТрудовыеЗатраты.ТекущиеДанные;
	
	Если Не ТекущиеДанные = Неопределено Тогда
		
		торо_ЗаполнениеДокументовКлиент.ОткрытьФормуПодбораПродолжительности(ТекущиеДанные.ВремяРаботы,Элемент,Объект.Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудовыеЗатратыВремяРаботыТекстОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ТрудовыеЗатраты.ТекущиеДанные;
	
	Если Не ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные.ВремяРаботыТекст = СформироватьПродолжительность(ВыбранноеЗначение);
		ТекущиеДанные.ВремяРаботы      = ВыбранноеЗначение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудовыеЗатратыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ЗаполнитьИсполнителейПоБригадам(ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура ТрудовыеЗатратыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И НЕ Копирование Тогда
		ТекущиеДанные = Элемент.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			ТекущиеДанные.КТУ = 1;
			
			Если Не ЗначениеЗаполнено(ТекущиеДанные.ДатаНачала) И Не ЗначениеЗаполнено(ТекущиеДанные.ДатаОкончания) Тогда
				СтрокаРемонта = Элементы.РемонтыОборудования.ТекущиеДанные;
				ТекущиеДанные.ДатаНачала = СтрокаРемонта.ДатаНачала;
				ТекущиеДанные.ДатаОкончания = СтрокаРемонта.ДатаОкончания;
				ТекущиеДанные.ВремяРаботы = СтрокаРемонта.ДатаОкончания - СтрокаРемонта.ДатаНачала;
				ТекущиеДанные.ВремяРаботыТекст = СформироватьПродолжительность(ТекущиеДанные.ВремяРаботы);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудовыеЗатратыДатаНачалаПриИзменении(Элемент)
	ТекДанные = Элементы.ТрудовыеЗатраты.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		РассчитатьВремя(ТекДанные.ПолучитьИдентификатор());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТрудовыеЗатратыДатаОкончанияПриИзменении(Элемент)
	ТекДанные = Элементы.ТрудовыеЗатраты.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		РассчитатьВремя(ТекДанные.ПолучитьИдентификатор());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТрудовыеЗатратыСотрудникОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ТЧ = Объект.РемонтыОборудования;
	ДатаНачалаРемонта = торо_ЗаполнениеДокументов.ПолучитьДатуРемонтаПоID(ТЧ, Элементы.ДеревоРемонтныхРабот.ТекущиеДанные.РемонтыОборудования_ID);
	торо_ЗаполнениеДокументовКлиент.СформироватьСписокАвтоподбораСотрудниковСКвалификацией(Элементы.ТрудовыеЗатраты.ТекущиеДанные.Квалификация, ДатаНачалаРемонта, Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТрудовыеЗатратыКвалификацияОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ТЧ = Объект.РемонтыОборудования;
	ДатаНачалаРемонта = торо_ЗаполнениеДокументов.ПолучитьДатуРемонтаПоID(ТЧ, Элементы.ДеревоРемонтныхРабот.ТекущиеДанные.РемонтыОборудования_ID);
	торо_ЗаполнениеДокументовКлиент.СформироватьСписокАвтоподбораКвалификацийСотрудника(Элементы.ТрудовыеЗатраты.ТекущиеДанные.Сотрудник, ДатаНачалаРемонта, Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТрудовыеЗатратыКвалификацияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ТЧ = Объект.РемонтыОборудования;
	ДатаНачалаРемонта = торо_ЗаполнениеДокументов.ПолучитьДатуРемонтаПоID(ТЧ, Элементы.ДеревоРемонтныхРабот.ТекущиеДанные.РемонтыОборудования_ID);
	торо_ЗаполнениеДокументовКлиент.СформироватьСписокАвтоподбораКвалификацийСотрудника(Элементы.ТрудовыеЗатраты.ТекущиеДанные.Сотрудник, ДатаНачалаРемонта, Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТрудовыеЗатратыКвалификацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТЧ = Объект.РемонтыОборудования;
	ДатаНачалаРемонта = торо_ЗаполнениеДокументов.ПолучитьДатуРемонтаПоID(ТЧ, Элементы.ДеревоРемонтныхРабот.ТекущиеДанные.РемонтыОборудования_ID);
	торо_ЗаполнениеДокументовКлиент.СформироватьСписокВыбораКвалификацийСотрудника(Элемент, ЭтотОбъект, Элементы.ТрудовыеЗатраты.ТекущиеДанные.Сотрудник, ДатаНачалаРемонта, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТрудовыеЗатратыСотрудникАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ТЧ = Объект.РемонтыОборудования;
	ДатаНачалаРемонта = торо_ЗаполнениеДокументов.ПолучитьДатуРемонтаПоID(ТЧ, Элементы.ДеревоРемонтныхРабот.ТекущиеДанные.РемонтыОборудования_ID);
	торо_ЗаполнениеДокументовКлиент.СформироватьСписокАвтоподбораСотрудниковСКвалификацией(Элементы.ТрудовыеЗатраты.ТекущиеДанные.Квалификация, ДатаНачалаРемонта, Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТрудовыеЗатратыСотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТЧ = Объект.РемонтыОборудования;
	ДатаНачалаРемонта = торо_ЗаполнениеДокументов.ПолучитьДатуРемонтаПоID(ТЧ, Элементы.ДеревоРемонтныхРабот.ТекущиеДанные.РемонтыОборудования_ID);
	торо_ЗаполнениеДокументовКлиент.СформироватьСписокВыбораСотрудниковСКвалификацией(Элемент, ЭтотОбъект, Элементы.ТрудовыеЗатраты.ТекущиеДанные.Квалификация, ДатаНачалаРемонта, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСерийныеЗапчасти

&НаКлиенте
Процедура СерийныеЗапчастиЕдиницаИзмеренияНоваяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗаполнитьДанныеВыбораУпаковки(Элементы.СерийныеЗапчасти.ТекущиеДанные.НоменклатураНовая, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СерийныеЗапчастиЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗаполнитьДанныеВыбораУпаковки(Элементы.СерийныеЗапчасти.ТекущиеДанные.Номенклатура, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СерийныеЗапчастиНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.СерийныеЗапчасти.ТекущиеДанные;
	
	ТекущаяСтрока.ХарактеристикиИспользуются = торо_НоменклатураСервер.ПолучитьХарактеристикиИспользуются(ТекущаяСтрока.Номенклатура);
	
	Если Не ТекущаяСтрока.ХарактеристикиИспользуются Тогда
		ТекущаяСтрока.ХарактеристикаНоменклатуры = Неопределено;
	КонецЕсли;
	
	ТекущаяСтрока.СерииИспользуются = ПолучитьСерииИспользуются(ТекущаяСтрока.Номенклатура);
	ТекущаяСтрока.СерияНоменклатуры = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура СерийныеЗапчастиНоменклатураНоваяПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.СерийныеЗапчасти.ТекущиеДанные;
	
	ТекущаяСтрока.ХарактеристикиИспользуютсяДляНовой = торо_НоменклатураСервер.ПолучитьХарактеристикиИспользуются(ТекущаяСтрока.НоменклатураНовая);
	
	Если Не ТекущаяСтрока.ХарактеристикиИспользуютсяДляНовой Тогда
		ТекущаяСтрока.ХарактеристикаНоменклатурыНовая = Неопределено;
	КонецЕсли;
	
	ТекущаяСтрока.СерииИспользуютсяДляНовой = ПолучитьСерииИспользуются(ТекущаяСтрока.НоменклатураНовая);
	ТекущаяСтрока.СерияНоменклатурыНовая = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура СерийныеЗапчастиСерияНоменклатурыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = Элементы.СерийныеЗапчасти.ТекущиеДанные;
	
	Если Не ТекДанные = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		Форма = ПолучитьФорму("Справочник.СерииНоменклатуры.ФормаВыбора",,Элемент);
		
		ПользовательскийОтбор = Форма.Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Форма.Список.КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки);
		ПользовательскийОтбор.Элементы.Очистить();
		
		ЭлементОтбора = ПользовательскийОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение     = Новый ПолеКомпоновкиДанных("ВидНоменклатуры");
		ЭлементОтбора.ВидСравнения      = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование 	= Истина;
		ЭлементОтбора.ПравоеЗначение 	= ВидНоменклатуры(ТекДанные.Номенклатура); 
		
		Форма.Открыть();
		
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура СерийныеЗапчастиСерияНоменклатурыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СерийныеЗапчасти.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущиеДанные.Номенклатура, "ВидНоменклатуры");
		ВидНоменклатурыВыбранный = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "ВидНоменклатуры");
		Если ВидНоменклатуры <> ВидНоменклатурыВыбранный Тогда
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СерийныеЗапчастиСерияНоменклатурыАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если Ожидание > 0 Тогда
		ТекущиеДанные = Элементы.СерийныеЗапчасти.ТекущиеДанные;
		ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущиеДанные.Номенклатура, "ВидНоменклатуры");
		ПараметрыПолученияДанных.Отбор.Вставить("ВидНоменклатуры",ВидНоменклатуры);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СерийныеЗапчастиСерияНоменклатурыОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СерийныеЗапчасти.ТекущиеДанные;
	ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущиеДанные.Номенклатура, "ВидНоменклатуры");
	ПараметрыПолученияДанных.Отбор.Вставить("ВидНоменклатуры",ВидНоменклатуры);
	
КонецПроцедуры

&НаКлиенте
Процедура СерийныеЗапчастиСерияНоменклатурыНоваяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = Элементы.СерийныеЗапчасти.ТекущиеДанные;
	
	Если Не ТекДанные = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		Форма = ПолучитьФорму("Справочник.СерииНоменклатуры.ФормаВыбора",,Элемент);
		
		ПользовательскийОтбор = Форма.Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Форма.Список.КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки);
		ПользовательскийОтбор.Элементы.Очистить();
		
		ЭлементОтбора = ПользовательскийОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение     = Новый ПолеКомпоновкиДанных("ВидНоменклатуры");
		ЭлементОтбора.ВидСравнения      = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование 	= Истина;
		ЭлементОтбора.ПравоеЗначение 	= ВидНоменклатуры(ТекДанные.НоменклатураНовая); 
		
		Форма.Открыть();
		
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура СерийныеЗапчастиСерияНоменклатурыНоваяОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СерийныеЗапчасти.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущиеДанные.НоменклатураНовая, "ВидНоменклатуры");
		ВидНоменклатурыВыбранный = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "ВидНоменклатуры");
		Если ВидНоменклатуры <> ВидНоменклатурыВыбранный Тогда
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СерийныеЗапчастиСерияНоменклатурыНоваяАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если Ожидание > 0 Тогда
		ТекущиеДанные = Элементы.СерийныеЗапчасти.ТекущиеДанные;
		ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущиеДанные.НоменклатураНовая, "ВидНоменклатуры");
		ПараметрыПолученияДанных.Отбор.Вставить("ВидНоменклатуры",ВидНоменклатуры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СерийныеЗапчастиСерияНоменклатурыНоваяОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СерийныеЗапчасти.ТекущиеДанные;
	ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущиеДанные.НоменклатураНовая, "ВидНоменклатуры");
	ПараметрыПолученияДанных.Отбор.Вставить("ВидНоменклатуры",ВидНоменклатуры);
	
КонецПроцедуры

&НаКлиенте
Процедура СерийныеЗапчастиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекДанныеРемонт = Элементы.РемонтыОборудования.ТекущиеДанные;
	ТекДанныеЗапчасти = Элементы.СерийныеЗапчасти.ТекущиеДанные;
	
	Если ТекДанныеРемонт <> Неопределено И НоваяСтрока И НЕ Копирование Тогда
		ТекДанныеЗапчасти.Количество = 1;
		ТекДанныеЗапчасти.КоличествоНовое = 1;
		ТекДанныеЗапчасти.СтатусДвиженияСерийныхЗЧ = ПредопределенноеЗначение("Перечисление.торо_ВидыДвиженияСерийныхЗЧ.ВозвратЗамена");
		ТекДанныеЗапчасти.СтатусДвиженияНовойЗЧ = ПредопределенноеЗначение("Перечисление.торо_ВидыДвиженияСерийныхЗЧ.Установка");
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СерийныеЗапчастиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Элементы.РемонтыОборудования.ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(Неопределено,  НСтр("es='¡Es necesario escoger la reparación, para que se llena la lista de las partes de recambio!';ru='Необходимо выбрать ремонт, для которого заполняется список запчастей!';en='Required to choose a repair for which the list of spare parts is filled in!'"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СерийныеЗапчастиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекДанныеРемонт = Элементы.РемонтыОборудования.ТекущиеДанные;
	ТекДанныеЗапчасти = Элементы.СерийныеЗапчасти.ТекущиеДанные;
	
	Если Не ОтменаРедактирования И НоваяСтрока И ТекДанныеРемонт <> Неопределено Тогда
		
		Элемент.ТекущиеДанные.РемонтыОборудования_ID = ТекДанныеРемонт.ID;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекДанныеЗапчасти.СтатусДвиженияНовойЗЧ) И ЗначениеЗаполнено(ТекДанныеЗапчасти.СтатусДвиженияСерийныхЗЧ)
		И ТекДанныеЗапчасти.СтатусДвиженияНовойЗЧ = ТекДанныеЗапчасти.СтатусДвиженияСерийныхЗЧ Тогда
		
		ТекстСообщения = НСтр("es='¡Los estatus del movimiento viejo y nuevo las partes de recambio deben diferenciarse!';ru='Статусы движения старой и новой запчасти должны различаться!';en='The movement statuses of the old and new parts must be different!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		
		ОтменаРедактирования = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СерийныеЗапчастиХарактеристикаНоменклатурыАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.СерийныеЗапчасти.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущиеДанные.Номенклатура, "ВидНоменклатуры");
		ИспользованиеХарактеристик = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидНоменклатуры, "ИспользованиеХарактеристик");
		ПараметрыПолученияДанных.Отбор.Очистить();
		Если ИспользованиеХарактеристик = ПредопределенноеЗначение("Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры") Тогда
			ПараметрыПолученияДанных.Отбор.Вставить("Владелец", ВидНоменклатуры);
		Иначе
			ПараметрыПолученияДанных.Отбор.Вставить("Владелец", ТекущиеДанные.Номенклатура);
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СерийныеЗапчастиХарактеристикаНоменклатурыНоваяАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.СерийныеЗапчасти.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущиеДанные.НоменклатураНовая, "ВидНоменклатуры");
		ИспользованиеХарактеристик = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидНоменклатуры, "ИспользованиеХарактеристик");
		ПараметрыПолученияДанных.Отбор.Очистить();
		Если ИспользованиеХарактеристик = ПредопределенноеЗначение("Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры") Тогда
			ПараметрыПолученияДанных.Отбор.Вставить("Владелец", ВидНоменклатуры);
		Иначе
			ПараметрыПолученияДанных.Отбор.Вставить("Владелец", ТекущиеДанные.НоменклатураНовая);
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СерийныеЗапчастиХарактеристикаНоменклатурыОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.СерийныеЗапчасти.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущиеДанные.Номенклатура, "ВидНоменклатуры");
		ИспользованиеХарактеристик = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидНоменклатуры, "ИспользованиеХарактеристик");
		ПараметрыПолученияДанных.Отбор.Очистить();
		Если ИспользованиеХарактеристик = ПредопределенноеЗначение("Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры") Тогда
			ПараметрыПолученияДанных.Отбор.Вставить("Владелец", ВидНоменклатуры);
		Иначе
			ПараметрыПолученияДанных.Отбор.Вставить("Владелец", ТекущиеДанные.Номенклатура);
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СерийныеЗапчастиХарактеристикаНоменклатурыНоваяОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.СерийныеЗапчасти.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущиеДанные.НоменклатураНовая, "ВидНоменклатуры");
		ИспользованиеХарактеристик = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидНоменклатуры, "ИспользованиеХарактеристик");
		ПараметрыПолученияДанных.Отбор.Очистить();
		Если ИспользованиеХарактеристик = ПредопределенноеЗначение("Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры") Тогда
			ПараметрыПолученияДанных.Отбор.Вставить("Владелец", ВидНоменклатуры);
		Иначе
			ПараметрыПолученияДанных.Отбор.Вставить("Владелец", ТекущиеДанные.НоменклатураНовая);
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СерийныеЗапчастиХарактеристикаНоменклатурыСоздание(Элемент, СтандартнаяОбработка)
	Если Элементы.СерийныеЗапчасти.ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(Элементы.СерийныеЗапчасти.ТекущиеДанные.Номенклатура) Тогда
		Вид = торо_ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(Элементы.СерийныеЗапчасти.ТекущиеДанные.Номенклатура, "ВидНоменклатуры");
		СтруктураПараметров = Новый Структура("ВидНоменклатуры, Владелец", Вид, Элементы.СерийныеЗапчасти.ТекущиеДанные.Номенклатура);
		ОткрытьФорму("Справочник.ХарактеристикиНоменклатуры.Форма.ФормаЭлемента", СтруктураПараметров);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СерийныеЗапчастиСерияНоменклатурыСоздание(Элемент, СтандартнаяОбработка)
	Если Элементы.СерийныеЗапчасти.ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(Элементы.СерийныеЗапчасти.ТекущиеДанные.Номенклатура) Тогда
		СтруктураПараметров = Новый Структура("ВидНоменклатуры", торо_ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(Элементы.СерийныеЗапчасти.ТекущиеДанные.Номенклатура, "ВидНоменклатуры"));
		ОткрытьФорму("Справочник.СерииНоменклатуры.Форма.ФормаЭлемента", СтруктураПараметров);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СерийныеЗапчастиСерияНоменклатурыНоваяСоздание(Элемент, СтандартнаяОбработка)
	Если Элементы.СерийныеЗапчасти.ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(Элементы.СерийныеЗапчасти.ТекущиеДанные.НоменклатураНовая) Тогда
		СтруктураПараметров = Новый Структура("ВидНоменклатуры", торо_ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(Элементы.СерийныеЗапчасти.ТекущиеДанные.НоменклатураНовая, "ВидНоменклатуры"));
		ОткрытьФорму("Справочник.СерииНоменклатуры.Форма.ФормаЭлемента", СтруктураПараметров);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СерийныеЗапчастиХарактеристикаНоменклатурыНоваяСоздание(Элемент, СтандартнаяОбработка)
	Если Элементы.СерийныеЗапчасти.ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(Элементы.СерийныеЗапчасти.ТекущиеДанные.НоменклатураНовая) Тогда
		Вид = торо_ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(Элементы.СерийныеЗапчасти.ТекущиеДанные.НоменклатураНовая, "ВидНоменклатуры");
		СтруктураПараметров = Новый Структура("ВидНоменклатуры, Владелец", Вид, Элементы.СерийныеЗапчасти.ТекущиеДанные.НоменклатураНовая);
		ОткрытьФорму("Справочник.ХарактеристикиНоменклатуры.Форма.ФормаЭлемента", СтруктураПараметров);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗакрываемыеПредписания
&НаКлиенте
Процедура ЗакрываемыеПредписанияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	ТекДанныеРемОборуд = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если ТекДанныеРемОборуд = Неопределено Тогда
		
		ТекстСообщения = НСтр("es='de la maquinaria';ru='Не выбран ремонт оборудования';en='No hardware repair selected'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
		
	КонецЕсли;
	
	ФормаПодбора = ПолучитьФорму("Обработка.торо_ПодборРемонтныхРаботОборудования.Форма.ФормаПодбораПредписанийОпераций",
	Новый Структура("ОбъектРемонтаДляОтбора", ТекДанныеРемОборуд.ОбъектРемонта), Элементы.ЗакрываемыеПредписания, Объект.Ссылка, ВариантОткрытияОкна.ОтдельноеОкно);
	
	ФормаПодбора.Объект.ДокументыОснования.Очистить();
	
	Для Каждого СтрокаДО Из Объект.ДокументыОснования Цикл
		Если ТипЗнч(СтрокаДО.ДокументОснование) = Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот") Тогда
			ФормаПодбора.Объект.ДокументыОснования.Добавить().ДокументОснование = СтрокаДО.ДокументОснование;
		КонецЕсли;
	КонецЦикла;
	
	ФормаПодбора.ЗакрыватьПриВыборе = Ложь;
	
	ФормаПодбора.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрываемыеПредписанияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		
		ТекСтрокаРемонта = Элементы.РемонтыОборудования.ТекущиеДанные;
		
		Если ТекСтрокаРемонта = Неопределено Тогда
			ТекстСообщения = НСтр("es='de las prescripciones!';ru='Не выбран ремонт для прикрепления предписаний!';en='No repair selected for attaching instructions!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		СтрокиПредписания = Объект.ЗакрываемыеПредписания.НайтиСтроки(Новый Структура("ID", ВыбранноеЗначение.СтрокаРемонтовОборудования.ID));
		
		СтрокиПредписанияОснование = Объект.ДокументыОснования.НайтиСтроки(Новый Структура("ДокументОснование", ВыбранноеЗначение.ДокументОснование));
		
		Если СтрокиПредписания.Количество() = 0 ИЛИ СтрокиПредписания[0].РемонтыОборудования_ID = ТекСтрокаРемонта.ID Тогда
			Если СтрокиПредписания.Количество() = 0 Тогда
				СтрокаПредписания = Объект.ЗакрываемыеПредписания.Добавить();
				
				СтрокаПредписания.ID 						= ВыбранноеЗначение.СтрокаРемонтовОборудования.ID;
				СтрокаПредписания.ОбъектРемонта 			= ВыбранноеЗначение.СтрокаРемонтовОборудования.ОбъектРемонта;
				СтрокаПредписания.ПлановаяДатаРемонта 		= ВыбранноеЗначение.СтрокаРемонтовОборудования.ПлановаяДата;
				СтрокаПредписания.Описание					= ВыбранноеЗначение.СтрокаРемонтовОборудования.ОписаниеРемонта;
				СтрокаПредписания.РемонтыОборудования_ID 	= ТекСтрокаРемонта.ID;
				СтрокаПредписания.ДокументВнешнегоОснования = ВыбранноеЗначение.ДокументОснование;
			КонецЕсли;
			
			УвеличиватьКоличествоОпераций = Ложь;
			СтрДерева = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
			Если СтрДерева <> Неопределено Тогда
				ТекСтрокаДерева = Новый Структура("РемонтнаяРабота, ID, Родитель_ID", СтрДерева.РемонтнаяРабота, СтрДерева.ID, СтрДерева.Родитель_ID);
				
				Если ВыбранноеЗначение.Свойство("СтрокаРемонтныхРабот") Тогда
					ОбработкаВыборкаСтрокиРемРаботИзПредписаний(Неопределено, Неопределено, ВыбранноеЗначение,ВыбранноеЗначение.СтрокаРемонтныхРабот,ТекСтрокаРемонта, ТекСтрокаДерева, УвеличиватьКоличествоОпераций);
				ИначеЕсли ВыбранноеЗначение.Свойство("МассивСтрокРемонтныхРабот") Тогда
					
					ОбработкаВыборкаСтрокиРемРаботИзПредписанийНаСервере(ВыбранноеЗначение, ТекСтрокаРемонта.ID, ТекСтрокаДерева, УвеличиватьКоличествоОпераций);
					
				КонецЕсли;
				Модифицированность = Истина;
			КонецЕсли; 
		Иначе
			ТекстСообщения = НСтр("es='¡La razón escogida exterior hay ya en los documentos-razones!';ru='Выбранное внешнее основание уже имеется в документах-основаниях!';en='The selected external base is already in the base documents!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		СтрокиДокОснования = Объект.ДокументыОснования.НайтиСтроки(Новый Структура("ДокументОснование", ВыбранноеЗначение.ДокументОснование));
		
		Если СтрокиДокОснования.Количество() = 0 Тогда
			НоваяСтрока = Объект.ДокументыОснования.Добавить();
			НоваяСтрока.ДокументОснование = ВыбранноеЗначение.ДокументОснование;
		КонецЕсли;
		
		Для каждого Строка Из Объект.ТрудовыеЗатраты Цикл
			Строка.ВремяРаботыТекст = СформироватьПродолжительность(Строка.ВремяРаботы);
		КонецЦикла;
		Элементы.ДеревоРемонтныхРабот.Развернуть(ДеревоРемонтныхРабот.ПолучитьЭлементы()[0].ПолучитьИдентификатор(),Истина);
		
		
		
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументыВнутреннееПотребление
&НаКлиенте
Процедура ДокументыВнутреннееПотреблениеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		СтруктураПараметров = Новый Структура("Ключ", ТекущиеДанные.ВнутреннееПотребление);
		ОписаниеОповещения  = Новый ОписаниеОповещения("ОбновитьДокументыВнутреннегоПотребления",ЭтаФорма);
		ОткрытьФорму("Документ.ВнутреннееПотреблениеТоваров.ФормаОбъекта",СтруктураПараметров,ЭтаФорма,,,,ОписаниеОповещения);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыВнутреннееПотреблениеПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ТекущиеДанные = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		ЭлементТекДанные  = Элемент.ТекущиеДанные;
		Если Не ЭлементТекДанные = Неопределено Тогда
			ЭлементТекДанные.РемонтыОборудования_ID = ТекущиеДанные.ID;
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументыОприходованиеИзлишков
&НаКлиенте
Процедура ДокументыОприходованиеИзлишковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		СтруктураПараметров = Новый Структура("Ключ", ТекущиеДанные.ОприходованиеИзлишков);
		ОписаниеОповещения  = Новый ОписаниеОповещения("ОбновитьДокументыОприходованияИзлишков",ЭтаФорма);
		ОткрытьФорму("Документ.ОприходованиеИзлишковТоваров.ФормаОбъекта",СтруктураПараметров,ЭтаФорма,,,,ОписаниеОповещения);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОприходованиеИзлишковПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ТекущиеДанные = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		ЭлементТекДанные  = Элемент.ТекущиеДанные;
		Если Не ЭлементТекДанные = Неопределено Тогда
			ЭлементТекДанные.РемонтыОборудования_ID = ТекущиеДанные.ID;
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументыОснования

&НаКлиенте
Процедура ДокументыОснованияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	// Запись данных до редактирования
	торо_СобытияФормКлиент.ПриНачалеРедактирования(Элемент,СтруктураДанныхДоРедактирования,Элемент.ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекДанные = Элементы.ДокументыОснования.ТекущиеДанные;
	Если Не ОтменаРедактирования Тогда
		Если НЕ ЗначениеЗаполнено(ТекДанные.ДокументОснование) Тогда
			ТекстСообщения = НСтр("es='¡Es necesario rellenar el documento-razón!';ru='Необходимо заполнить документ-основание!';en='Required to fill out a base document!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		Иначе
			Если ПолучитьФОПовышеннаяОпасность()
				И ТипЗнч(ТекДанные.ДокументОснование) <> Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот") Тогда
				ЗаполнитьТабОперацийБезНаряда(ТекДанные.ДокументОснование);
			КонецЕсли;
			
			Если ТабОперацийБезНаряда.Количество() = 0 Тогда
		
				МасСтр = Объект.ДокументыОснования.НайтиСтроки(Новый Структура("ДокументОснование", ТекДанные.ДокументОснование));
				Если МасСтр.Количество() > 1 Тогда
					ТекстСообщения = НСтр("es='¡El documento-razón dado es añadido ya!';ru='Данный документ-основание уже добавлен!';en='This base document has already been added!'");
					ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				Иначе
					СтарыйДокОснование = СтруктураДанныхДоРедактирования[Элемент.Имя].ДокументОснование;
					Если ЗначениеЗаполнено(СтарыйДокОснование) И СтарыйДокОснование <> ТекДанные.ДокументОснование Тогда
						Вопрос = НСтр("es='Los trabajos de reparación vinculados serán limpiados. ¿Continuar?';ru='Связанные ремонтные работы будут очищены. Продолжить?';en='Related repairs will be cleared. Continue?'");
						СтруктураПараметров = Новый Структура("Элемент, СтарыйДокОснование, НовыйДокОснование",Элемент, СтарыйДокОснование, ТекДанные.ДокументОснование);
						ПоказатьВопрос(Новый ОписаниеОповещения("ДокументыОснованияПередИзменениемЗавершение",ЭтаФорма,СтруктураПараметров),Вопрос,РежимДиалогаВопрос.ДаНет);
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				
				Отказ = Истина;
				ОткрытьФорму("ОбщаяФорма.торо_ФормаОперацийБезНарядов", Новый Структура("ТабОперацийБезНаряда, ДокОснование", ТабОперацийБезНаряда, ТекДанные.ДокументОснование), ЭтаФорма,,ВариантОткрытияОкна.ОтдельноеОкно,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Не НоваяСтрока Тогда
		// возврат старых значений
		ЗаполнитьЗначенияСвойств(ТекДанные,СтруктураДанныхДоРедактирования[Элемент.Имя]);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияПередИзменениемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Элемент = ДополнительныеПараметры.Элемент;
	СтарыйДокОснование = ДополнительныеПараметры.СтарыйДокОснование;
	НовыйДокОснование = ДополнительныеПараметры.НовыйДокОснование;
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ОчиститьСвязанныеТабличныеЧасти(СтарыйДокОснование);
		Элемент.ТекущиеДанные.ДокументОснование = НовыйДокОснование;
	Иначе
		Элемент.ТекущиеДанные.ДокументОснование = СтарыйДокОснование;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияПередУдалением(Элемент, Отказ)
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		СтрокиВО = Объект.ЗакрываемыеПредписания.НайтиСтроки(Новый Структура("ДокументВнешнегоОснования", Элемент.ТекущиеДанные.ДокументОснование));
		Если СтрокиВО.Количество() <> 0 Тогда
			Для каждого СтрокаДокумента Из СтрокиВО Цикл
				Объект.ЗакрываемыеПредписания.Удалить(СтрокаДокумента);
			КонецЦикла; 
		Иначе	
			Вопрос = НСтр("es='Los trabajos de reparación vinculados serán limpiados. ¿Continuar?';ru='Связанные ремонтные работы будут очищены. Продолжить?';en='Related repairs will be cleared. Continue?'");
			Отказ = Истина;
			ПоказатьВопрос(Новый ОписаниеОповещения("ДокументыОснованияПередУдалениемЗавершение",ЭтаФорма,Новый Структура("Элемент",Элемент)),Вопрос,РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияПередУдалениемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Элемент = ДополнительныеПараметры.Элемент;
	
	Если РезультатВопроса = КодВозвратаДиалога.Да И Элемент.ТекущиеДанные <> Неопределено Тогда
		ОчиститьСвязанныеТабличныеЧасти(Элемент.ТекущиеДанные.ДокументОснование);
		текСтрока = Объект.ДокументыОснования.НайтиПоИдентификатору(Элемент.ТекущаяСтрока);
		Объект.ДокументыОснования.Удалить(текСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияДокументОснованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущийДокументОснование = Элементы.ДокументыОснования.текущиеДанные.ДокументОснование;
	
	Если ТекущийДокументОснование = Неопределено Тогда
		СписокВыбора = торо_ЗаполнениеДокументов.СформироватьСписокВыбораТипаДокументаОснования(Объект.Ссылка);
		ОписаниеОповещения = Новый ОписаниеОповещения("ДокументыОснованияДокументОснованиеНачалоВыбораЗавершение",ЭтотОбъект, Новый Структура("Элемент", Элемент));
		СписокВыбора.ПоказатьВыборЭлемента(ОписаниеОповещения, НСтр("es='La elección del tipo de datos';ru='Выбор типа данных';en='Data type selection'"));
	Иначе
		торо_ЗаполнениеДокументовКлиент.ОткрытьФормуВыбораДокументаОснованияРемонтаСПараметрами(ТипЗнч(ТекущийДокументОснование), ТекущийДокументОснование, Элемент, ЭтаФорма.КлючУникальности);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияДокументОснованиеНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элемент = ДополнительныеПараметры.Элемент;
	торо_ЗаполнениеДокументовКлиент.ОткрытьФормуВыбораДокументаОснованияРемонтаСПараметрами(ВыбранныйЭлемент.Значение, Неопределено, Элемент, ЭтаФорма.КлючУникальности);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ЗаполнитьЗапчастиПоЗаявке(Команда)
	
	ТекущийРемонтОборудования = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если ТекущийРемонтОборудования <> Неопределено Тогда
		IDРемонта = ТекущийРемонтОборудования.ID;
		СерийныеЗапчастиРемонта = Объект.СерийныеЗапчасти.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", IDРемонта));
		СерийныеЗапчасти = Объект.СерийныеЗапчасти;
		Если СерийныеЗапчастиРемонта.Количество() > 0 тогда
			ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьЗапчастиПоЗаявкеЗавершение", ЭтотОбъект, Новый Структура("СерийныеЗапчасти", СерийныеЗапчасти)), НСтр("es='¿Limpiar la parte tabular las Partes de recambio En serie del documento?';ru='Очистить табличную часть Серийные Запчасти документа?';en='Clear tabular portion of Serial Parts Document?'"),РежимДиалогаВопрос.ДаНет);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	ЗаполнитьЗапчастиПоЗаявкеФрагмент(СерийныеЗапчасти);
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьЗапчастиПоНормам_ТекущийРемонт(Команда)
	
	ТекущийРемонт = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если ТекущийРемонт = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("es='la reparación.';ru='Не выбран ремонт.';en='No repair selected.'"));
		Возврат;
	КонецЕсли;
	
	МассивСтрокДляУдаления = Объект.СерийныеЗапчасти.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", ТекущийРемонт.ID));
	
	Если МассивСтрокДляУдаления.Количество() > 0 Тогда
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("МассивСтрокДляУдаления", МассивСтрокДляУдаления);
		ДопПараметры.Вставить("ИДТекущегоРемонта", ТекущийРемонт.ПолучитьИдентификатор());
		
		ТекстВопроса = НСтр("es='""Las Partes de recambio,"" dadas en la tabla, serán regrabadas. ¿Continuar?';ru='Данные в таблице ""Запчасти"" будут перезаписаны. Продолжить?';en='The data in the table ""Parts""  will be overwritten. Continue?'");
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьЗапчастиПоНормам_ПослеВопроса", ЭтаФорма, ДопПараметры); 
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьЗапчастиПоНормамНаСервере(ТекущийРемонт.ПолучитьИдентификатор());
	КонецЕсли;
	
	ЗаполнитьИспользованиеХарактеристикЗапчастей();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗапчастиПоНормам_ВсеРемонты(Команда)
	
	Если Объект.СерийныеЗапчасти.Количество() > 0 Тогда
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("МассивСтрокДляУдаления", Объект.СерийныеЗапчасти);
		ДопПараметры.Вставить("ИДТекущегоРемонта", Неопределено);
		
		ТекстВопроса = НСтр("es='""Las Partes de recambio,"" dadas en la tabla, serán regrabadas. ¿Continuar?';ru='Данные в таблице ""Запчасти"" будут перезаписаны. Продолжить?';en='The data in the table ""Parts""  will be overwritten. Continue?'");
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьЗапчастиПоНормам_ПослеВопроса", ЭтаФорма, ДопПараметры); 
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьЗапчастиПоНормамНаСервере(Неопределено);
	КонецЕсли;
	
	ЗаполнитьИспользованиеХарактеристикЗапчастей();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗапчастиПоНормам_ПослеВопроса(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если ТипЗнч(ДополнительныеПараметры.МассивСтрокДляУдаления) = Тип("Массив") Тогда
			Для каждого СтрокаДляУдаления из ДополнительныеПараметры.МассивСтрокДляУдаления Цикл
				Объект.СерийныеЗапчасти.Удалить(СтрокаДляУдаления);
			КонецЦикла;
		Иначе
			Объект.СерийныеЗапчасти.Очистить();
		КонецЕсли;
		ЗаполнитьЗапчастиПоНормамНаСервере(ДополнительныеПараметры.ИДТекущегоРемонта);
	КонецЕсли;
	
	ЗаполнитьИспользованиеХарактеристикЗапчастей();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗапчастиПоНормамНаСервере(ИДТекущегоРемонта)
	
	торо_Ремонты.ЗаполнитьЗапчастиПоНормам(ЭтаФорма, ИДТекущегоРемонта);
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьЗапчастиПоОснованию_ТекущийРемонт(Команда)
	
	ТекущийРемонт = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если ТекущийРемонт = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("es='la reparación.';ru='Не выбран ремонт.';en='No repair selected.'"));
		Возврат;
	КонецЕсли;
	
	МассивСтрокДляУдаления = Объект.СерийныеЗапчасти.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", ТекущийРемонт.ID));
	
	Если МассивСтрокДляУдаления.Количество() > 0 Тогда
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("МассивСтрокДляУдаления", МассивСтрокДляУдаления);
		ДопПараметры.Вставить("ИДТекущегоРемонта", ТекущийРемонт.ПолучитьИдентификатор());
		
		ТекстВопроса = НСтр("es='""Las Partes de recambio,"" dadas en la tabla, serán regrabadas. ¿Continuar?';ru='Данные в таблице ""Запчасти"" будут перезаписаны. Продолжить?';en='The data in the table ""Parts""  will be overwritten. Continue?'");
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьЗапчастиПоОснованию_ПослеВопроса", ЭтаФорма, ДопПараметры); 
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьЗапчастиПоОснованиюНаСервере(ТекущийРемонт.ПолучитьИдентификатор());
	КонецЕсли;
	
	ЗаполнитьИспользованиеХарактеристикЗапчастей();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗапчастиПоОснованию_ВсеРемонты(Команда)
	
	Если Объект.СерийныеЗапчасти.Количество() > 0 Тогда
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("МассивСтрокДляУдаления", Объект.СерийныеЗапчасти);
		ДопПараметры.Вставить("ИДТекущегоРемонта", Неопределено);
		
		ТекстВопроса = НСтр("es='""Las Partes de recambio,"" dadas en la tabla, serán regrabadas. ¿Continuar?';ru='Данные в таблице ""Запчасти"" будут перезаписаны. Продолжить?';en='The data in the table ""Parts""  will be overwritten. Continue?'");
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьЗапчастиПоОснованию_ПослеВопроса", ЭтаФорма, ДопПараметры); 
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьЗапчастиПоОснованиюНаСервере(Неопределено);
	КонецЕсли;
	
	ЗаполнитьИспользованиеХарактеристикЗапчастей();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗапчастиПоОснованию_ПослеВопроса(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если ТипЗнч(ДополнительныеПараметры.МассивСтрокДляУдаления) = Тип("Массив") Тогда
			Для каждого СтрокаДляУдаления из ДополнительныеПараметры.МассивСтрокДляУдаления Цикл
				Объект.СерийныеЗапчасти.Удалить(СтрокаДляУдаления);
			КонецЦикла;
		Иначе
			Объект.СерийныеЗапчасти.Очистить();
		КонецЕсли;
		ЗаполнитьЗапчастиПоОснованиюНаСервере(ДополнительныеПараметры.ИДТекущегоРемонта);
	КонецЕсли;
	
	ЗаполнитьИспользованиеХарактеристикЗапчастей();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗапчастиПоОснованиюНаСервере(ИДТекущегоРемонта)
	
	торо_Ремонты.ЗаполнитьЗапчастиПоОснованию(ЭтаФорма, ИДТекущегоРемонта);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИсполнителейПоНормам_ТекущаяОперация(Команда)
	
	ТекущийРемонт = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если ТекущийРемонт = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("es='la reparación.';ru='Не выбран ремонт.';en='No repair selected.'"));
		Возврат;
	КонецЕсли;
	
	ТекущаяОперация = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	Если ТекущаяОперация = Неопределено 
		ИЛИ ТипЗнч(ТекущаяОперация.РемонтнаяРабота) = Тип("Строка") Тогда
		ПоказатьПредупреждение(, НСтр("es='el trabajo de reparación.';ru='Не выбрана ремонтная работа.';en='No repair work selected.'"));
		Возврат;
	КонецЕсли;
	
	МасивОперацийДляОтбора = Новый Массив;
	МасивОперацийДляОтбора.Добавить(ТекущаяОперация);
	торо_РаботаССогласованиямиКлиентСервер.ЗаполнитьМассивИзДерева(МасивОперацийДляОтбора, ТекущаяОперация.ПолучитьЭлементы());
	
	МасивIDДляОтбора = Новый Массив;
	Для каждого СтрокаОперации из МасивОперацийДляОтбора Цикл
		МасивIDДляОтбора.Добавить(СтрокаОперации.ID);
	КонецЦикла;
	
	МассивСтрокДляУдаления = Новый Массив;
	Для каждого Строка из Объект.ТрудовыеЗатраты Цикл
		Если Строка.РемонтыОборудования_ID = ТекущийРемонт.ID 
			И МасивIDДляОтбора.Найти(Строка.ID) <> Неопределено Тогда
			МассивСтрокДляУдаления.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивСтрокДляУдаления.Количество() > 0 Тогда
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("МассивСтрокДляУдаления", МассивСтрокДляУдаления);
		ДопПараметры.Вставить("ИДТекущейОперации", ТекущаяОперация.ПолучитьИдентификатор());
		ДопПараметры.Вставить("ИДТекущегоРемонта", ТекущийРемонт.ПолучитьИдентификатор());
		
		ТекстВопроса = НСтр("es='""Los Ejecutores,"" dados en la tabla, serán regrabados. ¿Continuar?';ru='Данные в таблице ""Исполнители"" будут перезаписаны. Продолжить?';en='The data in the table ""Performers"" will be overwritten. Continue?'");
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьИсполнителейПоНормам_ПослеВопроса", ЭтаФорма, ДопПараметры); 
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьИсполнителейПоНормамНаСервере(ТекущаяОперация.ПолучитьИдентификатор(), ТекущийРемонт.ПолучитьИдентификатор());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИсполнителейПоНормам_ВсеОперации(Команда)
	
	ТекущийРемонт = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если ТекущийРемонт = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("es='la reparación.';ru='Не выбран ремонт.';en='No repair selected.'"));
		Возврат;
	КонецЕсли;
	
	МассивСтрокДляУдаления = Объект.ТрудовыеЗатраты.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", ТекущийРемонт.ID));
	Если МассивСтрокДляУдаления.Количество() > 0 Тогда
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("МассивСтрокДляУдаления", МассивСтрокДляУдаления);
		ДопПараметры.Вставить("ИДТекущейОперации", Неопределено);
		ДопПараметры.Вставить("ИДТекущегоРемонта", ТекущийРемонт.ПолучитьИдентификатор());
		
		ТекстВопроса = НСтр("es='""Los Ejecutores,"" dados en la tabla, serán regrabados. ¿Continuar?';ru='Данные в таблице ""Исполнители"" будут перезаписаны. Продолжить?';en='The data in the table ""Performers"" will be overwritten. Continue?'");
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьИсполнителейПоНормам_ПослеВопроса", ЭтаФорма, ДопПараметры); 
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьИсполнителейПоНормамНаСервере(Неопределено, ТекущийРемонт.ПолучитьИдентификатор());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИсполнителейПоНормам_ВсеРемонты(Команда)
	
	Если Объект.ТрудовыеЗатраты.Количество() > 0 Тогда
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("МассивСтрокДляУдаления", Объект.ТрудовыеЗатраты);
		ДопПараметры.Вставить("ИДТекущейОперации", Неопределено);
		ДопПараметры.Вставить("ИДТекущегоРемонта", Неопределено);
		
		ТекстВопроса = НСтр("es='""Los Ejecutores,"" dados en la tabla, serán regrabados. ¿Continuar?';ru='Данные в таблице ""Исполнители"" будут перезаписаны. Продолжить?';en='The data in the table ""Performers"" will be overwritten. Continue?'");
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьИсполнителейПоНормам_ПослеВопроса", ЭтаФорма, ДопПараметры); 
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьИсполнителейПоНормамНаСервере(Неопределено, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИсполнителейПоНормам_ПослеВопроса(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если ТипЗнч(ДополнительныеПараметры.МассивСтрокДляУдаления) = Тип("Массив") Тогда
			Для каждого СтрокаДляУдаления из ДополнительныеПараметры.МассивСтрокДляУдаления Цикл
				Объект.ТрудовыеЗатраты.Удалить(СтрокаДляУдаления);
			КонецЦикла;
		Иначе
			Объект.ТрудовыеЗатраты.Очистить();
		КонецЕсли;
		ЗаполнитьИсполнителейПоНормамНаСервере(ДополнительныеПараметры.ИДТекущейОперации, ДополнительныеПараметры.ИДТекущегоРемонта);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИсполнителейПоНормамНаСервере(ИДТекущейОперации, ИДТекущегоРемонта)
	
	торо_Ремонты.ЗаполнитьИсполнителейПоНормам(ЭтаФорма, ИДТекущейОперации, ИДТекущегоРемонта, "ТрудовыеЗатраты");
	
	Для каждого Строка Из Объект.ТрудовыеЗатраты Цикл
		Строка.ВремяРаботыТекст = СформироватьПродолжительность(Строка.ВремяРаботы);
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьМатериалыПоНормам_ТекущаяОперация(Команда)
	
	ТекущийРемонт = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если ТекущийРемонт = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("es='la reparación.';ru='Не выбран ремонт.';en='No repair selected.'"));
		Возврат;
	КонецЕсли;
	
	ТекущаяОперация = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	Если ТекущаяОперация = Неопределено 
		ИЛИ ТипЗнч(ТекущаяОперация.РемонтнаяРабота) = Тип("Строка") Тогда
		ПоказатьПредупреждение(, НСтр("es='el trabajo de reparación.';ru='Не выбрана ремонтная работа.';en='No repair work selected.'"));
		Возврат;
	КонецЕсли;
	
	МасивОперацийДляОтбора = Новый Массив;
	МасивОперацийДляОтбора.Добавить(ТекущаяОперация);
	торо_РаботаССогласованиямиКлиентСервер.ЗаполнитьМассивИзДерева(МасивОперацийДляОтбора, ТекущаяОперация.ПолучитьЭлементы());
	
	МасивIDДляОтбора = Новый Массив;
	Для каждого СтрокаОперации из МасивОперацийДляОтбора Цикл
		МасивIDДляОтбора.Добавить(СтрокаОперации.ID);
	КонецЦикла;
	
	МассивСтрокДляУдаления = Новый Массив;
	Для каждого Строка из Объект.МатериальныеЗатраты Цикл
		Если Строка.РемонтыОборудования_ID = ТекущийРемонт.ID 
			И МасивIDДляОтбора.Найти(Строка.ID) <> Неопределено Тогда
			МассивСтрокДляУдаления.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивСтрокДляУдаления.Количество() > 0 Тогда
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("МассивСтрокДляУдаления", МассивСтрокДляУдаления);
		ДопПараметры.Вставить("ИДТекущейОперации", ТекущаяОперация.ПолучитьИдентификатор());
		ДопПараметры.Вставить("ИДТекущегоРемонта", ТекущийРемонт.ПолучитьИдентификатор());
		
		ТекстВопроса = НСтр("es='""Los Gastos,"" dados en la tabla, serán regrabados. ¿Continuar?';ru='Данные в таблице ""Материальные затраты"" будут перезаписаны. Продолжить?';en='The data in the table ""Material Costs"" will be overwritten. Continue?'");
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьМатериалыПоНормам_ПослеВопроса", ЭтаФорма, ДопПараметры); 
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьМатериалыПоНормамНаСервере(ТекущаяОперация.ПолучитьИдентификатор(), ТекущийРемонт.ПолучитьИдентификатор());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМатериалыПоНормам_ВсеОперации(Команда)
	
	ТекущийРемонт = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если ТекущийРемонт = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("es='la reparación.';ru='Не выбран ремонт.';en='No repair selected.'"));
		Возврат;
	КонецЕсли;
	
	МассивСтрокДляУдаления = Объект.МатериальныеЗатраты.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", ТекущийРемонт.ID));
	Если МассивСтрокДляУдаления.Количество() > 0 Тогда
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("МассивСтрокДляУдаления", МассивСтрокДляУдаления);
		ДопПараметры.Вставить("ИДТекущейОперации", Неопределено);
		ДопПараметры.Вставить("ИДТекущегоРемонта", ТекущийРемонт.ПолучитьИдентификатор());
		
		ТекстВопроса = НСтр("es='""Los Gastos,"" dados en la tabla, serán regrabados. ¿Continuar?';ru='Данные в таблице ""Материальные затраты"" будут перезаписаны. Продолжить?';en='The data in the table ""Material Costs"" will be overwritten. Continue?'");
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьМатериалыПоНормам_ПослеВопроса", ЭтаФорма, ДопПараметры); 
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьМатериалыПоНормамНаСервере(Неопределено, ТекущийРемонт.ПолучитьИдентификатор());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМатериалыПоНормам_ВсеРемонты(Команда)
	
	Если Объект.МатериальныеЗатраты.Количество() > 0 Тогда
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("МассивСтрокДляУдаления", Объект.ТрудовыеЗатраты);
		ДопПараметры.Вставить("ИДТекущейОперации", Неопределено);
		ДопПараметры.Вставить("ИДТекущегоРемонта", Неопределено);
		
		ТекстВопроса = НСтр("es='""Los Gastos,"" dados en la tabla, serán regrabados. ¿Continuar?';ru='Данные в таблице ""Материальные затраты"" будут перезаписаны. Продолжить?';en='The data in the table ""Material Costs"" will be overwritten. Continue?'");
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьМатериалыПоНормам_ПослеВопроса", ЭтаФорма, ДопПараметры); 
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьМатериалыПоНормамНаСервере(Неопределено, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМатериалыПоНормам_ПослеВопроса(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если ТипЗнч(ДополнительныеПараметры.МассивСтрокДляУдаления) = Тип("Массив") Тогда
			Для каждого СтрокаДляУдаления из ДополнительныеПараметры.МассивСтрокДляУдаления Цикл
				Объект.МатериальныеЗатраты.Удалить(СтрокаДляУдаления);
			КонецЦикла;
		Иначе
			Объект.МатериальныеЗатраты.Очистить();
		КонецЕсли;
		ЗаполнитьМатериалыПоНормамНаСервере(ДополнительныеПараметры.ИДТекущейОперации, ДополнительныеПараметры.ИДТекущегоРемонта);
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМатериалыПоНормамНаСервере(ИДТекущейОперации, ИДТекущегоРемонта, ЗаполнитьАналоги = Истина)
	
	торо_Ремонты.ЗаполнитьМатериалыПоНормам(ЭтаФорма, ИДТекущейОперации, ИДТекущегоРемонта, "МатериальныеЗатраты");
	
	Если ЗаполнитьАналоги Тогда
		Если ИДТекущегоРемонта <> Неопределено Тогда
			Ремонт = Объект.РемонтыОборудования.НайтиПоИдентификатору(ИДТекущегоРемонта);
			МассивIDОпераций = ПолучитьIDОперацийПоIDРемонта(Объект, Ремонт.ID);
		Иначе
			МассивIDОпераций = ПолучитьIDОперацийПоIDРемонта(Объект);
		КонецЕсли;
		ОтметитьНаличиеАналогов(МассивIDОпераций);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьIDОперацийПоIDРемонта(Объект, IDРемонта = Неопределено)
	
	МассивID = Новый Массив;
	Если IDРемонта = Неопределено Тогда
		Для Каждого Строка Из Объект.РемонтныеРаботы Цикл
			МассивID.Добавить(Строка.ID);
		КонецЦикла;
	Иначе
		МассивСтрокПоОтбору = Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", IDРемонта));
		Для Каждого Строка Из МассивСтрокПоОтбору Цикл
			МассивID.Добавить(Строка.ID);
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивID;
	
КонецФункции


&НаКлиенте
Процедура ЗаполнитьИсполнителейПоОснованию_ТекущаяОперация(Команда)
	
	ТекущийРемонт = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если ТекущийРемонт = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("es='la reparación.';ru='Не выбран ремонт.';en='No repair selected.'"));
		Возврат;
	КонецЕсли;
	
	ТекущаяОперация = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	Если ТекущаяОперация = Неопределено 
		ИЛИ ТипЗнч(ТекущаяОперация.РемонтнаяРабота) = Тип("Строка") Тогда
		ПоказатьПредупреждение(, НСтр("es='el trabajo de reparación.';ru='Не выбрана ремонтная работа.';en='No repair work selected.'"));
		Возврат;
	КонецЕсли;
	
	МасивОперацийДляОтбора = Новый Массив;
	МасивОперацийДляОтбора.Добавить(ТекущаяОперация);
	торо_РаботаССогласованиямиКлиентСервер.ЗаполнитьМассивИзДерева(МасивОперацийДляОтбора, ТекущаяОперация.ПолучитьЭлементы());
	
	МасивIDДляОтбора = Новый Массив;
	Для каждого СтрокаОперации из МасивОперацийДляОтбора Цикл
		МасивIDДляОтбора.Добавить(СтрокаОперации.ID);
	КонецЦикла;
	
	МассивСтрокДляУдаленияИсполнители = Новый Массив;
	Для каждого Строка из Объект.ТрудовыеЗатраты Цикл
		Если Строка.РемонтыОборудования_ID = ТекущийРемонт.ID 
			И МасивIDДляОтбора.Найти(Строка.ID) <> Неопределено Тогда
			МассивСтрокДляУдаленияИсполнители.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивСтрокДляУдаленияИсполнители.Количество() > 0 Тогда
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("МассивСтрокДляУдаленияПодрядчики", Новый Массив);
		ДопПараметры.Вставить("МассивСтрокДляУдаленияИсполнители", МассивСтрокДляУдаленияИсполнители);
		ДопПараметры.Вставить("ИДТекущейОперации", ТекущаяОперация.ПолучитьИдентификатор());
		ДопПараметры.Вставить("ИДТекущегоРемонта", ТекущийРемонт.ПолучитьИдентификатор());
		
		ТекстВопроса = НСтр("es='""Los Ejecutores,"" dados en la tabla, serán regrabados. ¿Continuar?';ru='Данные в таблице ""Исполнители"" будут перезаписаны. Продолжить?';en='The data in the table ""Performers"" will be overwritten. Continue?'");
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьИсполнителейПоОснованию_ПослеВопроса", ЭтаФорма, ДопПараметры); 
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьИсполнителейПоОснованиюНаСервере(ТекущаяОперация.ПолучитьИдентификатор(), ТекущийРемонт.ПолучитьИдентификатор());
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИсполнителейПоОснованию_ВсеОперации(Команда)
	
	ТекущийРемонт = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если ТекущийРемонт = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("es='la reparación.';ru='Не выбран ремонт.';en='No repair selected.'"));
		Возврат;
	КонецЕсли;
	
	МассивСтрокДляУдаленияПодрядчики = Объект.ИсполнителиПоРемонтам.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", ТекущийРемонт.ID));
	МассивСтрокДляУдаленияИсполнители = Объект.ТрудовыеЗатраты.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", ТекущийРемонт.ID));
	
	Если МассивСтрокДляУдаленияПодрядчики.Количество() > 0 
		ИЛИ МассивСтрокДляУдаленияИсполнители.Количество() > 0 Тогда
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("МассивСтрокДляУдаленияПодрядчики", МассивСтрокДляУдаленияПодрядчики);
		ДопПараметры.Вставить("МассивСтрокДляУдаленияИсполнители", МассивСтрокДляУдаленияИсполнители);
		ДопПараметры.Вставить("ИДТекущейОперации", Неопределено);
		ДопПараметры.Вставить("ИДТекущегоРемонта", ТекущийРемонт.ПолучитьИдентификатор());
		
		ТекстВопроса = НСтр("es='""Los Ejecutores,"" dados en la tabla, serán regrabados. ¿Continuar?';ru='Данные в таблице ""Исполнители"" будут перезаписаны. Продолжить?';en='The data in the table ""Performers"" will be overwritten. Continue?'");
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьИсполнителейПоОснованию_ПослеВопроса", ЭтаФорма, ДопПараметры); 
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьИсполнителейПоОснованиюНаСервере(Неопределено, ТекущийРемонт.ПолучитьИдентификатор());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИсполнителейПоОснованию_ВсеРемонты(Команда)
	
	Если Объект.ИсполнителиПоРемонтам.Количество() > 0 
		ИЛИ Объект.ТрудовыеЗатраты.Количество() > 0 Тогда
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("МассивСтрокДляУдаленияПодрядчики", Объект.ИсполнителиПоРемонтам);
		ДопПараметры.Вставить("МассивСтрокДляУдаленияИсполнители", Объект.ТрудовыеЗатраты);
		ДопПараметры.Вставить("ИДТекущейОперации", Неопределено);
		ДопПараметры.Вставить("ИДТекущегоРемонта", Неопределено);
		
		ТекстВопроса = НСтр("es='""Los Ejecutores,"" dados en la tabla, serán regrabados. ¿Continuar?';ru='Данные в таблице ""Исполнители"" будут перезаписаны. Продолжить?';en='The data in the table ""Performers"" will be overwritten. Continue?'");
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьИсполнителейПоОснованию_ПослеВопроса", ЭтаФорма, ДопПараметры); 
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьИсполнителейПоОснованиюНаСервере(Неопределено, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИсполнителейПоОснованию_ПослеВопроса(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если ТипЗнч(ДополнительныеПараметры.МассивСтрокДляУдаленияПодрядчики) = Тип("Массив") Тогда
			Для каждого СтрокаДляУдаления из ДополнительныеПараметры.МассивСтрокДляУдаленияПодрядчики Цикл
				Объект.ИсполнителиПоРемонтам.Удалить(СтрокаДляУдаления);
			КонецЦикла;
		Иначе
			Объект.ИсполнителиПоРемонтам.Очистить();
		КонецЕсли;
		
		Если ТипЗнч(ДополнительныеПараметры.МассивСтрокДляУдаленияИсполнители) = Тип("Массив") Тогда
			Для каждого СтрокаДляУдаления из ДополнительныеПараметры.МассивСтрокДляУдаленияИсполнители Цикл
				Объект.ТрудовыеЗатраты.Удалить(СтрокаДляУдаления);
			КонецЦикла;
		Иначе
			Объект.ТрудовыеЗатраты.Очистить();
		КонецЕсли;
		
		ЗаполнитьИсполнителейПоОснованиюНаСервере(ДополнительныеПараметры.ИДТекущейОперации, ДополнительныеПараметры.ИДТекущегоРемонта);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИсполнителейПоОснованиюНаСервере(ИДТекущейОперации, ИДТекущегоРемонта)
	
	торо_Ремонты.ЗаполнитьИсполнителейПоОснованию(ЭтаФорма, ИДТекущейОперации, ИДТекущегоРемонта);
	
	Для каждого Строка Из Объект.ТрудовыеЗатраты Цикл
		Если ЗначениеЗаполнено(Строка.ДатаНачала) И ЗначениеЗаполнено(Строка.ДатаОкончания) Тогда 
			Строка.ВремяРаботы = Строка.ДатаОкончания - Строка.ДатаНачала;
		КонецЕсли;

		Строка.ВремяРаботыТекст = СформироватьПродолжительность(Строка.ВремяРаботы);
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьМатериалыПоОснованию_ТекущаяОперация(Команда)
	
	ТекущийРемонт = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если ТекущийРемонт = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("es='la reparación.';ru='Не выбран ремонт.';en='No repair selected.'"));
		Возврат;
	КонецЕсли;
	
	ТекущаяОперация = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	Если ТекущаяОперация = Неопределено 
		ИЛИ ТипЗнч(ТекущаяОперация.РемонтнаяРабота) = Тип("Строка") Тогда
		ПоказатьПредупреждение(, НСтр("es='el trabajo de reparación.';ru='Не выбрана ремонтная работа.';en='No repair work selected.'"));
		Возврат;
	КонецЕсли;
	
	МасивОперацийДляОтбора = Новый Массив;
	МасивОперацийДляОтбора.Добавить(ТекущаяОперация);
	торо_РаботаССогласованиямиКлиентСервер.ЗаполнитьМассивИзДерева(МасивОперацийДляОтбора, ТекущаяОперация.ПолучитьЭлементы());
	
	МасивIDДляОтбора = Новый Массив;
	Для каждого СтрокаОперации из МасивОперацийДляОтбора Цикл
		МасивIDДляОтбора.Добавить(СтрокаОперации.ID);
	КонецЦикла;
	
	МассивСтрокДляУдаления = Новый Массив;
	Для каждого Строка из Объект.МатериальныеЗатраты Цикл
		Если Строка.РемонтыОборудования_ID = ТекущийРемонт.ID 
			И МасивIDДляОтбора.Найти(Строка.ID) <> Неопределено Тогда
			МассивСтрокДляУдаления.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивСтрокДляУдаления.Количество() > 0 Тогда
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("МассивСтрокДляУдаления", МассивСтрокДляУдаления);
		ДопПараметры.Вставить("ИДТекущейОперации", ТекущаяОперация.ПолучитьИдентификатор());
		ДопПараметры.Вставить("ИДТекущегоРемонта", ТекущийРемонт.ПолучитьИдентификатор());
		
		ТекстВопроса = НСтр("es='""Los Gastos,"" dados en la tabla, serán regrabados. ¿Continuar?';ru='Данные в таблице ""Материальные затраты"" будут перезаписаны. Продолжить?';en='The data in the table ""Material Costs"" will be overwritten. Continue?'");
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьМатериалыПоОснованию_ПослеВопроса", ЭтаФорма, ДопПараметры); 
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьМатериалыПоОснованиюНаСервере(ТекущаяОперация.ПолучитьИдентификатор(), ТекущийРемонт.ПолучитьИдентификатор());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМатериалыПоОснованию_ВсеОперации(Команда)
	
	ТекущийРемонт = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если ТекущийРемонт = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("es='la reparación.';ru='Не выбран ремонт.';en='No repair selected.'"));
		Возврат;
	КонецЕсли;
	
	МассивСтрокДляУдаления = Объект.МатериальныеЗатраты.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", ТекущийРемонт.ID));
	Если МассивСтрокДляУдаления.Количество() > 0 Тогда
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("МассивСтрокДляУдаления", МассивСтрокДляУдаления);
		ДопПараметры.Вставить("ИДТекущейОперации", Неопределено);
		ДопПараметры.Вставить("ИДТекущегоРемонта", ТекущийРемонт.ПолучитьИдентификатор());
		
		ТекстВопроса = НСтр("es='""Los Gastos,"" dados en la tabla, serán regrabados. ¿Continuar?';ru='Данные в таблице ""Материальные затраты"" будут перезаписаны. Продолжить?';en='The data in the table ""Material Costs"" will be overwritten. Continue?'");
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьМатериалыПоОснованию_ПослеВопроса", ЭтаФорма, ДопПараметры); 
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьМатериалыПоОснованиюНаСервере(Неопределено, ТекущийРемонт.ПолучитьИдентификатор());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМатериалыПоОснованию_ВсеРемонты(Команда)
	
	Если Объект.МатериальныеЗатраты.Количество() > 0 Тогда
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("МассивСтрокДляУдаления", Объект.ТрудовыеЗатраты);
		ДопПараметры.Вставить("ИДТекущейОперации", Неопределено);
		ДопПараметры.Вставить("ИДТекущегоРемонта", Неопределено);
		
		ТекстВопроса = НСтр("es='""Los Gastos,"" dados en la tabla, serán regrabados. ¿Continuar?';ru='Данные в таблице ""Материальные затраты"" будут перезаписаны. Продолжить?';en='The data in the table ""Material Costs"" will be overwritten. Continue?'");
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьМатериалыПоОснованию_ПослеВопроса", ЭтаФорма, ДопПараметры); 
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьМатериалыПоОснованиюНаСервере(Неопределено, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМатериалыПоОснованию_ПослеВопроса(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если ТипЗнч(ДополнительныеПараметры.МассивСтрокДляУдаления) = Тип("Массив") Тогда
			Для каждого СтрокаДляУдаления из ДополнительныеПараметры.МассивСтрокДляУдаления Цикл
				Объект.МатериальныеЗатраты.Удалить(СтрокаДляУдаления);
			КонецЦикла;
		Иначе
			Объект.МатериальныеЗатраты.Очистить();
		КонецЕсли;
		ЗаполнитьМатериалыПоОснованиюНаСервере(ДополнительныеПараметры.ИДТекущейОперации, ДополнительныеПараметры.ИДТекущегоРемонта);
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМатериалыПоОснованиюНаСервере(ИДТекущейОперации, ИДТекущегоРемонта, ЗаполнитьАналоги = Истина)
	
	торо_Ремонты.ЗаполнитьМатериалыПоОснованию(ЭтаФорма, ИДТекущейОперации, ИДТекущегоРемонта);
	
	Если ЗаполнитьАналоги Тогда
		Если ИДТекущегоРемонта <> Неопределено Тогда
			Ремонт = Объект.РемонтыОборудования.НайтиПоИдентификатору(ИДТекущегоРемонта);
			МассивIDОпераций = ПолучитьIDОперацийПоIDРемонта(Объект, Ремонт.ID);
		Иначе
			МассивIDОпераций = ПолучитьIDОперацийПоIDРемонта(Объект);
		КонецЕсли;
		ОтметитьНаличиеАналогов(МассивIDОпераций);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтоимостиПоТарифнойСтавкеСотрудника(Команда)
	ЗаполнитьСтоимостиПоТарифнойСтавкеСотрудникаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтоимостиПоСтоимостиЧасаКвалификации(Команда)
	ЗаполнитьСтоимостиПоСтоимостиЧасаКвалификацииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтоимостиПоРасценкеТехОперации(Команда)
	ЗаполнитьСтоимостиПоРасценкеТехОперацииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьВремяРаботыПоНормативам(Команда)
	ЗаполнитьВремяРаботыПоНормативамНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВремяРаботыПоДлительностиСУчетомГрафика(Команда)
	ЗаполнитьВремяРаботыПоДлительностиСУчетомГрафикаНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьТехКарту(Команда)
	
	ТекущиеДанные = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("es='¡Indiquen la disposición de la reparación!';ru='Укажите расположение ремонта!';en='Specify  the location of the repair!'"), 10); 
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("es='¡La reparación no es posible incluir en la composición de la operación tecnológica!';ru='Ремонт нельзя включать в состав технологической операции!';en='Repair can not be included in the technological operation!'"), 10); 
		Возврат;
	КонецЕсли;
	
	ФормаВыбора = ПолучитьФорму("Справочник.торо_ИдентификаторыТехКарт.ФормаВыбора", Новый Структура("ОтборПоСтатусам, МножественныйВыбор", ПредопределенноеЗначение("Перечисление.торо_СтатусыНормативныхРемонтовИТехКарт.Действует"), Истина), Элементы.ДеревоРемонтныхРабот);
	ФормаВыбора.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТехОперацию(Команда)
	
	ТекущиеДанные = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("es='¡Indiquen la disposición de la reparación!';ru='Укажите расположение ремонта!';en='Specify  the location of the repair!'"), 10); 
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("es='¡La reparación no es posible incluir en la composición de la operación tecnológica!';ru='Ремонт нельзя включать в состав технологической операции!';en='Repair can not be included in the technological operation!'"), 10); 
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.торо_ТехнологическиеОперации.ФормаВыбора", Новый Структура("МножественныйВыбор", Истина), Элементы.ДеревоРемонтныхРабот);		
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборРемонтов(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Владелец", Объект.Ссылка);
	ПараметрыФормы.Вставить("ВладелецДата", Объект.Дата);
	ПараметрыФормы.Вставить("Организация", Объект.Организация);
	ПараметрыФормы.Вставить("Подразделение", Объект.Подразделение);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	
	ДокументыОснования = Новый СписокЗначений;
	Для Каждого СтрокаДО Из Объект.ДокументыОснования Цикл
		ДокументыОснования.Добавить(СтрокаДО.ДокументОснование);
	КонецЦикла;
	
	ПараметрыФормы.Вставить("ДокументыОснования", ДокументыОснования);
	
	ОткрытьФорму("Обработка.торо_ПодборРемонтныхРаботОборудования.Форма.ПодборРемонтовОборудованияИРемонтныхРабот", 
		ПараметрыФормы, ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборПредписаний(Команда)
	
	ФормаПодбора = ПолучитьФорму("Обработка.торо_ПодборРемонтныхРаботОборудования.Форма.ФормаПодбораПредписаний",
	Новый Структура("Владелец", Объект.Ссылка), ЭтаФорма, Объект.Ссылка, ВариантОткрытияОкна.ОтдельноеОкно);
	
	ФормаПодбора.Объект.ДокументыОснования.Очистить();
	
	Для Каждого СтрокаДО Из Объект.ДокументыОснования Цикл
		Если ТипЗнч(СтрокаДО.ДокументОснование) = Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот") Тогда
			ФормаПодбора.Объект.ДокументыОснования.Добавить().ДокументОснование = СтрокаДО.ДокументОснование;
		КонецЕсли;
	КонецЦикла;
	
	ФормаПодбора.ЗакрыватьПриВыборе = Ложь;
	
	ФормаПодбора.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура УтвердитьСтатус(Команда)
	
	торо_РаботаССогласованиямиКлиент.УстановитьСтатус(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВнутреннееПотребление(Команда)
	
	Если Объект.РемонтыОборудования.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда 
		ПоказатьВопрос(Новый ОписаниеОповещения("ДобавитьВнутреннееПотреблениеВопрос", ЭтотОбъект), НСтр("es='Para la formación del consumo interior es necesario anotar el documento. ¿Continuar?';ru='Для формирования внутреннего потребления необходимо записать документ. Продолжить?';en='To form domestic consumption, you need to write a document. Continue?'"), РежимДиалогаВопрос.ДаНет);
		Возврат; 
	Иначе 
		ДобавитьВнутреннееПотреблениеПослеВопроса();	
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте 
Процедура ДобавитьВнутреннееПотреблениеВопрос(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
        Возврат;
	Иначе
		Если НЕ Записать() Тогда
			Возврат;
		КонецЕсли;
		
		ДобавитьВнутреннееПотреблениеПослеВопроса();	 
	КонецЕсли;

КонецПроцедуры

&НаКлиенте 
Процедура ДобавитьВнутреннееПотреблениеПослеВопроса()
	
	ТекущийРемонт = Элементы.РемонтыОборудования.ТекущиеДанные;
	
	Если Не ТекущийРемонт = Неопределено Тогда
		
		МассивСтрокНоменклатуры = СформироватьМассивНоменклатурыКСписаниюНаСервере(ТекущийРемонт.ID);
		
		Если МассивСтрокНоменклатуры = Неопределено Тогда
			
			// Значение неопределено, когда вся имеющаяся в заявке номенклатура уже есть в документе заказ на вн потребл.			
			МассивСтрокНоменклатуры = Новый Массив;
			
		КонецЕсли;	
		
		ЗначенияЗаполнения = Новый Структура();
		ЗначенияЗаполнения.Вставить("МассивСтрокНоменклатуры",МассивСтрокНоменклатуры);
		ЗначенияЗаполнения.Вставить("Организация", Объект.Организация);
		ЗначенияЗаполнения.Вставить("Подразделение", Объект.Подразделение);
		ЗначенияЗаполнения.Вставить("Ответственный", Объект.Ответственный);
		
		ЗначенияЗаполнения.Вставить("Комментарий" , Строка(Объект.Ссылка) + " " + ТекущийРемонт.ОбъектРемонта + " " + 
																	ТекущийРемонт.ВидРемонтныхРабот + " " + ТекущийРемонт.ДатаНачала + " - " + 
																	ТекущийРемонт.ДатаОкончания);
		
		СтруктураПараметров = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
		
		СтруктураПередаваемыхВОбработчикПараметров = Новый Структура;
		СтруктураПередаваемыхВОбработчикПараметров.Вставить("ТекущийРемонт_ID",ТекущийРемонт.ID);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьИзменитьЗаписиВРегистреТоро_ИнтеграцияДокументов", ЭтаФорма, СтруктураПередаваемыхВОбработчикПараметров);
		ОткрытьФорму("Документ.ВнутреннееПотреблениеТоваров.ФормаОбъекта", СтруктураПараметров, ЭтаФорма,,,,ОписаниеОповещения);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СводныйДокументВнутреннееПотребление(Команда)
	
	Если Объект.РемонтыОборудования.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда 
		ПоказатьВопрос(Новый ОписаниеОповещения("СводныйДокументВнутреннееПотреблениеВопрос", ЭтотОбъект), НСтр("es='Para la formación del documento de resumen del consumo interior es necesario anotar el documento. ¿Continuar?';ru='Для формирования сводного документа внутреннего потребления необходимо записать документ. Продолжить?';en='To form a consolidated document of domestic consumption, it is necessary to record a document. Continue?'"), РежимДиалогаВопрос.ДаНет);
		Возврат; 
	Иначе 
		СводныйДокументВнутреннееПотреблениеПослеВопроса();	
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура СводныйДокументВнутреннееПотреблениеВопрос(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	   Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
        Возврат;
	Иначе
		Если НЕ Записать() Тогда
			Возврат;
		КонецЕсли;
		
		СводныйДокументВнутреннееПотреблениеПослеВопроса();		 
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура СводныйДокументВнутреннееПотреблениеПослеВопроса()
	
	СтруктураПередаваемыхВОбработчикПараметров = Новый Структура;
	
	МассивСтрокНоменклатуры = Новый Массив;	
	МассивID = Новый Массив;
	
	СтрокаКомментария = "";
	
	Для Каждого ТекущийРемонт Из Объект.РемонтыОборудования Цикл
									
			СтрокаКомментария = СтрокаКомментария + " " + Строка(Объект.Ссылка) + " " + ТекущийРемонт.ОбъектРемонта + " " + 
			ТекущийРемонт.ВидРемонтныхРабот + " " + ТекущийРемонт.ДатаНачала + " - " + 
			ТекущийРемонт.ДатаОкончания;
						
			МассивID.Добавить(ТекущийРемонт.ID);
	КонецЦикла;
	
	МассивСтрокНоменклатуры = СформироватьМассивНоменклатурыКСписаниюНаСервере(МассивID);
	Если МассивСтрокНоменклатуры = Неопределено Тогда
		
		// Значение неопределено, когда вся имеющаяся в заявке номенклатура уже есть в документе заказ на вн потребл.			
		МассивСтрокНоменклатуры = Новый Массив;
	КонецЕсли;
		
	СтруктураПередаваемыхВОбработчикПараметров.Вставить("МассивID", МассивID);
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Организация", Объект.Организация);
	ЗначенияЗаполнения.Вставить("Подразделение", Объект.Подразделение);
	ЗначенияЗаполнения.Вставить("Ответственный", Объект.Ответственный);
	ЗначенияЗаполнения.Вставить("КлючНазначенияИспользования", "СОЗДАНИЕ_ПОТРЕБЛЕНИЯ_ИЗ_ТОИР");
	ЗначенияЗаполнения.Вставить("МассивСтрокНоменклатуры",МассивСтрокНоменклатуры);
	ЗначенияЗаполнения.Вставить("Комментарий" , СтрокаКомментария);
	
	СтруктураПараметров = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьИзменитьЗаписиВРегистреТоро_ИнтеграцияДокументовСводный",ЭтаФорма,СтруктураПередаваемыхВОбработчикПараметров);
	ОткрытьФорму("Документ.ВнутреннееПотреблениеТоваров.Форма.ФормаДокумента", СтруктураПараметров, ЭтаФорма,,,,ОписаниеОповещения);

КонецПроцедуры 

&НаКлиенте
Процедура УдалитьДокументВнутреннееПотребление(Команда)
	ТекущиеДанные = Элементы.ДокументыВнутреннееПотребление.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ДокументЕРПСсылка",ТекущиеДанные.ВнутреннееПотребление);
		СтруктураПараметров.Вставить("ID"               ,ТекущиеДанные.ID);
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораДействияПользователяПередУдалениемВнПотребления",ЭтаФорма, СтруктураПараметров);
		ПоказатьВопрос(ОписаниеОповещения,НСтр("es='El documento escogido será marcado a la desaparición. ¿Continuar?';ru='Выбранный документ будет помечен на удаление. Продолжить?';en='The selected document will be marked for deletion. Continue?'"),РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да,НСтр("es='La desaparición del enlace con el encargo del consumo interior';ru='Удаление связи с заказом на внутреннее потребление';en='Removal of communication with the order for internal consumption'"));
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСводныйВП(Элемент)
	Если Не Элемент = Неопределено Тогда
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ДокументЕРПСсылка",Элемент.ВнутреннееПотребление);
		СтруктураПараметров.Вставить("ID"               ,Элемент.ID);
		ОбработкаВыбораДействияПользователяПередУдалениемВнПотребления(КодВозвратаДиалога.Да, СтруктураПараметров);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьОприходованиеИзлишков(Команда)
	
	Если Объект.РемонтыОборудования.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда 
		ПоказатьВопрос(Новый ОписаниеОповещения("ДобавитьОприходованиеИзлишковВопрос", ЭтотОбъект), НСтр("es='Para la formación del documento оприходования de los excesos es necesario anotar el documento. ¿Continuar?';ru='Для формирования документа оприходования излишков необходимо записать документ. Продолжить?';en='To generate a document for posting surplus, you must write a document. Continue?'"), РежимДиалогаВопрос.ДаНет);
		Возврат; 
	Иначе 
		ДобавитьОприходованиеИзлишковПослеВопроса();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте 
Процедура ДобавитьОприходованиеИзлишковВопрос(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
        Возврат;
	Иначе
		Если НЕ Записать() Тогда
			Возврат;
		КонецЕсли;
		
		ДобавитьОприходованиеИзлишковПослеВопроса();	 
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьОприходованиеИзлишковПослеВопроса()
	
	ТекущийРемонт = Элементы.РемонтыОборудования.ТекущиеДанные;
	
	Если Не ТекущийРемонт = Неопределено Тогда
		
		МассивСтрокНоменклатуры = СформироватьМассивНоменклатурыКОприходованиюНаСервере(ТекущийРемонт.ID);
		
		Если МассивСтрокНоменклатуры = Неопределено Тогда
			
			// Значение неопределено, когда вся имеющаяся в заявке номенклатура уже есть в документе оприходование излишков.			
			МассивСтрокНоменклатуры = Новый Массив;
			
		КонецЕсли;	
		
		ЗначенияЗаполнения = Новый Структура();
		ЗначенияЗаполнения.Вставить("МассивСтрокНоменклатуры", МассивСтрокНоменклатуры);
		
		ЗначенияЗаполнения.Вставить("Организация", Объект.Организация);
		ЗначенияЗаполнения.Вставить("Подразделение", Объект.Подразделение);
		ЗначенияЗаполнения.Вставить("Ответственный", Объект.Ответственный);
		
		ЗначенияЗаполнения.Вставить("Комментарий" , Строка(Объект.Ссылка) + " " + ТекущийРемонт.ОбъектРемонта + " " + 
		                            ТекущийРемонт.ВидРемонтныхРабот + " " + Формат(ТекущийРемонт.ДатаНачала, НСтр("es='ÄÖ=DD. MM.yyyy';ru='ДФ=dd.MM.yyyy';en='ДФ=dd.MM.yyyy'")) + " - " + 
		                            Формат(ТекущийРемонт.ДатаОкончания, НСтр("es='ÄÖ=DD. MM.yyyy';ru='ДФ=dd.MM.yyyy';en='ДФ=dd.MM.yyyy'")));
		
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
			
		СтруктураПередаваемыхВОбработчикПараметров = Новый Структура;
		СтруктураПередаваемыхВОбработчикПараметров.Вставить("ТекущийРемонт_ID", ТекущийРемонт.ID);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьИзменитьЗаписиВРегистреТоро_ИнтеграцияДокументов", ЭтаФорма, СтруктураПередаваемыхВОбработчикПараметров);
		ОткрытьФорму("Документ.ОприходованиеИзлишковТоваров.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СводныйДокументОприходованиеИзлишков(Команда)
	
	Если Объект.РемонтыОборудования.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда 
		ПоказатьВопрос(Новый ОписаниеОповещения("СводныйДокументОприходованиеИзлишковВопрос", ЭтотОбъект), НСтр("es='Para la formación del documento de resumen оприходования de los excesos es necesario anotar el documento. ¿Continuar?';ru='Для формирования сводного документа оприходования излишков необходимо записать документ. Продолжить?';en='To form a consolidated document for capitalization of surpluses, it is necessary to record a document. Continue?'"), РежимДиалогаВопрос.ДаНет);
		Возврат; 
	Иначе 
		СводныйДокументОприходованиеИзлишковПослеВопроса();	
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура СводныйДокументОприходованиеИзлишковВопрос(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	   Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
        Возврат;
	Иначе
		Если НЕ Записать() Тогда
			Возврат;
		КонецЕсли;
		
		СводныйДокументОприходованиеИзлишковПослеВопроса();		 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СводныйДокументОприходованиеИзлишковПослеВопроса()
	
	МассивСтрокНоменклатуры = Новый Массив;	
	МассивID = Новый Массив;
	
	СтрокаКомментария = Строка(Объект.Ссылка);
	
	Для Каждого ТекущийРемонт Из Объект.РемонтыОборудования Цикл
		
		СтрокаКомментария = СтрокаКомментария + " " + ТекущийРемонт.ОбъектРемонта + " " + 
		                    ТекущийРемонт.ВидРемонтныхРабот + " " + Формат(ТекущийРемонт.ДатаНачала, НСтр("es='ÄÖ=DD. MM.yyyy';ru='ДФ=dd.MM.yyyy';en='ДФ=dd.MM.yyyy'")) + " - " + 
		                    Формат(ТекущийРемонт.ДатаОкончания, НСтр("es='ÄÖ=DD. MM.yyyy';ru='ДФ=dd.MM.yyyy';en='ДФ=dd.MM.yyyy'")); 
		
		МассивID.Добавить(ТекущийРемонт.ID);
		
	КонецЦикла;
	
	МассивСтрокНоменклатуры = СформироватьМассивНоменклатурыКОприходованиюНаСервере(МассивID);
	Если МассивСтрокНоменклатуры = Неопределено Тогда
		
		// Значение неопределено, когда вся имеющаяся в заявке номенклатура уже есть в документе оприходование излишков.			
		МассивСтрокНоменклатуры = Новый Массив;
	КонецЕсли;
	
	СтруктураПередаваемыхВОбработчикПараметров = Новый Структура;
	СтруктураПередаваемыхВОбработчикПараметров.Вставить("МассивID", МассивID);
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Организация", Объект.Организация);
	ЗначенияЗаполнения.Вставить("Подразделение", Объект.Подразделение);
	ЗначенияЗаполнения.Вставить("Ответственный", Объект.Ответственный);
	ЗначенияЗаполнения.Вставить("МассивСтрокНоменклатуры", МассивСтрокНоменклатуры);
	ЗначенияЗаполнения.Вставить("Комментарий", СтрокаКомментария);
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения); 
	ПараметрыФормы.Вставить("КлючНазначенияИспользования", "СОЗДАНИЕ_ОПРИХОДОВАНИЯ_ИЗ_ТОИР");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьИзменитьЗаписиВРегистреТоро_ИнтеграцияДокументовСводный", ЭтаФорма, СтруктураПередаваемыхВОбработчикПараметров);
	ОткрытьФорму("Документ.ОприходованиеИзлишковТоваров.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения);

КонецПроцедуры


&НаКлиенте
Процедура УдалитьДокументОприходованиеИзлишков(Команда)
	ТекущиеДанные = Элементы.ДокументыОприходованиеИзлишков.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ДокументЕРПСсылка", ТекущиеДанные.ОприходованиеИзлишков);
		СтруктураПараметров.Вставить("ID"               ,ТекущиеДанные.ID);
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораДействияПользователяПередУдалениемОпрИзлишков",ЭтаФорма, СтруктураПараметров);
		ПоказатьВопрос(ОписаниеОповещения,НСтр("es='El documento escogido será marcado a la desaparición. ¿Continuar?';ru='Выбранный документ будет помечен на удаление. Продолжить?';en='The selected document will be marked for deletion. Continue?'"),РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да,НСтр("es='La desaparición del enlace con el documento оприходования de los excesos de las mercancías';ru='Удаление связи с документом оприходования излишков товаров';en='Removal of communication with the document of receipt of surplus of goods'"));
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте 
Процедура УдалитьСводныйОИ (Элемент)
	Если Не Элемент = Неопределено Тогда
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ДокументЕРПСсылка",Элемент.ОприходованиеИзлишков);
		СтруктураПараметров.Вставить("ID"               ,Элемент.ID);
		ОбработкаВыбораДействияПользователяПередУдалениемОпрИзлишков(КодВозвратаДиалога.Да, СтруктураПараметров);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИсполнителей(Команда)
	
	ПараметрыОткрытия = Новый Структура("Ссылка, МассивИсполнителей", Объект.Ссылка, ПолучитьМассивСтруктурИсполнителей());
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаАвтоматическогоЗаполненияИсполнителей", ЭтаФорма);
	ОткрытьФорму("Документ.торо_АктОВыполненииЭтапаРабот.Форма.ФормаАвтозаполненияИсполнителей",ПараметрыОткрытия, ЭтаФорма,,ВариантОткрытияОкна.ОтдельноеОкно,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборНоменклатуры(Команда)
	
	Отказ = Ложь;
	ТекСтрокаДереваРемонтныхРабот = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	ТекстПредупреждения = НСтр("es='¡Se puede indicar los gastos solamente para las operaciones tecnológicas!';ru='Материальные затраты можно указывать только для технологических операций!';en='Material costs can only be indicated for technological operations!'");
	ПроверкаТипаВСтрокеДереваРемонтныхРабот(ТекСтрокаДереваРемонтныхРабот, Тип("СправочникСсылка.торо_ТехнологическиеОперации"), ТекстПредупреждения, Отказ);
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимПодбораБезСуммовыхПараметров",         Истина);
	ПараметрыФормы.Вставить("ИспользоватьДатыОтгрузки",                  Истина);
	ПараметрыФормы.Вставить("СкрыватьКолонкуВидЦены",                    Истина);
	ПараметрыФормы.Вставить("СкрыватьКомандуЦеныНоменклатуры",           Истина);
	ПараметрыФормы.Вставить("Заголовок",                                 НСтр("es='La selección de la nomenclatura';ru='Подбор номенклатуры';en='Item selection'"));
	ПараметрыФормы.Вставить("ЗаголовокКнопкиЗапрашиватьКоличествоИЦену", НСтр("es='Pedir la cantidad';ru='Запрашивать количество';en='Request quantity'"));
	ПараметрыФормы.Вставить("Дата",                                      ТекущаяДата());
	ПараметрыФормы.Вставить("Документ",                                  Объект.Ссылка);
	ПараметрыФормы.Вставить("КлючНазначенияИспользования",				 "ПростойПодборНоменклатуры");
	
	ОткрытьФорму("Обработка.торо_ПодборНоменклатуры.Форма", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборПоБригадамДляДокумента(Команда)
	
	стрПараметров = Новый Структура;
	стрПараметров.Вставить("Подразделение", Объект.Подразделение);
	стрПараметров.Вставить("НеобходимыеКвалификации", Объект.ТрудовыеЗатраты);
	стрПараметров.Вставить("ВидПодбора", "ПоДокументу");
	стрПараметров.Вставить("ID", Неопределено);
	стрПараметров.Вставить("РемонтыОборудования_ID", Неопределено);
	
	ОткрытьФорму("ОбщаяФорма.торо_ФормаПодбораИсполнителей", стрПараметров, Элементы.ТрудовыеЗатраты,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборПоБригадамДляОперации(Команда)
	
	ТекСтрокаДереваРемонтов = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	ТекСтрокаРемонтовОборудования = Элементы.РемонтыОборудования.ТекущиеДанные;
	
	Если ТекСтрокаДереваРемонтов = Неопределено тогда
		ID_Отбора = Неопределено;
	Иначе
		МасИД = Новый Массив;
		ID_Отбора = Новый Массив;
		торо_РаботаССогласованиямиКлиентСервер.ЗаполнитьМассивИзДерева(МасИД, ТекСтрокаДереваРемонтов.ПолучитьЭлементы());
		ID_Отбора.Добавить(ТекСтрокаДереваРемонтов.ID);
		
		Для каждого текСтрока из МасИД цикл
			ID_Отбора.Добавить(текСтрока.ID);
		КонецЦикла;
	КонецЕсли;
	
	ID_ОтбораРемонтов = ?(ТекСтрокаРемонтовОборудования = Неопределено, Неопределено, ТекСтрокаРемонтовОборудования.ID);
	
	стрПараметров = Новый Структура;
	стрПараметров.Вставить("Подразделение", Объект.Подразделение);
	стрПараметров.Вставить("НеобходимыеКвалификации", Объект.ТрудовыеЗатраты);
	стрПараметров.Вставить("ВидПодбора", "ПоОперации");
	стрПараметров.Вставить("ID", ID_Отбора);
	стрПараметров.Вставить("РемонтыОборудования_ID", ID_ОтбораРемонтов);
	
	ОткрытьФорму("ОбщаяФорма.торо_ФормаПодбораИсполнителей", стрПараметров, Элементы.ТрудовыеЗатраты,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьДатыРаботПоРемонту(Команда)
	ТекДанныеРемонта = Элементы.РемонтыОборудования.ТекущиеДанные;
	
	Если Не ТекДанныеРемонта = Неопределено Тогда
		ИмяПоляДляОтбора = "РемонтыОборудования_ID";
		
		Если Элементы.СтраницыИсполнители.ТекущаяСтраница = Элементы.СтраницаПодрядчики Тогда
			ИмяТЧ = "ИсполнителиПоРемонтам";
			ИмяТЧДляПользователя = "Исполнители по ремонтам";
		Иначе
		    ИмяТЧ = "ТрудовыеЗатраты";
			ИмяТЧДляПользователя = "Трудовые затраты";
		КонецЕсли; 

		ДополнительныеПараметры = Новый Структура("ИмяТЧ, ИмяПоляДляОтбора, ИмяТЧДляПользователя", ИмяТЧ, ИмяПоляДляОтбора, ИмяТЧДляПользователя) ;
		Если ЕстьЗаполненныеДатыУИсполнителейРемонта(ИмяТЧ, ИмяПоляДляОтбора, ТекДанныеРемонта.ID) Тогда
		    ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьДатыРаботПоРемонтуЗавершение", ЭтотОбъект, ДополнительныеПараметры), НСтр("es='Las fechas son rellenadas ya. ¿Перезаполнить de ellos?';ru='Даты уже заполнены. Перезаполнить их?';en='Dates are already filled. Refill them?'"), РежимДиалогаВопрос.ДаНет);
		Иначе
		    ЗаполнитьДатыРаботПоРемонтуЗавершение(КодВозвратаДиалога.Да, ДополнительныеПараметры);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ЕстьЗаполненныеДатыУИсполнителейРемонта(ИмяТЧ, ИмяПоляДляОтбора, ID)
	ОтборСтрок = Объект[ИмяТЧ].НайтиСтроки(Новый Структура(ИмяПоляДляОтбора, ID));
	Для каждого Исполнитель Из ОтборСтрок Цикл
	    Если Не Исполнитель.ДатаНачала = Дата("00010101") ИЛИ Не Исполнитель.ДатаОкончания = Дата("00010101") Тогда
		    Возврат Истина;
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат Ложь;
КонецФункции
 

&НаКлиенте
Процедура ЗаполнитьДатыРаботПоРемонтуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	ТекДанныеРемонта = Элементы.РемонтыОборудования.ТекущиеДанные; 
	ИмяТЧ = ДополнительныеПараметры.ИмяТЧ;
	ИмяПоляДляОтбора = ДополнительныеПараметры.ИмяПоляДляОтбора;
	ИмяТЧДляПользователя = ДополнительныеПараметры.ИмяТЧДляПользователя;
	
	ОтборСтрок = Объект[ИмяТЧ].НайтиСтроки(Новый Структура(ИмяПоляДляОтбора, ТекДанныеРемонта.ID));
	Если ОтборСтрок.Количество() = 0 Тогда
	    Возврат;
	КонецЕсли; 
	
	СообщениеПользователю = "В табличной части """ + ИмяТЧДляПользователя + """ в строке ";
	
	Для каждого Исполнитель Из ОтборСтрок Цикл
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			ДатаНачалаДляЗаполнения = ТекДанныеРемонта.ДатаНачала;
			ДатаОкончанияДляЗаполнения = ТекДанныеРемонта.ДатаОкончания;
		Иначе
			ДатаНачалаДляЗаполнения = ?(Исполнитель.ДатаНачала = Дата("00010101"), ТекДанныеРемонта.ДатаНачала, Исполнитель.ДатаНачала);
			ДатаОкончанияДляЗаполнения = ?(Исполнитель.ДатаОкончания = Дата("00010101"), ТекДанныеРемонта.ДатаОкончания, Исполнитель.ДатаОкончания);
		КонецЕсли; 
		
		Если ДатаНачалаДляЗаполнения > ДатаОкончанияДляЗаполнения Тогда
			Если Исполнитель.ДатаНачала = Дата("00010101") Тогда
				ТекстСообщения = НСтр("ru = '" + СообщениеПользователю + Исполнитель.НомерСтроки + " не заполнена дата начала (дата окончания не должна быть меньше даты начала)'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			КонецЕсли; 
			Если Исполнитель.ДатаОкончания = Дата("00010101") Тогда
				ТекстСообщения = НСтр("ru = '" + СообщениеПользователю + Исполнитель.НомерСтроки + " не заполнена дата окончания (дата окончания не должна быть меньше даты начала)'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			КонецЕсли; 
		    Продолжить;
		КонецЕсли; 
		
		Исполнитель.ДатаНачала = ДатаНачалаДляЗаполнения;
		Исполнитель.ДатаОкончания = ДатаОкончанияДляЗаполнения;
		Если Элементы.СтраницыИсполнители.ТекущаяСтраница = Элементы.СтраницаХозспособ Тогда
		    Исполнитель.ВремяРаботы = Исполнитель.ДатаОкончания - Исполнитель.ДатаНачала;
			Исполнитель.ВремяРаботыТекст = СформироватьПродолжительность(Исполнитель.ВремяРаботы);
		КонецЕсли;
	КонецЦикла; 
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте 
Процедура РассчитатьВремя(ИдСтроки)
	текДанные = Объект.ТрудовыеЗатраты.НайтиПоИдентификатору(ИдСтроки);
	текДанные.ВремяРаботы = текДанные.ДатаОкончания - текДанные.ДатаНачала;
	текДанные.ВремяРаботыТекст = СформироватьПродолжительность(текДанные.ВремяРаботы);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеВыбораУпаковки(Номенклатура, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыВыбораУпаковки = Новый Структура("Номенклатура", Номенклатура);
	СтандартнаяОбработка = Ложь;
	ЗаполнитьДанныеВыбораУпаковкиСервер(ДанныеВыбора, ПараметрыВыбораУпаковки);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьДанныеВыбораУпаковкиСервер(ДанныеВыбора, ПараметрыВыбора)
	
	ДанныеВыбора = Справочники.УпаковкиНоменклатуры.ПолучитьДанныеВыбора(ПараметрыВыбора);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОстановочные(IDРемонта = Неопределено)
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	торо_ОстановочныеРемонтыСрезПоследних.IDЗависимого КАК ID,
	|	торо_ОстановочныеРемонтыСрезПоследних.Регистратор
	|ИЗ
	|	РегистрСведений.торо_ОстановочныеРемонты.СрезПоследних(, IDЗависимого В (&ID)) КАК торо_ОстановочныеРемонтыСрезПоследних
	|ГДЕ
	|	НЕ торо_ОстановочныеРемонтыСрезПоследних.Отвязан";
	Запрос = Новый Запрос(ТекстЗапроса);
	Если IDРемонта = Неопределено Тогда
		Запрос.УстановитьПараметр("ID", Объект.РемонтыОборудования.Выгрузить().ВыгрузитьКолонку("ID"));
	Иначе
		Запрос.УстановитьПараметр("ID", IDРемонта);
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НайденныеСтроки = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", Выборка.ID));
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			НайденнаяСтрока.ВРамкахОстановочного = Выборка.Регистратор;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДоступностьДляРедактирования()
	
	МассивIDДляПроверки = Объект.РемонтыОборудования.Выгрузить().ВыгрузитьКолонку("ID");
	МассивIDДляБлокировки = торо_Ремонты.МассивIDДляБлокировкиРемонтовОборудования(Объект.Ссылка, МассивIDДляПроверки);
	
	Если Не МассивIDДляБлокировки = Неопределено Тогда
		
		Для Каждого СтрокаРемонта Из Объект.РемонтыОборудования Цикл
			СтрокаРемонта.БлокироватьДляИзменения = Не МассивIDДляБлокировки.Найти(СтрокаРемонта.ID) = Неопределено;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьДляРедактированияПоТекРемонту(БлокироватьДляИзменения, ОбъектРемонта)
	
	ПризнакВестиУчетСерийныхЗапчастей = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектРемонта, "ВестиУчетСерийныхЗапчастей");
	
	Элементы.ДеревоРемонтныхРабот.ТолькоПросмотр			= БлокироватьДляИзменения Или Не ПравоРедактирование ИЛИ ЭтаФорма["СогласованиеТолькоПросмотр"];
	Элементы.МатериальныеЗатраты.ТолькоПросмотр				= БлокироватьДляИзменения Или Не ПравоРедактирование ИЛИ ЭтаФорма["СогласованиеТолькоПросмотр"];
	Элементы.ДокументыВнутреннееПотребление.ТолькоПросмотр	= БлокироватьДляИзменения Или Не ПравоРедактирование;
	Элементы.ТрудовыеЗатраты.ТолькоПросмотр					= БлокироватьДляИзменения Или Не ПравоРедактирование ИЛИ ЭтаФорма["СогласованиеТолькоПросмотр"];
	Элементы.ИсполнителиПоРемонтам.ТолькоПросмотр		= БлокироватьДляИзменения Или Не ПравоРедактирование ИЛИ ЭтаФорма["СогласованиеТолькоПросмотр"];
	Элементы.СерийныеЗапчасти.ТолькоПросмотр				= БлокироватьДляИзменения Или Не ПравоРедактирование ИЛИ ЭтаФорма["СогласованиеТолькоПросмотр"] 
																			ИЛИ НЕ ПризнакВестиУчетСерийныхЗапчастей;
	
	Элементы.ДобавитьВнутреннееПотребление.Доступность				= Не БлокироватьДляИзменения И ПравоРедактирование И ПравоИнтерактивноеДобвалениеВнутреннихПотреблений И (НЕ ФОВводПотребленияНаОснованииПроведенного ИЛИ (ФОВводПотребленияНаОснованииПроведенного И Объект.Проведен));
	Элементы.СводныйДокументВнутреннееПотребление.Доступность		= Не БлокироватьДляИзменения И ПравоРедактирование И ПравоИнтерактивноеДобвалениеВнутреннихПотреблений И (НЕ ФОВводПотребленияНаОснованииПроведенного ИЛИ (ФОВводПотребленияНаОснованииПроведенного И Объект.Проведен));
	Элементы.УдалитьДокументВнутреннееПотребление.Доступность		= Не БлокироватьДляИзменения И ПравоРедактирование И ПравоИнтерактивнаяПометкаУдаленияВнутреннихПотреблений;
	Элементы.ДобавитьОприходованиеИзлишков.Доступность				= Не БлокироватьДляИзменения И ПравоРедактирование И ПравоИнтерактивноеДобвалениеОприходованияИзлишков И (НЕ ФОВводОприходованияНаОснованииПроведенного ИЛИ (ФОВводОприходованияНаОснованииПроведенного И Объект.Проведен));
	Элементы.СводныйДокументОприходованиеИзлишков.Доступность       = Не БлокироватьДляИзменения И ПравоРедактирование И ПравоИнтерактивноеДобвалениеОприходованияИзлишков И (НЕ ФОВводОприходованияНаОснованииПроведенного ИЛИ (ФОВводОприходованияНаОснованииПроведенного И Объект.Проведен));
	Элементы.УдалитьДокументОприходованиеИзлишков.Доступность		= Не БлокироватьДляИзменения И ПравоРедактирование И ПравоИнтерактивнаяПометкаУдаленияОприходованияИзлишков;
	Элементы.ДеревоРемонтныхРаботДобавитьТехКарту.Доступность		= Не БлокироватьДляИзменения И ПравоРедактирование И НЕ Элементы.ДеревоРемонтныхРабот.ТолькоПросмотр И НЕ ЭтаФорма["СогласованиеТолькоПросмотр"];
	Элементы.ДеревоРемонтныхРаботДобавитьТехОперацию.Доступность	= Не БлокироватьДляИзменения И ПравоРедактирование И НЕ Элементы.ДеревоРемонтныхРабот.ТолькоПросмотр И НЕ ЭтаФорма["СогласованиеТолькоПросмотр"];
	Элементы.Заполнить.Доступность									= Не БлокироватьДляИзменения И ПравоРедактирование И НЕ ЭтаФорма["СогласованиеТолькоПросмотр"];

	ДоступностьПодбораЗапчастей = НЕ Элементы.СерийныеЗапчасти.ТолькоПросмотр;
	Элементы.СерийныеЗапчастиЗапчастиПодборНоменклатуры.Доступность = ДоступностьПодбораЗапчастей;
	Элементы.СерийныеЗапчастиЗаполнитьЗапчастиПоНормам_ТекущийРемонт.Доступность = ДоступностьПодбораЗапчастей;
	Элементы.СерийныеЗапчастиЗаполнитьЗапчастиПоНормам_ВсеРемонты.Доступность = ДоступностьПодбораЗапчастей;
	Элементы.СерийныеЗапчастиЗаполнитьЗапчастиПоОснованию_ТекущийРемонт.Доступность = ДоступностьПодбораЗапчастей;
	Элементы.СерийныеЗапчастиЗаполнитьЗапчастиПоОснованию_ВсеРемонты.Доступность = ДоступностьПодбораЗапчастей;

КонецПроцедуры

&НаСервере
Функция ПолучитьСерииИспользуются(Номенклатура)
	
	Возврат Номенклатура.ВидНоменклатуры.ИспользоватьСерии;
	
КонецФункции


&НаСервере
Процедура СлужебныеРеквизитыЗаполнитьНаСервере()
	
	НоменклатураСервер.ЗаполнитьСлужебныеРеквизитыПоНоменклатуреВКоллекции(
	Объект.МатериальныеЗатраты,
	Новый Структура("ЗаполнитьПризнакХарактеристикиИспользуются",
	Новый Структура("Номенклатура", "ХарактеристикиИспользуются")));
	
	НоменклатураСервер.ЗаполнитьСлужебныеРеквизитыПоНоменклатуреВКоллекции(
	Объект.СерийныеЗапчасти,
	Новый Структура("ЗаполнитьПризнакХарактеристикиИспользуются",
	Новый Структура("Номенклатура, НоменклатураНовая", "ХарактеристикиИспользуются", "ХарактеристикиИспользуютсяДляНовой")));
	
	НоменклатураСервер.ЗаполнитьСлужебныеРеквизитыПоНоменклатуреВКоллекции(
	Объект.СерийныеЗапчасти,
	Новый Структура("ЗаполнитьПризнакСерииИспользуются",
	Новый Структура("Номенклатура, НоменклатураНовая", "СерииИспользуются", "СерииИспользуютсяДляНовой")));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.МатериальныеЗатратыХарактеристикаНоменклатуры.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.МатериальныеЗатраты.ХарактеристикиИспользуются");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.НейтральноСерый);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("es='<las características no se usan>';ru='<характеристики не используются>';en='<характеристики не используются>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного",Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность",Ложь);
	
	// Оформление поля характеристики для запчастей.	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СерийныеЗапчастиХарактеристикаНоменклатуры.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СерийныеЗапчасти.ХарактеристикиИспользуются");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.НейтральноСерый);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("es='<las características no se usan>';ru='<характеристики не используются>';en='<характеристики не используются>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного",Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность",Ложь);
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СерийныеЗапчастиХарактеристикаНоменклатурыНовая.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СерийныеЗапчасти.ХарактеристикиИспользуютсяДляНовой");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.НейтральноСерый);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("es='<las características no se usan>';ru='<характеристики не используются>';en='<характеристики не используются>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного",Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность",Ложь);
	
	// Оформление поля Серия для запчастей.	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СерийныеЗапчастиСерияНоменклатуры.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СерийныеЗапчасти.СерииИспользуются");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.НейтральноСерый);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("es='<unas series no se usan>';ru='<серии не используются>';en='<серии не используются>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного",Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность",Ложь);
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СерийныеЗапчастиСерияНоменклатурыНовая.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СерийныеЗапчасти.СерииИспользуютсяДляНовой");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.НейтральноСерый);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("es='<unas series no se usan>';ru='<серии не используются>';en='<серии не используются>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного",Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность",Ложь);

	
	//
	
	// Чтобы не отображалась единица измерения в Материальных затратах, когда заполнена Упаковка.
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.МатериальныеЗатратыНоменклатураЕдиницаИзмерения.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.МатериальныеЗатраты.ЕдиницаИзмерения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("Отображать", Ложь);
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТрудовыеЗатратыВремяРаботыТекст.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ТрудовыеЗатраты.ВремяРаботы");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.НейтральноСерый);
	
	
	// Доступость вида ремонта для редактирования.
	// Доступен если ЭтоПервыйДокументВЦепочке ИЛИ (ЭтоПоследнийДокументВЦепочке И (Докуммент-основание = ВО или ВД)).
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РемонтыОборудованияВидРемонтныхРабот.Имя);
	
	ГруппаНЕ = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаНЕ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаНе;

	ГруппаЭлементов = ГруппаНЕ.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементов.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	//
	ОтборЭлемента = ГруппаЭлементов.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЭтоПервыйДокументВЦепочке");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	//// ИЛИ (	
	ГруппаЭлементовВложенная = ГруппаЭлементов.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовВложенная.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаЭлементовВложенная.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.РемонтыОборудования.ТипДокументаОснования");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "торо_ВнешнееОснованиеДляРабот";
	///( И	
	ОтборЭлемента = ГруппаЭлементовВложенная.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЭтоПоследнийДокументВЦепочке");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	//) ИЛИ
	
	ГруппаЭлементовВложенная = ГруппаЭлементов.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовВложенная.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаЭлементовВложенная.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.РемонтыОборудования.ТипДокументаОснования");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "торо_ВыявленныеДефекты";
	///( И	
	ОтборЭлемента = ГруппаЭлементовВложенная.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЭтоПоследнийДокументВЦепочке");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	//
	
	
	// Согласование++
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоСогласованияСтатусДокумента.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоСогласования.Уровень");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоСогласованияСогласующий.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоСогласования.Уровень");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = 1;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоСогласованияЗамещающий.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоСогласования.Уровень");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = 2;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	// Согласование--
	
	// ТолькоПросмотр корня дерева ремонтных работ 
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоРемонтныхРаботРемонтнаяРабота.Имя);
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоРемонтныхРаботКоличество.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоРемонтныхРабот.РемонтнаяРабота");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	
	ОтборЭлемента.ПравоеЗначение = "Ремонтные работы";

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	//
	
	// ТолькоПросмотр для Новой операции 
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоРемонтныхРаботНоваяОперация.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоРемонтныхРабот.ТехОперация");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Справочники.торо_ТехнологическиеОперации.ПустаяСсылка();

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоРемонтныхРаботИсполнитель.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоРемонтныхРаботДоговорБригада.Имя);
	                  
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоРемонтныхРабот.ЭтоТехКарта");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Представление = "ДоступностьИсполнителяДляТехОперации";
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр",Истина);
	Элемент.Использование = Истина;
	
КонецПроцедуры


&НаКлиенте
Процедура ПодборРемонтовОбработчикОжидания()
	
	ПодборРемонтов(Элементы.РемонтыОборудованияПодборРемонтов);
	
КонецПроцедуры

&НаСервере
Функция ДеревоРемонтныхРаботОбработкаВыбораНаСервере(ТехОперация, ТекущиеДанные, СтруктураПараметры)
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДеревоРеквизит = РеквизитФормыВЗначение("ДеревоРемонтныхРабот");
	СтруктураВозврата = торо_Ремонты.ОбработкаВыбораРемонта(ДеревоРеквизит, ТехОперация, ДокОбъект, ДокОбъект.РемонтыОборудования, 
		ДокОбъект.РемонтныеРаботы, ДокОбъект.ДокументыОснования, ТекущиеДанные, СтруктураПараметры);
	
	Если ТипЗнч(СтруктураВозврата) = Тип("Структура") Тогда
		ЗначениеВРеквизитФормы(СтруктураВозврата.ДокументОбъект, "Объект");
		ЗначениеВРеквизитФормы(СтруктураВозврата.Дерево, "ДеревоРемонтныхРабот");
		
		ЗаполнитьДеревоРемонтныхРаботНаСервере();
		Возврат Истина;
	ИначеЕсли ТипЗнч(СтруктураВозврата) = Тип("Строка") Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	
КонецФункции

// Функция добавлена для обработки выбора сразу нескольких тех операций или тех карт.
&НаСервере
Функция ДеревоРемонтныхРаботОбработкаВыбораНаСервереДляМассива(МассивТехОпераций, ТекущиеДанные, СтруктураПараметры)
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДеревоРеквизит = РеквизитФормыВЗначение("ДеревоРемонтныхРабот");
	МассивВозврата = Новый Массив;
	СтруктураПоследнегоДобавленного = Неопределено;
	
	Для Каждого ТехОперация Из МассивТехОпераций Цикл
		СтруктураВозврата = торо_Ремонты.ОбработкаВыбораРемонта(ДеревоРеквизит, ТехОперация, ДокОбъект, ДокОбъект.РемонтыОборудования, 
			ДокОбъект.РемонтныеРаботы, ДокОбъект.ДокументыОснования, ТекущиеДанные,	СтруктураПараметры);
		Если ТипЗнч(СтруктураВозврата) <> Тип("Структура") Тогда
			МассивВозврата.Добавить(СтруктураВозврата);
		Иначе
			СтруктураПоследнегоДобавленного = СтруктураВозврата;
		КонецЕсли;
	КонецЦикла;
	
	Если СтруктураПоследнегоДобавленного <> Неопределено Тогда
		ЗначениеВРеквизитФормы(СтруктураВозврата.ДокументОбъект, "Объект");
		ЗначениеВРеквизитФормы(СтруктураВозврата.Дерево, "ДеревоРемонтныхРабот");
		ЗаполнитьДеревоРемонтныхРаботНаСервере();
	КонецЕсли;
	Возврат МассивВозврата;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДеревоРемонтныхРаботНаСервере(РемонтыОборудования_ID = Неопределено)
	
	ДеревоСФормы = РеквизитФормыВЗначение("ДеревоРемонтныхРабот");
	
	ДеревоСФормы.Строки.Очистить();
	
	КорневаяСтрока = ДеревоСФормы.Строки.Добавить();
	КорневаяСтрока.РемонтнаяРабота = "Ремонтные работы";	
	
	КорневаяСтрока.Картинка = 4;
	
	Если Не РемонтыОборудования_ID = Неопределено Тогда
		ТЗРемонтныеРаботы = Объект.РемонтныеРаботы.Выгрузить(Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", РемонтыОборудования_ID)));
	Иначе
		ТЗРемонтныеРаботы = Неопределено;
	КонецЕсли;
	
	СоздатьВетвьДереваПоТЧ(КорневаяСтрока, ТЗРемонтныеРаботы);
	
	СтруктураРодСтроки = Новый Структура("ID, РемонтыОборудования_ID, Родитель_ID", "", "", "");
	//торо_Ремонты.РасставитьПроцентыРодительскихСтрок(ДеревоСФормы, СтруктураРодСтроки);
	торо_ПроцентыВыполнения.ОбновитьПроцентыВыполненияВДереве(ДеревоСФормы);

	ЗначениеВРеквизитФормы(ДеревоСФормы, "ДеревоРемонтныхРабот");
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДеревоРемонтныхРабот(Родитель)
	
	Элементы.ДеревоРемонтныхРабот.Развернуть(Родитель.ПолучитьИдентификатор());
	Для Каждого Строка Из Родитель.ПолучитьЭлементы() Цикл
		РазвернутьДеревоРемонтныхРабот(Строка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьВетвьДереваПоТЧ(СтрокаДерева, ТЧРемонтныеРаботы = Неопределено, ЕстьКартинка = Истина)
	
	Если Объект.РемонтныеРаботы.Количество() > 0 И ЗначениеЗаполнено(Объект.РемонтныеРаботы[0].ID) Тогда
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Родитель_ID", СтрокаДерева.ID);
		
		Если ТЧРемонтныеРаботы = Неопределено Тогда
			МассивСтрок = Объект.РемонтныеРаботы.НайтиСтроки(ПараметрыОтбора);
		Иначе
			МассивСтрок = ТЧРемонтныеРаботы.НайтиСтроки(ПараметрыОтбора);
		КонецЕсли;
		Для Каждого Элемент Из МассивСтрок Цикл
			
			НовСтрокаДерева = СтрокаДерева.Строки.Добавить();
			
			ЗаполнитьЗначенияСвойств(НовСтрокаДерева, Элемент);
			
			Если ЕстьКартинка Тогда  
				НовСтрокаДерева.Картинка = торо_Ремонты.ИндексКартинкиДереваРемонтныхРабот(Элемент.РемонтнаяРабота);
			КонецЕсли;
			
			Если ТипЗнч(НовСтрокаДерева.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда
				НовСтрокаДерева.ЭтоТехКарта = Истина;
			Иначе
				НовСтрокаДерева.ЭтоТехКарта = Ложь;
			КонецЕсли; 
			
			СоздатьВетвьДереваПоТЧ(НовСтрокаДерева, ТЧРемонтныеРаботы, ЕстьКартинка);
			
		КонецЦикла;
		
	Иначе
		Возврат;
	КонецЕсли;		
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьСвязанныеТабличныеЧасти(ДокументОснование = Неопределено, ОбъектРемонта = Неопределено, Ремонт_ID = "")
	
	СтруктураТабличныхЧастей = Новый Структура ("МатериальныеЗатраты");
	СтруктураТабличныхЧастей.Вставить("ТрудовыеЗатраты");
	СтруктураТабличныхЧастей.Вставить("ЗакрываемыеПредписания");
	
	СтруктураТабличныхЧастейПоРемонтам = Новый Структура;
	СтруктураТабличныхЧастейПоРемонтам.Вставить("СерийныеЗапчасти");
	СтруктураТабличныхЧастейПоРемонтам.Вставить("ИсполнителиПоРемонтам");
	
	Если ПустаяСтрока(Ремонт_ID) Тогда
		
		Если Не ДокументОснование = Неопределено Тогда
			
			СтрокиРО = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ДокументИсточник", ДокументОснование));
			
		ИначеЕсли Не ОбъектРемонта = Неопределено Тогда
			
			СтрокиРО = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ОбъектРемонта", ОбъектРемонта));
			
		ИначеЕсли ОбъектРемонта = Неопределено И ДокументОснование = Неопределено Тогда
			
			Возврат;
			
		КонецЕсли;	
		
		Для Каждого ОчереднаяСтрока Из СтрокиРО Цикл
			
			СтрокиРР = Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", ОчереднаяСтрока.ID));
			
			Для Каждого СтрокаРР Из СтрокиРР Цикл
				
				Для Каждого КлючИЗначение Из СтруктураТабличныхЧастей Цикл
					Если Объект[КлючИЗначение.Ключ].Количество() > 0 Тогда
						СтрокиТЧ = Объект[КлючИЗначение.Ключ].НайтиСтроки(Новый Структура("ID", СтрокаРР.ID));
						Для Каждого СтрокаТЧ Из СтрокиТЧ Цикл
							Объект[КлючИЗначение.Ключ].Удалить(СтрокаТЧ);
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
				
				Объект.РемонтныеРаботы.Удалить(СтрокаРР);
			КонецЦикла;
			
			Для Каждого КлючИЗначение Из СтруктураТабличныхЧастейПоРемонтам Цикл
				Если Объект[КлючИЗначение.Ключ].Количество() > 0 Тогда
					СтрокиТЧ = Объект[КлючИЗначение.Ключ].НайтиСтроки(Новый Структура("РемонтыОборудования_ID", ОчереднаяСтрока.ID));
					Для Каждого СтрокаТЧ Из СтрокиТЧ Цикл
						Объект[КлючИЗначение.Ключ].Удалить(СтрокаТЧ);
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
			
			Объект.РемонтыОборудования.Удалить(ОчереднаяСтрока);		
		КонецЦикла;
		
		Если Объект.РемонтныеРаботы.Количество() > 0 Тогда
			Если ПустаяСтрока(Объект.РемонтныеРаботы[0].ID) Тогда
				Объект.РемонтныеРаботы.Очистить();
			КонецЕсли;
		КонецЕсли;
		
		ЗаполнитьДеревоРемонтныхРаботНаСервере();
		
		Если Объект.РемонтныеРаботы.Количество() = 0 Тогда
			Объект.РемонтныеРаботы.Добавить();
			Элементы.ДеревоРемонтныхРабот.ТекущаяСтрока = Объект.РемонтныеРаботы[0].ПолучитьИдентификатор();
		КонецЕсли;
		
	Иначе
		
		СтрокиРР = Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", Ремонт_ID));
		
		Для Каждого СтрокаРР Из СтрокиРР Цикл
			
			Для Каждого КлючИЗначение Из СтруктураТабличныхЧастей Цикл
				Если Объект[КлючИЗначение.Ключ].Количество() > 0 Тогда
					СтрокиТЧ = Объект[КлючИЗначение.Ключ].НайтиСтроки(Новый Структура("ID, РемонтыОборудования_ID", СтрокаРР.ID, Ремонт_ID));
					Для Каждого СтрокаТЧ Из СтрокиТЧ Цикл
						Объект[КлючИЗначение.Ключ].Удалить(СтрокаТЧ);
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
			
			Объект.РемонтныеРаботы.Удалить(СтрокаРР);
		КонецЦикла;
		
		Для Каждого КлючИЗначение Из СтруктураТабличныхЧастейПоРемонтам Цикл
			Если Объект[КлючИЗначение.Ключ].Количество() > 0 Тогда
				СтрокиТЧ = Объект[КлючИЗначение.Ключ].НайтиСтроки(Новый Структура("РемонтыОборудования_ID",Ремонт_ID));
				Для Каждого СтрокаТЧ Из СтрокиТЧ Цикл
					Объект[КлючИЗначение.Ключ].Удалить(СтрокаТЧ);
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если Объект.РемонтныеРаботы.Количество() > 0 Тогда
		Если ПустаяСтрока(Объект.РемонтныеРаботы[0].ID) Тогда
			Объект.РемонтныеРаботы.Очистить();
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьДеревоРемонтныхРаботНаСервере();  	
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДанныеТЧПоIDСтрокиДереваНаСервере(ТекущиеЗначения, СтруктураТабличныхЧастей)

	Для Каждого КлючИЗначение Из СтруктураТабличныхЧастей Цикл
		
		ТабличнаяЧасть = Объект[КлючИЗначение.Ключ];
		
		ПараметрыПоиска = Новый Структура;
		ПараметрыПоиска.Вставить("ID", ТекущиеЗначения.ID);
		ПараметрыПоиска.Вставить("РемонтыОборудования_ID", ТекущиеЗначения.РемонтыОборудования_ID);
		
		СтрокиДляУдаления = ТабличнаяЧасть.НайтиСтроки(ПараметрыПоиска);
		
		Для Каждого Элемент Из СтрокиДляУдаления Цикл
			
			ТабличнаяЧасть.Удалить(Элемент);
			
		КонецЦикла;
		
	КонецЦикла;
	
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("РемонтыОборудования_ID", ТекущиеЗначения.РемонтыОборудования_ID);
	ПараметрыПоиска.Вставить("Родитель_ID", ТекущиеЗначения.ID);
			
	МассивПодчиненныхСтрок = Объект.РемонтныеРаботы.НайтиСтроки(ПараметрыПоиска);
	Для Каждого СтрДерева Из МассивПодчиненныхСтрок Цикл
		СтруктураДляПередачи = Новый Структура("ID, РемонтыОборудования_ID, Родитель_ID", СтрДерева.ID, СтрДерева.РемонтыОборудования_ID, СтрДерева.Родитель_ID);
		УдалитьДанныеТЧПоIDСтрокиДереваНаСервере(СтруктураДляПередачи, СтруктураТабличныхЧастей);
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыборкаСтрокиРемРаботИзПредписанийНаСервере(ВыбранноеЗначение, ТекСтрокаРемонтаID, ТекСтрокаДерева, УвеличиватьКоличествоОпераций)
	
	Дерево = РеквизитФормыВЗначение("ДеревоРемонтныхРабот");
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	Для Каждого ТекСтрока из ВыбранноеЗначение.МассивСтрокРемонтныхРабот Цикл
		ДанныеТекСтроки = Новый Структура("ID, РемонтыОборудования_ID, Родитель_ID, РемонтнаяРабота, Количество", 
		ТекСтрока.ID, ТекСтрока.РемонтыОборудования_ID, ТекСтрока.Родитель_ID, ТекСтрока.РемонтнаяРабота, ТекСтрока.Количество);
		ОбработкаВыборкаСтрокиРемРаботИзПредписаний(ДокОбъект, Дерево, ВыбранноеЗначение,ДанныеТекСтроки,ТекСтрокаРемонтаID, ТекСтрокаДерева, УвеличиватьКоличествоОпераций);
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Дерево, "ДеревоРемонтныхРабот");
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	
	Для каждого СтрокаМатЗатрат Из Объект.МатериальныеЗатраты Цикл
		
		Если ЗначениеЗаполнено(СтрокаМатЗатрат.ХарактеристикаНоменклатуры) Тогда
			СтрокаМатЗатрат.ХарактеристикиИспользуются = Истина;
		КонецЕсли; 
		
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыборкаСтрокиРемРаботИзПредписаний(ДокОбъект, Дерево, ВыбранноеЗначение,ТекСтрока,ТекСтрокаРемонтаID, ТекСтрокаДерева, УвеличиватьКоличествоОпераций)
	
	Если Дерево = Неопределено Тогда
		Дерево = РеквизитФормыВЗначение("ДеревоРемонтныхРабот");
	КонецЕсли;
	
	Если ДокОбъект = Неопределено Тогда
		ДокОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	МассивСтрокОпераций = Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("РемонтыОборудования_ID,РемонтнаяРабота",ТекСтрокаРемонтаID, ТекСтрока.РемонтнаяРабота));
	
	Если МассивСтрокОпераций.Количество() = 0 Или УвеличиватьКоличествоОпераций = Ложь Тогда
		
		СтрокиДерева = Дерево.Строки.НайтиСтроки(Новый Структура("РемонтнаяРабота, ID, Родитель_ID", ТекСтрокаДерева.РемонтнаяРабота, ТекСтрокаДерева.ID, ТекСтрокаДерева.Родитель_ID), Истина);
		Если СтрокиДерева.Количество() Тогда
			СтрокаДерева = СтрокиДерева[0];
			Если ТипЗнч(СтрокаДерева.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
				Пока ТипЗнч(СтрокаДерева.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Цикл
					СтрокаДерева = СтрокаДерева.Родитель;
				КонецЦикла;
			КонецЕсли;
			
			СтрокаРодитель = СтрокаДерева;
			
			РемонтыОборудования_ID = ТекСтрокаРемонтаID;
			
			ТекущиеДанные = Новый Структура("ТекущийРемонт_ID, СтрокаРодитель_ID, СтрокаРодительРемонтыОборудования_ID, СтрокаРодительРодитель_ID",
			РемонтыОборудования_ID,СтрокаРодитель.ID, СтрокаРодитель.РемонтыОборудования_ID, СтрокаРодитель.Родитель_ID);
			
			ОбработкаВыбораРемонтаНаСервере(Дерево, ДокОбъект, ТекСтрока, ТекущиеДанные);
			
		КонецЕсли;
		
	Иначе
		
		Если УвеличиватьКоличествоОпераций Тогда 
			
			УвеличиватьКоличествоОперацийНаСервере(Дерево, ДокОбъект, ТекСтрока, ТекСтрокаРемонтаID);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УвеличиватьКоличествоОперацийНаСервере(Дерево, ДокОбъект, ТекСтрока, ТекСтрокаРемонтаID)
	
	МассивСтрокДерева = Дерево.Строки.НайтиСтроки(Новый Структура("РемонтыОборудования_ID,РемонтнаяРабота",ТекСтрокаРемонтаID, ТекСтрока.РемонтнаяРабота),Истина);
	
	Для каждого ТекСтрокаДерева Из МассивСтрокДерева Цикл
		ТекСтрокаДерева.Количество = ТекСтрокаДерева.Количество + ТекСтрока.Количество;
		
		ID = ТекСтрокаДерева.ID;
		СтрТЧ = Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("ID", ID));
		Если СтрТЧ.Количество() Тогда
			
			КоличествоБуфер = СтрТЧ[0].Количество;
			Коэффициент = ?(КоличествоБуфер = 0, 1, (СтрТЧ[0].Количество + ТекСтрока.Количество) / КоличествоБуфер);
			СтрТЧ[0].Количество = СтрТЧ[0].Количество + ТекСтрока.Количество;
			
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораРемонтаНаСервере(Дерево, ДокОбъект, ТекСтрока, ТекущиеДанные)
	
	торо_Ремонты.ЗаполнитьТиповыеЗатратыТехнологическойОперации(Дерево, ДокОбъект, ТекущиеДанные, ТекСтрока.РемонтнаяРабота,,ТекущиеДанные.ТекущийРемонт_ID, ТекСтрока.Количество); 
	
КонецПроцедуры

&НаКлиенте
// Процедура устанавливает отбор строк табличных полей затрат по строке  дерева ремонтных работ.
//
Процедура УстановитьОтборСтрокПоЗатратам()
	
	ТекСтрокаДереваРемонтов = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	ТекСтрокаРемонтовОборудования = Элементы.РемонтыОборудования.ТекущиеДанные;
	
	ID_Отбора = ТекСтрокаДереваРемонтов.ID;
	
	Если ТекСтрокаРемонтовОборудования <> Неопределено Тогда
		ID_ОтбораРемонтов = ТекСтрокаРемонтовОборудования.ID;
		
		// Материальные затраты.
		Элементы.МатериальныеЗатраты.ОтборСтрок = Новый ФиксированнаяСтруктура("ID, РемонтыОборудования_ID", ID_Отбора, ID_ОтбораРемонтов);
		
		// Трудовые затраты.
		Элементы.ТрудовыеЗатраты.ОтборСтрок = Новый ФиксированнаяСтруктура("ID, РемонтыОборудования_ID", ID_Отбора, ID_ОтбораРемонтов);
		
	Иначе
		
		// Материальные затраты.
		Элементы.МатериальныеЗатраты.ОтборСтрок = Новый ФиксированнаяСтруктура("ID", ID_Отбора);
		
		// Трудовые затраты.
		Элементы.ТрудовыеЗатраты.ОтборСтрок = Новый ФиксированнаяСтруктура("ID", ID_Отбора);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняет проверку типа ремонтной работы в строке дерева ремонтных работ.
// 
Процедура ПроверкаТипаВСтрокеДереваРемонтныхРабот(СтрокаДерева, ТипДляСравнения, ТекстПредупреждения, Отказ)
	
	Если СтрокаДерева = Неопределено Тогда
		Отказ =  Истина;
		ПоказатьПредупреждение(Неопределено, НСтр("es='de los gastos!';ru='Не выбрана ремонтная работа для отнесения затрат!';en='No repair work selected for cost allocation!'"));
		Возврат;
	КонецЕсли;
	
	Если Не ТипЗнч(СтрокаДерева.РемонтнаяРабота) = ТипДляСравнения Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(Неопределено, ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗапчастиПоЗаявкеЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	СерийныеЗапчасти = ДополнительныеПараметры.СерийныеЗапчасти;
	
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗапчастиПоЗаявкеФрагмент(СерийныеЗапчасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗапчастиПоЗаявкеФрагмент(Знач СерийныеЗапчасти)
	
	Перем IDРемонта, ЗаявкаНаРемонт, МассивДляУдаления, МассивЗапчастей, НС, Строка, ТекущийРемонтОборудования, Элемент, ЭлЗапчасть;
	
	ТекущийРемонтОборудования = Элементы.РемонтыОборудования.ТекущиеДанные;
	IDРемонта = ТекущийРемонтОборудования.ID;
	МассивДляУдаления = Новый Массив;
	Для Каждого Строка Из СерийныеЗапчасти Цикл
		Если Строка.РемонтыОборудования_ID = IDРемонта Тогда
			МассивДляУдаления.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;
	Для Каждого Элемент Из МассивДляУдаления Цикл
		СерийныеЗапчасти.Удалить(Элемент);
	КонецЦикла;
	
	ЗаявкаНаРемонт = ПолучитьЗаявкуНаСервере(ТекущийРемонтОборудования.ДокументИсточник,IDРемонта);
	
	Если ЗаявкаНаРемонт <> Неопределено Тогда
		МассивЗапчастей = ПолучитьЗапчастиПоЗаявкеНаСервере(ЗаявкаНаРемонт,IDРемонта);
		Если МассивЗапчастей <> Неопределено Тогда
			
			Для Каждого ЭлЗапчасть Из МассивЗапчастей Цикл
				НС = СерийныеЗапчасти.Добавить();
				ЗаполнитьЗначенияСвойств(НС, ЭлЗапчасть);
				НС.РемонтыОборудования_ID = IDРемонта;
			КонецЦикла;
			
		Иначе
			ТекстСообщения = НСтр("es='Para el objeto dado de la reparación no tiene lugar el recuento de las partes de recambio en serie.';ru='Для данного объекта ремонта не ведётся учет серийных запчастей.';en='For this repair facility, serial parts are not recorded.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	Иначе
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьЗапчастиПоЗаявкеФрагментЗавершение", ЭтотОбъект, Новый Структура("IDРемонта, СерийныеЗапчасти, ТекущийРемонтОборудования", IDРемонта, СерийныеЗапчасти, ТекущийРемонтОборудования)), НСтр("es='Es imposible rellenar las partes de recambio en serie de la demanda. ¿Rellenar por las normas?';ru='Невозможно заполнить серийные запчасти из заявки. Заполнить по нормативам?';en='Unable to fill in serial parts from the application. Fill according to the standards?'"),РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗапчастиПоЗаявкеФрагментЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	IDРемонта = ДополнительныеПараметры.IDРемонта;
	СерийныеЗапчасти = ДополнительныеПараметры.СерийныеЗапчасти;
	ТекущийРемонтОборудования = ДополнительныеПараметры.ТекущийРемонтОборудования;
	
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		МассивЗапчастей = ПолучитьЗапчастиПоНормативамНаСервере(ТекущийРемонтОборудования.ОбъектРемонта,ТекущийРемонтОборудования.ВидРемонтныхРабот);
		Если МассивЗапчастей <> Неопределено Тогда
			
			Для Каждого ЭлЗапчасть Из МассивЗапчастей Цикл
				НС = СерийныеЗапчасти.Добавить();
				ЗаполнитьЗначенияСвойств(НС, ЭлЗапчасть);
				НС.РемонтыОборудования_ID = IDРемонта;
			КонецЦикла;
			
		Иначе
			ТекстСообщения = НСтр("es='Para el objeto dado de la reparación no tiene lugar el recuento de las partes de recambio en serie.';ru='Для данного объекта ремонта не ведётся учет серийных запчастей.';en='For this repair facility, serial parts are not recorded.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗапчастиПоЗаявкеНаСервере(Заявка, IDРемонта)
	
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_ЗаявкаНаРемонтЗапчастиРемонта.Номенклатура,
	|	СУММА(торо_ЗаявкаНаРемонтЗапчастиРемонта.Количество) КАК Количество,
	|	торо_ЗаявкаНаРемонтЗапчастиРемонта.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ИЗ
	|	Документ.торо_ЗаявкаНаРемонт.ЗапчастиРемонта КАК торо_ЗаявкаНаРемонтЗапчастиРемонта
	|ГДЕ
	|	торо_ЗаявкаНаРемонтЗапчастиРемонта.Ссылка = &Ссылка
	|	И торо_ЗаявкаНаРемонтЗапчастиРемонта.РемонтыОборудования_ID = &ID
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_ЗаявкаНаРемонтЗапчастиРемонта.Номенклатура,
	|	торо_ЗаявкаНаРемонтЗапчастиРемонта.ЕдиницаИзмерения";
	
	Запрос.УстановитьПараметр("Ссылка",Заявка);
	Запрос.УстановитьПараметр("ID", IDРемонта);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивВозврата = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		МассивВозврата.Добавить(Новый Структура("Номенклатура,Количество,ЕдиницаИзмерения",
		Выборка.Номенклатура,Выборка.Количество,Выборка.ЕдиницаИзмерения));
	КонецЦикла;
	
	Возврат МассивВозврата;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЗапчастиПоНормативамНаСервере(ОбъектРемонта,ВидРемонтныхРабот)
	
	Если НЕ ОбъектРемонта.ВестиУчетСерийныхЗапчастей Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_НормыЗапчастейНаОбъектыРемонта.Номенклатура,
	|	СУММА(торо_НормыЗапчастейНаОбъектыРемонта.Количество) КАК Количество,
	|	ЗНАЧЕНИЕ(Перечисление.ГрадацииКачества.Новый) КАК Качество,
	|	торо_НормыЗапчастейНаОбъектыРемонта.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	торо_НормыЗапчастейНаОбъектыРемонта.Характеристика КАК ХарактеристикаНоменклатуры
	|ИЗ
	|	РегистрСведений.торо_НормыЗапчастейНаОбъектыРемонта КАК торо_НормыЗапчастейНаОбъектыРемонта
	|ГДЕ
	|	торо_НормыЗапчастейНаОбъектыРемонта.ОбъектРемонта = &ОбъектРемонта
	|	И торо_НормыЗапчастейНаОбъектыРемонта.ВидРемонта = &ВидРемонта
	|	И торо_НормыЗапчастейНаОбъектыРемонта.Количество <> 0
	|	И торо_НормыЗапчастейНаОбъектыРемонта.Приоритет
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_НормыЗапчастейНаОбъектыРемонта.Номенклатура,
	|	торо_НормыЗапчастейНаОбъектыРемонта.Номенклатура.ЕдиницаИзмерения,
	|	торо_НормыЗапчастейНаОбъектыРемонта.ОбъектРемонта,
	|	торо_НормыЗапчастейНаОбъектыРемонта.Характеристика,
	|	торо_НормыЗапчастейНаОбъектыРемонта.ВидРемонта";
	
	Запрос.УстановитьПараметр("ОбъектРемонта",ОбъектРемонта);
	Запрос.УстановитьПараметр("ТиповойОР",ОбъектРемонта.ТиповойОР);
	Запрос.УстановитьПараметр("ВидРемонта",ВидРемонтныхРабот);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивВозврата = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		МассивВозврата.Добавить(Новый Структура("Номенклатура,Количество,Качество,ЕдиницаИзмерения",
		Выборка.Номенклатура,Выборка.Количество,Выборка.Качество,Выборка.ЕдиницаИзмерения));
	КонецЦикла;
	
	Возврат МассивВозврата;
	
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЗаявкуНаСервере(Источник,IDРемонта)
	
	Если ТипЗнч(Источник) = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") Тогда
		Возврат Источник;
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот") Тогда
		Запрос = новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	торо_НарядНаВыполнениеРемонтныхРабот.ДокументИсточник
		|ИЗ
		|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтыОборудования КАК торо_НарядНаВыполнениеРемонтныхРабот
		|ГДЕ
		|	торо_НарядНаВыполнениеРемонтныхРабот.Ссылка = &Ссылка
		|   	И торо_НарядНаВыполнениеРемонтныхРабот.ID = &ID";
		
		Запрос.УстановитьПараметр("Ссылка",Источник);
		Запрос.УстановитьПараметр("ID",IDРемонта);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если ТипЗнч(Выборка.ДокументИсточник) = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") Тогда
				Возврат Выборка.ДокументИсточник;
			Иначе
				Возврат Неопределено;
			КонецЕсли;
		КонецЕсли;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура УстановитьОтборыСвязанныхТаблицРемонты()
	
	ТекДанные = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		СтруктураОтбораID =  Новый ФиксированнаяСтруктура("РемонтыОборудования_ID",ТекДанные.ID);
		Элементы.СерийныеЗапчасти.ОтборСтрок = СтруктураОтбораID;
		Элементы.ДокументыВнутреннееПотребление.ОтборСтрок = Новый ФиксированнаяСтруктура("ID", ТекДанные.ID);
		Элементы.ДокументыОприходованиеИзлишков.ОтборСтрок = Новый ФиксированнаяСтруктура("ID", ТекДанные.ID);
		Элементы.ИсполнителиПоРемонтам.ОтборСтрок = Новый ФиксированнаяСтруктура("РемонтыОборудования_ID", ТекДанные.ID);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	МассивОбъектов = ДополнительныеПараметры.МассивОбъектов;
	
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		ЗначенияЗаполнения = Новый Структура();
		ЗначенияЗаполнения.Вставить("ДокументОснование", Объект.Ссылка);
		ЗначенияЗаполнения.Вставить("МассивОР", МассивОбъектов);
		
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
		ОткрытьФорму("Документ.торо_СостоянияОбъектовРемонта.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьНаличиеДокументаПростоя()
	
	ТабРемонтов = Объект.РемонтыОборудования.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТабОР.ОбъектРемонта,
	|	ТабОР.ДатаНачала,
	|	ТабОР.ДатаОкончания
	|ПОМЕСТИТЬ ВТОбъектовРемонта
	|ИЗ
	|	&Таб КАК ТабОР
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТОбъектовРемонта.ОбъектРемонта,
	|	ЕСТЬNULL(торо_ТекущееСостояниеОР.ВидЭксплуатации, ЛОЖЬ) КАК ВидЭксплуатации
	|ИЗ
	|	ВТОбъектовРемонта КАК ВТОбъектовРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ТекущееСостояниеОР КАК торо_ТекущееСостояниеОР
	|		ПО ВТОбъектовРемонта.ОбъектРемонта = торо_ТекущееСостояниеОР.ОбъектРемонта
	|			И (торо_ТекущееСостояниеОР.Период >= ВТОбъектовРемонта.ДатаНачала)
	|			И (торо_ТекущееСостояниеОР.Период <= ВТОбъектовРемонта.ДатаОкончания)
	|			И (торо_ТекущееСостояниеОР.ВидЭксплуатации.ТипЭксплуатации = ЗНАЧЕНИЕ(Перечисление.торо_ТипЭксплуатации.Простой))";
	
	Запрос.УстановитьПараметр("Таб", ТабРемонтов);
	
	ТабСостояний = Запрос.Выполнить().Выгрузить();
	
	МассивСтрокТЗ = ТабСостояний.НайтиСтроки(Новый Структура("ВидЭксплуатации", Ложь));
	
	МассивВозврата = Новый Массив;
	
	Для каждого Стр Из МассивСтрокТЗ Цикл
		
		МассивВозврата.Добавить(Стр.ОбъектРемонта);
		
	КонецЦикла; 
	
	Возврат МассивВозврата;
	
КонецФункции

&НаКлиенте
// Процедура выполняет пересчет затрат по количеству операций.
//
Процедура ПересчитатьЗатратыПоКоличеству(СтрукПоиска, Коэффициент)
	
	МассивСтрокМЗ = Объект.МатериальныеЗатраты.НайтиСтроки(СтрукПоиска);
	Для Каждого СтрокаТЧ Из МассивСтрокМЗ Цикл
		
		СтрокаТЧ.Количество = СтрокаТЧ.Количество * Коэффициент;
		СтрокаТЧ.КоличествоЕдиниц = СтрокаТЧ.КоличествоЕдиниц * Коэффициент;
		
	КонецЦикла; 
	
	МассивСтрокТЗ = Объект.ТрудовыеЗатраты.НайтиСтроки(СтрукПоиска);
	Для Каждого СтрокаТЧ Из МассивСтрокТЗ Цикл
		
		СтрокаТЧ.ВремяРаботы = СтрокаТЧ.ВремяРаботы * Коэффициент;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
// Процедура пересчитывает количество в строках дерева ремонтных работ.
//
Процедура ПересчитатьКоличествоВПодчиненныхСтроках(СтрокаДерева, Коэффициент)
	
	Для Каждого СтрДерева Из СтрокаДерева.ПолучитьЭлементы() Цикл
		
		ID = СтрДерева.ID;
		РемID = СтрДерева.РемонтыОборудования_ID;
		СтрукПоиска = Новый Структура("ID, РемонтыОборудования_ID", ID, РемID);
		
		МассивСтрТЧ = Объект.РемонтныеРаботы.НайтиСтроки(СтрукПоиска);
		Если МассивСтрТЧ.Количество() Тогда
			
			СтрТЧ = МассивСтрТЧ[0];
			СтрТЧ.Количество = СтрТЧ.Количество * Коэффициент;
			
			СтрДерева.Количество = СтрТЧ.Количество;
			
		КонецЕсли;
		
		ПересчитатьЗатратыПоКоличеству(СтрукПоиска, Коэффициент);
		
		ПересчитатьКоличествоВПодчиненныхСтроках(СтрДерева, Коэффициент);
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
// Процедура выполняет заполнение процентов выполнения ремонтных работ.
//
// Параметры
//  СтрокаДерева – строка дерева ремонтных работ.
//
Процедура ЗаполнитьПроцентВыполненияРемонтныхРаботВСтрокахДерева(СтруктураСтроки, СтруктураРодСтроки)
	
	ДеревоОбъект = РеквизитФормыВЗначение("ДеревоРемонтныхРабот");
	торо_Ремонты.РасставитьПроцентыПодчиненныхСтрок(ДеревоОбъект, СтруктураСтроки);
	
	Если НЕ СтруктураРодСтроки = Неопределено Тогда	
		торо_Ремонты.РасставитьПроцентыРодительскихСтрок(ДеревоОбъект, СтруктураРодСтроки);
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ДеревоОбъект, "ДеревоРемонтныхРабот");
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбновитьПроцентВыполненияВСтрокахТЧ(СтрокаДерева)
	
	Если ЗначениеЗаполнено(СтрокаДерева.ID) Тогда
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("ID",СтрокаДерева.ID);
		СтруктураПоиска.Вставить("Родитель_ID",СтрокаДерева.Родитель_ID);
		СтруктураПоиска.Вставить("РемонтыОборудования_ID",СтрокаДерева.РемонтыОборудования_ID);
		
		СтрокиРемРаботы = Объект.РемонтныеРаботы.НайтиСтроки(СтруктураПоиска);
		
		Если СтрокиРемРаботы.Количество() <> 0 Тогда
			СтрокиРемРаботы[0].ПроцентВыполненияРабот = СтрокаДерева.ПроцентВыполненияРабот;
			СтрокиРемРаботы[0].Выполнено = ?(СтрокаДерева.ПроцентВыполненияРабот = 100, Истина, Ложь);
		КонецЕсли;
		
	КонецЕсли;
	
	Для каждого ТекСтрокаДерева Из СтрокаДерева.ПолучитьЭлементы() Цикл
		ОбновитьПроцентВыполненияВСтрокахТЧ(ТекСтрокаДерева);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроставитьГалкиВВетке(Строка, ЗначФлага, ЗначПроцента)
	
	Для каждого Стр Из Строка.ПолучитьЭлементы() Цикл
		
		Стр.Выполнено = ЗначФлага;
		
		ПроставитьГалкиВВетке(Стр, ЗначФлага, ЗначПроцента);
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ЗавершитьУтверждениеСтатусаДокумента(ПараметрыОповещения)
	
	торо_РаботаССогласованиями.ЗавершитьУтверждениеСтатусаДокумента(ЭтаФорма, ПараметрыОповещения);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДеревоСогласующих(НовыйСпособСогласования = Ложь) 
	
	торо_РаботаССогласованиями.ОбновитьДеревоСогласующих(ЭтаФорма, НовыйСпособСогласования);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияСтатусовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	торо_РаботаССогласованиямиКлиент.ОткрытьЗаписьИсторииСтатусов(ЭтаФорма, Элемент.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПриСменеЗначенийКоличестваИлиУпаковки(ТекущиеДанные, ИзменениеКоличестваЕдиниц = Ложь)
	
	КоэффициентУпаковки = ПолучитьКоэффициентУпаковкиНаСервере(ТекущиеДанные.ЕдиницаИзмерения);	
	
	Если КоэффициентУпаковки = 0 Тогда
		КоэффициентУпаковки = 1;
	КонецЕсли; 
	
	Если ИзменениеКоличестваЕдиниц Тогда
		ТекущиеДанные.Количество = ТекущиеДанные.КоличествоЕдиниц / КоэффициентУпаковки;
	Иначе	
		ТекущиеДанные.КоличествоЕдиниц = ТекущиеДанные.Количество * КоэффициентУпаковки;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКоэффициентУпаковкиНаСервере(Упаковка)
	
	Возврат Упаковка.Коэффициент;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьДокументыВнутреннегоПотребления(Парам1 = Неопределено, Парам2 = Неопределено)	Экспорт
	ОбновитьДокументыВнутреннегоПотребленияСервер(Парам1, Парам2);
КонецПроцедуры

&НаСервере
Процедура ОбновитьДокументыВнутреннегоПотребленияСервер(Парам1 = Неопределено, Парам2 = Неопределено)	 	
	
	МассивID = Объект.РемонтыОборудования.Выгрузить(,"ID");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_ИнтеграцияДокументов.ДокументЕРП КАК ВнутреннееПотребление,
	               |	ВЫБОР
	               |		КОГДА торо_ИнтеграцияДокументов.ДокументЕРП.Проведен
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ИндексКартинки,
	               |	торо_ИнтеграцияДокументов.ID КАК ID
	               |ИЗ
	               |	РегистрСведений.торо_ИнтеграцияДокументов КАК торо_ИнтеграцияДокументов
	               |ГДЕ
	               |	торо_ИнтеграцияДокументов.ID В(&ID)
	               |	И ТИПЗНАЧЕНИЯ(торо_ИнтеграцияДокументов.ДокументЕРП) = ТИП(Документ.ВнутреннееПотреблениеТоваров)";
	
	Запрос.УстановитьПараметр("ID", МассивID);
	
	ДокументыВнутреннееПотребление.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Функция СформироватьМассивНоменклатурыКСписаниюНаСервере(ID)
	
	УжеСписаннаяНоменклатура = ПолучитьТаблицуСписаннойНоменклатуры(ID, Тип("ДокументСсылка.ВнутреннееПотреблениеТоваров"));
	
	Если ТипЗнч(ID) = Тип("Массив") Тогда
		НоменклатураКЗаказу = Объект.МатериальныеЗатраты.Выгрузить();
		Запчасти = Объект.СерийныеЗапчасти.Выгрузить();
	Иначе
		НоменклатураКЗаказу = Объект.МатериальныеЗатраты.Выгрузить(Новый Структура("РемонтыОборудования_ID",ID));
		Запчасти = Объект.СерийныеЗапчасти.Выгрузить(Новый Структура("РемонтыОборудования_ID",ID));	
	КонецЕсли;
 
	
	НоменклатураКЗаказу.Колонки.Добавить("Серия", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	
	Для каждого Строка Из Запчасти Цикл
		НС = НоменклатураКЗаказу.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Строка);
		НС.Номенклатура = Строка.НоменклатураНовая;
		НС.ХарактеристикаНоменклатуры = Строка.ХарактеристикаНоменклатурыНовая;
		НС.Количество = Строка.КоличествоНовое;
		НС.ЕдиницаИзмерения = Строка.ЕдиницаИзмеренияНовая;
		НС.КоличествоЕдиниц = Строка.КоличествоНовое;
		НС.Серия = Строка.СерияНоменклатурыНовая;
		НС.ХарактеристикиИспользуются = Строка.ХарактеристикиИспользуютсяДляНовой;
	КонецЦикла;
	
	Для каждого Стр ИЗ НоменклатураКЗаказу Цикл 
		Если НЕ ЗначениеЗаполнено(Стр.ЕдиницаИзмерения) Тогда 
			Стр.КоличествоЕдиниц = Стр.Количество*1;
		КонецЕсли;
	КонецЦикла;
		
	НоменклатураКЗаказу.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, ХарактеристикиИспользуются, Серия", "КоличествоЕдиниц");
	
	Товары = Новый Массив;
	Услуга = Перечисления.ТипыНоменклатуры.Услуга;
	Работа = Перечисления.ТипыНоменклатуры.Работа;
	
	Для каждого Строка Из НоменклатураКЗаказу Цикл
		
		Если Строка.Номенклатура.ТипНоменклатуры = Услуга
			ИЛИ Строка.Номенклатура.ТипНоменклатуры = Работа Тогда
			Продолжить;
		КонецЕсли; 
		КоличествоУжеЗаказаннойНоменклатуры = 0;
		
		Если УжеСписаннаяНоменклатура.Количество() > 0 Тогда
			НайдСтроки = УжеСписаннаяНоменклатура.НайтиСтроки(Новый Структура("Номенклатура, Характеристика",Строка.Номенклатура,Строка.ХарактеристикаНоменклатуры));
			
			
			Если Не НайдСтроки = Неопределено Тогда
				Для каждого НайденнаяСтрока Из НайдСтроки Цикл
					КоличествоУжеЗаказаннойНоменклатуры = КоличествоУжеЗаказаннойНоменклатуры + НайденнаяСтрока.Количество;
				КонецЦикла; 
			КонецЕсли;
		КонецЕсли;
		
		Если УжеСписаннаяНоменклатура.Количество() = 0
			ИЛИ Строка.КоличествоЕдиниц > КоличествоУжеЗаказаннойНоменклатуры Тогда
			
			Структура = Новый Структура("Номенклатура, Характеристика, ХарактеристикиИспользуются, Количество, Серия",
			Строка.Номенклатура,
			Строка.ХарактеристикаНоменклатуры,
			Строка.ХарактеристикиИспользуются,
			(Строка.КоличествоЕдиниц - КоличествоУжеЗаказаннойНоменклатуры),
			Строка.Серия);
			Товары.Добавить(Структура);
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Если Товары.Количество() > 0 Тогда
		Возврат Товары;
	Иначе
		Возврат Неопределено;
	КонецЕсли; 
	
КонецФункции

&НаСервере
Функция ПолучитьТаблицуСписаннойНоменклатуры(ID, ТипДокумента)
	
	Запрос = Новый Запрос;
	Если ТипЗнч(ID) = Тип("Массив") Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ТоварыНаСкладах.Регистратор КАК ДокВП
		               |ПОМЕСТИТЬ Потребление
		               |ИЗ
		               |	РегистрСведений.торо_ИнтеграцияДокументов КАК торо_ИнтеграцияДокументов
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах КАК ТоварыНаСкладах
		               |		ПО торо_ИнтеграцияДокументов.ДокументЕРП = ТоварыНаСкладах.Регистратор
		               |ГДЕ
		               |	торо_ИнтеграцияДокументов.ID В(&ID)
					   |	И ТИПЗНАЧЕНИЯ(торо_ИнтеграцияДокументов.ДокументЕРП) = &Тип
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТоварыНаСкладах.Номенклатура КАК Номенклатура,
		               |	ТоварыНаСкладах.Характеристика КАК Характеристика,
		               |	СУММА(ТоварыНаСкладах.ВНаличии) КАК Количество
		               |ИЗ
		               |	Потребление КАК Потребление
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах КАК ТоварыНаСкладах
		               |		ПО Потребление.ДокВП = ТоварыНаСкладах.Регистратор
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТоварыНаСкладах.Характеристика,
		               |	ТоварыНаСкладах.Номенклатура";
	Иначе
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ТоварыНаСкладах.Номенклатура КАК Номенклатура,
		               |	ТоварыНаСкладах.Характеристика КАК Характеристика,
		               |	ТоварыНаСкладах.ВНаличии КАК Количество
		               |ИЗ
		               |	РегистрСведений.торо_ИнтеграцияДокументов КАК торо_ИнтеграцияДокументов
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах КАК ТоварыНаСкладах
		               |		ПО торо_ИнтеграцияДокументов.ДокументЕРП = ТоварыНаСкладах.Регистратор
		               |ГДЕ
		               |	торо_ИнтеграцияДокументов.ID = &ID
					   |	И ТИПЗНАЧЕНИЯ(торо_ИнтеграцияДокументов.ДокументЕРП) = &Тип";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ID" ,ID);
	Запрос.УстановитьПараметр("Тип" , ТипДокумента);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаКлиенте 
Процедура ДобавитьИзменитьЗаписиВРегистреТоро_ИнтеграцияДокументов(Результат, ДополнительныеПараметры) Экспорт
	ДобавитьИзменитьЗаписиВРегистреТоро_ИнтеграцияДокументовСервер(Результат, ДополнительныеПараметры);	
КонецПроцедуры

&НаСервере 
Процедура ДобавитьИзменитьЗаписиВРегистреТоро_ИнтеграцияДокументовСервер(Результат, ДополнительныеПараметры)
	
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	торо_ИнтеграцияДокументов.ДокументЕРП
		|ИЗ
		|	РегистрСведений.торо_ИнтеграцияДокументов КАК торо_ИнтеграцияДокументов
		|ГДЕ
		|	торо_ИнтеграцияДокументов.ID = &ID
		|	И торо_ИнтеграцияДокументов.ДокументТОИР = &Ссылка
		|	И торо_ИнтеграцияДокументов.ДокументЕРП  = &СсылкаНаДокЕРП";
		
		Запрос.УстановитьПараметр("ID"             , ДополнительныеПараметры.ТекущийРемонт_ID);
		Запрос.УстановитьПараметр("Ссылка"         , Объект.Ссылка);
		Запрос.УстановитьПараметр("СсылкаНаДокЕРП" , ДополнительныеПараметры.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			ДобавитьЗаписьВРегистрТоро_ИнтеграцияДокументовНаСервере(ДополнительныеПараметры.ТекущийРемонт_ID, Объект.Ссылка, ДополнительныеПараметры.Ссылка);
		КонецЕсли; 
		
	КонецЕсли; 	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗаписьВРегистрТоро_ИнтеграцияДокументовНаСервере(ID, ДокументТОИР, ДокументЕРП)
	
	Если НЕ ДокументЕРП = Документы.ВнутреннееПотреблениеТоваров.ПустаяСсылка() 
		И НЕ ДокументЕРП = Документы.ОприходованиеИзлишковТоваров.ПустаяСсылка() Тогда
		Запись = РегистрыСведений.торо_ИнтеграцияДокументов.СоздатьМенеджерЗаписи();
		Запись.ID           = ID;
		Запись.ДокументТОИР = ДокументТОИР;
		Запись.ДокументЕРП  = ДокументЕРП;
		Запись.Записать();
		
		Если ТипЗнч(ДокументЕРП) = Тип("ДокументСсылка.ВнутреннееПотреблениеТоваров") Тогда 
			ОбновитьДокументыВнутреннегоПотребленияСервер();
		ИначеЕсли ТипЗнч(ДокументЕРП) = Тип("ДокументСсылка.ОприходованиеИзлишковТоваров") Тогда
			ОбновитьДокументыОприходованияИзлишковСервер();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораДействияПользователяПередУдалениемВнПотребления(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Помечен = ПометитьУдалениеНаСервере(ДополнительныеПараметры);
		Если ТипЗнч(Помечен) <> Тип("Булево") Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(Помечен);
		КонецЕсли; 		
		МассивСтрокВП = ДокументыВнутреннееПотребление.НайтиСтроки(Новый Структура("ВнутреннееПотребление", ДополнительныеПараметры.ДокументЕРПСсылка));
		Если МассивСтрокВП.Количество() Тогда
			Для Каждого Элемент Из МассивСтрокВП Цикл
				УдалитьСводныйВП(Элемент);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораДействияПользователяПередУдалениемОпрИзлишков(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Помечен = ПометитьУдалениеНаСервере(ДополнительныеПараметры);
		Если ТипЗнч(Помечен) <> Тип("Булево") Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(Помечен);
		КонецЕсли; 		
		МассивСтрокВП = ДокументыОприходованиеИзлишков.НайтиСтроки(Новый Структура("ОприходованиеИзлишков", ДополнительныеПараметры.ДокументЕРПСсылка));
		Если МассивСтрокВП.Количество() Тогда
			Для Каждого Элемент Из МассивСтрокВП Цикл
				УдалитьСводныйОИ(Элемент);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли; 	
КонецПроцедуры


&НаСервере
Функция ПометитьУдалениеНаСервере(СтруктураПараметров)
	
	Попытка
		
		ОбъектНаУдаление = СтруктураПараметров.ДокументЕРПСсылка.ПолучитьОбъект();
		
		Если ОбъектНаУдаление.Проведен Тогда
			ОбъектНаУдаление.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонецЕсли;
		
		ОбъектНаУдаление.ПометкаУдаления = Истина;
		ОбъектНаУдаление.Записать();
		
		МенеджерЗаписи = РегистрыСведений.торо_ИнтеграцияДокументов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ID           = СтруктураПараметров.ID;
		МенеджерЗаписи.ДокументЕРП  = СтруктураПараметров.ДокументЕРПСсылка;
		МенеджерЗаписи.ДокументТОИР = Объект.Ссылка;
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Удалить();
		КонецЕсли; 
		
		Если ТипЗнч(ОбъектНаУдаление.Ссылка) = Тип("ДокументСсылка.ВнутреннееПотреблениеТоваров") Тогда 
			ОбновитьДокументыВнутреннегоПотребленияСервер();
		ИначеЕсли ТипЗнч(ОбъектНаУдаление.Ссылка) = Тип("ДокументСсылка.ОприходованиеИзлишковТоваров") Тогда
			ОбновитьДокументыОприходованияИзлишковСервер();
		КонецЕсли;
		
	Исключение
		
		Возврат ОписаниеОшибки();
		
	КонецПопытки; 
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьМассивID(МассивID,ЭлементДерева)
	МассивID.Добавить(ЭлементДерева.ID);
	Для Каждого ЭлементДерева1 Из ЭлементДерева.ПолучитьЭлементы() Цикл
		ЗаполнитьМассивID(МассивID,ЭлементДерева1);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаменитьМатериалыНаАналоги(АдресВХранилище, Отказ = Ложь)
	
	ЗначенияРеквизитовНовыхСтрок = Новый Структура;
	
	КлючДанных = ОбщегоНазначенияУТ.КлючДанныхДляСообщенияПользователю(Объект);
	
	МассивКлючей						= Новый Массив;
	МассивУдаляемыхСтрок				= Новый Массив;
	ИзменяемыеСтроки					= Новый Соответствие;
	СтруктураОтбора						= Новый Структура;
	
	НаборыМатериалов					= ПолучитьИзВременногоХранилища(АдресВХранилище);
	
	// Проверяем возможность применения замены.
	
	Для Каждого СтрокаМатериал из НаборыМатериалов.Материалы Цикл
		
		СтруктураОтбора.Вставить("ID",СтрокаМатериал.ID);
		СтруктураОтбора.Вставить("РемонтыОборудования_ID",СтрокаМатериал.РемонтыОборудования_ID);
		СтруктураОтбора.Вставить("Номенклатура", СтрокаМатериал.Номенклатура);
		СтруктураОтбора.Вставить("ХарактеристикаНоменклатуры", СтрокаМатериал.ХарактеристикаНоменклатуры);
		
		НайденныеСтроки = Объект.МатериальныеЗатраты.НайтиСтроки(СтруктураОтбора);
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			Если ЗначениеЗаполнено(СтруктураОтбора.ХарактеристикаНоменклатуры) Тогда
				ШаблонСообщения = НСтр("es='el material: %1, %2.';ru='Не найдено строки с материалом: %1, %2.';en='No rows found with material:%1,%2.'");
				ТекстСообщения = СтрШаблон(ШаблонСообщения, СтруктураОтбора.Номенклатура, СтруктураОтбора.ХарактеристикаНоменклатуры);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Иначе
				ШаблонСообщения = НСтр("es='el material: %1.';ru='Не найдено строки с материалом: %1.';en='No rows found with material:%1.'");
				ТекстСообщения = СтрШаблон(ШаблонСообщения, СтруктураОтбора.Номенклатура);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
			
			
			Отказ = Истина;
			Продолжить;
		КонецЕсли;
		
		СтрокаМатЗатрат = НайденныеСтроки[0];
		
		Если СтрокаМатЗатрат.КоличествоЕдиниц < СтрокаМатериал.Количество Тогда
			ШаблонСообщения = НСтр("es='La falta de la aplicación del análogo. El material ""%1"" no basta para la sustitución.';ru='Ошибка применения аналога. Материала ""%1"" недостаточно для замены.';en=""Error using analogue. Material '%1' is not enough to replace.""");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, СтрокаМатЗатрат.Номенклатура);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			Продолжить;
		КонецЕсли;
		
		Если СтрокаМатЗатрат.КоличествоЕдиниц = СтрокаМатериал.Количество Тогда
			МассивУдаляемыхСтрок.Добавить(СтрокаМатЗатрат);
		Иначе
			ИзменяемыеСтроки.Вставить(СтрокаМатЗатрат,Новый Структура("КоличествоЕдиниц", СтрокаМатЗатрат.КоличествоЕдиниц - СтрокаМатериал.Количество));
		КонецЕсли;
		
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Удаление строк или изменение количества.
	//
	Для Каждого СтрокаМатЗатрат из МассивУдаляемыхСтрок Цикл
		Объект.МатериальныеЗатраты.Удалить(СтрокаМатЗатрат);
	КонецЦикла;
	
	Для Каждого КлючИЗначение Из ИзменяемыеСтроки Цикл
		КлючИЗначение.Ключ.КоличествоЕдиниц = КлючИЗначение.Значение.КоличествоЕдиниц;
		ПриСменеЗначенийКоличестваИлиУпаковки(КлючИЗначение.Ключ, Истина);
	КонецЦикла;
	
	// Добавление новых строк
	Для Каждого СтрокаАналога ИЗ НаборыМатериалов.Аналоги Цикл
		СтруктураОтбора.Вставить("ID",СтрокаАналога.ID);
		СтруктураОтбора.Вставить("РемонтыОборудования_ID",СтрокаАналога.РемонтыОборудования_ID);
		СтруктураОтбора.Вставить("Номенклатура", СтрокаАналога.Номенклатура);
		СтруктураОтбора.Вставить("ХарактеристикаНоменклатуры", СтрокаАналога.ХарактеристикаНоменклатуры);
		
		МассивСтрок = Объект.МатериальныеЗатраты.НайтиСтроки(СтруктураОтбора);
		Если МассивСтрок.Количество() > 0 Тогда
			СтрокаНоменклатуры = МассивСтрок[0];
			СтрокаНоменклатуры.Количество = СтрокаНоменклатуры.Количество + СтрокаАналога.Количество;
			СтрокаНоменклатуры.КоличествоЕдиниц = СтрокаНоменклатуры.КоличествоЕдиниц + СтрокаАналога.КоличествоЕдиниц;
		Иначе
			СтрокаНоменклатуры = Объект.МатериальныеЗатраты.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНоменклатуры,СтрокаАналога);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьАналогиНаКлиенте()
	СтрокаНоменклатуры = Элементы.МатериальныеЗатраты.ТекущиеДанные;
	Если СтрокаНоменклатуры.ЕстьАналоги Тогда
		СтрокаРемонта = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID",СтрокаНоменклатуры.РемонтыОборудования_ID))[0];
		СтрокаРР = Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("ID",СтрокаНоменклатуры.ID))[0];
		МассивСтрокРРТехКарта = Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("ID",СтрокаРР.Родитель_ID));
		Если МассивСтрокРРТехКарта.Количество() Тогда
			ТехКарта = МассивСтрокРРТехКарта[0].РемонтнаяРабота;
		Иначе
			ТехКарта = ПредопределенноеЗначение("Справочник.торо_ИдентификаторыТехКарт.ПустаяСсылка");
		КонецЕсли;
		
		ПодразделениеИсполнитель = ПолучитьПодразделениеИсполнителя (СтрокаРемонта.ОбъектРемонта); 
		
		СтруктураПараметров = (Новый Структура(
		"ID,РемонтыОборудования_ID,Номенклатура,
		|ХарактеристикаНоменклатуры,ЕдиницаИзмерения,КоличествоЕдиниц
		|,Количество, ОбъектРемонта, ВидРемонта,
		|ПодразделениеИсполнитель, ТехКарта, ДатаРемонта",
		СтрокаНоменклатуры.ID,СтрокаНоменклатуры.РемонтыОборудования_ID,СтрокаНоменклатуры.Номенклатура,
		СтрокаНоменклатуры.ХарактеристикаНоменклатуры,СтрокаНоменклатуры.ЕдиницаИзмерения,СтрокаНоменклатуры.КоличествоЕдиниц,
		СтрокаНоменклатуры.Количество,СтрокаРемонта.ОбъектРемонта,СтрокаРемонта.ВидРемонтныхРабот,
		ПодразделениеИсполнитель,ТехКарта,СтрокаРемонта.ДатаНачала));
				
		ОткрытьФорму("ОбщаяФорма.торо_ФормаВыбораАналогаНоменклатурыДляРемонта",СтруктураПараметров,ЭтаФорма,Объект.Ссылка,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьПодразделениеИсполнителя(СсылкаОР)
	Запрос =  Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	торо_ОбъектыРемонта.ПодразделениеИсполнитель КАК ПодразделениеИсполнитель
	                |ИЗ
	                |	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	                |ГДЕ
	                |	торо_ОбъектыРемонта.Ссылка = &СсылкаОР";
	
	Запрос.УстановитьПараметр("СсылкаОР", СсылкаОР);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПодразделениеИсполнитель;
	Иначе 
		Возврат Справочники.СтруктураПредприятия.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ОтметитьНаличиеАналогов(МассивКлючей = Неопределено)
	
	Если НЕ ПолучитьФункциональнуюОпцию("торо_ИспользоватьАналогиНоменклатурыДляРемонтов") Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.ID КАК ID,
	|	Таблица.Номенклатура КАК Номенклатура,
	|	Таблица.ХарактеристикаНоменклатуры КАК Характеристика,
	|	Таблица.РемонтыОборудования_ID КАК РемонтыОборудования_ID
	|ПОМЕСТИТЬ МатериалыИУслуги
	|ИЗ
	|	&Материалы КАК Таблица
	|&&БлокОтбора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица.ID,
	|	Таблица.РемонтнаяРабота,
	|	Таблица.Родитель_ID,
	|	Таблица.РемонтыОборудования_ID
	|ПОМЕСТИТЬ РемРаботы
	|ИЗ
	|	&РемРаботы КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Ремонты.ОбъектРемонта КАК Справочник.торо_ОбъектыРемонта) КАК ОбъектРемонта,
	|	Ремонты.ID КАК РемонтыОборудования_ID,
	|	Ремонты.ВидРемонтныхРабот,
	|	Ремонты.ДатаНачала
	|ПОМЕСТИТЬ Ремонты
	|ИЗ
	|	&Ремонты КАК Ремонты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МатериалыИУслуги.Номенклатура КАК Материал,
	|	МатериалыИУслуги.Характеристика КАК ХарактеристикаМатериала,
	|	ЕСТЬNULL(РемРаботыТехКарты.РемонтнаяРабота, ЗНАЧЕНИЕ(Справочник.торо_ИдентификаторыТехКарт.ПустаяСсылка)) КАК ТехКарта,
	|   Ремонты.ОбъектРемонта.ПодразделениеИсполнитель КАК Подразделение,
	|	Ремонты.ОбъектРемонта.Организация КАК Организация,
	|	Ремонты.ВидРемонтныхРабот КАК ВидРемонта,
	|	Ремонты.ОбъектРемонта,
	|	Ремонты.ОбъектРемонта.Направление КАК НаправлениеОбъектаРемонта,
	|	Ремонты.ДатаНачала КАК ДатаРемонта,
	|	МатериалыИУслуги.ID,
	|	МатериалыИУслуги.РемонтыОборудования_ID
	|ПОМЕСТИТЬ ТаблицаНоменклатуры
	|ИЗ
	|	МатериалыИУслуги КАК МатериалыИУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ РемРаботы КАК РемРаботы
	|			ЛЕВОЕ СОЕДИНЕНИЕ РемРаботы КАК РемРаботыТехКарты
	|			ПО РемРаботы.Родитель_ID = РемРаботыТехКарты.ID
	|				И (ВЫРАЗИТЬ(РемРаботы.РемонтнаяРабота КАК Справочник.торо_ТехнологическиеОперации) ССЫЛКА Справочник.торо_ТехнологическиеОперации)
	|				И (ВЫРАЗИТЬ(РемРаботыТехКарты.РемонтнаяРабота КАК Справочник.торо_ИдентификаторыТехКарт) ССЫЛКА Справочник.торо_ИдентификаторыТехКарт)
	|		ПО МатериалыИУслуги.ID = РемРаботы.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ Ремонты КАК Ремонты
	|		ПО МатериалыИУслуги.РемонтыОборудования_ID = Ремонты.РемонтыОборудования_ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНоменклатуры.Материал,
	|	ТаблицаНоменклатуры.ХарактеристикаМатериала,
	|	ТаблицаНоменклатуры.ID,
	|	ТаблицаНоменклатуры.РемонтыОборудования_ID,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА торо_АналогиНоменклатурыДляРемонтов.Регистратор ЕСТЬ NULL 
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК ЕстьАналоги
	|ИЗ
	|	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_АналогиНоменклатурыДляРемонтов КАК торо_АналогиНоменклатурыДляРемонтов
	|		ПО ТаблицаНоменклатуры.Материал = торо_АналогиНоменклатурыДляРемонтов.Материал
	|			И ТаблицаНоменклатуры.ХарактеристикаМатериала = торо_АналогиНоменклатурыДляРемонтов.ХарактеристикаМатериала
	|			И ТаблицаНоменклатуры.ДатаРемонта >= торо_АналогиНоменклатурыДляРемонтов.Период
	|			И (ВЫБОР
	|				КОГДА торо_АналогиНоменклатурыДляРемонтов.ПериодЗавершения = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ТаблицаНоменклатуры.ДатаРемонта <= торо_АналогиНоменклатурыДляРемонтов.ПериодЗавершения
	|			КОНЕЦ)
	|           И (торо_АналогиНоменклатурыДляРемонтов.ОбъектРемонта = ЗНАЧЕНИЕ(Справочник.торо_ОбъектыРемонта.ПустаяСсылка)
	|               ИЛИ торо_АналогиНоменклатурыДляРемонтов.ОбъектРемонта = ЗНАЧЕНИЕ (Справочник.торо_СписокОбъектовРегламентногоМероприятия.ПустаяСсылка)
	|				ИЛИ торо_АналогиНоменклатурыДляРемонтов.ОбъектРемонта = НЕОПРЕДЕЛЕНО 
	|               ИЛИ ЕСТЬNULL(ТаблицаНоменклатуры.ОбъектРемонта, ЗНАЧЕНИЕ(Справочник.торо_ОбъектыРемонта.ПустаяСсылка)) = торо_АналогиНоменклатурыДляРемонтов.ОбъектРемонта)
	|			И (торо_АналогиНоменклатурыДляРемонтов.ТехКарта = ЗНАЧЕНИЕ(Справочник.торо_ИдентификаторыТехКарт.ПустаяСсылка)
	|				ИЛИ ЕСТЬNULL(ТаблицаНоменклатуры.ТехКарта, ЗНАЧЕНИЕ(Справочник.торо_ИдентификаторыТехКарт.ПустаяСсылка)) = торо_АналогиНоменклатурыДляРемонтов.ТехКарта)
	|			И (&ИспользоватьУправлениеПерсоналом = ЛОЖЬ
	|				ИЛИ торо_АналогиНоменклатурыДляРемонтов.Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|				ИЛИ торо_АналогиНоменклатурыДляРемонтов.Подразделение = ТаблицаНоменклатуры.Подразделение)
	|			И (торо_АналогиНоменклатурыДляРемонтов.ВидРемонта = ЗНАЧЕНИЕ(Справочник.торо_ВидыРемонтов.ПустаяСсылка)
	|				ИЛИ торо_АналогиНоменклатурыДляРемонтов.ВидРемонта = ТаблицаНоменклатуры.ВидРемонта)
	|			И (торо_АналогиНоменклатурыДляРемонтов.НаправлениеОбъектаРемонта = ЗНАЧЕНИЕ(Справочник.торо_НаправленияОбъектовРемонтныхРабот.ПустаяСсылка)
	|				ИЛИ торо_АналогиНоменклатурыДляРемонтов.НаправлениеОбъектаРемонта = ТаблицаНоменклатуры.НаправлениеОбъектаРемонта)
	|			И (торо_АналогиНоменклатурыДляРемонтов.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				ИЛИ торо_АналогиНоменклатурыДляРемонтов.Организация = ТаблицаНоменклатуры.Организация)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаНоменклатуры.Материал,
	|	ТаблицаНоменклатуры.ХарактеристикаМатериала,
	|	ТаблицаНоменклатуры.ID,
	|	ТаблицаНоменклатуры.РемонтыОборудования_ID";
	
	//Запрос.УстановитьПараметр("Исполнители",Объект.ТрудовыеЗатраты.Выгрузить(,"Сотрудник,ID,РемонтыОборудования_ID"));
	Запрос.УстановитьПараметр("Материалы",Объект.МатериальныеЗатраты.Выгрузить());
	Запрос.УстановитьПараметр("РемРаботы",Объект.РемонтныеРаботы.Выгрузить());
	Запрос.УстановитьПараметр("Ремонты",Объект.РемонтыОборудования.Выгрузить());
	Запрос.УстановитьПараметр("МассивID",МассивКлючей);
	Запрос.УстановитьПараметр("ИспользоватьУправлениеПерсоналом",ПолучитьФункциональнуюОпцию("торо_ИспользоватьУправлениеПерсоналом"));
	
	Если МассивКлючей = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&&БлокОтбора","");
	ИначеЕсли ТипЗнч(МассивКлючей) = Тип("Строка") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&&БлокОтбора","ГДЕ
		|	Таблица.ID = &МассивID");
	ИначеЕсли ТипЗнч(МассивКлючей) = Тип("Массив") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&&БлокОтбора","ГДЕ
		|	Таблица.ID В (&МассивID)");
	Иначе
		Возврат;
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Объект.МатериальныеЗатраты.НайтиСтроки(Новый Структура("Номенклатура,ХарактеристикаНоменклатуры,ID,РемонтыОборудования_ID",
		Выборка.Материал,Выборка.ХарактеристикаМатериала,Выборка.ID,Выборка.РемонтыОборудования_ID))[0].ЕстьАналоги = Выборка.ЕстьАналоги;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СформироватьПродолжительность(ПродолжительностьВСекундах)
	
	Если ПродолжительностьВСекундах = 0 Тогда
		
		Возврат "Ввести продолжительность";
		
	Иначе
		
		Часы    = Цел(ПродолжительностьВСекундах / 3600);
		Минуты  = Цел((ПродолжительностьВСекундах - 3600 * Часы) / 60);
		Секунды = ПродолжительностьВСекундах - 3600 * Часы - Минуты * 60;
		
		Возврат "" + Часы + " ч. " + Минуты + " мин. " + Секунды + " с.";
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ПолучитьМассивСтруктурИсполнителей()
	Массив = Новый Массив;
	
	Для каждого СтрокаРемонтовОборудования Из Объект.РемонтыОборудования Цикл
		
		МассивСтрокРемонныхРабот = Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", СтрокаРемонтовОборудования.ID));
		
		Для каждого СтрокаРемонтныхРабот Из МассивСтрокРемонныхРабот Цикл
			
			МассивИсполнителей = Объект.ТрудовыеЗатраты.НайтиСтроки(Новый Структура("РемонтыОборудования_ID, ID", СтрокаРемонтовОборудования.ID, СтрокаРемонтныхРабот.ID));
			
			Для каждого СтрокаИсполнителя Из МассивИсполнителей Цикл
				
				СтруктураСтроки = Новый Структура();
				СтруктураСтроки.Вставить("РемонтыОборудования_ID", СтрокаРемонтовОборудования.ID);
				СтруктураСтроки.Вставить("ID"                    , СтрокаРемонтныхРабот.ID);
				СтруктураСтроки.Вставить("Родитель_ID"           , СтрокаРемонтныхРабот.Родитель_ID);
				СтруктураСтроки.Вставить("РемонтнаяРабота"       , СтрокаРемонтныхРабот.РемонтнаяРабота);
				СтруктураСтроки.Вставить("ОбъектРемонта"         , СтрокаРемонтовОборудования.ОбъектРемонта);
				СтруктураСтроки.Вставить("ВидРемонта"            , СтрокаРемонтовОборудования.ВидРемонтныхРабот);
				СтруктураСтроки.Вставить("ДатаНачалаРемонта"     , СтрокаРемонтовОборудования.ДатаНачала);
				СтруктураСтроки.Вставить("ДатаОкончанияРемонта"  , СтрокаРемонтовОборудования.ДатаОкончания);
				СтруктураСтроки.Вставить("Квалификация"          , СтрокаИсполнителя.Квалификация);
				СтруктураСтроки.Вставить("ДатаНачала"            , СтрокаИсполнителя.ДатаНачала);
				СтруктураСтроки.Вставить("ДатаОкончания"         , СтрокаИсполнителя.ДатаОкончания);
				СтруктураСтроки.Вставить("КТУ"                   , СтрокаИсполнителя.КТУ);
				СтруктураСтроки.Вставить("ВремяРаботы"           , СтрокаИсполнителя.ВремяРаботы);
				СтруктураСтроки.Вставить("СуммаКНачислению"      , СтрокаИсполнителя.СуммаКНачислению);
				СтруктураСтроки.Вставить("Сотрудник"             , СтрокаИсполнителя.Сотрудник);
				
				Массив.Добавить(СтруктураСтроки);
				
			КонецЦикла;
			
			Если Не ТипЗнч(СтрокаРемонтныхРабот.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт")
				И Не МассивИсполнителей.Количество() > 0 Тогда //нужно отразить хотя бы тех операции.
				
				СтруктураСтроки = Новый Структура();
				СтруктураСтроки.Вставить("РемонтыОборудования_ID", СтрокаРемонтовОборудования.ID);
				СтруктураСтроки.Вставить("ID"                    , СтрокаРемонтныхРабот.ID);
				СтруктураСтроки.Вставить("Родитель_ID"           , СтрокаРемонтныхРабот.Родитель_ID);
				СтруктураСтроки.Вставить("РемонтнаяРабота"       , СтрокаРемонтныхРабот.РемонтнаяРабота);
				СтруктураСтроки.Вставить("ОбъектРемонта"         , СтрокаРемонтовОборудования.ОбъектРемонта);
				СтруктураСтроки.Вставить("ВидРемонта"            , СтрокаРемонтовОборудования.ВидРемонтныхРабот);
				СтруктураСтроки.Вставить("ДатаНачалаРемонта"     , СтрокаРемонтовОборудования.ДатаНачала);
				СтруктураСтроки.Вставить("ДатаОкончанияРемонта"  , СтрокаРемонтовОборудования.ДатаОкончания);
				
				СтруктураСтроки.Вставить("Квалификация");
				СтруктураСтроки.Вставить("ДатаНачала");
				СтруктураСтроки.Вставить("ДатаОкончания");
				СтруктураСтроки.Вставить("КТУ");
				СтруктураСтроки.Вставить("ВремяРаботы");
				СтруктураСтроки.Вставить("СуммаКНачислению");
				СтруктураСтроки.Вставить("Сотрудник");
				
				Массив.Добавить(СтруктураСтроки);
				
			КонецЕсли; 
			
		КонецЦикла; 
	КонецЦикла; 
	
	Возврат Массив;
	
КонецФункции	

&НаКлиенте
Процедура ОбработкаАвтоматическогоЗаполненияИсполнителей(Результат, ДопПараметры) Экспорт
	
	Если Не Результат = Неопределено И ТипЗнч(Результат) = Тип("Массив") Тогда
		Объект.ТрудовыеЗатраты.Очистить();
		Для каждого СтрокаМассива Из Результат Цикл
			НС = Объект.ТрудовыеЗатраты.Добавить();
			ЗаполнитьЗначенияСвойств(НС, СтрокаМассива);
			//НС.ВремяРаботы = НС.ДатаОкончания - НС.ДатаНачала;
			НС.ВремяРаботыТекст = СформироватьПродолжительность(НС.ВремяРаботы);
		КонецЦикла; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеВидимостью(ДокОбъект)
	Элементы = ДокОбъект.Элементы;
	Объект = ДокОбъект.Объект;
	Элементы.ДеревоСогласованияУтвердитьСтатус.Доступность = ЗначениеЗаполнено(Объект.СпособСогласования);
КонецПроцедуры

&НаСервере
// Проверяет, есть ли документы, созданные на основании данного и документы, на оснвоании которого был введен текущий, 
// кроме Выявленных дефектов и Внешнего основания
Функция ЭтоПервыйДокументВЦепочке()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДокументыОснования.ДокументИсточник
	|ПОМЕСТИТЬ ДокументыОснования_
	|ИЗ
	|	&ДокументыОснования КАК ДокументыОснования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыОснования_.ДокументИсточник КАК Ссылка
	|ПОМЕСТИТЬ ТабДокументовОснований
	|ИЗ
	|	ДокументыОснования_ КАК ДокументыОснования_
	|ГДЕ
	|	(ДокументыОснования_.ДокументИсточник ССЫЛКА Документ.торо_ЗаявкаНаРемонт
	|			ИЛИ ДокументыОснования_.ДокументИсточник ССЫЛКА Документ.торо_ПланГрафикРемонта
	|			ИЛИ ДокументыОснования_.ДокументИсточник ССЫЛКА Документ.торо_НарядНаВыполнениеРемонтныхРабот)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_АктПриемкиОборудованияРемонтыОборудования.Ссылка
	|ПОМЕСТИТЬ ТабДокументов
	|ИЗ
	|	Документ.торо_АктПриемкиОборудования.РемонтыОборудования КАК торо_АктПриемкиОборудованияРемонтыОборудования
	|ГДЕ
	|	торо_АктПриемкиОборудованияРемонтыОборудования.ДокументИсточник = &ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТабДокументов.Ссылка
	|ИЗ
	|	ТабДокументов КАК ТабДокументов
	|ГДЕ
	|	ТабДокументов.Ссылка.ПометкаУдаления = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТабДокументовОснований.Ссылка
	|ИЗ
	|	ТабДокументовОснований КАК ТабДокументовОснований";
	Запрос.УстановитьПараметр("ДокументыОснования", Объект.РемонтыОборудования.Выгрузить());
	Запрос.УстановитьПараметр("ДокументОснование", Объект.Ссылка);
	
	Результат = Запрос.Выполнить();
	Возврат Результат.Пустой();
	
КонецФункции

&НаСервере
// Проверяет, есть ли документы, введенные на основании текущего
Функция ЭтоПоследнийДокументВЦепочке()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	торо_АктПриемкиОборудованияРемонтыОборудования.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ТабДокументов
	               |ИЗ
	               |	Документ.торо_АктПриемкиОборудования.РемонтыОборудования КАК торо_АктПриемкиОборудованияРемонтыОборудования
	               |ГДЕ
	               |	торо_АктПриемкиОборудованияРемонтыОборудования.ДокументИсточник = &ДокументОснование
	               |	И торо_АктПриемкиОборудованияРемонтыОборудования.Ссылка.Проведен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ТабДокументов.Ссылка КАК Ссылка
	               |ИЗ
	               |	ТабДокументов КАК ТабДокументов
	               |ГДЕ
	               |	ТабДокументов.Ссылка.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.Ссылка);
	
	Результат = Запрос.Выполнить();
	Возврат Результат.Пустой();
	
КонецФункции

&НаСервере
Процедура РемонтыОборудованияОбновитьДокументыИсточники()
	
	Для Каждого СтрокаРемонта Из Объект.РемонтыОборудования Цикл
		Если СтрокаРемонта.ТипДокументаОснования = "" и СтрокаРемонта.ДокументИсточник <> Неопределено Тогда
			СтрокаРемонта.ТипДокументаОснования = СтрокаРемонта.ДокументИсточник.Метаданные().Имя;
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборОпераций(Команда)
	
	ТекущиеДанные = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("es='¡Indiquen la disposición de la reparación!';ru='Укажите расположение ремонта!';en='Specify  the location of the repair!'"), 10); 
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("es='¡La reparación no es posible incluir en la composición de la operación tecnológica!';ru='Ремонт нельзя включать в состав технологической операции!';en='Repair can not be included in the technological operation!'"), 10); 
		Возврат;
	КонецЕсли;
	
	ФормаВыбора = ПолучитьФорму("Справочник.торо_ТехнологическиеОперации.ФормаВыбора", Новый Структура("МножественныйВыбор", Истина), Элементы.ДеревоРемонтныхРабот);
	ФормаВыбора.ЗакрыватьПриВыборе = Ложь;
	ФормаВыбора.Открыть();
	
КонецПроцедуры

&НаСервере 
Процедура ДобавитьНоменклатуруИзПодбора(Адрес, СтруктураСтроки, ИмяТЧ, ИмяРеквизита)
	
	ID = СтруктураСтроки.ID;
	РемонтыОборудования_ID = СтруктураСтроки.РемонтыОборудования_ID;
	Кол = ?(СтруктураСтроки.Количество = 0, 1, СтруктураСтроки.Количество);
	
	Тз = ПолучитьИзВременногоХранилища(Адрес);
	
	СтруктураДействий = Новый Структура;
	Для каждого текСтрока из Тз Цикл
		
		СтруктураПоиска = Новый Структура("РемонтыОборудования_ID, ID, Номенклатура, ХарактеристикаНоменклатуры", РемонтыОборудования_ID, ID, текСтрока.Номенклатура, текСтрока.Характеристика);
		
		НайС = Объект[ИмяТЧ].НайтиСтроки(СтруктураПоиска);
		КоэфУпаковкиВыбр = ?(ЗначениеЗаполнено(текСтрока.Упаковка), текСтрока.Упаковка.Коэффициент, 1);
		Если НайС.Количество() = 0 Тогда
			нс = Объект[ИмяТЧ].Добавить();
			ЗаполнитьЗначенияСвойств(нс, текСтрока);
			нс[ИмяРеквизита] = текСтрока.Номенклатура;
			
			нс.ЕдиницаИзмерения = текСтрока.Упаковка;
			нс.Количество = текСтрока.КоличествоУпаковок * ?(ЗначениеЗаполнено(нс.Единицаизмерения), 1, КоэфУпаковкиВыбр);
			
			нс.КоличествоЕдиниц = нс.Количество * КоэфУпаковкиВыбр;
			
			нс.ID = ID;
			нс.РемонтыОборудования_ID = РемонтыОборудования_ID;
			нс.ХарактеристикаНоменклатуры = текСтрока.Характеристика;
			
			
		Иначе
			
			нс = НайС[0];
			
			КоэфУпаковкиСтар = ?(ЗначениеЗаполнено(нс.ЕдиницаИзмерения), нс.ЕдиницаИзмерения.Коэффициент, 1);
			КоличествоЕдиниц = (нс.Количество*КоэфУпаковкиСтар + текСтрока.КоличествоУпаковок * КоэфУпаковкиВыбр);
			нс.Количество = КоличествоЕдиниц / КоэфУпаковкиВыбр;
			нс.ЕдиницаИзмерения = текСтрока.Упаковка;
			
			нс.КоличествоЕдиниц = КоличествоЕдиниц;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИсполнителейПоБригадам(Адрес)
	
	Если Адрес = Неопределено Тогда возврат; КонецЕсли;
	
	тз = ПолучитьИзВременногоХранилища(Адрес);
	
	стрОтбора = Новый Структура("РемонтыОборудования_ID, ID");	
	Для каждого текСтрока из Тз Цикл
		ЗаполнитьЗначенияСвойств(стрОтбора, текСтрока);
		НайС = Объект.ТрудовыеЗатраты.НайтиСтроки(стрОтбора);
		
		Для каждого ТезЗапись из НайС Цикл
			Объект.ТрудовыеЗатраты.Удалить(ТезЗапись);
			Модифицированность = Истина;
		КонецЦикла;
		
	КонецЦикла;	
	
	Для каждого текСтрока из Тз Цикл
		нс = Объект.ТрудовыеЗатраты.Добавить();
		ЗаполнитьЗначенияСвойств(нс, текСтрока); 
		Если ЗначениеЗаполнено(нс.ВремяРаботы) Тогда
			 нс.ВремяРаботыТекст = СформироватьПродолжительность(нс.ВремяРаботы);
		Иначе 
			нс.ВремяРаботы = нс.ДатаОкончания - нс.ДатаНачала;
			нс.ВремяРаботыТекст = СформироватьПродолжительность(нс.ВремяРаботы);
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры 

&НаСервереБезКонтекста 
Функция ВидНоменклатуры(Номенклатура)
	Возврат Номенклатура.ВидНоменклатуры;
КонецФункции

&НаСервере
Процедура ЗаполнитьСтоимостиПоТарифнойСтавкеСотрудникаНаСервере()
	
	МассивСотрудников = Новый Массив;
	Для Каждого Строка Из Объект.ТрудовыеЗатраты Цикл
		Если МассивСотрудников.Найти(Строка.Сотрудник) = Неопределено Тогда
			МассивСотрудников.Добавить(Строка.Сотрудник);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТ_Трудозатраты.ID,
	|	ВТ_Трудозатраты.Сотрудник,
	|	ВТ_Трудозатраты.ДатаНачала,
	|	ВТ_Трудозатраты.ДатаОкончания,
	|	ВТ_Трудозатраты.ВремяРаботы,
	|	ВТ_Трудозатраты.РемонтыОборудования_ID КАК РемонтыОборудования_ID
	|ПОМЕСТИТЬ ВТ_Трудозатраты
	|ИЗ
	|	&ВТ_Трудозатраты КАК ВТ_Трудозатраты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РемонтыОборудования_ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Ремонты.ID КАК ID,
	|	ВТ_Ремонты.ДатаНачала,
	|	ВТ_Ремонты.ДатаОкончания
	|ПОМЕСТИТЬ ВТ_Ремонты
	|ИЗ
	|	&ВТ_Ремонты КАК ВТ_Ремонты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Трудозатраты.ID,
	|	ВТ_Трудозатраты.Сотрудник КАК Сотрудник,
	|	ВТ_Трудозатраты.ВремяРаботы,
	|	ВЫБОР
	|		КОГДА ВТ_Трудозатраты.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВТ_Ремонты.ДатаНачала
	|		ИНАЧЕ ВТ_Трудозатраты.ДатаНачала
	|	КОНЕЦ КАК ДатаНачала,
	|	ВЫБОР
	|		КОГДА ВТ_Трудозатраты.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВТ_Ремонты.ДатаОкончания
	|		ИНАЧЕ ВТ_Трудозатраты.ДатаОкончания
	|	КОНЕЦ КАК ДатаОкончания
	|ИЗ
	|	ВТ_Трудозатраты КАК ВТ_Трудозатраты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ремонты КАК ВТ_Ремонты
	|		ПО ВТ_Трудозатраты.РемонтыОборудования_ID = ВТ_Ремонты.ID
	|ГДЕ
	|	ВТ_Трудозатраты.Сотрудник <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И ВЫБОР
	|			КОГДА ВТ_Трудозатраты.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ВТ_Ремонты.ДатаНачала
	|			ИНАЧЕ ВТ_Трудозатраты.ДатаНачала
	|		КОНЕЦ <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ВЫБОР
	|			КОГДА ВТ_Трудозатраты.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ВТ_Ремонты.ДатаОкончания
	|			ИНАЧЕ ВТ_Трудозатраты.ДатаОкончания
	|		КОНЕЦ <> ДАТАВРЕМЯ(1, 1, 1)";
	
	Запрос.УстановитьПараметр("ВТ_Трудозатраты", Объект.ТрудовыеЗатраты.Выгрузить());
	Запрос.УстановитьПараметр("ВТ_Ремонты", Объект.РемонтыОборудования.Выгрузить());
	
	ТаблицаСДатами = Запрос.Выполнить().Выгрузить();
	
	ТаблицаСдатамиПомесяцам = ТаблицаСДатами.СкопироватьКолонки();
	ТаблицаСдатамиПомесяцам.Колонки.Добавить("НачалоМесяца", Новый ОписаниеТипов("Дата"));
	ТаблицаСдатамиПомесяцам.Колонки.Добавить("КонецМесяца", Новый ОписаниеТипов("Дата"));
	ТаблицаСдатамиПомесяцам.Колонки.Добавить("НачалоИнтервала", Новый ОписаниеТипов("Дата"));
	ТаблицаСдатамиПоМесяцам.Колонки.Добавить("КонецИнтервала", Новый ОписаниеТипов("Дата"));
	
	Для каждого СтрокаТаблицыСдатами из ТаблицаСДатами Цикл
		ТекНачалоМесяца = НачалоМесяца(СтрокаТаблицыСдатами.ДатаНачала);
		Пока ТекНачалоМесяца <= НачалоМесяца(СтрокаТаблицыСдатами.ДатаОкончания) Цикл
			НовСтр = ТаблицаСдатамиПомесяцам.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, СтрокаТаблицыСдатами);
			
			НовСтр.НачалоМесяца = ТекНачалоМесяца;
			НовСтр.КонецМесяца = КонецМесяца(ТекНачалоМесяца);
			НовСтр.НачалоИнтервала = Макс(НовСтр.НачалоМесяца, НовСтр.ДатаНачала);
			НовСтр.КонецИнтервала = Мин(НовСтр.КонецМесяца, НовСтр.ДатаОкончания);
			
			ТекНачалоМесяца = ДобавитьМесяц(ТекНачалоМесяца, 1);
		КонецЦикла;	
	КонецЦикла;
	
	// рассчет рабочего времени сотрудника в период ремонта за определенный месяц
	ТаблицаИнтервалов = ТаблицаСдатамиПоМесяцам.Скопировать();
	ТаблицаИнтервалов.Свернуть("Сотрудник, НачалоИнтервала, КонецИнтервала");
	ТаблицаИнтервалов.Колонки.НачалоИнтервала.Имя = "ДатаНачала";
	ТаблицаИнтервалов.Колонки.КонецИнтервала.Имя = "ДатаОкончания";
	
	ТаблицаИнтервалов = РассчитатьРабочееВремяСотрудникаПоТаблице(ТаблицаИнтервалов);
	ТаблицаСдатамиПомесяцам.Колонки.Добавить("РабочееВремяЗаИнтервал", Новый ОписаниеТипов("Число"));
	
	СтруктураПоиска = Новый Структура("Сотрудник, ДатаНачала, ДатаОкончания");
	Для каждого СтрокаТаблицыСДатами из ТаблицаСдатамиПомесяцам Цикл
		СтруктураПоиска.Сотрудник = СтрокаТаблицыСДатами.Сотрудник;
		СтруктураПоиска.ДатаНачала = СтрокаТаблицыСДатами.НачалоИнтервала;
		СтруктураПоиска.ДатаОкончания = СтрокаТаблицыСДатами.КонецИнтервала;
		СтрокиВремени = ТаблицаИнтервалов.НайтиСтроки(СтруктураПоиска);
		
		Если СтрокиВремени.Количество() > 0 Тогда
			СтрокаТаблицыСДатами.РабочееВремяЗаИнтервал = СтрокиВремени[0].ВремяРаботы;
		КонецЕсли;
	КонецЦикла;
	
	// рассчет рабочего времени сотрудника всего в месяце
	ТаблицаМесяцев = ТаблицаСдатамиПоМесяцам.Скопировать();
	ТаблицаМесяцев.Свернуть("Сотрудник, НачалоМесяца, КонецМесяца");
	ТаблицаМесяцев.Колонки.НачалоМесяца.Имя = "ДатаНачала";
	ТаблицаМесяцев.Колонки.КонецМесяца.Имя = "ДатаОкончания";
	
	ТаблицаМесяцев = РассчитатьРабочееВремяСотрудникаПоТаблице(ТаблицаМесяцев);
	ТаблицаСдатамиПоМесяцам.Колонки.Добавить("РабочееВремяЗаМесяц", Новый ОписаниеТипов("Число"));

	СтруктураПоиска = Новый Структура("Сотрудник, ДатаНачала, ДатаОкончания");
	Для каждого СтрокаТаблицыСДатами из ТаблицаСдатамиПомесяцам Цикл
		СтруктураПоиска.Сотрудник = СтрокаТаблицыСДатами.Сотрудник;
		СтруктураПоиска.ДатаНачала = СтрокаТаблицыСДатами.НачалоМесяца;
		СтруктураПоиска.ДатаОкончания = СтрокаТаблицыСДатами.КонецМесяца;
		СтрокиВремени = ТаблицаМесяцев.НайтиСтроки(СтруктураПоиска);
		
		Если СтрокиВремени.Количество() > 0 Тогда
			СтрокаТаблицыСДатами.РабочееВремяЗаМесяц = СтрокиВремени[0].ВремяРаботы;
		КонецЕсли;
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТ_Данные.ID,
	|	ВТ_Данные.Сотрудник,
	|	ВТ_Данные.ВремяРаботы,
	|	ВТ_Данные.ДатаНачала,
	|	ВТ_Данные.ДатаОкончания,
	|	ВТ_Данные.НачалоИнтервала,
	|	ВТ_Данные.КонецИнтервала,
	|	ВТ_Данные.НачалоМесяца,
	|	ВТ_Данные.КонецМесяца,
	|	ВТ_Данные.РабочееВремяЗаИнтервал,
	|	ВТ_Данные.РабочееВремяЗаМесяц
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	&ВТ_Данные КАК ВТ_Данные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.ID КАК ID,
	|	СУММА(ВТ_Данные.РабочееВремяЗаИнтервал) КАК РабочееВремяЗаРемонт
	|ПОМЕСТИТЬ ВТ_РабочееВремяЗаРемонт
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Данные.ID
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.ID,
	|	ВТ_Данные.Сотрудник,
	|	ВТ_Данные.ВремяРаботы,
	|	ВТ_Данные.ДатаНачала,
	|	ВТ_Данные.ДатаОкончания,
	|	ВТ_Данные.НачалоИнтервала,
	|	ВТ_Данные.КонецИнтервала,
	|	ВТ_Данные.НачалоМесяца,
	|	ВТ_Данные.КонецМесяца,
	|	ВТ_Данные.РабочееВремяЗаИнтервал,
	|	ВТ_Данные.РабочееВремяЗаМесяц,
	|	ЕСТЬNULL(ВТ_РабочееВремяЗаРемонт.РабочееВремяЗаРемонт, 0) КАК РабочееВремяЗаРемонт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_РабочееВремяЗаРемонт.РабочееВремяЗаРемонт, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВТ_Данные.РабочееВремяЗаИнтервал / ЕСТЬNULL(ВТ_РабочееВремяЗаРемонт.РабочееВремяЗаРемонт, 0)
	|	КОНЕЦ КАК ДоляИнтервалаВРемонте
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РабочееВремяЗаРемонт КАК ВТ_РабочееВремяЗаРемонт
	|		ПО ВТ_Данные.ID = ВТ_РабочееВремяЗаРемонт.ID";
	
	Запрос.УстановитьПараметр("ВТ_Данные", ТаблицаСдатамиПомесяцам);
	
	ТаблицаДляРасчетаСтавок = Запрос.Выполнить().Выгрузить();
	ТаблицаДляРасчетаСтавок.Индексы.Добавить("ID");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_ТекущиеТарифныеСтавкиСотрудников.Сотрудник,
	|	торо_ТекущиеТарифныеСтавкиСотрудников.Премия / 100 КАК Премия,
	|	торо_ТекущиеТарифныеСтавкиСотрудников.Оклад КАК Оклад
	|ИЗ
	|	РегистрСведений.торо_ТекущиеТарифныеСтавкиСотрудников КАК торо_ТекущиеТарифныеСтавкиСотрудников
	|ГДЕ
	|	торо_ТекущиеТарифныеСтавкиСотрудников.Организация = &Организация
	|	И торо_ТекущиеТарифныеСтавкиСотрудников.Сотрудник В(&Сотрудники)";
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Сотрудники", МассивСотрудников);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для каждого Строка Из Объект.ТрудовыеЗатраты Цикл
				
		ДанныеСотрудника = Результат.Найти(Строка.Сотрудник,"Сотрудник");
		Если ДанныеСотрудника <> Неопределено Тогда
			//Строка.СуммаКНачислению = (Строка.ВремяРаботы / 3600)* Строка.КТУ * ДанныеСотрудника.Премия * ДанныеСотрудника.ТарифнаяСтавка;
			
			ДанныеДляРасчетаСтавки = ТаблицаДляРасчетаСтавок.НайтиСтроки(Новый Структура("ID", Строка.ID));
			СуммаКНачислению = 0;
			
			Для каждого СтрокаДанныхЗаМесяц из ДанныеДляРасчетаСтавки Цикл
				ТарифнаяСтавка = ?(СтрокаДанныхЗаМесяц.РабочееВремяЗаМесяц = 0, 0, (ДанныеСотрудника.Оклад * 3600)/СтрокаДанныхЗаМесяц.РабочееВремяЗаМесяц);
				ЧастьСуммы = (Строка.ВремяРаботы / 3600)* Строка.КТУ * (1 + ДанныеСотрудника.Премия) * ТарифнаяСтавка * СтрокаДанныхЗаМесяц.ДоляИнтервалаВРемонте;
				СуммаКНачислению = СуммаКНачислению + ЧастьСуммы;
			КонецЦикла;
			
			Строка.СуммаКНачислению = СуммаКНачислению;
			
		Иначе
			Строка.СуммаКНачислению = 0;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РассчитатьРабочееВремяСотрудникаПоТаблице(ТаблицаПериодов)
	
	Если ТаблицаПериодов.Количество() = 0 Тогда
		ТаблицаПериодов.Колонки.Добавить("ВремяРаботы", Новый ОписаниеТипов("Число"));
		Возврат ТаблицаПериодов;
	КонецЕсли;
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	ЗапросГрафиков = Новый Запрос;
	ЗапросГрафиков.МенеджерВременныхТаблиц = МенеджерВТ;
	ЗапросГрафиков.Текст = 
	"ВЫБРАТЬ
	|	ВТ_ИсходныеДанные.Сотрудник,
	|	ВТ_ИсходныеДанные.ДатаНачала,
	|	ВТ_ИсходныеДанные.ДатаОкончания
	|ПОМЕСТИТЬ ВТ_ИсходныеДанные
	|ИЗ
	|	&ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикРаботыСотрудников.Период КАК Период,
	|	ГрафикРаботыСотрудников.Сотрудник КАК Сотрудник,
	|	ГрафикРаботыСотрудников.ГрафикРаботы,
	|	ГрафикРаботыСотрудников.ДействуетДо
	|ПОМЕСТИТЬ ВТ_ГрафикиРаботыСотрудников
	|ИЗ
	|	РегистрСведений.ГрафикРаботыСотрудников КАК ГрафикРаботыСотрудников
	|ГДЕ
	|	ГрафикРаботыСотрудников.Сотрудник В
	|			(ВЫБРАТЬ
	|				ВТ_ИсходныеДанные.Сотрудник
	|			ИЗ
	|				ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИсходныеДанные.Сотрудник КАК Сотрудник,
	|	МАКСИМУМ(ВТ_ГрафикиРаботыСотрудников.Период) КАК ПериодГрафика,
	|	ВТ_ИсходныеДанные.ДатаНачала,
	|	ВТ_ИсходныеДанные.ДатаОкончания
	|ПОМЕСТИТЬ ВТ_ПериодыГрафиковНаНачалоРемонта
	|ИЗ
	|	ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ГрафикиРаботыСотрудников КАК ВТ_ГрафикиРаботыСотрудников
	|		ПО ВТ_ИсходныеДанные.Сотрудник = ВТ_ГрафикиРаботыСотрудников.Сотрудник
	|			И ВТ_ИсходныеДанные.ДатаНачала >= ВТ_ГрафикиРаботыСотрудников.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ИсходныеДанные.Сотрудник,
	|	ВТ_ИсходныеДанные.ДатаНачала,
	|	ВТ_ИсходныеДанные.ДатаОкончания
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	ПериодГрафика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПериодыГрафиковНаНачалоРемонта.Сотрудник,
	|	ВТ_ПериодыГрафиковНаНачалоРемонта.ДатаНачала,
	|	ВТ_ПериодыГрафиковНаНачалоРемонта.ДатаОкончания,
	|	ВТ_ГрафикиРаботыСотрудников.ГрафикРаботы КАК ГрафикРаботы,
	|	ВТ_ПериодыГрафиковНаНачалоРемонта.ДатаНачала КАК НачалоИнтервала,
	|	ВЫБОР
	|		КОГДА ВТ_ГрафикиРаботыСотрудников.ДействуетДо = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ ВТ_ГрафикиРаботыСотрудников.ДействуетДо > ВТ_ПериодыГрафиковНаНачалоРемонта.ДатаОкончания
	|			ТОГДА ВТ_ПериодыГрафиковНаНачалоРемонта.ДатаОкончания
	|		ИНАЧЕ ВТ_ГрафикиРаботыСотрудников.ДействуетДо
	|	КОНЕЦ КАК КонецИнтервала
	|ПОМЕСТИТЬ ВТ_ПериодыДействияГрафиков
	|ИЗ
	|	ВТ_ПериодыГрафиковНаНачалоРемонта КАК ВТ_ПериодыГрафиковНаНачалоРемонта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ГрафикиРаботыСотрудников КАК ВТ_ГрафикиРаботыСотрудников
	|		ПО ВТ_ПериодыГрафиковНаНачалоРемонта.Сотрудник = ВТ_ГрафикиРаботыСотрудников.Сотрудник
	|			И ВТ_ПериодыГрафиковНаНачалоРемонта.ПериодГрафика = ВТ_ГрафикиРаботыСотрудников.Период
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ИсходныеДанные.Сотрудник,
	|	ВТ_ИсходныеДанные.ДатаНачала,
	|	ВТ_ИсходныеДанные.ДатаОкончания,
	|	ВТ_ГрафикиРаботыСотрудников.ГрафикРаботы,
	|	ВТ_ГрафикиРаботыСотрудников.Период,
	|	ВЫБОР
	|		КОГДА ВТ_ГрафикиРаботыСотрудников.ДействуетДо = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ ВТ_ГрафикиРаботыСотрудников.ДействуетДо > ВТ_ИсходныеДанные.ДатаОкончания
	|			ТОГДА ВТ_ИсходныеДанные.ДатаОкончания
	|		ИНАЧЕ ВТ_ГрафикиРаботыСотрудников.ДействуетДо
	|	КОНЕЦ
	|ИЗ
	|	ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ГрафикиРаботыСотрудников КАК ВТ_ГрафикиРаботыСотрудников
	|		ПО ВТ_ИсходныеДанные.Сотрудник = ВТ_ГрафикиРаботыСотрудников.Сотрудник
	|			И (ВТ_ГрафикиРаботыСотрудников.Период > ВТ_ИсходныеДанные.ДатаНачала)
	|			И (ВТ_ГрафикиРаботыСотрудников.Период < ВТ_ИсходныеДанные.ДатаОкончания)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ГрафикРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПериодыДействияГрафиков.Сотрудник,
	|	ВТ_ПериодыДействияГрафиков.ДатаНачала,
	|	ВТ_ПериодыДействияГрафиков.ДатаОкончания,
	|	ВТ_ПериодыДействияГрафиков.ГрафикРаботы,
	|	ВТ_ПериодыДействияГрафиков.НачалоИнтервала,
	|	ВТ_ПериодыДействияГрафиков.КонецИнтервала
	|ИЗ
	|	ВТ_ПериодыДействияГрафиков КАК ВТ_ПериодыДействияГрафиков";
	
	ЗапросГрафиков.УстановитьПараметр("ВТ_ИсходныеДанные", ТаблицаПериодов);
	
	ТабГрафиков = ЗапросГрафиков.Выполнить().Выгрузить();
	МассивГрафиков = ТабГрафиков.ВыгрузитьКолонку("ГрафикРаботы");
	
	МинДата = ТаблицаПериодов[0].ДатаНачала;
	МаксДата = ТаблицаПериодов[0].ДатаОкончания;
	
	Для каждого Строка из ТаблицаПериодов Цикл
		Если Строка.ДатаНачала < МинДата Или Не ЗначениеЗаполнено(МинДата) Тогда
			МинДата = Строка.ДатаНачала;
		КонецЕсли;
		Если Строка.ДатаОкончания > МаксДата Тогда
			МаксДата = Строка.ДатаОкончания;
		КонецЕсли;
	КонецЦикла;
	
	МинДата = НачалоДня(МинДата);
    МаксДата = КонецДня(МаксДата);
	
	КалендарныеГрафики.СоздатьВТРасписанияРаботыНаПериод(МенеджерВТ, МассивГрафиков, МинДата, МаксДата);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВТ_ПериодыДействияГрафиков.Сотрудник,
	|	ВТ_ПериодыДействияГрафиков.ДатаНачала,
	|	ВТ_ПериодыДействияГрафиков.ДатаОкончания,
	|	ВТ_ПериодыДействияГрафиков.ГрафикРаботы,
	|	ВТ_ПериодыДействияГрафиков.НачалоИнтервала,
	|	ВТ_ПериодыДействияГрафиков.КонецИнтервала,
	|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ВТ_ПериодыДействияГрафиков.НачалоИнтервала, ДЕНЬ), ВТ_ПериодыДействияГрафиков.НачалоИнтервала, СЕКУНДА) КАК НачалоИнтервалаСек,
	|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ВТ_ПериодыДействияГрафиков.КонецИнтервала, ДЕНЬ), ВТ_ПериодыДействияГрафиков.КонецИнтервала, СЕКУНДА) КАК КонецИнтервалаСек,
	|	ВТРасписанияРаботы.ДатаГрафика,
	|	РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), ВТРасписанияРаботы.ВремяНачала, СЕКУНДА) КАК ВремяНачалаСек,
	|	РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), ВТРасписанияРаботы.ВремяОкончания, СЕКУНДА) КАК ВремяОкончанияСек
	|ПОМЕСТИТЬ ВТ_ПериодыДействияГрафиковПоДням
	|ИЗ
	|	ВТ_ПериодыДействияГрафиков КАК ВТ_ПериодыДействияГрафиков
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРасписанияРаботы КАК ВТРасписанияРаботы
	|		ПО ВТ_ПериодыДействияГрафиков.ГрафикРаботы = ВТРасписанияРаботы.ГрафикРаботы
	|			И (ВТРасписанияРаботы.ДатаГрафика МЕЖДУ НАЧАЛОПЕРИОДА(ВТ_ПериодыДействияГрафиков.НачалоИнтервала, ДЕНЬ) И КОНЕЦПЕРИОДА(ВТ_ПериодыДействияГрафиков.КонецИнтервала, ДЕНЬ))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПериодыДействияГрафиковПоДням.Сотрудник,
	|	ВТ_ПериодыДействияГрафиковПоДням.ДатаНачала,
	|	ВТ_ПериодыДействияГрафиковПоДням.ДатаОкончания,
	|	ВТ_ПериодыДействияГрафиковПоДням.ГрафикРаботы,
	|	ВТ_ПериодыДействияГрафиковПоДням.НачалоИнтервала,
	|	ВТ_ПериодыДействияГрафиковПоДням.КонецИнтервала,
	|	ВТ_ПериодыДействияГрафиковПоДням.ДатаГрафика,
	|	ВЫБОР
	|		КОГДА ВТ_ПериодыДействияГрафиковПоДням.ДатаГрафика = НАЧАЛОПЕРИОДА(ВТ_ПериодыДействияГрафиковПоДням.НачалоИнтервала, ДЕНЬ)
	|				И ВТ_ПериодыДействияГрафиковПоДням.НачалоИнтервалаСек > ВТ_ПериодыДействияГрафиковПоДням.ВремяНачалаСек
	|			ТОГДА ВТ_ПериодыДействияГрафиковПоДням.НачалоИнтервалаСек
	|		КОГДА ВТ_ПериодыДействияГрафиковПоДням.ДатаГрафика = НАЧАЛОПЕРИОДА(ВТ_ПериодыДействияГрафиковПоДням.КонецИнтервала, ДЕНЬ)
	|			И ВТ_ПериодыДействияГрафиковПоДням.КонецИнтервалаСек < ВТ_ПериодыДействияГрафиковПоДням.ВремяНачалаСек
	|			ТОГДА ВТ_ПериодыДействияГрафиковПоДням.КонецИнтервалаСек
	|		ИНАЧЕ ВТ_ПериодыДействияГрафиковПоДням.ВремяНачалаСек
	|	КОНЕЦ КАК ВремяНачалаСек,
	|	ВЫБОР
	|		КОГДА ВТ_ПериодыДействияГрафиковПоДням.ДатаГрафика = НАЧАЛОПЕРИОДА(ВТ_ПериодыДействияГрафиковПоДням.КонецИнтервала, ДЕНЬ)
	|				И ВТ_ПериодыДействияГрафиковПоДням.КонецИнтервалаСек < ВТ_ПериодыДействияГрафиковПоДням.ВремяОкончанияСек
	|			ТОГДА ВТ_ПериодыДействияГрафиковПоДням.КонецИнтервалаСек
	|		КОГДА ВТ_ПериодыДействияГрафиковПоДням.ДатаГрафика = НАЧАЛОПЕРИОДА(ВТ_ПериодыДействияГрафиковПоДням.НачалоИнтервала, ДЕНЬ)
	|				И ВТ_ПериодыДействияГрафиковПоДням.НачалоИнтервалаСек > ВТ_ПериодыДействияГрафиковПоДням.ВремяОкончанияСек
	|			ТОГДА ВТ_ПериодыДействияГрафиковПоДням.НачалоИнтервалаСек
	|		ИНАЧЕ ВТ_ПериодыДействияГрафиковПоДням.ВремяОкончанияСек
	|	КОНЕЦ КАК ВремяОкончанияСек
	|ПОМЕСТИТЬ ВТ_ПериодыДействияГрафиковПоДням2
	|ИЗ
	|	ВТ_ПериодыДействияГрафиковПоДням КАК ВТ_ПериодыДействияГрафиковПоДням
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПериодыДействияГрафиковПоДням2.Сотрудник,
	|	ВТ_ПериодыДействияГрафиковПоДням2.ДатаНачала,
	|	ВТ_ПериодыДействияГрафиковПоДням2.ДатаОкончания,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_ПериодыДействияГрафиковПоДням2.ВремяОкончанияСек = 86399
	|				ТОГДА 86400
	|			ИНАЧЕ ВТ_ПериодыДействияГрафиковПоДням2.ВремяОкончанияСек
	|		КОНЕЦ - ВТ_ПериодыДействияГрафиковПоДням2.ВремяНачалаСек) КАК ВремяРаботы
	|ИЗ
	|	ВТ_ПериодыДействияГрафиковПоДням2 КАК ВТ_ПериодыДействияГрафиковПоДням2
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПериодыДействияГрафиковПоДням2.Сотрудник,
	|	ВТ_ПериодыДействияГрафиковПоДням2.ДатаНачала,
	|	ВТ_ПериодыДействияГрафиковПоДням2.ДатаОкончания";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСтоимостиПоСтоимостиЧасаКвалификацииНаСервере()
	
	// Кнопка может быть нажата и для незаписанного документа.
	ТаблицаДатРемонтов = Новый ТаблицаЗначений;
	ТаблицаДатРемонтов.Колонки.Добавить("Квалификация", Новый ОписаниеТипов("СправочникСсылка.торо_КвалификацииРемонтногоПерсонала"));
	КвалификаторСтроки = Новый КвалификаторыСтроки(36);
	ТаблицаДатРемонтов.Колонки.Добавить("ID", Новый ОписаниеТипов("Строка",,,,КвалификаторСтроки));
	ТаблицаДатРемонтов.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	Для каждого Строка Из Объект.ТрудовыеЗатраты Цикл
		НоваяСтрока = ТаблицаДатРемонтов.Добавить();
		НоваяСтрока.Квалификация = Строка.Квалификация;
		НоваяСтрока.ID = Строка.ID;
		ПоискДаты = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", Строка.РемонтыОборудования_ID));
		Если ПоискДаты.Количество() > 0 Тогда
			НоваяСтрока.Дата = ПоискДаты[0].ДатаНачала;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.Дата) Тогда
			НоваяСтрока.Дата = Объект.Дата;
		КонецЕсли; 
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаДатРемонтов.Квалификация КАК Квалификация,
	               |	ТаблицаДатРемонтов.ID КАК ID,
	               |	ТаблицаДатРемонтов.Дата КАК Дата
	               |ПОМЕСТИТЬ ВТ_ДатыРемонта
	               |ИЗ
	               |	&ТаблицаДатРемонтов КАК ТаблицаДатРемонтов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДатыРемонта.Квалификация КАК Квалификация,
	               |	МАКСИМУМ(торо_СтоимостьЧасаКвалификации.Период) КАК Период,
	               |	ВТ_ДатыРемонта.ID КАК ID,
	               |	ВТ_ДатыРемонта.Дата КАК Дата
	               |ПОМЕСТИТЬ ВТ_МаксДатыСтоимостейКвалификации
	               |ИЗ
	               |	ВТ_ДатыРемонта КАК ВТ_ДатыРемонта
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_СтоимостьЧасаКвалификации КАК торо_СтоимостьЧасаКвалификации
	               |		ПО ВТ_ДатыРемонта.Квалификация = торо_СтоимостьЧасаКвалификации.Квалификация
	               |			И ВТ_ДатыРемонта.Дата > торо_СтоимостьЧасаКвалификации.Период
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ДатыРемонта.Квалификация,
	               |	ВТ_ДатыРемонта.ID,
	               |	ВТ_ДатыРемонта.Дата
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	торо_СтоимостьЧасаКвалификации.Квалификация КАК Квалификация,
	               |	торо_СтоимостьЧасаКвалификации.Валюта КАК Валюта,
	               |	торо_СтоимостьЧасаКвалификации.Стоимость КАК Стоимость,
	               |	ВТ_МаксДатыСтоимостейКвалификации.ID КАК ID,
	               |	ВТ_МаксДатыСтоимостейКвалификации.Дата КАК Дата
	               |ПОМЕСТИТЬ ВТ_СтоимостиНаДату
	               |ИЗ
	               |	ВТ_МаксДатыСтоимостейКвалификации КАК ВТ_МаксДатыСтоимостейКвалификации
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_СтоимостьЧасаКвалификации КАК торо_СтоимостьЧасаКвалификации
	               |		ПО ВТ_МаксДатыСтоимостейКвалификации.Квалификация = торо_СтоимостьЧасаКвалификации.Квалификация
	               |			И ВТ_МаксДатыСтоимостейКвалификации.Период = торо_СтоимостьЧасаКвалификации.Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(КурсыВалют.Период) КАК Период,
	               |	КурсыВалют.Валюта КАК Валюта,
	               |	ВТ_СтоимостиНаДату.ID КАК ID,
	               |	ВТ_СтоимостиНаДату.Квалификация КАК Квалификация,
	               |	ВТ_СтоимостиНаДату.Стоимость КАК Стоимость
	               |ПОМЕСТИТЬ ВТ_МаксДатыКурсов
	               |ИЗ
	               |	ВТ_СтоимостиНаДату КАК ВТ_СтоимостиНаДату
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	               |		ПО ВТ_СтоимостиНаДату.Валюта = КурсыВалют.Валюта
	               |			И ВТ_СтоимостиНаДату.Дата > КурсыВалют.Период
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КурсыВалют.Валюта,
	               |	ВТ_СтоимостиНаДату.ID,
	               |	ВТ_СтоимостиНаДату.Квалификация,
	               |	ВТ_СтоимостиНаДату.Стоимость
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_МаксДатыКурсов.ID КАК ID,
	               |	ВТ_МаксДатыКурсов.Квалификация КАК Квалификация,
	               |	ВТ_МаксДатыКурсов.Стоимость * ЕСТЬNULL(КурсыВалют.Курс, 1) КАК Стоимость
	               |ИЗ
	               |	ВТ_МаксДатыКурсов КАК ВТ_МаксДатыКурсов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	               |		ПО ВТ_МаксДатыКурсов.Валюта = КурсыВалют.Валюта
	               |			И ВТ_МаксДатыКурсов.Период = КурсыВалют.Период";
	
	Запрос.УстановитьПараметр("ТаблицаДатРемонтов", ТаблицаДатРемонтов);
	СтоимостиКвалификаций = Запрос.Выполнить().Выгрузить();	
	
	Для каждого Строка Из Объект.ТрудовыеЗатраты Цикл
		
		СтруктураПараметров = Новый Структура("Квалификация, ID", Строка.Квалификация, Строка.ID);
		ДанныеПоКвалификации = СтоимостиКвалификаций.НайтиСтроки(СтруктураПараметров); 
		Если ДанныеПоКвалификации.Количество() > 0 Тогда
			Строка.СуммаКНачислению = (Строка.ВремяРаботы / 3600)* Строка.КТУ * ДанныеПоКвалификации[0].Стоимость;
		Иначе
			Строка.СуммаКНачислению = 0;
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтоимостиПоРасценкеТехОперацииНаСервере()
	
	МассивID = Новый Массив;
	Для Каждого Строка Из Объект.ТрудовыеЗатраты Цикл
		Если МассивID.Найти(Строка.ID) = Неопределено Тогда 
			МассивID.Добавить(Строка.ID);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ * ПОМЕСТИТЬ ТабРемРабот ИЗ &ТабРемРабот КАК ТабРемРабот ГДЕ ТабРемРабот.ID В (&МассивID);
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТабРемРабот.ID КАК ID,
	|	1 КАК Количество,
	|	КурсыВалютСрезПоследних.Курс * ТабРемРабот.РемонтнаяРабота.Расценка КАК Стоимость
	|ИЗ
	|	ТабРемРабот КАК ТабРемРабот
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних КАК КурсыВалютСрезПоследних
	|		ПО ТабРемРабот.РемонтнаяРабота.Валюта = КурсыВалютСрезПоследних.Валюта";
	
	Запрос.УстановитьПараметр("МассивID", МассивID);
	Запрос.УстановитьПараметр("ТабРемРабот", Объект.РемонтныеРаботы.Выгрузить());
	РасценкаОпераций = Запрос.Выполнить().Выгрузить();	
	
	Для каждого Строка Из Объект.ТрудовыеЗатраты Цикл
		ДанныеПоОперации = РасценкаОпераций.Найти(Строка.ID,"ID");
		Если ДанныеПоОперации <> Неопределено Тогда
			Строка.СуммаКНачислению = Строка.КТУ * ДанныеПоОперации.Стоимость * ДанныеПоОперации.Количество;
		Иначе
			Строка.СуммаКНачислению = 0;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаМатериалов(ВыбранноеЗначение, ЗаполнитьАналоги = Истина)
	РемОборудования = ВыбранноеЗначение.СтрокаРемонтовОборудования.ID;
	НайденныеСтрокиМатериала = Объект.МатериальныеЗатраты.НайтиСтроки( Новый Структура("РемонтыОборудования_ID", РемОборудования)); 
	НайденныеСтрокиРемонта = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", РемОборудования));
	Если НайденныеСтрокиРемонта.Количество() <> 0 И НайденныеСтрокиМатериала.Количество() = 0 Тогда
		НомерСтроки = НайденныеСтрокиРемонта[0].ПолучитьИдентификатор();
		ЗаполнитьМатериалыПоНормамНаСервере(Неопределено, НомерСтроки, ЗаполнитьАналоги);
	КонецЕсли;  
КонецПроцедуры

&НаКлиенте
Процедура УстановкаМатериаловПоОснованию(ВыбранноеЗначение, ЗаполнитьАналоги = Истина)
	РемОборудования = ВыбранноеЗначение.СтрокаРемонтовОборудования.ID;
	НайденныеСтрокиМатериала = Объект.МатериальныеЗатраты.НайтиСтроки( Новый Структура("РемонтыОборудования_ID", РемОборудования)); 
	НайденныеСтрокиРемонта = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", РемОборудования));
	Если НайденныеСтрокиРемонта.Количество() <> 0 Тогда
		НомерСтроки = НайденныеСтрокиРемонта[0].ПолучитьИдентификатор();
		ЗаполнитьМатериалыПоОснованиюНаСервере(Неопределено, НомерСтроки, ЗаполнитьАналоги);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаИсполнителей(ВыбранноеЗначение)
	РемОборудования = ВыбранноеЗначение.СтрокаРемонтовОборудования.ID;
	НайденныеСтрокиРемонта = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", РемОборудования ));	
	НайденныеСтрокиТрудозатрат = Объект.ТрудовыеЗатраты.НайтиСтроки( Новый Структура("РемонтыОборудования_ID", РемОборудования ));
	Если НайденныеСтрокиРемонта.Количество() <> 0 И НайденныеСтрокиТрудозатрат.Количество() = 0 Тогда
		НомерСтроки = НайденныеСтрокиРемонта[0].ПолучитьИдентификатор();
		ЗаполнитьИсполнителейПоНормамНаСервере(Неопределено, НомерСтроки);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Функция ЗаполнитьДанныеНаОснованииППРВыделенныеСтроки()
	
	ВыбранноеЗначение = Новый Массив;
	
	Для Каждого СтрокаМассиваIDИзППР Из МассивIDИзППР Цикл
	
		СтруктураВыбора = Новый Структура;
		
		СтруктураВыбора.Вставить("ДокументОснование", ДокОснованиеППР);
		СтруктураВыбора.Вставить("СтрокаРемонтовОборудования", СтрокаМассиваIDИзППР.Значение.СтрокаРемонтовОборудования);
		СтруктураВыбора.Вставить("МассивСтрокРемонтныхРабот", СтрокаМассиваIDИзППР.Значение.МассивСтрокРемонтныхРабот);
		
		ВыбранноеЗначение.Добавить(СтруктураВыбора);
		
	КонецЦикла;
	
	Возврат ВыбранноеЗначение;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКонстантуКонтролироватьВремяРаботы()
	Возврат Константы.торо_КонтролироватьВремяРаботыСотрудниковВАктах.Получить();	
КонецФункции

&НаСервере
Процедура ЗаполнитьТабОперацийБезНаряда(ДокОснование, РемонтыОборудования_ID = "")
	
	Запрос = Новый Запрос;
		
	Если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтнаяРабота,
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.Родитель_ID,
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтыОборудования_ID,
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.ID,
		|	торо_ТехнологическиеОперации.РаботаПовышеннойОпасности КАК РаботаПовышеннойОпасности
		|ПОМЕСТИТЬ РемРаб
		|ИЗ
		|	Документ.торо_ЗаявкаНаРемонт.РемонтныеРаботы КАК торо_ЗаявкаНаРемонтРемонтныеРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ТехнологическиеОперации КАК торо_ТехнологическиеОперации
		|		ПО торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтнаяРабота = торо_ТехнологическиеОперации.Ссылка
		|ГДЕ
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.Ссылка = &Ссылка
		|	И ВЫРАЗИТЬ(торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтнаяРабота КАК Справочник.торо_ТехнологическиеОперации) ССЫЛКА Справочник.торо_ТехнологическиеОперации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РемРаб.РемонтнаяРабота,
		|	РемРаб.Родитель_ID,
		|	РемРаб.РемонтыОборудования_ID,
		|	РемРаб.ID,
		|	РемРаб.РаботаПОвышеннойОпасности,
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.Ссылка
		|ПОМЕСТИТЬ НарядыНаРемРаб
		|ИЗ
		|	РемРаб КАК РемРаб
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтныеРаботы КАК торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы
		|		ПО РемРаб.РемонтыОборудования_ID = торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.РемонтыОборудования_ID
		|			И РемРаб.ID = торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.ID
		|ГДЕ
		|	РемРаб.РаботаПОвышеннойОпасности = ИСТИНА
		|	И торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.Ссылка.Проведен
		|	И НЕ торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.Ссылка.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РемРаб.РемонтнаяРабота,
		|	РемРаб.РемонтыОборудования_ID,
		|	РемРаб.РаботаПОвышеннойОпасности
		|ПОМЕСТИТЬ РаботыПовышеннойОпасности
		|ИЗ
		|	РемРаб КАК РемРаб
		|ГДЕ
		|	РемРаб.РаботаПОвышеннойОпасности = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИСТИНА КАК ВводитьНаряд,
		|	торо_ЗаявкаНаРемонтРемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта,
		|	торо_ЗаявкаНаРемонтРемонтыОборудования.ВидРемонтныхРабот КАК ВидРемонта,
		|	РаботыПовышеннойОпасности.РемонтнаяРабота КАК РемонтнаяРабота,
		|	торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаНачала КАК ДатаНачалаРемонта,
		|	торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаОкончания КАК ДатаОкончанияРемонта,
		|	торо_ЗаявкаНаРемонтРемонтыОборудования.ID КАК ID
		|ИЗ
		|	Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК торо_ЗаявкаНаРемонтРемонтыОборудования
		|		ЛЕВОЕ СОЕДИНЕНИЕ НарядыНаРемРаб КАК НарядыНаРемРаб
		|		ПО (НарядыНаРемРаб.РемонтыОборудования_ID = торо_ЗаявкаНаРемонтРемонтыОборудования.ID)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаботыПовышеннойОпасности КАК РаботыПовышеннойОпасности
		|		ПО торо_ЗаявкаНаРемонтРемонтыОборудования.ID = РаботыПовышеннойОпасности.РемонтыОборудования_ID
		|ГДЕ
		|	НарядыНаРемРаб.Ссылка ЕСТЬ NULL 
		|	И торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка = &Ссылка";
		
		Если РемонтыОборудования_ID <> "" Тогда
			Запрос.Текст = Запрос.Текст + " И торо_ЗаявкаНаРемонтРемонтыОборудования.ID = &РемонтыОборудования_ID";
			Запрос.УстановитьПараметр("РемонтыОборудования_ID", РемонтыОборудования_ID);
		КонецЕсли; 
		
	ИначеЕсли ТипЗнч(ДокОснование) = Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот") Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ИСТИНА КАК ВводитьНаряд,
		               |	торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.ОбъектРемонта КАК ОбъектРемонта,
		               |	торо_ВидРемонтаПриВводеНаОснованииВнешнихОснований.Значение КАК ВидРемонта,
		               |	торо_ВнешнееОснованиеДляРаботРемонтныеРаботы.РемонтнаяРабота КАК РемонтнаяРабота,
		               |	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ДатаНачалаРемонта,
		               |	торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.ПлановаяДатаРемонта КАК ДатаОкончанияРемонта,
		               |	торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.ID КАК ID
		               |ПОМЕСТИТЬ ВТ_ВнешниеОснованияОпасныеРаботы
		               |ИЗ
		               |	Документ.торо_ВнешнееОснованиеДляРабот.ОбследованноеОборудование КАК торо_ВнешнееОснованиеДляРаботОбследованноеОборудование
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ВнешнееОснованиеДляРабот.РемонтныеРаботы КАК торо_ВнешнееОснованиеДляРаботРемонтныеРаботы
		               |		ПО торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.Ссылка = торо_ВнешнееОснованиеДляРаботРемонтныеРаботы.Ссылка
		               |			И торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.ID = торо_ВнешнееОснованиеДляРаботРемонтныеРаботы.Предписание_ID,
		               |	Константа.торо_ВидРемонтаПриВводеНаОснованииВнешнихОснований КАК торо_ВидРемонтаПриВводеНаОснованииВнешнихОснований
		               |ГДЕ
		               |	торо_ВнешнееОснованиеДляРаботРемонтныеРаботы.РемонтнаяРабота.РаботаПовышеннойОпасности = ИСТИНА
		               |	И торо_ВнешнееОснованиеДляРаботРемонтныеРаботы.Ссылка = &Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.Ссылка КАК Ссылка,
		               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.НомерСтроки КАК НомерСтроки,
		               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.ID КАК ID,
		               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.РемонтнаяРабота КАК РемонтнаяРабота,
		               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.Родитель_ID КАК Родитель_ID,
		               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.Количество КАК Количество,
		               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.Картинка КАК Картинка
		               |ПОМЕСТИТЬ ВТ_Наряды
		               |ИЗ
		               |	Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтныеРаботы КАК торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы
		               |ГДЕ
		               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.Ссылка.Проведен = ИСТИНА
		               |	И торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.РемонтыОборудования_ID В
		               |			(ВЫБРАТЬ
		               |				ВТ_ВнешниеОснованияОпасныеРаботы.ID КАК ID
		               |			ИЗ
		               |				ВТ_ВнешниеОснованияОпасныеРаботы КАК ВТ_ВнешниеОснованияОпасныеРаботы)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ВнешниеОснованияОпасныеРаботы.ВводитьНаряд КАК ВводитьНаряд,
		               |	ВТ_ВнешниеОснованияОпасныеРаботы.ОбъектРемонта КАК ОбъектРемонта,
		               |	ВТ_ВнешниеОснованияОпасныеРаботы.ВидРемонта КАК ВидРемонта,
		               |	ВТ_ВнешниеОснованияОпасныеРаботы.РемонтнаяРабота КАК РемонтнаяРабота,
		               |	ВТ_ВнешниеОснованияОпасныеРаботы.ДатаНачалаРемонта КАК ДатаНачалаРемонта,
		               |	ВТ_ВнешниеОснованияОпасныеРаботы.ДатаОкончанияРемонта КАК ДатаОкончанияРемонта,
		               |	ВТ_ВнешниеОснованияОпасныеРаботы.ID КАК ID
		               |ИЗ
		               |	ВТ_ВнешниеОснованияОпасныеРаботы КАК ВТ_ВнешниеОснованияОпасныеРаботы
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Наряды КАК ВТ_Наряды
		               |		ПО ВТ_ВнешниеОснованияОпасныеРаботы.РемонтнаяРабота = ВТ_Наряды.РемонтнаяРабота
		               |ГДЕ
		               |	ВТ_Наряды.Ссылка ЕСТЬ NULL";
		Если РемонтыОборудования_ID <> "" Тогда
			Запрос.Текст = Запрос.Текст + " И ВТ_ВнешниеОснованияОпасныеРаботы.ID = &РемонтыОборудования_ID";
			Запрос.УстановитьПараметр("РемонтыОборудования_ID", РемонтыОборудования_ID);
		КонецЕсли;		
	ИначеЕсли ТипЗнч(ДокОснование) = Тип("ДокументСсылка.торо_ВыявленныеДефекты") Тогда
		
		ВТ_ОпасныеОперации = Новый ТаблицаЗначений();
		ВТ_ОпасныеОперации.Колонки.Добавить("ОбъектРемонта", Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта"));
		ВТ_ОпасныеОперации.Колонки.Добавить("ВидРемонта", Новый ОписаниеТипов("СправочникСсылка.торо_ВидыРемонтов"));
		ВТ_ОпасныеОперации.Колонки.Добавить("ДатаНачалаРемонта", Новый ОписаниеТипов("Дата"));
		ВТ_ОпасныеОперации.Колонки.Добавить("ДатаОкончанияРемонта", Новый ОписаниеТипов("Дата"));
		ВТ_ОпасныеОперации.Колонки.Добавить("ID", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(36)));
		ВТ_ОпасныеОперации.Колонки.Добавить("РемонтнаяРабота", Новый ОписаниеТипов("СправочникСсылка.торо_ТехнологическиеОперации"));
		ВТ_ОпасныеОперации.Колонки.Добавить("ВводитьНаряд", Новый ОписаниеТипов("Булево"));
		
		ТабТехКарт = Новый ТаблицаЗначений;
		ТабТехКарт.Колонки.Добавить("ОбъектРемонта", Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта"));
		ТабТехКарт.Колонки.Добавить("ВидРемонта", Новый ОписаниеТипов("СправочникСсылка.торо_ВидыРемонтов"));
		ТабТехКарт.Колонки.Добавить("ДатаНачалаРемонта", Новый ОписаниеТипов("Дата"));
		ТабТехКарт.Колонки.Добавить("ДатаОкончанияРемонта", Новый ОписаниеТипов("Дата"));
		ТабТехКарт.Колонки.Добавить("ID", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(36)));
		ТабТехКарт.Колонки.Добавить("РемонтнаяРабота", Новый ОписаниеТипов("СправочникСсылка.торо_ИдентификаторыТехКарт"));
		ТабТехКарт.Колонки.Добавить("ВводитьНаряд", Новый ОписаниеТипов("Булево")) ; 
		
		Запрос.УстановитьПараметр("Дата", ДокОснование.ДатаОбнаружения);
		Запрос.УстановитьПараметр("Ссылка", ДокОснование);
		Запрос.Текст = "ВЫБРАТЬ
		               |	торо_ВыявленныеДефектыСписокДефектов.ОбъектРемонта КАК ОбъектРемонта,
		               |	торо_ВидРемонтаПриВводеНаОснованииВыявленныхДефектов.Значение КАК ВидРемонта,
		               |	торо_ВыявленныеДефектыСписокДефектов.ID КАК ID
		               |ПОМЕСТИТЬ ВТ_ОбъектыИВид
		               |ИЗ
		               |	Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефекты
		               |		ПО торо_ВыявленныеДефектыСписокДефектов.Ссылка = торо_ВыявленныеДефекты.Ссылка,
		               |	Константа.торо_ВидРемонтаПриВводеНаОснованииВыявленныхДефектов КАК торо_ВидРемонтаПриВводеНаОснованииВыявленныхДефектов
		               |ГДЕ
		               |	торо_ВыявленныеДефектыСписокДефектов.Ссылка = &Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	торо_НормативныеРемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта,
		               |	торо_НормативныеРемонтыОборудования.ВидРемонта КАК ВидРемонта,
		               |	торо_НормативныеРемонтыОборудования.НормативныйРемонт КАК НормативныйРемонт,
		               |	ВТ_ОбъектыИВид.ID КАК ID
		               |ПОМЕСТИТЬ ВТ_Нормативы
		               |ИЗ
		               |	РегистрСведений.торо_НормативныеРемонтыОборудования КАК торо_НормативныеРемонтыОборудования
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОбъектыИВид КАК ВТ_ОбъектыИВид
		               |		ПО торо_НормативныеРемонтыОборудования.ОбъектРемонта = ВТ_ОбъектыИВид.ОбъектРемонта
		               |			И торо_НормативныеРемонтыОборудования.ВидРемонта = ВТ_ОбъектыИВид.ВидРемонта
		               |ГДЕ
		               |	торо_НормативныеРемонтыОборудования.Приоритет = ИСТИНА
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_Нормативы.ОбъектРемонта КАК ОбъектРемонта,
		               |	ВТ_Нормативы.ВидРемонта КАК ВидРемонта,
		               |	ВТ_Нормативы.ID КАК ID,
		               |	торо_ВерсииТехКартСрезПоследних.ТехКарта КАК ТехКарта
		               |ПОМЕСТИТЬ ВТ_ВерсияТК
		               |ИЗ
		               |	ВТ_Нормативы КАК ВТ_Нормативы
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВерсииТехКарт.СрезПоследних(&Дата, ) КАК торо_ВерсииТехКартСрезПоследних
		               |		ПО ВТ_Нормативы.НормативныйРемонт = торо_ВерсииТехКартСрезПоследних.ИдентификаторТехКарты
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ИСТИНА КАК ВводитьНаряд,
		               |	ВТ_ВерсияТК.ОбъектРемонта КАК ОбъектРемонта,
		               |	ВТ_ВерсияТК.ВидРемонта КАК ВидРемонта,
		               |	торо_ТехКартыСписокОпераций.Операция КАК РемонтнаяРабота,
		               |	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ДатаНачалаРемонта,
		               |	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ДатаОкончанияРемонта,
		               |	ВТ_ВерсияТК.ID КАК ID
		               |ИЗ
		               |	Справочник.торо_ТехКарты.СписокОпераций КАК торо_ТехКартыСписокОпераций
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВерсияТК КАК ВТ_ВерсияТК
		               |		ПО (ВТ_ВерсияТК.ТехКарта = торо_ТехКартыСписокОпераций.Ссылка)
		               |ГДЕ
		               |	НЕ ВТ_ВерсияТК.ОбъектРемонта ЕСТЬ NULL
		               |	И НЕ ВТ_ВерсияТК.ВидРемонта ЕСТЬ NULL
		               |	И ВЫБОР
		               |			КОГДА ТИПЗНАЧЕНИЯ(торо_ТехКартыСписокОпераций.Операция) = ТИП(Справочник.торо_ТехнологическиеОперации)
		               |				ТОГДА торо_ТехКартыСписокОпераций.Операция.РаботаПовышеннойОпасности = ИСТИНА
		               |			ИНАЧЕ торо_ТехКартыСписокОпераций.Ссылка.СодержитРаботыПовышеннойОпасности = ИСТИНА
		               |		КОНЕЦ";
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Если ТипЗнч(Выборка.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда
				НС = ТабТехКарт.Добавить();
				ЗаполнитьЗначенияСвойств(НС, Выборка);						
			Иначе
				НС = ВТ_ОпасныеОперации.Добавить();
				ЗаполнитьЗначенияСвойств(НС, Выборка);
			КонецЕсли;
		КонецЦикла;
		
		КЦ = 0;
		Пока Истина Цикл
			ЗапросОпераций = Новый Запрос;
			ЗапросОпераций.Параметры.Вставить("Таблица", ТабТехКарт);
			ЗапросОпераций.УстановитьПараметр("Дата", ДокОснование.ДатаОбнаружения);
			ЗапросОпераций.Текст = "ВЫБРАТЬ
			                       |	Таблица.ОбъектРемонта КАК ОбъектРемонта,
			                       |	Таблица.ВидРемонта КАК ВидРемонта,
			                       |	Таблица.ID КАК ID,
			                       |	Таблица.РемонтнаяРабота КАК ТехКарта,
								   |	Таблица.ВводитьНаряд КАК ВводитьНаряд,
								   |	Таблица.ДатаНачалаРемонта КАК ДатаНачалаРемонта,
								   |	Таблица.ДатаОкончанияРемонта КАК ДатаОкончанияРемонта
			                       |ПОМЕСТИТЬ Таблица
			                       |ИЗ
			                       |	&Таблица КАК Таблица
			                       |;
			                       |
			                       |////////////////////////////////////////////////////////////////////////////////
			                       |ВЫБРАТЬ
			                       |	Таблица.ВводитьНаряд КАК ВводитьНаряд,
			                       |	Таблица.ОбъектРемонта КАК ОбъектРемонта,
			                       |	Таблица.ВидРемонта КАК ВидРемонта,
			                       |	торо_ТехКартыСписокОпераций.Операция КАК РемонтнаяРабота,
			                       |	Таблица.ДатаНачалаРемонта КАК ДатаНачалаРемонта,
			                       |	Таблица.ДатаОкончанияРемонта КАК ДатаОкончанияРемонта,
			                       |	Таблица.ID КАК ID,
			                       |	торо_ТехнологическиеОперации.РаботаПовышеннойОпасности КАК РаботаПовышеннойОпасности
			                       |ИЗ
			                       |	Таблица КАК Таблица
			                       |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ТехКарты.СписокОпераций КАК торо_ТехКартыСписокОпераций
			                       |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВерсииТехКарт.СрезПоследних(&Дата, ) КАК торо_ВерсииТехКартСрезПоследних
			                       |			ПО (торо_ВерсииТехКартСрезПоследних.ТехКарта = торо_ТехКартыСписокОпераций.Ссылка)
			                       |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ТехнологическиеОперации КАК торо_ТехнологическиеОперации
			                       |			ПО торо_ТехКартыСписокОпераций.Операция = торо_ТехнологическиеОперации.Ссылка
			                       |		ПО (Таблица.ТехКарта = торо_ВерсииТехКартСрезПоследних.ИдентификаторТехКарты)
			                       |ГДЕ
			                       |	ВЫБОР
			                       |			КОГДА ТИПЗНАЧЕНИЯ(торо_ТехКартыСписокОпераций.Операция) = ТИП(Справочник.торо_ТехнологическиеОперации)
			                       |				ТОГДА торо_ТехКартыСписокОпераций.Операция.РаботаПовышеннойОпасности = ИСТИНА
			                       |			ИНАЧЕ торо_ТехКартыСписокОпераций.Ссылка.СодержитРаботыПовышеннойОпасности = ИСТИНА
			                       |		КОНЕЦ";
			Выборка = ЗапросОпераций.Выполнить().Выбрать();
		    ТабТехКарт.Очистить();
			Пока Выборка.Следующий() Цикл
				Если ТипЗнч(Выборка.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда
					НС = ТабТехКарт.Добавить();
					ЗаполнитьЗначенияСвойств(НС, Выборка);						
				Иначе
					НС = ВТ_ОпасныеОперации.Добавить();
					ЗаполнитьЗначенияСвойств(НС, Выборка);
				КонецЕсли;
			КонецЦикла;
			
			Если ТабТехКарт.Количество() = 0 или КЦ > 100 Тогда
				Прервать;
			КонецЕсли;
		
			КЦ = КЦ + 1;
		
		КонецЦикла;

		
		Запрос.Параметры.Вставить("ВТ_ОпасныеОперации", ВТ_ОпасныеОперации);
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВТ_ОпасныеОперации.ОбъектРемонта КАК ОбъектРемонта,
		               |	ВТ_ОпасныеОперации.ВидРемонта КАК ВидРемонта,
		               |	ВТ_ОпасныеОперации.ID КАК ID,
		               |	ВТ_ОпасныеОперации.РемонтнаяРабота КАК РемонтнаяРабота,
			           |	ВТ_ОпасныеОперации.ДатаНачалаРемонта КАК ДатаНачалаРемонта,
			           |	ВТ_ОпасныеОперации.ДатаОкончанияРемонта КАК ДатаОкончанияРемонта,
					   |	ВТ_ОпасныеОперации.ВводитьНаряд КАК ВводитьНаряд
		               |ПОМЕСТИТЬ ВТ_ОпасныеОперации
		               |ИЗ
		               |	&ВТ_ОпасныеОперации КАК ВТ_ОпасныеОперации
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.Ссылка КАК Ссылка,
		               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.НомерСтроки КАК НомерСтроки,
		               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.ID КАК ID,
		               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.РемонтнаяРабота КАК РемонтнаяРабота,
		               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.Родитель_ID КАК Родитель_ID,
		               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.Количество КАК Количество,
		               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.Картинка КАК Картинка
		               |ПОМЕСТИТЬ ВТ_Наряды
		               |ИЗ
		               |	Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтныеРаботы КАК торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы
		               |ГДЕ
		               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.Ссылка.Проведен = ИСТИНА
		               |	И торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.РемонтыОборудования_ID В
		               |			(ВЫБРАТЬ
		               |				ВТ_ОпасныеОперации.ID КАК ID
		               |			ИЗ
		               |				ВТ_ОпасныеОперации КАК ВТ_ОпасныеОперации)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ОпасныеОперации.ВводитьНаряд КАК ВводитьНаряд,
		               |	ВТ_ОпасныеОперации.ОбъектРемонта КАК ОбъектРемонта,
		               |	ВТ_ОпасныеОперации.ВидРемонта КАК ВидРемонта,
		               |	ВТ_ОпасныеОперации.РемонтнаяРабота КАК РемонтнаяРабота,
		               |	ВТ_ОпасныеОперации.ДатаНачалаРемонта КАК ДатаНачалаРемонта,
		               |	ВТ_ОпасныеОперации.ДатаОкончанияРемонта КАК ДатаОкончанияРемонта,
		               |	ВТ_ОпасныеОперации.ID КАК ID
		               |ИЗ
		               |	ВТ_ОпасныеОперации КАК ВТ_ОпасныеОперации
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Наряды КАК ВТ_Наряды
		               |		ПО ВТ_ОпасныеОперации.РемонтнаяРабота = ВТ_Наряды.РемонтнаяРабота
					   |			И (ВТ_ОпасныеОперации.ID = ВТ_Наряды.РемонтыОборудования_ID)
		               |ГДЕ
		               |	ВТ_Наряды.Ссылка ЕСТЬ NULL";
		
		Если РемонтыОборудования_ID <> "" Тогда
			Запрос.Текст = Запрос.Текст + " И ВТ_ОпасныеОперации.ID = &РемонтыОборудования_ID";
			Запрос.УстановитьПараметр("РемонтыОборудования_ID", РемонтыОборудования_ID);
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДокОснование) = Тип("ДокументСсылка.торо_ПланГрафикРемонта") Тогда
		
		ВТ_ОпасныеОперации = Новый ТаблицаЗначений();
		ВТ_ОпасныеОперации.Колонки.Добавить("ОбъектРемонта", Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта"));
		ВТ_ОпасныеОперации.Колонки.Добавить("ВидРемонта", Новый ОписаниеТипов("СправочникСсылка.торо_ВидыРемонтов"));
		ВТ_ОпасныеОперации.Колонки.Добавить("ДатаНачалаРемонта", Новый ОписаниеТипов("Дата"));
		ВТ_ОпасныеОперации.Колонки.Добавить("ДатаОкончанияРемонта", Новый ОписаниеТипов("Дата"));
		ВТ_ОпасныеОперации.Колонки.Добавить("ID", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(36)));
		ВТ_ОпасныеОперации.Колонки.Добавить("РемонтнаяРабота", Новый ОписаниеТипов("СправочникСсылка.торо_ТехнологическиеОперации"));
		
		ТабТехКарт = Новый ТаблицаЗначений;
		ТабТехКарт.Колонки.Добавить("ОбъектРемонта", Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта"));
		ТабТехКарт.Колонки.Добавить("ВидРемонта", Новый ОписаниеТипов("СправочникСсылка.торо_ВидыРемонтов"));
		ТабТехКарт.Колонки.Добавить("ДатаНачалаРемонта", Новый ОписаниеТипов("Дата"));
		ТабТехКарт.Колонки.Добавить("ДатаОкончанияРемонта", Новый ОписаниеТипов("Дата"));
		ТабТехКарт.Колонки.Добавить("ID", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(36)));
		ТабТехКарт.Колонки.Добавить("РемонтнаяРабота", Новый ОписаниеТипов("СправочникСсылка.торо_ИдентификаторыТехКарт"));
				
		Запрос.УстановитьПараметр("Ссылка", ДокОснование);
		Запрос.Текст = "ВЫБРАТЬ
		               |	торо_ПланГрафикРемонтаПланРемонтов.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ДатаКон КАК ДатаКон,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ДатаНач КАК ДатаНач,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ID КАК ID
		               |ПОМЕСТИТЬ ВТ_РемонтныеРаботы
		               |ИЗ
		               |	Документ.торо_ПланГрафикРемонта.ПланРемонтов КАК торо_ПланГрафикРемонтаПланРемонтов
		               |ГДЕ
		               |	торо_ПланГрафикРемонтаПланРемонтов.Ссылка = &Ссылка
		               |	И торо_ПланГрафикРемонтаПланРемонтов.Замещен = ЛОЖЬ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_РемонтныеРаботы.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
		               |	ВТ_РемонтныеРаботы.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
		               |	ВТ_РемонтныеРаботы.ДатаКон КАК ДатаКон,
		               |	ВТ_РемонтныеРаботы.ДатаНач КАК ДатаНач,
		               |	ВТ_РемонтныеРаботы.ID КАК ID,
		               |	торо_НормативныеРемонтыОборудования.НормативныйРемонт КАК НормативныйРемонт
		               |ПОМЕСТИТЬ ВТ_Нормативы
		               |ИЗ
		               |	ВТ_РемонтныеРаботы КАК ВТ_РемонтныеРаботы
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_НормативныеРемонтыОборудования КАК торо_НормативныеРемонтыОборудования
		               |		ПО ВТ_РемонтныеРаботы.ОбъектРемонтныхРабот = торо_НормативныеРемонтыОборудования.ОбъектРемонта
		               |			И ВТ_РемонтныеРаботы.ВидРемонтныхРабот = торо_НормативныеРемонтыОборудования.ВидРемонта
		               |ГДЕ
		               |	торо_НормативныеРемонтыОборудования.Приоритет = ИСТИНА
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ВТ_РемонтныеРаботы.ОбъектРемонтныхРабот,
		               |	торо_ЦепочкиРемонтаПоследовательностьРемонтов.ВидРемонта,
		               |	ВТ_РемонтныеРаботы.ДатаКон,
		               |	ВТ_РемонтныеРаботы.ДатаНач,
		               |	ВТ_РемонтныеРаботы.ID,
		               |	торо_ЦепочкиРемонтаПоследовательностьРемонтов.НормативныйРемонт
		               |ИЗ
		               |	ВТ_РемонтныеРаботы КАК ВТ_РемонтныеРаботы
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_РемонтныеЦиклыОборудования КАК торо_РемонтныеЦиклыОборудования
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ЦепочкиРемонта.ПоследовательностьРемонтов КАК торо_ЦепочкиРемонтаПоследовательностьРемонтов
		               |			ПО торо_РемонтныеЦиклыОборудования.ВидЦепочки = торо_ЦепочкиРемонтаПоследовательностьРемонтов.Ссылка
		               |		ПО ВТ_РемонтныеРаботы.ОбъектРемонтныхРабот = торо_РемонтныеЦиклыОборудования.ГруппаОбъектовРемонтов
		               |			И (ВТ_РемонтныеРаботы.ВидРемонтныхРабот = торо_ЦепочкиРемонтаПоследовательностьРемонтов.ВидРемонта)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_Нормативы.НормативныйРемонт КАК НормативныйРемонт,
		               |	МАКСИМУМ(торо_ВерсииТехКарт.Период) КАК Период,
		               |	ВТ_Нормативы.ID КАК ID
		               |ПОМЕСТИТЬ ВТ_Даты
		               |ИЗ
		               |	ВТ_Нормативы КАК ВТ_Нормативы
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВерсииТехКарт КАК торо_ВерсииТехКарт
		               |		ПО ВТ_Нормативы.НормативныйРемонт = торо_ВерсииТехКарт.ИдентификаторТехКарты
		               |ГДЕ
		               |	торо_ВерсииТехКарт.Период <= ВТ_Нормативы.ДатаНач
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВТ_Нормативы.НормативныйРемонт,
		               |	ВТ_Нормативы.ID
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_Нормативы.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
		               |	ВТ_Нормативы.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
		               |	ВТ_Нормативы.ДатаКон КАК ДатаКон,
		               |	ВТ_Нормативы.ДатаНач КАК ДатаНач,
		               |	ВТ_Нормативы.ID КАК ID,
		               |	ВТ_Нормативы.НормативныйРемонт КАК НормативныйРемонт,
		               |	ВТ_Даты.Период КАК Период
		               |ПОМЕСТИТЬ ВТ_ДляВерсийТК
		               |ИЗ
		               |	ВТ_Нормативы КАК ВТ_Нормативы
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Даты КАК ВТ_Даты
		               |		ПО ВТ_Нормативы.НормативныйРемонт = ВТ_Даты.НормативныйРемонт
		               |			И ВТ_Нормативы.ID = ВТ_Даты.ID
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ДляВерсийТК.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
		               |	ВТ_ДляВерсийТК.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
		               |	ВТ_ДляВерсийТК.ДатаКон КАК ДатаКон,
		               |	ВТ_ДляВерсийТК.ДатаНач КАК ДатаНач,
		               |	ВТ_ДляВерсийТК.ID КАК ID,
		               |	торо_ВерсииТехКарт.ТехКарта КАК ТехКарта
		               |ПОМЕСТИТЬ ВТ_ВерсииТехКарт
		               |ИЗ
		               |	ВТ_ДляВерсийТК КАК ВТ_ДляВерсийТК
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВерсииТехКарт КАК торо_ВерсииТехКарт
		               |		ПО ВТ_ДляВерсийТК.НормативныйРемонт = торо_ВерсииТехКарт.ИдентификаторТехКарты
		               |			И ВТ_ДляВерсийТК.Период = торо_ВерсииТехКарт.Период
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ВерсииТехКарт.ОбъектРемонтныхРабот КАК ОбъектРемонта,
		               |	ВТ_ВерсииТехКарт.ВидРемонтныхРабот КАК ВидРемонта,
		               |	ВТ_ВерсииТехКарт.ДатаКон КАК ДатаОкончанияРемонта,
		               |	ВТ_ВерсииТехКарт.ДатаНач КАК ДатаНачалаРемонта,
		               |	ВТ_ВерсииТехКарт.ID КАК ID,
		               |	торо_ТехКартыСписокОпераций.Операция КАК РемонтнаяРабота
		               |ИЗ
		               |	ВТ_ВерсииТехКарт КАК ВТ_ВерсииТехКарт
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ТехКарты.СписокОпераций КАК торо_ТехКартыСписокОпераций
		               |		ПО ВТ_ВерсииТехКарт.ТехКарта = торо_ТехКартыСписокОпераций.Ссылка
		               |ГДЕ
		               |	ВЫБОР
		               |			КОГДА ТИПЗНАЧЕНИЯ(торо_ТехКартыСписокОпераций.Операция) = ТИП(Справочник.торо_ТехнологическиеОперации)
		               |				ТОГДА торо_ТехКартыСписокОпераций.Операция.РаботаПовышеннойОпасности = ИСТИНА
		               |			ИНАЧЕ торо_ТехКартыСписокОпераций.Ссылка.СодержитРаботыПовышеннойОпасности = ИСТИНА
		               |		КОНЕЦ";
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Если ТипЗнч(Выборка.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда
				НС = ТабТехКарт.Добавить();
				ЗаполнитьЗначенияСвойств(НС, Выборка);						
			Иначе
				НС = ВТ_ОпасныеОперации.Добавить();
				ЗаполнитьЗначенияСвойств(НС, Выборка);
			КонецЕсли;
		КонецЦикла;
		
		КЦ = 0;
		Пока Истина Цикл
			ЗапросОпераций = Новый Запрос;
			ЗапросОпераций.Параметры.Вставить("Таблица", ТабТехКарт);
			ЗапросОпераций.Текст = "ВЫБРАТЬ
			                       |	Таблица.ОбъектРемонта КАК ОбъектРемонта,
			                       |	Таблица.ВидРемонта КАК ВидРемонта,
			                       |	Таблица.ДатаНачалаРемонта КАК ДатаНачалаРемонта,
			                       |	Таблица.ДатаОкончанияРемонта КАК ДатаОкончанияРемонта,
			                       |	Таблица.ID КАК ID,
			                       |	Таблица.РемонтнаяРабота КАК ТехКарта
			                       |ПОМЕСТИТЬ Таблица
			                       |ИЗ
			                       |	&Таблица КАК Таблица
			                       |;
			                       |
			                       |////////////////////////////////////////////////////////////////////////////////
			                       |ВЫБРАТЬ
			                       |	Таблица.ТехКарта КАК ТехКарта,
			                       |	МАКСИМУМ(торо_ВерсииТехКарт.Период) КАК Период,
			                       |	Таблица.ID КАК ID
			                       |ПОМЕСТИТЬ ВТ_Даты
			                       |ИЗ
			                       |	Таблица КАК Таблица
			                       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВерсииТехКарт КАК торо_ВерсииТехКарт
			                       |		ПО Таблица.ТехКарта = торо_ВерсииТехКарт.ИдентификаторТехКарты
			                       |ГДЕ
			                       |	торо_ВерсииТехКарт.Период <= Таблица.ДатаНачалаРемонта
			                       |
			                       |СГРУППИРОВАТЬ ПО
			                       |	Таблица.ТехКарта,
			                       |	Таблица.ID
			                       |;
			                       |
			                       |////////////////////////////////////////////////////////////////////////////////
			                       |ВЫБРАТЬ
			                       |	Таблица.ОбъектРемонта КАК ОбъектРемонта,
			                       |	Таблица.ВидРемонта КАК ВидРемонта,
			                       |	Таблица.ДатаОкончанияРемонта КАК ДатаОкончанияРемонта,
			                       |	Таблица.ДатаНачалаРемонта КАК ДатаНачалаРемонта,
			                       |	Таблица.ID КАК ID,
			                       |	Таблица.ТехКарта КАК ТехКарта,
			                       |	ВТ_Даты.Период КАК Период
			                       |ПОМЕСТИТЬ ВТ_ДляВерсийТК
			                       |ИЗ
			                       |	Таблица КАК Таблица
			                       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Даты КАК ВТ_Даты
			                       |		ПО Таблица.ТехКарта = ВТ_Даты.ТехКарта
			                       |			И Таблица.ID = ВТ_Даты.ID
			                       |;
			                       |
			                       |////////////////////////////////////////////////////////////////////////////////
			                       |ВЫБРАТЬ
			                       |	ВТ_ДляВерсийТК.ОбъектРемонта КАК ОбъектРемонта,
			                       |	ВТ_ДляВерсийТК.ВидРемонта КАК ВидРемонта,
			                       |	ВТ_ДляВерсийТК.ДатаОкончанияРемонта КАК ДатаОкончанияРемонта,
			                       |	ВТ_ДляВерсийТК.ДатаНачалаРемонта КАК ДатаНачалаРемонта,
			                       |	ВТ_ДляВерсийТК.ID КАК ID,
			                       |	торо_ВерсииТехКарт.ТехКарта КАК ТехКарта
			                       |ПОМЕСТИТЬ ВТ_ВерсииТехКарт
			                       |ИЗ
			                       |	ВТ_ДляВерсийТК КАК ВТ_ДляВерсийТК
			                       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВерсииТехКарт КАК торо_ВерсииТехКарт
			                       |		ПО ВТ_ДляВерсийТК.ТехКарта = торо_ВерсииТехКарт.ИдентификаторТехКарты
			                       |			И ВТ_ДляВерсийТК.Период = торо_ВерсииТехКарт.Период
			                       |;
			                       |
			                       |////////////////////////////////////////////////////////////////////////////////
			                       |ВЫБРАТЬ
			                       |	ВТ_ВерсииТехКарт.ОбъектРемонта КАК ОбъектРемонта,
			                       |	ВТ_ВерсииТехКарт.ВидРемонта КАК ВидРемонта,
			                       |	ВТ_ВерсииТехКарт.ДатаНачалаРемонта КАК ДатаНачалаРемонта,
			                       |	ВТ_ВерсииТехКарт.ДатаОкончанияРемонта КАК ДатаОкончанияРемонта,
			                       |	ВТ_ВерсииТехКарт.ID КАК ID,
			                       |	торо_ТехКартыСписокОпераций.Операция КАК РемонтнаяРабота,
			                       |	торо_ТехнологическиеОперации.РаботаПовышеннойОпасности КАК РаботаПовышеннойОпасности
			                       |ИЗ
			                       |	ВТ_ВерсииТехКарт КАК ВТ_ВерсииТехКарт
			                       |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ТехКарты.СписокОпераций КАК торо_ТехКартыСписокОпераций
			                       |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ТехнологическиеОперации КАК торо_ТехнологическиеОперации
			                       |			ПО торо_ТехКартыСписокОпераций.Операция = торо_ТехнологическиеОперации.Ссылка
			                       |		ПО ВТ_ВерсииТехКарт.ТехКарта = торо_ТехКартыСписокОпераций.Ссылка
			                       |ГДЕ
			                       |	ВЫБОР
			                       |			КОГДА ТИПЗНАЧЕНИЯ(торо_ТехКартыСписокОпераций.Операция) = ТИП(Справочник.торо_ТехнологическиеОперации)
			                       |				ТОГДА торо_ТехКартыСписокОпераций.Операция.РаботаПовышеннойОпасности = ИСТИНА
			                       |			ИНАЧЕ торо_ТехКартыСписокОпераций.Ссылка.СодержитРаботыПовышеннойОпасности = ИСТИНА
			                       |		КОНЕЦ";
			Выборка = ЗапросОпераций.Выполнить().Выбрать();
		    ТабТехКарт.Очистить();
			Пока Выборка.Следующий() Цикл
				Если ТипЗнч(Выборка.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда
					НС = ТабТехКарт.Добавить();
					ЗаполнитьЗначенияСвойств(НС, Выборка);						
				Иначе
					НС = ВТ_ОпасныеОперации.Добавить();
					ЗаполнитьЗначенияСвойств(НС, Выборка);
				КонецЕсли;
			КонецЦикла;
			
			Если ТабТехКарт.Количество() = 0 или КЦ > 100 Тогда
				Прервать;
			КонецЕсли;
		
			КЦ = КЦ + 1;
		
		КонецЦикла;

		
		Запрос.Параметры.Вставить("ВТ_ОпасныеОперации", ВТ_ОпасныеОперации);
			
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВТ_ОпасныеОперации.ОбъектРемонта КАК ОбъектРемонта,
		               |	ВТ_ОпасныеОперации.ВидРемонта КАК ВидРемонта,
		               |	ВТ_ОпасныеОперации.ДатаНачалаРемонта КАК ДатаНачалаРемонта,
		               |	ВТ_ОпасныеОперации.ДатаОкончанияРемонта КАК ДатаОкончанияРемонта,
		               |	ВТ_ОпасныеОперации.ID КАК ID,
		               |	ВТ_ОпасныеОперации.РемонтнаяРабота КАК РемонтнаяРабота
		               |ПОМЕСТИТЬ ВТ_ОпасныеОперации
		               |ИЗ
		               |	&ВТ_ОпасныеОперации КАК ВТ_ОпасныеОперации
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.Ссылка КАК Ссылка,
		               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.НомерСтроки КАК НомерСтроки,
		               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.ID КАК ID,
		               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.РемонтнаяРабота КАК РемонтнаяРабота,
		               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.Родитель_ID КАК Родитель_ID,
		               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.Количество КАК Количество,
		               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.Картинка КАК Картинка
		               |ПОМЕСТИТЬ ВТ_Наряды
		               |ИЗ
		               |	Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтныеРаботы КАК торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы
		               |ГДЕ
		               |	торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.Ссылка.Проведен = ИСТИНА
		               |	И торо_НарядНаВыполнениеРемонтныхРаботРемонтныеРаботы.РемонтыОборудования_ID В
		               |			(ВЫБРАТЬ
		               |				ВТ_ОпасныеОперации.ID КАК ID
		               |			ИЗ
		               |				ВТ_ОпасныеОперации КАК ВТ_ОпасныеОперации)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ОпасныеОперации.ОбъектРемонта КАК ОбъектРемонта,
		               |	ВТ_ОпасныеОперации.ВидРемонта КАК ВидРемонта,
		               |	ВТ_ОпасныеОперации.РемонтнаяРабота КАК РемонтнаяРабота,
		               |	ВТ_ОпасныеОперации.ДатаНачалаРемонта КАК ДатаНачалаРемонта,
		               |	ВТ_ОпасныеОперации.ДатаОкончанияРемонта КАК ДатаОкончанияРемонта,
		               |	ВТ_ОпасныеОперации.ID КАК ID,
		               |	ИСТИНА КАК ВводитьНаряд
		               |ИЗ
		               |	ВТ_ОпасныеОперации КАК ВТ_ОпасныеОперации
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Наряды КАК ВТ_Наряды
		               |		ПО ВТ_ОпасныеОперации.РемонтнаяРабота = ВТ_Наряды.РемонтнаяРабота
		               |			И ВТ_ОпасныеОперации.ID = ВТ_Наряды.РемонтыОборудования_ID
		               |ГДЕ
		               |	ВТ_Наряды.Ссылка ЕСТЬ NULL";
		
		Если РемонтыОборудования_ID <> "" Тогда
			Запрос.Текст = Запрос.Текст + " И ВТ_ОпасныеОперации.ID = &РемонтыОборудования_ID";
			Запрос.УстановитьПараметр("РемонтыОборудования_ID", РемонтыОборудования_ID);
		КонецЕсли;		
		
	КонецЕсли; 	
	
	Запрос.УстановитьПараметр("Ссылка", ДокОснование);
	
	Результат = Запрос.Выполнить();
	ТабОперацийБезНаряда.Загрузить(Результат.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрываемыеПредписанияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Элемент.ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(Элемент.ТекущиеДанные.ДокументВнешнегоОснования) И Поле.Имя = "ЗакрываемыеПредписанияДокументВнешнегоОснования" Тогда
		СтруктураПараметров = Новый Структура("Ключ", Элемент.ТекущиеДанные.ДокументВнешнегоОснования);
		ОткрытьФорму("Документ.торо_ВнешнееОснованиеДляРабот.ФормаОбъекта", СтруктураПараметров);		
	КонецЕсли; 
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьФОПовышеннаяОпасность()
	Возврат ПолучитьФункциональнуюОпцию("торо_ИспользоватьНарядДопускНаРаботыПовышеннойОпасностиОбязательно");
КонецФункции

&НаКлиенте
Процедура ЗакрываемыеПредписанияПередУдалением(Элемент, Отказ)
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		СтрокиДокОснования = Объект.ДокументыОснования.НайтиСтроки(Новый Структура("ДокументОснование", Элемент.ТекущиеДанные.ДокументВнешнегоОснования));
		Если СтрокиДокОснования.Количество() <> 0 Тогда
			Для каждого СтрокаДокумента Из СтрокиДокОснования Цикл
				Объект.ДокументыОснования.Удалить(СтрокаДокумента);
			КонецЦикла; 
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИспользованиеХарактеристикЗапчастей()
	Для каждого ТекущаяСтрока Из Объект.СерийныеЗапчасти Цикл
		ТекущаяСтрока.ХарактеристикиИспользуются = торо_НоменклатураСервер.ПолучитьХарактеристикиИспользуются(ТекущаяСтрока.Номенклатура);
		Если Не ТекущаяСтрока.ХарактеристикиИспользуются Тогда
			ТекущаяСтрока.ХарактеристикаНоменклатуры = Неопределено;
		КонецЕсли;
		ТекущаяСтрока.ХарактеристикиИспользуютсяДляНовой = торо_НоменклатураСервер.ПолучитьХарактеристикиИспользуются(ТекущаяСтрока.НоменклатураНовая);
		Если Не ТекущаяСтрока.ХарактеристикиИспользуютсяДляНовой Тогда
			ТекущаяСтрока.ХарактеристикаНоменклатурыНовая = Неопределено;
		КонецЕсли;		
	КонецЦикла; 	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораIDОперации(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	ТекущиеДанные = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;	
	Если ТекущиеДанные <> Неопределено И ВыбранныйЭлемент <> Неопределено Тогда
		СтруктураПоиска = Новый Структура("ID", ВыбранныйЭлемент.ID);
		Имеющиеся = Объект.РемонтныеРаботы.НайтиСтроки(СтруктураПоиска);
		Если Имеющиеся.Количество() = 0 Тогда
			СтарыйID = ТекущиеДанные.ID;
			ТекущиеДанные.ID = ВыбранныйЭлемент.ID;
			Если ВыбранныйЭлемент.Процент < 0 Тогда
				ТекущиеДанные.ПроцентВыполненияРабот = 100 + ВыбранныйЭлемент.Процент / ТекущиеДанные.Количество;
			Иначе
				ТекущиеДанные.ПроцентВыполненияРабот = ВыбранныйЭлемент.Процент / ТекущиеДанные.Количество;
			КонецЕсли; 
			
			ИзменитьIDВТабличныхЧастях(ВыбранныйЭлемент.ID, СтарыйID);
			ПерерасчитатьПроцентыВыполненияРабот();
		Иначе
			ТекстСообщения = НСтр("es='¡Esta operación es añadida ya!';ru='Эта операция уже добавлена!';en='This operation has already been added!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			ТекущиеДанные.НоваяОперация = Истина;
		КонецЕсли;
	ИначеЕсли ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.НоваяОперация = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ИзменитьIDВТабличныхЧастях(НовыйID, СтарыйID)
	
	ТабличныеЧасти = Новый Соответствие;
	ТабличныеЧасти.Вставить("РемонтныеРаботы", "РемонтныеРаботы");
	ТабличныеЧасти.Вставить("МатериальныеЗатраты", "МатериальныеЗатраты");
	ТабличныеЧасти.Вставить("ЗакрываемыеПредписания", "ЗакрываемыеПредписания");
	ТабличныеЧасти.Вставить("СерийныеЗапчасти", "СерийныеЗапчасти");
	ТабличныеЧасти.Вставить("ТрудовыеЗатраты", "ТрудовыеЗатраты");
	
	Для каждого ТабЧасть Из ТабличныеЧасти Цикл
		Для каждого Строка Из Объект[ТабЧасть.Значение] Цикл
			Если Строка.ID = СтарыйID Тогда
				Строка.ID = НовыйID;
			КонецЕсли; 
		КонецЦикла;	
	КонецЦикла; 

КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьВремяРаботыПоНормативамНаСервере()
	
	торо_Ремонты.ЗаполнитьВремяРаботыПоНормативам(ЭтаФорма, "ТрудовыеЗатраты");
	
	Для каждого Строка Из Объект.ТрудовыеЗатраты Цикл
		Строка.ВремяРаботыТекст = СформироватьПродолжительность(Строка.ВремяРаботы);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВремяРаботыПоДлительностиСУчетомГрафикаНаСервере()
	
	ТаблицаСотрудников = Объект.ТрудовыеЗатраты.Выгрузить(,"Сотрудник, ДатаНачала, ДатаОкончания");	

	ТабВремениРаботыСотрудников = РассчитатьРабочееВремяСотрудникаПоТаблице(ТаблицаСотрудников);	
	
	Для каждого Строка Из Объект.ТрудовыеЗатраты Цикл
		
		МассивРабВремениСотрудников = ТабВремениРаботыСотрудников.НайтиСтроки(Новый Структура("Сотрудник, ДатаНачала, ДатаОкончания", Строка.Сотрудник, Строка.ДатаНачала, Строка.ДатаОкончания));
		ВремяПоГрафику = ?(МассивРабВремениСотрудников.Количество(), МассивРабВремениСотрудников[0], Неопределено);

		Если ВремяПоГрафику <> Неопределено Тогда
			Строка.ВремяРаботы = ВремяПоГрафику.ВремяРаботы;
		Иначе
			Строка.ВремяРаботы = 0;
		КонецЕсли;

		Строка.ВремяРаботыТекст = СформироватьПродолжительность(Строка.ВремяРаботы);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзЛотовНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_ЗапланированныеПодрядчикиРемонтовСрезПоследних.ID КАК РемонтыОборудования_ID,
	|	торо_ЗапланированныеПодрядчикиРемонтовСрезПоследних.Подрядчик КАК Исполнитель,
	|	торо_ЗапланированныеПодрядчикиРемонтовСрезПоследних.ДоговорПодрядчика КАК УточнениеИсполнителя,
	|	торо_ЗапланированныеПодрядчикиРемонтовСрезПоследних.Регистратор.Сумма КАК Сумма,
	|	торо_ЗапланированныеПодрядчикиРемонтовСрезПоследних.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрСведений.торо_ЗапланированныеПодрядчикиРемонтов.СрезПоследних(, ID В (&СписокID)) КАК торо_ЗапланированныеПодрядчикиРемонтовСрезПоследних";
	
	Запрос.УстановитьПараметр("СписокID", Объект.РемонтыОборудования.Выгрузить(,"ID"));
	
	ВыборкаИсполнителей = Запрос.Выполнить().Выбрать();
	
	СтруктураПоискаИсполнителей = Новый Структура("РемонтыОборудования_ID, Исполнитель, УточнениеИсполнителя");
	
	Пока ВыборкаИсполнителей.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураПоискаИсполнителей, ВыборкаИсполнителей);
		ИсполнителиПоРемонтам = Объект.ИсполнителиПоРемонтам.НайтиСтроки(СтруктураПоискаИсполнителей);
		
		Если ИсполнителиПоРемонтам.Количество() = 0 Тогда
			НоваяСтрока = Объект.ИсполнителиПоРемонтам.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаИсполнителей); 
		Иначе
			Для каждого Строка из ИсполнителиПоРемонтам Цикл
				Строка.Сумма = ВыборкаИсполнителей.Сумма;
			КонецЦикла;
		КонецЕсли;
		
		СписокТехКарт = Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", ВыборкаИсполнителей.РемонтыОборудования_ID));
		Для Каждого ТехКарта Из СписокТехКарт Цикл
			Если ТипЗнч(ТехКарта.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда
				Если НЕ ЗначениеЗаполнено(ТехКарта.Исполнитель) Тогда
					ТехКарта.Исполнитель = ВыборкаИсполнителей.Исполнитель;
					ТехКарта.ДоговорБригада = ВыборкаИсполнителей.УточнениеИсполнителя;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзЛотов(Команда)
	
	ЗаполнитьИзЛотовНаСервере();
	
	ТекущиеДанные = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		ЗаполнитьДеревоРемонтныхРаботНаСервере(ТекущиеДанные.ID);
		Элементы.ДеревоРемонтныхРабот.Развернуть(ДеревоРемонтныхРабот.ПолучитьЭлементы()[0].ПолучитьИдентификатор(),Истина);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте 
Процедура ДобавитьИзменитьЗаписиВРегистреТоро_ИнтеграцияДокументовСводный(Результат, ДополнительныеПараметры) Экспорт
	МассивID = ДополнительныеПараметры.МассивID;
	Для Каждого ID Из МассивID Цикл
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ТекущийРемонт_ID", ID);
		СтруктураПараметров.Вставить("Ссылка", ДополнительныеПараметры.Ссылка);
		ДобавитьИзменитьЗаписиВРегистреТоро_ИнтеграцияДокументовСервер(Результат, СтруктураПараметров);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбработатьВыборМассиваРемонтовНаСервере(ВыбранноеЗначение)
	
	МассивIDОпераций = Новый Массив;
	
	Для каждого Элемент Из ВыбранноеЗначение Цикл
		ИДСтрокиРемонта = Неопределено; 
		ИДТекущегоРемонта = Элемент.СтрокаРемонтовОборудования.ID;
		НайденныеСтрокиРемонта = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", ИДТекущегоРемонта));
		Если НайденныеСтрокиРемонта.Количество() <> 0 Тогда
			ИДСтрокиРемонта = НайденныеСтрокиРемонта[0].ПолучитьИдентификатор();
			
			ЗаполнитьДеревоРемонтныхРаботНаСервере(ИДТекущегоРемонта);
			Если ТипЗнч(Элемент.ДокументОснование) = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") Тогда
				ЗаполнитьМатериалыПоОснованиюНаСервере(Неопределено, ИДСтрокиРемонта, Ложь);
			Иначе
				ЗаполнитьМатериалыПоНормамНаСервере(Неопределено, ИДСтрокиРемонта, Ложь);
			КонецЕсли;
			
			Если ТипЗнч(Элемент.ДокументОснование) = Тип("ДокументСсылка.торо_ПланГрафикРемонта") ИЛИ 
				ТипЗнч(Элемент.ДокументОснование) = Тип("ДокументСсылка.торо_ВыявленныеДефекты") ИЛИ 
				ТипЗнч(Элемент.ДокументОснование) = Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот") Тогда
				торо_Ремонты.ЗаполнитьИсполнителейПоНормам(ЭтаФорма, Неопределено, ИДСтрокиРемонта, "ТрудовыеЗатраты");
			КонецЕсли;
			
			МассивIDОперацийРемонта = ПолучитьIDОперацийПоIDРемонта(Объект, ИДТекущегоРемонта);
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивIDОпераций, МассивIDОперацийРемонта);
		КонецЕсли;

	КонецЦикла;
	
	Если МассивIDОпераций.Количество() > 0 Тогда 
		ОтметитьНаличиеАналогов(МассивIDОпераций);
	КонецЕсли;
	
	Для каждого Строка Из Объект.ТрудовыеЗатраты Цикл
		Строка.ВремяРаботыТекст = СформироватьПродолжительность(Строка.ВремяРаботы);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте 
Процедура ОбновитьДокументыОприходованияИзлишков(Парам1 = Неопределено, Парам2 = Неопределено)	Экспорт
	ОбновитьДокументыОприходованияИзлишковСервер(Парам1, Парам2);	
КонецПроцедуры

&НаСервере 
Процедура ОбновитьДокументыОприходованияИзлишковСервер(Парам1 = Неопределено, Парам2 = Неопределено)
	
	МассивID = Объект.РемонтыОборудования.Выгрузить(,"ID");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_ИнтеграцияДокументов.ДокументЕРП КАК ОприходованиеИзлишков,
	               |	ВЫБОР
	               |		КОГДА торо_ИнтеграцияДокументов.ДокументЕРП.Проведен
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ИндексКартинки,
	               |	торо_ИнтеграцияДокументов.ID КАК ID
	               |ИЗ
	               |	РегистрСведений.торо_ИнтеграцияДокументов КАК торо_ИнтеграцияДокументов
	               |ГДЕ
	               |	торо_ИнтеграцияДокументов.ID В(&ID)
	               |	И ТИПЗНАЧЕНИЯ(торо_ИнтеграцияДокументов.ДокументЕРП) = ТИП(Документ.ОприходованиеИзлишковТоваров)";
	
	Запрос.УстановитьПараметр("ID", МассивID);
	
	ДокументыОприходованиеИзлишков.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПРоцедуры

&НаСервере
Функция СформироватьМассивНоменклатурыКОприходованиюНаСервере(ID)
	
	УжеОприходованнаяНоменклатура = ПолучитьТаблицуСписаннойНоменклатуры(ID, Тип("ДокументСсылка.ОприходованиеИзлишковТоваров"));
	Если ТипЗнч(ID) = Тип("Массив") Тогда
		Запчасти = Объект.СерийныеЗапчасти.Выгрузить();
	Иначе
		Запчасти = Объект.СерийныеЗапчасти.Выгрузить(Новый Структура("РемонтыОборудования_ID",ID));	
	КонецЕсли;
	
	Запчасти.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, ХарактеристикиИспользуются, СерияНоменклатуры", "Количество");
	
	Товары = Новый Массив;
	
	Для каждого Строка Из Запчасти Цикл
		
		КоличествоУжеЗаказаннойНоменклатуры = 0;
		
		Если УжеОприходованнаяНоменклатура.Количество() > 0 Тогда
			НайдСтроки = УжеОприходованнаяНоменклатура.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", Строка.Номенклатура,Строка.ХарактеристикаНоменклатуры));
			
			Если Не НайдСтроки = Неопределено Тогда
				Для каждого НайденнаяСтрока Из НайдСтроки Цикл
					КоличествоУжеЗаказаннойНоменклатуры = КоличествоУжеЗаказаннойНоменклатуры + НайденнаяСтрока.Количество;
				КонецЦикла; 
			КонецЕсли;
		КонецЕсли;
		
		Если УжеОприходованнаяНоменклатура.Количество() = 0
			ИЛИ Строка.Количество > КоличествоУжеЗаказаннойНоменклатуры Тогда
			
			Структура = Новый Структура("Номенклатура, Характеристика, ХарактеристикиИспользуются, Количество, Серия",
			                            Строка.Номенклатура, Строка.ХарактеристикаНоменклатуры, Строка.ХарактеристикиИспользуются,
			                            (Строка.Количество - КоличествоУжеЗаказаннойНоменклатуры), Строка.СерияНоменклатуры);
		    Товары.Добавить(Структура);
		КонецЕсли;	
	КонецЦикла;
	
	Если Товары.Количество() > 0 Тогда
		Возврат Товары;
	Иначе
		Возврат Неопределено;
	КонецЕсли; 
	
КонецФункции

&НаСервере
Процедура УстановитьОставшиесяПроцентыРабот(РемонтыОборудования_ID = Неопределено)
	
	ДокОбъект = РеквизитФормыВЗначение("Объект", Тип("ДокументОбъект.торо_АктОВыполненииЭтапаРабот"));
	торо_ПроцентыВыполнения.ПолучитьНевыполненныеПроценты(ДокОбъект.РемонтныеРаботы, ДокОбъект.Ссылка, РемонтыОборудования_ID);
	
	Для каждого Строка Из ДокОбъект.РемонтныеРаботы Цикл
		Если РемонтыОборудования_ID = Неопределено ИЛИ Строка.РемонтыОборудования_ID = РемонтыОборудования_ID Тогда
			Если ТипЗнч(Строка.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") 
			   И Строка.ПроцентВыполненияРабот > 100 Тогда
				 Строка.ПроцентВыполненияРабот = 100;
			КонецЕсли;
			Строка.Выполнено = Истина;
		КонецЕсли; 
	КонецЦикла; 
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	ЗаполнитьДеревоРемонтныхРаботНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПересчитатьПроцентыВыполненияВДеревеНаСервере()
	ДеревоРеквизит = РеквизитФормыВЗначение("ДеревоРемонтныхРабот");	
	торо_ПроцентыВыполнения.ОбновитьПроцентыВыполненияВДереве(ДеревоРеквизит);	
	ЗначениеВРеквизитФормы(ДеревоРеквизит, "ДеревоРемонтныхРабот");
	//ОбновитьПроцентВыполненияВСтрокахТЧ(ДеревоРемонтныхРабот.ПолучитьЭлементы()[0]);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыВыбораДоговораБригады(Исполнитель, ЭлементДоговорБригада, ОтборПоСсылке = Неопределено)
	
	ПараметрыВыбораМассив = Новый Массив;
	МассивТипов = Новый Массив;
	
	Если ТипЗнч(Исполнитель) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		ПараметрыВыбораМассив.Добавить(Новый ПараметрВыбора("Отбор.Контрагент", Исполнитель));
		ПараметрыВыбораМассив.Добавить(Новый ПараметрВыбора("Отбор.Организация", Объект.Организация));
		МассивТипов.Добавить(Тип("СправочникСсылка.ДоговорыКонтрагентов"));
		
	ИначеЕсли ТипЗнч(Исполнитель) = Тип("СправочникСсылка.СтруктураПредприятия") Тогда
		
		ПараметрыВыбораМассив.Добавить(Новый ПараметрВыбора("Отбор.Подразделение", Исполнитель));
		МассивТипов.Добавить(Тип("СправочникСсылка.торо_РемонтныеБригады"));
		
	КонецЕсли;
	
	Если ОтборПоСсылке <> Неопределено Тогда
		ПараметрыВыбораМассив.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(ОтборПоСсылке)));
	КонецЕсли;
	
	ЭлементДоговорБригада.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораМассив);
	ЭлементДоговорБригада.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыВыбораДоговораБригады_ДляРемонтныхРабот(Исполнитель, РемонтыОборудования_ID)
	
	СтруктураПоиска = Новый Структура("РемонтыОборудования_ID, Исполнитель", РемонтыОборудования_ID, Исполнитель);
	СтрокиИсполнителей = Объект.ИсполнителиПоРемонтам.НайтиСтроки(СтруктураПоиска);
	
	ОтборПоСсылке = Новый Массив;
	Для каждого Строка из СтрокиИсполнителей Цикл
		ОтборПоСсылке.Добавить(Строка.УточнениеИсполнителя);
	КонецЦикла;
	
	УстановитьПараметрыВыбораДоговораБригады(Исполнитель, Элементы.ДеревоРемонтныхРаботДоговорБригада, ОтборПоСсылке);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыВыбораИсполнителя_ДляРемонтныхРабот(РемонтыОборудования_ID)
	
	СтруктураПоиска = Новый Структура("РемонтыОборудования_ID", РемонтыОборудования_ID);
	СтрокиИсполнителей = Объект.ИсполнителиПоРемонтам.НайтиСтроки(СтруктураПоиска);

	ОтборПоСсылке = Новый Массив;
	Для каждого Строка из СтрокиИсполнителей Цикл
		ОтборПоСсылке.Добавить(Строка.Исполнитель);
	КонецЦикла;

	ПараметрыВыбораМассив = Новый Массив;
	ПараметрыВыбораМассив.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(ОтборПоСсылке)));
	ПараметрыВыбораМассив.Добавить(Новый ПараметрВыбора("РежимОтображенияСписка", "Список"));
	Элементы.ДеревоРемонтныхРаботИсполнитель.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораМассив);
	
КонецПроцедуры

&НаКлиенте
Функция НайтиРемонтныеРаботыДляОчисткиИсполнителей(РемонтыОборудования_ID, ИдентификаторИсключаемойСтроки)
	
	МассивОтобранныхСтрок = Новый Массив;
	МассивСтрокДерева = Новый Массив;
	торо_РаботаССогласованиямиКлиентСервер.ЗаполнитьМассивИзДерева(МассивСтрокДерева, ДеревоРемонтныхРабот.ПолучитьЭлементы());

	Если МассивСтрокДерева.Количество() <=1 Тогда
		Возврат МассивОтобранныхСтрок;
	КонецЕсли;
	
	ВсеИсполнителиРемонта = Объект.ИсполнителиПоРемонтам.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", РемонтыОборудования_ID));
	МассивИсполнителей = Новый Массив;
	МассивДоговоров = Новый Массив;
	
	Для каждого Строка из ВсеИсполнителиРемонта Цикл
		Если Строка.ПолучитьИдентификатор() = ИдентификаторИсключаемойСтроки Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Строка.Исполнитель) Тогда
			МассивИсполнителей.Добавить(Строка.Исполнитель);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Строка.УточнениеИсполнителя) Тогда
			МассивДоговоров.Добавить(Строка.УточнениеИсполнителя);
		КонецЕсли;
	КонецЦикла;
		
	Для каждого Строка из МассивСтрокДерева Цикл
		Если ЗначениеЗаполнено(Строка.Исполнитель) И МассивИсполнителей.Найти(Строка.Исполнитель) = Неопределено
			ИЛИ ЗначениеЗаполнено(Строка.ДоговорБригада) И МассивДоговоров.Найти(Строка.ДоговорБригада) = Неопределено Тогда
			МассивОтобранныхСтрок.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивОтобранныхСтрок;
	
КонецФункции

&НаКлиенте
Функция НайтиРемонтныеРаботыДляОчисткиДоговораБригады(РемонтыОборудования_ID, ИдентификаторИсключаемойСтроки)
	
	МассивОтобранныхСтрок = Новый Массив;
	МассивСтрокДерева = Новый Массив;
	торо_РаботаССогласованиямиКлиентСервер.ЗаполнитьМассивИзДерева(МассивСтрокДерева, ДеревоРемонтныхРабот.ПолучитьЭлементы());

	Если МассивСтрокДерева.Количество() <=1 Тогда
		Возврат МассивОтобранныхСтрок;
	КонецЕсли;
	
	ВсеИсполнителиРемонта = Объект.ИсполнителиПоРемонтам.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", РемонтыОборудования_ID));
	МассивДоговоров = Новый Массив;
	
	Для каждого Строка из ВсеИсполнителиРемонта Цикл
		Если Строка.ПолучитьИдентификатор() = ИдентификаторИсключаемойСтроки Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Строка.УточнениеИсполнителя) Тогда
			МассивДоговоров.Добавить(Строка.УточнениеИсполнителя);
		КонецЕсли;
	КонецЦикла;
		
	Для каждого Строка из МассивСтрокДерева Цикл
		Если ЗначениеЗаполнено(Строка.ДоговорБригада) И МассивДоговоров.Найти(Строка.ДоговорБригада) = Неопределено Тогда
			МассивОтобранныхСтрок.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивОтобранныхСтрок;
	
КонецФункции

&НаКлиенте
Процедура ЗапчастиПодборНоменклатуры(Команда)
	
	Если Не Элементы.РемонтыОборудования.ТекущиеДанные = Неопределено Тогда	
	    ОбъектРемонта = Элементы.РемонтыОборудования.ТекущиеДанные.ОбъектРемонта;
		МассивЗапчастей = ПолучитьМассивЗапчастейДляОР(ОбъектРемонта);
		
		МассивТиповЗапчастей = Новый Массив();
		МассивТиповЗапчастей.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МногооборотнаяТара"));
		МассивТиповЗапчастей.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Работа"));
		МассивТиповЗапчастей.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар"));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимПодбораБезСуммовыхПараметров",         Истина);
	ПараметрыФормы.Вставить("ИспользоватьДатыОтгрузки",                  Истина);
	ПараметрыФормы.Вставить("СкрыватьКолонкуВидЦены",                    Истина);
	ПараметрыФормы.Вставить("СкрыватьКомандуЦеныНоменклатуры",           Истина);
	ПараметрыФормы.Вставить("Заголовок",                                 НСтр("es='La selección de la nomenclatura';ru='Подбор номенклатуры';en='Item selection'"));
	ПараметрыФормы.Вставить("ЗаголовокКнопкиЗапрашиватьКоличествоИЦену", НСтр("es='Pedir la cantidad';ru='Запрашивать количество';en='Request quantity'"));
	ПараметрыФормы.Вставить("Дата",                                      ТекущаяДата());
	ПараметрыФормы.Вставить("Документ",                                  Объект.Ссылка);
	ПараметрыФормы.Вставить("КлючНазначенияИспользования",				 "ПростойПодборНоменклатуры");
	ПараметрыФормы.Вставить("ОтборНоменклатуры",						 МассивЗапчастей);
	ПараметрыФормы.Вставить("ОтборПоТипуНоменклатуры",					 МассивТиповЗапчастей);
	
	ОткрытьФорму("Обработка.торо_ПодборНоменклатуры.Форма", ПараметрыФормы, Элементы.СерийныеЗапчасти, УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура СерийныеЗапчастиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ТекДанныеРемРаб = Элементы.РемонтыОборудования.ТекущиеДанные;
	
	Если ТекДанныеРемРаб = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ИмяТЧ = "СерийныеЗапчасти";
	ИмяРеквизита = "Номенклатура";
	СтруктураСтрокиОпераций = Новый Структура("РемонтыОборудования_ID, Количество", ТекДанныеРемРаб.ID);
	ДобавитьЗапчастьИзПодбора(ВыбранноеЗначение, СтруктураСтрокиОпераций, ИмяТЧ, ИмяРеквизита);
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере 
Процедура ДобавитьЗапчастьИзПодбора(Адрес, СтруктураСтроки, ИмяТЧ, ИмяРеквизита)
	
	РемонтыОборудования_ID = СтруктураСтроки.РемонтыОборудования_ID;
	
	Тз = ПолучитьИзВременногоХранилища(Адрес);
	
	СтруктураДействий = Новый Структура;
	Для каждого текСтрока из Тз Цикл
		
		СтруктураПоиска = Новый Структура("РемонтыОборудования_ID, Номенклатура, ХарактеристикаНоменклатуры", РемонтыОборудования_ID, текСтрока.Номенклатура, текСтрока.Характеристика);
		
		НайС = Объект[ИмяТЧ].НайтиСтроки(СтруктураПоиска);
		КоэфУпаковкиВыбр = ?(ЗначениеЗаполнено(текСтрока.Упаковка), текСтрока.Упаковка.Коэффициент, 1);
		Если НайС.Количество() = 0 Тогда
			нс = Объект[ИмяТЧ].Добавить();
			ЗаполнитьЗначенияСвойств(нс, текСтрока);
			нс[ИмяРеквизита] = текСтрока.Номенклатура;
			
			нс.ЕдиницаИзмерения = текСтрока.Упаковка;
			нс.Количество = текСтрока.КоличествоУпаковок * ?(ЗначениеЗаполнено(нс.Единицаизмерения), 1, КоэфУпаковкиВыбр);
			
			нс.РемонтыОборудования_ID = РемонтыОборудования_ID;
			нс.ID = РемонтыОборудования_ID;
			нс.ХарактеристикаНоменклатуры = текСтрока.Характеристика;
			нс.СтатусДвиженияСерийныхЗЧ = Перечисления.торо_ВидыДвиженияСерийныхЗЧ.ВозвратЗамена;
			нс.СтатусДвиженияНовойЗЧ = Перечисления.торо_ВидыДвиженияСерийныхЗЧ.Установка;
			нс.КоличествоНовое = 1;
		Иначе
			
			нс = НайС[0];
			
			КоэфУпаковкиСтар = ?(ЗначениеЗаполнено(нс.ЕдиницаИзмерения), нс.ЕдиницаИзмерения.Коэффициент, 1);
			КоличествоЕдиниц = (нс.Количество*КоэфУпаковкиСтар + текСтрока.КоличествоУпаковок * КоэфУпаковкиВыбр);
			нс.Количество = КоличествоЕдиниц / КоэфУпаковкиВыбр;
			нс.ЕдиницаИзмерения = текСтрока.Упаковка;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте 
Процедура ОбработкаВыбораПослеВопроса(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	МассивИДРемонтов = ДополнительныеПараметры.МассивИДДобавленныхРемонтов;
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Для каждого ЭлементМассива из МассивИДРемонтов Цикл
			ОчиститьСвязанныеТабличныеЧасти(, , ЭлементМассива);
		КонецЦикла;
		
		ОбработкаВыбораЗавершение(ДополнительныеПараметры.ВыбранноеЗначение);
		
	КонецЕсли;	
	
КонецПроцедуры 

&НаКлиенте 
Процедура ОбработкаВыбораЗавершение(ВыбранноеЗначение)
	
	ДеревоРемонтныхРаботОбработкаВыбора(, ВыбранноеЗначение, );
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") И ВыбранноеЗначение.Свойство("СтрокаРемонтовОборудования") Тогда
		ЗаполнитьДеревоРемонтныхРаботНаСервере(ВыбранноеЗначение.СтрокаРемонтовОборудования.ID);
		Если ТипЗнч(ВыбранноеЗначение.ДокументОснование) = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") Тогда
			УстановкаМатериаловПоОснованию(ВыбранноеЗначение);	
		Иначе
			УстановкаМатериалов(ВыбранноеЗначение);
		КонецЕсли;
		Если ТипЗнч(ВыбранноеЗначение.ДокументОснование) = Тип("ДокументСсылка.торо_ПланГрафикРемонта") ИЛИ 
			ТипЗнч(ВыбранноеЗначение.ДокументОснование) = Тип("ДокументСсылка.торо_ВыявленныеДефекты") ИЛИ 
			ТипЗнч(ВыбранноеЗначение.ДокументОснование) = Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот") Тогда
			УстановкаИсполнителей(ВыбранноеЗначение);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		ОбработатьВыборМассиваРемонтовНаСервере(ВыбранноеЗначение);
	КонецЕсли;
	
	ЭтоПервыйДокументВЦепочке = ЭтоПервыйДокументВЦепочке();
	ЭтоПоследнийДокументВЦепочке = ЭтоПоследнийДокументВЦепочке();
	РемонтыОборудованияОбновитьДокументыИсточники();
	ЗаполнитьЕдиницыИзмерения(ДеревоРемонтныхРабот);
	ЗаполнитьИспользованиеХарактеристикЗапчастей();
	
	Для каждого Строка Из Объект.ТрудовыеЗатраты Цикл
		Строка.ВремяРаботыТекст = СформироватьПродолжительность(Строка.ВремяРаботы);
	КонецЦикла;
	
	Для Каждого Строка Из ДеревоРемонтныхРабот.ПолучитьЭлементы() Цикл
		РазвернутьДеревоРемонтныхРабот(Строка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМассивЗапчастейДляОР(ОбъектРемонта)
	
	МассивЗапчастей = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	торо_ОбъектыРемонта.Ссылка КАК Ссылка,
		|	торо_ОбъектыРемонта.ТиповойОР КАК ТиповойОР
		|ПОМЕСТИТЬ ВТ_ОбъектРемонта
		|ИЗ
		|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|ГДЕ
		|	торо_ОбъектыРемонта.Ссылка = &ОбъектРемонта
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка,
		|	ТиповойОР
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_Запчасти.Номенклатура
		|ИЗ
		|	ВТ_ОбъектРемонта КАК ВТ_ОбъектРемонта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_Запчасти КАК торо_Запчасти
		|		ПО ВТ_ОбъектРемонта.Ссылка = торо_Запчасти.ОбъектРемонта
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_ТиповыеОРЗапчасти.Номенклатура
		|ИЗ
		|	ВТ_ОбъектРемонта КАК ВТ_ОбъектРемонта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТиповыеОР.Запчасти КАК торо_ТиповыеОРЗапчасти
		|		ПО ВТ_ОбъектРемонта.ТиповойОР = торо_ТиповыеОРЗапчасти.Ссылка";
	
	Запрос.УстановитьПараметр("ОбъектРемонта", ОбъектРемонта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивЗапчастей.Добавить(ВыборкаДетальныеЗаписи.Номенклатура);
	КонецЦикла;
	
	Возврат МассивЗапчастей;
	
КонецФункции

&НаКлиенте
Процедура УстановитьПараметрыВыбораНоменклатуры()
	
	Если Не Элементы.РемонтыОборудования.ТекущиеДанные = Неопределено Тогда
		МассивТиповЗапчастей = Новый Массив();
		МассивТиповЗапчастей.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МногооборотнаяТара"));
		МассивТиповЗапчастей.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Работа"));
		МассивТиповЗапчастей.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар"));
		
	    ОбъектРемонта = Элементы.РемонтыОборудования.ТекущиеДанные.ОбъектРемонта;
		МассивЗапчастей = ПолучитьМассивЗапчастейДляОР(ОбъектРемонта);

		ПараметрыВыбораМассив = Новый Массив;
		ПараметрыВыбораМассив.Добавить(Новый ПараметрВыбора("Отбор.ТипНоменклатуры", Новый ФиксированныйМассив(МассивТиповЗапчастей)));
		ПараметрыВыбораМассив.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(МассивЗапчастей)));
		Элементы.СерийныеЗапчастиНоменклатура.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораМассив);
		Элементы.СерийныеЗапчастиНоменклатураНовая.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораМассив);
		Элементы.СерийныеЗапчастиНоменклатура.СписокВыбора.ЗагрузитьЗначения(МассивЗапчастей);
		Элементы.СерийныеЗапчастиНоменклатураНовая.СписокВыбора.ЗагрузитьЗначения(МассивЗапчастей);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");

КонецПроцедуры

фПослеОчистки = Ложь;
РемонтОборудованияУдаляется = Ложь;

#КонецОбласти

