///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Отправляет SMS через МТС.
//
// Параметры:
//  НомераПолучателей - Массив - номера получателей в формате +7ХХХХХХХХХХ (строкой);
//  Текст             - Строка - текст сообщения, длиной не более 1000 символов;
//  ИмяОтправителя 	  - Строка - имя отправителя, которое будет отображаться вместо номера входящего SMS;
//  Логин             - Строка - логин пользователя услуги отправки sms;
//  Пароль            - Строка - пароль пользователя услуги отправки sms.
//
// Возвращаемое значение:
//  Структура: ОтправленныеСообщения - Массив структур: НомерОтправителя.
//                                                  ИдентификаторСообщения.
//             ОписаниеОшибки    - Строка - пользовательское представление ошибки, если пустая строка,
//                                          то ошибки нет.
Функция ОтправитьSMS(НомераПолучателей, Текст, ИмяОтправителя, Логин, Знач Пароль) Экспорт
	
	Результат = Новый Структура("ОтправленныеСообщения,ОписаниеОшибки", Новый Массив, "");
	
	Получатели = Новый Массив;
	Для Каждого Элемент Из НомераПолучателей Цикл
		НомерПолучателя = ФорматироватьНомер(Элемент);
		Если Получатели.Найти(НомерПолучателя) = Неопределено Тогда
			Получатели.Добавить(НомерПолучателя);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("msids", Получатели);
	ПараметрыЗапроса.Вставить("message", Текст);
	ПараметрыЗапроса.Вставить("naming", ИмяОтправителя);
	
	Если ЗначениеЗаполнено(Логин) Тогда
		ПараметрыЗапроса.Вставить("login", Логин);
		ПараметрыЗапроса.Вставить("password", ОбщегоНазначения.КонтрольнаяСуммаСтрокой(Пароль));
	КонецЕсли;
	
	РезультатЗапроса = ВыполнитьЗапрос("SendMessages", ПараметрыЗапроса);
	Если Не РезультатЗапроса.ЗапросВыполнен Тогда
		Результат.ОписаниеОшибки = ОписаниеОшибкиПоКоду(РезультатЗапроса.ОтветСервера);
		Возврат Результат;
	КонецЕсли;
	
	ДокументDOM = ДокументDOM(РезультатЗапроса.ОтветСервера);
	Разыменователь = ДокументDOM.СоздатьРазыменовательПИ();
	
	ОтправленныеСообщения = ДокументDOM.ВычислитьВыражениеXPath("/xmlns:ArrayOfSendMessageIDs/xmlns:SendMessageIDs",
		ДокументDOM, Разыменователь);
	
	Сообщение = ОтправленныеСообщения.ПолучитьСледующий();
	Пока Сообщение <> Неопределено Цикл
		НомерПолучателя = ДокументDOM.ВычислитьВыражениеXPath("xmlns:Msid", Сообщение, Разыменователь).ПолучитьСледующий().ТекстовоеСодержимое;
		ИдентификаторСообщения = ДокументDOM.ВычислитьВыражениеXPath("xmlns:MessageID", Сообщение, Разыменователь).ПолучитьСледующий().ТекстовоеСодержимое;
		
		Результат.ОтправленныеСообщения.Добавить(Новый Структура("НомерПолучателя,ИдентификаторСообщения",
			"+" +  НомерПолучателя, Формат(ИдентификаторСообщения, "ЧГ=")));
		
		Сообщение = ОтправленныеСообщения.ПолучитьСледующий();
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает текстовое представление статуса доставки сообщения.
//
// Параметры:
//  ИдентификаторСообщения - Строка - идентификатор, присвоенный sms при отправке;
//  НастройкиОтправкиSMS   - Структура - см. ОтправкаSMSПовтИсп.НастройкиОтправкиSMS;
//
// Возвращаемое значение:
//  Строка - статус доставки. См. описание функции ОтправкаSMS.СтатусДоставки.
Функция СтатусДоставки(ИдентификаторСообщения, НастройкиОтправкиSMS) Экспорт
	
	Результат = "Ошибка";
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("messageID", ИдентификаторСообщения);
	
	Если ЗначениеЗаполнено(НастройкиОтправкиSMS.Логин) Тогда
		ПараметрыЗапроса.Вставить("login", НастройкиОтправкиSMS.Логин);
		ПараметрыЗапроса.Вставить("password", ОбщегоНазначения.КонтрольнаяСуммаСтрокой(НастройкиОтправкиSMS.Пароль));
	КонецЕсли;
	
	РезультатЗапроса = ВыполнитьЗапрос("GetMessageStatus", ПараметрыЗапроса);
	Если Не РезультатЗапроса.ЗапросВыполнен Тогда
		Возврат Результат;
	КонецЕсли;
	
	ДокументDOM = ДокументDOM(РезультатЗапроса.ОтветСервера);
	Разыменователь = ДокументDOM.СоздатьРазыменовательПИ();
	
	НайденныйЭлемент = ДокументDOM.ВычислитьВыражениеXPath("/xmlns:ArrayOfDeliveryInfo/xmlns:DeliveryInfo/xmlns:DeliveryStatus",
		ДокументDOM, Разыменователь).ПолучитьСледующий();
		
	Если НайденныйЭлемент = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = СтатусДоставкиSMS(НайденныйЭлемент.ТекстовоеСодержимое);
	Возврат Результат;
	
КонецФункции

Функция ФорматироватьНомер(Номер)
	Результат = "";
	ДопустимыеСимволы = "1234567890";
	Для Позиция = 1 По СтрДлина(Номер) Цикл
		Символ = Сред(Номер,Позиция,1);
		Если СтрНайти(ДопустимыеСимволы, Символ) > 0 Тогда
			Результат = Результат + Символ;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

Функция СтатусДоставкиSMS(СтатусСтрокой)
	СоответствиеСтатусов = Новый Соответствие;
	СоответствиеСтатусов.Вставить("Pending", "НеОтправлялось");
	СоответствиеСтатусов.Вставить("Sending", "Отправляется");
	СоответствиеСтатусов.Вставить("Sent", "Отправлено");
	СоответствиеСтатусов.Вставить("NotSent", "НеОтправлено");
	СоответствиеСтатусов.Вставить("Delivered", "Доставлено");
	СоответствиеСтатусов.Вставить("NotDelivered", "НеДоставлено");
	СоответствиеСтатусов.Вставить("TimedOut", "НеДоставлено");
	
	Результат = СоответствиеСтатусов[СтатусСтрокой];
	Возврат ?(Результат = Неопределено, "Ошибка", Результат);
КонецФункции

Функция ОписанияОшибок()
	ОписанияОшибок = Новый Соответствие;
	ОписанияОшибок.Вставить("SYSTEM_FAILURE", НСтр("es='El problema temporal a la parte del MTS.';ru='Временная проблема на стороне МТС.';en='Temporary problem on the MTS side.'"));
	ОписанияОшибок.Вставить("TOO_MANY_PARAMETERS", НСтр("es='Es superado el número máximo de los parámetros.';ru='Превышено максимальное число параметров.';en='Maximum parameters number exceeded.'"));
	ОписанияОшибок.Вставить("INCORRECT_PASSWORD", НСтр("es='Concedido al login/consigna no son justo.';ru='Предоставленные логин/пароль не верны.';en='Provided username / password is not correct.'"));
	ОписанияОшибок.Вставить("MSID_FORMAT_ERROR", НСтр("es='El formato del número equivocado.';ru='Формат номера неверный.';en='The format of the number is incorrect.'"));
	ОписанияОшибок.Вставить("MESSAGE_FORMAT_ERROR", НСтр("es='La falta en el formato del mensaje.';ru='Ошибка в формате сообщения.';en='Error in message format.'"));
	ОписанияОшибок.Вставить("WRONG_ID", НСтр("es='Es entregado el identificador equivocado.';ru='Передан неверный идентификатор.';en='Invalid identifier passed.'"));
	ОписанияОшибок.Вставить("MESSAGE_HANDLING_ERROR", НСтр("es='La falta en el tratamiento del mensaje';ru='Ошибка в обработке сообщения';en='Error processing message'"));
	ОписанияОшибок.Вставить("NO_SUCH_SUBSCRIBER", НСтр("es='El abonado dado no es registrado en el Servicio en la anotación de descuento del cliente (o no ha dado la confirmación).';ru='Данный абонент не зарегистрирован в Услуге в учетной записи клиента (или еще не дал подтверждение).';en=""This subscriber is not registered in the Service in the client's account (or has not yet given confirmation)."""));
	ОписанияОшибок.Вставить("TEST_LIMIT_EXCEEDED", НСтр("es='Es superado el límite por la cantidad de los mensajes en la explotación de test.';ru='Превышен лимит по количеству сообщений в тестовой эксплуатации.';en='The limit on the number of messages in test operation is exceeded.'"));
	ОписанияОшибок.Вставить("TRUSTED_LIMIT_EXCEEDED", НСтр("es='Es superado el límite por la cantidad de los mensajes para los abonados, que eran añadidos sin confirmación.';ru='Превышен лимит по количеству сообщений для абонентов, которые были добавлены без подтверждения.';en='Exceeded the limit on the number of messages for subscribers who were added without confirmation.'"));
	ОписанияОшибок.Вставить("IP_NOT_ALLOWED", НСтр("es='El acceso al servicio con dado IP es imposible (la lista de las IP-direcciones admisibles se puede es indicado a la conexión del servicio).';ru='Доступ к сервису с данного IP невозможен (список допустимых IP-адресов можно указывается при подключении услуги).';en='Access to the service from this IP is not possible (a list of valid IP addresses can be specified when connecting the service).'"));
	ОписанияОшибок.Вставить("MAX_LENGTH_EXCEEDED", НСтр("es='Es superada la longitud máxima del mensaje (1000 símbolos).';ru='Превышена максимальная длина сообщения (1000 символов).';en='Maximum message length exceeded (1000 characters).'"));
	ОписанияОшибок.Вставить("OPERATION_NOT_ALLOWED", НСтр("es='El usuario del servicio no tiene los derechos a la ejecución de la operación dada.';ru='Пользователь услуги не имеет прав на выполнение данной операции.';en='User of the service does not have the right to perform this operation.'"));
	ОписанияОшибок.Вставить("EMPTY_MESSAGE_NOT_ALLOWED", НСтр("es='El envío de los mensajes vacíos no se permite.';ru='Отправка пустых сообщений не допускается.';en='Sending empty messages is not allowed.'"));
	ОписанияОшибок.Вставить("ACCOUNT_IS_BLOCKED", НСтр("es='La anotación de descuento es bloqueada, el envío de los mensajes no es posible.';ru='Учетная запись заблокирована, отправка сообщений не возможна.';en='The account is blocked, sending messages is not possible.'"));
	ОписанияОшибок.Вставить("OBJECT_ALREADY_EXISTS", НСтр("es='La lista del envío con el nombre indicado existe ya en los límites de la compañía.';ru='Список рассылки с указанным названием уже существует в рамках компании.';en='A mailing list with the specified name already exists within the company.'"));
	ОписанияОшибок.Вставить("MSID_IS_IN_BLACKLIST", НСтр("es='El número del abonado se encuentra en la lista negra, el envío de los mensajes es prohibido.';ru='Номер абонента находится в черном списке, отправка сообщений запрещена.';en='The subscriber number is in the black list, sending messages is prohibited.'"));
	ОписанияОшибок.Вставить("MSIDS_ARE_IN_BLACKLIST", НСтр("es='Todos los números indicados de los abonados se encuentran en la lista negra, el envío de los mensajes es prohibido.';ru='Все указанные номера абонентов находятся в черном списке, отправка сообщений запрещена.';en='All indicated numbers of subscribers are in the black list, sending messages is prohibited.'"));
	ОписанияОшибок.Вставить("TIME_IS_IN_THE_PAST", НСтр("es='El tiempo entregado en pasado.';ru='Переданное время в прошлом.';en='Transmitted time in the past.'"));
	
	Возврат ОписанияОшибок;
КонецФункции

Функция ОписаниеОшибкиПоКоду(Знач КодОшибки)
	КодОшибки = СокрЛП(КодОшибки);
	ОписанияОшибок = ОписанияОшибок();
	ТекстСообщения = ОписанияОшибок[КодОшибки];
	Если ТекстСообщения = Неопределено Тогда
		ТекстСообщения = НСтр("es='La renuncia de la ejecución de la operación.';ru='Отказ выполнения операции.';en='Failure to complete the operation.'") + Символы.ПС
			+ КодОшибки;
	КонецЕсли;
	Возврат ТекстСообщения;
КонецФункции

// Возвращает список разрешений для отправки SMS с использованием всех доступных провайдеров.
//
// Возвращаемое значение:
//  Массив.
//
Функция Разрешения() Экспорт
	Протокол = "HTTPS";
	Адрес = "https://mcommunicator.ru";
	Порт = Неопределено;
	Описание = НСтр("es='El envío SMS a través del MTS.';ru='Отправка SMS через МТС.';en='Sending SMS via MTS.'");
	
	МодульРаботаВБезопасномРежиме = ОбщегоНазначения.ОбщийМодуль("РаботаВБезопасномРежиме");
	
	Разрешения = Новый Массив;
	Разрешения.Добавить(
		МодульРаботаВБезопасномРежиме.РазрешениеНаИспользованиеИнтернетРесурса(Протокол, Адрес, Порт, Описание));
	
	Возврат Разрешения;
КонецФункции

Функция ВыполнитьЗапрос(ИмяМетода, ПараметрыЗапроса)
	
	Результат = Новый Структура;
	Результат.Вставить("ЗапросВыполнен", Ложь);
	Результат.Вставить("ОтветСервера", "");
	
	HTTPЗапрос = ОтправкаSMS.ПодготовитьHTTPЗапрос("/m2m/m2m_api.asmx/" + ИмяМетода, ПараметрыЗапроса, Ложь);
	HTTPОтвет = Неопределено;
	
	Попытка
		Соединение = Новый HTTPСоединение("api.mcommunicator.ru", , , , ПолучениеФайловИзИнтернета.ПолучитьПрокси("https"),
			60, ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение());
			
		HTTPОтвет = Соединение.Получить(HTTPЗапрос);
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("es='El envío SMS';ru='Отправка SMS';en='SMS sending'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Результат.ЗапросВыполнен = HTTPОтвет.КодСостояния = 200;
	Результат.ОтветСервера = HTTPОтвет.ПолучитьТелоКакСтроку();
	
	Возврат Результат;
	
КонецФункции

Процедура ПриОпределенииНастроек(Настройки) Экспорт
	
	Настройки.АдресОписанияУслугиВИнтернете = "http://www.mtscommunicator.ru/service/";
	Настройки.ПриОпределенииСпособовАвторизации = Истина;
	
КонецПроцедуры

Процедура ПриОпределенииСпособовАвторизации(СпособыАвторизации) Экспорт
	
	ПоляАвторизации = Новый СписокЗначений;
	ПоляАвторизации.Добавить("Пароль", НСтр("es='La llave API';ru='Ключ API';en='API key'"));
	
	СпособыАвторизации.Вставить("ПоКлючу", ПоляАвторизации);
	
КонецПроцедуры

Функция ДокументDOM(Строка)
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(Строка);
	ПостроительDOM = Новый ПостроительDOM;
	ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);
	ЧтениеXML.Закрыть();
	
	Возврат ДокументDOM;
	
КонецФункции

#КонецОбласти
