
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РодительВерхнегоУровня = Неопределено;
	Если Параметры.Свойство("РодительВерхнегоУровня", РодительВерхнегоУровня) Тогда
		Элементы.Список.РодительВерхнегоУровня = РодительВерхнегоУровня;
	КонецЕсли;
	
	Параметры.Свойство("ПараметрыВыбора", ПараметрыВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	ПроверитьЗначениеНаСервере(Значение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗначениеНаСервере(Значение, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ПараметрыВыбора) Тогда
		СписокПараметров = "";
		Для Каждого КлючИЗначение ИЗ ПараметрыВыбора Цикл
			СписокПараметров = СписокПараметров + ?(ПустаяСтрока(СписокПараметров), "", ", ") + КлючИЗначение.Ключ;
		КонецЦикла;
		
		ЗначенияРеквизитов = УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначенияРеквизитовОбъекта(Значение, СписокПараметров);
		
		Для Каждого КлючИЗначение ИЗ ПараметрыВыбора Цикл
			Если НЕ КлючИЗначение.Значение = ЗначенияРеквизитов[КлючИЗначение.Ключ] Тогда
				СтандартнаяОбработка = Ложь;
				Возврат;
			КонецЕсли;
		КонецЦикла;
			
	КонецЕсли;
	
КонецПроцедуры
