
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Найти(Наименование, "№") Тогда
		ТекстСообщения = НСтр("es='En el nombre de la calificación se prohíbe usar el símbolo ""№"".';ru='В наименовании квалификации запрещено использовать символ ""№"".';en='It is forbidden to use the symbol ""No."" in the name of the qualification.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Объект.Наименование",, Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти