#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Компоновщик.ЗагрузитьНастройки(Параметры.КомпоновщикНастройки);
	ОтборПоПоказателю = ПредопределенноеЗначение("Справочник.ПараметрыВыработкиОС.гкс_ПоЧасам");
	ЗаполнитьТЧ();
	ОбновитьНадписьКолВоЭлементов();      
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборПоПоказателюПриИзменении(Элемент)
	ОтборПоПоказателюПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НовоеЗначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ПеренестиЗначениеВТЧ();		
КонецПроцедуры

&НаКлиенте
Процедура НовоеЗначениеПриИзменении(Элемент)
	ПеренестиЗначениеВТЧ();		                          	
КонецПроцедуры

&НаКлиенте
Процедура ИзменяемыйРеквизитПриИзменении(Элемент)
	Если ИзменяемыйРеквизит <> "" И ТЧНаработка.Количество() > 0 Тогда
		Тип = ТипЗнч(ЭтаФорма.ТЧНаработка[0][ИзменяемыйРеквизит]);
		Типы = Новый Массив;
		Типы.Добавить(Тип);
		
        Элементы.НовоеЗначение.ОграничениеТипа = Новый ОписаниеТипов(Типы);
	    Значение = НовоеЗначение;
	    НовоеЗначение = Элементы.НовоеЗначение.ОграничениеТипа.ПривестиЗначение(Значение);
	    Элементы.НовоеЗначение.ВыбиратьТип = Ложь;
	КонецЕсли;               	
КонецПроцедуры

&НаКлиенте
Процедура ТЧНаработкаПриИзменении(Элемент)
	ТЧНаработкаПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Установить(Команда)
	УстановитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗаполнитьТЧ()
	
	ТЧНаработка.Очистить();
	
	ОбъектыРемонта = ВыбранныеОбъекты();
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ОбъектыРемонта.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ОобъектыРемонта
		|ИЗ
		|	&ОбъектыРемонта КАК ОбъектыРемонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОобъектыРемонта.Ссылка КАК ОбъектРемонта,
		|	ЕСТЬNULL(Наработка.Показатель, &Показатель) КАК Показатель,
		|	ЕСТЬNULL(Наработка.ПлановаяНаработка, 0) КАК ПлановаяНаработка,
		|	ЕСТЬNULL(Наработка.ПериодПлановойНаработки, ЗНАЧЕНИЕ(Перечисление.Периодичность.пустаяссылка)) КАК ПериодПлановойНаработки,
		|	ЕСТЬNULL(Наработка.ПродолжительностьПериодаПлановойНаработки, 0) КАК ПродолжительностьПериодаПлановойНаработки,
		|	ЕСТЬNULL(Наработка.КоэффициентИспользованияОборудования, 0) КАК КоэффициентИспользованияОборудования,
		|	ЕСТЬNULL(Наработка.Основной, ЛОЖЬ) КАК Основной
		|ИЗ
		|	ВТ_ОобъектыРемонта КАК ВТ_ОобъектыРемонта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ПараметрыНаработкиОбъектовРемонта.СрезПоследних(
		|				,
		|				ОбъектРемонта В
		|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|							ВТ_ОобъектыРемонта.Ссылка КАК Ссылка
		|						ИЗ
		|							ВТ_ОобъектыРемонта КАК ВТ_ОобъектыРемонта)
		|					И Показатель = &Показатель) КАК Наработка
		|		ПО ВТ_ОобъектыРемонта.Ссылка = Наработка.ОбъектРемонта";
	
	Запрос.УстановитьПараметр("ОбъектыРемонта", ОбъектыРемонта);
	Запрос.УстановитьПараметр("Показатель", ОтборПоПоказателю);
	
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	ТЧНаработка.Загрузить(РезультатЗапроса);	
	
КонецФункции

&НаСервере
Функция ВыбранныеОбъекты()
	
	Результат = Новый ДеревоЗначений;
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ТекстЗапроса = ОбработкаОбъект.ТекстЗапроса("Справочник.торо_ОбъектыРемонта", Истина);
	СхемаКомпоновкиДанных = СхемаКомпоновкиДанных(ТекстЗапроса);
	
	КомпоновщикНастроекКомпоновкиДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
	АдресСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
	КомпоновщикНастроекКомпоновкиДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы));
	КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(Компоновщик.Настройки);
	
	Результат = Новый ТаблицаЗначений;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Попытка
		МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,
			КомпоновщикНастроекКомпоновкиДанных.Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	Исключение
		ТекстСообщенияОбОшибке = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат Результат;
	КонецПопытки;
		
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(Результат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Возврат Результат;
	
КонецФункции             

&НаСервере
Функция СхемаКомпоновкиДанных(ТекстЗапроса)
	
	СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных;
	
	ИсточникДанных = СхемаКомпоновкиДанных.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя = "ИсточникДанных1";
	ИсточникДанных.ТипИсточникаДанных = "local";
	
	НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.ИсточникДанных = "ИсточникДанных1";
	НаборДанных.АвтоЗаполнениеДоступныхПолей = Истина;
	НаборДанных.Запрос = ТекстЗапроса;
	НаборДанных.Имя = "НаборДанных1";
	
	Возврат СхемаКомпоновкиДанных;
	
КонецФункции

&НаСервере
Процедура ОтборПоПоказателюПриИзмененииНаСервере()
	
	ЗаполнитьТЧ();		
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиЗначениеВТЧ()
	
	Если ЗначениеЗаполнено(НовоеЗначение) 
		И ЗначениеЗаполнено(ИзменяемыйРеквизит) Тогда
		Для каждого ТекСтрока Из ТЧНаработка Цикл
			ТекСтрока[ИзменяемыйРеквизит] = НовоеЗначение;
		КонецЦикла;   		
	КонецЕсли; 
	
КонецПроцедуры     

&НаСервере
Процедура УстановитьНаСервере()
	
	ДатаСеанса = НачалоДня(ТекущаяДатаСеанса());
	Для каждого ТекущаяСтрока Из ТЧНаработка Цикл
		НаборЗаписей = РегистрыСведений.торо_ПараметрыНаработкиОбъектовРемонта.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(ДатаСеанса);
		НаборЗаписей.Отбор.ОбъектРемонта.Установить(ТекущаяСтрока.ОбъектРемонта);
		НаборЗаписей.Отбор.Показатель.Установить(ТекущаяСтрока.Показатель);
		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, ТекущаяСтрока);
		НоваяЗапись.Период = ДатаСеанса;
		НаборЗаписей.Записать();
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНадписьКолВоЭлементов()
	
	КоличествоВыбранныхОбъектов = ТЧНаработка.Количество();
	
	ТекстНадписи = СтрокаСЧисломДляЛюбогоЯзыка(НСтр("es='; %1 elemento;; %1 elementos; %1 elementos; %1 elementos';ru=';%1 элемент;;%1 элемента;%1 элементов;%1 элемента';en=';%1 element;;%1 element;%1 elements;%1 element'"),
			КоличествоВыбранныхОбъектов);
			
	Элементы.НадписьКоличествоЭлементов.Заголовок = ТекстНадписи;
	
КонецПроцедуры

// Формирует представление числа для определенного языка и параметров числа.
//
// Параметры:
//  Шаблон          - Строка - Строка, содержит перечисленные через точку с запятой 6 форм строки
//                             для каждой категории числительного: 
//                             - %1 обозначает позицию числа;
//  Число           - Число - Число, которое будет подставлено в строку вместо параметра "%1".
//  Вид             - ВидЧисловогоЗначения - Определяет вид числового значения, для которого формируется представление. 
//                             - Количественное (по умолчанию) или Порядковое.
//  ФорматнаяСтрока - Строка - Строка параметров форматирования. См. аналогичный параметр в СтрокаСЧислом. 
//
// Возвращаемое значение:
//  Строка - Представление строки числа в требуемой форме.
//
// Пример:
//  
//  Строка = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
//		НСтр("ru=';остался %1 день;;осталось %1 дня;осталось %1 дней;осталось %1 дня';
//		     |en=';left %1 day;;;;left %1 days'"), 
//		0.05,, "ЧДЦ=1");
// 
&НаСервереБезКонтекста
Функция СтрокаСЧисломДляЛюбогоЯзыка(Шаблон, Число, Вид = Неопределено, ФорматнаяСтрока = Неопределено)

	Если ПустаяСтрока(Шаблон) Тогда
		Возврат Формат(Число, ФорматнаяСтрока); 
	КонецЕсли;

	Если Вид = Неопределено Тогда
		Вид = ВидЧисловогоЗначения.Количественное;
	КонецЕсли;

	Возврат СтрокаСЧислом(Шаблон, Число, Вид, ФорматнаяСтрока);

КонецФункции

&НаСервере
Процедура ТЧНаработкаПриИзмененииНаСервере()
	ОбновитьНадписьКолВоЭлементов();
КонецПроцедуры

#КонецОбласти
