#Область ОбработчикиСобытийФормы

&НаСервере
Процедура Расш_гкс_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ДобавитьНовыеЭлементы();
КонецПроцедуры

&НаСервере
Процедура ДобавитьНовыеЭлементы();
	НЭлем = Элементы.Добавить("гкс_ГруппаКод", Тип("ГруппаФормы"));
	НЭлем.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НЭлем.ОтображатьЗаголовок = Ложь;
	Элементы.Переместить(Элементы.Код, Элементы["гкс_ГруппаКод"]);
	Элементы.Переместить(Элементы["гкс_ГруппаКод"],ЭтаФорма,Элементы.Наименование);
	
	НЭлем = Элементы.Добавить("гкс_Кодировка", Тип("ПолеФормы"), Элементы["гкс_ГруппаКод"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Объект.гкс_Кодировка";
	// >> [Деснол] [КПИ] [19.11.2020]
	НЭлем = Элементы.Добавить("гкс_Служба", Тип("ПолеФормы"), Элементы["гкс_ГруппаКод"]);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Объект.гкс_Служба";
	// << [Деснол] [КПИ] [19.11.2020]
КонецПроцедуры

#КонецОбласти