
Функция ПолучитьМетаданныеРеквизита(МетаданныеСпр, ЗначениеПеречисления) Экспорт
	
	ИндексЭлементаПеречисления = Перечисления.РеквизитыНоменклатурыКласса.Индекс(ЗначениеПеречисления);
	МетаданныеЭлементаПеречисления = Метаданные.Перечисления.РеквизитыНоменклатурыКласса.ЗначенияПеречисления.Получить(ИндексЭлементаПеречисления);
	Если НЕ МетаданныеСпр = Неопределено Тогда
		Если ЭтоСтандартныйРеквизит(ЗначениеПеречисления) Тогда
			РеквизитСпр = МетаданныеСпр.СтандартныеРеквизиты[МетаданныеЭлементаПеречисления.Имя];
		Иначе
			РеквизитСпр = МетаданныеСпр.Реквизиты.Найти(МетаданныеЭлементаПеречисления.Имя);
		КонецЕсли;
	КонецЕсли;
	
	Возврат РеквизитСпр;
	
КонецФункции

Функция ЭтоСтандартныйРеквизит(ЗначениеПеречисления) Экспорт
	
	Результат = Ложь;
	Если ЗначениеПеречисления = Перечисления.РеквизитыНоменклатурыКласса.Код 
		Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
