#Область ОбработчикиСобытийФормы

&НаСервере
Процедура гкс_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВремяНачалаОткрытияФормы") Тогда
		ВремяНачалаЗамера = Параметры.ВремяНачалаОткрытияФормы;		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура гкс_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("Основание") И ТипЗнч(Параметры.Основание) <> Тип("Соответствие") Тогда
		торо_ЗаполнениеДокументов.ПроверитьВозможностьВводаНаОсновании(Параметры.Основание,Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли;

	Если Параметры.Свойство("Основание") И Параметры.Свойство("ВыделенныеСтроки") Тогда
		ДокОснованиеППР = Параметры.Основание;
		МассивIDИзППР.ЗагрузитьЗначения(Параметры.ВыделенныеСтроки);
	КонецЕсли;

	Если Параметры.Свойство("ID") Тогда

		Строки = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", Параметры.ID));
		Если Строки.Количество() Тогда
			Элементы.РемонтыОборудования.ТекущаяСтрока = Строки[0].ПолучитьИдентификатор();
		КонецЕсли;

	КонецЕсли;
	#Вставка
	// гкс+ [Релиз16] Деснол
	Если Не ЗначениеЗаполнено(Объект.Ссылка) И Не Отказ Тогда 
		Если Объект.РемонтыОборудования.Количество() Тогда 
			гкс_ПроверитьЗакрытостьРемонта(Отказ);
		КонецЕсли;
		Если Отказ Тогда 
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Ремонт завершен. Создание акта запрещено.'"));
			Возврат;
		КонецЕсли;
	КонецЕсли;
	// гкс- [Релиз16]
	#КонецВставки

	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

	УстановитьУсловноеОформление();

	// функциональные опции
	ФОУчетЗапчастей             = ПолучитьФункциональнуюОпцию("торо_УчетЗапчастей");
	ФОУчетСостоянияОборудования = ПолучитьФункциональнуюОпцию("торо_УчетСостоянияОборудования");
	ФОИспользоватьГарантии      = ПолучитьФункциональнуюОпцию("торо_ИспользоватьГарантии");
	ФОЗапретитьРемонтГарантийногоОборудованияХозспособом = ПолучитьФункциональнуюОпцию("торо_ЗапретитьРемонтГарантийногоОборудованияХозспособом");
	ФОИспользоватьОстановочные	= ПолучитьФункциональнуюОпцию("торо_ИспользоватьОстановочныеРемонты");
	ФОНапоминатьЗафиксироватьПростой = ПолучитьФункциональнуюОпцию("торо_НапоминатьЗафиксироватьПростой");
	ФОВводПотребленияНаОснованииПроведенного = Константы.торо_ВводПотребленияНаОснованииПроведенногоАкта.Получить();
	ФОВводОприходованияНаОснованииПроведенного = Константы.торо_ВводОприходованияНаОснованииПроведенногоАкта.Получить();

	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда

		ОписаниеОшибки = "";
		Если слкМенеджерЗащиты.ПроверитьЛицензииСеанса(ОписаниеОшибки) <> Истина Тогда
			ТекстСообщения = НСтр("es='¡La licencia no es descubierta! La creación del documento es imposible.';ru='Лицензия не обнаружена! Создание документа невозможно.';en='No license found! Creating a document is not possible.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Возврат;
		КонецЕсли;				

		СлужебныеРеквизитыЗаполнитьНаСервере();

		Если ФОИспользоватьГарантии Тогда
			Для каждого ТекСтрока из Объект.РемонтыОборудования Цикл
				ТекСтрока.ГарантийныйРемонт = торо_ГарантийноеОбслуживание.ПолучитьЗначениеФлагаГарантийныйРемонтДляОбъектаРемонта(
				ТекСтрока.ОбъектРемонта, ТекСтрока.ДатаНачала, ТекСтрока.ДатаОкончания);
			КонецЦикла;
		КонецЕсли;			

	КонецЕсли;
    #Удаление
	ЗаполнитьДеревоРемонтныхРаботНаСервере();
    #КонецУдаления 
	#Вставка
	// Гкс+[TOIR20-609] Вялых Д.А. от 24.07.2025. Добавлено:{
	гкс_ЗаполнитьДеревоРемонтныхРаботЗапросомНаСервере(); 
	// } Гкс-[TOIR20-609] Вялых Д.А. от 24.07.2025.
	#КонецВставки
	ФОИспользоватьУсложненнуюСхемуЗакрытияНарядов = ПолучитьФункциональнуюОпцию("торо_ИспользоватьУсложненнуюСхемуЗакрытияНарядов");
	Элементы.ДеревоРемонтныхРаботВыполнено.Видимость = НЕ ФОИспользоватьУсложненнуюСхемуЗакрытияНарядов;

	ОбновитьДокументыВнутреннегоПотребленияСервер();
	ОбновитьДокументыОприходованияИзлишковСервер();

	// Заголовок формы++
	торо_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(Объект, ЭтаФорма, "");
	// Заголовок формы--

	// Согласование++
	ВидДокумента = Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_АктОВыполненииЭтапаРабот;
	торо_РаботаССогласованиями.ПриСозданииНаСервере(ЭтаФорма, ВидДокумента);
	// Согласование --

	ОтметитьНаличиеАналогов();

	РемонтыОборудованияОбновитьДокументыИсточники();

	ПравоРедактирование = ПравоДоступа("Редактирование", Метаданные.Документы.торо_АктОВыполненииЭтапаРабот);
	ПравоИнтерактивноеДобвалениеВнутреннихПотреблений = ПравоДоступа("ИнтерактивноеДобавление", Метаданные.Документы.ВнутреннееПотреблениеТоваров);
	ПравоИнтерактивнаяПометкаУдаленияВнутреннихПотреблений = ПравоДоступа("ИнтерактивнаяПометкаУдаления", Метаданные.Документы.ВнутреннееПотреблениеТоваров);
	ПравоИнтерактивноеДобвалениеОприходованияИзлишков = ПравоДоступа("ИнтерактивноеДобавление", Метаданные.Документы.ОприходованиеИзлишковТоваров);
	ПравоИнтерактивнаяПометкаУдаленияОприходованияИзлишков = ПравоДоступа("ИнтерактивнаяПометкаУдаления", Метаданные.Документы.ОприходованиеИзлишковТоваров);

	Элементы.СтраницаЗапчасти.Видимость = ФОУчетЗапчастей;

	// Ограничение ввода на основании
	торо_СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка, Новый Структура("ОграничитьВводНаОсновании, ДокументыОснования, УстановитьСвойствоЭлементовФормыОтПрав",Истина, Истина, Истина));
	// Конец ограничение ввода на основании

	ФОИспользоватьНарядДопуск = ПолучитьФункциональнуюОпцию("торо_ИспользоватьНарядДопускНаРаботыПовышеннойОпасностиОбязательно");

	Если Параметры.Свойство("Основание") и ТипЗнч(Параметры.Основание) = Тип("Соответствие") Тогда
		ВТ_ТабОперацийБезНаряда = ЭтотОбъект.ТабОперацийБезНаряда.Выгрузить();
		Для каждого Стр Из Параметры.Основание Цикл
			ДокОснованиеЗаявка = Стр.Значение;
			Если ФОИспользоватьНарядДопуск И ЗначениеЗаполнено(ДокОснованиеЗаявка) И НЕ ТипЗнч(ДокОснованиеЗаявка) = Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот") Тогда
				ЗаполнитьТабОперацийБезНаряда(ДокОснованиеЗаявка, Стр.Ключ);
				Для Каждого Строка Из ТабОперацийБезНаряда Цикл
					НС= ВТ_ТабОперацийБезНаряда.Добавить();
					ЗаполнитьЗначенияСвойств(НС, Строка);
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		ТабОперацийБезНаряда.Загрузить(ВТ_ТабОперацийБезНаряда);
	Иначе
		ДокОснованиеЗаявка = Параметры.Основание;
		Если ФОИспользоватьНарядДопуск И ЗначениеЗаполнено(ДокОснованиеЗаявка) И НЕ ТипЗнч(ДокОснованиеЗаявка) = Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот") Тогда
			ЗаполнитьТабОперацийБезНаряда(ДокОснованиеЗаявка);
		КонецЕсли;
	КонецЕсли;


	Для каждого Строка Из Объект.ТрудовыеЗатраты Цикл
		Если НЕ ЗначениеЗаполнено(Строка.ВремяРаботы) Тогда
			Строка.ВремяРаботы = Строка.ДатаОкончания - Строка.ДатаНачала;
		КонецЕсли;
		Строка.ВремяРаботыТекст = СформироватьПродолжительность(Строка.ВремяРаботы);
	КонецЦикла;

	ОбновитьДоступностьДляРедактирования();

	Если ФОИспользоватьОстановочные Тогда
		ОбновитьОстановочные();
	КонецЕсли;

	ОбновитьЗависимыеЛоты();

	УправлениеВидимостью(ЭтотОбъект);

	ЭтоПервыйДокументВЦепочке = ЭтоПервыйДокументВЦепочке();
	ЭтоПоследнийДокументВЦепочке = ЭтоПоследнийДокументВЦепочке();
	#Вставка
	// гкс+ [Релиз16] Деснол
	торо_ЗаполнениеДокументов.гкс_ПроверитьВозможностьВводаОтСтатуса(Объект, Отказ);
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	// гкс- [Релиз16]
	
	// гкс+ [Часовые пояса] Куст 
	гкс_ЧасовыеПоясаВызовСервера.ДобавитьНовыеЭлементы(ЭтаФорма, Элементы.ДатаИНомер,
		Новый Структура("гкс_РеквизитыДаты", 
		"Дата,РемонтыОборудования.ДатаНачала,РемонтыОборудования.ДатаОкончания"
		+ ",ТрудовыеЗатраты.ДатаНачала,ТрудовыеЗатраты.ДатаОкончания"
		+ ",ИсполнителиПоРемонтам.ДатаНачала,ИсполнителиПоРемонтам.ДатаОкончания"));
	
	ДобавитьНовыеЭлементы();
	// гкс+ [КатегорияРиска] Куст 
	гкс_ОбщегоНазначенияСервер.ДобавитьКатегориюРискаВТЧ(ЭтаФорма, "РемонтыОборудования", "ДатыРемонта");
	
	// гкс+ [Релиз 1] Куст 
	Элементы.СпособСогласования.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
	// гкс+ [05.23] Деснол 10.05.2023
	Если Параметры.Ключ.Пустая() И Объект.РемонтыОборудования.Количество() > 1 Тогда 
		ВернутьПорядокРемонтовПоОснованию();
	КонецЕсли;
	// гкс- [05.23] Деснол 10.05.2023
	#КонецВставки

КонецПроцедуры

&НаСервере
Процедура гкс_ПриЧтенииНаСервереПосле(ТекущийОбъект)
	// гкс+ [Часовые пояса] Куст 
	СтруктураПроверки = Новый Структура("гкс_СдвигЧП", Неопределено);
	ЗаполнитьЗначенияСвойств(СтруктураПроверки, ЭтотОбъект);
	Если Не СтруктураПроверки.гкс_СдвигЧП = Неопределено Тогда 
		гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПКлиента(ЭтаФорма,, Объект);
	КонецЕсли;
	// гкс+ [Категории риска] Куст
	гкс_ОбщегоНазначенияСервер.ДобавитьУОКатегорииРиска(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура гкс_ПриОткрытииПосле(Отказ) 
	
	// Гкс+[TOIR20-608] Вялых Д.А. от 21.07.2025. Добавлено и закомментировано:{
	//ПриОткрытииНаСервере(ТекущаяДата());
		
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("Метаданные", "Акт о выполнении этапа работ");
	СтруктураПараметров.Вставить("СтрокаВидаОперации", "");
	СтруктураПараметров.Вставить("Номер", Объект.Номер);
	СтруктураПараметров.Вставить("Дата", Объект.Дата); 
	СтруктураПараметров.Вставить("Проведен", Объект.Проведен); 
	СтруктураПараметров.Вставить("Ссылка", Объект.Ссылка);
	
	СтруктураДанныхЗаполненияФормы = гкс_ЗаголовокФормыДокумента(СтруктураПараметров);
	
	Если СтруктураДанныхЗаполненияФормы.Свойство("ДатаССервера") Тогда
		Объект.Дата = СтруктураДанныхЗаполненияФормы.ДатаССервера;		
	КонецЕсли;
	
	РаботаСДиалогамиКлиент.гкс_ПеревестиНаЧПКлиента(ЭтаФорма,,,);
	ЭтаФорма.Заголовок = СтруктураДанныхЗаполненияФормы.Заголовок;
	
	// } Гкс-[TOIR20-558] Вялых Д.А. от 21.07.2025.
	
	// гкс+ [12.22] Деснол 13.12.2022
	ЭтотОбъект["гкс_ВыборРемонтов"] = Истина;
	гкс_РежимПроецирования(Неопределено);
	// гкс- [12.22] Деснол 13.12.2022  
	
	ЗавершитьЗамерОткрытияФормы(ВремяНачалаЗамера);
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция гкс_ЗаголовокФормыДокумента(СтруктураПараметров)
	
	СтруктураВозврата = Новый Структура(); 
	
	Если ЗначениеЗаполнено(СтруктураПараметров.Ссылка) = Ложь Тогда 
		СтруктураВозврата.Вставить("ДатаССервера", ТекущаяДата());
	КонецЕсли;
	 	СтруктураВозврата.Вставить("Заголовок", торо_РаботаСДиалогами.гкс_ЗаголовокФормыДокумента(СтруктураПараметров));
	 
	
	Возврат СтруктураВозврата;

КонецФункции

// Гкс+[TOIR20-608] Вялых Д.А. от 21.07.2025. Закомментировано:{
//&НаСервере
//Процедура ПриОткрытииНаСервере(ДатаКлиента)
//	Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда 
//		Объект.Дата = ТекущаяДата();
//	КонецЕсли; 
//	//// гкс+ [Часовые пояса] Куст
//	гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПКлиента(ЭтаФорма,,,);
//	// Заголовок формы  
//	торо_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(Объект, ЭтаФорма, "");	
//КонецПроцедуры
// } Гкс-[TOIR20-558] Вялых Д.А. от 21.07.2025.

&НаСервере
Процедура гкс_ПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Для Каждого СтрокаТаблицы ИЗ ТекущийОбъект.РемонтныеРаботы Цикл
		Если ТипЗнч(СтрокаТаблицы.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда 
			СтрокаТаблицы.гкс_ПовКоэф = Неопределено;
		ИначеЕсли ЗначениеЗаполнено(СтрокаТаблицы.гкс_ПовКоэф) = Ложь Тогда 
			СтрокаТаблицы.гкс_ПовКоэф = Справочники.гкс_ПКоэффициентыРабот.ПоУмолчанию;
		КонецЕсли;
	КонецЦикла;
	// гкс+ [] Деснол 22.09.2022
	ОбновитьПлановуюСтоимостьРемонтаНаСервере(ТекущийОбъект);
	// гкс- [] Деснол 22.09.2022
	// гкс+ [Часовые пояса] Куст 14.04.2020
	гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПСервера(ЭтаФорма,, ТекущийОбъект);
	// гкс- [Часовые пояса] Куст 14.04.2020
КонецПроцедуры

&НаСервере
Процедура гкс_ПриЗаписиНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// гкс+ [Часовые пояса] Куст
	гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПКлиента(ЭтаФорма,, ТекущийОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПримечаниеПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	Если Не ТекущиеДанные <> Неопределено Тогда
		Если ТекущиеДанные.НоваяОперация = Ложь Тогда 
			СтруктураПоиска = Новый Структура("ID", ТекущиеДанные.ID);
			Имеющиеся = Объект.РемонтныеРаботы.НайтиСтроки(СтруктураПоиска);
			Если Имеющиеся.Количество() > 0 Тогда 
				Имеющиеся[0].гкс_Примечание = ТекущиеДанные.гкс_Примечание;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// гкс+ [Категории риска] Куст 
&НаСервере
Процедура гкс_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	гкс_ОбщегоНазначенияСервер.ДобавитьУОКатегорииРиска(ЭтаФорма);
КонецПроцедуры

// гкс+ [Категории риска] Куст 
&НаКлиенте
&После("РемонтыОборудованияПриАктивизацииСтроки")
Процедура гкс_РемонтыОборудованияПриАктивизацииСтроки(Элемент)
	ОбновитьЗаливкуЗаголовка();
	ТекРемонт = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если не ТекРемонт = Неопределено Тогда 
		ОбновитьОтображениеИсполнителей(ТекРемонт.ID);
	КонецЕсли;
КонецПроцедуры

// гкс+ [Категории риска] Куст 
&НаСервере
Процедура гкс_ЗавершитьРемонтныеРаботыПриИзмененииПослеНаСервере()
	гкс_ОбщегоНазначенияСервер.ДобавитьУОКатегорииРиска(ЭтаФорма);	
КонецПроцедуры

// гкс+ [Категории риска] Куст 
&НаКлиенте
Процедура ОбновитьЗаливкуЗаголовка()
	ТекДанные = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если НЕ ТекДанные = Неопределено И ТекДанные.гкс_ЦветКР > 0 Тогда 
		Элементы["гкс_КатегорияРиска"].ЦветФонаЗаголовка = ТекДанные.гкс_КатегорияРискаЦвет;
	КонецЕсли;
КонецПроцедуры

// гкс+ [Категории риска] Куст
&НаКлиенте
Процедура гкс_ЗавершитьРемонтныеРаботыПриИзмененииПосле(Элемент)
	гкс_ЗавершитьРемонтныеРаботыПриИзмененииПослеНаСервере();
	ОбновитьЗаливкуЗаголовка();
КонецПроцедуры

// гкс+ [Категории риска] Куст 
&НаКлиенте
Процедура гкс_ПослеЗаписиПосле(ПараметрыЗаписи)
	ОбновитьЗаливкуЗаголовка();
	
	Если ЗначениеЗаполнено(Объект.Комиссия) = Ложь И ЭтотОбъект["гкс_ВопросКомиссияПройден"] = Ложь Тогда 
		
		ОписаниеОп = Новый ОписаниеОповещения("гкс_КомиссияПослеВопроса", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОп, "Требуется заполнение дефектной комиссии?", РежимДиалогаВопрос.ДаНет);
		
		Отказ = Истина;
		
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПередЗаписью")
Процедура гкс_ПередЗаписью(Отказ, ПараметрыЗаписи)
	#Вставка
	// гкс+ [Перед записью] Куст 
	МассивСтруктур = новый Массив();
	МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "Организация", НСтр("ru='Организация';en='Organization'")));
	МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "Подразделение", НСтр("ru='Подразделение';en='Subdivision'")));
	МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "Ответственный", НСтр("ru='Ответственный';en='Responsible'")));
	Для Каждого СтрокаМассива Из МассивСтруктур Цикл
		Если Не ЗначениеЗаполнено(Объект[СтрокаМассива.Имя]) Тогда 
			Сообщение = Новый СообщениеПользователю();
			ШаблонСообщения = НСтр("ru='Поле ""%1"" не заполнено';en='Field %1 is empty'");
			Сообщение.Текст = СтрШаблон(ШаблонСообщения, СтрокаМассива.Текст);
			Сообщение.Поле = "Объект." + СтрокаМассива.Имя;
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;

	Если Объект.ТрудовыеЗатраты.Количество() > 0 Тогда 
		Для Каждого СтрокаРемонта Из Объект.РемонтыОборудования Цикл
			ЭтоКонтрагент = Ложь;
			Для Каждого СтрокаИсп Из Объект.ИсполнителиПоРемонтам Цикл
				Если СтрокаИсп.РемонтыОборудования_ID = СтрокаРемонта.ID Тогда 
					ЭтоКонтрагент = ТипЗнч(СтрокаИсп.Исполнитель) = Тип("СправочникСсылка.Контрагенты");
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если ЭтоКонтрагент Тогда 
				СтрокаМассива = Новый Структура("Имя,Текст", "гкс_Количество",
				НСтр("ru='Количество';en='Count'"));
			Иначе
				Продолжить;
			КонецЕсли;
			НомерПП = 0;
			Для Каждого СтрокаТаблицы Из Объект.ТрудовыеЗатраты Цикл
				Если СтрокаТаблицы.РемонтыОборудования_ID = СтрокаРемонта.ID 
					И Не ЗначениеЗаполнено(СтрокаТаблицы[СтрокаМассива.Имя]) Тогда 
					Сообщение = Новый СообщениеПользователю();
					ШаблонСообщения = НСтр("ru='Поле ""%1"" не заполнено';en='Field %1 is empty'");
					Сообщение.Текст = СтрШаблон(ШаблонСообщения, СтрокаМассива.Текст);
					Сообщение.Поле = "Объект.ТрудовыеЗатраты[" + НомерПП + "]." + СтрокаМассива.Имя;
					Сообщение.Сообщить();
					Отказ = Истина;
				КонецЕсли;
				НомерПП = НомерПП + 1;
			КонецЦикла;
		КонецЦикла;
		//
		МассивСтруктур = новый Массив();
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "Квалификация", 
			НСтр("ru='Квалификация';en='Qualification'")));
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "ДатаНачала",
			НСтр("ru='Дата начала';en='Start date'")));
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "ДатаОкончания", 
			НСтр("ru='Дата окончания';en='End date'")));
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "ВремяРаботы", 
			НСтр("ru='Время работы';en='Working hours'")));
		Для Каждого СтрокаМассива Из МассивСтруктур Цикл
			НомерПП = 0;
			Для Каждого СтрокаТаблицы Из Объект.ТрудовыеЗатраты Цикл
				Если Не ЗначениеЗаполнено(СтрокаТаблицы[СтрокаМассива.Имя]) Тогда 
					Сообщение = Новый СообщениеПользователю();
					ШаблонСообщения = НСтр("ru='Поле ""%1"" не заполнено';en='Field %1 is empty'");
					Сообщение.Текст = СтрШаблон(ШаблонСообщения, СтрокаМассива.Текст);
					Сообщение.Поле = "Объект.ТрудовыеЗатраты[" + НомерПП + "]." + СтрокаМассива.Имя;
					Сообщение.Сообщить();
					Отказ = Истина;
				КонецЕсли;
				НомерПП = НомерПП + 1;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	//
	Если Объект.ИсполнителиПоРемонтам.Количество() = 0 Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='В документе не указан исполнитель ремонта';
			|en='The document does not specify the repair contractor'");
		Сообщение.Сообщить();
		Отказ = Истина;
	Иначе
		МассивСтруктур = новый Массив();
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "Исполнитель", 
			НСтр("ru='Исполнитель';en='Executor'")));
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "ДатаНачала",
			НСтр("ru='Дата начала';en='Start date'")));
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "ДатаОкончания", 
			НСтр("ru='Дата окончания';en='End date'")));
		Для Каждого СтрокаМассива Из МассивСтруктур Цикл
			НомерПП = 0;
			Для Каждого СтрокаТаблицы Из Объект.ИсполнителиПоРемонтам Цикл
				Если Не ЗначениеЗаполнено(СтрокаТаблицы[СтрокаМассива.Имя]) Тогда 
					Сообщение = Новый СообщениеПользователю();
					ШаблонСообщения = НСтр("ru='Поле ""%1"" не заполнено';en='Field %1 is empty'");
					Сообщение.Текст = СтрШаблон(ШаблонСообщения, СтрокаМассива.Текст);
					Сообщение.Поле = "Объект.ИсполнителиПоРемонтам[" + НомерПП + "]." + СтрокаМассива.Имя;
					Сообщение.Сообщить();
					Отказ = Истина;
				КонецЕсли;
				НомерПП = НомерПП + 1;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	Если Объект.РемонтыОборудования.Количество() = 0 Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='В документе не указан ОР';en='The document does not specify an OR'");
		Сообщение.Сообщить();
		Отказ = Истина;
	Иначе
		МассивСтруктур = новый Массив();
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "ОбъектРемонта",
			НСтр("ru='Объект ремонта';en='Object of repair'")));
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "ВидРемонтныхРабот", 
			НСтр("ru='Вид ремонтных работ';en='Type of repair work'")));
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "ДатаНачала",
			НСтр("ru='Дата начала';en='Start date'")));
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "ДатаОкончания",
			НСтр("ru='Дата окончания';en='End date'")));
		Для Каждого СтрокаМассива Из МассивСтруктур Цикл
			НомерПП = 0;
			Для Каждого СтрокаТаблицы Из Объект.РемонтыОборудования Цикл
				Если Не ЗначениеЗаполнено(СтрокаТаблицы[СтрокаМассива.Имя]) Тогда 
					Сообщение = Новый СообщениеПользователю();
					ШаблонСообщения = НСтр("ru='Поле ""%1"" не заполнено';en='Field %1 is empty'");
					Сообщение.Текст = СтрШаблон(ШаблонСообщения, СтрокаМассива.Текст);
					Сообщение.Поле = "Объект.РемонтыОборудования[" + НомерПП + "]." + СтрокаМассива.Имя;
					Сообщение.Сообщить();
					Отказ = Истина;
				КонецЕсли;
				НомерПП = НомерПП + 1;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	Если Объект.МатериальныеЗатраты.Количество() Тогда 
		МассивСтруктур = новый Массив();
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "Количество",
			НСтр("ru='Количество';en='Count'")));
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "Номенклатура", 
			НСтр("ru='Номенклатура';en='Nomenclature'")));
		Для Каждого СтрокаМассива Из МассивСтруктур Цикл
			НомерПП = 0;
			Для Каждого СтрокаТаблицы Из Объект.МатериальныеЗатраты Цикл
				Если Не ЗначениеЗаполнено(СтрокаТаблицы[СтрокаМассива.Имя]) Тогда 
					Сообщение = Новый СообщениеПользователю();
					ШаблонСообщения = НСтр("ru='Поле ""%1"" не заполнено';en='Field %1 is empty'");
					Сообщение.Текст = СтрШаблон(ШаблонСообщения, СтрокаМассива.Текст);
					Сообщение.Поле = "Объект.МатериальныеЗатраты[" + НомерПП + "]." + СтрокаМассива.Имя;
					Сообщение.Сообщить();
					Отказ = Истина;
				КонецЕсли;
				НомерПП = НомерПП + 1;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	Если Объект.РемонтныеРаботы.Количество() = 0 Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='В документе не указана ремонтная работа';en='The document does not specify repairs'");
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	Если Отказ Тогда 
		Возврат;
	КонецЕсли; // гкс- [Перед записью] Куст 
	#КонецВставки

	КонтролироватьВремяРаботы = ПолучитьКонстантуКонтролироватьВремяРаботы();

	Если КонтролироватьВремяРаботы Тогда

		СчётчикРем = 1;

		Для Каждого СтрокаРем Из Объект.РемонтыОборудования Цикл

			ДатаНач = СтрокаРем.ДатаНачала;
			ДатаКон = СтрокаРем.ДатаОкончания;

			СчётчикИсп = 1;

			Для Каждого СтрокаИсп Из Объект.ТрудовыеЗатраты Цикл

				Если СтрокаРем.ID = СтрокаИсп.РемонтыОборудования_ID Тогда

					ВводДатаНач = СтрокаИсп.ДатаНачала;
					ВводДатаКон = СтрокаИсп.ДатаОкончания;

					Если ВводДатаНач < ДатаНач Тогда
						ТекстСообщения = НСтр("ru = 'В табличной части ""Трудовые Затраты"" на закладке Исполнители->Хозспособ в строке №" + СчётчикИсп + " дата начала не может быть меньше даты начала ремонта строки №" + СчётчикРем + "'");
						ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
					КонецЕсли;

					Если ВводДатаКон > ДатаКон Тогда
						ТекстСообщения = НСтр("ru = 'В табличной части ""Трудовые Затраты"" на закладке Исполнители->Хозспособ в строке №" + СчётчикИсп + " дата окончания не может быть больше даты окончания ремонта строки №" + СчётчикРем + "'");
						ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
					КонецЕсли;

					СчётчикИсп = СчётчикИсп + 1;

				КонецЕсли;

			КонецЦикла;

			СчётчикРем = СчётчикРем + 1;

		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПередЗаписьюНаСервере")
Процедура гкс_ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

	// Согласование++
	торо_РаботаССогласованиями.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	// Согласование--

	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение
		И ФОИспользоватьГарантии Тогда
		торо_ГарантийноеОбслуживание.СформироватьПредупрежденияОРекламационныхАктах(Объект, "РемонтыОборудования");
	КонецЕсли;

	#Вставка
	Если СредиИсполнителейЕстьКонтрагент() = Ложь Тогда 
	#КонецВставки
	Если торо_ОбщегоНазначения.ПроверитьВремяРаботыСотрудников(Объект, "ТрудовыеЗатраты") Тогда 
		Отказ = Истина;
	КонецЕсли;
	#Вставка
	КонецЕсли;
	
	// Гкс+[TOIR20-725] Литвин В.В. от 09.10.2025 Добавлено:{
	ДеревоСФормы = РеквизитФормыВЗначение("ДеревоРемонтныхРабот");
	ПредставлениеКорневойСтроки = дс_ПолучитьПредставлениеКорневойРемонтнойРаботы();
	СообщениеОбОтсутствииКорневойСтроки = СтрШаблон("Не найдена корневая строка ""%1"" в дереве ремонтных работ",
													ПредставлениеКорневойСтроки);
	
	Если ДеревоСФормы.Строки.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(СообщениеОбОтсутствииКорневойСтроки);
		Возврат;
	КонецЕсли;	
																											
	КорневаяСтрока = ДеревоСФормы.Строки[0];
	
	Если КорневаяСтрока.РемонтнаяРабота <> ПредставлениеКорневойСтроки Тогда
		ОбщегоНазначения.СообщитьПользователю(СообщениеОбОтсутствииКорневойСтроки);
	Иначе
		Для Каждого СтрокаТехКарта Из КорневаяСтрока.Строки Цикл
			Если Не СтрокаТехКарта.ЭтоТехКарта Тогда
				Отказ = Истина;
				Если ЗначениеЗаполнено(СтрокаТехКарта.ТехОперация) Тогда
					СообщениеОбОтсутствииТехКарты = СтрШаблон("Для операции ""%1"" отсутствует тех.карта", 
															  СтрокаТехКарта.ТехОперация);
					ОбщегоНазначения.СообщитьПользователю(СообщениеОбОтсутствииТехКарты);	
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	// Гкс-[TOIR20-725] Литвин В.В. от 09.10.2025}
	#КонецВставки

КонецПроцедуры

// гкс+ [Подбор ТехКарт] Куст 
&НаКлиенте
&ИзменениеИКонтроль("ОбработкаВыбора")
Процедура гкс_ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)

	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура")
		И ВыбранноеЗначение.Свойство("ВыполняемаяОперация")
		И ВыбранноеЗначение.ВыполняемаяОперация = "ВыборАналогаНоменклатурыДляРемонта" Тогда
		ЗаменитьМатериалыНаАналоги(ВыбранноеЗначение.АдресВХранилище);
		ТекДанныеРемРаб = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
		МассивID = Новый Массив;
		ЗаполнитьМассивID(МассивID,ТекДанныеРемРаб);
		ОтметитьНаличиеАналогов(МассивID);
		Модифицированность = Истина;

	ИначеЕсли ИсточникВыбора.Имяформы = "Обработка.торо_ПодборНоменклатуры.Форма.Форма" Тогда

		ТекДанныеРемРаб = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;

		Если ТекДанныеРемРаб = Неопределено Тогда 
			Возврат;
		КонецЕсли;

		ИмяТЧ = "МатериальныеЗатраты";
		ИмяРеквизита = "Номенклатура";
		СтруктураСтрокиОпераций = Новый Структура("РемонтыОборудования_ID, ID, Количество", ТекДанныеРемРаб.РемонтыОборудования_ID, ТекДанныеРемРаб.ID, ТекДанныеРемРаб.Количество);
		ДобавитьНоменклатуруИзПодбора(ВыбранноеЗначение, СтруктураСтрокиОпераций, ИмяТЧ, ИмяРеквизита);
		ОтметитьНаличиеАналогов(ТекДанныеРемРаб.ID);
		Модифицированность = Истина;

	Иначе
		#Вставка
		// гкс+ [Релиз16] Деснол
		Отказ = Ложь;
		Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") 
			И ВыбранноеЗначение.Свойство("СтрокаРемонтовОборудования") Тогда 
			гкс_ПроверитьЗакрытостьРемонта(Отказ, ВыбранноеЗначение.СтрокаРемонтовОборудования.ID);
		КонецЕсли;
		Если Отказ Тогда 
			Сооб = Новый СообщениеПользователю();
			Сооб.Текст =  НСтр("ru='Ремонт завершен. Создание акта запрещено.'");
			Сооб.Сообщить();
			Возврат;
		КонецЕсли;
		// гкс- [Релиз16]
		#Конецвставки

		ЕстьДокументы = Ложь;

		Если ПолучитьФОПовышеннаяОпасность() Тогда
			Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") И ВыбранноеЗначение.Свойство("ДокументОснование") Тогда
				Если ТипЗнч(ВыбранноеЗначение.ДокументОснование) <> Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот") Тогда
					ЗаполнитьТабОперацийБезНаряда(ВыбранноеЗначение.ДокументОснование, ВыбранноеЗначение.СтрокаРемонтовОборудования.ID);

					Если ТабОперацийБезНаряда.Количество() > 0 Тогда
						ЕстьДокументы = Истина;
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли  ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
				Для каждого Элемент Из ВыбранноеЗначение Цикл
					Если ТипЗнч(Элемент.ДокументОснование) <> Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот") Тогда
						ЗаполнитьТабОперацийБезНаряда(Элемент.ДокументОснование);

						Если ТабОперацийБезНаряда.Количество() > 0 Тогда
							ЕстьДокументы = Истина;
							Прервать;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;

		Если Не ЕстьДокументы Тогда

			ЭтоРемонтнаяРабота = Ложь;
			РемонтУжеДобавлен = Ложь;
			МассивИДДобавленныхРемонтов = Новый Массив;
			Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") И ВыбранноеЗначение.Количество() > 0 Тогда 
				Для каждого ЭлементМассива Из ВыбранноеЗначение Цикл
					Если ТипЗнч(ЭлементМассива) = Тип("Структура") И ЭлементМассива.Свойство("СтрокаРемонтовОборудования") Тогда 
						НайденныеРемонты = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", ЭлементМассива.СтрокаРемонтовОборудования.ID));
						Если НайденныеРемонты.Количество() > 0 Тогда
							РемонтУжеДобавлен = Истина;
							МассивИДДобавленныхРемонтов.Добавить(ЭлементМассива.СтрокаРемонтовОборудования.ID);
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;

				Если РемонтУжеДобавлен Тогда 
					Вопрос = НСтр("es='Algunos de las reparaciones escogidas son añadidos ya. Los trabajos de reparación vinculados serán limpiados y añadidos de nuevo. ¿Continuar?';ru='Некоторые из выбранных ремонтов уже добавлены. Связанные ремонтные работы будут очищены и добавлены заново. Продолжить?';en='Some of the selected repairs have already been added. Associated repairs will be cleaned and re-added. Continue?'");
				КонецЕсли;
			КонецЕсли;

			Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") И ВыбранноеЗначение.Свойство("СтрокаРемонтовОборудования") 
				И ВыбранноеЗначение.Количество() > 0 Тогда 
				ЭтоРемонтнаяРабота = ВыбранноеЗначение.ЭтоРемонтнаяРабота;
				НайденныеРемонты = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", ВыбранноеЗначение.СтрокаРемонтовОборудования.ID));
				Если НайденныеРемонты.Количество() > 0 Тогда
					РемонтУжеДобавлен = Истина;
					МассивИДДобавленныхРемонтов.Добавить(ВыбранноеЗначение.СтрокаРемонтовОборудования.ID);
				КонецЕсли;

				Если РемонтУжеДобавлен Тогда 
					Вопрос = НСтр("es='Esta reparación es añadida ya. Los trabajos de reparación vinculados serán limpiados y añadidos de nuevo. ¿Continuar?';ru='Этот ремонт уже добавлен. Связанные ремонтные работы будут очищены и добавлены заново. Продолжить?';en='This repair has already been added. Associated repairs will be cleaned and re-added. Continue?'");
				КонецЕсли;
			КонецЕсли;

			Если РемонтУжеДобавлен И НЕ ЭтоРемонтнаяРабота Тогда
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("ВыбранноеЗначение", ВыбранноеЗначение);
				СтруктураПараметров.Вставить("МассивИДДобавленныхРемонтов", МассивИДДобавленныхРемонтов);
				ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаВыбораПослеВопроса", ЭтотОбъект, СтруктураПараметров),
				Вопрос, РежимДиалогаВопрос.ДаНет);
				Возврат;
			Иначе
				ОбработкаВыбораЗавершение(ВыбранноеЗначение);
				#Вставка
				МодифицироватьИсполнителей();
				#КонецВставки
				Возврат;
			КонецЕсли;

		Иначе

			Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") И ВыбранноеЗначение.Свойство("ДокументОснование") Тогда
				Если ТипЗнч(ВыбранноеЗначение.ДокументОснование) <> Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот") Тогда
					ЗаполнитьТабОперацийБезНаряда(ВыбранноеЗначение.ДокументОснование, ВыбранноеЗначение.СтрокаРемонтовОборудования.ID);
					ОткрытьФорму("ОбщаяФорма.торо_ФормаОперацийБезНарядов", Новый Структура("ТабОперацийБезНаряда, ДокОснование", ТабОперацийБезНаряда, ВыбранноеЗначение.ДокументОснование), ИсточникВыбора,,ВариантОткрытияОкна.ОтдельноеОкно,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				КонецЕсли;
			ИначеЕсли  ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда

				МассивДокументов = Новый Массив;

				Для каждого Элемент Из ВыбранноеЗначение Цикл
					Если ТипЗнч(Элемент.ДокументОснование) <> Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот") Тогда
						Если МассивДокументов.Найти(Элемент.ДокументОснование) = Неопределено Тогда
							МассивДокументов.Добавить(Элемент.ДокументОснование);
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;

				Для каждого Элемент Из МассивДокументов Цикл
					ЗаполнитьТабОперацийБезНаряда(Элемент);
					ОткрытьФорму("ОбщаяФорма.торо_ФормаОперацийБезНарядов", Новый Структура("ТабОперацийБезНаряда, ДокОснование", ТабОперацийБезНаряда, Элемент), ИсточникВыбора,,ВариантОткрытияОкна.ОтдельноеОкно,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				КонецЦикла;

			КонецЕсли;

		КонецЕсли;
		#Вставка
		ДобавитьУОКатегорииРискаНаСервере();
		ОбновитьЗаливкуЗаголовка();
		МодифицироватьИсполнителей();
		#КонецВставки

	КонецЕсли;

	ЭтоПервыйДокументВЦепочке = ЭтоПервыйДокументВЦепочке();
	ЭтоПоследнийДокументВЦепочке = ЭтоПоследнийДокументВЦепочке();
	РемонтыОборудованияОбновитьДокументыИсточники();
	ЗаполнитьЕдиницыИзмерения(ДеревоРемонтныхРабот);
	ЗаполнитьИспользованиеХарактеристикЗапчастей();

	Для каждого Строка Из Объект.ТрудовыеЗатраты Цикл
		Строка.ВремяРаботыТекст = СформироватьПродолжительность(Строка.ВремяРаботы);
	КонецЦикла;

	Для Каждого Строка Из ДеревоРемонтныхРабот.ПолучитьЭлементы() Цикл
		РазвернутьДеревоРемонтныхРабот(Строка);
	КонецЦикла;

КонецПроцедуры
// гкс- [Подбор ТехКарт]
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
&ИзменениеИКонтроль("СпособСогласованияНачалоВыбора")
Процедура гкс_СпособСогласованияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	Если СогласующиеРегистр.Количество() > 0 Тогда

		СтандартнаяОбработка = Ложь;

		ПоказатьВопрос(Новый ОписаниеОповещения("СпособСогласованияНачалоВыбораЗавершение", ЭтаФорма, Новый Структура("Элемент",Элемент)),
		НСтр("es='¡Los datos de los estatus establecidos del documento serán limpiados! ¿Continuar?';ru='Данные по установленным статусам документа будут очищены! Продолжить?';en='Data on the established statuses of the document will be cleared! Continue?'"),
		РежимДиалогаВопрос.ДаНет, 60);		

		Возврат;

	КонецЕсли;
	#Вставка
	// гкс+ [Релиз 1] Куст 
	СтандартнаяОбработка = Ложь;
	ДопПараметры = Новый Структура("Отбор", Новый Структура("ПометкаУдаления", Ложь));
	ОткрытьФорму("Справочник.торо_СпособыСогласованияДокументов.ФормаВыбора",ДопПараметры,
	Элемент, , , , , РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	#КонецВставки

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("СпособСогласованияНачалоВыбораЗавершение")
Процедура гкс_СпособСогласованияНачалоВыбораЗавершение(РезультатВопроса, ДополнительныеПараметры)

	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		СогласующиеРегистр.Очистить();
		Если мХранитьИсториюСогласованияВДокументах Тогда
			Объект.Согласующие.Очистить();
		КонецЕсли;
		#Вставка
		// гкс+ [Релиз 1] Куст
		ДопПараметры = Новый Структура("Отбор", Новый Структура("ПометкаУдаления", Ложь));
		ОткрытьФорму("Справочник.торо_СпособыСогласованияДокументов.ФормаВыбора",ДопПараметры,
		ДополнительныеПараметры.Элемент, , , , , РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		#КонецВставки
		#Удаление
		ОткрытьФорму("Справочник.торо_СпособыСогласованияДокументов.ФормаВыбора",,ДополнительныеПараметры.Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		#КонецУдаления
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура гкс_СпособВыполненияДеревоПриИзменении(Элемент)
	ТекСтрока = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	
	ID = ТекСтрока.ID;
	МассивСтрТЧ = Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("ID", ID));
	
	Если МассивСтрТЧ.Количество() Тогда
		СтрТЧ = МассивСтрТЧ[0];
		СтрТЧ.гкс_СпособВыполнения = ТекСтрока.гкс_СпособВыполнения;
	Иначе
		ТекСтрока.гкс_СпособВыполнения = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("СпособСогласованияПриИзменении")
Процедура гкс_СпособСогласованияПриИзменении(Элемент)

	Если фПослеОчистки = Ложь Тогда
		ОбновитьДеревоСогласующих(Истина);
		#Удаление
		торо_РаботаССогласованиямиКлиентСервер.ДобавитьСтрокуВИсториюСтатусов(ЭтаФорма, СтатусДокументаРегистр,, Истина);
		#КонецУдаления
		#Вставка
		торо_РаботаССогласованиямиКлиентСервер.ДобавитьСтрокуВИсториюСтатусов(ЭтаФорма, СтатусДокументаРегистр,,);
		// гкс+ [2021] Куст
		гкс_ИзменитьВидимостьКнопкиОтправкиНаСогласование();
		#КонецВставки
	Иначе
		фПослеОчистки = Ложь;
	КонецЕсли;

	УправлениеВидимостью(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура гкс_ПодразделениеПриИзмененииПосле(Элемент)
	ПодразделениеПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура гкс_ОрганизацияПриИзмененииПосле(Элемент)
	ПодразделениеПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	// гкс+ [2021] Куст
	Если ЗначениеЗаполнено(Объект.СпособСогласования) Тогда 
		Возврат;
	КонецЕсли; // гкс- [2021] 
	Если ЭтотОбъект["мИспользоватьСогласованиеДокументов"] И Элементы["СпособСогласования"].ТолькоПросмотр
		И Не СтатусДокументаРегистр = ЭтаФорма["гкс_СтатусЧерновик"] Тогда 
		Возврат;
	КонецЕсли;
	//
	Если Объект.РемонтыОборудования.Количество() > 0 Тогда 
		Способ = гкс_ПолучитьСпособСогласования(Объект.Организация, Объект.РемонтыОборудования[0].ОбъектРемонта);
		Если Не Объект.СпособСогласования = Способ И Не Способ = Неопределено Тогда  
			Объект.СпособСогласования = Способ;
			СпособСогласованияПриИзменении(Неопределено);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовРемонтныхРабот

&НаКлиенте
&После("РемонтыОборудованияПередОкончаниемРедактирования")
Процедура гкс_РемонтыОборудованияПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	ПодразделениеПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура гкс_РемонтныеРаботыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "Деревогкс_ПовКоэф" Тогда 
		ТекДанные = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
		Если Не ТекДанные = Неопределено 
		И гкс_ЭтоТО(ТекДанные.РемонтнаяРабота) Тогда 
		ОписаниеОп = Новый ОписаниеОповещения("УстановитьВыбраннымПослеВыбора", ЭтотОбъект);
		ОткрытьФорму("Справочник.гкс_ПКоэффициентыРабот.ФормаВыбора",, ЭтотОбъект,,,, 
				ОписаниеОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура гкс_РемонтыОборудованияЗавершитьРемонтПриИзмененииПосле(Элемент)
	ДобавитьУОКатегорииРискаНаСервере();
	ОбновитьЗаливкуЗаголовка();
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ДеревоРемонтныхРаботОбработкаВыбора")
Процедура гкс_ДеревоРемонтныхРаботОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	ТекСтрокаДерева = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;

	Если ТекСтрокаДерева = Неопределено Тогда
		СтрокаРодитель = Новый Структура("ID, РемонтыОборудования_ID, Родитель_ID", "", "", "");
		ИДВыбраннойСтроки = "";
	Иначе
		СтрокаРодитель = ТекСтрокаДерева;
		ИДВыбраннойСтроки = ТекСтрокаДерева.ID;
	КонецЕсли;

	ТекРемонт = Элементы.РемонтыОборудования.ТекущиеДанные;

	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") И ВыбранноеЗначение.Количество() > 0 И ТипЗнч(ВыбранноеЗначение[0]) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда
		#Вставка
		// гкс+ [Подбор ТехКарт] Куст
		Массивпроверки = Новый Массив();
		Массивпроверки.Добавить(ВыбранноеЗначение[0]);
		Если ПроверитьТКНаСервере(Массивпроверки).Количество() Тогда 
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru='Запрещено выбирать шаблоны техкарт';
			|en='It is forbidden to choose patterns standard maintenance plans'");
			Сообщение.Сообщить();
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
		#КонецВставки
		ТекущийРемонт = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
		Пока ТекущийРемонт <> Неопределено И ТипЗнч(ТекущийРемонт.РемонтнаяРабота) <> Тип("Строка") Цикл
			Если ТекущийРемонт.РемонтнаяРабота = ВыбранноеЗначение[0] Тогда
				ШаблонСообщения = НСтр("es='El significado escogido ""%1"" no puede ser incluido en la composición.';ru='Выбранное значение ""%1"" не может быть включено в состав самого себя.';en='The selected value ""%1"" cannot be included in itself.'");
				ТекстСообщения = СтрШаблон(ШаблонСообщения, ВыбранноеЗначение[0]);
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
				Возврат;
			КонецЕсли; 
			ТекущийРемонт = ТекущийРемонт.ПолучитьРодителя();	
		КонецЦикла; 	
	КонецЕсли; 

	Если ТекРемонт <> Неопределено Тогда
		РемонтыОборудования_ID = ТекРемонт.ID;
		ДатаНачалаРемонта      = ТекРемонт.ДатаНачала;
	Иначе
		РемонтыОборудования_ID = "";
		ДатаНачалаРемонта      = Неопределено;       
	КонецЕсли;

	ТекущиеДанные = Новый Структура("ТекущийРемонт_ID, СтрокаРодитель_ID, СтрокаРодительРемонтыОборудования_ID, СтрокаРодительРодитель_ID, ДатаНачалаРемонта", 
	РемонтыОборудования_ID, СтрокаРодитель.ID, СтрокаРодитель.РемонтыОборудования_ID, СтрокаРодитель.Родитель_ID, ДатаНачалаРемонта);
	СтруктураПараметры = Новый Структура;

	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		МассивСтруктурВозврата = ДеревоРемонтныхРаботОбработкаВыбораНаСервереДляМассива(ВыбранноеЗначение, ТекущиеДанные, СтруктураПараметры);
		Если ФОИспользоватьОстановочные Тогда
			ОбновитьОстановочные();
		КонецЕсли;
	Иначе
		СтруктураВозврата = ДеревоРемонтныхРаботОбработкаВыбораНаСервере(ВыбранноеЗначение, ТекущиеДанные, СтруктураПараметры);
		МассивСтруктурВозврата = Новый Массив;
		МассивСтруктурВозврата.Добавить(СтруктураВозврата);
		Если ФОИспользоватьОстановочные Тогда
			ОбновитьОстановочные();
		КонецЕсли;
	КонецЕсли;

	Для Каждого СтруктураВозврата Из МассивСтруктурВозврата Цикл
		Если ТипЗнч(СтруктураВозврата) = Тип("Строка") Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтруктураВозврата);
		КонецЕсли;
	КонецЦикла;

	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		Массивстрок = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", ВыбранноеЗначение.СтрокаРемонтовОборудования.ID));
		Если МассивСтрок.Количество() Тогда
			Идентиф = МассивСтрок[0].ПолучитьИдентификатор();
			Элементы.РемонтыОборудования.ТекущаяСтрока = Идентиф;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Массив") И ВыбранноеЗначение.Количество() > 0 И 
		НЕ ТипЗнч(ВыбранноеЗначение[0])= Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") И
		НЕ ТипЗнч(ВыбранноеЗначение[0])= Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
		Массивстрок = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", ВыбранноеЗначение[0].СтрокаРемонтовОборудования.ID));
		Если МассивСтрок.Количество() Тогда
			Идентиф = МассивСтрок[0].ПолучитьИдентификатор();
			Элементы.РемонтыОборудования.ТекущаяСтрока = Идентиф;
		КонецЕсли;		
	КонецЕсли;

	ОбновитьЗависимыеЛоты();
	РемонтыОборудованияПриАктивизацииСтроки(Элементы.РемонтыОборудования);

	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		МассивID = Новый Массив;
		Для Каждого СтрокаРР Из ВыбранноеЗначение.МассивСтрокРемонтныхРабот Цикл
			МассивID.Добавить(СтрокаРР.ID);
		КонецЦикла;
		ОтметитьНаличиеАналогов(МассивID);
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда
		ОтметитьНаличиеАналогов();
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
		Для Каждого СтрокаРР Из Объект.РемонтныеРаботы Цикл
			Если СтрокаРР.РемонтнаяРабота = ВыбранноеЗначение Тогда
				ОтметитьНаличиеАналогов(СтрокаРР.ID);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Для каждого Строка Из Объект.ТрудовыеЗатраты Цикл
		Строка.ВремяРаботыТекст = СформироватьПродолжительность(Строка.ВремяРаботы);
	КонецЦикла;

	Для каждого Строка из Объект.МатериальныеЗатраты Цикл
		Строка.ХарактеристикиИспользуются = торо_НоменклатураСервер.ПолучитьХарактеристикиИспользуются(Строка.Номенклатура);
	КонецЦикла;

	Если ЗначениеЗаполнено(ИДВыбраннойСтроки) Тогда
		Идентификатор = Неопределено;
		ОбщегоНазначенияКлиентСервер.ПолучитьИдентификаторСтрокиДереваПоЗначениюПоля("ID", Идентификатор, ДеревоРемонтныхРабот.ПолучитьЭлементы(), ИДВыбраннойСтроки, Ложь);
		Если Идентификатор <> Неопределено Тогда
			Элементы.ДеревоРемонтныхРабот.ТекущаяСтрока = Идентификатор;
		КонецЕсли;
	КонецЕсли;

	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ДеревоРемонтныхРаботПередУдалением")
Процедура гкс_ДеревоРемонтныхРаботПередУдалением(Элемент, Отказ)

	ТекСтрокаДРР = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;

	мСтруктураТабличныхЧастейСвязанныхСДеревомРемонтныхРабот = Новый Структура();
	мСтруктураТабличныхЧастейСвязанныхСДеревомРемонтныхРабот.Вставить("МатериальныеЗатраты");
	мСтруктураТабличныхЧастейСвязанныхСДеревомРемонтныхРабот.Вставить("СерийныеЗапчасти");
	мСтруктураТабличныхЧастейСвязанныхСДеревомРемонтныхРабот.Вставить("ТрудовыеЗатраты");
	мСтруктураТабличныхЧастейСвязанныхСДеревомРемонтныхРабот.Вставить("РемонтныеРаботы");

	СтруктураСвязанныхТЧ = Новый Структура();
	СтруктураСвязанныхТЧ.Вставить("МатериальныеЗатраты");
	СтруктураСвязанныхТЧ.Вставить("СерийныеЗапчасти");
	СтруктураСвязанныхТЧ.Вставить("ТрудовыеЗатраты");
	СтруктураСвязанныхТЧ.Вставить("РемонтныеРаботы");

	#Удаление
	Если НЕ ЗначениеЗаполнено(ТекСтрокаДРР.Родитель_ID) И ТекСтрокаДРР.РемонтнаяРабота = "Ремонтные работы" Тогда
	#КонецУдаления
	#Вставка
	Если НЕ ЗначениеЗаполнено(ТекСтрокаДРР.Родитель_ID) И ТекСтрокаДРР.РемонтнаяРабота = дс_ПолучитьПредставлениеКорневойРемонтнойРаботы() Тогда
	#КонецВставки

		ТекСтрокаДРР.ПолучитьЭлементы().Очистить();

		Для Каждого КлючИЗначение Из СтруктураСвязанныхТЧ Цикл

			ТабличнаяЧасть = Объект[КлючИЗначение.Ключ];

			ПараметрыПоиска = Новый Структура;
			ПараметрыПоиска.Вставить("РемонтыОборудования_ID", Элементы.РемонтыОборудования.ТекущиеДанные.ID);

			СтрокиКУдалению = ТабличнаяЧасть.НайтиСтроки(ПараметрыПоиска);

			Для Каждого Строка Из СтрокиКУдалению Цикл

				ТабличнаяЧасть.Удалить(Строка);

			КонецЦикла;		    

		КонецЦикла;

		Модифицированность = Истина;

		Отказ = Истина;

	Иначе

		ВыделенныеСтроки = Элементы.ДеревоРемонтныхРабот.ВыделенныеСтроки;
		МассивСтрокДляУдаления = Новый Массив;

		Для каждого Стр Из ВыделенныеСтроки Цикл 
			Строка = ДеревоРемонтныхРабот.НайтиПоИдентификатору(Стр);
			#Удаление
			Если Строка <> Неопределено И Строка.РемонтнаяРабота <> "Ремонтные работы" Тогда 
			#КонецУдаления
			#Вставка
			Если Строка <> Неопределено И Строка.РемонтнаяРабота <> дс_ПолучитьПредставлениеКорневойРемонтнойРаботы() Тогда 
			#КонецВставки
				МассивСтрокДляУдаления.Добавить(Строка);
			КонецЕсли;
		КонецЦикла;		

		Для каждого Элемент Из МассивСтрокДляУдаления Цикл

			СтруктурыДляПередачи = Новый Структура("ID, РемонтыОборудования_ID, Родитель_ID, РемонтнаяРабота",
			Элемент.ID, Элемент.РемонтыОборудования_ID, Элемент.Родитель_ID, Элемент.РемонтнаяРабота);
			УдалитьДанныеТЧПоIDСтрокиДереваНаСервере(СтруктурыДляПередачи, СтруктураСвязанныхТЧ);

			СтрокаРодителя = Элемент.ПолучитьРодителя();
			Если СтрокаРодителя <> Неопределено Тогда 
				СтрокаРодителя.ПолучитьЭлементы().Удалить(Элемент); 
			КонецЕсли;
		КонецЦикла;


		Модифицированность = Истина;
		Отказ = Истина;  

	КонецЕсли;

	ПересчитатьПроцентыВыполненияВДеревеНаСервере();
	РазвернутьДеревоРемонтныхРабот(ДеревоРемонтныхРабот.ПолучитьЭлементы()[0]);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовИсполнителейРемонтныхРабот

&НаКлиенте
Процедура гкс_ИсполнителиПоРемонтамПередНачаломИзмененияПосле1(Элемент, Отказ)
	Если Объект.ИсполнителиПоРемонтам.Количество() Тогда 
		ТекРемонт = Элементы.РемонтыОборудования.ТекущиеДанные;
		Если Не ТекРемонт = Неопределено Тогда 
			Для Каждого СТ Из Объект.ИсполнителиПоРемонтам Цикл
				Если СТ.РемонтыОборудования_ID = ТекРемонт.ID Тогда 
					ЭтотОбъект["гкс_ИсполнительДо"] = СТ.Исполнитель;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура гкс_ИсполнителиПоРемонтамПередУдалениемПеред1(Элемент, Отказ)
	ТекДанные = Элементы.ИсполнителиПоРемонтам.ТекущиеДанные;
	ТекРемонт = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если ТекРемонт = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	ПервыйИсполнитель = Неопределено;
	ПерваяСтрокаТЧ = Неопределено;
	ВторойИсполнитель = Неопределено;
	Для Каждого СтрокаТаблицы Из Объект.ИсполнителиПоРемонтам Цикл
		Если СтрокаТаблицы.РемонтыОборудования_ID = ТекРемонт.ID Тогда 
			Если ПервыйИсполнитель = Неопределено Тогда 
				ПервыйИсполнитель = СтрокаТаблицы.Исполнитель;
				ПерваяСтрокаТЧ = СтрокаТаблицы;
			Иначе
				ВторойИсполнитель = СтрокаТаблицы.Исполнитель;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если Не ТекДанные = Неопределено И ТекДанные.Исполнитель = ПервыйИсполнитель Тогда 
		
		ТекТип = ТипЗнч(ПервыйИсполнитель);
		Если не ВторойИсполнитель = Неопределено Тогда 
			Если ТекТип = ТипЗнч(ВторойИсполнитель) Тогда 
				Возврат;
			КонецЕсли;
		ИначеЕсли ТекТип = Тип("СправочникСсылка.СтруктураПредприятия") Тогда 
			Возврат
		КонецЕсли;
		Если ТекТип = Тип("СправочникСсылка.СтруктураПредприятия") Тогда 
			Отказ = Истина;
			СтруктураОпОп = Новый Структура("Удаление", Истина);
			ЗадатьВопросПередИзменениемИсполнителя(СтруктураОпОп);
		Иначе
			ИсполнителиПоРемонтамПередУдалением(Элементы.ИсполнителиПоРемонтам, Отказ);
			Если НЕ Отказ Тогда 
				Объект.ИсполнителиПоРемонтам.Удалить(ПерваяСтрокаТЧ);
			КонецЕсли;
			МодифицироватьИсполнителей(ТекРемонт.ID);
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура гкс_УстановитьПКоэф(Команда)
	ТекДанные = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если не ТекДанные = Неопределено Тогда 
		МассивПередачи = Новый Массив();
		Для Каждого СтрокаТаблицы Из Объект.РемонтныеРаботы Цикл
			Если ТекДанные.ID = СтрокаТаблицы.РемонтыОборудования_ID Тогда 
				МассивПередачи.Добавить(Новый Структура("ИД,гкс_ПовКоэф,РемонтнаяРабота"
					, СтрокаТаблицы.ID, СтрокаТаблицы.гкс_ПовКоэф, СтрокаТаблицы.РемонтнаяРабота));
			КонецЕсли;
		КонецЦикла;
		ОписаниеОп = Новый ОписаниеОповещения("гкс_УстановитьПКоэфОбработкаВыбора",
			ЭтотОбъект, Новый Структура("ИдРемонта", ТекДанные.ID) );
			ОткрытьФорму("Справочник.гкс_ПКоэффициентыРабот.Форма.ПодборПКоэфВСписок", Новый Структура("Строки", МассивПередачи), ЭтотОбъект,,,, 
				ОписаниеОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура дс_ОтправитьНаСогласование(Команда)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Параметры1 = Новый Структура("дс_Выполнить", Истина);
		Параметры2 = Новый Структура();
		
		гкс_ОбщегоНазначенияСервер.ОтправитьНаСогласованиеНаСервере(Параметры1, Параметры2);
		Если Параметры1.дс_Выполнить Тогда 
			Параметры2.Вставить("Форма", ЭтаФорма);
			торо_РаботаССогласованиямиКлиент.ВыбратьСтатусЗавершение(Параметры1, Параметры2);
			гкс_ИзменитьВидимостьКнопкиОтправкиНаСогласование();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ДобавитьТехКарту")
Процедура гкс_ДобавитьТехКарту(Команда)

	ТекущиеДанные = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("es='¡Indiquen la disposición de la reparación!';ru='Укажите расположение ремонта!';en='Specify  the location of the repair!'"), 10); 
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ТекущиеДанные.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("es='¡La reparación no es posible incluir en la composición de la operación tecnológica!';ru='Ремонт нельзя включать в состав технологической операции!';en='Repair can not be included in the technological operation!'"), 10); 
		Возврат;
	КонецЕсли;

	#Удаление
	ФормаВыбора = ПолучитьФорму("Справочник.торо_ИдентификаторыТехКарт.ФормаВыбора", Новый Структура("ОтборПоСтатусам, МножественныйВыбор", ПредопределенноеЗначение("Перечисление.торо_СтатусыНормативныхРемонтовИТехКарт.Действует"), Истина), Элементы.ДеревоРемонтныхРабот);
	#КонецУдаления
	#Вставка
	ПараметрыФормы = Новый Структура("ОтборПоСтатусам, МножественныйВыбор",
		ПредопределенноеЗначение("Перечисление.торо_СтатусыНормативныхРемонтовИТехКарт.Действует"), Истина);
	ТекРемонт = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если Не ТекРемонт = Неопределено Тогда 
		ПараметрыФормы.Вставить("ОтборПоТОРИзОР", ТекРемонт.ОбъектРемонта);
	КонецЕсли;
	ФормаВыбора = ПолучитьФорму("Справочник.торо_ИдентификаторыТехКарт.ФормаВыбора", ПараметрыФормы,
		Элементы.ДеревоРемонтныхРабот);
	#КонецВставки
	ФормаВыбора.Открыть();

КонецПроцедуры

// гкс+ [12.22] Деснол 13.12.2022
&НаКлиенте
Процедура гкс_Проецировать(Команда)
	МассивИД = Новый Массив();
	ТекДанные = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Выберите строку источник";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	Для Каждого СтрокаТаблицы Из Объект.РемонтыОборудования Цикл
		Если СтрокаТаблицы.гкс_Выбран И Не ТекДанные.ID = СтрокаТаблицы.ID Тогда 
			МассивИД.Добавить(СтрокаТаблицы.ID);
		КонецЕсли;
	КонецЦикла;
	Если МассивИД.Количество() > 0 Тогда 
		ПараметрыПослеВыбора = Новый Структура("МассивИД,Источник", МассивИД, ТекДанные.ID);
		ТекОписаниеОповещения = Новый ОписаниеОповещения("гкс_ПроецироватьПослеВопроса", ЭтотОбъект, ПараметрыПослеВыбора);
		СписокТекста = Новый СписокЗначений();
		СписокТекста.Добавить("ВР", "Вид ремонта");
		СписокТекста.Добавить("Даты", "Даты ремонта");
		СписокТекста.Добавить("Операции", "Список операций");
		СписокТекста.Добавить("Исполнители", "Исполнители по ремонту");
		ПоказатьВопрос(ТекОписаниеОповещения, "Выберите реквизиты для проецирования", СписокТекста);
	Иначе
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Выберите строки для проецирования";
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры // гкс- [12.22] Деснол 13.12.2022

// гкс+ [12.22] Деснол 13.12.2022
&НаКлиенте
Процедура гкс_РежимПроецирования(Команда)
	ЭтотОбъект["гкс_ВыборРемонтов"] = Не ЭтотОбъект["гкс_ВыборРемонтов"];
	Элементы["гкс_ВыбранРО"].Видимость = ЭтотОбъект["гкс_ВыборРемонтов"];
	Элементы["гкс_ПроецироватьКнопка"].Видимость = ЭтотОбъект["гкс_ВыборРемонтов"];
	Элементы["гкс_ВыбратьВсеРемонтыКнопка"].Видимость = ЭтотОбъект["гкс_ВыборРемонтов"];
	Элементы["гкс_ОтменитьВыборВсехРемонтыКнопка"].Видимость = ЭтотОбъект["гкс_ВыборРемонтов"];
	Если ЭтотОбъект["гкс_ВыборРемонтов"] Тогда 
		Элементы["гкс_РежимПроецированияКнопка"].Заголовок = "Режим выбора (вкл)";
	Иначе
		Элементы["гкс_РежимПроецированияКнопка"].Заголовок = "Режим выбора (выкл)";
	КонецЕсли;
КонецПроцедуры // гкс- [12.22] Деснол 13.12.2022

// гкс+ [12.22] Деснол 13.12.2022
&НаКлиенте
Процедура гкс_ВыбратьВсеРемонты(Команда)
	Для Каждого СтрокаТаблицы Из Объект.РемонтыОборудования Цикл
		СтрокаТаблицы.гкс_Выбран = Истина;
	КонецЦикла;
КонецПроцедуры // гкс- [12.22] Деснол 13.12.2022

// гкс+ [12.22] Деснол 13.12.2022
&НаКлиенте
Процедура гкс_ОтменитьВыборВсехРемонты(Команда)
	Для Каждого СтрокаТаблицы Из Объект.РемонтыОборудования Цикл
		СтрокаТаблицы.гкс_Выбран = Ложь;
	КонецЦикла;
КонецПроцедуры // гкс- [12.22] Деснол 13.12.2022

// гкс+ [05.23] Деснол 10.05.2023
&НаКлиенте
Процедура гкс_ВосстановитьПорядокИзОснования(Команда)
	Если Объект.РемонтыОборудования.Количество() > 1 Тогда 
		ВернутьПорядокРемонтовПоОснованию();
	КонецЕсли;
КонецПроцедуры // гкс- [05.23] Деснол 10.05.2023

&НаКлиенте
&ИзменениеИКонтроль("ДобавитьТехОперацию")
Процедура гкс_ДобавитьТехОперацию(Команда)

	ТекущиеДанные = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("es='¡Indiquen la disposición de la reparación!';ru='Укажите расположение ремонта!';en='Specify  the location of the repair!'"), 10); 
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ТекущиеДанные.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("es='¡La reparación no es posible incluir en la composición de la operación tecnológica!';ru='Ремонт нельзя включать в состав технологической операции!';en='Repair can not be included in the technological operation!'"), 10); 
		Возврат;
	#Вставка
	// Гкс+[TOIR20-725] Литвин В.В. от 10.10.2025 Добавлено:{
	ИначеЕсли ТипЗнч(ТекущиеДанные.РемонтнаяРабота) <> Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда
		ПоказатьПредупреждение(Неопределено,
			НСтр("ru='Ремонт можно включать только в состав технологической карты!'"), 10);
		Возврат;
	// Гкс-[TOIR20-725] Литвин В.В. от 10.10.2025}
	#КонецВставки
	КонецЕсли;

	ОткрытьФорму("Справочник.торо_ТехнологическиеОперации.ФормаВыбора", Новый Структура("МножественныйВыбор", Истина), Элементы.ДеревоРемонтныхРабот);		

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПодборОпераций")
Процедура гкс_ПодборОпераций(Команда)

	ТекущиеДанные = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("es='¡Indiquen la disposición de la reparación!';ru='Укажите расположение ремонта!';en='Specify  the location of the repair!'"), 10); 
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ТекущиеДанные.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("es='¡La reparación no es posible incluir en la composición de la operación tecnológica!';ru='Ремонт нельзя включать в состав технологической операции!';en='Repair can not be included in the technological operation!'"), 10); 
		Возврат;
	#Вставка
	// Гкс+[TOIR20-725] Литвин В.В. от 10.10.2025 Добавлено:{
	ИначеЕсли ТипЗнч(ТекущиеДанные.РемонтнаяРабота) <> Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда
		ПоказатьПредупреждение(Неопределено,
			НСтр("ru='Ремонт можно включать только в состав технологической карты!'"), 10);
		Возврат;
	// Гкс-[TOIR20-725] Литвин В.В. от 10.10.2025}
	#КонецВставки
	КонецЕсли;

	ФормаВыбора = ПолучитьФорму("Справочник.торо_ТехнологическиеОперации.ФормаВыбора", Новый Структура("МножественныйВыбор", Истина), Элементы.ДеревоРемонтныхРабот);
	ФормаВыбора.ЗакрыватьПриВыборе = Ложь;
	ФормаВыбора.Открыть();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументыОснования
 
&НаКлиенте
Процедура гкс_ДокументыОснованияДокументОснованиеПриИзмененииПеред(Элемент)

	ТекущаяСтрока = Элементы.ДокументыОснования.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено И ЗначениеЗаполнено(ТекущаяСтрока.ДокументОснование) Тогда
		
		ДанныеОснования 
			= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущаяСтрока.ДокументОснование, "Организация, Подразделение");
			
		ЗаполнитьЗначенияСвойств(Объект, ДанныеОснования); 	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// гкс+ [Релиз16] Деснол
&НаСервере
Процедура гкс_ПроверитьЗакрытостьРемонта(Отказ, ИД_Ремонта = Неопределено)
	Если ИД_Ремонта = Неопределено Тогда 
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		               |	РемонтыОборудования.ID КАК ИД_Ремонта
		               |ПОМЕСТИТЬ РемонтыОборудованияИскомые
		               |ИЗ
		               |	&РемонтыОборудования КАК РемонтыОборудования
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	РемонтыОборудованияИскомые.ИД_Ремонта КАК ИД_Ремонта
		               |ИЗ
		               |	РемонтыОборудованияИскомые КАК РемонтыОборудованияИскомые
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗавершенныеРемонтныеРаботы.СрезПоследних КАК торо_ЗавершенныеРемонтныеРаботыСрезПоследних
		               |		ПО РемонтыОборудованияИскомые.ИД_Ремонта = торо_ЗавершенныеРемонтныеРаботыСрезПоследних.ID";
		Запрос.УстановитьПараметр("РемонтыОборудования", Объект.РемонтыОборудования.Выгрузить());
		РезультатЗапроса = Запрос.Выполнить();
		Отказ = Не РезультатЗапроса.Пустой();
	Иначе
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		               |	торо_ЗавершенныеРемонтныеРаботыСрезПоследних.ID КАК ID
		               |ИЗ
		               |	РегистрСведений.торо_ЗавершенныеРемонтныеРаботы.СрезПоследних(, ID = &ИД_Ремонта) КАК торо_ЗавершенныеРемонтныеРаботыСрезПоследних";
		Запрос.УстановитьПараметр("ИД_Ремонта", ИД_Ремонта);
		РезультатЗапроса = Запрос.Выполнить();
		Отказ = Не РезультатЗапроса.Пустой();
	КонецЕсли;
КонецПроцедуры
// гкс- [Релиз16]

// гкс+ [Категории риска] Куст
&НаСервере
Процедура ДобавитьУОКатегорииРискаНаСервере()
	гкс_ОбщегоНазначенияСервер.ДобавитьУОКатегорииРиска(ЭтаФорма);	
КонецПроцедуры
// гкс- [Категории риска] Куст 22.10.2020
 
&НаСервере
Процедура ДобавитьНовыеЭлементы()
	МассивРеквизитов = Новый Массив();	
	// гкс+ [12.22] Деснол 13.12.2022
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_Выбран",
		Новый ОписаниеТипов("Булево"), "Объект.РемонтыОборудования", " "));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ВыборРемонтов", Новый ОписаниеТипов("Булево")));
	// гкс- [12.22] Деснол 13.12.2022
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ВопросКомиссияПройден", Новый ОписаниеТипов("Булево")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ПовКоэф", 
		Новый ОписаниеТипов("СправочникСсылка.гкс_ПКоэффициентыРабот"), "ДеревоРемонтныхРабот",
		НСтр("ru='Пов.коэф.';en='coef.';es=''")));
	
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_Примечание", Новый ОписаниеТипов("Строка",,,, 
		Новый КвалификаторыСтроки(100)), "ДеревоРемонтныхРабот"));
		ТемпМассив = Новый Массив();
	ТемпМассив.Добавить(Тип("СправочникСсылка.Контрагенты"));
	ТемпМассив.Добавить(Тип("СправочникСсылка.СтруктураПредприятия"));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ИсполнительДо", Новый ОписаниеТипов(ТемпМассив)));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_СтатусЧерновик", 
		Новый ОписаниеТипов("СправочникСсылка.торо_СтатусыСогласованияДокументовРемонтныхРабот")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_СпособВыполнения", 
		Новый ОписаниеТипов("ПеречислениеСсылка.СпособыСтроительства"), "ДеревоРемонтныхРабот",
		НСтр("ru='Способ выполнения';en='Execution method';es='El modo de la ejecución'")));
	ИзменитьРеквизиты(МассивРеквизитов);
	// гкс+ [03.23] Деснол 13.03.2023
	Если Не РольДоступна("гкс_РедактированиеЗаявкиНаРемонт") Тогда 
		Элементы.Дата.ТолькоПросмотр = Истина;
	КонецЕсли;
	// гкс- [03.23] Деснол 13.03.2023
	ЭтаФорма["гкс_СтатусЧерновик"] = справочники.торо_СтатусыСогласованияДокументовРемонтныхРабот.Черновик;
	//
	НЭлем = Элементы.Добавить("РемонтныеРаботыгкс_Примечание", Тип("ПолеФормы"), Элементы.ДеревоРемонтныхРабот);
	НЭлем.ПутьКДанным = "ДеревоРемонтныхРабот.гкс_Примечание";
	НЭлем.Заголовок = НСтр("ru='Примечание';en='Note'");
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ТолькоПросмотр = Истина;
	НЭлем.УстановитьДействие("ПриИзменении","ПримечаниеПриИзменении");
	Элементы.Переместить(Элементы["РемонтныеРаботыгкс_Примечание"], Элементы.ДеревоРемонтныхРабот,
			Элементы.ДеревоРемонтныхРаботКоличество);
			
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы["РемонтныеРаботыгкс_Примечание"].Имя);
	

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоРемонтныхРабот.НоваяОперация");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Ложь);
	Элемент.Использование = Истина;
	
	НЭлем = Элементы.Добавить("МатЗатратыгкс_Давальческие", Тип("ПолеФормы"), Элементы.МатериальныеЗатраты);
	НЭлем.ПутьКДанным = "Объект.МатериальныеЗатраты.гкс_Давальческие";
	НЭлем.Заголовок = НСтр("ru='Давальческие';en='Note'");
	НЭлем.Вид = ВидПоляФормы.ПолеФлажка;
	//
	НКом = Команды.Добавить("дс_ОтправитьНаСогласование");
	НКом.Действие = "дс_ОтправитьНаСогласование";
	НКом.Заголовок = НСтр("ru='Отправить на согласование';en='Send for approval'");
	//
	НКноп = Элементы.Добавить("дс_ОтправитьНаСогласование",Тип("КнопкаФормы"),Элементы.ФормаКоманднаяПанель);
	НКноп.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НКноп.ИмяКоманды = "дс_ОтправитьНаСогласование";
	Элементы.Переместить(Элементы["дс_ОтправитьНаСогласование"],Элементы.ФормаКоманднаяПанель,Элементы.ФормаПроведение);
	дс_ИзменитьВидимостьКнопкиОтправкиНаСогласование();
	//
	НЭлем = Элементы.Добавить("Исполнителигкс_Количество", Тип("ПолеФормы"), Элементы.ТрудовыеЗатраты);
	НЭлем.ПутьКДанным = "Объект.ТрудовыеЗатраты.гкс_Количество";
	НЭлем.Заголовок = НСтр("ru='Количество';en='Count'");
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.Видимость = Ложь;
	//
	НовыйЭлемент = Элементы.Вставить("гкс_СотрудникКонтрагента", Тип("ПолеФормы"),
		Элементы.ТрудовыеЗатратыГруппа1, Элементы.ТрудовыеЗатратыСотрудник);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ТрудовыеЗатраты.гкс_СотрудникКонтрагента";
	НовыйЭлемент.Видимость = Ложь;
	//
	Элементы.ИсполнителиПоРемонтам.ИзменятьПорядокСтрок = Ложь;
	Элементы.ИсполнителиПоРемонтамПереместить.Видимость = Ложь;
	Элементы.ТрудовыеЗатратыЗаполнитьВремяРаботыПоДлительностиСУчетомГрафика.Видимость = Ложь;
	МодифицироватьИсполнителей();
	// гкс+ [Перед записью] Куст 28.10.2020
	// гкс+ [Релиз19] Деснол
	Если Не (РольДоступна("ПолныеПрава") 
		ИЛИ РольДоступна("гкс_РедактированиеЗаявкиНаРемонт")
		ИЛИ РольДоступна("Администрирование")
		// Гкс-[TOIR20-303] Пономарёв С.О. от 20.01.2022. Добавлено:{
		ИЛИ РольДоступна("гкс_КлючевойПользователь")
		// } Гкс-[TOIR20-303] Пономарёв С.О. от 20.01.2022.
		) Тогда 
	// гкс- [Релиз19]
		Элементы.Ответственный.ТолькоПросмотр = Истина;
	КонецЕсли;
	// гкс- [Перед записью] Куст 28.10.2020
	// гкс+ [Релиз 1] Куст 21.04.2021
	НЭлем = Элементы.Вставить("ДеревоРемонтныхРаботгкс_СпособВыполнения", Тип("ПолеФормы"), 
		Элементы["ДеревоРемонтныхРабот"], Элементы.ДеревоРемонтныхРаботИсполнитель);
	НЭлем.вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДАнным = "ДеревоРемонтныхРабот.гкс_СпособВыполнения";
	НЭлем.УстановитьДействие("ПриИзменении", "гкс_СпособВыполненияДеревоПриИзменении");
	// гкс- [Релиз 1] Куст 21.04.2021
	
	Элементы.ЗавершитьРемонтныеРаботы.Видимость = Ложь;
	Элементы.РемонтыОборудованияЗавершитьРемонт.Видимость = Ложь;
	Элементы.ДеревоРемонтныхРаботВыполнено.Видимость = Ложь;
	Элементы.ТрудовыеЗатратыЗаполнитьСтоимостиПоТарифнойСтавкеСотрудника.Видимость = Ложь;
	Элементы.ТрудовыеЗатратыЗаполнитьСтоимостиПоРасценкеТехОперации.Видимость = Ложь;
	
	НоваяГруппа = Элементы.Вставить("гкс_ГруппаДеревоРР", Тип("ГруппаФормы"),
		Элементы.ВертикальнаяГруппа, Элементы.ДеревоРемонтныхРабот);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.ОтображатьЗаголовок = Ложь;
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	//
	Элементы.Переместить(Элементы.ДеревоРемонтныхРабот,Элементы["гкс_ГруппаДеревоРР"],);
	//
	НовыйЭлемент = Элементы.Добавить("гкс_ПовКоэф", Тип("ПолеФормы"),Элементы["гкс_ГруппаДеревоРР"]);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ДеревоРемонтныхРабот.гкс_ПовКоэф.Описание";
	НовыйЭлемент.ТолькоПРосмотр = Истина;
	НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
	НовыйЭлемент.МногострочныйРежим = Истина;
	//
	НовыйЭлемент = Элементы.Вставить("Деревогкс_ПовКоэф", Тип("ПолеФормы"),
Элементы.ДеревоРемонтныхРабот, Элементы.ДеревоРемонтныхРаботВыполнено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ДеревоРемонтныхРабот.гкс_ПовКоэф.Коэффициент";
	НовыйЭлемент.ТолькоПРосмотр = Истина;
	НовыйЭлемент.Заголовок = "Пов.коэф.";
//
	НоваяКоманда = Команды.Добавить("гкс_УстановитьПКоэф");
	НоваяКоманда.Действие = "гкс_УстановитьПКоэф";
	НоваяКоманда.Заголовок = "Установить повышающий коэффициент";
	//
	НоваяКнопка = Элементы.Добавить("гкс_УстановитьПКоэфКнопка", Тип("КнопкаФормы"),
	Элементы.ДеревоРемонтныхРаботКоманднаяПанель);
	НоваяКнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НоваяКнопка.ИмяКоманды = "гкс_УстановитьПКоэф";
	//
	Элементы.ДеревоРемонтныхРабот.УстановитьДействие("Выбор", "гкс_РемонтныеРаботыВыбор");
	Элементы.ТрудовыеЗатратыСотрудник.АвтоОтметкаНезаполненного = Ложь;

	// гкс+ [11.22] Деснол 03.11.2022
	НовыйЭлемент = Элементы.Вставить("гкс_ОРТехНомер", Тип("ПолеФормы"), Элементы["ОРиВР"], Элементы.РемонтыОборудованияВидРемонтныхРабот);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.РемонтыОборудования.ОбъектРемонта.ТехНомер";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	// гкс- [11.22] Деснол 03.11.2022
	#Область Проецирование
	//
	НовыйЭлемент = Элементы.Вставить("гкс_ВыбранРО", Тип("ПолеФормы"), Элементы.РемонтыОборудования, Элементы.НомерИГарантия);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.РемонтыОборудования.гкс_Выбран";
	//
	НоваяКоманда = команды.Добавить("гкс_РежимПроецирования");
	НоваяКоманда.Действие = "гкс_РежимПроецирования";
	НоваяКоманда.Заголовок = "Режим выбора (выкл)";
	//
	НоваяКоманда = команды.Добавить("гкс_Проецировать");
	НоваяКоманда.Действие = "гкс_Проецировать";
	НоваяКоманда.Заголовок = "Проецировать";
	//
	НоваяКнопка = Элементы.Добавить("гкс_РежимПроецированияКнопка", Тип("КнопкаФормы"), Элементы.РемонтыОборудования.КоманднаяПанель);
	НоваяКнопка.ИмяКоманды = "гкс_РежимПроецирования";
	//
	НоваяКнопка = Элементы.Добавить("гкс_ПроецироватьКнопка", Тип("КнопкаФормы"), Элементы.РемонтыОборудования.КоманднаяПанель);
	НоваяКнопка.ИмяКоманды = "гкс_Проецировать";
	//
	НоваяКоманда = команды.Добавить("гкс_ВыбратьВсеРемонты");
	НоваяКоманда.Действие = "гкс_ВыбратьВсеРемонты";
	НоваяКоманда.Заголовок = "Установить флажки";
	НоваяКоманда.Картинка = БиблиотекаКартинок.УстановитьФлажки;
	//
	НоваяКнопка = Элементы.Добавить("гкс_ВыбратьВсеРемонтыКнопка", Тип("КнопкаФормы"), Элементы.РемонтыОборудования.КоманднаяПанель);
	НоваяКнопка.ИмяКоманды = "гкс_ВыбратьВсеРемонты";
	//
	НоваяКоманда = команды.Добавить("гкс_ОтменитьВыборВсехРемонты");
	НоваяКоманда.Действие = "гкс_ОтменитьВыборВсехРемонты";
	НоваяКоманда.Заголовок = "Снять флажки";
	НоваяКоманда.Картинка = БиблиотекаКартинок.СнятьФлажки;
	//
	НоваяКнопка = Элементы.Добавить("гкс_ОтменитьВыборВсехРемонтыКнопка", Тип("КнопкаФормы"), Элементы.РемонтыОборудования.КоманднаяПанель);
	НоваяКнопка.ИмяКоманды = "гкс_ОтменитьВыборВсехРемонты";
	//
	#КонецОбласти

	// гкс+ [05.23] Деснол 10.05.2023
	НоваяКоманда = Команды.Добавить("гкс_ВосстановитьПорядокИзОснования");
	НоваяКоманда.Действие = "гкс_ВосстановитьПорядокИзОснования";
	НоваяКоманда.Заголовок = "Восстановить порядок ремонтов из основания";
	//
	НоваяКнопка = Элементы.Добавить("гкс_ВосстановитьПорядокИзОснования_Кнопка", Тип("КнопкаФормы"), Элементы.РемонтыОборудованияКоманднаяПанель);
	НоваяКнопка.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НоваяКнопка.ИмяКоманды = "гкс_ВосстановитьПорядокИзОснования";
	// гкс- [05.23] Деснол 10.05.2023
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция дс_ПолучитьПредставлениеКорневойРемонтнойРаботы()
	Возврат НСтр("es='Los trabajos de reparación';ru='Ремонтные работы';en='Repair work'");
КонецФункции

&НаСервере
&ИзменениеИКонтроль("УстановитьУсловноеОформление")
Процедура гкс_УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.МатериальныеЗатратыХарактеристикаНоменклатуры.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.МатериальныеЗатраты.ХарактеристикиИспользуются");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.НейтральноСерый);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("es='<las características no se usan>';ru='<характеристики не используются>';en='<характеристики не используются>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного",Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность",Ложь);

	// Оформление поля характеристики для запчастей.	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СерийныеЗапчастиХарактеристикаНоменклатуры.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СерийныеЗапчасти.ХарактеристикиИспользуются");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.НейтральноСерый);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("es='<las características no se usan>';ru='<характеристики не используются>';en='<характеристики не используются>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного",Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность",Ложь);

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СерийныеЗапчастиХарактеристикаНоменклатурыНовая.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СерийныеЗапчасти.ХарактеристикиИспользуютсяДляНовой");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.НейтральноСерый);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("es='<las características no se usan>';ru='<характеристики не используются>';en='<характеристики не используются>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного",Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность",Ложь);

	// Оформление поля Серия для запчастей.	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СерийныеЗапчастиСерияНоменклатуры.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СерийныеЗапчасти.СерииИспользуются");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.НейтральноСерый);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("es='<unas series no se usan>';ru='<серии не используются>';en='<серии не используются>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного",Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность",Ложь);

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СерийныеЗапчастиСерияНоменклатурыНовая.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СерийныеЗапчасти.СерииИспользуютсяДляНовой");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.НейтральноСерый);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("es='<unas series no se usan>';ru='<серии не используются>';en='<серии не используются>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного",Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность",Ложь);


	//

	// Чтобы не отображалась единица измерения в Материальных затратах, когда заполнена Упаковка.
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.МатериальныеЗатратыНоменклатураЕдиницаИзмерения.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.МатериальныеЗатраты.ЕдиницаИзмерения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("Отображать", Ложь);
	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТрудовыеЗатратыВремяРаботыТекст.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ТрудовыеЗатраты.ВремяРаботы");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.НейтральноСерый);


	// Доступость вида ремонта для редактирования.
	// Доступен если ЭтоПервыйДокументВЦепочке ИЛИ (ЭтоПоследнийДокументВЦепочке И (Докуммент-основание = ВО или ВД)).

	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РемонтыОборудованияВидРемонтныхРабот.Имя);

	ГруппаНЕ = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаНЕ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаНе;

	ГруппаЭлементов = ГруппаНЕ.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементов.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	//
	ОтборЭлемента = ГруппаЭлементов.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЭтоПервыйДокументВЦепочке");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	//// ИЛИ (	
	ГруппаЭлементовВложенная = ГруппаЭлементов.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовВложенная.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ОтборЭлемента = ГруппаЭлементовВложенная.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.РемонтыОборудования.ТипДокументаОснования");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "торо_ВнешнееОснованиеДляРабот";
	///( И	
	ОтборЭлемента = ГруппаЭлементовВложенная.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЭтоПоследнийДокументВЦепочке");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	//) ИЛИ

	ГруппаЭлементовВложенная = ГруппаЭлементов.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовВложенная.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ОтборЭлемента = ГруппаЭлементовВложенная.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.РемонтыОборудования.ТипДокументаОснования");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "торо_ВыявленныеДефекты";
	///( И	
	ОтборЭлемента = ГруппаЭлементовВложенная.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЭтоПоследнийДокументВЦепочке");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	//


	// Согласование++
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоСогласованияСтатусДокумента.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоСогласования.Уровень");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = 0;

	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);

	//
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоСогласованияСогласующий.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоСогласования.Уровень");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = 1;

	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);

	//
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоСогласованияЗамещающий.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоСогласования.Уровень");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = 2;

	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	// Согласование--

	// ТолькоПросмотр корня дерева ремонтных работ 
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоРемонтныхРаботРемонтнаяРабота.Имя);
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоРемонтныхРаботКоличество.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоРемонтныхРабот.РемонтнаяРабота");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	
	#Удаление
	ОтборЭлемента.ПравоеЗначение = "Ремонтные работы";
	#КонецУдаления
	#Вставка
	ОтборЭлемента.ПравоеЗначение = дс_ПолучитьПредставлениеКорневойРемонтнойРаботы();
	#КонецВставки

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	//

	// ТолькоПросмотр для Новой операции 
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоРемонтныхРаботНоваяОперация.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоРемонтныхРабот.ТехОперация");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Справочники.торо_ТехнологическиеОперации.ПустаяСсылка();

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	//
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоРемонтныхРаботИсполнитель.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоРемонтныхРаботДоговорБригада.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоРемонтныхРабот.ЭтоТехКарта");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Представление = "ДоступностьИсполнителяДляТехОперации";
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр",Истина);
	#Удаление
	Элемент.Использование = Истина;
	#КонецУдаления
	#Вставка
	// гкс+ [Релиз16] Деснол
	Элемент.Использование = Ложь;
	// гкс- [Релиз16]
	// гкс+ [КатегорияРиска] Куст
	гкс_ОбщегоНазначенияСервер.ДобавитьУОКатегорииРиска(ЭтаФорма);
	// гкс+ [Релиз 1] Куст 
	гкс_ОбщегоНазначенияСервер.гкс_ДобавитьУсловноеОформлениеДереваРР(ЭтаФорма);
	#КонецВставки
	
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ЗаполнитьДеревоРемонтныхРаботНаСервере")
Процедура гкс_ЗаполнитьДеревоРемонтныхРаботНаСервере(РемонтыОборудования_ID)

	ДеревоСФормы = РеквизитФормыВЗначение("ДеревоРемонтныхРабот");

	ДеревоСФормы.Строки.Очистить();

	КорневаяСтрока = ДеревоСФормы.Строки.Добавить();
	#Удаление
	КорневаяСтрока.РемонтнаяРабота = "Ремонтные работы";	
	#КонецУдаления
	#Вставка
	КорневаяСтрока.РемонтнаяРабота = дс_ПолучитьПредставлениеКорневойРемонтнойРаботы();	
	#КонецВставки
	
	КорневаяСтрока.Картинка = 4;
	
	Если Не РемонтыОборудования_ID = Неопределено Тогда	
		ТЗРемонтныеРаботы = Объект.РемонтныеРаботы.Выгрузить(Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", РемонтыОборудования_ID)));
	Иначе 
		#Удаление
		ТЗРемонтныеРаботы = Неопределено;	
		#КонецУдаления
		#Вставка
		ТЗРемонтныеРаботы = Объект.РемонтныеРаботы.Выгрузить();
		ТЗРемонтныеРаботы.Индексы.Добавить("Родитель_ID");
		#КонецВставки
	КонецЕсли; 

	СоздатьВетвьДереваПоТЧ(КорневаяСтрока, ТЗРемонтныеРаботы);

	СтруктураРодСтроки = Новый Структура("ID, РемонтыОборудования_ID, Родитель_ID", "", "", "");
	//торо_Ремонты.РасставитьПроцентыРодительскихСтрок(ДеревоСФормы, СтруктураРодСтроки);
	торо_ПроцентыВыполнения.ОбновитьПроцентыВыполненияВДереве(ДеревоСФормы);

	ЗначениеВРеквизитФормы(ДеревоСФормы, "ДеревоРемонтныхРабот");

КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
&ИзменениеИКонтроль("СформироватьПродолжительность")
Функция гкс_СформироватьПродолжительность(ПродолжительностьВСекундах)

	Если ПродолжительностьВСекундах = 0 Тогда

		Возврат "Ввести продолжительность";

	Иначе

		Часы    = Цел(ПродолжительностьВСекундах / 3600);
		Минуты  = Цел((ПродолжительностьВСекундах - 3600 * Часы) / 60);
		Секунды = ПродолжительностьВСекундах - 3600 * Часы - Минуты * 60;

		#Удаление
		Возврат "" + Часы + " ч. " + Минуты + " мин. " + Секунды + " с.";
		#КонецУдаления
		#Вставка
		ПродолжительностьСтрокой = СтрШаблон(НСтр("es='%1 h. %2 min. %3 sec.';
			|ru='%1 ч. %2 мин. %3 с.';en='%1 hr.%2 min. %3 s'"), Часы, Минуты, Секунды);
		Возврат ПродолжительностьСтрокой;
		#КонецВставки

	КонецЕсли;

КонецФункции

&НаСервере
Функция гкс_ПолучитьСпособСогласования(Орг, ОР)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ОбъектыРемонта.Подразделение КАК Подразделение
		|ИЗ
		|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|ГДЕ
		|	торо_ОбъектыРемонта.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ОР);
	РезультатЗапроса = Запрос.Выполнить();
	// гкс+ [2021] Куст
	Если РезультатЗапроса.Пустой() 
		ИЛИ торо_РаботаССогласованиями.гкс_ПоДокументуЕстьИстория(Объект.Ссылка) Тогда // гкс- [2021] Куст
		Возврат Неопределено;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	ПодрИсп = Справочники.СтруктураПредприятия.ПустаяСсылка();
	Если Объект.ИсполнителиПоРемонтам.Количество() 
		И ТипЗнч(Объект.ИсполнителиПоРемонтам[0].Исполнитель) = Тип("СправочникСсылка.СтруктураПредприятия") Тогда 
		ПодрИсп = Объект.ИсполнителиПоРемонтам[0].Исполнитель;
	КонецЕсли;
	Возврат торо_РаботаССогласованиями.гкс_ПолучитьСпособСогласованияПоУмолчанию(
		Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_АктОВыполненииЭтапаРабот,
		Орг, Выборка.Подразделение, ПодрИсп);
КонецФункции

&НаКлиенте
Процедура гкс_ИсполнителиПоРемонтамИсполнительПриИзмененииПосле(Элемент)
	ПодразделениеПриИзменении(Неопределено);
	ТекДанные = Элементы.ИсполнителиПоРемонтам.ТекущиеДанные;
	ТекРемонт = Элементы.РемонтыОборудования.ТекущиеДанные;
	ПервыйИсполнитель = Неопределено;
	Для Каждого СтрокаТаблицы Из Объект.ИсполнителиПоРемонтам Цикл
		Если СтрокаТаблицы.РемонтыОборудования_ID = ТекРемонт.ID Тогда 
			ПервыйИсполнитель = СтрокаТаблицы.Исполнитель;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если Не ТекДанные = Неопределено И ЗначениеЗаполнено(ТекДанные.Исполнитель) И ТекДанные.Исполнитель = ПервыйИсполнитель Тогда 
		ТекТип = ТипЗнч(ПервыйИсполнитель);
		Если ТекТип = ТипЗнч(ЭтотОбъект["гкс_ИсполнительДо"]) Тогда 
			Возврат;
		КонецЕсли;
		Если ТекТип = Тип("СправочникСсылка.Контрагенты") Тогда 
			СтруктураОпОп = Новый Структура();
			ЗадатьВопросПередИзменениемИсполнителя(СтруктураОпОп);
		Иначе
			МодифицироватьИсполнителей(ТекРемонт.ID);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СредиИсполнителейЕстьКонтрагент()
	Для Каждого СТ Из Объект.ИсполнителиПоРемонтам Цикл
		Если ТипЗнч(СТ.Исполнитель) = Тип("СправочникСсылка.Контрагенты") Тогда 
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции


&НаСервере
Процедура дс_ИзменитьВидимостьКнопкиОтправкиНаСогласование()
	гкс_ОбщегоНазначенияСервер.ИзменитьВидимостьКнопкиОтправкиНаСогласование(Элементы["дс_ОтправитьНаСогласование"],СтатусДокументаРегистр);
КонецПроцедуры

// связка между типами исполнителей
&НаСервере
Процедура ОбновитьОтображениеИсполнителей(ТекИД = Неопределено)
	Отображать = Истина;
	Если не ТекИД = Неопределено Тогда 
		ПервыйИсполнитель = Неопределено;
		Для Каждого СтрокаТаблицы Из Объект.ИсполнителиПоРемонтам Цикл
			Если СтрокаТаблицы.РемонтыОборудования_ID = ТекИД Тогда 
				ПервыйИсполнитель = СтрокаТаблицы.Исполнитель;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если Не ПервыйИсполнитель = Неопределено И ТипЗнч(ПервыйИсполнитель) = Тип("СправочникСсылка.Контрагенты") Тогда 
			Отображать = Ложь;
		КонецЕсли;
	Иначе
		Если Объект.ИсполнителиПоРемонтам.Количество() Тогда 
			Если ТипЗнч(Объект.ИсполнителиПоРемонтам[0].Исполнитель) = Тип("СправочникСсылка.Контрагенты") Тогда 
				Отображать = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Элементы.ТрудовыеЗатратыСотрудник.Видимость = Отображать;
	Элементы["Исполнителигкс_Количество"].Видимость = Не Отображать;
	// гкс+ [Релиз16] Деснол
	Если Отображать Тогда 
		Элементы["гкс_СотрудникКонтрагента"].Видимость = Ложь;
	Иначе
		ИзНаряда = Ложь;
		Для Каждого СтрокаТаблицы Из Объект.ДокументыОснования Цикл
			Если ТипЗнч(СтрокаТаблицы.ДокументОснование) = Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот") Тогда 
				ИзНаряда = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Элементы["гкс_СотрудникКонтрагента"].Видимость = ИзНаряда;
	КонецЕсли;
	// гкс- [Релиз16]
	
КонецПроцедуры

&НаСервере
Процедура МодифицироватьИсполнителей(ТекИД = Неопределено)
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТруТЧ.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		|	ТруТЧ.ID КАК ID,
		|	ТруТЧ.КТУ КАК КТУ,
		|	ТруТЧ.Сотрудник КАК Сотрудник,
		|	ТруТЧ.СуммаКНачислению КАК СуммаКНачислению,
		|	ТруТЧ.Квалификация КАК Квалификация,
		|	ВЫБОР
		|		КОГДА ТруТЧ.гкс_Количество < 1
		|			ТОГДА 1
		|		ИНАЧЕ ТруТЧ.гкс_Количество
		|	КОНЕЦ КАК гкс_Количество,
		|	ТруТЧ.гкс_СотрудникКонтрагента КАК гкс_СотрудникКонтрагента,
		|	ТруТЧ.ВремяРаботы КАК ВремяРаботы,
		|	ТруТЧ.ДатаНачала КАК ДатаНачала,
		|	ТруТЧ.ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ ИсхТру
		|ИЗ
		|	&ТЧ1 КАК ТруТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РемТЧ.ДатаНачала КАК ДатаНачала,
		|	РемТЧ.ДатаОкончания КАК ДатаОкончания,
		|	РемТЧ.ID КАК ID
		|ПОМЕСТИТЬ ИсхРем
		|ИЗ
		|	&ТЧ2 КАК РемТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсхТру.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		|	ИсхТру.ID КАК ID,
		|	ИсхТру.КТУ КАК КТУ,
		|	ИсхТру.Сотрудник КАК Сотрудник,
		|	ИсхТру.СуммаКНачислению КАК СуммаКНачислению,
		|	ИсхТру.Квалификация КАК Квалификация,
		|	ИсхТру.гкс_Количество КАК гкс_Количество,
		|	ИсхТру.гкс_СотрудникКонтрагента КАК гкс_СотрудникКонтрагента,
		|	ИсхТру.ВремяРаботы КАК ВремяРаботы,
		|	ИсхРем.ДатаНачала КАК ДатаНачала,
		|	ИсхРем.ДатаОкончания КАК ДатаОкончания,
		|	ИсхТру.ДатаНачала КАК ДатаНачала1,
		|	ИсхТру.ДатаОкончания КАК ДатаОкончания1
		|ИЗ
		|	ИсхТру КАК ИсхТру
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсхРем КАК ИсхРем
		|		ПО ИсхТру.РемонтыОборудования_ID = ИсхРем.ID
		|ИТОГИ ПО
		|	РемонтыОборудования_ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсхТру.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		|	ИсхТру.ID КАК ID,
		|	МАКСИМУМ(ИсхТру.КТУ) КАК КТУ,
		|	ИсхТру.Квалификация КАК Квалификация,
		|	СУММА(ИсхТру.гкс_Количество) КАК гкс_Количество,
		|	МАКСИМУМ(ИсхТру.ВремяРаботы) КАК ВремяРаботы,
		|	ИсхТру.гкс_СотрудникКонтрагента КАК гкс_СотрудникКонтрагента,
		|	ИсхРем.ДатаНачала КАК ДатаНачала,
		|	ИсхРем.ДатаОкончания КАК ДатаОкончания,
		|	ИсхТру.ДатаНачала КАК ДатаНачала1,
		|	ИсхТру.ДатаОкончания КАК ДатаОкончания1
		|ИЗ
		|	ИсхТру КАК ИсхТру
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсхРем КАК ИсхРем
		|		ПО ИсхТру.РемонтыОборудования_ID = ИсхРем.ID
		|
		|СГРУППИРОВАТЬ ПО
		|	ИсхТру.РемонтыОборудования_ID,
		|	ИсхТру.ID,
		|	ИсхТру.Квалификация,
		|	ИсхТру.гкс_СотрудникКонтрагента,
		|	ИсхРем.ДатаНачала,
		|	ИсхРем.ДатаОкончания,
		|	ИсхТру.ДатаНачала,
		|	ИсхТру.ДатаОкончания
		|ИТОГИ ПО
		|	РемонтыОборудования_ID";
	
	Запрос.УстановитьПараметр("ТЧ1", Объект.ТрудовыеЗатраты.Выгрузить());
	Запрос.УстановитьПараметр("ТЧ2", Объект.РемонтыОборудования.Выгрузить());
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();		
	Выборка1 = РезультатЗапроса[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Выборка2 = РезультатЗапроса[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Объект.ТрудовыеЗатраты.Очистить();
	Для Каждого СТ Из Объект.РемонтыОборудования Цикл
		ТипИсполнителей = 1;
		Для Каждого СтрИсп Из Объект.ИсполнителиПоРемонтам Цикл
			Если СтрИсп.РемонтыОборудования_ID = СТ.ID Тогда
				Если ТипЗнч(СтрИсп.Исполнитель) = Тип("СправочникСсылка.Контрагенты") Тогда 
					ТипИсполнителей = 2;
				КонецЕсли;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ТипИсполнителей = 1 Тогда 
			Выборка1.Сбросить();
			Если Выборка1.НайтиСледующий(Новый Структура("РемонтыОборудования_ID",СТ.ID)) Тогда 
				Выборка = Выборка1.Выбрать();
				Пока Выборка.Следующий() Цикл
					НужноКолво = Макс(1, Выборка.гкс_Количество);
					Сч = 0;
					Пока Сч < НужноКолво Цикл
						НоваяСтрока = Объект.ТрудовыеЗатраты.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
						Если ЗначениеЗаполнено(Выборка.ДатаНачала1) Тогда 
							НоваяСтрока.ДатаНачала = Выборка.ДатаНачала1;
							НоваяСтрока.ДатаОкончания = Выборка.ДатаОкончания1;
						КонецЕсли;
						НоваяСтрока.гкс_Количество = 1;
						НоваяСтрока.ВремяРаботыТекст = СформироватьПродолжительность(НоваяСтрока.ВремяРаботы);
						Сч = Сч + 1;
					КонецЦикла;
				КонецЦикла;
			КонецЕсли;
		Иначе
			Если Выборка2.НайтиСледующий(Новый Структура("РемонтыОборудования_ID",СТ.ID)) Тогда 
				Выборка = Выборка2.Выбрать();
				Пока Выборка.Следующий() Цикл
					НоваяСтрока = Объект.ТрудовыеЗатраты.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
					Если ЗначениеЗаполнено(Выборка.ДатаНачала1) Тогда 
						НоваяСтрока.ДатаНачала = Выборка.ДатаНачала1;
						НоваяСтрока.ДатаОкончания = Выборка.ДатаОкончания1;
					КонецЕсли;
					НоваяСтрока.ВремяРаботыТекст = СформироватьПродолжительность(НоваяСтрока.ВремяРаботы);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	//
	ОбновитьОтображениеИсполнителей(ТекИД);
КонецПроцедуры

&НаКлиенте 
Процедура ЗадатьВопросПередИзменениемИсполнителя(СтруктураОпОп)
	ОпОп = Новый ОписаниеОповещения("ЗадатьВопросПередИзменениемИсполнителяПослеВопроса", ЭтотОбъект, СтруктураОпОп);
	ПоказатьВопрос(ОпОп, НСтр("ru='Данные о сотрудниках на закладке «По операциям» будут удалены. Продолжить?';
	|en='Employee data on the By operations tab will be deleted. Proceed?'"), РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте 
Процедура ЗадатьВопросПередИзменениемИсполнителяПослеВопроса(Результат, ДопПараметры)Экспорт
	ТекРемонт = Элементы.РемонтыОборудования.ТекущиеДанные;
	Если ТекРемонт = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	ПервыйИсполнитель = Неопределено;
	ПерваяСтрокаТЧ = Неопределено;
	ВторойИсполнитель = Неопределено;
	Для Каждого СтрокаТаблицы Из Объект.ИсполнителиПоРемонтам Цикл
		Если СтрокаТаблицы.РемонтыОборудования_ID = ТекРемонт.ID Тогда 
			ПервыйИсполнитель = СтрокаТаблицы.Исполнитель;
			ПерваяСтрокаТЧ = СтрокаТаблицы;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если Результат = КодВозвратаДиалога.Да Тогда 
		Если ДопПараметры.Свойство("Удаление") Тогда 
			Отказ = ложь;
			ИсполнителиПоРемонтамПередУдалением(Элементы.ИсполнителиПоРемонтам, Отказ);
			Если НЕ Отказ Тогда 
				Объект.ИсполнителиПоРемонтам.Удалить(ПерваяСтрокаТЧ);
			КонецЕсли;
		КонецЕсли;
		МодифицироватьИсполнителей(ТекРемонт.ID);
	Иначе
		Если ДопПараметры.Свойство("Удаление") = Ложь Тогда 
			ПерваяСтрокаТЧ.Исполнитель = ЭтотОбъект["гкс_ИсполнительДо"];
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// гкс+ [12.22] Деснол 13.12.2022
&НаКлиенте
Процедура гкс_ПроецироватьПослеВопроса(Результат, ДопПараметры) Экспорт
	Если Не Результат = Неопределено Тогда 
		Если Результат = "ВР" Тогда 
			СтрокаИсточник = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", ДопПараметры.Источник))[0];
			Для Каждого ИДРемонта Из ДопПараметры.МассивИД Цикл
				СтрокаПриемник = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", ИДРемонта))[0];
				СтрокаПриемник.ВидРемонтныхРабот = СтрокаИсточник.ВидРемонтныхРабот;
			КонецЦикла;
		ИначеЕсли Результат = "Даты" Тогда 
			СтрокаИсточник = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", ДопПараметры.Источник))[0];
			Для Каждого ИДРемонта Из ДопПараметры.МассивИД Цикл
				СтрокаПриемник = Объект.РемонтыОборудования.НайтиСтроки(Новый Структура("ID", ИДРемонта))[0];
				СтрокаПриемник.ДатаНачала = СтрокаИсточник.ДатаНачала;
				СтрокаПриемник.ДатаОкончания = СтрокаИсточник.ДатаОкончания;
			КонецЦикла;
		ИначеЕсли Результат = "Операции" Тогда 
			МассивТЧ = Новый Массив();
			МассивТЧ.Добавить("РемонтныеРаботы");
			МассивТЧ.Добавить("МатериальныеЗатраты");
			МассивТЧ.Добавить("ТрудовыеЗатраты");
			МассивТЧ.Добавить("СерийныеЗапчасти");
			МассивТЧ.Добавить("ЗакрываемыеПредписания");
			Для Каждого ИмяТЧ Из МассивТЧ Цикл
				Для Каждого ИДРемонта Из ДопПараметры.МассивИД Цикл
					СтрокиРемонта = Объект[ИмяТЧ].НайтиСтроки(Новый Структура("РемонтыОборудования_ID", ИДРемонта));
					Для Каждого СтрокаТаблицы Из СтрокиРемонта Цикл
						Объект[ИмяТЧ].Удалить(Объект[ИмяТЧ].Индекс(СтрокаТаблицы));
					КонецЦикла;
				КонецЦикла;
				СтрокиИсточника = Объект[ИмяТЧ].НайтиСтроки(Новый Структура("РемонтыОборудования_ID", ДопПараметры.Источник));
				Для Каждого ИДРемонта Из ДопПараметры.МассивИД Цикл
					Для Каждого СтрокаИсточника Из СтрокиИсточника Цикл
						НоваяСтрока = Объект[ИмяТЧ].Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаИсточника);
						НоваяСтрока.РемонтыОборудования_ID = ИДРемонта;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла; 
		ИначеЕсли Результат = "Исполнители" Тогда 
			МассивТЧ = Новый Массив();
			МассивТЧ.Добавить("ИсполнителиПоРемонтам");
			Для Каждого ИмяТЧ Из МассивТЧ Цикл
				Для Каждого ИДРемонта Из ДопПараметры.МассивИД Цикл
					СтрокиРемонта = Объект[ИмяТЧ].НайтиСтроки(Новый Структура("РемонтыОборудования_ID", ИДРемонта));
					Для Каждого СтрокаТаблицы Из СтрокиРемонта Цикл
						Объект[ИмяТЧ].Удалить(Объект[ИмяТЧ].Индекс(СтрокаТаблицы));
					КонецЦикла;
				КонецЦикла;
				СтрокиИсточника = Объект[ИмяТЧ].НайтиСтроки(Новый Структура("РемонтыОборудования_ID", ДопПараметры.Источник));
				Для Каждого ИДРемонта Из ДопПараметры.МассивИД Цикл
					Для Каждого СтрокаИсточника Из СтрокиИсточника Цикл
						НоваяСтрока = Объект[ИмяТЧ].Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаИсточника);
						НоваяСтрока.РемонтыОборудования_ID = ИДРемонта;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры // гкс- [12.22] Деснол 13.12.2022

// гкс+ [Подбор ТехКарт] Куст 
&НаСервереБезКонтекста
Функция ПроверитьТКНаСервере(МассивТК)
	МассивВозврата = Новый Массив();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Проверяемые.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.торо_ИдентификаторыТехКарт КАК Проверяемые
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ИдентификаторыТехКарт КАК торо_ИдентификаторыТехКарт
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ИдентификаторыТехКарт КАК Родитель1
		|			ПО торо_ИдентификаторыТехКарт.Родитель = Родитель1.Ссылка
		|		ПО Проверяемые.Родитель = торо_ИдентификаторыТехКарт.Ссылка
		|ГДЕ
		|	Проверяемые.Ссылка В(&Родитель)
		|	И Родитель1.Родитель = ЗНАЧЕНИЕ(Справочник.торо_ИдентификаторыТехКарт.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Родитель", МассивТК);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() = Ложь Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивВозврата.Добавить(Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивВозврата;
КонецФункции

// гкс+ [Подбор ТехКарт] Куст 
&НаКлиенте
Процедура гкс_УстановитьПКоэфОбработкаВыбора(Результат, ДопПараметры)Экспорт
	Если Не Результат = Неопределено Тогда 
		Для Каждого СтрокаМассива Из Результат Цикл
			Для Каждого СтрокаТаблицы Из Объект.РемонтныеРаботы Цикл
				Если ДопПараметры.ИдРемонта = СтрокаТаблицы.РемонтыОборудования_ID
					И СтрокаМассива.ИД = СтрокаТаблицы.ID Тогда 
					СтрокаТаблицы.гкс_ПовКоэф = СтрокаМассива.гкс_ПовКоэф;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		//
		РемонтыОборудованияПриАктивизацииСтроки(Элементы.РемонтыОборудования);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция гкс_ЭтоТО(Ссылка)
	Возврат ТипЗнч(Ссылка) = Тип("СправочникСсылка.торо_ТехнологическиеОперации");
КонецФункции

&НаКлиенте
Процедура УстановитьВыбраннымПослеВыбора(Результат, ДопПараметры)Экспорт
	Если ЗначениеЗаполнено(Результат) Тогда 
		ТекДанные = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
		Если Не ТекДанные = Неопределено Тогда 
			НайдСтроки = Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("ID,РемонтыОборудования_ID"
				, ТекДанные.ID, ТекДанные.РемонтыОборудования_ID));
			Если НайдСтроки.Количество() Тогда 
				Модифицированность = Истина;
				ТекДанные.гкс_ПовКоэф = Результат;
				Для Каждого СТрокаМассива Из НайдСтроки Цикл
					СТрокаМассива.гкс_ПовКоэф = Результат;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура гкс_КомиссияПослеВопроса(Результат, ДопПараметры)Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда 
		Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаКомиссия;
	Иначе
		ЭтотОбъект["гкс_ВопросКомиссияПройден"] = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура гкс_ИзменитьВидимостьКнопкиОтправкиНаСогласование()
	гкс_ОбщегоНазначенияСервер.ИзменитьВидимостьКнопкиОтправкиНаСогласование(Элементы["дс_ОтправитьНаСогласование"],СтатусДокументаРегистр);
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ДеревоРемонтныхРаботИсполнительПриИзменении")
Процедура гкс_ДеревоРемонтныхРаботИсполнительПриИзменении(Элемент)

	ТекущиеДанные = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.ДоговорБригада = Неопределено;
		УстановитьПараметрыВыбораДоговораБригады_ДляРемонтныхРабот(ТекущиеДанные.Исполнитель, ТекущиеДанные.РемонтыОборудования_ID);
		#Вставка
		Если ЗначениеЗаполнено(ТекущиеДанные.Исполнитель) Тогда 
			Ветвь = ТекущиеДанные.ПолучитьЭлементы();
			Для Каждого СтрокаДерева Из Ветвь Цикл
				СтрокаДерева.Исполнитель = ТекущиеДанные.Исполнитель;
				Ветвь2 = СтрокаДерева.ПолучитьЭлементы();
				Для Каждого СтрокаДерева2 Из Ветвь2 Цикл
					СтрокаДерева2.Исполнитель = ТекущиеДанные.Исполнитель;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		#КонецВставки
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("УстановитьПараметрыВыбораИсполнителя_ДляРемонтныхРабот")
Процедура гкс_УстановитьПараметрыВыбораИсполнителя_ДляРемонтныхРабот(РемонтыОборудования_ID)

	СтруктураПоиска = Новый Структура("РемонтыОборудования_ID", РемонтыОборудования_ID);
	#Вставка
	// гкс+ [Релиз16] Деснол
	Если ЗначениеЗаполнено(РемонтыОборудования_ID) = Ложь Тогда 
		ТекДанные = Элементы.РемонтыОборудования.ТекущиеДанные;
		Если Не ТекДанные = Неопределено Тогда 
			СтруктураПоиска = Новый Структура("РемонтыОборудования_ID", ТекДанные.ID);
		КонецЕсли;
	КонецЕсли;
	// гкс- [Релиз16]
	#КонецВставки
	СтрокиИсполнителей = Объект.ИсполнителиПоРемонтам.НайтиСтроки(СтруктураПоиска);

	ОтборПоСсылке = Новый Массив;
	Для каждого Строка из СтрокиИсполнителей Цикл
		ОтборПоСсылке.Добавить(Строка.Исполнитель);
	КонецЦикла;

	ПараметрыВыбораМассив = Новый Массив;
	ПараметрыВыбораМассив.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(ОтборПоСсылке)));
	ПараметрыВыбораМассив.Добавить(Новый ПараметрВыбора("РежимОтображенияСписка", "Список"));
	Элементы.ДеревоРемонтныхРаботИсполнитель.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораМассив);

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("УстановитьДоступностьДляРедактированияПоТекРемонту")
Процедура гкс_УстановитьДоступностьДляРедактированияПоТекРемонту(БлокироватьДляИзменения, ОбъектРемонта)

	ПризнакВестиУчетСерийныхЗапчастей = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектРемонта, "ВестиУчетСерийныхЗапчастей");

	Элементы.ДеревоРемонтныхРабот.ТолькоПросмотр			= БлокироватьДляИзменения Или Не ПравоРедактирование ИЛИ ЭтаФорма["СогласованиеТолькоПросмотр"];
	Элементы.МатериальныеЗатраты.ТолькоПросмотр				= БлокироватьДляИзменения Или Не ПравоРедактирование ИЛИ ЭтаФорма["СогласованиеТолькоПросмотр"];
	Элементы.ДокументыВнутреннееПотребление.ТолькоПросмотр	= БлокироватьДляИзменения Или Не ПравоРедактирование;
	Элементы.ТрудовыеЗатраты.ТолькоПросмотр					= БлокироватьДляИзменения Или Не ПравоРедактирование ИЛИ ЭтаФорма["СогласованиеТолькоПросмотр"];
	#Вставка
	НеРедактированиеИсполнителей = БлокироватьДляИзменения Или Не ПравоРедактирование ИЛИ ЭтаФорма["СогласованиеТолькоПросмотр"];
	Если НеРедактированиеИсполнителей Тогда
		//Если гкс_ПроверитьРольНаСервере("гкс_РедактированиеСтоимостиВАкте") Тогда
		Если Пользователи.РолиДоступны("гкс_РедактированиеСтоимостиВАкте") Тогда
			Элементы.ИсполнителиПоРемонтам.ТолькоПросмотр = Ложь;
			Элементы.ИсполнителиПоРемонтам.ИзменятьСоставСтрок = Ложь;
			Элементы.ИсполнителиПоРемонтам.ИзменятьПорядокСтрок = Ложь;
			Элементы.ИсполнителиПоРемонтамИсполнитель.ТолькоПросмотр = Истина;
			Элементы.ИсполнителиПоРемонтамУточнениеИсполнителя.ТолькоПросмотр = Истина;
			Элементы.ИсполнителиПоРемонтамДатаНачала.ТолькоПросмотр = Истина;
			Элементы.ИсполнителиПоРемонтамДатаОкончания.ТолькоПросмотр = Истина;
			Элементы.ИсполнителиПоРемонтамСумма.ТолькоПросмотр = Ложь;
			Элементы.СтраницаПодрядчики.ТолькоПросмотр = Ложь;
			Элементы.СтраницаИсполнителей.ТолькоПросмотр = Ложь;
			Элементы.ГруппаРемонтныеРаботы.ТолькоПросмотр = Ложь;
			Элементы.ГоризонтальнаяГруппа.ТолькоПросмотр = Ложь;
			Элементы.ГруппаРемонтныеРаботы.ТолькоПросмотр = Ложь;
		Иначе
			Элементы.ИсполнителиПоРемонтам.ТолькоПросмотр = Истина;
		КонецЕсли;
	Иначе
	#КонецВставки
	Элементы.ИсполнителиПоРемонтам.ТолькоПросмотр		= БлокироватьДляИзменения Или Не ПравоРедактирование ИЛИ ЭтаФорма["СогласованиеТолькоПросмотр"];
	#Вставка
	КонецЕсли;
	#КонецВставки
	Элементы.СерийныеЗапчасти.ТолькоПросмотр				= БлокироватьДляИзменения Или Не ПравоРедактирование ИЛИ ЭтаФорма["СогласованиеТолькоПросмотр"] 
	ИЛИ НЕ ПризнакВестиУчетСерийныхЗапчастей;

	Элементы.ДобавитьВнутреннееПотребление.Доступность				= Не БлокироватьДляИзменения И ПравоРедактирование И ПравоИнтерактивноеДобвалениеВнутреннихПотреблений И (НЕ ФОВводПотребленияНаОснованииПроведенного ИЛИ (ФОВводПотребленияНаОснованииПроведенного И Объект.Проведен));
	Элементы.СводныйДокументВнутреннееПотребление.Доступность		= Не БлокироватьДляИзменения И ПравоРедактирование И ПравоИнтерактивноеДобвалениеВнутреннихПотреблений И (НЕ ФОВводПотребленияНаОснованииПроведенного ИЛИ (ФОВводПотребленияНаОснованииПроведенного И Объект.Проведен));
	Элементы.УдалитьДокументВнутреннееПотребление.Доступность		= Не БлокироватьДляИзменения И ПравоРедактирование И ПравоИнтерактивнаяПометкаУдаленияВнутреннихПотреблений;
	Элементы.ДобавитьОприходованиеИзлишков.Доступность				= Не БлокироватьДляИзменения И ПравоРедактирование И ПравоИнтерактивноеДобвалениеОприходованияИзлишков И (НЕ ФОВводОприходованияНаОснованииПроведенного ИЛИ (ФОВводОприходованияНаОснованииПроведенного И Объект.Проведен));
	Элементы.СводныйДокументОприходованиеИзлишков.Доступность       = Не БлокироватьДляИзменения И ПравоРедактирование И ПравоИнтерактивноеДобвалениеОприходованияИзлишков И (НЕ ФОВводОприходованияНаОснованииПроведенного ИЛИ (ФОВводОприходованияНаОснованииПроведенного И Объект.Проведен));
	Элементы.УдалитьДокументОприходованиеИзлишков.Доступность		= Не БлокироватьДляИзменения И ПравоРедактирование И ПравоИнтерактивнаяПометкаУдаленияОприходованияИзлишков;
	Элементы.ДеревоРемонтныхРаботДобавитьТехКарту.Доступность		= Не БлокироватьДляИзменения И ПравоРедактирование И НЕ Элементы.ДеревоРемонтныхРабот.ТолькоПросмотр И НЕ ЭтаФорма["СогласованиеТолькоПросмотр"];
	Элементы.ДеревоРемонтныхРаботДобавитьТехОперацию.Доступность	= Не БлокироватьДляИзменения И ПравоРедактирование И НЕ Элементы.ДеревоРемонтныхРабот.ТолькоПросмотр И НЕ ЭтаФорма["СогласованиеТолькоПросмотр"];
	Элементы.Заполнить.Доступность									= Не БлокироватьДляИзменения И ПравоРедактирование И НЕ ЭтаФорма["СогласованиеТолькоПросмотр"];

	ДоступностьПодбораЗапчастей = НЕ Элементы.СерийныеЗапчасти.ТолькоПросмотр;
	Элементы.СерийныеЗапчастиЗапчастиПодборНоменклатуры.Доступность = ДоступностьПодбораЗапчастей;
	Элементы.СерийныеЗапчастиЗаполнитьЗапчастиПоНормам_ТекущийРемонт.Доступность = ДоступностьПодбораЗапчастей;
	Элементы.СерийныеЗапчастиЗаполнитьЗапчастиПоНормам_ВсеРемонты.Доступность = ДоступностьПодбораЗапчастей;
	Элементы.СерийныеЗапчастиЗаполнитьЗапчастиПоОснованию_ТекущийРемонт.Доступность = ДоступностьПодбораЗапчастей;
	Элементы.СерийныеЗапчастиЗаполнитьЗапчастиПоОснованию_ВсеРемонты.Доступность = ДоступностьПодбораЗапчастей;

КонецПроцедуры

// гкс+ [] Деснол 22.09.2022
&НаСервере
Процедура ОбновитьПлановуюСтоимостьРемонтаНаСервере(ТекущийОбъект)
	
	СуммаДавальческие = 0;
	ОбщаяСумма = 0;
	Для Каждого СтрокаТаблицы Из ТекущийОбъект.МатериальныеЗатраты Цикл
		КоэфРемонтнойРаботы = 1;
		СуммаСтроки = СтрокаТаблицы.Сумма * КоэфРемонтнойРаботы;
		ОбщаяСумма = ОбщаяСумма + СуммаСтроки;
		Если СтрокаТаблицы.гкс_Давальческие Тогда 
			СуммаДавальческие = СуммаДавальческие + СуммаСтроки;
		КонецЕсли;
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВнешняяТаблицаИсполнителейРемонтныхРабот0.ВремяРаботы КАК ВремяРаботы,
		|	ВнешняяТаблицаИсполнителейРемонтныхРабот0.гкс_Количество КАК Количество,
		|	ВнешняяТаблицаИсполнителейРемонтныхРабот0.Квалификация КАК Квалификация,
		|	ВнешняяТаблицаИсполнителейРемонтныхРабот0.ID КАК ИД
		|ПОМЕСТИТЬ ВнешняяТаблицаИсполнителейРемонтныхРабот
		|ИЗ
		|	&ВнешняяТаблицаИсполнителейРемонтныхРабот0 КАК ВнешняяТаблицаИсполнителейРемонтныхРабот0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВнешняяТаблицаКоэффициентовРемонтныхРабот0.ID КАК ИД,
		|	ВЫРАЗИТЬ(ВнешняяТаблицаКоэффициентовРемонтныхРабот0.гкс_ПовКоэф КАК Справочник.гкс_ПКоэффициентыРабот) КАК гкс_ПовКоэф
		|ПОМЕСТИТЬ ВнешняяТаблицаКоэффициентовРемонтныхРабот
		|ИЗ
		|	&ВнешняяТаблицаКоэффициентовРемонтныхРабот0 КАК ВнешняяТаблицаКоэффициентовРемонтныхРабот0
		|ГДЕ
		|	НЕ ВнешняяТаблицаКоэффициентовРемонтныхРабот0.гкс_ПовКоэф = ЗНАЧЕНИЕ(Справочник.гкс_ПКоэффициентыРабот.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВнешняяТаблицаИсполнителейРемонтныхРабот.ВремяРаботы * 
		|	ЕСТЬNULL(ВнешняяТаблицаКоэффициентовРемонтныхРабот.гкс_ПовКоэф.Коэффициент, 1) КАК ВремяРаботы,
		|выбор когда ВнешняяТаблицаИсполнителейРемонтныхРабот.Количество = 0 Тогда 1 иначе
		|	ВнешняяТаблицаИсполнителейРемонтныхРабот.Количество конец КАК Количество,
		|	ВнешняяТаблицаИсполнителейРемонтныхРабот.Квалификация КАК Квалификация,
		|	ВнешняяТаблицаКоэффициентовРемонтныхРабот.ИД КАК ИД
		|ПОМЕСТИТЬ Исходные
		|ИЗ
		|	ВнешняяТаблицаИсполнителейРемонтныхРабот КАК ВнешняяТаблицаИсполнителейРемонтныхРабот
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВнешняяТаблицаКоэффициентовРемонтныхРабот КАК ВнешняяТаблицаКоэффициентовРемонтныхРабот
		|		ПО ВнешняяТаблицаИсполнителейРемонтныхРабот.ИД = ВнешняяТаблицаКоэффициентовРемонтныхРабот.ИД
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Организации.гкс_ВидЦены КАК ВидЦены,
		|	Организации.гкс_ВидЦены.ВалютаЦены КАК Валюта
		|ПОМЕСТИТЬ ОргВидЦены
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.Ссылка = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_СтоимостьЧасаКвалификацииСрезПоследних.Квалификация КАК Квалификация,
		|	торо_СтоимостьЧасаКвалификацииСрезПоследних.Стоимость КАК Стоимость
		|ПОМЕСТИТЬ ИзРегистра
		|ИЗ
		|	РегистрСведений.торо_СтоимостьЧасаКвалификации.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|				И Квалификация В
		|					(ВЫБРАТЬ
		|						ТЧ.Квалификация
		|					ИЗ
		|						Исходные КАК ТЧ)) КАК торо_СтоимостьЧасаКвалификацииСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОргВидЦены КАК ОргВидЦены
		|		ПО (ОргВидЦены.Валюта = торо_СтоимостьЧасаКвалификацииСрезПоследних.Валюта)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИзРегистра.Стоимость * Исходные.Количество * (Исходные.ВремяРаботы / 3600) КАК Стоимость
		|ИЗ
		|	Исходные КАК Исходные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИзРегистра КАК ИзРегистра
		|		ПО Исходные.Квалификация = ИзРегистра.Квалификация  ";

	Запрос.УстановитьПараметр("Организация", ТекущийОбъект.Организация);
	Запрос.УстановитьПараметр("Дата", ТекущийОбъект.Дата);
	Запрос.УстановитьПараметр("ВнешняяТаблицаИсполнителейРемонтныхРабот0", ТекущийОбъект.ТрудовыеЗатраты.Выгрузить());
	Запрос.УстановитьПараметр("ВнешняяТаблицаКоэффициентовРемонтныхРабот0", ТекущийОбъект.РемонтныеРаботы.Выгрузить());
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ПакетПервый = 5;
	Выборка = РезультатЗапроса[ПакетПервый].Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбщаяСумма = ОбщаяСумма + Выборка.Стоимость;
	КонецЦикла;
	
	ТекущийОбъект.гкс_СтоимостьРемонта = ОбщаяСумма;
		
КонецПроцедуры // гкс- [] Деснол 22.09.2022

// гкс+ [05.23] Деснол 10.05.2023
&НаСервере
Процедура ВернутьПорядокРемонтовПоОснованию()
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЧ.ДокументОснование КАК Док
	               |ПОМЕСТИТЬ Исходные
	               |ИЗ
	               |	&ТЧ1 КАК ТЧ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДокТЧ.НомерСтроки КАК НомерСтроки,
	               |	ДокТЧ.ID КАК ID,
	               |	ДокТЧ.Ссылка КАК Ссылка
	               |ИЗ
	               |	Исходные КАК Исходные
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтыОборудования КАК ДокТЧ
	               |		ПО Исходные.Док = ДокТЧ.Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Ссылка,
	               |	НомерСтроки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДокТЧ.НомерСтроки КАК НомерСтроки,
	               |	ДокТЧ.ID КАК ID,
	               |	ДокТЧ.Ссылка КАК Ссылка
	               |ИЗ
	               |	Исходные КАК Исходные
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК ДокТЧ
	               |		ПО Исходные.Док = ДокТЧ.Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Ссылка,
	               |	НомерСтроки";
	Запрос.УстановитьПараметр("ТЧ1", Объект.ДокументыОснования.Выгрузить());
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Если Не РезультатЗапроса[1].Пустой() Тогда 
		НомерРемонта = 0;
		Выборка = РезультатЗапроса[1].Выбрать();
		Пока Выборка.Следующий() Цикл
			НомерПП = 0;
			РемНайден = Ложь;
			Для Каждого СтрРем Из Объект.РемонтыОборудования Цикл
				Если СтрРем.ID = Выборка.ID Тогда 
					РемНайден = Истина;
					Прервать;
				КонецЕсли;
				НомерПП = НомерПП + 1;
			КонецЦикла;
			Если РемНайден Тогда 
				Если НомерРемонта < НомерПП Тогда 
					Объект.ДокументыОснования.Сдвинуть(НомерРемонта, НомерПП - НомерРемонта);
				ИначеЕсли НомерРемонта > НомерПП Тогда 
					Объект.ДокументыОснования.Сдвинуть(НомерРемонта, НомерРемонта - НомерПП);
				КонецЕсли;
				НомерРемонта = НомерРемонта + 1;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли Не РезультатЗапроса[2].Пустой() Тогда 
		НомерРемонта = 0;
		Выборка = РезультатЗапроса[2].Выбрать();
		Пока Выборка.Следующий() Цикл
			НомерПП = 0;
			РемНайден = Ложь;
			Для Каждого СтрРем Из Объект.РемонтыОборудования Цикл
				Если СтрРем.ID = Выборка.ID Тогда 
					РемНайден = Истина;
					Прервать;
				КонецЕсли;
				НомерПП = НомерПП + 1;
			КонецЦикла;
			Если РемНайден Тогда 
				Если НомерРемонта < НомерПП Тогда 
					Объект.РемонтыОборудования.Сдвинуть(НомерПП, НомерРемонта - НомерПП);
				ИначеЕсли НомерРемонта > НомерПП Тогда 
					Объект.РемонтыОборудования.Сдвинуть(НомерПП, НомерПП - НомерРемонта);
				КонецЕсли;
				НомерРемонта = НомерРемонта + 1;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли
КонецПроцедуры // гкс- [05.23] Деснол 10.05.2023

&НаСервереБезКонтекста
Процедура ЗавершитьЗамерОткрытияФормы(ВремяНачалаЗамера)
	
    ОценкаПроизводительности.ЗакончитьЗамерВремени("Документ.торо_АктОВыполненииЭтапаРабот.ОткрытиеФормы", ВремяНачалаЗамера); 
	
КонецПроцедуры

Функция ТекстЗапросаДанныхДляДерева()

	Возврат	"ВЫБРАТЬ
	|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.НомерСтроки КАК НомерСтроки,
	|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.ID КАК ID,
	|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Выполнено КАК Выполнено,
	|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.ПроцентВыполненияРабот КАК ПроцентВыполненияРабот,
	|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтнаяРабота КАК РемонтнаяРабота,
	|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Родитель_ID КАК Родитель_ID,
	|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА РРСсылка.ПометкаУдаления
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Картинка,
	|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.НоваяОперация КАК НоваяОперация,
	|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Исполнитель КАК Исполнитель,
	|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.ДоговорБригада КАК ДоговорБригада,
	|	ИСТИНА КАК ЭтоТехКарта
	|ПОМЕСТИТЬ ВТДанные
	|ИЗ
	|	Документ.торо_АктОВыполненииЭтапаРабот.РемонтныеРаботы КАК торо_АктОВыполненииЭтапаРаботРемонтныеРаботы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ИдентификаторыТехКарт КАК РРСсылка
	|		ПО (торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтнаяРабота = РРСсылка.Ссылка)
	|ГДЕ
	|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.НомерСтроки,
	|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.ID,
	|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Выполнено,
	|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.ПроцентВыполненияРабот,
	|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтнаяРабота,
	|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Родитель_ID,
	|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтыОборудования_ID,
	|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Количество,
	|	ВЫБОР
	|		КОГДА РРСсылка.ЭтоГруппа
	|			ТОГДА 4
	|		КОГДА РРСсылка.ПометкаУдаления
	|			ТОГДА 3
	|		ИНАЧЕ 2
	|	КОНЕЦ,
	|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.НоваяОперация,
	|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Исполнитель,
	|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.ДоговорБригада,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.торо_АктОВыполненииЭтапаРабот.РемонтныеРаботы КАК торо_АктОВыполненииЭтапаРаботРемонтныеРаботы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТехнологическиеОперации КАК РРСсылка
	|		ПО торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтнаяРабота = РРСсылка.Ссылка
	|ГДЕ
	|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДАННЫЕ.НомерСтроки КАК НомерСтроки,
	|	ВТДАННЫЕ.ID КАК ID,
	|	ВТДАННЫЕ.Выполнено КАК Выполнено,
	|	ВТДАННЫЕ.ПроцентВыполненияРабот КАК ПроцентВыполненияРабот,
	|	ВТДАННЫЕ.РемонтнаяРабота КАК РемонтнаяРабота,
	|	ВТДАННЫЕ.Родитель_ID КАК Родитель_ID,
	|	ВТДАННЫЕ.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	ВТДАННЫЕ.Количество КАК Количество,
	|	ВТДАННЫЕ.Картинка КАК Картинка,
	|	ВТДАННЫЕ.НоваяОперация КАК НоваяОперация,
	|	ВТДАННЫЕ.Исполнитель КАК Исполнитель,
	|	ВТДАННЫЕ.ДоговорБригада КАК ДоговорБригада,
	|	ВТДАННЫЕ.ЭтоТехКарта КАК ЭтоТехКарта
	|ИЗ
	|	ВТДанные КАК ВТДАННЫЕ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТДАННЫЕ.НомерСтроки
	|ИТОГИ ПО
	|	РемонтыОборудования_ID";
	
КонецФункции

Процедура гкс_ЗаполнитьДеревоРемонтныхРаботЗапросомНаСервере()
	
	// Гкс+[TOIR20-725] Литвин В.В. от 09.10.2025 Добавлено:{
	Перем НоваяСтрокаТехКарта;
	// Гкс-[TOIR20-725] Литвин В.В. от 09.10.2025}
	
    // Гкс+[TOIR20-609] Вялых Д.А. от 24.07.2025. Добавлено:{
	ДеревоСФормы = РеквизитФормыВЗначение("ДеревоРемонтныхРабот");

	ДеревоСФормы.Строки.Очистить();

	КорневаяСтрока = ДеревоСФормы.Строки.Добавить();
	КорневаяСтрока.РемонтнаяРабота = дс_ПолучитьПредставлениеКорневойРемонтнойРаботы();	
	
	КорневаяСтрока.Картинка = 4;
	// Гкс+[TOIR20-725] Литвин В.В. от 09.10.2025 Добавлено:{
	СтрокиКорневойСтроки = КорневаяСтрока.Строки;
	// Гкс-[TOIR20-725] Литвин В.В. от 09.10.2025}
	
	ЗапросДанныхДляДерева = Новый Запрос;
	ЗапросДанныхДляДерева.Текст = ТекстЗапросаДанныхДляДерева();
	ЗапросДанныхДляДерева.УстановитьПараметр("Ссылка", Объект.Ссылка); 
	
	РезультатДанныеДляДерева = ЗапросДанныхДляДерева.Выполнить();
	
	ДанныеДляДерева = РезультатДанныеДляДерева.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	Пока ДанныеДляДерева.Следующий() Цикл
		
		Строка = ДанныеДляДерева.Выбрать();
		
		Пока Строка.Следующий() Цикл
			
			Если Строка.ЭтоТехКарта Тогда
				НоваяСтрокаТехКарта = СтрокиКорневойСтроки.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТехКарта, Строка);
			Иначе
				// Гкс+[TOIR20-725] Литвин В.В. от 09.10.2025 Изменено:{
				//Было:
				//НоваяСтрока = НоваяСтрокаТехКарта.Строки.Добавить();
				//Стало:
				Если НоваяСтрокаТехКарта = Неопределено Тогда
					НоваяСтрока = СтрокиКорневойСтроки.Добавить();
				Иначе
					НоваяСтрока = НоваяСтрокаТехКарта.Строки.Добавить();
				КонецЕсли;
				// Гкс-[TOIR20-725] Литвин В.В. от 09.10.2025}
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;

	СтруктураРодСтроки = Новый Структура("ID, РемонтыОборудования_ID, Родитель_ID", "", "", "");
	//торо_Ремонты.РасставитьПроцентыРодительскихСтрок(ДеревоСФормы, СтруктураРодСтроки);
	торо_ПроцентыВыполнения.ОбновитьПроцентыВыполненияВДереве(ДеревоСФормы);

	ЗначениеВРеквизитФормы(ДеревоСФормы, "ДеревоРемонтныхРабот");
    // } Гкс-[TOIR20-609] Вялых Д.А. от 24.07.2025.
КонецПроцедуры

#КонецОбласти