#Область СлужебныеПроцедурыИФункции

&ИзменениеИКонтроль("ВыполнитьДействияПередЗаписьюПрисоединенногоФайла")
Процедура Расш_гкс_ВыполнитьДействияПередЗаписьюПрисоединенногоФайла(Источник, Отказ)

	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(Источник) = Тип("СправочникОбъект.ВерсииФайлов") Тогда
		Возврат;
	КонецЕсли;

	Если Источник.ДополнительныеСвойства.Свойство("КонвертацияФайлов") Тогда
		Возврат;
	КонецЕсли;

	Если Источник.ЭтоНовый() Тогда
		// Проверка права "Добавление".
		Если НЕ РаботаСФайламиСлужебный.ЕстьПраво("ДобавлениеФайлов", Источник.ВладелецФайла) Тогда
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("es='Es insuficientemente derecho para la adición de los ficheros en la carpeta ""%1"".';ru='Недостаточно прав для добавления файлов в папку ""%1"".';en='Not enough rights to add files to folder ""%1"".'"),
			Строка(Источник.ВладелецФайла));
		КонецЕсли;
	Иначе

		ИзмененаПометкаУдаления = 
		Источник.ПометкаУдаления <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка, "ПометкаУдаления");

		Если ИзмененаПометкаУдаления Тогда
			// Проверка права "Пометка на удаление".
			Если НЕ РаботаСФайламиСлужебный.ЕстьПраво("ПометкаУдаленияФайлов", Источник.ВладелецФайла) Тогда
				ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("es='Es insuficientemente derecho para la marca de los ficheros a la desaparición en la carpeta ""%1"".';ru='Недостаточно прав для пометки файлов на удаление в папке ""%1"".';en='Not enough rights to mark files for deletion in folder ""%1"".'"),
				Строка(Источник.ВладелецФайла));
			КонецЕсли;
		КонецЕсли;

		Если ИзмененаПометкаУдаления И ЗначениеЗаполнено(Источник.Редактирует) Тогда

			Если Источник.Редактирует = Пользователи.АвторизованныйПользователь() Тогда

				ТекстОшибки = НСтр("es='La acción es inaccesible, puesto que el fichero ""%1"" es ocupado para la redacción.';ru='Действие недоступно, так как файл ""%1"" занят для редактирования.';en='The action is not available because the file ""%1"" is busy for editing.'");
				ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, Источник.Наименование);

			Иначе
				ТекстОшибки = НСтр("es='La acción es inaccesible, puesto que el fichero ""%1"" es ocupado para la redacción "
				"por el usuario %2.';ru='Действие недоступно, так как файл ""%1"" занят для редактирования"
				"пользователем %2.';en='Action unavailable because file"" ""%1"" ""is inaccessible for editing"
				"by%2. '");
				ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,
				Источник.Наименование,
				Строка(Источник.Редактирует));

			КонецЕсли;

		КонецЕсли;

		ЗаписьПодписанногоОбъекта = Ложь;
		Если Источник.ДополнительныеСвойства.Свойство("ЗаписьПодписанногоОбъекта") Тогда
			ЗаписьПодписанногоОбъекта = Источник.ДополнительныеСвойства.ЗаписьПодписанногоОбъекта;
		КонецЕсли;

		Если ЗаписьПодписанногоОбъекта <> Истина Тогда

			СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник.Ссылка,
			"ПодписанЭП, Зашифрован, Редактирует");

			СсылкаПодписан    = СтруктураРеквизитов.ПодписанЭП;
			СсылкаЗашифрован  = СтруктураРеквизитов.Зашифрован;
			СсылкаЗанят       = ЗначениеЗаполнено(СтруктураРеквизитов.Редактирует);
			Занят = ЗначениеЗаполнено(Источник.Редактирует);

			Если Не Источник.ЭтоГруппа И Источник.ПодписанЭП И СсылкаПодписан И Занят И Не СсылкаЗанят Тогда
				ВызватьИсключение НСтр("es='El fichero firmado no es posible redactar.';ru='Подписанный файл нельзя редактировать.';en='The signed file cannot be edited.'");
			КонецЕсли;

			Если Не Источник.ЭтоГруппа И Источник.Зашифрован И СсылкаЗашифрован И Источник.ПодписанЭП И НЕ СсылкаПодписан Тогда
				ВызватьИсключение НСтр("es='El fichero cifrado no es posible firmar.';ru='Зашифрованный файл нельзя подписывать.';en='An encrypted file cannot be signed.'");
			КонецЕсли;

		КонецЕсли;

		СправочникПоддерживаетВозможностьХранитьВерсии = ОбщегоНазначения.ЕстьРеквизитОбъекта("ТекущаяВерсия", Метаданные.НайтиПоТипу(ТипЗнч(Источник)));

		Если Не Источник.ЭтоГруппа И СправочникПоддерживаетВозможностьХранитьВерсии И ЗначениеЗаполнено(Источник.ТекущаяВерсия) Тогда

			РеквизитыТекущейВерсии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			Источник.ТекущаяВерсия, "Наименование");

			// Проверим равенство имени файла и его текущей версии.
			// Если имена отличаются - имя у версии должно стать как у карточки с файлом.
			Если РеквизитыТекущейВерсии.Наименование <> Источник.Наименование
				И ЗначениеЗаполнено(Источник.ТекущаяВерсия) Тогда

				БлокировкаДанных = Новый БлокировкаДанных;
				ЭлементБлокировкиДанных = БлокировкаДанных.Добавить(
				Метаданные.НайтиПоТипу(ТипЗнч(Источник.ТекущаяВерсия)).ПолноеИмя());

				ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", Источник.ТекущаяВерсия);
				БлокировкаДанных.Заблокировать();

				Объект = Источник.ТекущаяВерсия.ПолучитьОбъект();

				Если Объект <> Неопределено Тогда
					УстановитьПривилегированныйРежим(Истина);
					Объект.Наименование = Источник.Наименование;
					// Чтобы не сработала подписка СкопироватьРеквизитыВерсииФайловВФайл.
					Объект.ДополнительныеСвойства.Вставить("ПереименованиеФайла", Истина);
					Объект.Записать();
					УстановитьПривилегированныйРежим(Ложь);
				КонецЕсли;
			КонецЕсли;

		КонецЕсли;

	КонецЕсли;
	#Удаление
	Если Не ЗначениеЗаполнено(Источник.ВладелецФайла) Тогда
	#КонецУдаления
	#Вставка
	Если Источник.ЭтоГруппа = Ложь И Не ЗначениеЗаполнено(Источник.ВладелецФайла) Тогда
	#КонецВставки

		ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("es='""%1"".';ru='Не заполнен владелец в файле"
		"""%1"".';en='The owner in the file is not filled"
		"""%1"".'"),
		Источник.Наименование);

		Если ОбновлениеИнформационнойБазы.ВыполняетсяОбновлениеИнформационнойБазы() Тогда

			ЗаписьЖурналаРегистрации(
			НСтр("es='Los ficheros. La falta del registro del fichero a la renovación ИБ';ru='Файлы.Ошибка записи файла при обновлении ИБ';en='Files. Error writing file while updating IB'",
			ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			,
			Источник.Ссылка,
			ОписаниеОшибки);
		Иначе
			ВызватьИсключение ОписаниеОшибки;
		КонецЕсли;

	КонецЕсли;

	Если Источник.ЭтоГруппа Тогда
		Источник.ИндексКартинки = 2;
	Иначе
		Источник.ИндексКартинки = РаботаСФайламиСлужебныйКлиентСервер.ПолучитьИндексПиктограммыФайла(Источник.Расширение);
	КонецЕсли;

	Если Источник.ЭтоНовый() И Не ЗначениеЗаполнено(Источник.Автор) Тогда
		Источник.Автор = Пользователи.АвторизованныйПользователь();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти