#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ОткрыватьБезусловно = Параметры.ОткрыватьБезусловно;
	ЗакрыватьПриЗакрытииВладельца = Истина;
	ЗакрыватьПриВыборе = Ложь;
	
	Если Параметры.ОдиночныйВыбор Тогда
		Элементы.СписокОР.РежимВыделения = РежимВыделенияТаблицы.Одиночный;
		ЗакрыватьПриВыборе = Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_МаршрутыРегламентныхМероприятий.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_МаршрутыРегламентныхМероприятий.ОбъектРемонта.ПодразделениеИсполнитель КАК ОбъектРемонтаПодразделениеИсполнитель,
	|	торо_АктОВыполненииРегламентногоМероприятияМероприятия.Ссылка КАК Ссылка,
	|	торо_АктОВыполненииРегламентногоМероприятияМероприятия.ДатаНачала КАК ДатаНачала,
	|	торо_АктОВыполненииРегламентногоМероприятияМероприятия.ДатаОкончания КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТ_Объекты
	|ИЗ
	|	Документ.торо_АктОВыполненииРегламентногоМероприятия.Мероприятия КАК торо_АктОВыполненииРегламентногоМероприятияМероприятия
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВыходныеДокументы КАК торо_ВыходныеДокументы
	|		ПО (торо_АктОВыполненииРегламентногоМероприятияМероприятия.Ссылка В (&Ссылка))
	|			И торо_АктОВыполненииРегламентногоМероприятияМероприятия.ОбъектРемонта = торо_ВыходныеДокументы.СписокОбъектов
	|			И торо_АктОВыполненииРегламентногоМероприятияМероприятия.ВидРемонтныхРабот = торо_ВыходныеДокументы.ВидМероприятия
	|			И (торо_ВыходныеДокументы.ВыходнойДокумент = &ВыходнойДокумент)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_МаршрутыРегламентныхМероприятий КАК торо_МаршрутыРегламентныхМероприятий
	|		ПО (торо_АктОВыполненииРегламентногоМероприятияМероприятия.Ссылка В (&Ссылка))
	|			И торо_АктОВыполненииРегламентногоМероприятияМероприятия.ОбъектРемонта = торо_МаршрутыРегламентныхМероприятий.СписокОбъектов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.ОбъектРемонта КАК ОР,
	|	торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.Исполнитель КАК Исполнитель,
	|	торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.ID КАК ID,
	|	торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.ТиповойДефект КАК ТиповойДефект,
	|	торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.Ссылка КАК ДокументОснование,
	|	NULL КАК ДатаНачала,
	|	NULL КАК ДатаОкончания,
	|	NULL КАК ВидЭксплуатации,
	|	NULL КАК ОбъектРемонтаПодразделениеИсполнитель
	|ИЗ
	|	Документ.торо_ВнешнееОснованиеДляРабот.ОбследованноеОборудование КАК торо_ВнешнееОснованиеДляРаботОбследованноеОборудование
	|ГДЕ
	|	торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.Ссылка В(&Ссылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	торо_ВыявленныеДефектыСписокДефектов.ОтказавшийЭлемент,
	|	торо_ВыявленныеДефектыСписокДефектов.ПодразделениеИсполнитель,
	|	NULL,
	|	NULL,
	|	торо_ВыявленныеДефектыСписокДефектов.Ссылка,
	|	торо_ВыявленныеДефектыСписокДефектов.Ссылка.ДатаОбнаружения,
	|	NULL,
	|	торо_ВидЭксплуатацииДляВводаНаОснованииВыявленногоДефекта.Значение,
	|	NULL
	|ИЗ
	|	Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов,
	|	Константа.торо_ВидЭксплуатацииДляВводаНаОснованииВыявленногоДефекта КАК торо_ВидЭксплуатацииДляВводаНаОснованииВыявленногоДефекта
	|ГДЕ
	|	торо_ВыявленныеДефектыСписокДефектов.Ссылка В(&Ссылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	торо_ВыявленныеДефектыСписокДефектов.ОбъектРемонта,
	|	торо_ВыявленныеДефектыСписокДефектов.ПодразделениеИсполнитель,
	|	NULL,
	|	NULL,
	|	торо_ВыявленныеДефектыСписокДефектов.Ссылка,
	|	торо_ВыявленныеДефектыСписокДефектов.Ссылка.ДатаОбнаружения,
	|	NULL,
	|	торо_ВидЭксплуатацииДляВводаНаОснованииВыявленногоДефекта.Значение,
	|	NULL
	|ИЗ
	|	Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов,
	|	Константа.торо_ВидЭксплуатацииДляВводаНаОснованииВыявленногоДефекта КАК торо_ВидЭксплуатацииДляВводаНаОснованииВыявленногоДефекта
	|ГДЕ
	|	торо_ВыявленныеДефектыСписокДефектов.Ссылка В(&Ссылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	торо_СостоянияОбъектовРемонтаОбъектыРемонта.ОбъектРемонта,
	|	торо_СостоянияОбъектовРемонтаОбъектыРемонта.ОбъектРемонта.ПодразделениеИсполнитель,
	|	NULL,
	|	NULL,
	|	торо_СостоянияОбъектовРемонтаОбъектыРемонта.Ссылка,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	Документ.торо_СостоянияОбъектовРемонта.ОбъектыРемонта КАК торо_СостоянияОбъектовРемонтаОбъектыРемонта
	|ГДЕ
	|	торо_СостоянияОбъектовРемонтаОбъектыРемонта.Ссылка В(&Ссылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	торо_УчетКонтролируемыхПоказателейПоказатели.ОбъектРемонта,
	|	торо_УчетКонтролируемыхПоказателейПоказатели.ОбъектРемонта.ПодразделениеИсполнитель,
	|	NULL,
	|	NULL,
	|	торо_УчетКонтролируемыхПоказателейПоказатели.Ссылка,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	Документ.торо_УчетКонтролируемыхПоказателей.Показатели КАК торо_УчетКонтролируемыхПоказателейПоказатели
	|ГДЕ
	|	торо_УчетКонтролируемыхПоказателейПоказатели.Ссылка В(&Ссылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_Объекты.ОбъектРемонта,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВТ_Объекты.Ссылка,
	|	ВТ_Объекты.ДатаНачала,
	|	ВТ_Объекты.ДатаОкончания,
	|	NULL,
	|	ВТ_Объекты.ОбъектРемонтаПодразделениеИсполнитель
	|ИЗ
	|	ВТ_Объекты КАК ВТ_Объекты
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ОбъектРемонта,
	|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ОбъектРемонта.ПодразделениеИсполнитель,
	|	NULL,
	|	NULL,
	|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка,
	|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ДатаНачала,
	|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ДатаОкончания,
	|	NULL,
	|	NULL
	|ИЗ
	|	Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК торо_АктОВыполненииЭтапаРаботРемонтыОборудования
	|ГДЕ
	|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка В(&Ссылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	торо_ВыявленныеДефекты.ОбъектРемонта,
	|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ОбъектРемонта.ПодразделениеИсполнитель,
	|	NULL,
	|	NULL,
	|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка,
	|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ДатаНачала,
	|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ДатаОкончания,
	|	NULL,
	|	NULL
	|ИЗ
	|	Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК торо_АктОВыполненииЭтапаРаботРемонтыОборудования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефекты
	|		ПО торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ID = торо_ВыявленныеДефекты.ID
	|ГДЕ
	|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка В(&Ссылка)";
	
	Если ПолучитьФункциональнуюОпцию("торо_ИспользоватьДокументыПринятияИСписанияОборудования") Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	торо_МаршрутыРегламентныхМероприятий.ОбъектРемонта КАК ОбъектРемонта,
		               |	торо_МаршрутыРегламентныхМероприятий.ОбъектРемонта.ПодразделениеИсполнитель КАК ОбъектРемонтаПодразделениеИсполнитель,
		               |	торо_АктОВыполненииРегламентногоМероприятияМероприятия.Ссылка КАК Ссылка,
		               |	торо_АктОВыполненииРегламентногоМероприятияМероприятия.ДатаНачала КАК ДатаНачала,
		               |	торо_АктОВыполненииРегламентногоМероприятияМероприятия.ДатаОкончания КАК ДатаОкончания
		               |ПОМЕСТИТЬ ВТ_Объекты
		               |ИЗ
		               |	Документ.торо_АктОВыполненииРегламентногоМероприятия.Мероприятия КАК торо_АктОВыполненииРегламентногоМероприятияМероприятия
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВыходныеДокументы КАК торо_ВыходныеДокументы
		               |		ПО (торо_АктОВыполненииРегламентногоМероприятияМероприятия.Ссылка В (&Ссылка))
		               |			И торо_АктОВыполненииРегламентногоМероприятияМероприятия.ОбъектРемонта = торо_ВыходныеДокументы.СписокОбъектов
		               |			И торо_АктОВыполненииРегламентногоМероприятияМероприятия.ВидРемонтныхРабот = торо_ВыходныеДокументы.ВидМероприятия
		               |			И (торо_ВыходныеДокументы.ВыходнойДокумент = &ВыходнойДокумент)
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_МаршрутыРегламентныхМероприятий КАК торо_МаршрутыРегламентныхМероприятий
		               |		ПО (торо_АктОВыполненииРегламентногоМероприятияМероприятия.Ссылка В (&Ссылка))
		               |			И торо_АктОВыполненииРегламентногоМероприятияМероприятия.ОбъектРемонта = торо_МаршрутыРегламентныхМероприятий.СписокОбъектов
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_Объекты.ОбъектРемонта КАК ОбъектРемонта,
		               |	ВТ_Объекты.ОбъектРемонтаПодразделениеИсполнитель КАК ОбъектРемонтаПодразделениеИсполнитель,
		               |	ВТ_Объекты.Ссылка КАК Ссылка,
		               |	ВТ_Объекты.ДатаНачала КАК ДатаНачала,
		               |	ВТ_Объекты.ДатаОкончания КАК ДатаОкончания,
		               |	ЕСТЬNULL(торо_СтатусыОбъектовРемонтаВУчетеСрезПоследних.СтатусОР, ЗНАЧЕНИЕ(Перечисление.торо_СтатусыОРВУчете.НеПринятоКУчету)) КАК СтатусОР
		               |ПОМЕСТИТЬ ВТ_СтатусыОР
		               |ИЗ
		               |	ВТ_Объекты КАК ВТ_Объекты
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_СтатусыОбъектовРемонтаВУчете.СрезПоследних КАК торо_СтатусыОбъектовРемонтаВУчетеСрезПоследних
		               |		ПО ВТ_Объекты.ОбъектРемонта = торо_СтатусыОбъектовРемонтаВУчетеСрезПоследних.ОбъектРемонта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		               |	торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.ОбъектРемонта КАК ОР,
		               |	торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.Исполнитель КАК Исполнитель,
		               |	торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.ID КАК ID,
		               |	торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.ТиповойДефект КАК ТиповойДефект,
		               |	торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.Ссылка КАК ДокументОснование,
		               |	NULL КАК ДатаНачала,
		               |	NULL КАК ДатаОкончания,
		               |	NULL КАК ВидЭксплуатации,
		               |	NULL КАК ОбъектРемонтаПодразделениеИсполнитель
		               |ИЗ
		               |	Документ.торо_ВнешнееОснованиеДляРабот.ОбследованноеОборудование КАК торо_ВнешнееОснованиеДляРаботОбследованноеОборудование
		               |ГДЕ
		               |	торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.Ссылка В(&Ссылка)
		               |
		               |ОБЪЕДИНИТЬ
		               |
		               |ВЫБРАТЬ
		               |	торо_ВыявленныеДефектыСписокДефектов.ОтказавшийЭлемент,
		               |	торо_ВыявленныеДефектыСписокДефектов.ПодразделениеИсполнитель,
		               |	NULL,
		               |	NULL,
		               |	торо_ВыявленныеДефектыСписокДефектов.Ссылка,
		               |	торо_ВыявленныеДефектыСписокДефектов.Ссылка.ДатаОбнаружения,
		               |	NULL,
		               |	торо_ВидЭксплуатацииДляВводаНаОснованииВыявленногоДефекта.Значение,
		               |	NULL
		               |ИЗ
		               |	Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов,
		               |	Константа.торо_ВидЭксплуатацииДляВводаНаОснованииВыявленногоДефекта КАК торо_ВидЭксплуатацииДляВводаНаОснованииВыявленногоДефекта
		               |ГДЕ
		               |	торо_ВыявленныеДефектыСписокДефектов.Ссылка В(&Ссылка)
		               |
		               |ОБЪЕДИНИТЬ
		               |
		               |ВЫБРАТЬ
		               |	торо_ВыявленныеДефектыСписокДефектов.ОбъектРемонта,
		               |	торо_ВыявленныеДефектыСписокДефектов.ПодразделениеИсполнитель,
		               |	NULL,
		               |	NULL,
		               |	торо_ВыявленныеДефектыСписокДефектов.Ссылка,
		               |	торо_ВыявленныеДефектыСписокДефектов.Ссылка.ДатаОбнаружения,
		               |	NULL,
		               |	торо_ВидЭксплуатацииДляВводаНаОснованииВыявленногоДефекта.Значение,
		               |	NULL
		               |ИЗ
		               |	Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов,
		               |	Константа.торо_ВидЭксплуатацииДляВводаНаОснованииВыявленногоДефекта КАК торо_ВидЭксплуатацииДляВводаНаОснованииВыявленногоДефекта
		               |ГДЕ
		               |	торо_ВыявленныеДефектыСписокДефектов.Ссылка В(&Ссылка)
		               |
		               |ОБЪЕДИНИТЬ
		               |
		               |ВЫБРАТЬ
		               |	торо_СостоянияОбъектовРемонтаОбъектыРемонта.ОбъектРемонта,
		               |	торо_СостоянияОбъектовРемонтаОбъектыРемонта.ОбъектРемонта.ПодразделениеИсполнитель,
		               |	NULL,
		               |	NULL,
		               |	торо_СостоянияОбъектовРемонтаОбъектыРемонта.Ссылка,
		               |	NULL,
		               |	NULL,
		               |	NULL,
		               |	NULL
		               |ИЗ
		               |	Документ.торо_СостоянияОбъектовРемонта.ОбъектыРемонта КАК торо_СостоянияОбъектовРемонтаОбъектыРемонта
		               |ГДЕ
		               |	торо_СостоянияОбъектовРемонтаОбъектыРемонта.Ссылка В(&Ссылка)
		               |
		               |ОБЪЕДИНИТЬ
		               |
		               |ВЫБРАТЬ
		               |	торо_УчетКонтролируемыхПоказателейПоказатели.ОбъектРемонта,
		               |	торо_УчетКонтролируемыхПоказателейПоказатели.ОбъектРемонта.ПодразделениеИсполнитель,
		               |	NULL,
		               |	NULL,
		               |	торо_УчетКонтролируемыхПоказателейПоказатели.Ссылка,
		               |	NULL,
		               |	NULL,
		               |	NULL,
		               |	NULL
		               |ИЗ
		               |	Документ.торо_УчетКонтролируемыхПоказателей.Показатели КАК торо_УчетКонтролируемыхПоказателейПоказатели
		               |ГДЕ
		               |	торо_УчетКонтролируемыхПоказателейПоказатели.Ссылка В(&Ссылка)
		               |
		               |ОБЪЕДИНИТЬ
		               |
		               |ВЫБРАТЬ
		               |	ВТ_СтатусыОР.ОбъектРемонта,
		               |	NULL,
		               |	NULL,
		               |	NULL,
		               |	ВТ_СтатусыОР.Ссылка,
		               |	ВТ_СтатусыОР.ДатаНачала,
		               |	ВТ_СтатусыОР.ДатаОкончания,
		               |	NULL,
		               |	ВТ_СтатусыОР.ОбъектРемонтаПодразделениеИсполнитель
		               |ИЗ
		               |	ВТ_СтатусыОР КАК ВТ_СтатусыОР
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_НастройкиДоступностиОбъектовРемонта КАК торо_НастройкиДоступностиОбъектовРемонта
		               |		ПО ВТ_СтатусыОР.СтатусОР = торо_НастройкиДоступностиОбъектовРемонта.СтатусОРВУчете
		               |ГДЕ
		               |	торо_НастройкиДоступностиОбъектовРемонта.ДоступностьПриПодборе = ИСТИНА
		               |
		               |ОБЪЕДИНИТЬ
		               |
					   |ВЫБРАТЬ
					   |	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ОбъектРемонта,
					   |	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ОбъектРемонта.ПодразделениеИсполнитель,
					   |	NULL,
					   |	NULL,
					   |	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка,
					   |	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ДатаНачала,
					   |	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ДатаОкончания,
					   |	NULL,
					   |	NULL
					   |ИЗ
					   |	Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК торо_АктОВыполненииЭтапаРаботРемонтыОборудования
					   |ГДЕ
					   |	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка В(&Ссылка)
					   |
					   |ОБЪЕДИНИТЬ
		               |
		               |ВЫБРАТЬ
		               |	торо_ВыявленныеДефекты.ОбъектРемонта,
		               |	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ОбъектРемонта.ПодразделениеИсполнитель,
		               |	NULL,
		               |	NULL,
		               |	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка,
		               |	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ДатаНачала,
		               |	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ДатаОкончания,
		               |	NULL,
		               |	NULL
		               |ИЗ
		               |	Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК торо_АктОВыполненииЭтапаРаботРемонтыОборудования
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефекты
		               |		ПО торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ID = торо_ВыявленныеДефекты.ID
		               |ГДЕ
		               |	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка В(&Ссылка)";
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("Ссылка", Параметры.ДокументыОснования);
	Запрос.УстановитьПараметр("ВыходнойДокумент", Параметры.ТипВыходногоДок);
	
	Выборка = Запрос.Выполнить().Выгрузить();
	СписокОР.Загрузить(Выборка);
	
	Если Параметры.Свойство("КонтролируемыеПоказатели") Тогда
		ЗапрашиватьКонтролируемыеПоказатели = Истина;
		Элементы.ЗапрашиватьКонтролируемыеПоказатели.Видимость = Истина;
	Иначе
		Элементы.ЗапрашиватьКонтролируемыеПоказатели.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("ПараметрыНаработки") Тогда
		ЗапрашиватьПоказателиНаработки = Истина;
		Элементы.ГруппаПоНаработке.Видимость = Истина;
	Иначе
		Элементы.ГруппаПоНаработке.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ОткрыватьБезусловно Тогда
		СписокОРКоличество = СписокОР.Количество();
		
		Если СписокОРКоличество = 0 Тогда
			Отказ = Истина;
		ИначеЕсли СписокОРКоличество = 1 Тогда
			МассивСтрок = Новый Массив();
			МассивСтрок.Добавить(СписокОР[0]);
			ПередатьВДокумент(МассивСтрок);
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОРВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = СписокОР.НайтиПоИдентификатору(ВыбраннаяСтрока);
	МассивСтрок = Новый Массив();
	МассивСтрок.Добавить(ТекущаяСтрока);
	ПередатьВДокумент(МассивСтрок);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	МассивСтрок = Новый Массив();
	Для каждого ВыбраннаяСтрока из Элементы.СписокОР.ВыделенныеСтроки Цикл
		ТекущаяСтрока = СписокОР.НайтиПоИдентификатору(ВыбраннаяСтрока);
		МассивСтрок.Добавить(ТекущаяСтрока);
	КонецЦикла;
	ПередатьВДокумент(МассивСтрок);
	
КонецПроцедуры

#КонецОбласти
 
#Область СлужебныеПроцедурыИФункции

&НаКлиенте 
Процедура ПередатьВДокумент(МассивСтрок)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("МассивСтрок", МассивСтрок);
		
	Если ЗапрашиватьКонтролируемыеПоказатели Тогда
		
		МассивОР = Новый массив;
		Для каждого ВыбраннаяСтрока из МассивСтрок Цикл
			МассивОР.Добавить(ВыбраннаяСтрока.ОР);
		КонецЦикла;
		
		МассивДанныхПоказателей = ПолучитьДанныеИзмеряемыхПоказателей(МассивОР);
		СписокВидовПоказателей = Новый СписокЗначений();
		
		Для каждого СтрокаДанныхПоказателей из МассивДанныхПоказателей Цикл
			Если СписокВидовПоказателей.НайтиПоЗначению(СтрокаДанныхПоказателей.Показатель) = Неопределено Тогда
				СписокВидовПоказателей.Добавить(СтрокаДанныхПоказателей.Показатель,,Истина);
			КонецЕсли;
		КонецЦикла;
		
		ДополнительныеПараметры.Вставить("МассивДанныхКонтролируемыхПоказателей", МассивДанныхПоказателей);
		
		Если СписокВидовПоказателей.Количество() > 0 Тогда
			ТекстЗаголовкаОкна = НСтр("es='Escojan los índices controlados';ru='Выберите контролируемые показатели';en='Choose monitored metrics'");
			Оповещение = Новый ОписаниеОповещения("ПослеВыбораКонролируемыхПоказателей",ЭтотОбъект,ДополнительныеПараметры); 
			СписокВидовПоказателей.ПоказатьОтметкуЭлементов(Оповещение, ТекстЗаголовкаОкна);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ПослеВыбораКонролируемыхПоказателей(Новый СписокЗначений, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКонролируемыхПоказателей(Список, ДополнительныеПараметры) Экспорт
	
	МассивСтрок = ДополнительныеПараметры.МассивСтрок;
	ДополнительныеПараметры.Вставить("СписокКонтролируемыхПоказателей",Список);
	
	Если ЗапрашиватьПоказателиНаработки Тогда
		МассивОР = Новый массив;
		Для каждого ВыбраннаяСтрока из МассивСтрок Цикл
			МассивОР.Добавить(ВыбраннаяСтрока.ОР);
		КонецЦикла;
		
		МассивДанныхПоказателей = ПолучитьДанныеПоказателейНаработки(МассивОР);
		СписокВидовПоказателей = Новый СписокЗначений();
		
		Для каждого СтрокаДанныхПоказателей из МассивДанныхПоказателей Цикл
			Если СписокВидовПоказателей.НайтиПоЗначению(СтрокаДанныхПоказателей.Показатель) = Неопределено Тогда
				СписокВидовПоказателей.Добавить(СтрокаДанныхПоказателей.Показатель,,Истина);
			КонецЕсли;
		КонецЦикла;
		
		ДополнительныеПараметры.Вставить("МассивДанныхПоказателейНаработки", МассивДанныхПоказателей);
		
		Если СписокВидовПоказателей.Количество() > 0 Тогда
			ТекстЗаголовкаОкна = НСтр("es='Escojan los índices de la elaboración';ru='Выберите показатели наработки';en='Select Runtime Indicators'");
			Оповещение = Новый ОписаниеОповещения("ПослеВыбораПоказателейНаработки",ЭтотОбъект,ДополнительныеПараметры); 
			СписокВидовПоказателей.ПоказатьОтметкуЭлементов(Оповещение, ТекстЗаголовкаОкна);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
		
	ПослеВыбораПоказателейНаработки(Новый СписокЗначений, ДополнительныеПараметры);
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПоказателейНаработки(Список, ДополнительныеПараметры) Экспорт
	
	ДополнительныеПараметры.Вставить("СписокПоказателейНаработки", Список);
	ПередатьВДокументЗавершение(ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередатьВДокументЗавершение(ДополнительныеПараметры)
	
	МассивСтрок = ДополнительныеПараметры.МассивСтрок;
		
	Если ЗапрашиватьКонтролируемыеПоказатели Тогда
		СоответствиеКонтролируемыхПоказателей = ПодготовитьСоответствиеКонтролируемыхПоказателей(ДополнительныеПараметры);
	КонецЕсли;
	
	Если ЗапрашиватьПоказателиНаработки Тогда
		СоответствиеПоказателейНаработки = ПодготовитьСоответствиеПоказателейНаработки(ДополнительныеПараметры);
	КонецЕсли;
	
	МассивВозврата = Новый Массив;
	Для каждого ТекущаяСтрока из МассивСтрок Цикл
		СтруктураВозврата = Новый Структура("ОбъектРемонта, ID, ПодразделениеИсполнитель, ТиповойДефект, ДокументОснование, ДатаНачала, ДатаОкончания, ВидЭксплуатации");
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, ТекущаяСтрока);
		СтруктураВозврата.ОбъектРемонта = ТекущаяСтрока.ОР;
		СтруктураВозврата.ПодразделениеИсполнитель = ТекущаяСтрока.Исполнитель;
		
		Если ЗапрашиватьКонтролируемыеПоказатели Тогда
			ДанныеПоказателей = СоответствиеКонтролируемыхПоказателей[СтруктураВозврата.ОбъектРемонта];
			Если ДанныеПоказателей = Неопределено Тогда
				ДанныеПоказателей = Новый Массив;
			КонецЕсли;
			СтруктураВозврата.Вставить("КонтролируемыеПоказатели", ДанныеПоказателей);
		КонецЕсли;
		
		Если ЗапрашиватьПоказателиНаработки Тогда
			ДанныеПоказателей = СоответствиеПоказателейНаработки[СтруктураВозврата.ОбъектРемонта];
			Если ДанныеПоказателей = Неопределено Тогда
				ДанныеПоказателей = Новый Массив;
			КонецЕсли;
			СтруктураВозврата.Вставить("ПоказателиНаработки", ДанныеПоказателей);
			СтруктураВозврата.Вставить("ПроставлятьПлановуюНаработку", ПроставлятьПлановуюНаработку);
			СтруктураВозврата.Вставить("УчитыватьПростои", УчитыватьПростоиОР);
		КонецЕсли;
		
		МассивВозврата.Добавить(СтруктураВозврата);
	КонецЦикла;
	
	Для каждого СтруктураВозврата из МассивВозврата Цикл
		ОповеститьОВыборе(СтруктураВозврата);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Функция ПодготовитьСоответствиеКонтролируемыхПоказателей(СтруктураПараметров)
	
	МассивДанныхКонтролируемыхПоказателей = СтруктураПараметров.МассивДанныхКонтролируемыхПоказателей;
	СписокКонтролируемыхПоказателей = СтруктураПараметров.СписокКонтролируемыхПоказателей;
	
	СоответствиеПоказателей = Новый Соответствие();
	
	Если СписокКонтролируемыхПоказателей <> Неопределено Тогда
		Для каждого СтрокаДанныхПоказателей из МассивДанныхКонтролируемыхПоказателей Цикл
			ЗначениеСписка = СписокКонтролируемыхПоказателей.НайтиПоЗначению(СтрокаДанныхПоказателей.Показатель);
			Если ЗначениеСписка.Пометка Тогда
				ЗначениеСоотв = СоответствиеПоказателей[СтрокаДанныхПоказателей.ИсходныйОР];
				Если ЗначениеСоотв = Неопределено Тогда
					ЗначениеСоотв = Новый Массив;
				КонецЕсли;
				ЗначениеСоотв.Добавить(СтрокаДанныхПоказателей);
				СоответствиеПоказателей.Вставить(СтрокаДанныхПоказателей.ИсходныйОР, ЗначениеСоотв);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Возврат СоответствиеПоказателей;
	
КонецФункции

&НаКлиенте
Функция ПодготовитьСоответствиеПоказателейНаработки(СтруктураПараметров)
			
	МассивДанныхПоказателейНаработки = СтруктураПараметров.МассивДанныхПоказателейНаработки;
	СписокПоказателейНаработки = СтруктураПараметров.СписокПоказателейНаработки;

	СоответствиеПоказателей = Новый Соответствие();
	
	Если СписокПоказателейНаработки <> Неопределено Тогда
		Для каждого СтрокаДанныхПоказателей из МассивДанныхПоказателейНаработки Цикл
			ЗначениеСписка = СписокПоказателейНаработки.НайтиПоЗначению(СтрокаДанныхПоказателей.Показатель);
			Если ЗначениеСписка.Пометка Тогда
				ЗначениеСоотв = СоответствиеПоказателей[СтрокаДанныхПоказателей.ОбъектРемонта];
				Если ЗначениеСоотв = Неопределено Тогда
					ЗначениеСоотв = Новый Массив;
				КонецЕсли;
				ЗначениеСоотв.Добавить(СтрокаДанныхПоказателей);
				СоответствиеПоказателей.Вставить(СтрокаДанныхПоказателей.ОбъектРемонта, ЗначениеСоотв);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Возврат СоответствиеПоказателей;
	
КонецФункции


&НаСервереБезКонтекста
Функция ПолучитьДанныеИзмеряемыхПоказателей(МассивОР)
	
	МассивДанныхПоказателей = ПланыВидовХарактеристик.торо_ИзмеряемыеПоказателиОбъектовРемонта.ПолучитьСтруктуруИзмеряемыхПоказателейОбъектовРемонта(МассивОР,,Истина);
	Возврат МассивДанныхПоказателей;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеПоказателейНаработки(МассивОР)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_ПараметрыНаработкиОбъектовРемонтаСрезПоследних.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_ПараметрыНаработкиОбъектовРемонтаСрезПоследних.Показатель КАК Показатель
	|ИЗ
	|	РегистрСведений.торо_ПараметрыНаработкиОбъектовРемонта.СрезПоследних(, ОбъектРемонта В (&МассивОР)) КАК торо_ПараметрыНаработкиОбъектовРемонтаСрезПоследних";
	Запрос.УстановитьПараметр("МассивОР", МассивОР);
	Результат = Запрос.Выполнить();
		
	Возврат торо_ОбщегоНазначения.РезультатЗапросаВМассивСтруктур(Результат);
	
КонецФункции

#КонецОбласти
