#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции
#Область Печать

// Заполняет список команд печати.
//
// Параметры:
// КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Учет контролируемых показателей
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_УчетКонтролируемыхПоказателей";
	КомандаПечати.Идентификатор = "УчетКонтролируемыхПоказателей";
	КомандаПечати.Представление = НСтр("es='El recuento de los índices controlados';ru='Учет контролируемых показателей';en='Accounting for controlled indicators'");
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	
КонецПроцедуры

// Сформировать печатные формы объектов.
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую.
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать.
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати.
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы.
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "УчетКонтролируемыхПоказателей") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"УчетКонтролируемыхПоказателей", 
		"Учет контролируемых показателей", 
		ПечатьКонтролируемыхПоказателей(МассивОбъектов, ПараметрыПечати),
		,
		"Документ.торо_УчетКонтролируемыхПоказателей.ПФ_MXL_УчетКонтролируемыхПоказателей");
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьКонтролируемыхПоказателей(МассивОбъектов, ПараметрыПечати)

	ТабДок = Новый ТабличныйДокумент;
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_УчетКонтролируемыхПоказателей.ПФ_MXL_УчетКонтролируемыхПоказателей");
	
	ЗапросШапки = Новый Запрос;
	ЗапросШапки.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_УчетКонтролируемыхПоказателей.Ссылка КАК Ссылка,
	|	торо_УчетКонтролируемыхПоказателей.Номер КАК Номер,
	|	торо_УчетКонтролируемыхПоказателей.Дата КАК Дата,
	|	торо_УчетКонтролируемыхПоказателей.Организация КАК Организация,
	|	торо_УчетКонтролируемыхПоказателей.Подразделение КАК Подразделение,
	|	торо_УчетКонтролируемыхПоказателей.Ответственный КАК Ответственный,
	|	торо_УчетКонтролируемыхПоказателей.Комментарий КАК Комментарий,
	|	торо_УчетКонтролируемыхПоказателей.Показатели.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ОбъектРемонта КАК ОбъектРемонта,
	|		Показатель КАК Показатель,
	|		Значение КАК Значение,
	|		ПредыдущееЗначение КАК ПредыдущееЗначение,
	|		ДатаКонтроля КАК ДатаКонтроля
	|	) КАК Показатели
	|ИЗ
	|	Документ.торо_УчетКонтролируемыхПоказателей КАК торо_УчетКонтролируемыхПоказателей
	|ГДЕ
	|	торо_УчетКонтролируемыхПоказателей.Ссылка В(&Ссылка)";
	
	ЗапросШапки.УстановитьПараметр("Ссылка", МассивОбъектов);
	ВыборкаШапки = ЗапросШапки.Выполнить().Выбрать();
	
	ЭтоПервый = Истина;
	
	Пока ВыборкаШапки.Следующий() Цикл	
		Если НЕ ЭтоПервый Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ЭтоПервый = Ложь;
		
		Шапка = Макет.ПолучитьОбласть("Шапка");
		СтрокаТаблициОР = Макет.ПолучитьОбласть("СтрокаТаблициОР");
		СтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
		Подвал = Макет.ПолучитьОбласть("Подвал");
		
		Шапка.Параметры.Заполнить(ВыборкаШапки);
		ТабДок.Вывести(Шапка);
		
		Ном = 1;
		СтароеЗначение  = Справочники.торо_ОбъектыРемонта.ПустаяСсылка();
		ТабПоказателей = ВыборкаШапки.Показатели.Выгрузить();
		Для Каждого Строка Из ТабПоказателей Цикл
			Если Строка.ОбъектРемонта <> СтароеЗначение тогда		
				СтрокаТаблициОР.Параметры.Н = Ном;
				СтрокаТаблициОР.Параметры.Заполнить(Строка);
				СтрокаТаблициОР.Параметры.ОбъектРемонта = торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(Строка.ОбъектРемонта);
				ТабДок.Вывести(СтрокаТаблициОР);
				СтароеЗначение = Строка.ОбъектРемонта;
				Ном = Ном + 1;
			КонецЕсли;
			СтрокаТаблицы.Параметры.ЕдиницаИзмерения = Строка.Показатель.ЕдиницаИзмерения;	
			СтрокаТаблицы.Параметры.Заполнить(Строка);
			ТабДок.Вывести(СтрокаТаблицы);
		КонецЦикла;
		
		Подвал.Параметры.Ответственный = ВыборкаШапки.Ответственный;
		Подвал.Параметры.Комментарий = ВыборкаШапки.Комментарий;
		
		ТабДок.Вывести(Подвал);
		
	КонецЦикла;
	
	ТабДок.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб         = Истина;
	ТабДок.ТолькоПросмотр      = Истина;
	ТабДок.ОтображатьСетку     = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	
	ТабДок.ТолькоПросмотр = Истина;
	Возврат ТабДок;
	
КонецФункции // ПечатьКонтролируемыхПоказателей()

#КонецОбласти

Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	Настройки.ПриПолученииСлужебныхРеквизитов = Истина;
	
КонецПроцедуры

Процедура ПриПолученииСлужебныхРеквизитов(Реквизиты) Экспорт
	
	Реквизиты.Добавить("ИзМобильного");
		
КонецПроцедуры


#КонецОбласти

#КонецЕсли