#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПЕРЕМЕННЫЕ

перем СтруктураДанных Экспорт;  // Структура, хранящая данные для работы с уведомлениями.
Перем БезусловнаяЗапись Экспорт; // Отключает проверки при записи документа.

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.торо_АктОВыполненииЭтапаРабот") 
		ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.торо_ВыявленныеДефекты")
		ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.торо_АктОВыполненииРегламентногоМероприятия")
		Тогда
		
		Организация = Основание.Организация;
		Подразделение = Основание.Подразделение;
		
	ИначеЕсли ТипЗнч(Основание)=Тип("СправочникСсылка.торо_ОбъектыРемонта") Тогда
		Если ЗначениеЗаполнено(Основание) Тогда
			Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание, "Организация, Подразделение");
			Организация = Реквизиты.Организация;
			Подразделение = Реквизиты.Подразделение;
		КонецЕсли;
		
		Дата = ТекущаяДата();
		
	ИначеЕсли ТипЗнч(Основание) = Тип("Структура") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Основание);
		
		Если Основание.Свойство("ОбъектРемонта") И ЗначениеЗаполнено(Основание.ОбъектРемонта) Тогда
			Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание.ОбъектРемонта, "Организация, Подразделение");
			Организация = Реквизиты.Организация;
			Подразделение = Реквизиты.Подразделение;
			Дата = ТекущаяДата();
			
		  	Если Основание.Свойство("Показатель") Тогда
				НоваяСтрока = Показатели.Добавить();
				НоваяСтрока.Показатель = Основание.Показатель;
				
				ДанныеПоказателя = ПланыВидовХарактеристик.торо_ИзмеряемыеПоказателиОбъектовРемонта.ПолучитьСтруктуруИзмеряемыхПоказателейОбъектовРемонта(Основание.ОбъектРемонта,Основание.Показатель,Истина);
				Если ДанныеПоказателя.Количество() > 0 Тогда
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеПоказателя[0]);
				КонецЕсли;
				НоваяСтрока.ОбъектРемонта = Основание.ОбъектРемонта;
				НоваяСтрока.ДатаКонтроля = Дата;
			Иначе
				НоваяСтрока = Показатели.Добавить();
				НоваяСтрока.ОбъектРемонта = Основание.ОбъектРемонта;
				НоваяСтрока.ДатаКонтроля = Дата;
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЕсли; 
	
	Если НЕ ТипЗнч(Основание) = Тип("Структура") Тогда 
		ДокументОснование = Основание;
	КонецЕсли;
	
	торо_ЗаполнениеДокументов.ЗаполнитьСтандартныеРеквизитыШапкиПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ИндексСтроки = 0;
	ШаблонСообщения = НСтр("es='""los Índices""';ru='Не заполнена колонка ""Значение"" в строке %1 списка ""Показатели""';en='The ""Value"" column in row%1 of the ""Metrics"" list is not filled'");

	Для каждого Строка из Показатели Цикл
		Если НЕ ЗначениеЗаполнено(Строка.Значение) И Строка.Значение <> 0 Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ИндексСтроки+1);
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Показатели", ИндексСтроки+1, "Значение");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,Поле,"Объект", Отказ);   
		КонецЕсли;
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ФО_ИспользоватьСтандартныеОповещенияОПревышенииПоказателей = Константы.торо_ИспользоватьСтандартныеОповещенияОПревышенииПоказателей.Получить();
	
	ТипыХарактеристик = Метаданные.ПланыВидовХарактеристик.торо_ИзмеряемыеПоказателиОбъектовРемонта.Тип;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Показатели.ОбъектРемонта КАК ОбъектРемонта,
		|	Показатели.Показатель КАК Показатель,
		|	Показатели.ДатаКонтроля КАК ДатаКонтроля
		|ПОМЕСТИТЬ ВТ_ПоказателиДокумента
		|ИЗ
		|	&Показатели КАК Показатели
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ЗначенияКонтролируемыхПоказателей.ОбъектРемонта КАК ОбъектРемонта,
		|	торо_ЗначенияКонтролируемыхПоказателей.Показатель КАК Показатель,
		|	торо_ЗначенияКонтролируемыхПоказателей.ДатаКонтроля КАК ДатаКонтроля,
		|	КОЛИЧЕСТВО(торо_ЗначенияКонтролируемыхПоказателей.Значение) КАК Значение
		|ИЗ
		|	РегистрСведений.торо_ЗначенияКонтролируемыхПоказателей КАК торо_ЗначенияКонтролируемыхПоказателей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПоказателиДокумента КАК ПоказателиДокумента
		|		ПО торо_ЗначенияКонтролируемыхПоказателей.ОбъектРемонта = ПоказателиДокумента.ОбъектРемонта
		|			И торо_ЗначенияКонтролируемыхПоказателей.Показатель = ПоказателиДокумента.Показатель
		|			И торо_ЗначенияКонтролируемыхПоказателей.ДатаКонтроля = ПоказателиДокумента.ДатаКонтроля
		|			И НЕ торо_ЗначенияКонтролируемыхПоказателей.Регистратор = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	торо_ЗначенияКонтролируемыхПоказателей.ОбъектРемонта,
		|	торо_ЗначенияКонтролируемыхПоказателей.Показатель,
		|	торо_ЗначенияКонтролируемыхПоказателей.ДатаКонтроля
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(торо_ЗначенияКонтролируемыхПоказателей.Значение) > 0
		|";
	
	Запрос.УстановитьПараметр("Показатели", Показатели);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
	    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ШаблонСообщения = НСтр("es='¡Para el objeto de la reparación ""%1"" a la fecha del control ""%2"" es indicado ya el significado del índice ""%3""!';ru='Для объекта ремонта ""%1"" на дату контроля ""%2"" уже указано значение показателя ""%3""!';en='For the repair object ""%1"", the value of the indicator ""%3"" is already indicated on the inspection date ""%2!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ВыборкаДетальныеЗаписи.ОбъектРемонта, ВыборкаДетальныеЗаписи.ДатаКонтроля, ВыборкаДетальныеЗаписи.Показатель);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЦикла;
		
		Возврат;
	КонецЕсли;
	
	тчПоказатели = Показатели.Выгрузить();
	тчПоказатели.Колонки.Добавить("КритическийМаксимум", ТипыХарактеристик);
	тчПоказатели.Колонки.Добавить("ДопустимыйМаксимум", ТипыХарактеристик);
	тчПоказатели.Колонки.Добавить("ДопустимыйМинимум", ТипыХарактеристик);
	тчПоказатели.Колонки.Добавить("КритическийМинимум", ТипыХарактеристик);
	
	Если ФО_ИспользоватьСтандартныеОповещенияОПревышенииПоказателей Тогда
		тчПоказатели.Индексы.Добавить("ОбъектРемонта, Показатель");
		ЗаполнитьГраничныеЗначенияПоказателей(тчПоказатели);
	КонецЕсли;
		
	// Регистр торо_ЗначенияКонтролируемыхПоказателей
	Движения.торо_ЗначенияКонтролируемыхПоказателей.Записывать = Истина;
	
	Для Каждого ТекСтрокаПоказатели Из тчПоказатели Цикл
		Движение = Движения.торо_ЗначенияКонтролируемыхПоказателей.Добавить();
		Движение.Период        = Дата;
		Если ЗначениеЗаполнено(ТекСтрокаПоказатели.ДатаКонтроля) Тогда
			Движение.ДатаКонтроля  = ТекСтрокаПоказатели.ДатаКонтроля;
		Иначе
			Движение.ДатаКонтроля  = Дата;
		КонецЕсли; 
		
		Движение.ОбъектРемонта = ТекСтрокаПоказатели.ОбъектРемонта;
		Движение.Показатель    = ТекСтрокаПоказатели.Показатель;
		Движение.Значение      = ТекСтрокаПоказатели.Значение;
		Если ФО_ИспользоватьСтандартныеОповещенияОПревышенииПоказателей Тогда
			ПроверитьЗначениеПоказателя(ТекСтрокаПоказатели);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьГраничныеЗначенияПоказателей(табПоказатели)
	
	СписокОбъектовРемонта = табПоказатели.ВыгрузитьКолонку("ОбъектРемонта");
	СписокПоказателей = табПоказатели.ВыгрузитьКолонку("Показатель");
	МассивПоказателей = ПланыВидовХарактеристик.торо_ИзмеряемыеПоказателиОбъектовРемонта.ПолучитьСтруктуруИзмеряемыхПоказателейОбъектовРемонта(СписокОбъектовРемонта,СписокПоказателей,Истина);
	
	СтруктураПоиска = Новый Структура("ОбъектРемонта, Показатель");
	Для каждого СтруктураВозврата из МассивПоказателей Цикл
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтруктураВозврата);
		СтруктураПоиска.ОбъектРемонта = СтруктураВозврата.ИсходныйОР;
		НайденныеСтроки = табПоказатели.НайтиСтроки(СтруктураПоиска);
		Для каждого НайденнаяСтрока из НайденныеСтроки Цикл
			ЗаполнитьЗначенияСвойств(НайденнаяСтрока, СтруктураВозврата);
			НайденнаяСтрока.ОбъектРемонта = СтруктураВозврата.ИсходныйОР;
		КонецЦикла;
	КонецЦикла;		
КонецПроцедуры

// Процедура выполняет проверку показателей и формирует сообщения 
// в случае выхода за рамки критических показателей.
//
Процедура ПроверитьЗначениеПоказателя(СтрокаПроверки)
	
	Показатель	 = СтрокаПроверки.Показатель;
	Значение	 = СтрокаПроверки.Значение;
	ОР			 = СтрокаПроверки.ОбъектРемонта;
	
	КритическийМаксимум	 = СтрокаПроверки.КритическийМаксимум;
	ДопустимыйМаксимум	 = СтрокаПроверки.ДопустимыйМаксимум;
	ДопустимыйМинимум	 = СтрокаПроверки.ДопустимыйМинимум;
	КритическийМинимум	 = СтрокаПроверки.КритическийМинимум;
	
	Если ПолучитьФункциональнуюОпцию("торо_ИспользоватьУведомленияОСобытияхСистемы") И ПолучитьФункциональнуюОпцию("торо_ИспользоватьРемонтыПоСостоянию") Тогда
		НаборЗаписей = РегистрыСведений.торо_ПараметрыОповещенияОСостоянииОборудования.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ОбъектРемонта.Установить(ОР);
		НаборЗаписей.Отбор.Показатель.Установить(Показатель);
		НаборЗаписей.Прочитать();
		Для Каждого Запись Из НаборЗаписей Цикл
			Если ЗначениеЗаполнено(Запись.СобытиеВозникновенияОповещения) Тогда
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Не ТипЗнч(Значение) = Тип("Число") 
		ИЛИ НЕ ТипЗнч(КритическийМаксимум) = Тип("Число")
		ИЛИ НЕ ТипЗнч(ДопустимыйМаксимум) = Тип("Число")
		ИЛИ НЕ ТипЗнч(ДопустимыйМинимум) = Тип("Число")
		ИЛИ НЕ ТипЗнч(КритическийМинимум) = Тип("Число")
		Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	ТекстСообщения = "";
	Если Значение > КритическийМаксимум И ЗначениеЗаполнено(КритическийМаксимум) Тогда
		ТекстСообщения = "превышает критический максимум";
	ИначеЕсли (Значение > ДопустимыйМаксимум) и (Значение <= КритическийМаксимум) И ЗначениеЗаполнено(КритическийМаксимум + ДопустимыйМаксимум) Тогда
		ТекстСообщения = "превышает допустимый максимум";
	ИначеЕсли (Значение < ДопустимыйМинимум) и (Значение >= КритическийМинимум) И ЗначениеЗаполнено(ДопустимыйМинимум + КритическийМинимум)  Тогда
		ТекстСообщения = "ниже допустимого минимума";
	ИначеЕсли (Значение < КритическийМинимум) И ЗначениеЗаполнено(КритическийМинимум) Тогда
		ТекстСообщения = "ниже критического минимума";
	КонецЕсли;
	
	Если ТекстСообщения <> "" Тогда
		ТекстСообщения = "Значение показателя '"  + Показатель.Наименование + "' " + ТекстСообщения;
		
		МенеджерЗаписи = РегистрыСведений.торо_ОчередьУведомлений.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ТемаПисьма        = ОР;
		МенеджерЗаписи.ТелоПисьма        = ТекстСообщения;
		МенеджерЗаписи.ID_уведомления    = Новый УникальныйИдентификатор;
		МенеджерЗаписи.Источник          = Ссылка;
		МенеджерЗаписи.Пользователь      = Пользователи.ТекущийПользователь();
		МенеджерЗаписи.СпособУведомления = Перечисления.торо_СпособыУведомленияПользователей.УведомлениеВВидеВсплывающейПодсказки;
		МенеджерЗаписи.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти   

#КонецЕсли






