///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2018, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "Интернет-поддержка пользователей".
// ОбщийМодуль.ИнтернетПоддержкаПользователейВызовСервера.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Определяет, доступно ли текущему пользователю выполнение подключения
// Интернет-поддержки: авторизация/регистрация пользователя, регистрация
// программного продукта в соответствии с текущим режимом работы
// и правами пользователя.
//
// Возвращаемое значение:
//	Булево - Истина - подключение Интернет-поддержки доступно,
//		Ложь - в противном случае.
//
Функция ДоступноПодключениеИнтернетПоддержки() Экспорт
	
	Возврат ИнтернетПоддержкаПользователей.ДоступноПодключениеИнтернетПоддержки();
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Записывает в журнал регистрации описание ошибки
// с именем события "Интернет-поддержка пользователей.Ошибка".
//
// Параметры:
//	СообщениеОбОшибке - Строка - строковое представление ошибки.
//	Данные - Произвольный - данные, к которым относится сообщение об ошибке.
//
Процедура ЗаписатьОшибкуВЖурналРегистрации(СообщениеОбОшибке, Данные = Неопределено) Экспорт
	
	ИнтернетПоддержкаПользователей.ЗаписатьОшибкуВЖурналРегистрации(СообщениеОбОшибке, Данные);
	
КонецПроцедуры

#Область Тарификация

Функция УслугаПодключена(Знач ИдентификаторУслуги, Знач ЗначениеРазделителя = Неопределено) Экспорт
	
	Результат = ИнтернетПоддержкаПользователей.УслугаПодключена(ИдентификаторУслуги, ЗначениеРазделителя);
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ЛогИОтладка

// Процедура записывает сообщение в журнал регистрации.
//
// Параметры:
//  ИмяСобытия                      - строка;
//  ИдентификаторШага               - строка;
//  УровеньРегистрации              - строковое представление константы УровеньЖурналаРегистрации;
//  ОбъектМетаданных                - строковое представление объекта метаданных;
//  Данные                          - данные;
//  Комментарий                     - строка - произвольный комментарий;
//  ВестиПодробныйЖурналРегистрации - Булево - признак записи незначащих событий (Информации и Примечания).
//
Процедура ЗаписатьСообщениеВЖурналРегистрации(
			ИмяСобытия,
			ИдентификаторШага,
			УровеньРегистрации = "Ошибка",
			ОбъектМетаданных = "",
			Данные = Неопределено,
			Комментарий = "",
			ВестиПодробныйЖурналРегистрации = Истина) Экспорт

	ИнтернетПоддержкаПользователей.ЗаписатьСообщениеВЖурналРегистрации(
		ИмяСобытия,
		ИдентификаторШага,
		УровеньРегистрации,
		ОбъектМетаданных,
		Данные,
		Комментарий,
		ВестиПодробныйЖурналРегистрации);

КонецПроцедуры

// Выгружает журнал регистрации по событиям во временное хранилище.
//
// Параметры:
//  ПараметрыОтбора - Структура - структура с ключами:
//   * ДатаНачала    - Дата - начало периода журнала;
//   * ДатаОкончания - Дата - конец периода журнала;
//   * Событие       - Массив - массив событий (см. ОблачныйАрхивКлиентСервер.ПолучитьСписокВсехСобытийЖурналаРегистрации).
//  ПараметрыФайлаВыгрузки - Структура, Неопределено - структура с ключами:
//   * Архивировать - Булево - Истина, если необходимо архивировать выгрузку.
//
// Возвращаемое значение:
//   Структура с ключами:
//    * АдресВременногоХранилищаФайла - Строка - Адрес выгруженных данных в хранилище;
//    * ТекстОшибки - Строка - Текст ошибки или пустая строка.
//
Функция ВыгрузитьВсеСобытияЖурналаРегистрации(ПараметрыОтбора, ПараметрыФайлаВыгрузки) Экспорт

	Результат = ИнтернетПоддержкаПользователей.ВыгрузитьВсеСобытияЖурналаРегистрации(ПараметрыОтбора, ПараметрыФайлаВыгрузки);

	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПередНачаломРаботыСистемы(Знач ПараметрыКлиента) Экспорт
	
	Результат = Новый Структура;
	УстановитьПривилегированныйРежим(Истина);
	ПараметрыСеанса.ПараметрыКлиентаНаСервереБИП = Новый ФиксированнаяСтруктура(ПараметрыКлиента);
	УстановитьПривилегированныйРежим(Ложь);
	
	КлиентЛицензирования.ПередНачаломРаботыСистемы();
	Результат.Вставить("ДоступнаРаботаСНастройкамиКлиентаЛицензирования",
		ИнтернетПоддержкаПользователей.ДоступнаРаботаСНастройкамиКлиентаЛицензирования());
	
	Возврат Результат;
	
КонецФункции

// Преобразует переданную строку в форматированную строку текста HTML.
//
Функция ФорматированнаяСтрокаИзHTML(Знач ТекстСообщения) Экспорт
	
	Возврат ИнтернетПоддержкаПользователейКлиентСервер.ФорматированнаяСтрокаИзHTML(
		ТекстСообщения);
	
КонецФункции

Функция КонфигурацияЗарегистрированаВСервисеИПП(ОшибкаОбращенияКВебСервису) Экспорт
	
	ПараметрыСозданияПрокси = ОбщегоНазначения.ПараметрыПодключенияWSПрокси();
	ПараметрыСозданияПрокси.АдресWSDL           = "https://webits.1c.ru/services/WebItsSimpleService?wsdl";
	ПараметрыСозданияПрокси.URIПространстваИмен = "https://ws.webits.onec.ru";
	ПараметрыСозданияПрокси.ИмяСервиса          = "WebItsServiceImplService";
	ПараметрыСозданияПрокси.ИмяТочкиПодключения = "WebItsServicePort";
	ПараметрыСозданияПрокси.Таймаут             = 30;
	
	Попытка
		ПроксиСервиса = ОбщегоНазначения.СоздатьWSПрокси(ПараметрыСозданияПрокси);
		Возврат ПроксиСервиса.isConfigurationSupported(
			ИнтернетПоддержкаПользователей.ИмяКонфигурации());
	Исключение
		ЗаписатьОшибкуВЖурналРегистрации(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("es='No consiguió comprobar el registro de la configuración en el servicio del Apoyo De Internet. "
"%1';ru='Не удалось проверить регистрацию конфигурации в сервисе Интернет-поддержки."
"%1';en='Failed to check the configuration registration in the Internet online service."
"%1'"),
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
		ОшибкаОбращенияКВебСервису = Истина;
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

#Область БСПНастройкиПрограммы

Процедура ВыйтиИзИПП() Экспорт
	
	// Проверка права записи данных
	Если Не ИнтернетПоддержкаПользователей.ПравоЗаписиПараметровИПП() Тогда
		ВызватьИсключение НСтр("es='Es insuficientemente derecho para el registro de datos аутентификации los Apoyos De Internet.';ru='Недостаточно прав для записи данных аутентификации Интернет-поддержки.';en='Not enough rights to write online support authentication data.'");
	КонецЕсли;
	
	// Запись данных
	УстановитьПривилегированныйРежим(Истина);
	ИнтернетПоддержкаПользователей.СохранитьДанныеАутентификации(Неопределено);
	
	// Удаление данные кэша подключения тестовых периодов
	// и существующих регламентных заданий.
	ПодключениеСервисовСопровождения.ОтключитьИнтернетПоддержкуПользователей();
	
КонецПроцедуры

#КонецОбласти

#Область КлиентЛицензирования

// Возвращает Истина, если доступна работа с настройками клиента лицензирования,
// Ложь - в противном случае.
//
Функция ДоступнаРаботаСНастройкамиКлиентаЛицензирования()
	
	Возврат ИнтернетПоддержкаПользователей.ДоступнаРаботаСНастройкамиКлиентаЛицензирования();
	
КонецФункции

#КонецОбласти

#Область ОтправкаСообщенийВСлужбуТехническойПоддержки

Функция ОтправитьДанныеСообщенияВТехПоддержку(
	Знач Тема,
	Знач Сообщение,
	Знач Получатель,
	Знач Вложения,
	Знач ДопПараметры) Экспорт
	
	// Извлечение данных из временного хранилища.
	Если Вложения <> Неопределено Тогда
		Для каждого ТекВложение Из Вложения Цикл
			Если ТекВложение.Свойство("Адрес") Тогда
				ДДФайла = ПолучитьИзВременногоХранилища(ТекВложение.Адрес);
				ТекВложение.Вставить(
					"Текст",
					ИнтернетПоддержкаПользователей.ТекстВДвоичныхДанных(ДДФайла));
				ТекВложение.Удалить("Адрес");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	НастройкиСоединенияССерверами = ИнтернетПоддержкаПользователейСлужебныйПовтИсп.НастройкиСоединенияССерверамиИПП();
	
	Результат = ИнтернетПоддержкаПользователей.ОтправитьДанныеСообщенияВТехПоддержку(
		Тема,
		Сообщение,
		Получатель,
		Вложения,
		НастройкиСоединенияССерверами,
		ДопПараметрыОтправкиСообщения(ДопПараметры));
	
	Результат.Вставить("Предупреждение", "");
	
	Если ПустаяСтрока(Результат.КодОшибки) Тогда
		ЗаполнитьПараметрыСтраницыОтправкиСообщенияВТехПоддержку(Результат);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция URLСтраницыОтправкиСообщенияВТехПоддержку(Домен, ТокенДанных)

	Возврат "https://"
		+ ИнтернетПоддержкаПользователей.ХостСервисовТехническойПоддержки(Домен)
		+ "/confirm?uuid=" + ТокенДанных;

КонецФункции

Процедура ЗаполнитьПараметрыСтраницыОтправкиСообщенияВТехПоддержку(ПараметрыСообщения)
	
	НастройкиСоединенияССерверами = ИнтернетПоддержкаПользователейСлужебныйПовтИсп.НастройкиСоединенияССерверамиИПП();
	
	ПараметрыСообщения.Вставить("URLСтраницы", "");
	ПараметрыСообщения.URLСтраницы = URLСтраницыОтправкиСообщенияВТехПоддержку(
		НастройкиСоединенияССерверами.ДоменРасположенияСерверовИПП,
		ПараметрыСообщения.ТокенДанных);
	
	Если Пользователи.ЭтоПолноправныйПользователь(, Истина, Ложь) Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		РезультатПолученияТикета =
			ИнтернетПоддержкаПользователей.ТикетАутентификацииНаПорталеПоддержки(ПараметрыСообщения.URLСтраницы);
		УстановитьПривилегированныйРежим(Ложь);
		
		Если ЗначениеЗаполнено(РезультатПолученияТикета.Тикет) Тогда
			ПараметрыСообщения.URLСтраницы = ИнтернетПоддержкаПользователейКлиентСервер.URLСтраницыСервисаLogin(
				"/ticket/auth?token=" + РезультатПолученияТикета.Тикет,
				НастройкиСоединенияССерверами);
		Иначе
			Если РезультатПолученияТикета.КодОшибки <> "НеверныйЛогинИлиПароль" Тогда
				ПараметрыСообщения.Предупреждение = НСтр("es='La falta de la entrada al Portal 1С:ИТС. "
"Más detalladamente cm. En la revista del registro.';ru='Ошибка входа на Портал 1С:ИТС."
"Подробнее см. в журнале регистрации.';en='Error logging into Portal 1C: ITS."
"See the logbook for details. '");
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ДопПараметрыОтправкиСообщения(Знач ДопПараметры)
	
	Результат = Новый Структура;
	Результат.Вставить("Логин"         , "");
	Результат.Вставить("ПарольЗаполнен", Ложь);
	
	УстановитьПривилегированныйРежим(Истина);
	ДанныеАутентификации = ИнтернетПоддержкаПользователей.ДанныеАутентификацииПользователяИнтернетПоддержки();
	УстановитьПривилегированныйРежим(Ложь);
	Если ДанныеАутентификации <> Неопределено Тогда
		Результат.Логин = ДанныеАутентификации.Логин;
		Результат.ПарольЗаполнен = ЗначениеЗаполнено(ДанныеАутентификации.Пароль);
	КонецЕсли;
	
	Результат.Вставить("ШаблонТекстаСообщения", ШаблонТекстаСообщения(ДопПараметры));
	
	Вложения = Новый Массив;
	Вложения.Добавить(
		Новый Структура(
			"Представление, Текст",
			НСтр("es='Técnico информация.txt';ru='Техническая информация.txt';en='Technical information.txt'"),
			ТекстВложенияТехническаяИнформация(
				ДопПараметры.ВидПриложения,
				Результат)));
	
	Результат.Вставить("Вложения", Вложения);
	
	Возврат Результат;
	
КонецФункции

Функция ШаблонТекстаСообщения(ДопПараметры)
	
	Возврат НСтр("es='¡Buenos días! "
""
"%msgtxt "
""
"el número De registro del producto informático: <Indiquen рег. El número>; "
"la Organización: <Indiquen el nombre de la organización>. "
"Atentamente"
".';ru='Здравствуйте!"
""
"%msgtxt"
""
"Регистрационный номер программного продукта: <Укажите рег. номер>;"
"Организация: <Укажите название организации>."
"С уважением,"
".';en='Hello!"
""
"% msgtxt"
""
"Software Product Registration Number: <Укажите рег. номер>;"
"Organization: <Укажите название организации>."
"Respectfully,"
".'");
	
КонецФункции

// Возвращает текст описания технических параметров программы.
Функция ТекстВложенияТехническаяИнформация(ВидПриложения, ДопПараметры)
	
	// Общие технические параметры и информация о сеансе
	СистИнфо = Новый СистемнаяИнформация;
	ЭтоФайловаяИБ = ОбщегоНазначения.ИнформационнаяБазаФайловая();
	
	ИмяПрограммы = Строка(ИнтернетПоддержкаПользователей.СлужебнаяИмяПрограммы());
	Если ИмяПрограммы = "Unknown" Тогда
		ИмяПрограммы = НСтр("es='<no es rellenado>';ru='<Не заполнено>';en='<Не заполнено>'");
	КонецЕсли;
	
	// Общая информация:
	Результат = НСтр("es='La información técnica sobre el programa: "
"el Nombre del programa: %1 "
"Nombre del programa: %2; "
"la Versión del programa: %3; "
"el Suministrador: %4; "
"la Versión de la Plataforma 1С:Предприятие: %5; "
"la Versión de la Biblioteca del Apoyo De Internet: %6; "
"la Versión de la Biblioteca de los subsistemas estandartizados: %7; "
"el Tipo de la aplicación: %8; "
"el Régimen: %9;';ru='Техническая информация о программе:"
"Название программы: %1"
"Имя программы: %2;"
"Версия программы: %3;"
"Поставщик: %4;"
"Версия Платформы 1С:Предприятие: %5;"
"Версия Библиотеки Интернет-поддержки: %6;"
"Версия Библиотеки стандартных подсистем: %7;"
"Вид приложения: %8;"
"Режим: %9;';en='Technical information about the program:"
"Program name:%1"
"Program name:%2;"
"Program version:%3;"
"Supplier:%4;"
"Platform Version 1C: Enterprise:%5;"
"Online Support Library Version:%6;"
"Library version of standard subsystems:%7;"
"Type of application:%8;"
"Mode:%9;'");
	
	Результат = 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			Результат,
			Метаданные.Синоним,
			ИмяПрограммы
				+ " (" + Строка(ИнтернетПоддержкаПользователей.ИмяКонфигурации()) + ")",
			Строка(ИнтернетПоддержкаПользователей.ВерсияКонфигурации()),
			Метаданные.Поставщик,
			Строка(СистИнфо.ВерсияПриложения),
			ИнтернетПоддержкаПользователейКлиентСервер.ВерсияБиблиотеки(),
			СтандартныеПодсистемыСервер.ВерсияБиблиотеки(),
			ВидПриложения,
			?(ЭтоФайловаяИБ, НСтр("es='De fichero';ru='Файловый';en='File'"), НСтр("es='Del servidor';ru='Серверный';en='Server'")));
	
	// Права:
	Результат = Результат
		+ Символы.ПС
		+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("es='Los plenos derechos: %1; "
"los Derechos del administrador: %2; "
"los Derechos para la conexión del Apoyo De Internet: %3;';ru='Полные права: %1;"
"Права администратора: %2;"
"Права для подключения Интернет-поддержки: %3;';en='Full rights:%1;"
"Administrator rights:%2;"
"Rights for connecting to Internet support:%3; '"),
			?(Пользователи.ЭтоПолноправныйПользователь(, Ложь, Ложь), НСтр("es='Es';ru='есть';en='there is'"), НСтр("es='No';ru='нет';en='no'")),
			?(Пользователи.ЭтоПолноправныйПользователь(, Истина, Ложь), НСтр("es='Es';ru='есть';en='there is'"), НСтр("es='No';ru='нет';en='no'")),
			?(ИнтернетПоддержкаПользователей.ПравоЗаписиПараметровИПП(), НСтр("es='Es';ru='есть';en='there is'"), НСтр("es='No';ru='нет';en='no'")));
	
	// Личные данные:
	Результат = Результат
		+ Символы.ПС
		+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("es='El login para la conexión del Apoyo De Internet: %1; "
"la Consigna para la conexión del Apoyo De Internet: %2; "
"el número De registro del producto informático: %3;';ru='Логин для подключения Интернет-поддержки: %1;"
"Пароль для подключения Интернет-поддержки: %2;"
"Регистрационный номер программного продукта: %3;';en='Login to connect to Internet support: %1;"
"Password for connecting to online support: %2;"
"Software product Registration number:%3;'"),
			ДопПараметры.Логин,
			?(ДопПараметры.ПарольЗаполнен, НСтр("es='Es rellenado';ru='заполнен';en='is filled'"), НСтр("es='No es rellenado';ru='не заполнен';en='not filled'")),
			ИнтернетПоддержкаПользователей.РегистрационныйНомерПрограммногоПродукта());
	
	// Настройки соединения:
	НастройкиСоединения = ИнтернетПоддержкаПользователей.НастройкиСоединенияССерверами();
	Результат = Результат
		+ Символы.ПС
		+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("es='Los ajustes de la unión con los servidores del Apoyo De Internet:"
"	La zona De alto horno: %1';ru='Настройки соединения с серверами Интернет-поддержки:"
"	Доменная зона: %1';en='Settings for connecting to Internet support servers:"
"Domain zone:%1 '"),
			?(НастройкиСоединения.ДоменРасположенияСерверовИПП = 1, "1c.eu", "1c.ru"));
	
	// Настройки прокси:
	НастройкиПрокси = ПолучениеФайловИзИнтернета.НастройкиПроксиНаСервере();
	Если НастройкиПрокси = Неопределено Тогда
		ЗначениеНастройкиПрокси = НСтр("es='No se usa';ru='не используется';en='not used'");
	Иначе
		Если НастройкиПрокси.Получить("ИспользоватьПрокси") Тогда
			ЗначениеНастройкиПрокси = ?(НастройкиПрокси.Получить("ИспользоватьСистемныеНастройки"),
				НСтр("es='Automático';ru='автоматические';en='automatic'"),
				НСтр("es='De mano';ru='ручные';en='manual'"));
		Иначе
			ЗначениеНастройкиПрокси = НСтр("es='No se usa';ru='не используется';en='not used'");
		КонецЕсли;
	КонецЕсли;
	
	Результат = Результат
		+ Символы.ПС
		+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("es='Los ajustes de la unión con los servidores del Apoyo De Internet:"
"	La zona De alto horno: %1';ru='Настройки соединения с серверами Интернет-поддержки:"
"	Доменная зона: %1';en='Settings for connecting to Internet support servers:"
"Domain zone:%1 '"),
			ЗначениеНастройкиПрокси);
	
	Результат = Результат
		+ Символы.ПС
		+ НСтр("es='Las ampliaciones establecidas:';ru='Установленные расширения:';en='Installed extensions:'")
		+ Символы.ПС
		+ ТекстОписаниеУстановленныхРасширений();
	
	// Настройки клиента лицензирования:
	Если ДоступнаРаботаСНастройкамиКлиентаЛицензирования() Тогда
		ИДКонфигурации = ИнтернетПоддержкаПользователейСлужебныйПовтИсп.ИДКонфигурации();
		Если Не ПустаяСтрока(ИДКонфигурации) Тогда
			Результат = Результат + Символы.ПС
				+ НСтр("es='El nombre del cliente del licenciamiento:';ru='Имя клиента лицензирования:';en='Licensing client name:'") + " "
				+ КлиентЛицензирования.ИмяКлиентаЛицензирования()
				+ Символы.ПС + НСтр("es='El identificador de la configuración:';ru='Идентификатор конфигурации:';en='Configuration identifier:'")
				+ Символы.ПС + ИДКонфигурации;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТекстОписаниеУстановленныхРасширений()
	
	ОписаниеРасширенийМассивСтр = Новый Массив;
	
	// Обращение в тех поддержку может формировать
	// не только администратор ИБ.
	УстановитьПривилегированныйРежим(Истина);
	УстановленныеРасширения = РасширенияКонфигурации.Получить();
	
	Для Каждого Расширение Из УстановленныеРасширения Цикл
		ОписаниеРасширенийМассивСтр.Добавить(
			Символы.Таб
			+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("es='%1 (%2); el Acta.: %3; Распр. ИБ: %4; БР: %5';ru='%1 (%2); Акт.: %3; Распр. ИБ: %4; БР: %5';en='%1(%2); Act .:% 3; Distrib. IB:% 4; BR:% 5'"),
				Расширение.Имя,
				Расширение.Назначение,
				Расширение.Активно,
				Расширение.ИспользуетсяВРаспределеннойИнформационнойБазе,
				Расширение.БезопасныйРежим));
	КонецЦикла;
	
	Если ОписаниеРасширенийМассивСтр.Количество() = 0 Тогда
		ОписаниеРасширенийМассивСтр.Добавить(НСтр("es='<No existe>';ru='<Нет>';en='<Нет>'"));
	КонецЕсли;
	
	Возврат СтрСоединить(ОписаниеРасширенийМассивСтр, Символы.ПС);
	
КонецФункции

#КонецОбласти

#Область ПрочиеСлужебныеПроцедурыИФункции

Функция СлужебнаяURLДляПереходаНаСтраницуИнтегрированногоСайта(Знач URLСтраницыСайта) Экспорт
	Возврат ИнтернетПоддержкаПользователей.СлужебнаяURLДляПереходаНаСтраницуИнтегрированногоСайта(URLСтраницыСайта);
КонецФункции

#КонецОбласти

#КонецОбласти
