#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса)
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыСервер.УстановкаПараметровСеанса(ИменаПараметровСеанса);
	// Конец СтандартныеПодсистемы
	
	//<слкСистемаЛицензированияОРСР
	слкМенеджерЗащитыСервер.УстановкаПараметровСеанса(ИменаПараметровСеанса);
	//>слкСистемаЛицензированияОРСР	
	
	// >> [Деснол] [Ушаков А.Д.] [19.09.2019]
	// [Сильно упрощённая проверка] 
	ПараметрыСеанса.торо_ТекущийЯзыкЭтоЯзыкПоУмолчанию = ТекущийЯзык().КодЯзыка = "en";
	// << [Деснол] [Ушаков А.Д.] [19.09.2019]  
КонецПроцедуры

#КонецОбласти

#КонецЕсли