#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивВсехРеквизитов = Новый Массив;
	МассивРеквизитовОперации = Новый Массив;
	
	Документы.ПеремещениеТоваров.ПолучитьМассивыРеквизитов( 
		МассивВсехРеквизитов, 
		МассивРеквизитовОперации);
	
	МассивНепроверяемыхРеквизитов = Новый Массив;

	ОбщегоНазначенияУТ.ПроверитьЗаполнениеКоличества(ЭтотОбъект, ПроверяемыеРеквизиты, Отказ);

	Если ЗначениеЗаполнено(СкладОтправитель) И СкладОтправитель = СкладПолучатель Тогда

		ТекстСообщения = НСтр("es='Un almacén no puede ser por el remitente, así como el destinatario. Cambien un de los almacenes.';ru='Один склад не может быть как отправителем, так и получателем. Измените один из складов.';en='One warehouse cannot be both a sender and a receiver. Change one of the warehouses.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "СкладОтправитель",, Отказ);

	КонецЕсли;

	// Проверка указания характеристик.
	ФОИспользоватьХарактеристикиНоменклатуры = ПолучитьФункциональнуюОпцию("торо_ИспользоватьХарактеристикиНоменклатуры");
	МассивНепроверяемыхРеквизитов.Добавить("Товары.Характеристика");
	Если ФОИспользоватьХарактеристикиНоменклатуры = Истина тогда
		НоменклатураСервер.ПроверитьЗаполнениеХарактеристик(ЭтотОбъект, МассивНепроверяемыхРеквизитов, Отказ);
	КонецЕсли;
	ФОИспользоватьСерииНоменклатуры = ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатуры");
	МассивНепроверяемыхРеквизитов.Добавить("Товары.Серия");
	Если ФОИспользоватьСерииНоменклатуры = Истина тогда
		НоменклатураСервер.ПроверитьЗаполнениеСерий(ЭтотОбъект,
												Отказ,
												МассивНепроверяемыхРеквизитов);
	КонецЕсли;	
	
	ОбщегоНазначенияУТКлиентСервер.ЗаполнитьМассивНепроверяемыхРеквизитов(
		МассивВсехРеквизитов,
		МассивРеквизитовОперации,
		МассивНепроверяемыхРеквизитов);
				
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	ФОИспользоватьСерии = Константы.ИспользоватьСерииНоменклатуры.Получить();
	ФОИспользоватьХарактеристики = Константы.торо_ИспользоватьХарактеристикиНоменклатуры.Получить();
	
	Движения.ТоварыНаСкладах.Записывать = Истина;
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Если ТекСтрокаТовары.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар Тогда
			
			Движение = Движения.ТоварыНаСкладах.Добавить();
            Движение.ВидДвижения    = ВидДвиженияНакопления.Приход;
            Движение.Период         = Дата;
            Движение.Номенклатура   = ТекСтрокаТовары.Номенклатура;
            Движение.Склад          = СкладПолучатель;
            Движение.ВНаличии       = ТекСтрокаТовары.Количество;
			
			Если ФОИспользоватьХарактеристики Тогда
	            Движение.Характеристика = ТекСтрокаТовары.Характеристика;
			КонецЕсли;
			
			Если ФОИспользоватьСерии Тогда
				Движение.Серия      = ТекСтрокаТовары.Серия;
			КонецЕсли;	
			
		КонецЕсли; 
		
		Если ТекСтрокаТовары.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар Тогда
			
			Движение = Движения.ТоварыНаСкладах.Добавить();
            Движение.ВидДвижения    = ВидДвиженияНакопления.Расход;
            Движение.Период         = Дата;
            Движение.Номенклатура   = ТекСтрокаТовары.Номенклатура;
            Движение.Склад          = СкладОтправитель;
            Движение.ВНаличии       = ТекСтрокаТовары.Количество;
			
			Если ФОИспользоватьХарактеристики Тогда
	            Движение.Характеристика = ТекСтрокаТовары.Характеристика;
			КонецЕсли;
			
			Если ФОИспользоватьСерии Тогда
				Движение.Серия      = ТекСтрокаТовары.Серия;
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЦикла;
	
	Движения.Записать();
	
			
		ТабТовары = Товары.Выгрузить();
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТабТовары.НомерСтроки,
		               |	ТабТовары.Номенклатура,
		               |	ТабТовары.Серия,
		               |	ТабТовары.Характеристика
		               |ПОМЕСТИТЬ ТабТовары
		               |ИЗ
		               |	&ТабТовары КАК ТабТовары
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТабТовары.Номенклатура,
		               |	ТабТовары.Характеристика,
		               |	ТабТовары.Серия,
		               |	ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0) КАК ВНаличииОстаток,
		               |	ВЫРАЗИТЬ(ТабТовары.Номенклатура КАК Справочник.Номенклатура).ЕдиницаИзмерения КАК ЕдиницаИзмерения
		               |ИЗ
		               |	ТабТовары КАК ТабТовары
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, Склад = &СкладОтправитель) КАК СвободныеОстаткиОстатки
		               |		ПО (СвободныеОстаткиОстатки.Номенклатура = ТабТовары.Номенклатура)
		               |			И (&Характеристика)
		               |			И (&Серия)";
		
		Запрос.УстановитьПараметр("ТабТовары",        ТабТовары);
		Запрос.УстановитьПараметр("Дата",             Дата + 1);
		Запрос.УстановитьПараметр("СкладОтправитель", СкладОтправитель);
		
		Если ФОИспользоватьСерии Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Серия", "СвободныеОстаткиОстатки.Серия = ТабТовары.Серия");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТабТовары.Серия,", "");	  
			Запрос.УстановитьПараметр("Серия", Истина);
		КонецЕсли;    
		
		Если ФОИспользоватьХарактеристики Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Характеристика", "СвободныеОстаткиОстатки.Характеристика = ТабТовары.Характеристика");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТабТовары.Характеристика,", "");	  
			Запрос.УстановитьПараметр("Характеристика", Истина);
		КонецЕсли;    
		
		Выборка = Запрос.Выполнить().Выбрать();   		
		
		Пока Выборка.Следующий() Цикл
			Если Выборка.ВНаличииОстаток < 0 Тогда
				
				ШаблонСообщения = "Номенклатура %Номенклатура% / %Характеристика% / %Серия%.
				|Превышен свободный остаток товара на складе %СкладОтправитель% на %Количество% %ЕдИзм%";
				
				
				ШаблонСообщения = СтрЗаменить(ШаблонСообщения,"%Номенклатура%",     Выборка.Номенклатура);				
				ШаблонСообщения = СтрЗаменить(ШаблонСообщения,"%СкладОтправитель%", СкладОтправитель);
				ШаблонСообщения = СтрЗаменить(ШаблонСообщения,"%Количество%",       - Число(Выборка.ВналичииОстаток));
				ШаблонСообщения = СтрЗаменить(ШаблонСообщения,"%ЕдИзм%",            Выборка.ЕдиницаИзмерения);
				
				Если ФОИспользоватьСерии Тогда
					ШаблонСообщения = СтрЗаменить(ШаблонСообщения,"%Серия%", Выборка.Серия);
				Иначе 
					ШаблонСообщения = СтрЗаменить(ШаблонСообщения, " / %Серия%", "");
				КонецЕсли;
				
				Если ФОИспользоватьХарактеристики Тогда
					ШаблонСообщения = СтрЗаменить(ШаблонСообщения,"%Характеристика%", Выборка.Характеристика);
				Иначе 
					ШаблонСообщения = СтрЗаменить(ШаблонСообщения, " / %Характеристика%", "");
				КонецЕсли;
				
				ОбщегоНазначения.СообщитьПользователю(ШаблонСообщения,ЭтотОбъект,"СкладОтправитель",,Отказ);
				
			КонецЕсли;
		КонецЦикла;	
        Если Не Константы.торо_ИспользоватьКонтрольОтрицательныхОстатков.Получить() Тогда
			Отказ = Ложь;
		КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР", "ОсновнаяОрганизация");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СкладОтправитель) Тогда
		СкладОтправитель = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР", "ОсновнойСклад");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР", "ОсновнойОтветственный");
		Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
			Ответственный = Пользователи.ТекущийПользователь();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#КонецЕсли