///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс
// Заполняет виды доступа, используемые в ограничениях прав доступа.
// Примечание: виды доступа Пользователи и ВнешниеПользователи предопределены,
// но их можно удалить из списка ВидыДоступа, если они не требуются для ограничения прав доступа.
//
// Параметры:
//  ВидыДоступа - ТаблицаЗначений - с колонками:
//   * Имя                    - Строка - имя, используемое в описании поставляемых
//                                       профилей групп доступа и текстах ОДД.
//   * Представление          - Строка - представляет вид доступа в профилях и группах доступа.
//   * ТипЗначений            - Тип    - тип ссылки значений доступа,
//                                       например Тип("СправочникСсылка.Номенклатура").
//   * ТипГруппЗначений       - Тип    - тип ссылки групп значений доступа,
//                                       например Тип("СправочникСсылка.ГруппыДоступаНоменклатуры").
//   * НесколькоГруппЗначений - Булево - Истина указывает, что для значения доступа (Номенклатуры) можно
//                                       выбрать несколько групп значений (Групп доступа номенклатуры).
//
// Пример:
//  1. Для настройки прав доступа в разрезе организаций:
//  ВидДоступа = ВидыДоступа.Добавить();
//  ВидДоступа.Имя = "Организации";
//  ВидДоступа.Представление = НСтр("es='Las organizaciones';ru='Организации';en='Organizations'");
//  ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.Организации");
//
//  2. Для настройки прав доступа в разрезе групп партнеров:
//  ВидДоступа = ВидыДоступа.Добавить();
//  ВидДоступа.Имя = "ГруппыПартнеров";
//  ВидДоступа.Представление    = НСтр("es='Los grupos de los socios';ru='Группы партнеров';en='Partner groups'");
//  ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.Партнеры");
//  ВидДоступа.ТипГруппЗначений = Тип("СправочникСсылка.ГруппыДоступаПартнеров");
//
Процедура ПриЗаполненииВидовДоступа(ВидыДоступа) Экспорт
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "Подразделения";
	ВидДоступа.Представление = "Подразделения";
	ВидДоступа.ТипЗначений = Тип("СправочникСсылка.СтруктураПредприятия");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ОбъектыРемонта";
	ВидДоступа.Представление = "Объекты ремонта";
	ВидДоступа.ТипЗначений = Тип("СправочникСсылка.торо_ОбъектыРемонта");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "Организации";
	ВидДоступа.Представление = НСтр("es='Las organizaciones';ru='Организации';en='Organizations'");
	ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.Организации");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "КонтрагентыОР";
	ВидДоступа.Представление = НСтр("es='Los contratantes-propietarios de los objetos de la reparación';ru='Контрагенты-владельцы объектов ремонта';en='Counterparties-owners of repair facilities'");
	ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.Контрагенты");
	
КонецПроцедуры

// Позволяет указать списки, у которых объекты метаданных содержат описание логики ограничения
// доступа в модулях менеджеров или переопределяемом модуле.
//
// В модулях менеджеров указанных списков должна быть размещена процедура обработчика,
// в которую передаются следующие параметры.
// 
//  Ограничение - Структура - со свойствами:
//    * Текст                             - Строка - ограничение доступа для пользователей.
//                                            Если пустая строка, значит, доступ разрешен.
//    * ТекстДляВнешнихПользователей      - Строка - ограничение доступа для внешних пользователей.
//                                            Если пустая строка, значит, доступ запрещен.
//    * ПоВладельцуБезЗаписиКлючейДоступа - Неопределено - определить автоматически.
//                                        - Булево - если Ложь, то всегда записывать ключи доступа,
//                                            если Истина, тогда не записывать ключи доступа,
//                                            а использовать ключи доступа владельца (требуется,
//                                            чтобы ограничение было строго по объекту-владельцу).
///   * ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей - Неопределено, Булево - см.
//                                            описание предыдущего параметра.
//
// Далее пример процедуры для модуля менеджера.
//
//// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
//Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
//	
//	Ограничение.Текст =
//	"РазрешитьЧтениеИзменение
//	|ГДЕ
//	|	ЗначениеРазрешено(Организация)
//	|	И ЗначениеРазрешено(Контрагент)";
//	
//КонецПроцедуры
//
// Параметры:
//  Списки - Соответствие - списки с ограничением доступа:
//             * Ключ     - ОбъектМетаданных - список с ограничением доступа.
//             * Значение - Булево - Истина - текст ограничения в модуле менеджера.
//                                 - Ложь   - текст ограничения в этом переопределяемом
//                модуле в процедуре ПриЗаполненииОграниченияДоступа.
//
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	
	
КонецПроцедуры

// Заполняет описания поставляемых профилей групп доступа и
// переопределяет параметры обновления профилей и групп доступа.
//
// Для автоматической подготовки содержимого процедуры следует воспользоваться инструментами
// разработчика для подсистемы Управление доступом.
//
// Параметры:
//  ОписанияПрофилей    - Массив - добавить описания профилей групп доступа (Структура).
//                        Состав свойств структуры см. УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа.
//
//  ПараметрыОбновления - Структура - содержит свойства:
//   * ОбновлятьИзмененныеПрофили - Булево - начальное значение Истина.
//   * ЗапретитьИзменениеПрофилей - Булево - начальное значение Истина.
//       Если установить Ложь, тогда поставляемые профили можно не только просматривать, но и редактировать.
//   * ОбновлятьГруппыДоступа     - Булево - начальное значение Истина.
//   * ОбновлятьГруппыДоступаСУстаревшимиНастройками - Булево - начальное значение Ложь.
//       Если установить Истина, то настройки значений, выполненные администратором для
//       вида доступа, который был удален из профиля, будут также удалены из групп доступа.
//
// Пример:
//  ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
//  ОписаниеПрофиля.Имя           = "Менеджер";
//  ОписаниеПрофиля.Идентификатор = "75fa0ecb-98aa-11df-b54f-e0cb4ed5f655";
//  ОписаниеПрофиля.Наименование  = НСтр("es='El manager por las ventas';ru='Менеджер по продажам';en='Sales manager'", Метаданные.ОсновнойЯзык.КодЯзыка);
//  ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
//  ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
//  ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
//  ОписаниеПрофиля.Роли.Добавить("Подсистема_Продажи");
//  ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовПокупателей");
//  ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаКнигаПокупок");
//  ОписанияПрофилей.Добавить(ОписаниеПрофиля);
//
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт

	
	ДобавитьПрофильТОиР(ОписанияПрофилей);
	
	ДобавитьПрофильОператора(ОписанияПрофилей);
	ДобавитьПрофильДиспетчера(ОписанияПрофилей);
	ДобавитьПрофильМеханика(ОписанияПрофилей);
	ДобавитьПрофильИнженера(ОписанияПрофилей);		
	ДобавитьПрофильУтверждениеНормативов(ОписанияПрофилей);
	ДобавитьПрофильАнализЭффективности(ОписанияПрофилей);
	ДобавитьПрофильСпециалистИБ(ОписанияПрофилей);
	ДобавитьПрофильУправлениеРисками(ОписанияПрофилей);
КонецПроцедуры

// Служебная фунция. Сделана экспортной для удобства внедренцев.
// Параметры:
//  ОписаниеПрофиля    - Структура - добавить описания профилей групп доступа (Структура).
//                        Состав свойств структуры см. УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа.
//
Процедура ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля) Экспорт
	
	// Запуск 1С:Предприятия
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	
	// Базовые права
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДвиженияДокумента");
	
	// Задачи и задания
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи","ВначалеВсеРазрешены");
	
	// Заметки и напоминания
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	
	// Документооборот
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБИД");
	
	// Электронная подпись
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхПодписейИШифрование");
	
	// Файлы и папки файлов
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПапокИФайлов");
	
	// Дополнительные сведения
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДополнительныхСведений");
	
	// Редактирование реквизитов объектов
	ОписаниеПрофиля.Роли.Добавить("РедактированиеРеквизитовОбъектов");
	
	// Использование дополнительных отчетов и обработок
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	
	// Варианты отчетов
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхВариантовОтчетов");
	
	// Рассылки отчетов
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРассылокОтчетов");	
		
	// Базовая НСИ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафиковРаботы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
	
	// Печать
	ОписаниеПрофиля.Роли.Добавить("РедактированиеПечатныхФорм");
	
	// ТОиР
	ОписаниеПрофиля.Роли.Добавить("торо_БазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеЗащитыУправленияРемонтами82");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПанелиАдминистрированияТОиР");	
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПользовательскихНастроек");
	
	ОписаниеПрофиля.Роли.Добавить("торо_РазделИнтеграцияС1СДокументооборотом");	
	
	// Раздел подсистем
	ОписаниеПрофиля.Роли.Добавить("торо_РазделИнтеграцияС1СДокументооборотом");
	ОписаниеПрофиля.Роли.Добавить("торо_РазделМТО");
	ОписаниеПрофиля.Роли.Добавить("торо_РазделНастройкаИАдминистрирование");
	ОписаниеПрофиля.Роли.Добавить("торо_РазделНормативноСправочнаяИнформация");
	ОписаниеПрофиля.Роли.Добавить("торо_РазделНормативноСправочнаяИнформацияНоменклатура");
	ОписаниеПрофиля.Роли.Добавить("торо_РазделНормативноСправочнаяИнформацияПредприятие");
	ОписаниеПрофиля.Роли.Добавить("торо_РазделНормативноСправочнаяИнформацияРаботаСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("торо_РазделПланированиеТОиР");
	ОписаниеПрофиля.Роли.Добавить("торо_РазделУправлениеНарядамиИРаботами");
	ОписаниеПрофиля.Роли.Добавить("торо_РазделУправлениеПерсоналом");
	ОписаниеПрофиля.Роли.Добавить("торо_РазделУчетОборудованияИНормативов");
	ОписаниеПрофиля.Роли.Добавить("торо_РазделУчетПоказателейЭксплуатации");

	
КонецПроцедуры

Процедура ДобавитьПрофильТОиР(ОписанияПрофилей)
	
	// Описание для заполнения профиля "Главный диспетчер производства".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя = "БазовыеПраваТОиР";
	ОписаниеПрофиля.Наименование  = НСтр("es='Los derechos ТОиР básicos';ru='Базовые права ТОиР';en='Basic maintenance and repair rights'");
	ОписаниеПрофиля.Идентификатор = "ab8ca17c-8df7-4c6f-a6ba-6dfb85a2d469";
	ОписаниеПрофиля.Описание =
	НСтр("es='Es destinado para: "
"- la presentación de los datos del sistema informativo.';ru='Предназначен для:"
"- просмотра данных информационной системы.';en='Created for:"
"- viewing information system information. '");

	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);	
//	
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаВидаЭксплуатацииДляВводаНаОснованииВыявленногоДефекта");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетБазаДанныхПоПодрядчикамСИсторией");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетСписокОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ПросмотрФормыСпискаДокументовПоРемонту");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеАктовОВыполненииРегламентныхМероприятий");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеАктовОВыполненииЭтаповРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеАктовПриемкиОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВводаНачальныхДанных");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовОценок");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовПусковОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВыявленныхДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеГрафиковРегламентныхМероприятийТОиР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОстановочныхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗначенийИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмененийПоложенияВСтруктуреИерархии");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмененийСоставаРемонтнойБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКвалификацийРемонтногоПерсонала");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКомиссионныхРассмотрений");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКритериевВыбораПодрядчиков");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКритериевОценки");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКритичностейДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеМерБезопасности");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеНаправленийОбъектовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеНарядовНаВыполнениеРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеНарядовНаРегламентноеМероприятие");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеНастройкиРегистрацииНаработкиЗависимыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОценокРаботыПодрядчика");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПлановГрафиковРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПриоритетовОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПрисвоенийКвалификацийСотрудникам");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинЗакрытияРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинИзмененияНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинПростояОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеРемонтныхБригад");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеРесурсовРемонтнойБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСезонов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСобытийУведомленийВДокументах");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСостоянийОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСпискаОбъектовРегламентногоМероприятия");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСпособовПланированияРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСпособовСогласованияДокументов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСтатусовСогласованияДокументовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСтруктурОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТиповКоэффициентовПереводаСтоимостейРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТиповыхДефектовОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТиповыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУсловийВыявленияДефекта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокЛимитовНаПлановыеРемонтныеРаботы");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокПроизвольныхЗначенийНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокСтоимостейКвалификаций");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУчетовКонтролируемыхПоказателей");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУчетовНаработкиОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЦепочекРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеШаблоновСообщенийИУведомлений");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКвалификацийРемонтногоПерсоналаПоСотрудникам");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТекущихТарифныхСтавокСотрудников");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОпасныхПроизводств");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеРемонтныхЦикловОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПричиныОтменыПлановыхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетСводнаяДиаграммаГрафиковППР");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЕдиницИзмерения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПараметровВыработкиОС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтруктурыПредприятия");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхРеквизитовИСведений");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеОбменаСМобильнымПриложением");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеХарактеристикНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовСкользящихПланов");
	
	//НазначениеНаРемонтСУчетомРисков
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОбъектовВоздействия");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКатегорийВероятности");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКатегорийТяжестиПоследствий");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеРегистраСведенийПоследствия");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКатегорийРиска");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСтратегийОбслуживания");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеМатрицыОценкиРисков");
	
    ОписаниеПрофиля.Роли.Добавить("ПросмотрСвязанныеДокументы");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");		                                     
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

//// -----------1---------------------------------1
////
Процедура ДобавитьПрофильОператора(ОписанияПрофилей)
	
	// Описание для заполнения профиля "Главный диспетчер производства".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя = "Оператор";
	ОписаниеПрофиля.Наименование  = НСтр("es='El operador';ru='Оператор';en='Operator'");
	ОписаниеПрофиля.Идентификатор = "6c707460-f5fe-4cb2-bec1-ac7481e2258b";
	ОписаниеПрофиля.Описание =
	НСтр("es='Es destinado para: "
"- el recuento de la elaboración de los objetos de la reparación, "
"- el recuento de los índices controlados, "
"- el recuento de los estados de los objetos de la reparación.';ru='Предназначен для:"
"- учета наработки объектов ремонта,"
"- учета контролируемых показателей,"
"- учета состояний объектов ремонта.';en='Created for:"
"- accounting of operating hours of repair objects,"
"- accounting for controlled indicators,"
"- accounting of the state of repair facilities. '");

	
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
//	
//	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинИзмененияНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеНастройкиРегистрацииНаработкиЗависимыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияСостоянияОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеУстановокПроизвольныхЗначенийНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияУчетовКонтролируемыхПоказателей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияУчетовНаработкиОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораОбъектовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользоватьРабочееМестоТехническогоСпециалиста");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользоватьРабочееМестоУчетаПоказателейЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетНаработкаОРПоДатам");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПлановыеОстановыОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПоКонтролируемымПоказателям");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовПусковОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовПусковОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗначенийИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеЗначенийИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмененийПоложенияВСтруктуреИерархии");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеНастройкиРегистрацииНаработкиЗависимыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинИзмененияНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинПростояОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинПростояОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСостоянийОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокПроизвольныхЗначенийНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУчетовКонтролируемыхПоказателей");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУчетовНаработкиОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетИсторияОстановаИЗапускаОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетНаработкаОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетОтказыОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПростойОборудования"); 
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПараметровВыработкиОС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияПараметровВыработкиОС");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
		
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

//// -----------2---------------------------------2
////
Процедура ДобавитьПрофильДиспетчера(ОписанияПрофилей)
//	
	// Описание для заполнения профиля "Главный диспетчер производства".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();

	ОписаниеПрофиля.Имя = "Диспетчер";
	ОписаниеПрофиля.Наименование  = НСтр("es='El dispatcher';ru='Диспетчер';en='Dispatcher'");
	ОписаниеПрофиля.Идентификатор = "43f2f015-280b-4546-8731-3b399b49049a";
	ОписаниеПрофиля.Описание =
	НСтр("es='Es destinado para: "
"- el registro de los defectos de los objetos de la reparación, "
"- el recuento de los estados de los objetos de la reparación, "
"- la formalización de las demandas por la reparación.';ru='Предназначен для:"
"- регистрации дефектов объектов ремонта,"
"- учета состояний объектов ремонта,"
"- оформления заявок на ремонт.';en='Created for:"
"- registration of defects of repair objects,"
"- accounting of the state of repair objects,"
"- filing repair requests.'");	
	
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("торо_ВыгрузкаИЗагрузкаИзMSProject");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеВыявленныхДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинЗакрытияРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияТиповыхДефектовОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияЗакрытийЗаявокИРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияСостоянияОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеВыявленныхДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеВыбораРемонтаИзПланГрафика");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеЗакрытияЗаявокИРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораОбъектовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораРемонтныхРаботОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеТехническойДокументации");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользоватьРабочееМестоТехническогоСпециалиста");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользоватьРабочееМестоУчетаПоказателейЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетВнешниеОснования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетВыявленныеДефекты");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПлановыеОстановыОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияВыявленныхДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеВыявленныхДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовПусковОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВыявленныхДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗакрытийЗаявокИРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗначенийКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКвалификацийРемонтногоПерсонала");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКритичностейДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеМерБезопасности");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПлановГрафиковРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПриоритетовОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинЗакрытияРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинПростояОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСостоянийОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСпособовПланированияРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСпособовСогласованияДокументов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСтатусовСогласованияДокументовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТиповыхДефектовОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУсловийВыявленияДефекта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокСтоимостейКвалификаций");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКвалификацийРемонтногоПерсоналаПоСотрудникам");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТекущихТарифныхСтавокСотрудников");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОпасныхПроизводств");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетФактическиеЗатратыПоОбъектамРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПрямыеЗатратыНаВыполнениеРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетИсторияОстановаИЗапускаОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетОтказыОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПлановыеВнеплановыеРемонты");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПростойОборудования"); 	
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользоватьРабочееМестоДиспетчера");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУпаковокНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеХарактеристикНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтруктурыПредприятия");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнутреннихПотребленийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЕдиницИзмерения");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОприходованийИзлишковТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПланаРаботПодразделения");
	
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКомиссий");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеРабочегоМестаАдресацияЗаявок");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
//	
КонецПроцедуры

// -----------3---------------------------------3
//
Процедура ДобавитьПрофильМеханика(ОписанияПрофилей)
//	
	// Описание для заполнения профиля "Главный диспетчер производства".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();	
	
	ОписаниеПрофиля.Имя = "Механик";
	ОписаниеПрофиля.Наименование  = НСтр("es='El mecánico';ru='Механик';en='Mechanic'");
	ОписаниеПрофиля.Идентификатор = "5aa39e65-c646-4ba3-b56a-b65fd753a3bf";
	ОписаниеПрофиля.Описание =
	НСтр("es='Es destinado para: "
"- la formalización de las demandas por la reparación.';ru='Предназначен для:"
"- оформления заявок на ремонт.';en='Created for:"
"- filing repair requests.'");   
	
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
//	
//	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("торо_ВыгрузкаИЗагрузкаИзMSProject");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовОценок");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовПусковОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеЗначенийИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеЗначенийКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияКвалификацийРемонтногоПерсонала");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияКритериевВыбораПодрядчиков");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияКритериевОценки");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияКритичностейДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияМерБезопасности");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияНаправленийОбъектовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПриоритетовОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинЗакрытияРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинИзмененияНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинПростояОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияРемонтныхБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияРесурсовРемонтнойБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияСезонов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияСпособовПланированияРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияСтруктурОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияУсловияВыявленияДефекта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияШаблоновСообщенийИУведомлений");	
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияВводНачальныхДанных");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияЗакрытийЗаявокИРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеИзмененийПоложенияВСтруктуреИерархии");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеИзмененийСоставаРемонтнойБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияКомиссионныхРассмотрений");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеНастройкиРегистрацииНаработкиЗависимыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияОценокРаботыПодрядчика");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПрисвоенийКвалификацийСотрудникам");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеУстановокПроизвольныхЗначенийНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияУстановокСтоимостейКвалификаций");
	
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеСпискаОбъектовРегламентногоМероприятия");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеАктовОВыполненииРегламентныхМероприятий");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеАктовОВыполненииЭтаповРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеСпискаОбъектовРегламентногоМероприятия");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеВыбораРемонтаИзПланГрафика");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеЗакрытияЗаявокИРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораОбъектовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораРемонтныхРаботОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеТехническойДокументации");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользоватьРабочееМестоТехническогоСпециалиста");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаВидаРемонтаПриВводеНаОснованииВыявленныхДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаИспользованияЛотов");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаИспользованияНарядовДопусковНаРаботыПовышеннойОпасностиОбязательно");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаИспользованияОпасногоПроизводства");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетБазаДанныхПоПодрядчикамСИсторией");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетВнешниеОснования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетВыявленныеДефекты");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПлановыеОстановыОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияСписокОбъектовРегламентногоМероприятия");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеЗаявокНаРемонт");

	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеАктовОВыполненииРегламентныхМероприятий");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеАктовОВыполненииЭтаповРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВводаНачальныхДанных");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовОценок");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовПусковОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗакрытийЗаявокИРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗначенийИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗначенийКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмененийПоложенияВСтруктуреИерархии");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмененийСоставаРемонтнойБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКвалификацийРемонтногоПерсонала");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКомиссионныхРассмотрений");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКритериевВыбораПодрядчиков");
	
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКритериевОценки");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКритичностейДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеМерБезопасности");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеНарядовНаВыполнениеРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеНарядовНаРегламентноеМероприятие");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеНастройкиРегистрацииНаработкиЗависимыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОценокРаботыПодрядчика");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПриоритетовОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПрисвоенийКвалификацийСотрудникам");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинЗакрытияРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинИзмененияНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинПростояОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеРемонтныхБригад");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеРесурсовРемонтнойБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСезонов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСобытийУведомленийВДокументах");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСпискаОбъектовРегламентногоМероприятия");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСпособовПланированияРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСпособовСогласованияДокументов");
	
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСтатусовСогласованияДокументовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСтруктурОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТиповыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУсловийВыявленияДефекта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокПроизвольныхЗначенийНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокСтоимостейКвалификаций");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУчетовНаработкиОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеШаблоновСообщенийИУведомлений");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКвалификацийРемонтногоПерсоналаПоСотрудникам");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеКвалификацийРемонтногоПерсоналаПоСотрудникам");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТекущихТарифныхСтавокСотрудников");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеТекущихТарифныхСтавокСотрудников");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеПараметровОповещенияОСостоянииОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОпасныхПроизводств");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановкаАналоговНоменклатурыДляРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетФактическиеЗатратыПоОбъектамРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПрямыеЗатратыНаВыполнениеРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланФактныйАнализППР");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланМТОИнструментовТрудозатрат");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПлановыеВнеплановыеРемонты");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПростойОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетЗатратыНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПринятиеКУчетуВыбытиеОборудования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеХарактеристикНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУпаковокНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтруктурыПредприятия");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнутреннихПотребленийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЕдиницИзмерения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПараметровВыработкиОС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОприходованийИзлишковТоваров");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеРабочегоМестаАдресацияЗаявок");
	
	//Обработки
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеСозданияДополнительныхИерархий");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

//// -----------4---------------------------------4
////   
Процедура ДобавитьПрофильИнженера(ОписанияПрофилей)
//	
//	// Описание для заполнения профиля "Главный диспетчер производства".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	
	ОписаниеПрофиля.Имя = "Инженер";
	ОписаниеПрофиля.Наименование  = НСтр("es='El ingeniero';ru='Инженер';en='Engineer'");
	ОписаниеПрофиля.Идентификатор = "36bc60d8-a5aa-4d98-b4d7-15eab6d88494";
	ОписаниеПрофиля.Описание =
	НСтр("es='Es destinado para: "
"- el recuento de los objetos de la reparación; "
"- la planificación ППР, las medidas de reglamento; "
"- el recuento de los trabajos cumplidos.';ru='Предназначен для:"
"- учета объектов ремонта;"
"- планирования ППР, регламентных мероприятий;"
"- учета выполненных работ.';en='Created for:"
"- accounting of repair objects;"
"- planning of preventive maintenance, regulatory activities;"
"- accounting of work performed.'");

	
	
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
//	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("торо_ВыгрузкаИЗагрузкаИзMSProject");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеАктовОВыполненииРегламентныхМероприятий");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеАктовОВыполненииЭтаповРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеАктовПриемкиОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеГрафиковРегламентныхМероприятийТОиР");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеОстановочныхРемонтов");
	
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовОценок");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовПусковОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеЗначенийИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеЗначенийКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияКвалификацийРемонтногоПерсонала");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияКритериевВыбораПодрядчиков");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияКритериевОценки");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияКритичностейДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияМерБезопасности");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияНаправленийОбъектовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПриоритетовОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинЗакрытияРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинИзмененияНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинПростояОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияРемонтныхБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияРесурсовРемонтнойБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияСезонов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияСпособовПланированияРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияСтруктурОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеТиповКоэффициентовПереводаСтоимостейРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияТиповыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияУсловияВыявленияДефекта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияЦепочкиРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияШаблоновСообщенийИУведомлений");
	
	
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияВводНачальныхДанных");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияЗакрытийЗаявокИРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеИзмененийПоложенияВСтруктуреИерархии");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеИзмененийСоставаРемонтнойБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияКомиссионныхРассмотрений");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеНастройкиРегистрацииНаработкиЗависимыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияОценокРаботыПодрядчика");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПрисвоенийКвалификацийСотрудникам");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеУстановокКоэффициентовПереводаСтоимостей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеУстановокЛимитовНаПлановыеРемонтныеРаботы");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеУстановокПроизвольныхЗначенийНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияУстановокСтоимостейКвалификаций");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияУчетовНаработкиОборудования");
	
	
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеСпискаОбъектовРегламентногоМероприятия");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеНарядовНаВыполнениеРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеНарядовНаРегламентноеМероприятие");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеПлановГрафиковРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеАктовОВыполненииРегламентныхМероприятий");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеАктовОВыполненииЭтаповРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеАктовПриемкиОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеГрафиковРегламентныхМероприятийТОиР");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеНарядовНаВыполнениеРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеНарядовНаРегламентноеМероприятие");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзмененияОстановочныхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеСпискаОбъектовРегламентногоМероприятия");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзмененияПлановГрафиковРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеВыбораРемонтаИзПланГрафика");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеЗакрытияЗаявокИРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеКорректировокППРПоРМ");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораОбъектовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораРемонтныхРаботОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеТехническойДокументации");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеУстановкиОценкиРМПлановыхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользоватьРабочееМестоУчетаПоказателейЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользоватьРабочееМестоТехническогоСпециалиста");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаВалютыРегламентированногоУчета");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаВидаРемонтаПриВводеНаОснованииВыявленныхДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаИерархииДляВводаНовыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаИспользованияЛотов");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаИспользованияНарядовДопусковНаРаботыПовышеннойОпасностиОбязательно");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаИспользованияОпасногоПроизводства");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаИспользованияПриоритетностиПеренесенныхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетБазаДанныхПоПодрядчикамСИсторией");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетВнешниеОснования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетВыявленныеДефекты");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетНаработкаОРПоДатам");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПлановыеОстановыОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПоКонтролируемымПоказателям");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияАктовОВыполненииРегламентныхМероприятий");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияАктовОВыполненииЭтаповРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияАктовПриемкиОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияВыявленныхДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияГрафиковРегламентныхМероприятийТОиР");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияНарядовНаВыполнениеРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияНарядовНаРегламентноеМероприятие");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияОстановочныхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияПлановГрафиковРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияСписокОбъектовРегламентногоМероприятия");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеАктовОВыполненииРегламентныхМероприятий");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеАктовОВыполненииЭтаповРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеАктовПриемкиОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеВыявленныхДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеГрафиковРегламентныхМероприятийТОиР");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеНарядовНаВыполнениеРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеНарядовНаРегламентноеМероприятие");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеПлановГрафиковРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеОстановочныхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ПросмотрФормыСпискаДокументовПоРемонту");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеАктовОВыполненииРегламентныхМероприятий");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеАктовОВыполненииЭтаповРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеАктовПриемкиОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВводаНачальныхДанных");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовОценок");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовПусковОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗакрытийЗаявокИРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗначенийИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗначенийКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмененийПоложенияВСтруктуреИерархии");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмененийСоставаРемонтнойБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКвалификацийРемонтногоПерсонала");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКомиссионныхРассмотрений");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКритериевВыбораПодрядчиков"); 
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКритериевОценки");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКритичностейДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеМерБезопасности");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеНарядовНаВыполнениеРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеНарядовНаРегламентноеМероприятие");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеНастройкиРегистрацииНаработкиЗависимыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОценокРаботыПодрядчика");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПлановГрафиковРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОстановочныхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПриоритетовОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПрисвоенийКвалификацийСотрудникам");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинЗакрытияРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинИзмененияНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинПростояОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеРемонтныхБригад");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеРесурсовРемонтнойБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСезонов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСобытийУведомленийВДокументах");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСпискаОбъектовРегламентногоМероприятия");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСпособовПланированияРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСпособовСогласованияДокументов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСтатусовСогласованияДокументовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСтруктурОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТиповКоэффициентовПереводаСтоимостейРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТиповыхДефектовОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТиповыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУсловийВыявленияДефекта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокКоэффициентовПереводаСтоимостейРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокЛимитовНаПлановыеРемонтныеРаботы");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокПроизвольныхЗначенийНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокСтоимостейКвалификаций");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУчетовКонтролируемыхПоказателей");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУчетовНаработкиОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЦепочекРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеШаблоновСообщенийИУведомлений");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеППРДляРасчетаВФоновомРежиме");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеППРДляРасчетаВФоновомРежиме");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКвалификацийРемонтногоПерсоналаПоСотрудникам");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеКвалификацийРемонтногоПерсоналаПоСотрудникам");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТекущихТарифныхСтавокСотрудников");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеТекущихТарифныхСтавокСотрудников");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеПараметровОповещенияОСостоянииОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОпасныхПроизводств");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеОпасныхПроизводств");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеРемонтныхЦикловОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеРемонтныхЦикловОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетФактическиеЗатратыПоОбъектамРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПрямыеЗатратыНаВыполнениеРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПричиныОтменыПлановыхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПричиныОтменыПлановыхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетСводнаяДиаграммаГрафиковППР");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланФактВыполненияРаботПодрядчиками");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланФактныйАнализППР");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланМТОИнструментовТрудозатрат");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетНаработкаОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПлановыеВнеплановыеРемонты");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланФактЗатрат");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланФактТрудозатрат");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПростойОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетЗатратыНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетАнализИспользованияПерсонала");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеКалькулятораРЦ");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаКоличестваДнейСмещенияВДефектеДляПростоев");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокМинимальныхОстатковНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеУстановкаАналоговНоменклатурыДляРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановкаАналоговНоменклатурыДляРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПринятиеКУчетуВыбытиеОборудования");	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУпаковокНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтруктурыПредприятия");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнутреннихПотребленийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроведениеПометкаУдаленияВнутреннихПотребленийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроведениеПометкаУдаленияЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЕдиницИзмерения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПараметровВыработкиОС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСкладов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСерийНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовЦен");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОприходованийИзлишковТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроведениеПометкаУдаленияОприходованийИзлишковТоваров");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПланаРаботПодразделения");
	
	// Согласования и  уведомления
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовДокументовУведомлений");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияСобытийУведомленийВДокументах");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияСпособовСогласованияДокументов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеСтатусовСогласованияДокументовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовДокументовУведомлений");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПоМинимальнымОстаткам");
	
	//Обработки
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеСозданияДополнительныхИерархий");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеРабочегоМестаАдресацияЗаявок");

	 	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
		
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

//// -----------5---------------------------------5
////
Процедура ДобавитьПрофильУтверждениеНормативов(ОписанияПрофилей)
//	
//	// Описание для заполнения профиля "Утверждение нормативов".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	
	ОписаниеПрофиля.Имя = "УтверждениеНормативов";
	ОписаниеПрофиля.Наименование  = НСтр("es='Las normas y НСИ';ru='Нормативы и НСИ';en='Norms and NSI'");
	ОписаниеПрофиля.Идентификатор = "349c7ae2-0474-11e5-bf1f-8eb2736043cf";
	ОписаниеПрофиля.Описание =
	НСтр("es='Es destinado para: "
"- el recuento de las normas; "
"- el recuento НСИ.';ru='Предназначен для:"
"- учета нормативов;"
"- учета НСИ.';en='Created for:"
"- accounting standards;"
"- accounting NSI.'");

	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("торо_УтверждениеТехнологическихКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_УтверждениеТиповыхОР");
	
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТиповыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияТиповыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеПараметровОповещенияОСостоянииОР");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеХарактеристикНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияХарактеристикНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовКонтактнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияВидовНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовЦен");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияВидовЦен");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнешнихПользователей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияДоговорыКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияЕдиницИзмерения");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаГрафикаРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеГрафиковРаботы");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияПараметровВыработкиОС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСерийНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияСерийНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСкладов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияСкладов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтруктурыПредприятия");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияСтруктурыПредприятия");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовПусковОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеЗначенийИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗначенийКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеЗначенийКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияКритичностейДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияМерБезопасности");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинЗакрытияРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинИзмененияНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинПростояОборудования"); 
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияСезонов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеСпискаОбъектовРегламентногоМероприятия");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияСпособовПланированияРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияТиповыхДефектовОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеТиповКоэффициентовПереводаСтоимостейРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияУсловияВыявленияДефекта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияЦепочкиРемонта");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияУпаковокНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПараметровАвтоматическойФиксацииДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПараметровАвтоматическойФиксацииДефектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПрисоединенныхКНоменклатуреФайлов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияПрисоединенныхКНоменклатуреФайлов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхФизическихЛицЗарплатаКадры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПерсональныхДанныхФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДолжностей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияДолжностей");
	
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияВводНачальныхДанных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроведениеПометкаУдаленияЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеНастройкиРегистрацииНаработкиЗависимыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановкаАналоговНоменклатурыДляРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеУстановкаАналоговНоменклатурыДляРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокКоэффициентовПереводаСтоимостейРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеУстановокКоэффициентовПереводаСтоимостей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеУстановокЛимитовНаПлановыеРемонтныеРаботы");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокМинимальныхОстатковНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеУстановокМинимальныхОстатковНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУстановокЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроведениеПометкаУдаленияУстановокЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПоМинимальнымОстаткам");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияСотрудников");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеИзмененийПоложенияВСтруктуреИерархии");
	
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияСтратегийОбслуживания");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
		
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

//// -----------6---------------------------------5
////
Процедура ДобавитьПрофильАнализЭффективности(ОписанияПрофилей)
//	
//	// Описание для заполнения профиля "Утверждение нормативов".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	
	ОписаниеПрофиля.Имя = "АнализЭффективности";
	ОписаниеПрофиля.Наименование  = НСтр("es='El análisis de la eficiencia';ru='Анализ эффективности';en='Performance analysis'");
	ОписаниеПрофиля.Идентификатор = "cde10382-4b4c-4a32-a7d7-1f50a9c0997e";
	ОписаниеПрофиля.Описание =
	НСтр("es='Es destinado para: "
"- la presentación de los informes.';ru='Предназначен для:"
"- просмотра отчетов.';en='Created for:"
"- viewing reports.'");

	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПоказателиKPI");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПоказателиKPI");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановкаЦелевыхЗначенийПоказателейKPI");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеУстановкаЦелевыхЗначенийПоказателейKPI");
	ОписаниеПрофиля.Роли.Добавить("торо_РазделПоказателиKPI");
	
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетАнализИспользованияПерсонала");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетБазаДанныхПоПодрядчикамСИсторией");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетВнешниеОснования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетВыявленныеДефекты");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетИсторияОстановаИЗапускаОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетНаработкаОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетНаработкаОРПоДатам");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетОтказыОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПлановыеВнеплановыеРемонты");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланМТОИнструментовТрудозатрат");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПлановыеОстановыОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланФактВыполненияРаботПодрядчиками");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланФактЗатрат");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланФактТрудозатрат");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланФактныйАнализППР");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПоКонтролируемымПоказателям");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПринятиеКУчетуВыбытиеОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПричиныОтменыПлановыхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПростойОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПрямыеЗатратыНаВыполнениеРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетСводнаяДиаграммаГрафиковППР");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетСписокОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетФактическиеЗатратыПоОбъектамРемонта");
	ОписаниеПрофиля.Роли.Добавить("ОтчетВедомостьПоТоварамНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСотрудников");
	 	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
		
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

//// -----------7---------------------------------7
////
Процедура ДобавитьПрофильСпециалистИБ(ОписанияПрофилей)
//	
//	// Описание для заполнения профиля "Утверждение нормативов".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	
	ОписаниеПрофиля.Имя = "СпециалистИБ";
	ОписаниеПрофиля.Наименование  = НСтр("es='El especialista ИБ';ru='Специалист ИБ';en='IB Specialist'");
	ОписаниеПрофиля.Идентификатор =  Строка(Справочники.ПрофилиГруппДоступа.СпециалистИБ.УникальныйИдентификатор());
	ОписаниеПрофиля.Описание =  НСтр("es='Es destinado para:"
"	- La presentación de la revista del registro de las acciones de los usuarios"
"	- La presentación de las sesiones conectadas, los usuarios activos';ru='Предназначен для:"
"	- просмотра журнала регистрации действий пользователей"
"	- просмотра подключенных сессий, активных пользователей';en='Created for:"
"- view the log of user actions"
"- view connected sessions, active users '");

	// Обязательные права
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	
	// Базовые права
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("торо_БазовыеПрава");
	
    ОписаниеПрофиля.Роли.Добавить("ПросмотрЖурналаРегистрации");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеОбработкиАктивныеПользователи");    
	ОписаниеПрофиля.Роли.Добавить("торо_РазделНастройкаИАдминистрирование");
    ОписаниеПрофиля.Роли.Добавить("Администрирование");

	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

//// -----------8---------------------------------8
////
Процедура ДобавитьПрофильУправлениеРисками(ОписанияПрофилей)
//	
//	// Описание для заполнения профиля "Утверждение нормативов".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	
	ОписаниеПрофиля.Имя = "УправлениеРисками";
	ОписаниеПрофиля.Наименование  = НСтр("es='La dirección de los riesgos';ru='Управление рисками';en='Control of risks'");
	ОписаниеПрофиля.Идентификатор =  Строка(Справочники.ПрофилиГруппДоступа.УправлениеРисками.УникальныйИдентификатор());
	ОписаниеПрофиля.Описание =  НСтр("es='Es destinado para:"
"	- La redacción de las guías para el destino de las reparaciones tomando en cuenta los riesgos"
"	- La redacción de los ajustes para el destino de las reparaciones tomando en cuenta los riesgos';ru='Предназначен для:"
"	- редактирования справочников для назначения ремонтов с учетом рисков "
"	- редактирования настроек для назначения ремонтов с учетом рисков';en='Created for:"
"- editing reference books for assignment of repairs taking into account risks"
"- editing settings for the appointment of repairs taking into account the risks '");

	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияОбъектовВоздействия");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияКатегорийВероятности");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияКатегорийТяжестиПоследствий");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияКатегорийРиска");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеМатрицыОценкиРисков");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКритичностейДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_РедактированиеРегистраСведенийПоследствия");

	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

// Заполняет зависимости прав доступа "подчиненного" объекта (например, задачи ЗадачаИсполнителя),
// от "ведущего" объекта (например,  бизнес-процесса Задание), которые отличаются от стандартных.
//
// Зависимости прав используются в стандартном шаблоне ограничения доступа для вида доступа "Объект".
// 1. Стандартно при чтении "подчиненного" объекта
//    проверяется наличие права чтения "ведущего" объекта и
//    проверяется отсутствие ограничения чтения "ведущего" объекта.
// 2. Стандартно при добавлении, изменении, удалении "подчиненного" объекта
//    проверяется наличие права изменения "ведущего" объекта и
//    проверяется отсутствие ограничения изменения "ведущего" объекта.
//
// Допускается только одно переназначение по сравнению со стандартным -
// в пункте 2 вместо проверки права изменения "ведущего" объекта установить
// проверку права чтения "ведущего" объекта.
//
// Параметры:
//  ЗависимостиПрав - ТаблицаЗначений - с колонками:
//   * ВедущаяТаблица     - Строка - например Метаданные.БизнесПроцессы.Задание.ПолноеИмя().
//   * ПодчиненнаяТаблица - Строка - например Метаданные.Задачи.ЗадачаИсполнителя.ПолноеИмя().
//
Процедура ПриЗаполненииЗависимостейПравДоступа(ЗависимостиПрав) Экспорт
	
	
	
КонецПроцедуры

// Заполняет описания возможных прав, назначаемых для объектов указанных типов.
// 
// Параметры:
//  ВозможныеПрава - ТаблицаЗначений - с колонками:
//   ВладелецПрав - Строка - полное имя таблицы значения доступа.
//
//   Имя          - Строка - идентификатор права, например ИзменениеПапок. Право с именем УправлениеПравами
//                  должно быть обязательно определено для общей формы настройки прав "Права доступа".
//                  УправлениеПравами - это право на изменение прав по владельцу прав, которое проверяется
//                  при открытии ОбщаяФорма.НастройкиПравОбъектов.
//
//   Заголовок    - Строка - заголовок права, например в форме НастройкиПравОбъектов:
//                  "Изменение.
//                  |папок".
//
//   Подсказка    - Строка - подсказка к заголовку права,
//                  например "Добавление, изменение и пометка удаления папок".
//
//   НачальноеЗначение - Булево - начальное значение флажка права при добавлении новой строки
//                  в форме "Права доступа".
//
//   ТребуемыеПрава - Массив строк - имена прав, требуемых для этого права -
//                  например, право "ДобавлениеФайлов" требует права "ИзменениеФайлов".
//
//   ЧтениеВТаблицах - Массив строк - полные имена таблиц, для которых это право обозначает право Чтение.
//                  Возможно использование символа "*", который обозначает "для всех остальных таблиц",
//                  т.к. право Чтение может зависеть только от права Чтение, то имеет смысл только символ "*"
//                  (требуется для работы шаблонов ограничения доступа).
//
//   ИзменениеВТаблицах - Массив строк - полные имена таблиц, для которых это право обозначает право Изменение.
//                  Возможно использование символа "*", который обозначает "для всех остальных таблиц"
//                  (требуется для работы шаблонов ограничения доступа).
//
Процедура ПриЗаполненииВозможныхПравДляНастройкиПравОбъектов(ВозможныеПрава) Экспорт
	
КонецПроцедуры

// Определяет вид используемого интерфейса пользователя для настройки доступа.
//
// Параметры:
//  УпрощенныйИнтерфейс - Булево - начальное значение Ложь.
//
Процедура ПриОпределенииИнтерфейсаНастройкиДоступа(УпрощенныйИнтерфейс) Экспорт
	
КонецПроцедуры

// Заполняет использование видов доступа в зависимости от функциональных опций конфигурации,
// например, ИспользоватьГруппыДоступаНоменклатуры.
//
// Параметры:
//  ВидДоступа    - Строка - имя вида доступа, заданное в процедуре ПриЗаполненииВидовДоступа.
//  Использование - Булево - начальное значение Истина.
// 
Процедура ПриЗаполненииИспользованияВидаДоступа(ВидДоступа, Использование) Экспорт
	
	
	
КонецПроцедуры

// Позволяет переопределить ограничение, указанное в модуле менеджера объекта метаданных.
//
// Параметры:
//  Список - ОбъектМетаданных - список, для которого нужно вернуть текст ограничения.
//                              В процедуре ПриЗаполненииСписковСОграничениемДоступа нужно
//                              указать для списка значение Ложь, иначе вызова не будет.
//
//  Ограничение - Структура - со свойствами, как для процедур в модулях менеджеров. См. свойства
//                            в комментарии к процедуре ПриЗаполненииСписковСОграничениемДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Список, Ограничение) Экспорт
	
	
	
КонецПроцедуры

// Заполняет состав видов доступа, используемых при ограничении прав объектов метаданных.
// Если состав видов доступа не заполнен, отчет "Права доступа" покажет некорректные сведения.
//
// Обязательно требуется заполнить только виды доступа, используемые в шаблонах ограничения доступа
// явно, а виды доступа, используемые в наборах значений доступа, могут быть получены из текущего
// состояния регистра сведений НаборыЗначенийДоступа.
//
//  Для автоматической подготовки содержимого процедуры следует воспользоваться инструментами
// разработчика для подсистемы Управление доступом.
//
// Параметры:
//  Описание     - Строка - многострочная строка формата <Таблица>.<Право>.<ВидДоступа>[.Таблица объекта],
//                 например, "Документ.ПриходнаяНакладная.Чтение.Организации",
//                           "Документ.ПриходнаяНакладная.Чтение.Контрагенты",
//                           "Документ.ПриходнаяНакладная.Изменение.Организации",
//                           "Документ.ПриходнаяНакладная.Изменение.Контрагенты",
//                           "Документ.ЭлектронныеПисьма.Чтение.Объект.Документ.ЭлектронныеПисьма",
//                           "Документ.ЭлектронныеПисьма.Изменение.Объект.Документ.ЭлектронныеПисьма",
//                           "Документ.Файлы.Чтение.Объект.Справочник.ПапкиФайлов",
//                           "Документ.Файлы.Чтение.Объект.Документ.ЭлектронноеПисьмо",
//                           "Документ.Файлы.Изменение.Объект.Справочник.ПапкиФайлов",
//                           "Документ.Файлы.Изменение.Объект.Документ.ЭлектронноеПисьмо".
//                 Вид доступа Объект предопределен как литерал. Этот вид доступа используется в
//                 шаблонах ограничений доступа как "ссылка" на другой объект, по которому
//                 ограничивается текущий объект таблицы.
//                 Когда вид доступа "Объект" задан, также требуется задать типы таблиц,
//                 которые используются для этого вида доступа. Т.е. перечислить типы,
//                 которые соответствуют полю, использованному в шаблоне ограничения доступа
//                 в паре с видом доступа "Объект". При перечислении типов по виду доступа "Объект"
//                 нужно перечислить только те типы поля, которые есть
//                 у поля РегистрыСведений.НаборыЗначенийДоступа.Объект, остальные типы лишние.
// 
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	Описание = Описание + "
	|Справочник.Организации.Чтение.Организации
	|Справочник.Организации.Изменение.Организации
	|Справочник.Сотрудники.Чтение.Организации
	|Справочник.Сотрудники.Изменение.Организации
	|Справочник.СтруктураПредприятия.Чтение.Организации
	|Справочник.СтруктураПредприятия.Чтение.Подразделения
	|Справочник.СтруктураПредприятия.Изменение.Организации
	|Справочник.СтруктураПредприятия.Изменение.Подразделения
	|Справочник.торо_ОбъектыРемонта.Чтение.КонтрагентыОР
	|Справочник.торо_ОбъектыРемонта.Чтение.ОбъектыРемонта
	|Справочник.торо_ОбъектыРемонта.Чтение.Организации
	|Справочник.торо_ОбъектыРемонта.Чтение.Подразделения
	|Справочник.торо_ОбъектыРемонта.Изменение.КонтрагентыОР
	|Справочник.торо_ОбъектыРемонта.Изменение.ОбъектыРемонта
	|Справочник.торо_ОбъектыРемонта.Изменение.Организации
	|Справочник.торо_ОбъектыРемонта.Изменение.Подразделения
	|Справочник.торо_РемонтныеБригады.Чтение.Подразделения
	|Справочник.торо_РемонтныеБригады.Изменение.Подразделения
	|Справочник.торо_СпособыСогласованияДокументов.Чтение.Организации
	|Справочник.торо_СпособыСогласованияДокументов.Изменение.Организации
	|Документ.ВнутреннееПотреблениеТоваров.Чтение.Организации
	|Документ.ВнутреннееПотреблениеТоваров.Чтение.Подразделения
	|Документ.ВнутреннееПотреблениеТоваров.Изменение.Организации
	|Документ.ВнутреннееПотреблениеТоваров.Изменение.Подразделения
	|Документ.ЗаказНаВнутреннееПотребление.Чтение.Организации
	|Документ.ЗаказНаВнутреннееПотребление.Чтение.Подразделения
	|Документ.ЗаказНаВнутреннееПотребление.Изменение.Организации
	|Документ.ЗаказНаВнутреннееПотребление.Изменение.Подразделения
	|Документ.ОприходованиеИзлишковТоваров.Чтение.Организации
	|Документ.ОприходованиеИзлишковТоваров.Чтение.Подразделения
	|Документ.ОприходованиеИзлишковТоваров.Изменение.Организации
	|Документ.ОприходованиеИзлишковТоваров.Изменение.Подразделения
	|Документ.ПеремещениеТоваров.Чтение.Организации
	|Документ.ПеремещениеТоваров.Изменение.Организации
	|Документ.ПоступлениеТоваровУслуг.Чтение.Организации
	|Документ.ПоступлениеТоваровУслуг.Чтение.Подразделения
	|Документ.ПоступлениеТоваровУслуг.Изменение.Организации
	|Документ.ПоступлениеТоваровУслуг.Изменение.Подразделения
	|Документ.СписаниеНедостачТоваров.Чтение.Организации
	|Документ.СписаниеНедостачТоваров.Чтение.Подразделения
	|Документ.СписаниеНедостачТоваров.Изменение.Организации
	|Документ.СписаниеНедостачТоваров.Изменение.Подразделения
	|Документ.торо_АктОВыполненииРегламентногоМероприятия.Чтение.Организации
	|Документ.торо_АктОВыполненииРегламентногоМероприятия.Чтение.Подразделения
	|Документ.торо_АктОВыполненииРегламентногоМероприятия.Изменение.Организации
	|Документ.торо_АктОВыполненииРегламентногоМероприятия.Изменение.Подразделения
	|Документ.торо_ВводНачальныхДанных.Чтение.ОбъектыРемонта
	|Документ.торо_ВводНачальныхДанных.Чтение.Организации
	|Документ.торо_ВводНачальныхДанных.Чтение.Подразделения
	|Документ.торо_ВводНачальныхДанных.Изменение.ОбъектыРемонта
	|Документ.торо_ВводНачальныхДанных.Изменение.Организации
	|Документ.торо_ВводНачальныхДанных.Изменение.Подразделения
	|Документ.торо_ВыбытиеОбъектаРемонта.Чтение.ОбъектыРемонта
	|Документ.торо_ВыбытиеОбъектаРемонта.Чтение.Организации
	|Документ.торо_ВыбытиеОбъектаРемонта.Чтение.Подразделения
	|Документ.торо_ГрафикРегламентныхМероприятийТОиР.Чтение.Организации
	|Документ.торо_ГрафикРегламентныхМероприятийТОиР.Чтение.Подразделения
	|Документ.торо_ГрафикРегламентныхМероприятийТОиР.Изменение.Организации
	|Документ.торо_ГрафикРегламентныхМероприятийТОиР.Изменение.Подразделения
	|Документ.торо_ИзменениеПоложенияВСтруктуреИерархии.Изменение.ОбъектыРемонта
	|Документ.торо_ИзменениеПоложенияВСтруктуреИерархии.Изменение.Организации
	|Документ.торо_ИзменениеПоложенияВСтруктуреИерархии.Изменение.Подразделения
	|Документ.торо_ИзменениеСоставаРемонтнойБригады.Чтение.Организации
	|Документ.торо_ИзменениеСоставаРемонтнойБригады.Чтение.Подразделения
	|Документ.торо_ИзменениеСоставаРемонтнойБригады.Изменение.Организации
	|Документ.торо_ИзменениеСоставаРемонтнойБригады.Изменение.Подразделения
	|Документ.торо_КомиссионноеРассмотрение.Чтение.ОбъектыРемонта
	|Документ.торо_КомиссионноеРассмотрение.Чтение.Организации
	|Документ.торо_КомиссионноеРассмотрение.Чтение.Подразделения
	|Документ.торо_КомиссионноеРассмотрение.Изменение.ОбъектыРемонта
	|Документ.торо_КомиссионноеРассмотрение.Изменение.Организации
	|Документ.торо_КомиссионноеРассмотрение.Изменение.Подразделения
	|Документ.торо_НарядНаРегламентноеМероприятие.Чтение.ОбъектыРемонта
	|Документ.торо_НарядНаРегламентноеМероприятие.Чтение.Организации
	|Документ.торо_НарядНаРегламентноеМероприятие.Чтение.Подразделения
	|Документ.торо_НарядНаРегламентноеМероприятие.Изменение.ОбъектыРемонта
	|Документ.торо_НарядНаРегламентноеМероприятие.Изменение.Организации
	|Документ.торо_НарядНаРегламентноеМероприятие.Изменение.Подразделения
	|Документ.торо_ПринятиеОРКУчету.Чтение.ОбъектыРемонта
	|Документ.торо_ПринятиеОРКУчету.Чтение.Организации
	|Документ.торо_ПринятиеОРКУчету.Чтение.Подразделения
	|Документ.торо_ПрисвоениеКвалификацийСотрудникам.Чтение.Организации
	|Документ.торо_ПрисвоениеКвалификацийСотрудникам.Чтение.Подразделения
	|Документ.торо_ПрисвоениеКвалификацийСотрудникам.Изменение.Организации
	|Документ.торо_ПрисвоениеКвалификацийСотрудникам.Изменение.Подразделения
	|Документ.торо_УстановкаКоэффициентовПереводаСтоимостейРемонтов.Чтение.Организации
	|Документ.торо_УстановкаКоэффициентовПереводаСтоимостейРемонтов.Чтение.Подразделения
	|Документ.торо_УстановкаКоэффициентовПереводаСтоимостейРемонтов.Изменение.Организации
	|Документ.торо_УстановкаКоэффициентовПереводаСтоимостейРемонтов.Изменение.Подразделения
	|Документ.торо_УстановкаЛимитаНаПлановыеРемонтныеРаботы.Чтение.Организации
	|Документ.торо_УстановкаЛимитаНаПлановыеРемонтныеРаботы.Чтение.Подразделения
	|Документ.торо_УстановкаЛимитаНаПлановыеРемонтныеРаботы.Изменение.Организации
	|Документ.торо_УстановкаЛимитаНаПлановыеРемонтныеРаботы.Изменение.Подразделения
	|Документ.торо_УстановкаМинимальногоОстаткаНоменклатуры.Чтение.Организации
	|Документ.торо_УстановкаМинимальногоОстаткаНоменклатуры.Изменение.Организации
	|Документ.торо_УстановкаСтоимостейКвалификаций.Чтение.Организации
	|Документ.торо_УстановкаСтоимостейКвалификаций.Изменение.Организации
	|РегистрСведений.торо_ВнешниеОснованияДляРабот.Чтение.ОбъектыРемонта
	|РегистрСведений.торо_ВнешниеОснованияДляРабот.Чтение.Организации
	|РегистрСведений.торо_ВнешниеОснованияДляРабот.Чтение.Подразделения
	|РегистрСведений.торо_ВыявленныеДефекты.Чтение.ОбъектыРемонта
	|РегистрСведений.торо_ВыявленныеДефекты.Чтение.Организации
	|РегистрСведений.торо_ВыявленныеДефекты.Чтение.Подразделения
	|РегистрСведений.торо_ЗавершенныеРемонтныеРаботы.Чтение.ОбъектыРемонта
	|РегистрСведений.торо_Запчасти.Чтение.ОбъектыРемонта
	|РегистрСведений.торо_Запчасти.Изменение.ОбъектыРемонта
	|РегистрСведений.торо_ЗапчастиУдаленные.Чтение.ОбъектыРемонта
	|РегистрСведений.торо_ЗапчастиУдаленные.Изменение.ОбъектыРемонта
	|РегистрСведений.торо_ИерархическиеСтруктурыОР.Чтение.ОбъектыРемонта
	|РегистрСведений.торо_ИерархическиеСтруктурыОР.Изменение.ОбъектыРемонта
	|РегистрСведений.торо_ИзмеряемыеПоказателиОбъектовРемонта.Чтение.ОбъектыРемонта
	|РегистрСведений.торо_ИзмеряемыеПоказателиОбъектовРемонта.Изменение.ОбъектыРемонта
	|РегистрСведений.торо_МаксимальныеЗначенияНаработкиОР.Чтение.ОбъектыРемонта
	|РегистрСведений.торо_МаксимальныеЗначенияНаработкиОР.Изменение.ОбъектыРемонта
	|РегистрСведений.торо_НормативныеРемонтыОборудования.Чтение.ОбъектыРемонта
	|РегистрСведений.торо_НормативныеРемонтыОборудования.Изменение.ОбъектыРемонта
	|РегистрСведений.торо_НормативныеРемонтыОборудованияУдаленные.Чтение.ОбъектыРемонта
	|РегистрСведений.торо_НормативныеРемонтыОборудованияУдаленные.Изменение.ОбъектыРемонта
	|РегистрСведений.торо_НормыЗапчастейНаОбъектыРемонта.Чтение.ОбъектыРемонта
	|РегистрСведений.торо_НормыЗапчастейНаОбъектыРемонта.Изменение.ОбъектыРемонта
	|РегистрСведений.торо_НормыЗапчастейНаОбъектыРемонтаУдаленные.Чтение.ОбъектыРемонта
	|РегистрСведений.торо_НормыЗапчастейНаОбъектыРемонтаУдаленные.Изменение.ОбъектыРемонта
	|РегистрСведений.торо_ОбъектыРемонтаГруппы.Чтение.ОбъектыРемонта
	|РегистрСведений.торо_ОбъектыРемонтаГруппы.Изменение.ОбъектыРемонта
	|РегистрСведений.торо_ОценкиПодрядчиковПоКритериям.Чтение.ОбъектыРемонта
	|РегистрСведений.торо_ПараметрыЗамещенияПланированияРемонтныхРабот.Чтение.ОбъектыРемонта
	|РегистрСведений.торо_ПараметрыЗамещенияПланированияРемонтныхРабот.Изменение.ОбъектыРемонта
	|РегистрСведений.торо_ПараметрыНаработкиОбъектовРемонта.Чтение.ОбъектыРемонта
	|РегистрСведений.торо_ПараметрыНаработкиОбъектовРемонта.Изменение.ОбъектыРемонта
	|РегистрСведений.торо_ПлановыеМероприятия.Чтение.Организации
	|РегистрСведений.торо_ПлановыеРемонтныеРаботы.Чтение.ОбъектыРемонта
	|РегистрСведений.торо_ПлановыеРемонтныеРаботы.Чтение.Организации
	|РегистрСведений.торо_ПорядокОРПоИерархии.Чтение.ОбъектыРемонта
	|РегистрСведений.торо_ПорядокОРПоИерархии.Изменение.ОбъектыРемонта
	|РегистрСведений.торо_ПредшествующиеНормативныеРемонтыОборудования.Чтение.ОбъектыРемонта
	|РегистрСведений.торо_ПредшествующиеНормативныеРемонтыОборудования.Изменение.ОбъектыРемонта
	|РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.Чтение.ОбъектыРемонта
	|РегистрСведений.торо_РемонтныеЦиклыОборудования.Чтение.ОбъектыРемонта
	|РегистрСведений.торо_РемонтныеЦиклыОборудования.Изменение.ОбъектыРемонта
	|РегистрСведений.торо_Ремонты.Чтение.ОбъектыРемонта
	|РегистрСведений.торо_РМРемонтов.Чтение.ОбъектыРемонта
	|РегистрСведений.торо_РМРемонтов.Изменение.ОбъектыРемонта
	|РегистрСведений.торо_СтатусыОбъектовРемонтаВУчете.Чтение.ОбъектыРемонта
	|";
	
КонецПроцедуры

// Позволяет реализовать перезапись зависимых наборов значений доступа других объектов.
//
// Вызывается из процедур
//  УправлениеДоступомСлужебный.ЗаписатьНаборыЗначенийДоступа,
//  УправлениеДоступомСлужебный.ЗаписатьЗависимыеНаборыЗначенийДоступа.
//
// Параметры:
//  Ссылка       - СправочникСсылка, ДокументСсылка, ... - ссылка на объект, для которого
//                 записаны наборы значений доступа.
//
//  СсылкиНаЗависимыеОбъекты - Массив - массив элементов типа СправочникСсылка, ДокументСсылка и т. п.
//                 Содержит ссылки на объекты с зависимыми наборами значений доступа.
//                 Начальное значение - пустой массив.
//
Процедура ПриИзмененииНаборовЗначенийДоступа(Ссылка, СсылкиНаЗависимыеОбъекты) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти
