
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ВосстановитьПоставляемуюМодельПоказателей(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ВосстановитьПоставляемуюМодельПоказателейЗавершение", ЭтаФорма), 
		НСтр("es='Los ajustes de los índices KPI suministrados y las variantes del análisis serán arrojados. "
"¿Continuar con la pérdida de los ajustes del modelo suministrado de los índices?';ru='Настройки поставляемых показателей KPI и вариантов анализа будут сброшены."
"Продолжить с потерей настроек поставляемой модели показателей?';en='The settings for the supplied KPIs and analysis options will be reset."
"Continue with the loss of settings for the delivered metrics model? '"), РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте 
Процедура ВосстановитьПоставляемуюМодельПоказателейЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	Иначе
		ВосстановитьПоставляемуюМодельПоказателейНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста 
Процедура ВосстановитьПоставляемуюМодельПоказателейНаСервере()
	торо_ПоказателиKPI.ВосстановитьПоставляемуюМодельПоказателей();
КонецПроцедуры

#КонецОбласти