
&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура Расш_гкс_ОбработкаПроведения(Отказ, Режим)

	Если СтоимостьЧаса.Количество() = 0 Тогда
		ТекстСообщения = НСтр("es='En el documento no es rellenada la parte tabular стоимостей de la hora. ¡La realización es imposible!';ru='В документе не заполнена табличная часть стоимостей часа. Проведение невозможно!';en='The document does not fill out the tabular part of the hourly costs. Conducting is impossible!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		ТекстСообщения = НСтр("es='¡No заполненно el significado escardando ""la Organización""!';ru='Не заполненно значение поля ""Организация""!';en='The value of the field ""Organization"" is not filled!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;

	Движения.торо_СтоимостьЧасаКвалификации.Записывать = Истина;
	Движения.торо_СтоимостьЧасаКвалификации.Очистить();
	Для Каждого ТекСтрокаСтоимость Из СтоимостьЧаса Цикл
		Движение = Движения.торо_СтоимостьЧасаКвалификации.Добавить();
		Движение.Период = Дата;
		#Вставка
		Движение.Организация = Организация;
		#КонецВставки
		Движение.Валюта = ТекСтрокаСтоимость.Валюта;
		Движение.Стоимость = ТекСтрокаСтоимость.СтоимостьНормочаса;
		Движение.Квалификация = ТекСтрокаСтоимость.Квалификация;
	КонецЦикла;


КонецПроцедуры

&После("ПередЗаписью")
Процедура Расш_гкс_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ЗначениеЗаполнено(Организация) Тогда 	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Организации.гкс_ВидЦены.ВалютаЦены КАК Валюта
			|ИЗ
			|	Справочник.Организации КАК Организации
			|ГДЕ
			|	Организации.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Организация);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Для Каждого СТ Из СтоимостьЧаса Цикл
			СТ.Валюта = Выборка.Валюта;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
