
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Класс", Объект.Класс);
	
	ТекТабличнаяЧасть = Неопределено;
	Параметры.Свойство("ТекущаяСтрока", ТекТабличнаяЧасть);
	
	ЗаполнитьДеревоВыбора(ТекТабличнаяЧасть);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВыбораТабЧастиВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	ТекСтрока = ДеревоВыбораТабЧасти.НайтиПоИдентификатору(Значение);
	Если НЕ ТекСтрока = Неопределено Тогда
		ЗначениеВыбора = Новый Структура("ТабличнаяЧасть, ИсточникЗначений", ТекСтрока.ТабличнаяЧасть, ТекСтрока.ИсточникЗначений);
		ОповеститьОВыборе(ЗначениеВыбора);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоВыбора(ТекТабличнаяЧасть)
	
	ТекСтрока = Неопределено;
	
	ТипСтрока = Тип("Строка");
	
	СписокКлассов = Новый Массив;
	СписокКлассов.Добавить(Объект.Класс);
	
	СписокКлассовВложенных = Новый Массив;
	СоответствиеКлассовТабЧастей = Новый Соответствие;
	
	Пока СписокКлассов.Количество() > 0 Цикл
	
		СписокРодителей  = Справочники.Классы.ПолучитьТаблицуРодителей(СписокКлассов);
		ТаблицаАтрибутов = Справочники.Классы.ПолучитьТаблицуАтрибутов(СписокРодителей);
		
		Для Каждого СтрокаТЗ ИЗ ТаблицаАтрибутов Цикл 
			Если СтрокаТЗ.СтатусНаследования <= 3 
					И НЕ СтрокаТЗ.ТипЗначения.СодержитТип(ТипСтрока) 
					И СтрокаТЗ.МножественноеЗначение И СтрокаТЗ.КлассТабличнаяЧасть Тогда 
				
				Если СоответствиеКлассовТабЧастей[СтрокаТЗ.ИсточникЗначений] = Неопределено Тогда
					Если СтрокаТЗ.КлассДляЧтения = Справочники.Классы.СтрокиТехОпераций 
							ИЛИ СтрокаТЗ.КлассДляЧтения = Справочники.Классы.ВложенныеТехКарты Тогда
						КлассРодтель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЗ.КлассДляЧтения, "Родитель");
						СтрокаРодителя = СоответствиеКлассовТабЧастей[КлассРодтель];
					Иначе
						СтрокаРодителя = СоответствиеКлассовТабЧастей[СтрокаТЗ.КлассДляЧтения];
					КонецЕсли;
					
					Если НЕ СтрокаРодителя = Неопределено Тогда
						ПодстрокиРодителя = СтрокаРодителя.ПолучитьЭлементы();
					Иначе
						ПодстрокиРодителя = ДеревоВыбораТабЧасти.ПолучитьЭлементы();
					КонецЕсли;
					
					СтрокаДереваВыбора = ПодстрокиРодителя.Добавить();
					СтрокаДереваВыбора.ТабличнаяЧасть = СтрокаТЗ.АтрибутКласса;
					СтрокаДереваВыбора.ИсточникЗначений = СтрокаТЗ.ИсточникЗначений;
					СоответствиеКлассовТабЧастей.Вставить(СтрокаТЗ.ИсточникЗначений, СтрокаДереваВыбора);
					
					// Пока обработку вложенных таб.частей не добавляю. {
					//СписокКлассовВложенных.Добавить(СтрокаТЗ.ИсточникЗначений);
					//Если СтрокаТЗ.АтрибутКласса = ПланыВидовХарактеристик.АтрибутыКласса.ТехОперации Тогда
					//	СписокКлассовВложенных.Добавить(Справочники.Классы.СтрокиТехОпераций);
					//	СписокКлассовВложенных.Добавить(Справочники.Классы.ВложенныеТехКарты);
					//КонецЕсли; 
					//}
					
					Если ТекТабличнаяЧасть = СтрокаТЗ.АтрибутКласса Тогда
						ТекСтрока = СтрокаДереваВыбора;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
		СписокВрем = СписокКлассов;
		СписокКлассов = СписокКлассовВложенных;
		СписокКлассовВложенных = СписокВрем;
		СписокКлассовВложенных.Очистить();
		
	КонецЦикла;
	
	Если НЕ ТекСтрока = Неопределено Тогда
		Элементы.ДеревоВыбораТабЧасти.ТекущаяСтрока = ТекСтрока.ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры