#Область ОбработчикиСобытий

&Перед("ОбработкаПолученияФормы")
Процедура гкс_ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		
		ВремяНачала = ОценкаПроизводительности.НачатьЗамерВремени();
		Параметры.Вставить("ВремяНачалаОткрытияФормы", ВремяНачала);
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма = Метаданные.Документы.торо_АктОВыполненииЭтапаРабот.Формы.ФормаДокумента.Имя;		
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// гкс+ [Релиз 1] Куст 
Функция ПечатьНарядЗадание(МассивОбъектов, ПараметрыПечати, НовыйСиноним)

	Макет  = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_ЗаявкаНаРемонт.ПФ_MXL_дс_НарядЗадание");
	ТабДокумент = Новый ТабличныйДокумент;
	Шапка = Макет.ПолучитьОбласть("Шапка");
	СтрокаРР = Макет.ПолучитьОбласть("СтрокаРР");
	ПодвалРР = Макет.ПолучитьОбласть("ПодвалРР");
	СтрокаМЗ = Макет.ПолучитьОбласть("СтрокаМЗ");
	ШапкаИнструменты = Макет.ПолучитьОбласть("ШапкаИнструменты");
	СтрокаИнструменты = Макет.ПолучитьОбласть("СтрокаИнструменты");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	СдвигЧП = Час(ТекущаяДатаСеанса()) - Час(ТекущаяДата());
	// гкс+ [Релиз18] Деснол
	Если ПараметрыПечати.Свойство("ОтборИсполнитель") Тогда 
		ОтборИсполнитель = ПараметрыПечати.ОтборИсполнитель;
		ЕстьОтборИсполнитель = Истина;
	Иначе
		ОтборИсполнитель = Новый Массив();
		ЕстьОтборИсполнитель = Ложь;
	КонецЕсли;
	// гкс- [Релиз18]

	ЗапросДокументов = Новый Запрос;
	ЗапросДокументов.Текст = 
	"ВЫБРАТЬ
	|	ДокОснования.Ссылка КАК Ссылка,
	|	ЕстьNull(ДокНаряд.ДокументОснование,ДокОснования.ДокументОснование) КАК ДокументОснование
	|ПОМЕСТИТЬ НужныеОснования
	|ИЗ
	|	Документ.торо_АктОВыполненииЭтапаРабот.ДокументыОснования КАК ДокОснования
	|	Левое Соединение Документ.торо_НарядНаВыполнениеРемонтныхРабот.ДокументыОснования КАК ДокНаряд
	|	ПО ДокНаряд.Ссылка = ДокОснования.ДокументОснование И ДокНаряд.ДокументОснование Ссылка Документ.торо_ЗаявкаНаРемонт
	|ГДЕ
	|	ДокОснования.Ссылка В(&Ссылка)
	|;
	| ВЫБРАТЬ
	|	ДокОснования.Ссылка КАК Акт,
	|	АктРемонты.ID КАК ИД,
	|	ДокОснования.ДокументОснование КАК Основание
	|ПОМЕСТИТЬ АктИОснование
	|ИЗ
	|	НужныеОснования КАК ДокОснования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК АктРемонты
	|		ПО (АктРемонты.Ссылка = ДокОснования.Ссылка)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ОбъектРемонта КАК ОР,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ID КАК ИД,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка КАК Док,
	|	АктРемонты.Акт КАК Акт,
	|	МАКСИМУМ(НЕ торо_ЗаявкаНаРемонтПрисоединенныеФайлы.Ссылка ЕСТЬ NULL) КАК ЕстьФайлы
	|ПОМЕСТИТЬ Ремонты
	|ИЗ
	|	АктИОснование КАК АктРемонты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК торо_ЗаявкаНаРемонтРемонтыОборудования
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ЗаявкаНаРемонтПрисоединенныеФайлы КАК торо_ЗаявкаНаРемонтПрисоединенныеФайлы
	|			ПО торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка = торо_ЗаявкаНаРемонтПрисоединенныеФайлы.ВладелецФайла
	|		ПО (торо_ЗаявкаНаРемонтРемонтыОборудования.ID = АктРемонты.ИД)
	|			И АктРемонты.Основание = торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка
	|ГДЕ
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ID В(&ID)
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ОбъектРемонта,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ID,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка,
	|	АктРемонты.Акт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(торо_ЗаявкаНаРемонтДокументыОснования.ДокументОснование.Ответственный) КАК ОтветственныйДО,
	|	МАКСИМУМ(торо_ЗаявкаНаРемонтДокументыОснования.ДокументОснование.Дата) КАК ДатаДО,
	|	Ремонты.Док КАК Док
	|ПОМЕСТИТЬ ДокументыОснования
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.ДокументыОснования КАК торо_ЗаявкаНаРемонтДокументыОснования
	|		ПО Ремонты.Док = торо_ЗаявкаНаРемонтДокументыОснования.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Ремонты.Док
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Ремонты.ОР КАК ОР,
	|	Ремонты.ОР.ИнвентарныйНомер КАК ИнвНомер,
	|	Ремонты.ОР.ТехНомер КАК ТехНомер,
	|	Ремонты.ОР.Организация КАК Организация,
	|	Ремонты.ОР.Направление КАК Специализация,
	|	РемонтыЗаявки.ОписаниеРемонта КАК НаправлениеНаУстранение,
	|	РемонтыЗаявки.Ссылка.Номер КАК НарядЗаданиеНомер,
	|	РемонтыЗаявки.Ссылка.Дата КАК Дата,
	|	РемонтыЗаявки.Ссылка.Комментарий КАК КомментЗаявка,
	|	РемонтыЗаявки.Ссылка.Ответственный КАК Ответственный,
	|	Ремонты.ИД КАК ИД,
	|	Ремонты.Док КАК Док,
	|	Ремонты.Док.гкс_НуженОстанов КАК Флаг1,
	|	Ремонты.Док.гкс_НуженПодготовка КАК Флаг2,
	|	Ремонты.Док.гкс_РаботаПовышеннойОпасности КАК Флаг3,
	|	Ремонты.Док.гкс_НуженИспытание КАК Флаг4,
	|	ЕСТЬNULL(торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.Ссылка.Описание,
	|	ЕСТЬNULL(торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.Описание,
	|	ЕСТЬNULL(торо_ВыявленныеДефектыСписокДефектов.ДефектОписание, РемонтыЗаявки.гкс_ИмяТехКартыРемонта)))
	|	КАК ДефектОписание,
	|	Ремонты.ЕстьФайлы КАК ЕстьФайлы,
	// гкс+ [Релиз 1] Куст 
	|	ЕСТЬNULL(ИзМатрицы.КатегорияРиска, Ремонты.ОР.гкс_КатегорияРиска) КАК Приоритет,
	// гкс- [Релиз 1] Куст 
	|	Ремонты.Акт.Комментарий КАК Комментарий,
	|	Ремонты.ОР.ТиповойОР КАК ТОР,
	|	ДокументыОснования.ОтветственныйДО КАК ОтветственныйДО,
	|	ДокументыОснования.ДатаДО КАК ДатаДО,
	|	РемонтыЗаявки.ВидРемонтныхРабот КАК ВидРабот,
	|	РемонтыЗаявки.ДатаНачала КАК ДатаНачала,
	|	РемонтыЗаявки.ДатаОкончания КАК ДатаОкончания,
	|	гкс_ТехническиеМеста.Отметка КАК Отметка,
	|	гкс_ТехническиеМеста.Участок КАК Участок,
	|	гкс_ТехническиеМеста.ЗаводПодразделение КАК Завод,
	|	гкс_ТехническиеМеста.МестоПлощадка КАК Место
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК РемонтыЗаявки
	|		ПО Ремонты.Док = РемонтыЗаявки.Ссылка
	|			И Ремонты.ИД = РемонтыЗаявки.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ВыявленныеДефекты.РезультатыПодбораИзМатрицыОценкиРисков КАК ИзМатрицы
	|			ПО торо_ВыявленныеДефектыСписокДефектов.Ссылка = ИзМатрицы.Ссылка
	|				И торо_ВыявленныеДефектыСписокДефектов.ID = ИзМатрицы.ID_Ремонта
	|				И (ИзМатрицы.РезультатВыбора = ИСТИНА)
	|		ПО Ремонты.ИД = торо_ВыявленныеДефектыСписокДефектов.ID
	|			И (торо_ВыявленныеДефектыСписокДефектов.Ссылка.ПометкаУдаления = ЛОЖЬ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ВнешнееОснованиеДляРабот.ОбследованноеОборудование 
	|	КАК торо_ВнешнееОснованиеДляРаботОбследованноеОборудование
	|		ПО Ремонты.ИД = торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.ID
	|			И (торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.Ссылка.ПометкаУдаления = ЛОЖЬ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыОснования КАК ДокументыОснования
	|		ПО Ремонты.Док = ДокументыОснования.Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_ТекущиеФМОР КАК гкс_ТекущиеФМОР
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гкс_ТехническиеМеста КАК гкс_ТехническиеМеста
	|			ПО (гкс_ТекущиеФМОР.ОР = гкс_ТекущиеФМОР.ФМ
	|						И гкс_ТекущиеФМОР.ТМ = гкс_ТехническиеМеста.Ссылка
	|					ИЛИ НЕ гкс_ТекущиеФМОР.ОР = гкс_ТекущиеФМОР.ФМ
	|						И гкс_ТекущиеФМОР.ТМФМ = гкс_ТехническиеМеста.Ссылка)
	|		ПО Ремонты.ОР = гкс_ТекущиеФМОР.ОР
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ЗаявкаНаРемонтТрудовыеЗатраты.Квалификация КАК Квалификация,
	|	торо_ЗаявкаНаРемонтТрудовыеЗатраты.Количество КАК Количество,
	|	Ремонты.ИД КАК ИД,
	|	Ремонты.Док КАК Док,
	|	торо_ЗаявкаНаРемонтТрудовыеЗатраты.ID КАК ИДРР,
	|	торо_ЗаявкаНаРемонтТрудовыеЗатраты.ВремяРаботы КАК ВремяРаботы
	|ПОМЕСТИТЬ ТрудовыеЗатраты
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.ТрудовыеЗатраты КАК торо_ЗаявкаНаРемонтТрудовыеЗатраты
	// гкс+ [Релиз18] Деснол
	| " + ?(ЕстьОтборИсполнитель, "
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтныеРаботы КАК торо_ЗаявкаНаРемонтРемонтныеРаботы
	|			ПО торо_ЗаявкаНаРемонтРемонтныеРаботы.Ссылка = торо_ЗаявкаНаРемонтТрудовыеЗатраты.Ссылка
	|			И торо_ЗаявкаНаРемонтРемонтныеРаботы.ID = торо_ЗаявкаНаРемонтТрудовыеЗатраты.ID
	|			И торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтыОборудования_ID = торо_ЗаявкаНаРемонтТрудовыеЗатраты.РемонтыОборудования_ID
	|			И торо_ЗаявкаНаРемонтРемонтныеРаботы.Исполнитель В (&ОтборИсполнитель)
	| ", "") + "
	// гкс- [Релиз18]
	|		ПО Ремонты.Док = торо_ЗаявкаНаРемонтТрудовыеЗатраты.Ссылка
	|			И Ремонты.ИД = торо_ЗаявкаНаРемонтТрудовыеЗатраты.РемонтыОборудования_ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ремонты.ИД КАК ИД,
	|	торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтнаяРабота КАК РР,
	|	торо_ЗаявкаНаРемонтРемонтныеРаботы.гкс_Примечание КАК гкс_Примечание,
	|	торо_ЗаявкаНаРемонтРемонтныеРаботы.Количество КАК КолвоРР,
	|	торо_ЗаявкаНаРемонтРемонтныеРаботы.ID КАК ИДРР,
	|	ТрудовыеЗатраты.Квалификация КАК Квалификация,
	|	ЕСТЬNULL(ТрудовыеЗатраты.Количество, 0) КАК Количество,
	|	ЕСТЬNULL(ТрудовыеЗатраты.ВремяРаботы, 0) КАК ВремяРаботы
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтныеРаботы КАК торо_ЗаявкаНаРемонтРемонтныеРаботы
	|			ЛЕВОЕ СОЕДИНЕНИЕ ТрудовыеЗатраты КАК ТрудовыеЗатраты
	|			ПО торо_ЗаявкаНаРемонтРемонтныеРаботы.Ссылка = ТрудовыеЗатраты.Док
	|				И торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтыОборудования_ID = ТрудовыеЗатраты.ИД
	|				И торо_ЗаявкаНаРемонтРемонтныеРаботы.ID = ТрудовыеЗатраты.ИДРР
	|		ПО Ремонты.Док = торо_ЗаявкаНаРемонтРемонтныеРаботы.Ссылка
	|			И торо_ЗаявкаНаРемонтРемонтныеРаботы.гкс_СпособВыполнения = Значение(Перечисление.СпособыСтроительства.Подрядный)
	|			И Ремонты.ИД = торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтыОборудования_ID
	// гкс+ [Релиз18] Деснол
	| " + ?(ЕстьОтборИсполнитель, "
	|	И торо_ЗаявкаНаРемонтРемонтныеРаботы.Исполнитель В (&ОтборИсполнитель)
	| ", "") + "
	// гкс- [Релиз18]
	|
	|УПОРЯДОЧИТЬ ПО
	|	торо_ЗаявкаНаРемонтРемонтныеРаботы.НомерСтроки
	|ИТОГИ
	|	МАКСИМУМ(РР),
	|	МАКСИМУМ(КолвоРР),
	|	МАКСИМУМ(гкс_Примечание)
	|ПО
	|	ИД,
	|	ИДРР
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ЗаявкаНаРемонтМатериальныеЗатраты.Номенклатура КАК Номенклатура,
	// гкс+ [Релиз18] Деснол
	|	торо_ЗаявкаНаРемонтМатериальныеЗатраты.Номенклатура.Код КАК КодН,
	// гкс- [Релиз18]
	|	СУММА(ВЫБОР
	|			КОГДА торо_ЗаявкаНаРемонтМатериальныеЗатраты.гкс_Давальческие
	|				ТОГДА 0
	|			ИНАЧЕ торо_ЗаявкаНаРемонтМатериальныеЗатраты.Количество
	|		КОНЕЦ) КАК Колво,
	|	СУММА(ВЫБОР
	|			КОГДА торо_ЗаявкаНаРемонтМатериальныеЗатраты.гкс_Давальческие
	|				ТОГДА торо_ЗаявкаНаРемонтМатериальныеЗатраты.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Давал,
	|	ЕСТЬNULL(УпаковкиНоменклатуры.Ссылка, 
	|	торо_ЗаявкаНаРемонтМатериальныеЗатраты.Номенклатура.ЕдиницаИзмерения) КАК ЕдИзм,
	|	Ремонты.ИД КАК ИД
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.МатериальныеЗатраты 
	|	КАК торо_ЗаявкаНаРемонтМатериальныеЗатраты
	// гкс+ [Релиз18] Деснол
	| " + ?(ЕстьОтборИсполнитель, "
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтныеРаботы КАК торо_ЗаявкаНаРемонтРемонтныеРаботы
	|			ПО торо_ЗаявкаНаРемонтРемонтныеРаботы.Ссылка = торо_ЗаявкаНаРемонтМатериальныеЗатраты.Ссылка
	|			И торо_ЗаявкаНаРемонтРемонтныеРаботы.ID = торо_ЗаявкаНаРемонтМатериальныеЗатраты.ID
	|			И торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтыОборудования_ID = торо_ЗаявкаНаРемонтМатериальныеЗатраты.РемонтыОборудования_ID
	|			И торо_ЗаявкаНаРемонтРемонтныеРаботы.Исполнитель В (&ОтборИсполнитель)
	| ", "") + "
	// гкс- [Релиз18]
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
	|			ПО торо_ЗаявкаНаРемонтМатериальныеЗатраты.ЕдиницаИзмерения = УпаковкиНоменклатуры.Ссылка
	|		ПО Ремонты.Док = торо_ЗаявкаНаРемонтМатериальныеЗатраты.Ссылка
	|			И Ремонты.ИД = торо_ЗаявкаНаРемонтМатериальныеЗатраты.РемонтыОборудования_ID
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_ЗаявкаНаРемонтМатериальныеЗатраты.Номенклатура,
	|	ЕСТЬNULL(УпаковкиНоменклатуры.Ссылка, торо_ЗаявкаНаРемонтМатериальныеЗатраты.Номенклатура.ЕдиницаИзмерения),
	|	Ремонты.ИД
	|ИТОГИ ПО
	|	ИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ремонты.ИД КАК ИД,
	|	СУММА(торо_ЗаявкаНаРемонтИнструменты.Количество) КАК Колво,
	|	торо_ЗаявкаНаРемонтИнструменты.Инструмент КАК Номенклатура,
	// гкс+ [Релиз18] Деснол
	|	торо_ЗаявкаНаРемонтИнструменты.Инструмент.Код КАК КодН,
	// гкс- [Релиз18]
	|	ЕСТЬNULL(УпаковкиНоменклатуры.Ссылка, торо_ЗаявкаНаРемонтИнструменты.Инструмент.ЕдиницаИзмерения) КАК ЕдИзм
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.Инструменты КАК торо_ЗаявкаНаРемонтИнструменты
	// гкс+ [Релиз18] Деснол
	| " + ?(ЕстьОтборИсполнитель, "
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтныеРаботы КАК торо_ЗаявкаНаРемонтРемонтныеРаботы
	|			ПО торо_ЗаявкаНаРемонтРемонтныеРаботы.Ссылка = торо_ЗаявкаНаРемонтИнструменты.Ссылка
	|			И торо_ЗаявкаНаРемонтРемонтныеРаботы.ID = торо_ЗаявкаНаРемонтИнструменты.ID
	|			И торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтыОборудования_ID = торо_ЗаявкаНаРемонтИнструменты.РемонтыОборудования_ID
	|			И торо_ЗаявкаНаРемонтРемонтныеРаботы.Исполнитель В (&ОтборИсполнитель)
	| ", "") + "
	// гкс- [Релиз18]
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
	|			ПО торо_ЗаявкаНаРемонтИнструменты.Ссылка = УпаковкиНоменклатуры.Ссылка
	|		ПО Ремонты.Док = торо_ЗаявкаНаРемонтИнструменты.Ссылка
	|			И Ремонты.ИД = торо_ЗаявкаНаРемонтИнструменты.РемонтыОборудования_ID
	|
	|СГРУППИРОВАТЬ ПО
	|	Ремонты.ИД,
	|	торо_ЗаявкаНаРемонтИнструменты.Инструмент,
	|	ЕСТЬNULL(УпаковкиНоменклатуры.Ссылка, торо_ЗаявкаНаРемонтИнструменты.Инструмент.ЕдиницаИзмерения)
	|ИТОГИ ПО
	|	ИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ЗаявкаНаРемонтИсполнителиПоРемонтам.Исполнитель КАК Исполнитель,
	|	Ремонты.ИД КАК ИД,
	|	торо_ЗаявкаНаРемонтИсполнителиПоРемонтам.УточнениеИсполнителя КАК УточнениеИсполнителя
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.ИсполнителиПоРемонтам 
	|	КАК торо_ЗаявкаНаРемонтИсполнителиПоРемонтам
	|		ПО Ремонты.Док = торо_ЗаявкаНаРемонтИсполнителиПоРемонтам.Ссылка
	|			И Ремонты.ИД = торо_ЗаявкаНаРемонтИсполнителиПоРемонтам.РемонтыОборудования_ID
	// гкс+ [Релиз18] Деснол
	| " + ?(ЕстьОтборИсполнитель, "
	|	И торо_ЗаявкаНаРемонтИсполнителиПоРемонтам.Исполнитель В (&ОтборИсполнитель)
	| ", "") + "
	// гкс- [Релиз18]
	|ИТОГИ ПО
	|	ИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ремонты.ИД КАК ИД,
	|	торо_ИсторияСтатусовСогласованияДокументовСрезПоследних.Пользователь КАК Пользователь,
	|	торо_ИсторияСтатусовСогласованияДокументовСрезПоследних.Период КАК Дата
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИсторияСтатусовСогласованияДокументов.СрезПоследних(
	|				,
	|				СтатусДокумента = &СтатусСогласован
	|					И СогласуемыйДокумент В
	|						(ВЫБРАТЬ
	|							ТЧ.Док
	|						ИЗ
	|							Ремонты КАК ТЧ)) КАК торо_ИсторияСтатусовСогласованияДокументовСрезПоследних
	|		ПО Ремонты.Док = торо_ИсторияСтатусовСогласованияДокументовСрезПоследних.СогласуемыйДокумент
	// гкс+ [] Деснол 16.09.2022
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ
	// гкс- [] Деснол 16.09.2022
	|ИТОГИ ПО
	|	ИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ремонты.ИД КАК ИД,
	|	МАКСИМУМ(ЕСТЬNULL(торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала, ДАТАВРЕМЯ(1, 1, 1))) КАК ДатаНачала,
	|	МАКСИМУМ(ЕСТЬNULL(торо_АктуальныеПлановыеДатыРемонтов.ДатаОкончания, ДАТАВРЕМЯ(1, 1, 1))) КАК ДатаОкончания
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК торо_АктуальныеПлановыеДатыРемонтов
	|		ПО Ремонты.ИД = торо_АктуальныеПлановыеДатыРемонтов.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОтмененныеРемонты.СрезПоследних КАК торо_ОтмененныеРемонтыСрезПоследних
	|		ПО Ремонты.ИД = торо_ОтмененныеРемонтыСрезПоследних.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних 
	|	КАК торо_ПлановыеРемонтныеРаботыСрезПоследних
	|		ПО Ремонты.ИД = торо_ПлановыеРемонтныеРаботыСрезПоследних.ID
	|			И (торо_ПлановыеРемонтныеРаботыСрезПоследних.Отменен = ИСТИНА
	|				ИЛИ торо_ПлановыеРемонтныеРаботыСрезПоследних.Замещен = ИСТИНА)
	|ГДЕ
	|	торо_ОтмененныеРемонтыСрезПоследних.Регистратор ЕСТЬ NULL
	|	И торо_ПлановыеРемонтныеРаботыСрезПоследних.Регистратор ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	Ремонты.ИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ремонты.ИД КАК ИД,
	|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтнаяРабота КАК РР,
	|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.гкс_Примечание КАК гкс_Примечание,
	|	ЕСТЬNULL(торо_АктОВыполненииЭтапаРаботТрудовыеЗатраты.ВремяРаботы, 0) КАК ВремяРаботы
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтныеРаботы 
	|	КАК торо_АктОВыполненииЭтапаРаботРемонтныеРаботы
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.ТрудовыеЗатраты 
	|	КАК торо_АктОВыполненииЭтапаРаботТрудовыеЗатраты
	|			ПО торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтыОборудования_ID = 
	|	торо_АктОВыполненииЭтапаРаботТрудовыеЗатраты.РемонтыОборудования_ID
	|				И торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.ID = 
	|	торо_АктОВыполненииЭтапаРаботТрудовыеЗатраты.ID
	|		ПО Ремонты.Акт = торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Ссылка
	|			И Ремонты.ИД = торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтыОборудования_ID
	|			И (торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.НоваяОперация = ИСТИНА)
	// гкс+ [Релиз18] Деснол
	| " + ?(ЕстьОтборИсполнитель, "
	|	И торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Исполнитель В (&ОтборИсполнитель)
	| ", "") + "
	// гкс- [Релиз18]
	|ИТОГИ
	|	СУММА(ВремяРаботы),
	|	Максимум(гкс_Примечание)
	|ПО
	|	ИД,
	|	РР
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ремонты.ИД КАК ИД,
	|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Номенклатура КАК Номенклатура,
	|	СУММА(торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Количество) КАК Колво,
	|	ЕСТЬNULL(УпаковкиНоменклатуры.Наименование, 
	|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Номенклатура.ЕдиницаИзмерения) КАК ЕдИзм
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтныеРаботы 
	|	КАК торо_АктОВыполненииЭтапаРаботРемонтныеРаботы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.МатериальныеЗатраты 
	|	КАК торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
	|				ПО торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.ЕдиницаИзмерения = УпаковкиНоменклатуры.Ссылка
	|			ПО торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Ссылка = торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Ссылка
	|				И торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтыОборудования_ID = 
	|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.РемонтыОборудования_ID
	|				И торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.ID = торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.ID
	|		ПО Ремонты.Акт = торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Ссылка
	|			И Ремонты.ИД = торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтыОборудования_ID
	|			И (торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.НоваяОперация = ИСТИНА)
	// гкс+ [Релиз18] Деснол
	| " + ?(ЕстьОтборИсполнитель, "
	|	И торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Исполнитель В (&ОтборИсполнитель)
	| ", "") + "
	// гкс- [Релиз18]
	|
	|СГРУППИРОВАТЬ ПО
	|	Ремонты.ИД,
	|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Номенклатура,
	|	ЕСТЬNULL(УпаковкиНоменклатуры.Наименование, 
	|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Номенклатура.ЕдиницаИзмерения)
	|ИТОГИ ПО
	|	ИД" ;	
	ЗапросДокументов.УстановитьПараметр("Ссылка", МассивОбъектов);
	ЗапросДокументов.УстановитьПараметр("СтатусСогласован", 
		Справочники.торо_СтатусыСогласованияДокументовРемонтныхРабот.Согласован);
	// гкс+ [Релиз18] Деснол 
	ЗапросДокументов.УстановитьПараметр("ОтборИсполнитель", ОтборИсполнитель);
	// гкс- [Релиз18]
	Если ПараметрыПечати.Свойство("МассивID") Тогда
		ЗапросДокументов.УстановитьПараметр("ID", ПараметрыПечати.МассивID);
	Иначе
		ЗапросДокументов.Текст = СтрЗаменить(ЗапросДокументов.Текст, 
		"торо_ЗаявкаНаРемонтРемонтыОборудования.ID В(&ID)", "Истина");
	КонецЕсли;
	
	ЭтоПервый = Истина;
	
	ИндексВыборкиСДокументами = 4;
	ИндексВыборкиСРемонтнымиРаботами = 6;
	ИндексВыборкиСМатериальнымиЗатратами = 7;
	ИндексВыборкиСИнструментами = 8;
	ИндексВыборкиСИсполнителями = 9;
	ИндексВыборкиССогласующими = 10;
	ИндексВыборкиСАктуальнымиПериодами = 11;
	ИндексВыборкиСРемонтнымиРаботамиАкта = 12;
	ИндексВыборкиСМатериальнымиЗатратамиАкта = 13;
	
	РезультатЗапроса = ЗапросДокументов.ВыполнитьПакет();
	ВыборкаДокументов = РезультатЗапроса[ИндексВыборкиСДокументами].Выбрать();
	ВыборкаИДРР = РезультатЗапроса[ИндексВыборкиСРемонтнымиРаботами].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаМЗ = РезультатЗапроса[ИндексВыборкиСМатериальнымиЗатратами].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаИн = РезультатЗапроса[ИндексВыборкиСИнструментами].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаИспол = РезультатЗапроса[ИндексВыборкиСИсполнителями].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаСогл = РезультатЗапроса[ИндексВыборкиССогласующими].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаАктуальные = 
	РезультатЗапроса[ИндексВыборкиСАктуальнымиПериодами].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаРРАкта = 
	РезультатЗапроса[ИндексВыборкиСРемонтнымиРаботамиАкта].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаМЗАкта = 
	РезультатЗапроса[ИндексВыборкиСМатериальнымиЗатратамиАкта].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаДокументов.Следующий() Цикл
		Если НЕ ЭтоПервый Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ЭтоПервый = Ложь;
		
		Если ВыборкаСогл.НайтиСледующий(Новый Структура("ИД",ВыборкаДокументов.ИД)) Тогда 
			Выборка = ВыборкаСогл.Выбрать();
			Если Выборка.Следующий() Тогда 
				Шапка.Параметры.Утвердил = ПреобразоватьФИО(Выборка.Пользователь);
				Шапка.Параметры.ДатаУтверждения = Выборка.Дата + (СдвигЧП * 3600);
			КонецЕсли;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Шапка.Параметры,ВыборкаДокументов);
		Шапка.Параметры.Ответственный = ПреобразоватьФИО(ВыборкаДокументов.ОтветственныйДО);
		Шапка.Параметры.Дата = ВыборкаДокументов.ДатаДО + (СдвигЧП * 3600);
		Если ЗначениеЗаполнено(ВыборкаДокументов.Отметка) = Ложь Тогда 
			Шапка.Параметры.Отметка = "0,000";
		Иначе
			Шапка.Параметры.Отметка = Формат(ВыборкаДокументов.Отметка, "ЧДЦ=3");
		КонецЕсли;
		НовыйСиноним = " Техническое задание  " + ВыборкаДокументов.НарядЗаданиеНомер;
		Подвал.Параметры.ТОР = ВыборкаДокументов.ТОР;
		Подвал.Параметры.КомментарийАкта = ВыборкаДокументов.Комментарий;
		Подвал.Параметры.Ответственный = ВыборкаДокументов.Ответственный;
		Подвал.Параметры.Дата = ВыборкаДокументов.Дата + (СдвигЧП * 3600);
		ТабДокумент.Вывести(Шапка);
		
		Итог1 = 0; Итог2 = 0;
		Если ВыборкаИДРР.НайтиСледующий(Новый Структура("ИД",ВыборкаДокументов.ИД)) Тогда 
			Выборка = ВыборкаИДРР.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока Выборка.Следующий() Цикл
				СтрокаРР.Параметры.РР = Строка(Выборка.РР) + " " + Выборка.гкс_Примечание;
				СтрокаРР.Параметры.КолвоРР = Выборка.КолвоРР;
				
				НуженВывод = Истина;
				ВыборкаТЗ = Выборка.Выбрать();
				Пока ВыборкаТЗ.Следующий() Цикл
					СтрокаРР.Параметры.Квалификация = ВыборкаТЗ.Квалификация;
					СтрокаРР.Параметры.Колво = ВыборкаТЗ.Количество;
					План = ВыборкаТЗ.ВремяРаботы / 60;
					Итог1 = Итог1 + (План * ВыборкаТЗ.Количество);
					Если План = Цел(План) Тогда 
						План = Строка(План);
					КонецЕсли;
					СтрокаРР.Параметры.План = План;
					ТабДокумент.Вывести(СтрокаРР);
					НуженВывод = Ложь;
					СтрокаРР.Параметры.КолвоРР = "";
					СтрокаРР.Параметры.Квалификация = "";
					СтрокаРР.Параметры.Колво = "";
					СтрокаРР.Параметры.План = "";
					СтрокаРР.Параметры.РР = "";
				КонецЦикла;
				Если НуженВывод Тогда 
					ТабДокумент.Вывести(СтрокаРР);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Итог2 = (ВыборкаДокументов.ДатаОкончания - ВыборкаДокументов.ДатаНачала) / 60;
		
		Если Итог1 = Цел(Итог1) Тогда 
			Итог1 = Строка(Итог1);
		КонецЕсли;
		Если Итог2 = Цел(Итог2) Тогда 
			Итог2 = Строка(Итог2);
		КонецЕсли;
		ПодвалРР.Параметры.Итог1 = Итог1;
		ПодвалРР.Параметры.Итог2 = Итог2;
		ТабДокумент.Вывести(ПодвалРР);
		
		Если ВыборкаМЗ.НайтиСледующий(Новый Структура("ИД",ВыборкаДокументов.ИД)) Тогда 
			Выборка = ВыборкаМЗ.Выбрать();
			Пока Выборка.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(СтрокаМЗ.Параметры,Выборка);
				ТабДокумент.Вывести(СтрокаМЗ);
			КонецЦикла;
		КонецЕсли;
		ВыборкаМЗ.Сбросить();
		
		ТабДокумент.Вывести(ШапкаИнструменты);
		Если ВыборкаИн.НайтиСледующий(Новый Структура("ИД",ВыборкаДокументов.ИД)) Тогда 
			Выборка = ВыборкаИн.Выбрать();
			Пока Выборка.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(СтрокаИнструменты.Параметры,Выборка);
				ТабДокумент.Вывести(СтрокаИнструменты);
			КонецЦикла;
		КонецЕсли;
		ВыборкаИн.Сбросить();
		
		Если ВыборкаИспол.НайтиСледующий(Новый Структура("ИД",ВыборкаДокументов.ИД)) Тогда 
			Выборка = ВыборкаИспол.Выбрать();
			Если Выборка.Следующий() Тогда 
				Подвал.Параметры.Исполнитель = Выборка.Исполнитель;
				Если ТипЗнч(Выборка.Исполнитель) = Тип("СправочникСсылка.Контрагенты") Тогда 
					Подвал.Параметры.Договор = Выборка.УточнениеИсполнителя;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		ВыборкаИспол.Сбросить();
		
		ТемпТекст = "";
		Если ВыборкаРРАкта.НайтиСледующий(Новый Структура("ИД",ВыборкаДокументов.ИД)) Тогда 
			Выборка = ВыборкаРРАкта.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока Выборка.Следующий() Цикл
					ТемпТекст = ТемпТекст + ?(ЗначениеЗаполнено(ТемпТекст),", ","") 
				+ Выборка.РР + " " + Выборка.гкс_Примечание + "/ " +(Выборка.ВремяРаботы/60)+" мин.";
			КонецЦикла;
		КонецЕсли;
		Подвал.Параметры.СписокТО = ТемпТекст;
		ВыборкаРРАкта.Сбросить();
		
		ТемпТекст = "";
		Если ВыборкаМЗАкта.НайтиСледующий(Новый Структура("ИД",ВыборкаДокументов.ИД)) Тогда 
			Выборка = ВыборкаМЗАкта.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока Выборка.Следующий() Цикл
				ТемпТекст = ТемпТекст + ?(ЗначениеЗаполнено(ТемпТекст),", ","") 
				+ Выборка.Номенклатура + "/ " +Выборка.Колво +" "+Выборка.ЕдИзм+".";
			КонецЦикла;
		КонецЕсли;
		Подвал.Параметры.МатЗатраты = ТемпТекст;
		ВыборкаМЗАкта.Сбросить();
		
		Подвал.Параметры.СмФайлы = ВыборкаДокументов.КомментЗаявка;
		Если ВыборкаДокументов.ЕстьФайлы Тогда 
			Подвал.Параметры.СмФайлы = Подвал.Параметры.СмФайлы + Символы.ПС
			+  "См. вложенные файлы";
		КонецЕсли;
		
		ТабДокумент.Вывести(Подвал);
	КонецЦикла;
	
	// Зададим параметры макета
	ТабДокумент.АвтоМасштаб	= Истина;
	ТабДокумент.ПолеСверху  = 0;
	ТабДокумент.ПолеСлева   = 0;
	ТабДокумент.ПолеСнизу   = 0;
	ТабДокумент.ПолеСправа  = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабДокумент.ТолькоПросмотр = Истина;
	
	Возврат ТабДокумент;
КонецФункции

Функция ПреобразоватьФИО(Сотрудник)
	ИндексПервойЧастиИмени = 0;
	ИндексВторойЧастиИмени = 1;
	ИндексТретейЧастиИмени = 2;
	МассивИмени = СтрРазделить(Строка(Сотрудник), " ", Ложь);
	Если МассивИмени.Количество() > 2 Тогда 
		Возврат МассивИмени[ИндексПервойЧастиИмени] 
		+ " " + Лев(МассивИмени[ИндексВторойЧастиИмени], 1) 
		+ ". " + Лев(МассивИмени[ИндексТретейЧастиИмени], 1) + ".";
	КонецЕсли;
	Возврат Сотрудник;
КонецФункции

Функция Печатьгкс_ДефектныйАкт(МассивОбъектов, ПараметрыПечати)

	Макет  = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_АктОВыполненииЭтапаРабот.ПФ_MXL_гкс_ДефектныйАкт");
	// гкс+ [05.23] Деснол 10.05.2023
	Если ПараметрыПечати.Свойство("РанееУстановленное") Тогда
		Макет  = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_АктОВыполненииЭтапаРабот.ПФ_MXL_гкс_АктНаУстановленное");
	КонецЕсли;
	// гкс- [05.23] Деснол 10.05.2023
	ТабДокумент = Новый ТабличныйДокумент;
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ДопКомиссия = Макет.ПолучитьОбласть("ДопКомиссия");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	// гкс+ [Релиз16] Деснол
	ПодвалСтрока = Макет.ПолучитьОбласть("ПодвалСтрока");
	// гкс- [Релиз16]
	СдвигЧП = Час(ТекущаяДатаСеанса()) - Час(ТекущаяДата());

	ЗапросДокументов = Новый Запрос;
	ЗапросДокументов.Текст = 
	"ВЫБРАТЬ
	|	ДокументАктОВыполненииЭтапаРабот.Ссылка КАК Ссылка,
	|	ДокументАктОВыполненииЭтапаРабот.Организация КАК Организация,
	|	ДокументАктОВыполненииЭтапаРабот.Номер КАК Номер,
	|	ДокументАктОВыполненииЭтапаРабот.Дата КАК Дата,
	|	ДокументАктОВыполненииЭтапаРабот.Комиссия КАК Комиссия
	// гкс+ [Комиссия] Куст 
	|	,ДокументАктОВыполненииЭтапаРабот.Комиссия.гкс_ДатаПриказа КАК ДатаПриказа,
	|	ДокументАктОВыполненииЭтапаРабот.Комиссия.гкс_НомерПриказа КАК НомерПриказа
	// гкс- [Комиссия] Куст 
	|ПОМЕСТИТЬ ВТ_ДанныеДокумента
	|ИЗ
	|	Документ.торо_АктОВыполненииЭтапаРабот КАК ДокументАктОВыполненииЭтапаРабот
	|ГДЕ
	|	ДокументАктОВыполненииЭтапаРабот.Ссылка В(&Ссылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	// гкс+ [8181] Тарасов 
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ДанныеДокумента.Ссылка КАК Ссылка,
	|	РемонтныеРаботыТЧ.НомерСтроки КАК НомерСтроки,
	|	РемонтныеРаботыТЧ.РемонтнаяРабота КАК РемонтнаяРабота,
	|	ПРЕДСТАВЛЕНИЕ(РемонтныеРаботыТЧ.РемонтнаяРабота) КАК РемонтнаяРаботаПредставление
	|ИЗ
	|	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтныеРаботы КАК РемонтныеРаботыТЧ
	|		ПО (ВТ_ДанныеДокумента.Ссылка = РемонтныеРаботыТЧ.Ссылка)
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(РемонтныеРаботыТЧ.РемонтнаяРабота) = ТИП(Справочник.торо_ИдентификаторыТехКарт)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	// гкс- [8181] Тарасов
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка,
	|	Док.Организация КАК Организация,
	// гкс+ [Комиссия] Куст 
	|	Док.ДатаПриказа КАК ДатаПриказа,
	|	Док.НомерПриказа КАК НомерПриказа,
	// гкс- [Комиссия] Куст 
	|	РемТЧ.ОбъектРемонта КАК ОР,
	|	КомТЧ.ЧленКомиссии КАК Комиссия,
	|	КомТЧ.Ссылка.Председатель КАК Председатель,
	// гкс+ [2021] Куст 
	|	ЕСТЬNULL(РегВД.ДефектОписание, ЕСТЬNULL(РегВО.Описание, """")) КАК Описание,
	// гкс- [2021] Куст 	
	|	Док.Номер КАК Номер,
	|	Док.Дата КАК Дата
	|ИЗ
	|	ВТ_ДанныеДокумента КАК Док
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК РемТЧ
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВыявленныеДефекты КАК РегВД
	|			ПО (РегВД.ID = РемТЧ.ID)
	// гкс+ [2021] Куст 
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВнешниеОснованияДляРабот.СрезПоследних() КАК РегВО
	|			ПО (РегВО.ID = РемТЧ.ID)
	// гкс- [2021] Куст 
	|		ПО (РемТЧ.Ссылка = Док.Ссылка)
	|			И (РемТЧ.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_Комиссии.СоставКомиссии КАК КомТЧ
	|		ПО (КомТЧ.Ссылка = Док.Комиссия)
	|
	|ИТОГИ ПО
	|	Ссылка";
	// гкс+ [Релиз16] Деснол
	ЗапросДокументов.Текст = ЗапросДокументов.Текст + " ; "
+ "
|Выбрать
|Документторо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Ссылка КАК Ссылка,
|Документторо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Номенклатура КАК Номенклатура,
|Документторо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Номенклатура.Код КАК Код,
|Документторо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Количество КАК Колво,
|Документторо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.ЕдиницаИзмерения КАК Упаковка,
|Документторо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Номенклатура.ЕдиницаИзмерения КАК ЕдИзм
|ИЗ
|	Документ.торо_АктОВыполненииЭтапаРабот.МатериальныеЗатраты КАК Документторо_АктОВыполненииЭтапаРаботМатериальныеЗатраты
|ГДЕ
|	Документторо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Ссылка В (&Ссылка)
|Итоги ПО Ссылка
|";
	НомерПакетаРемРаботы = 1;
	НомерПакетаОсновной = НомерПакетаРемРаботы + 1;
	НомерПакетаТМЦ = НомерПакетаОсновной + 1;
	// гкс- [Релиз16]
	
	ЗапросДокументов.УстановитьПараметр("Ссылка", МассивОбъектов);
	
	МассивРезультатовЗапроса = ЗапросДокументов.ВыполнитьПакет();
	
	// гкс+ [Релиз16] Деснол
	ВыборкаРемонтныеРаботы = МассивРезультатовЗапроса[НомерПакетаРемРаботы].Выбрать();
	ВыборкаТМЦДок = МассивРезультатовЗапроса[НомерПакетаТМЦ].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Выборка = МассивРезультатовЗапроса[НомерПакетаОсновной].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	// гкс- [Релиз16]
	ЭтоПервый = Истина;
	Пока Выборка.Следующий() Цикл
		Если НЕ ЭтоПервый Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ЭтоПервый = Ложь;
		//
		НомерПП = 0;
		ВыборкаК = Выборка.Выбрать();
		Пока ВыборкаК.Следующий() Цикл
			Если НомерПП = 0 Тогда 
				Шапка.Параметры.Организация = ВыборкаК.Организация;
				// гкс+ [Комиссия] Куст 
				ЗаполнитьЗначенияСвойств(Шапка.Параметры, ВыборкаК);
				Шапка.Параметры.ДатаПриказа = Формат(ВыборкаК.ДатаПриказа, "ДЛФ=Д");
				// гкс- [Комиссия] Куст 
				Шапка.Параметры.Номер = ВыборкаК.Номер;
				// гкс+ [2021] Куст 
				Шапка.Параметры.Дата = Формат(ВыборкаК.Дата, "ДФ=дд.ММ.гггг");
				// гкс- [2021] Куст 
				Шапка.Параметры.ОР = ВыборкаК.ОР;
				Шапка.Параметры.Председатель = ВыборкаК.Председатель;
				// гкс+ [05.23] Деснол 10.05.2023
				ПараметрыПодвала = Новый Структура("ОР,ОписаниеДефекта", ВыборкаК.ОР, ВыборкаК.Описание);
				ЗаполнитьЗначенияСвойств(Подвал.Параметры, ПараметрыПодвала);
				// гкс- [05.23] Деснол 10.05.2023
				Шапка.Параметры.Комиссия = ВыборкаК.Комиссия;
				ТабДокумент.Вывести(Шапка);
			Иначе
				ДопКомиссия.Параметры.Комиссия = ВыборкаК.Комиссия;
				ТабДокумент.Вывести(ДопКомиссия);
			КонецЕсли;
			НомерПП = НомерПП + 1;
		КонецЦикла;
		// гкс+ [8181] Тарасов 
		// Получаем список Тех карт через запятую
		СписокТехКарт = "";
		СтркутураПоиска = Новый Структура("Ссылка", Выборка.Ссылка);
		Пока ВыборкаРемонтныеРаботы.НайтиСледующий(СтркутураПоиска) Цикл
			СписокТехКарт = СписокТехКарт+""+ВыборкаРемонтныеРаботы.РемонтнаяРаботаПредставление+", ";
		КонецЦикла;
		ВыборкаРемонтныеРаботы.Сбросить();
		СписокТехКарт = СокрЛП(СписокТехКарт);
		СписокТехКарт = СокрЛП(Лев(СписокТехКарт, СтрДлина(СписокТехКарт) - 1));
		
		Подвал.Параметры.СписокТехКарт = СписокТехКарт;
		// гкс- [8181] Тарасов 
		
		ТабДокумент.Вывести(Подвал);
		// гкс+ [Релиз16] Деснол
		ВыборкаТМЦДок.Сбросить();
		Если ВыборкаТМЦДок.НайтиСледующий(Новый Структура("Ссылка", Выборка.Ссылка)) Тогда 
			ВыборкаТМЦ = ВыборкаТМЦДок.Выбрать();
			Пока ВыборкаТМЦ.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(ПодвалСтрока.Параметры, ВыборкаТМЦ);
				Если ЗначениеЗаполнено(ВыборкаТМЦ.Упаковка) Тогда 
					ПодвалСтрока.Параметры.ЕдИзм = ВыборкаТМЦ.Упаковка;
				Иначе
					ПодвалСтрока.Параметры.ЕдИзм = ВыборкаТМЦ.ЕдИзм;
				КонецЕсли;
				ТабДокумент.Вывести(ПодвалСтрока);
			КонецЦикла;
		КонецЕсли;
		// гкс- [Релиз16]
	КонецЦикла;
	
	// Зададим параметры макета
	ТабДокумент.АвтоМасштаб	= Истина;
	ТабДокумент.ПолеСверху  = 0;
	ТабДокумент.ПолеСлева   = 0;
	ТабДокумент.ПолеСнизу   = 0;
	ТабДокумент.ПолеСправа  = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабДокумент.ТолькоПросмотр = Истина;
	
	Возврат ТабДокумент;
КонецФункции // гкс- [Релиз 1] Куст 

// гкс+ [2021] Куст 
Функция гкс_ПечатьОбъемРабот(МассивОбъектов, ПараметрыПечати, НовыйСиноним)

	Макет  = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_ЗаявкаНаРемонт.ПФ_MXL_дс_НарядЗадание");
	ТабДокумент = Новый ТабличныйДокумент;
	Шапка = Макет.ПолучитьОбласть("Шапка2");
	СтрокаРР = Макет.ПолучитьОбласть("СтрокаРР");
	ПодвалРР = Макет.ПолучитьОбласть("ПодвалРР");
	СтрокаМЗ = Макет.ПолучитьОбласть("СтрокаМЗ");
	ШапкаИнструменты = Макет.ПолучитьОбласть("ШапкаИнструменты");
	СтрокаИнструменты = Макет.ПолучитьОбласть("СтрокаИнструменты");
	Подвал = Макет.ПолучитьОбласть("Подвал2");
	СдвигЧП = Час(ТекущаяДатаСеанса()) - Час(ТекущаяДата());

	ЗапросДокументов = Новый Запрос;
	ЗапросДокументов.Текст = 
	"ВЫБРАТЬ
	|	ДокОснования.Ссылка КАК Ссылка,
	|	ЕстьNull(ДокНаряд.ДокументОснование,ДокОснования.ДокументОснование) КАК ДокументОснование
	|ПОМЕСТИТЬ НужныеОснования
	|ИЗ
	|	Документ.торо_АктОВыполненииЭтапаРабот.ДокументыОснования КАК ДокОснования
	|	Левое Соединение Документ.торо_НарядНаВыполнениеРемонтныхРабот.ДокументыОснования КАК ДокНаряд
	|	ПО ДокНаряд.Ссылка = ДокОснования.ДокументОснование И ДокНаряд.ДокументОснование Ссылка Документ.торо_ЗаявкаНаРемонт
	|ГДЕ
	|	ДокОснования.Ссылка В(&Ссылка)
	|;
	| ВЫБРАТЬ
	|	ДокОснования.Ссылка КАК Акт,
	|	АктРемонты.ID КАК ИД,
	|	ДокОснования.ДокументОснование КАК Основание
	|ПОМЕСТИТЬ АктИОснование
	|ИЗ
	|	НужныеОснования КАК ДокОснования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК АктРемонты
	|		ПО (АктРемонты.Ссылка = ДокОснования.Ссылка)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ОбъектРемонта КАК ОР,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ID КАК ИД,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка КАК Док,
	|	АктРемонты.Акт КАК Акт,
	|	МАКСИМУМ(НЕ торо_ЗаявкаНаРемонтПрисоединенныеФайлы.Ссылка ЕСТЬ NULL) КАК ЕстьФайлы
	|ПОМЕСТИТЬ Ремонты
	|ИЗ
	|	АктИОснование КАК АктРемонты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК торо_ЗаявкаНаРемонтРемонтыОборудования
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ЗаявкаНаРемонтПрисоединенныеФайлы КАК торо_ЗаявкаНаРемонтПрисоединенныеФайлы
	|			ПО торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка = торо_ЗаявкаНаРемонтПрисоединенныеФайлы.ВладелецФайла
	|		ПО (торо_ЗаявкаНаРемонтРемонтыОборудования.ID = АктРемонты.ИД)
	|			И АктРемонты.Основание = торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка
	|ГДЕ
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ID В(&ID)
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ОбъектРемонта,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ID,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка,
	|	АктРемонты.Акт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(торо_ЗаявкаНаРемонтДокументыОснования.ДокументОснование.Ответственный) КАК ОтветственныйДО,
	|	МАКСИМУМ(торо_ЗаявкаНаРемонтДокументыОснования.ДокументОснование.Дата) КАК ДатаДО,
	|	Ремонты.Док КАК Док
	|ПОМЕСТИТЬ ДокументыОснования
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.ДокументыОснования КАК торо_ЗаявкаНаРемонтДокументыОснования
	|		ПО Ремонты.Док = торо_ЗаявкаНаРемонтДокументыОснования.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Ремонты.Док
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Ремонты.ОР КАК ОР,
	|	Ремонты.ОР.ИнвентарныйНомер КАК ИнвНомер,
	|	Ремонты.ОР.ТехНомер КАК ТехНомер,
	|	Ремонты.ОР.Организация КАК Организация,
	|	Ремонты.ОР.Направление КАК Специализация,
	|	РемонтыЗаявки.ОписаниеРемонта КАК НаправлениеНаУстранение,
	|	РемонтыЗаявки.Ссылка.Номер КАК НарядЗаданиеНомер,
	|	РемонтыЗаявки.Ссылка.Дата КАК Дата,
	|	РемонтыЗаявки.Ссылка.Комментарий КАК КомментЗаявка,
	|	РемонтыЗаявки.Ссылка.Ответственный КАК Ответственный,
	|	Ремонты.ИД КАК ИД,
	|	Ремонты.Док КАК Док,
	|	Ремонты.Док.гкс_НуженОстанов КАК Флаг1,
	|	Ремонты.Док.гкс_НуженПодготовка КАК Флаг2,
	|	Ремонты.Док.гкс_РаботаПовышеннойОпасности КАК Флаг3,
	|	Ремонты.Док.гкс_НуженИспытание КАК Флаг4,
	|	ЕСТЬNULL(торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.Ссылка.Описание,
	|	ЕСТЬNULL(торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.Описание,
	|	ЕСТЬNULL(торо_ВыявленныеДефектыСписокДефектов.ДефектОписание, РемонтыЗаявки.гкс_ИмяТехКартыРемонта)))
	|	КАК ДефектОписание,
	|	Ремонты.ЕстьФайлы КАК ЕстьФайлы,
	|	ЕСТЬNULL(ИзМатрицы.КатегорияРиска, Ремонты.ОР.гкс_КатегорияРиска) КАК Приоритет,
	|	Ремонты.Акт.Комментарий КАК Комментарий,
	|	Ремонты.ОР.ТиповойОР КАК ТОР,
	|	ДокументыОснования.ОтветственныйДО КАК ОтветственныйДО,
	|	ДокументыОснования.ДатаДО КАК ДатаДО,
	|	РемонтыЗаявки.ВидРемонтныхРабот КАК ВидРабот,
	|	РемонтыЗаявки.ДатаНачала КАК ДатаНачала,
	|	РемонтыЗаявки.ДатаОкончания КАК ДатаОкончания,
	|	гкс_ТехническиеМеста.Отметка КАК Отметка,
	|	гкс_ТехническиеМеста.Участок КАК Участок,
	|	гкс_ТехническиеМеста.ЗаводПодразделение КАК Завод,
	|	гкс_ТехническиеМеста.МестоПлощадка КАК Место
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК РемонтыЗаявки
	|		ПО Ремонты.Док = РемонтыЗаявки.Ссылка
	|			И Ремонты.ИД = РемонтыЗаявки.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ВыявленныеДефекты.РезультатыПодбораИзМатрицыОценкиРисков КАК ИзМатрицы
	|			ПО торо_ВыявленныеДефектыСписокДефектов.Ссылка = ИзМатрицы.Ссылка
	|				И торо_ВыявленныеДефектыСписокДефектов.ID = ИзМатрицы.ID_Ремонта
	|				И (ИзМатрицы.РезультатВыбора = ИСТИНА)
	|		ПО Ремонты.ИД = торо_ВыявленныеДефектыСписокДефектов.ID
	|			И (торо_ВыявленныеДефектыСписокДефектов.Ссылка.ПометкаУдаления = ЛОЖЬ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ВнешнееОснованиеДляРабот.ОбследованноеОборудование 
	|	КАК торо_ВнешнееОснованиеДляРаботОбследованноеОборудование
	|		ПО Ремонты.ИД = торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.ID
	|			И (торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.Ссылка.ПометкаУдаления = ЛОЖЬ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыОснования КАК ДокументыОснования
	|		ПО Ремонты.Док = ДокументыОснования.Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_ТекущиеФМОР КАК гкс_ТекущиеФМОР
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гкс_ТехническиеМеста КАК гкс_ТехническиеМеста
	|			ПО (гкс_ТекущиеФМОР.ОР = гкс_ТекущиеФМОР.ФМ
	|						И гкс_ТекущиеФМОР.ТМ = гкс_ТехническиеМеста.Ссылка
	|					ИЛИ НЕ гкс_ТекущиеФМОР.ОР = гкс_ТекущиеФМОР.ФМ
	|						И гкс_ТекущиеФМОР.ТМФМ = гкс_ТехническиеМеста.Ссылка)
	|		ПО Ремонты.ОР = гкс_ТекущиеФМОР.ОР
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ЗаявкаНаРемонтТрудовыеЗатраты.Квалификация КАК Квалификация,
	|	торо_ЗаявкаНаРемонтТрудовыеЗатраты.Количество КАК Количество,
	|	Ремонты.ИД КАК ИД,
	|	Ремонты.Док КАК Док,
	|	торо_ЗаявкаНаРемонтТрудовыеЗатраты.ID КАК ИДРР,
	|	торо_ЗаявкаНаРемонтТрудовыеЗатраты.ВремяРаботы КАК ВремяРаботы
	|ПОМЕСТИТЬ ТрудовыеЗатраты
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.ТрудовыеЗатраты КАК торо_ЗаявкаНаРемонтТрудовыеЗатраты
	|		ПО Ремонты.Док = торо_ЗаявкаНаРемонтТрудовыеЗатраты.Ссылка
	|			И Ремонты.ИД = торо_ЗаявкаНаРемонтТрудовыеЗатраты.РемонтыОборудования_ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ремонты.ИД КАК ИД,
	|	торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтнаяРабота КАК РР,
	|	торо_ЗаявкаНаРемонтРемонтныеРаботы.гкс_Примечание КАК гкс_Примечание,
	|	торо_ЗаявкаНаРемонтРемонтныеРаботы.Количество КАК КолвоРР,
	|	торо_ЗаявкаНаРемонтРемонтныеРаботы.ID КАК ИДРР,
	|	ТрудовыеЗатраты.Квалификация КАК Квалификация,
	|	ЕСТЬNULL(ТрудовыеЗатраты.Количество, 0) КАК Количество,
	|	ЕСТЬNULL(ТрудовыеЗатраты.ВремяРаботы, 0) КАК ВремяРаботы
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтныеРаботы КАК торо_ЗаявкаНаРемонтРемонтныеРаботы
	|			ЛЕВОЕ СОЕДИНЕНИЕ ТрудовыеЗатраты КАК ТрудовыеЗатраты
	|			ПО торо_ЗаявкаНаРемонтРемонтныеРаботы.Ссылка = ТрудовыеЗатраты.Док
	|				И торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтыОборудования_ID = ТрудовыеЗатраты.ИД
	|				И торо_ЗаявкаНаРемонтРемонтныеРаботы.ID = ТрудовыеЗатраты.ИДРР
	|		ПО Ремонты.Док = торо_ЗаявкаНаРемонтРемонтныеРаботы.Ссылка
	|			И Ремонты.ИД = торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтыОборудования_ID
	|
	|УПОРЯДОЧИТЬ ПО
	|	торо_ЗаявкаНаРемонтРемонтныеРаботы.НомерСтроки
	|ИТОГИ
	|	МАКСИМУМ(РР),
	|	МАКСИМУМ(КолвоРР),
	|	МАКСИМУМ(гкс_Примечание)
	|ПО
	|	ИД,
	|	ИДРР
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ЗаявкаНаРемонтМатериальныеЗатраты.Номенклатура КАК Номенклатура,
	|	СУММА(ВЫБОР
	|			КОГДА торо_ЗаявкаНаРемонтМатериальныеЗатраты.гкс_Давальческие
	|				ТОГДА 0
	|			ИНАЧЕ торо_ЗаявкаНаРемонтМатериальныеЗатраты.Количество
	|		КОНЕЦ) КАК Колво,
	|	СУММА(ВЫБОР
	|			КОГДА торо_ЗаявкаНаРемонтМатериальныеЗатраты.гкс_Давальческие
	|				ТОГДА торо_ЗаявкаНаРемонтМатериальныеЗатраты.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Давал,
	|	ЕСТЬNULL(УпаковкиНоменклатуры.Ссылка, 
	|	торо_ЗаявкаНаРемонтМатериальныеЗатраты.Номенклатура.ЕдиницаИзмерения) КАК ЕдИзм,
	|	Ремонты.ИД КАК ИД
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.МатериальныеЗатраты 
	|	КАК торо_ЗаявкаНаРемонтМатериальныеЗатраты
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
	|			ПО торо_ЗаявкаНаРемонтМатериальныеЗатраты.ЕдиницаИзмерения = УпаковкиНоменклатуры.Ссылка
	|		ПО Ремонты.Док = торо_ЗаявкаНаРемонтМатериальныеЗатраты.Ссылка
	|			И Ремонты.ИД = торо_ЗаявкаНаРемонтМатериальныеЗатраты.РемонтыОборудования_ID
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_ЗаявкаНаРемонтМатериальныеЗатраты.Номенклатура,
	|	ЕСТЬNULL(УпаковкиНоменклатуры.Ссылка, торо_ЗаявкаНаРемонтМатериальныеЗатраты.Номенклатура.ЕдиницаИзмерения),
	|	Ремонты.ИД
	|ИТОГИ ПО
	|	ИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ремонты.ИД КАК ИД,
	|	СУММА(торо_ЗаявкаНаРемонтИнструменты.Количество) КАК Колво,
	|	торо_ЗаявкаНаРемонтИнструменты.Инструмент КАК Номенклатура,
	|	ЕСТЬNULL(УпаковкиНоменклатуры.Ссылка, торо_ЗаявкаНаРемонтИнструменты.Инструмент.ЕдиницаИзмерения) КАК ЕдИзм
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.Инструменты КАК торо_ЗаявкаНаРемонтИнструменты
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
	|			ПО торо_ЗаявкаНаРемонтИнструменты.Ссылка = УпаковкиНоменклатуры.Ссылка
	|		ПО Ремонты.Док = торо_ЗаявкаНаРемонтИнструменты.Ссылка
	|			И Ремонты.ИД = торо_ЗаявкаНаРемонтИнструменты.РемонтыОборудования_ID
	|
	|СГРУППИРОВАТЬ ПО
	|	Ремонты.ИД,
	|	торо_ЗаявкаНаРемонтИнструменты.Инструмент,
	|	ЕСТЬNULL(УпаковкиНоменклатуры.Ссылка, торо_ЗаявкаНаРемонтИнструменты.Инструмент.ЕдиницаИзмерения)
	|ИТОГИ ПО
	|	ИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ЗаявкаНаРемонтИсполнителиПоРемонтам.Исполнитель КАК Исполнитель,
	|	Ремонты.ИД КАК ИД,
	|	торо_ЗаявкаНаРемонтИсполнителиПоРемонтам.УточнениеИсполнителя КАК УточнениеИсполнителя
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.ИсполнителиПоРемонтам 
	|	КАК торо_ЗаявкаНаРемонтИсполнителиПоРемонтам
	|		ПО Ремонты.Док = торо_ЗаявкаНаРемонтИсполнителиПоРемонтам.Ссылка
	|			И Ремонты.ИД = торо_ЗаявкаНаРемонтИсполнителиПоРемонтам.РемонтыОборудования_ID
	|ИТОГИ ПО
	|	ИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ремонты.ИД КАК ИД,
	|	торо_ИсторияСтатусовСогласованияДокументовСрезПоследних.Пользователь КАК Пользователь,
	|	торо_ИсторияСтатусовСогласованияДокументовСрезПоследних.Период КАК Дата
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИсторияСтатусовСогласованияДокументов.СрезПоследних(
	|				,
	|				СтатусДокумента = &СтатусСогласован
	|					И СогласуемыйДокумент В
	|						(ВЫБРАТЬ
	|							ТЧ.Док
	|						ИЗ
	|							Ремонты КАК ТЧ)) КАК торо_ИсторияСтатусовСогласованияДокументовСрезПоследних
	|		ПО Ремонты.Док = торо_ИсторияСтатусовСогласованияДокументовСрезПоследних.СогласуемыйДокумент
	// гкс+ [] Деснол 16.09.2022
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ
	// гкс- [] Деснол 16.09.2022
	|ИТОГИ ПО
	|	ИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ремонты.ИД КАК ИД,
	|	МАКСИМУМ(ЕСТЬNULL(торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала, ДАТАВРЕМЯ(1, 1, 1))) КАК ДатаНачала,
	|	МАКСИМУМ(ЕСТЬNULL(торо_АктуальныеПлановыеДатыРемонтов.ДатаОкончания, ДАТАВРЕМЯ(1, 1, 1))) КАК ДатаОкончания
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК торо_АктуальныеПлановыеДатыРемонтов
	|		ПО Ремонты.ИД = торо_АктуальныеПлановыеДатыРемонтов.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОтмененныеРемонты.СрезПоследних КАК торо_ОтмененныеРемонтыСрезПоследних
	|		ПО Ремонты.ИД = торо_ОтмененныеРемонтыСрезПоследних.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних 
	|	КАК торо_ПлановыеРемонтныеРаботыСрезПоследних
	|		ПО Ремонты.ИД = торо_ПлановыеРемонтныеРаботыСрезПоследних.ID
	|			И (торо_ПлановыеРемонтныеРаботыСрезПоследних.Отменен = ИСТИНА
	|				ИЛИ торо_ПлановыеРемонтныеРаботыСрезПоследних.Замещен = ИСТИНА)
	|ГДЕ
	|	торо_ОтмененныеРемонтыСрезПоследних.Регистратор ЕСТЬ NULL
	|	И торо_ПлановыеРемонтныеРаботыСрезПоследних.Регистратор ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	Ремонты.ИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ремонты.ИД КАК ИД,
	|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтнаяРабота КАК РР,
	|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.гкс_Примечание КАК гкс_Примечание,
	|	ЕСТЬNULL(торо_АктОВыполненииЭтапаРаботТрудовыеЗатраты.ВремяРаботы, 0) КАК ВремяРаботы
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтныеРаботы 
	|	КАК торо_АктОВыполненииЭтапаРаботРемонтныеРаботы
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.ТрудовыеЗатраты 
	|	КАК торо_АктОВыполненииЭтапаРаботТрудовыеЗатраты
	|			ПО торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтыОборудования_ID = 
	|	торо_АктОВыполненииЭтапаРаботТрудовыеЗатраты.РемонтыОборудования_ID
	|				И торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.ID = 
	|	торо_АктОВыполненииЭтапаРаботТрудовыеЗатраты.ID
	|		ПО Ремонты.Акт = торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Ссылка
	|			И Ремонты.ИД = торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтыОборудования_ID
	|			И (торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.НоваяОперация = ИСТИНА)
	|ИТОГИ
	|	СУММА(ВремяРаботы),
	|	Максимум(гкс_Примечание)
	|ПО
	|	ИД,
	|	РР
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ремонты.ИД КАК ИД,
	|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Номенклатура КАК Номенклатура,
	|	СУММА(торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Количество) КАК Колво,
	|	ЕСТЬNULL(УпаковкиНоменклатуры.Наименование, 
	|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Номенклатура.ЕдиницаИзмерения) КАК ЕдИзм
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтныеРаботы 
	|	КАК торо_АктОВыполненииЭтапаРаботРемонтныеРаботы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.МатериальныеЗатраты 
	|	КАК торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
	|				ПО торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.ЕдиницаИзмерения = УпаковкиНоменклатуры.Ссылка
	|			ПО торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Ссылка = торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Ссылка
	|				И торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтыОборудования_ID = 
	|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.РемонтыОборудования_ID
	|				И торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.ID = торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.ID
	|		ПО Ремонты.Акт = торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Ссылка
	|			И Ремонты.ИД = торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтыОборудования_ID
	|			И (торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.НоваяОперация = ИСТИНА)
	|
	|СГРУППИРОВАТЬ ПО
	|	Ремонты.ИД,
	|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Номенклатура,
	|	ЕСТЬNULL(УпаковкиНоменклатуры.Наименование, 
	|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Номенклатура.ЕдиницаИзмерения)
	|ИТОГИ ПО
	|	ИД" ;	
	ЗапросДокументов.УстановитьПараметр("Ссылка", МассивОбъектов);
	ЗапросДокументов.УстановитьПараметр("СтатусСогласован", 
		Справочники.торо_СтатусыСогласованияДокументовРемонтныхРабот.Согласован);
	Если ПараметрыПечати.Свойство("МассивID") Тогда
		ЗапросДокументов.УстановитьПараметр("ID", ПараметрыПечати.МассивID);
	Иначе
		ЗапросДокументов.Текст = СтрЗаменить(ЗапросДокументов.Текст, 
		"торо_ЗаявкаНаРемонтРемонтыОборудования.ID В(&ID)", "Истина");
	КонецЕсли;
	
	ЭтоПервый = Истина;
	
	ИндексВыборкиСДокументами = 4;
	ИндексВыборкиСРемонтнымиРаботами = 6;
	ИндексВыборкиСМатериальнымиЗатратами = 7;
	ИндексВыборкиСИнструментами = 8;
	ИндексВыборкиСИсполнителями = 9;
	ИндексВыборкиССогласующими = 10;
	ИндексВыборкиСАктуальнымиПериодами = 11;
	ИндексВыборкиСРемонтнымиРаботамиАкта = 12;
	ИндексВыборкиСМатериальнымиЗатратамиАкта = 13;
	
	РезультатЗапроса = ЗапросДокументов.ВыполнитьПакет();
	ВыборкаДокументов = РезультатЗапроса[ИндексВыборкиСДокументами].Выбрать();
	ВыборкаИДРР = РезультатЗапроса[ИндексВыборкиСРемонтнымиРаботами].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаМЗ = РезультатЗапроса[ИндексВыборкиСМатериальнымиЗатратами].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаИн = РезультатЗапроса[ИндексВыборкиСИнструментами].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаИспол = РезультатЗапроса[ИндексВыборкиСИсполнителями].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаСогл = РезультатЗапроса[ИндексВыборкиССогласующими].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаАктуальные = 
	РезультатЗапроса[ИндексВыборкиСАктуальнымиПериодами].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаРРАкта = 
	РезультатЗапроса[ИндексВыборкиСРемонтнымиРаботамиАкта].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаМЗАкта = 
	РезультатЗапроса[ИндексВыборкиСМатериальнымиЗатратамиАкта].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаДокументов.Следующий() Цикл
		Если НЕ ЭтоПервый Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ЭтоПервый = Ложь;
		
		ЗаполнитьЗначенияСвойств(Шапка.Параметры,ВыборкаДокументов);
		Шапка.Параметры.Номер = ВыборкаДокументов.НарядЗаданиеНомер;
		НовыйСиноним = " Объем работ по заявке  " + ВыборкаДокументов.НарядЗаданиеНомер;
		ТабДокумент.Вывести(Шапка);
		
		Итог1 = 0; Итог2 = 0;
		Если ВыборкаИДРР.НайтиСледующий(Новый Структура("ИД",ВыборкаДокументов.ИД)) Тогда 
			Выборка = ВыборкаИДРР.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока Выборка.Следующий() Цикл
				СтрокаРР.Параметры.РР = Строка(Выборка.РР) + " " + Выборка.гкс_Примечание;
				СтрокаРР.Параметры.КолвоРР = Выборка.КолвоРР;
				
				НуженВывод = Истина;
				ВыборкаТЗ = Выборка.Выбрать();
				Пока ВыборкаТЗ.Следующий() Цикл
					СтрокаРР.Параметры.Квалификация = ВыборкаТЗ.Квалификация;
					СтрокаРР.Параметры.Колво = ВыборкаТЗ.Количество;
					План = ВыборкаТЗ.ВремяРаботы / 60;
					Итог1 = Итог1 + (План * ВыборкаТЗ.Количество);
					Если План = Цел(План) Тогда 
						План = Строка(План);
					КонецЕсли;
					СтрокаРР.Параметры.План = План;
					ТабДокумент.Вывести(СтрокаРР);
					НуженВывод = Ложь;
					СтрокаРР.Параметры.КолвоРР = "";
					СтрокаРР.Параметры.Квалификация = "";
					СтрокаРР.Параметры.Колво = "";
					СтрокаРР.Параметры.План = "";
					СтрокаРР.Параметры.РР = "";
				КонецЦикла;
				Если НуженВывод Тогда 
					ТабДокумент.Вывести(СтрокаРР);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Итог2 = (ВыборкаДокументов.ДатаОкончания - ВыборкаДокументов.ДатаНачала) / 60;
		
		Если Итог1 = Цел(Итог1) Тогда 
			Итог1 = Строка(Итог1);
		КонецЕсли;
		Если Итог2 = Цел(Итог2) Тогда 
			Итог2 = Строка(Итог2);
		КонецЕсли;
		ПодвалРР.Параметры.Итог1 = Итог1;
		ПодвалРР.Параметры.Итог2 = Итог2;
		ТабДокумент.Вывести(ПодвалРР);
		
		Если ВыборкаМЗ.НайтиСледующий(Новый Структура("ИД",ВыборкаДокументов.ИД)) Тогда 
			Выборка = ВыборкаМЗ.Выбрать();
			Пока Выборка.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(СтрокаМЗ.Параметры,Выборка);
				ТабДокумент.Вывести(СтрокаМЗ);
			КонецЦикла;
		КонецЕсли;
		ВыборкаМЗ.Сбросить();
		
		ТабДокумент.Вывести(ШапкаИнструменты);
		Если ВыборкаИн.НайтиСледующий(Новый Структура("ИД",ВыборкаДокументов.ИД)) Тогда 
			Выборка = ВыборкаИн.Выбрать();
			Пока Выборка.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(СтрокаИнструменты.Параметры,Выборка);
				ТабДокумент.Вывести(СтрокаИнструменты);
			КонецЦикла;
		КонецЕсли;
		ВыборкаИн.Сбросить();
		
		ВыборкаМЗАкта.Сбросить();
		
		Подвал.Параметры.СмФайлы = ВыборкаДокументов.КомментЗаявка;
		Если ВыборкаДокументов.ЕстьФайлы Тогда 
			Подвал.Параметры.СмФайлы = Подвал.Параметры.СмФайлы + Символы.ПС
			+  "См. вложенные файлы";
		КонецЕсли;
		
		ТабДокумент.Вывести(Подвал);
	КонецЦикла;
	
	// Зададим параметры макета
	ТабДокумент.АвтоМасштаб	= Истина;
	ТабДокумент.ПолеСверху  = 0;
	ТабДокумент.ПолеСлева   = 0;
	ТабДокумент.ПолеСнизу   = 0;
	ТабДокумент.ПолеСправа  = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабДокумент.ТолькоПросмотр = Истина;
	
	Возврат ТабДокумент;
КонецФункции // гкс- [2021] Куст

&После("Печать")
Процедура Расш_гкс_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "дс_НарядЗадание") Тогда
		НомерПП = 0;
		Для каждого СМ Из МассивОбъектов Цикл
			ИмяМакета = "дс_НарядЗадание";
			Если НомерПП > 0 Тогда 
				ИмяМакета = ИмяМакета + Строка(НомерПП);
				ОписаниеПечатнойФормы = КоллекцияПечатныхФорм.Найти(ВРег("дс_НарядЗадание"), "ИмяВРЕГ");
				Если ОписаниеПечатнойФормы = Неопределено Тогда 
					Продолжить;
				КонецЕсли;
				НоваяПечатнаяФорма = КоллекцияПечатныхФорм.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяПечатнаяФорма, ОписаниеПечатнойФормы);
				НоваяПечатнаяФорма.ИмяВРЕГ = ВРег(ИмяМакета);
				НоваяПечатнаяФорма.ТабличныйДокумент = Неопределено;
				НоваяПечатнаяФорма.СинонимМакета = "";
				НоваяПечатнаяФорма.ИмяМакета = ИмяМакета;
				НоваяПечатнаяФорма.Картинка = Неопределено;
				НоваяПечатнаяФорма.ПолныйПутьКМакету = Неопределено;
				НоваяПечатнаяФорма.ИмяФайлаПечатнойФормы = Неопределено;
			КонецЕсли;
			ТемпМассив = Новый Массив();
			ТемпМассив.Добавить(СМ);
			НовыйСиноним = "Техническое задание";
			ТабДок = ПечатьНарядЗадание(ТемпМассив, ПараметрыПечати, НовыйСиноним);
			НовыйСиноним = СтрЗаменить(НовыйСиноним, "-", " ");
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
			ИмяМакета, 
			НовыйСиноним,     
			ТабДок,
			,
			"Документ.торо_ЗаявкаНаРемонт.ПФ_MXL_дс_НарядЗадание");
			НомерПП = НомерПП + 1;
		КонецЦикла;
			
	КонецЕсли;
	
	// гкс+ [разработка 2021] Куст 06.05.2021
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "дс_ОбъемРабот") Тогда
		НомерПП = 0;
		Для каждого СМ Из МассивОбъектов Цикл
			ИмяМакета = "дс_ОбъемРабот";
			Если НомерПП > 0 Тогда 
				ИмяМакета = ИмяМакета + Строка(НомерПП);
				ОписаниеПечатнойФормы = КоллекцияПечатныхФорм.Найти(ВРег("дс_ОбъемРабот"), "ИмяВРЕГ");
				Если ОписаниеПечатнойФормы = Неопределено Тогда 
					Продолжить;
				КонецЕсли;
				НоваяПечатнаяФорма = КоллекцияПечатныхФорм.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяПечатнаяФорма, ОписаниеПечатнойФормы);
				НоваяПечатнаяФорма.ИмяВРЕГ = ВРег(ИмяМакета);
				НоваяПечатнаяФорма.ТабличныйДокумент = Неопределено;
				НоваяПечатнаяФорма.СинонимМакета = "";
				НоваяПечатнаяФорма.ИмяМакета = ИмяМакета;
				НоваяПечатнаяФорма.Картинка = Неопределено;
				НоваяПечатнаяФорма.ПолныйПутьКМакету = Неопределено;
				НоваяПечатнаяФорма.ИмяФайлаПечатнойФормы = Неопределено;
			КонецЕсли;
			ТемпМассив = Новый Массив();
			ТемпМассив.Добавить(СМ);
			НовыйСиноним = "Объем работ";
			ТабДок = гкс_ПечатьОбъемРабот(ТемпМассив, ПараметрыПечати, НовыйСиноним);
			НовыйСиноним = СтрЗаменить(НовыйСиноним, "-", " ");
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
			ИмяМакета, 
			НовыйСиноним,     
			ТабДок,
			,
			"Документ.торо_ЗаявкаНаРемонт.ПФ_MXL_дс_НарядЗадание");
			НомерПП = НомерПП + 1;
		КонецЦикла;
			
	КонецЕсли;
	// гкс- [разработка 2021] Куст 06.05.2021
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "гкс_ДефектныйАкт2026") Тогда
			
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
			"гкс_ДефектныйАкт2026", 
			"Дефектный акт", 
			гкс_ПечатьДефектныйАкт2026(МассивОбъектов, ПараметрыПечати),
			,
			"Документ.торо_АктОВыполненииЭтапаРабот.ПФ_MXL_гкс_ДефектныйАкт2026");
		
	КонецЕсли;
	// гкс+ [05.23] Деснол 10.05.2023
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "гкс_АктВновьУстановленное") Тогда
		ПараметрыПечати.Вставить("РанееУстановленное", Истина);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"гкс_АктВновьУстановленное", 
		"Акт на вновь установленное оборудование", 
		Печатьгкс_ДефектныйАкт(МассивОбъектов, ПараметрыПечати),
		,
		"Документ.торо_АктОВыполненииЭтапаРабот.ПФ_MXL_гкс_АктНаУстановленное");
		
	КонецЕсли;
	// гкс- [05.23] Деснол 10.05.2023
КонецПроцедуры

&ИзменениеИКонтроль("ДобавитьКомандыПечати")
Процедура Расш_гкс_ДобавитьКомандыПечати(КомандыПечати)

	// Акт выполненных ремонтных работ
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_АктОВыполненииЭтапаРабот";
	КомандаПечати.Идентификатор = "АктВыполненныхРемонтныхРабот";
	#Удаление
	КомандаПечати.Представление = НСтр("ru = 'Акт о приемке выполненных работ'");
	#КонецУдаления
	#Вставка
	КомандаПечати.Представление = НСтр("es='El acta sobre la recepción de los trabajos cumplidos';
		|ru='Акт о приемке выполненных работ';en='Act on acceptance of work'");
	#КонецВставки
	КомандаПечати.Обработчик = "торо_Печать.ЗапроситьУПользователяДополнительныеПараметрыПередПечатью";
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);

	// КС-2
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_АктОВыполненииЭтапаРабот";
	КомандаПечати.Идентификатор = "ФормаКС2";
	#Удаление
	КомандаПечати.Представление = НСтр("ru = 'КС-2'");
	#КонецУдаления
	#Вставка
	КомандаПечати.Представление = НСтр("es='jæ-2';ru='КС-2';en='KS-2'");
	#КонецВставки
	КомандаПечати.Обработчик = "торо_Печать.ЗапроситьУПользователяДополнительныеПараметрыПередПечатьюКС2_КС3";
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);

	// КС-3
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_АктОВыполненииЭтапаРабот";
	КомандаПечати.Идентификатор = "ФормаКС3";
	#Удаление
	КомандаПечати.Представление = НСтр("ru = 'КС-3'");
	#КонецУдаления
	#Вставка
	КомандаПечати.Представление = НСтр("es='jæ-3';ru='КС-3';en='KS-3'");
	#КонецВставки
	КомандаПечати.Обработчик = "торо_Печать.ЗапроситьУПользователяДополнительныеПараметрыПередПечатьюКС2_КС3";
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	#Вставка
	// Наряд задание
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_АктОВыполненииЭтапаРабот";
	КомандаПечати.Идентификатор = "дс_НарядЗадание";
	КомандаПечати.Представление = НСтр("ru='Техническое задание';en='Technical task'");
	КомандаПечати.Обработчик = "торо_Печать.гкс_ЗапроситьИсполнителейПередПечатью";
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	
	// ОбъемРабот
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_АктОВыполненииЭтапаРабот";
	КомандаПечати.Идентификатор = "дс_ОбъемРабот";
	КомандаПечати.Представление = НСтр("ru='Объем работ';en='Scope of work'");
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	
	// Дефектный акт
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_АктОВыполненииЭтапаРабот";
	КомандаПечати.Идентификатор = "гкс_ДефектныйАкт2026";
	КомандаПечати.Представление = НСтр("ru='Дефектный акт';en='Defective act'");
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	// гкс+ [05.23] Деснол 10.05.2023
	// Акт на вновь установленное оборудование
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_АктОВыполненииЭтапаРабот";
	КомандаПечати.Идентификатор = "гкс_АктВновьУстановленное";
	КомандаПечати.Представление = НСтр("ru='Акт на вновь установленное оборудование'");
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	// гкс- [05.23] Деснол 10.05.2023
	#КонецВставки

КонецПроцедуры

&Вместо("ПечатьАктВыполненныхРемонтныхРабот")
Функция Расш_гкс_ПечатьАктВыполненныхРемонтныхРабот(МассивОбъектов, ПараметрыПечати)
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_АктОВыполненииЭтапаРабот.ПФ_MXL_дс_АктВыполненныхРемонтныхРабот");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РемонтыТЧ.Ссылка КАК Документ,
	|	ДокАкт.Номер КАК Номер,
	|	ДокАкт.Дата КАК Дата,
	|	ДокАкт.Организация КАК Организация,
	|	ДокАкт.Подразделение КАК Подразделение,
	|	РемонтыТЧ.ОбъектРемонта КАК ОбъектРемонта,
	|	РемонтыТЧ.ОбъектРемонта.ИнвентарныйНомер КАК ИнвНомер,
	|	РемонтыТЧ.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	РемонтыТЧ.ДокументИсточник КАК ДокументИсточник,
	|	РемонтыТЧ.ДатаНачала КАК ДатаНачала,
	|	РемонтыТЧ.ДатаОкончания КАК ДатаОкончания,
	|	РемонтыТЧ.ID КАК ID,
	|	ИсполнителиТЧ.Исполнитель КАК Контрагент,
	|	ИсполнителиТЧ.УточнениеИсполнителя КАК Договор
	|ПОМЕСТИТЬ ПервыйПакет
	|ИЗ
	|	Документ.торо_АктОВыполненииЭтапаРабот КАК ДокАкт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК РемонтыТЧ
	|		ПО ДокАкт.Ссылка = РемонтыТЧ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.ИсполнителиПоРемонтам КАК ИсполнителиТЧ
	|		ПО (ИсполнителиТЧ.Ссылка = ДокАкт.Ссылка)
	|			И (ИсполнителиТЧ.НомерСтроки = 1)
	|ГДЕ
	|	ДокАкт.Ссылка В(&Ссылка)
	|	И РемонтыТЧ.ID В(&МассивID)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегЗаявки.IDРемонта КАК ИД,
	|	МАКСИМУМ(РегЗаявки.Регистратор) КАК Регистратор
	|ПОМЕСТИТЬ ЗаявкиРемонтов
	|ИЗ
	|	РегистрСведений.торо_ЗаявкиПоРемонтам.СрезПоследних(
	|			,
	|			IDРемонта В
	|					(ВЫБРАТЬ
	|						ТЧ.ID
	|					ИЗ
	|						ПервыйПакет КАК ТЧ)
	|				И Регистратор ССЫЛКА Документ.торо_ЗаявкаНаРемонт) КАК РегЗаявки
	|
	|СГРУППИРОВАТЬ ПО
	|	РегЗаявки.IDРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокАкт.Документ КАК Документ,
	|	ДокАкт.Номер КАК Номер,
	|	ДокАкт.Дата КАК Дата,
	|	ДокАкт.Организация КАК Организация,
	|	ДокАкт.Подразделение КАК Подразделение,
	|	ДокАкт.ОбъектРемонта КАК ОбъектРемонта,
	|	ДокАкт.ИнвНомер КАК ИнвНомер,
	|	ДокАкт.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	ДокАкт.ДокументИсточник КАК ДокументИсточник,
	|	ДокАкт.ДатаНачала КАК ДатаНачала,
	|	ДокАкт.ДатаОкончания КАК ДатаОкончания,
	|	ДокАкт.ID КАК ID,
	|	ДокАкт.Контрагент КАК Контрагент,
	|	ДокАкт.Договор КАК Договор,
	|	ЕстьNull(РегЗаявки.Регистратор.Дата, """") КАК ЗаявкаДата,
	|	ЕстьNull(РегЗаявки.Регистратор.Номер,"""") КАК ЗаявкаНомер
	|ИЗ
	|	ПервыйПакет КАК ДокАкт
	|		Левое СОЕДИНЕНИЕ ЗаявкиРемонтов КАК РегЗаявки
	|		ПО ДокАкт.ID = РегЗаявки.ИД
	|ИТОГИ
	|	МАКСИМУМ(Номер),
	|	МАКСИМУМ(Дата),
	|	МАКСИМУМ(Организация),
	|	МАКСИМУМ(Подразделение),
	|	МИНИМУМ(ДатаНачала),
	|	МАКСИМУМ(ДатаОкончания)
	|ПО
	|	Документ";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	Если ПараметрыПечати.Свойство("МассивID") Тогда
		Запрос.УстановитьПараметр("МассивID", ПараметрыПечати.МассивID);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И РемонтыТЧ.ID В(&МассивID)", "");
	КонецЕсли;
	
	ВыборкаДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Документ");
	ЭтоПервый = Истина;
	
	Пока ВыборкаДокументов.Следующий() Цикл
		Документ = ВыборкаДокументов.Документ;
		ДатаНачала = ВыборкаДокументов.ДатаНачала;
		ВыборкаРемонтов = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.Прямой);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА торо_АктРемонтныеРаботы.РемонтнаяРабота ССЫЛКА Справочник.торо_ТехнологическиеОперации
		|			ТОГДА ВЫБОР
		|					КОГДА торо_АктРемонтныеРаботы.РемонтнаяРабота.НаименованиеДляПечати = """"
		|						ТОГДА ТехнологическиеОперации.Наименование
		|					ИНАЧЕ торо_АктРемонтныеРаботы.РемонтнаяРабота.НаименованиеДляПечати
		|				  КОНЕЦ
		|		ИНАЧЕ торо_ВерсииТехКартСрезПоследних.ТехКарта.Наименование
		|	КОНЕЦ КАК Работа,
		|	торо_АктРемонтныеРаботы.ID КАК ID,
		|	торо_АктРемонтныеРаботы.Родитель_ID КАК Родитель_ID,
		|	торо_АктРемонтныеРаботы.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		|	ВЫБОР
		|		КОГДА торо_АктРемонтныеРаботы.РемонтнаяРабота ССЫЛКА Справочник.торо_ТехнологическиеОперации
		|			ТОГДА ТехнологическиеОперации.Комментарий
		|		ИНАЧЕ торо_ВерсииТехКартСрезПоследних.ТехКарта.Комментарий
		|	КОНЕЦ КАК Комментарий,
		|	ТехнологическиеОперации.БазоваяЕдиницаИзмерения КАК ЕдИзм,
		|	торо_АктРемонтныеРаботы.гкс_Примечание КАК Примечание,
		|	торо_АктРемонтныеРаботы.Количество КАК Количество
		|ИЗ
		|	Документ.торо_АктОВыполненииЭтапаРабот.РемонтныеРаботы КАК торо_АктРемонтныеРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ТехнологическиеОперации КАК ТехнологическиеОперации
		|		ПО торо_АктРемонтныеРаботы.РемонтнаяРабота = ТехнологическиеОперации.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВерсииТехКарт.СрезПоследних(&ДатаНачала, ) КАК торо_ВерсииТехКартСрезПоследних
		|		ПО торо_АктРемонтныеРаботы.РемонтнаяРабота = торо_ВерсииТехКартСрезПоследних.ИдентификаторТехКарты
		|ГДЕ
		|	торо_АктРемонтныеРаботы.Ссылка = &Акт";
		
		Запрос.УстановитьПараметр("Акт", Документ);	
		Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
		тзСписокРаботИсх = Запрос.Выполнить().Выгрузить();
		
		Пока ВыборкаРемонтов.Следующий() Цикл
			РемонтОборудования  = ВыборкаРемонтов;
			ОбщийИтог = 0;
			
			Если НЕ ЭтоПервый Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ЭтоПервый = Ложь;
			
			// Шапка
			Область = Макет.ПолучитьОбласть("Шапка");
			Область.Параметры.НомерДокумента = ВыборкаДокументов.Номер;
			Область.Параметры.Дата	= Формат(ВыборкаДокументов.Дата,"ДЛФ=Д");
			Область.Параметры.ДатаНач = Формат(РемонтОборудования.ДатаНачала,"ДЛФ=Д");
			Область.Параметры.ДатаКонец = Формат(РемонтОборудования.ДатаОкончания,"ДЛФ=Д");
						
			ТабДок.Вывести(Область);
			
			// Заголовок
			Область = Макет.ПолучитьОбласть("Заголовок");
			ТекстИсполнитель = Строка(ВыборкаРемонтов.Контрагент);
			Если ТипЗнч(ВыборкаРемонтов.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда 
				ТекстИсполнитель = ТекстИсполнитель + " (" + ВыборкаДокументов.Договор + ")";
			Иначе
				// ТекстИсполнитель = ТекстИсполнитель + " (" + ? + ")"; // тут нужна организация
			КонецЕсли;
			Область.Параметры.ПодразделениеИсполнитель = ТекстИсполнитель;
			Область.Параметры.ПодразделениеЗаказчик = Строка(ВыборкаРемонтов.Подразделение) + " (" + ВыборкаДокументов.Организация + ")";
			
			Если ТипЗнч(Документ) = Тип("ДокументСсылка.торо_АктОВыполненииРегламентногоМероприятия") Тогда
				ТекстОР = 
				торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(РемонтОборудования.ОбъектРемонта);
			Иначе
				ТекстОР = 
				торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(РемонтОборудования.ОбъектРемонта);
			КонецЕсли;
			Область.Параметры.ОбъектРемонта = Строка(ТекстОР);
			Область.Параметры.ИнвНомер = ВыборкаРемонтов.ИнвНомер;
			Если ЗначениеЗаполнено(ВыборкаРемонтов.ЗаявкаНомер) Тогда 
				Область.Параметры.ЗаголовокЗаявка = "Заявка на ремонт:";
				Область.Параметры.ТекстЗаявка = Строка(ВыборкаРемонтов.ЗаявкаНомер) + " от " + ВыборкаРемонтов.ЗаявкаДата;
			КонецЕсли;
			
			ТабДок.Вывести(Область);
			
			// ВыполненныеРаботыШапка
			Область = Макет.ПолучитьОбласть("ВыполненныеРаботыШапка");
			ТабДок.Вывести(Область);
			
			// ВыполненныеРаботы
			Область = Макет.ПолучитьОбласть("ВыполненныеРаботы");
			
			// Накладываем отбор по РемонтуОборудования. Если делать это в запросе - теряется последовательность ремонтов.
			ПараметрыОтбора = Новый Структура("РемонтыОборудования_ID",РемонтОборудования.ID);
			тзСписокРабот = тзСписокРаботИсх.Скопировать(ПараметрыОтбора);	
			Ном = "1";
			МассивID = Новый Массив;
			МассивСтрок = тзСписокРабот.НайтиСтроки(Новый Структура("Родитель_ID",""));
			
			// Определяем используются ли комментарии или нет
			ВывестиРаботы(МассивСтрок,тзСписокРабот,Область,ТабДок,МассивID,Ном,Истина,Истина);
			
			
			// МатериалыШапка
			ИспользоватьХарактеристики = Константы.торо_ИспользоватьХарактеристикиНоменклатуры.Получить();
			ИспользоватьСерии = Константы.ИспользоватьСерииНоменклатуры.Получить();
			
			Если ИспользоватьХарактеристики Тогда  
				ОбластьШапка = Макет.ПолучитьОбласть("МатериалыФОШапка");
				Область      = Макет.ПолучитьОбласть("МатериалыФО");
			Иначе 
				ОбластьШапка = Макет.ПолучитьОбласть("МатериалыШапка");
				Область      = Макет.ПолучитьОбласть("Материалы");
			КонецЕсли;
			ТабДок.Вывести(ОбластьШапка);
			
			// Материалы
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	СУММА(МатериальныеЗатраты.Количество) КАК Количество,
			|	СУММА(МатериальныеЗатраты.Сумма) КАК Сумма,
			|	МатериальныеЗатраты.Номенклатура КАК Номенклатура,
			|	МатериальныеЗатраты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	МатериальныеЗатраты.гкс_Давальческие КАК гкс_Давальческие,
			|	МатериальныеЗатраты.ЕдиницаИзмерения КАК ЕдиницаИзмерения
			|ПОМЕСТИТЬ МатЗатраты_Упаковки
			|ИЗ
			|	Документ.торо_АктОВыполненииЭтапаРабот.МатериальныеЗатраты КАК МатериальныеЗатраты
			|ГДЕ
			|	МатериальныеЗатраты.Ссылка = &Ссылка
			|	И МатериальныеЗатраты.РемонтыОборудования_ID = &ID
			|
			|СГРУППИРОВАТЬ ПО
			|	МатериальныеЗатраты.Номенклатура,
			|	МатериальныеЗатраты.гкс_Давальческие,
			|	МатериальныеЗатраты.ХарактеристикаНоменклатуры,
			|	МатериальныеЗатраты.ЕдиницаИзмерения
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ЕдиницаИзмерения
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	МатериальныеЗатраты.Количество * ЕСТЬNULL(спрУпаковки.Коэффициент, 1) КАК Количество,
			|	МатериальныеЗатраты.Сумма КАК Сумма,
			|	МатериальныеЗатраты.Номенклатура КАК Номенклатура,
			|	МатериальныеЗатраты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	МатериальныеЗатраты.гкс_Давальческие КАК гкс_Давальческие,
			|	спрНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
			|ПОМЕСТИТЬ МатЗатраты
			|ИЗ
			|	МатЗатраты_Упаковки КАК МатериальныеЗатраты
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиНоменклатуры КАК спрУпаковки
			|		ПО МатериальныеЗатраты.ЕдиницаИзмерения = спрУпаковки.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК спрНоменклатура
			|		ПО МатериальныеЗатраты.Номенклатура = спрНоменклатура.Ссылка
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура,
			|	ХарактеристикаНоменклатуры,
			|	ЕдиницаИзмерения
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
			|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
			|	ЦеныНоменклатурыСрезПоследних.Валюта КАК Валюта,
			|	ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
			|	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика
			|ПОМЕСТИТЬ ЦеныНоменклатурыСрезПоследних
			|ИЗ
			|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
			|			&Дата,
			|			ВидЦены = &ТипЦены
			|				И Валюта = &Валюта
			|				И (Номенклатура, Характеристика, ЕдиницаИзмерения) В
			|					(ВЫБРАТЬ
			|						Таб.Номенклатура,
			|						Таб.ХарактеристикаНоменклатуры,
			|						Таб.ЕдиницаИзмерения
			|					ИЗ
			|						МатЗатраты КАК Таб)) КАК ЦеныНоменклатурыСрезПоследних
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура,
			|	Характеристика,
			|	ЕдиницаИзмерения
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Количество КАК Количество,
			|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Сумма КАК Сумма,
			|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.гкс_Давальческие КАК гкс_Давальческие,
			|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Номенклатура КАК Номенклатура,
			|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.ВидЦены, ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)) КАК ТипЦены,
			|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена,
			|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК Валюта
			|ИЗ
			|	МатЗатраты КАК торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты
			|		ЛЕВОЕ СОЕДИНЕНИЕ ЦеныНоменклатурыСрезПоследних КАК ЦеныНоменклатурыСрезПоследних
			|		ПО торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
			|			И торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.ХарактеристикаНоменклатуры = ЦеныНоменклатурыСрезПоследних.Характеристика
			|			И торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.ЕдиницаИзмерения = ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения";
			
			//Запрос.УстановитьПараметр("МатериальныеЗатраты",Документ.МатериальныеЗатраты.Выгрузить(Новый Структура("РемонтыОборудования_ID",РемонтОборудования.ID)));
			Запрос.УстановитьПараметр("Ссылка", Документ);
			Запрос.УстановитьПараметр("Дата", ДатаНачала);
			Запрос.УстановитьПараметр("ТипЦены",Константы.торо_ТипЦеныДляРасчетаСебестоимостиРемонта.Получить());
			Запрос.УстановитьПараметр("Валюта",Константы.ВалютаУправленческогоУчета.Получить());
			Запрос.УстановитьПараметр("ID", РемонтОборудования.ID);
			
			Результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать();
			
			счетчик = 1;
			Итого=0;
			Пока Выборка.Следующий() Цикл
				
				Область.Параметры.Материал   = Выборка.Номенклатура;
				Если ИспользоватьХарактеристики Тогда  
					Область.Параметры.Характеристика = Строка(Выборка.ХарактеристикаНоменклатуры);
				КонецЕсли;
				Область.Параметры.Ед 		 = Выборка.Номенклатура.ЕдиницаИзмерения;
				Область.Параметры.Код 		 = Выборка.Номенклатура.Код;
				Область.Параметры.Количество = Выборка.Количество;
				Область.Параметры.Давальческие = ?(Выборка.гкс_Давальческие, "Да", "");
 
				Область.Параметры.Номер      = счетчик;
				счетчик = счетчик + 1;
				ТабДок.Вывести(Область);		
				
			КонецЦикла;
			
			//Исполнители			
			
			Область = Макет.ПолучитьОбласть("Собственные");
			Область1 = Макет.ПолучитьОбласть("Собственные1");
			Запрос = Новый Запрос;
			Запрос.Текст = "
			|выбрать ТЧ.Исполнитель Ссылка Справочник.Контрагенты КАК ЭтоКонтрагент, ТЧ.Ссылка КАК Ссылка
			|Поместить ВТ_Контрагент
			|ИЗ
			|	Документ.торо_АктОВыполненииЭтапаРабот.ИсполнителиПоРемонтам КАК ТЧ
			|ГДЕ
			|	ТЧ.Ссылка = &Ссылка И ТЧ.НомерСТроки = 1

			| ; ВЫБРАТЬ
			|	ТЧ.Квалификация КАК Квалификация,
			|	СУММА(ТЧ.ВремяРаботы * выбор когда ТЧ.гкс_Количество = 0 тогда 1 иначе ТЧ.гкс_Количество конец) КАК ВремяРаботы,
			|	СУММА(ТЧ.СуммаКНачислению) КАК СуммаКНачислению,
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТЧ.ID) КАК ID,
			|	ТЧ.Сотрудник КАК Сотрудник, Максимум(ЕстьNull(ВТ.ЭтоКонтрагент, Ложь)) КАК ЭтоКонтрагент
			|ИЗ
			|	Документ.торо_АктОВыполненииЭтапаРабот.ТрудовыеЗатраты КАК ТЧ
			|	Левое соединение ВТ_Контрагент КАК ВТ ПО ВТ.Ссылка = ТЧ.Ссылка
			|ГДЕ
			|	ТЧ.Ссылка = &Ссылка
			|	И ТЧ.РемонтыОборудования_ID = &ID
			|
			|СГРУППИРОВАТЬ ПО
			|	ТЧ.Квалификация,
			|	ТЧ.Сотрудник";
			
			
			Запрос.УстановитьПараметр("Ссылка", Документ);
			Запрос.УстановитьПараметр("ID", РемонтОборудования.ID);
			
			Результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать();
			
			счетчик = 1;
			Итого = 0;
			Пока Выборка.Следующий() Цикл
				Если счетчик = 1 Тогда 
					Если ЗначениеЗаполнено(Выборка.Сотрудник) И Выборка.ЭтоКонтрагент = Ложь Тогда 
						ОбластьШапка1 = Макет.ПолучитьОбласть("СобственныеШапка");
						ТабДок.Вывести(ОбластьШапка1);
					Иначе
						ОбластьШапка1 = Макет.ПолучитьОбласть("СобственныеШапка1");
						ТабДок.Вывести(ОбластьШапка1);
					КонецЕсли;
				КонецЕсли;
				Если ЗначениеЗаполнено(Выборка.Сотрудник) И Выборка.ЭтоКонтрагент = Ложь Тогда 
					текОбласть = Область;
					ТекОбласть.Параметры.ФИО = Выборка.Сотрудник;
				Иначе
					текОбласть = Область1;
				КонецЕсли;
				ТекОбласть.Параметры.Квалификация = Выборка.Квалификация;
				ТекОбласть.Параметры.ВремяРаботы  = торо_ОбщегоНазначенияКлиентСервер.СформироватьЗаголовокПоПродолжительности(Выборка.ВремяРаботы);
				ТекОбласть.Параметры.Номер        = счетчик;
				
				счетчик = счетчик + 1;
				ТабДок.Вывести(ТекОбласть);		
				Итого = Итого + Выборка.ВремяРаботы;
				
			КонецЦикла;
			
			Область = Макет.ПолучитьОбласть("ИтогоСобственные");
			Если ЗначениеЗаполнено(Итого) Тогда 
				Область.Параметры.Итого = торо_ОбщегоНазначенияКлиентСервер.СформироватьЗаголовокПоПродолжительности(Итого);
			Иначе
				Область.Параметры.Итого = "";
			КонецЕсли;
			ТабДок.Вывести(Область);	
				
			// Подрядчики
			Область = Макет.ПолучитьОбласть("ПодрядчикШапка");
			ТабДок.Вывести(Область);
			
			Область = Макет.ПолучитьОбласть("Подрядчик");
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ИсполнителиПоРемонтам.Исполнитель КАК Контрагент,
			|	ИсполнителиПоРемонтам.Сумма КАК Сумма
			|ИЗ
			|	Документ.торо_АктОВыполненииЭтапаРабот.ИсполнителиПоРемонтам КАК ИсполнителиПоРемонтам
			|ГДЕ
			|	ИсполнителиПоРемонтам.Ссылка = &Документ
			|	И ИсполнителиПоРемонтам.РемонтыОборудования_ID = &РемонтыОборудования_ID
			|	И ИсполнителиПоРемонтам.Исполнитель ССЫЛКА Справочник.Контрагенты";
			
			Запрос.УстановитьПараметр("Документ", Документ);
			Запрос.УстановитьПараметр("РемонтыОборудования_ID", РемонтОборудования.ID);
			
			Результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать();
			счетчик = 1;
			Итого = 0;
			Пока Выборка.Следующий() Цикл
				
				Область.Параметры.Подрядчик   = Выборка.Контрагент;
				Область.Параметры.Номер      = счетчик;
				счетчик = счетчик + 1;
				ТабДок.Вывести(Область);
				
			КонецЦикла; 
						
			// Подвал
			Область = Макет.ПолучитьОбласть("Подвал");
			
			ТабДок.Вывести(Область);
			
		КонецЦикла;
		
	КонецЦикла;
	
	ТабДок.ТолькоПросмотр = Истина;
	Возврат ТабДок;
	
КонецФункции

&ИзменениеИКонтроль("ВывестиРаботы")
Процедура Расш_гкс_ВывестиРаботы(МассивСтрок, тзСписокРабот, СтрокаТаблицыРабот, ТабДок, МассивID, Ном, Комментарии, КолВо)
	Для каждого СписокРабот Из МассивСтрок Цикл
		СтрокаТаблицыРабот.Параметры.Номер = Ном;
		#Удаление
		СтрокаТаблицыРабот.Параметры.Работа = СписокРабот.Работа;
		#КонецУдаления
		#Вставка
		СтрокаТаблицыРабот.Параметры.Работа = Строка(СписокРабот.Работа) + " " + СписокРабот.Примечание;
		#КонецВставки
		Если КолВо = Истина Тогда
			СтрокаТаблицыРабот.Параметры.Количество=СписокРабот.Количество; 
			СтрокаТаблицыРабот.Параметры.ЕдИзм=СписокРабот.ЕдИзм; 
		КонецЕсли;	
		Если Комментарии = Истина Тогда
			СтрокаТаблицыРабот.Параметры.Комментарий = СписокРабот.Комментарий;
		КонецЕсли;
		ТабДок.Вывести(СтрокаТаблицыРабот);
		МассивID.Добавить(СписокРабот.ID);
		ВывестиРаботы(тзСписокРабот.НайтиСтроки(Новый Структура("Родитель_ID",СписокРабот.ID)),тзСписокРабот,СтрокаТаблицыРабот,ТабДок,МассивID,Ном + ".1",Комментарии,КолВо);

		КоличествоРазделителей = СтрЧислоВхождений(Ном, ".");
		ПозицияКрайнегоРазделителя = СтрНайти(Ном, ".", , , ?(КоличествоРазделителей = 0, 1, КоличествоРазделителей));
		ЦелаяЧасть = Лев(Ном, ?(ПозицияКрайнегоРазделителя = 1, СтрДлина(Ном), ПозицияКрайнегоРазделителя));
		ДробнаяЧасть = Строка(Число(Сред(Ном, ПозицияКрайнегоРазделителя + 1)) + 1);
		Ном = ЦелаяЧасть + ДробнаяЧасть;
	КонецЦикла;
КонецПроцедуры

Функция гкс_ПечатьДефектныйАкт2026(МассивОбъектов, ПараметрыПечати)

	Макет  = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_АктОВыполненииЭтапаРабот.ПФ_MXL_гкс_ДефектныйАкт2026");

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьКомиссия = Макет.ПолучитьОбласть("Комиссия");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвалСтрока = Макет.ПолучитьОбласть("ПодвалСтрока");

	Запрос = Новый Запрос;
	Запрос.Текст = гкс_ТекстЗапросаДефектныйАкт2026();		
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	НомерПакетаОсновной = 2;
	НомерПакетаТМЦ = 3;

	ВыборкаСсылка = РезультатыЗапроса[НомерПакетаОсновной].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаТМЦСсылка = РезультатыЗапроса[НомерПакетаТМЦ].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	ПервыйДокумент = Истина;
	Пока ВыборкаСсылка.Следующий() Цикл
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		НомерПП = 0;
		ВыборкаДетальныеЗаписи = ВыборкаСсылка.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если НомерПП = 0 Тогда 
				ОбластьШапка.Параметры.Организация = ВыборкаДетальныеЗаписи.Организация;
				ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, ВыборкаДетальныеЗаписи,, "Дата, ДатаПриказа");
				ОбластьШапка.Параметры.ДатаПриказа = Формат(ВыборкаДетальныеЗаписи.ДатаПриказа, "ДЛФ=Д");
				ОбластьШапка.Параметры.Дата = Формат(ВыборкаДетальныеЗаписи.Дата, "ДФ=дд.ММ.гггг");
				ТабличныйДокумент.Вывести(ОбластьШапка);
				
				ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры, ВыборкаДетальныеЗаписи,
					"ОбъектРемонта,Комментарий,НомерСметы");
			Иначе
				ОбластьКомиссия.Параметры.ЧленКомиссии = ВыборкаДетальныеЗаписи.ЧленКомиссии;
				ТабличныйДокумент.Вывести(ОбластьКомиссия);
			КонецЕсли;
			НомерПП = НомерПП + 1;
		КонецЦикла;
		
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		ВыборкаТМЦСсылка.Сбросить();
		Если ВыборкаТМЦСсылка.НайтиСледующий(Новый Структура("Ссылка", ВыборкаСсылка.Ссылка)) Тогда 
			
			ВыборкаДетальныеЗаписиТМЦ = ВыборкаТМЦСсылка.Выбрать();
			Пока ВыборкаДетальныеЗаписиТМЦ.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(ОбластьПодвалСтрока.Параметры, ВыборкаДетальныеЗаписиТМЦ);
				Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписиТМЦ.ЕдиницаИзмерения) Тогда 
					ОбластьПодвалСтрока.Параметры.ЕдиницаИзмерения = ВыборкаДетальныеЗаписиТМЦ.ЕдиницаИзмерения;
				Иначе
					ОбластьПодвалСтрока.Параметры.ЕдиницаИзмерения = 
						ВыборкаДетальныеЗаписиТМЦ.НоменклатураЕдиницаИзмерения;
				КонецЕсли;
				
				ТабличныйДокумент.Вывести(ОбластьПодвалСтрока);
			КонецЦикла;   
			
		КонецЕсли;
	КонецЦикла;
	
	// Зададим параметры макета
	ТабличныйДокумент .АвтоМасштаб	= Истина;
	ТабличныйДокумент .ПолеСверху  = 0;
	ТабличныйДокумент .ПолеСлева   = 0;
	ТабличныйДокумент .ПолеСнизу   = 0;
	ТабличныйДокумент .ПолеСправа  = 0;
	ТабличныйДокумент .ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	
	Возврат ТабличныйДокумент ;

КонецФункции 

Функция гкс_ТекстЗапросаДефектныйАкт2026()
	
	Возврат
	"ВЫБРАТЬ
	|	ДокументАктОВыполненииЭтапаРабот.Ссылка КАК Ссылка,
	|	ДокументАктОВыполненииЭтапаРабот.Организация КАК Организация,
	|	ДокументАктОВыполненииЭтапаРабот.Номер КАК Номер,
	|	ДокументАктОВыполненииЭтапаРабот.Дата КАК Дата,
	|	ДокументАктОВыполненииЭтапаРабот.Комментарий КАК Комментарий,
	|	ДокументАктОВыполненииЭтапаРабот.Комиссия КАК Комиссия
	|ПОМЕСТИТЬ ВТДанныеДокумента
	|ИЗ
	|	Документ.торо_АктОВыполненииЭтапаРабот КАК ДокументАктОВыполненииЭтапаРабот
	|ГДЕ
	|	ДокументАктОВыполненииЭтапаРабот.Ссылка В(&Ссылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктОВыполненииЭтапаРаботДокументыОснования.Ссылка КАК АктСсылка,
	|	ЗаявкаНаРемонт.Номер КАК НомерСметы
	|ПОМЕСТИТЬ ВТСметы
	|ИЗ
	|	Документ.торо_АктОВыполненииЭтапаРабот.ДокументыОснования КАК АктОВыполненииЭтапаРаботДокументыОснования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт КАК ЗаявкаНаРемонт
	|		ПО АктОВыполненииЭтапаРаботДокументыОснования.ДокументОснование = ЗаявкаНаРемонт.Ссылка
	|ГДЕ
	|	АктОВыполненииЭтапаРаботДокументыОснования.Ссылка В(&Ссылка)
	|	И АктОВыполненииЭтапаРаботДокументыОснования.НомерСтроки = 1
	|	И ТИПЗНАЧЕНИЯ(АктОВыполненииЭтапаРаботДокументыОснования.ДокументОснование) = ТИП(Документ.торо_ЗаявкаНаРемонт)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДанныеДокумента.Ссылка КАК Ссылка,
	|	ВТДанныеДокумента.Организация КАК Организация,
	|	ВТДанныеДокумента.Комментарий КАК Комментарий,
	|	ВТДанныеДокумента.Номер КАК Номер,
	|	ВТДанныеДокумента.Дата КАК Дата,
	|	ПРЕДСТАВЛЕНИЕ(РемонтыОборудования.ОбъектРемонта) КАК ОбъектРемонта,
	|	ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(СправочникКомиссии.Председатель), """") КАК Председатель,
	|	ЕСТЬNULL(СправочникКомиссии.гкс_ДатаПриказа, """") КАК ДатаПриказа,
	|	ЕСТЬNULL(СправочникКомиссии.гкс_НомерПриказа, """") КАК НомерПриказа,
	|	ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(КомиссииСоставКомиссии.ЧленКомиссии), """") КАК ЧленКомиссии,
	|	ЕСТЬNULL(ВТСметы.НомерСметы, """") КАК НомерСметы
	|ИЗ
	|	ВТДанныеДокумента КАК ВТДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК РемонтыОборудования
	|		ПО (РемонтыОборудования.Ссылка = ВТДанныеДокумента.Ссылка)
	|			И (РемонтыОборудования.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_Комиссии КАК СправочникКомиссии
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_Комиссии.СоставКомиссии КАК КомиссииСоставКомиссии
	|			ПО СправочникКомиссии.Ссылка = КомиссииСоставКомиссии.Ссылка
	|		ПО ВТДанныеДокумента.Комиссия = СправочникКомиссии.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСметы КАК ВТСметы
	|		ПО ВТДанныеДокумента.Ссылка = ВТСметы.АктСсылка
	|ИТОГИ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктОВыполненииЭтапаРаботМатериальныеЗатраты.Ссылка КАК Ссылка,
	|	АктОВыполненииЭтапаРаботМатериальныеЗатраты.Номенклатура КАК Номенклатура,
	|	АктОВыполненииЭтапаРаботМатериальныеЗатраты.Количество КАК Количество,
	|	ПРЕДСТАВЛЕНИЕ(АктОВыполненииЭтапаРаботМатериальныеЗатраты.ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
	|	ПРЕДСТАВЛЕНИЕ(СправочникНоменклатура.ЕдиницаИзмерения) КАК НоменклатураЕдиницаИзмерения,
	|	СправочникНоменклатура.Код КАК Код
	|ИЗ
	|	Документ.торо_АктОВыполненииЭтапаРабот.МатериальныеЗатраты КАК АктОВыполненииЭтапаРаботМатериальныеЗатраты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО АктОВыполненииЭтапаРаботМатериальныеЗатраты.Номенклатура = СправочникНоменклатура.Ссылка
	|ГДЕ
	|	АктОВыполненииЭтапаРаботМатериальныеЗатраты.Ссылка В(&Ссылка)
	|ИТОГИ ПО
	|	Ссылка";
	
КонецФункции	

#КонецОбласти  

