#Область ОбработчикиСобытий

&ИзменениеИКонтроль("ПроверитьЗаполнениеТабличнойЧастиТрудовыеЗатраты")
Процедура Расш_гкс_ПроверитьЗаполнениеТабличнойЧастиТрудовыеЗатраты(Отказ)

	ИмяТабличнойЧасти = "ТрудовыеЗатраты";

	#Вставка
	ПредставлениеТабличнойЧасти = ЭтотОбъект.Метаданные().ТабличныеЧасти.ТрудовыеЗатраты.Представление();

	МетаданныеРеквизиты = ЭтотОбъект.Метаданные().ТабличныеЧасти.ТрудовыеЗатраты.Реквизиты;
	Для Каждого СтрокаРемонт Из РемонтыОборудования Цикл
		Если ИсполнителиПоРемонтам.Количество() И ТипЗнч(ИсполнителиПоРемонтам[0].Исполнитель) = Тип("СправочникСсылка.Контрагенты") Тогда 
			ИмяПоля = "Квалификация";
		Иначе
			// гкс+ [Релиз16] Деснол
			Продолжить;
			// гкс- [Релиз16]
			ИмяПоля = "Сотрудник";
		КонецЕсли;
		Для Каждого СтрокаТЗ Из ТрудовыеЗатраты Цикл
			Если СтрокаТЗ.РемонтыОборудования_ID = СтрокаРемонт.ID Тогда 
				Если ЗначениеЗаполнено(СтрокаТЗ[ИмяПоля]) = Ложь Тогда 
					СтрокаНачалаСообщенияОбОшибке = 
		НСтр("es='En la línea el número %1 partes tabulares ""%2"": ';
		|ru='В строке номер %1 табличной части ""%2"": ';en='In line number% 1 of table part ""% 2"": '");
					СтрокаНачалаСообщенияОбОшибке = СтрШаблон(СтрокаНачалаСообщенияОбОшибке,СокрЛП(СтрокаТЗ.НомерСтроки),ПредставлениеТабличнойЧасти);
					
					ПредставлениеРеквизита = МетаданныеРеквизиты[ИмяПоля].Представление();
					СтрокаСообщения = НСтр("es='""%1""!';ru='Не заполнено значение реквизита ""%1""!';en='Requisite value ""%1"" is not filled!'");
					СтрокаСообщения = СтрШаблон(СтрокаСообщения,СокрЛП(ПредставлениеРеквизита));

					ОбщегоНазначения.СообщитьПользователю(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения,,,, Отказ);
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Возврат;
	Если ИсполнителиПоРемонтам.Количество() И ТипЗнч(ИсполнителиПоРемонтам[0].Исполнитель) = Тип("СправочникСсылка.Контрагенты") Тогда 
		СтруктураОбязательныхПолей = Новый Структура("Квалификация");
	Иначе
	#КонецВставки
	СтруктураОбязательныхПолей = Новый Структура("Сотрудник");
	Если Константы.торо_ЗапретитьПроведениеАктовСИсполнителямиБезКвалификаций.Получить() Тогда
		СтруктураОбязательныхПолей.Вставить("Квалификация");
	КонецЕсли;
	#Вставка
	КонецЕсли;
	#КонецВставки
	торо_ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, ИмяТабличнойЧасти, СтруктураОбязательныхПолей, Отказ, "");

КонецПроцедуры

// гкс+ [Релиз 1] Куст 16.12.2020
&После("ПриЗаписи")
Процедура Расш_гкс_ПриЗаписи(Отказ)
	Если Не Отказ И Проведен Тогда 
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ Различные
		               |	торо_ВыявленныеДефектыСрезПоследних.Регистратор КАК Регистратор,
					   |	торо_ВыявленныеДефектыСрезПоследних.ID КАК ИД
		               |ИЗ
		               |	РегистрСведений.торо_ВыявленныеДефекты.СрезПоследних(
		               |			,
		               |			ID В
		               |				(ВЫБРАТЬ Различные
		               |					ТЧ.ID
		               |				ИЗ
		               |					Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК ТЧ
					   |	где ТЧ.Ссылка = &Ссылка)) КАК торо_ВыявленныеДефектыСрезПоследних
		               |ГДЕ
		               |	торо_ВыявленныеДефектыСрезПоследних.Регистратор.гкс_Влияние В 
					   | (Значение(Перечисление.гкс_Влияние.ЭкономическиеПотери), Значение(Перечисление.гкс_Влияние.БезЭкономическихПотерь))";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() = Ложь Тогда 
			МассивИД = Новый Массив();
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				МассивИД.Добавить(Выборка.ИД);
			КонецЦикла;
			ОбновитьСостояниеОР(МассивИД);
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры
// гкс- [Релиз 1] Куст 16.12.2020

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// гкс+ [Релиз 1] Куст 16.12.2020
Процедура ОбновитьСостояниеОР(МассивИД)
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
					|	ТЧ.ОбъектРемонта КАК ОР,
					|	ТЧ.ID КАК ИД_Ремонта,
					|	ТЧ.ДатаОкончания КАК ДатаОкончания
					|ПОМЕСТИТЬ ВсеОР
					|ИЗ
					|	Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК ТЧ
					|ГДЕ
					|	ТЧ.Ссылка = &Акт И
					|	ТЧ.ID В(&МассивИД)
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВсеОР.ИД_Ремонта КАК ИД_Ремонта,
					|	МАКСИМУМ(Рег.ОбъектРемонта) КАК ФМ
					|ПОМЕСТИТЬ ФМДляРемонта
					|ИЗ
					|	ВсеОР КАК ВсеОР
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВыявленныеДефекты.СрезПоследних КАК Рег
					|		ПО ВсеОР.ИД_Ремонта = Рег.ID
					|
					|СГРУППИРОВАТЬ ПО
					|	ВсеОР.ИД_Ремонта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(Рег.Период) КАК Период, ТЧ.ДатаОкончания КАК ДатаОкончания,
	               |	Рег.ОбъектРемонта КАК ОР, ТЧ.ИД_Ремонта
	               |ПОМЕСТИТЬ ВсеСостояния
	               |ИЗ
	               |	РегистрСведений.торо_ТекущееСостояниеОР КАК Рег
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВсеОР КАК ТЧ
	               |		ПО Рег.ОбъектРемонта = ТЧ.ОР
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Рег.ОбъектРемонта, ТЧ.ДатаОкончания, ТЧ.ИД_Ремонта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Рег.ВидЭксплуатации КАК ВидЭксплуатации,
	               |	Рег.Период КАК Период,
				   |	ЕстьNull(ФМДляРемонта.ФМ, Рег.ОбъектРемонта) КАК ФМ,
	               |	Рег.ОбъектРемонта КАК ОР, ВсеСостояния.ДатаОкончания КАК ДатаОкончания
	               |ИЗ
	               |	ВсеСостояния КАК ВсеСостояния
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ТекущееСостояниеОР КАК Рег
	               |		ПО ВсеСостояния.Период = Рег.Период
	               |			И ВсеСостояния.ОР = Рег.ОбъектРемонта
				   |			И Рег.Период <= ВсеСостояния.ДатаОкончания
				   |		Левое соединение ФМДляРемонта КАК ФМДляРемонта
				   |		ПО ФМДляРемонта.ИД_Ремонта = ВсеСостояния.ИД_Ремонта
				   |ГДЕ
	               |	Рег.ВидЭксплуатации.ТипЭксплуатации = Значение(Перечисление.торо_ТипЭксплуатации.Простой)" 
+ " ; " + "
				   |Выбрать
				   |ТЧ.Ссылка КАК Ссылка, ТЧ.Проведен КАК Проведен
				   |ИЗ Документ.торо_СостоянияОбъектовРемонта КАК ТЧ
				   |Где ТЧ.гкс_ПричинаСоздания = 2 И ТЧ.ДокументОснование = &Акт
				   |Упорядочить По ТЧ.Проведен
				   |
				   |
				   |
				   |
				   |
				   |
				   |";
	Запрос.УстановитьПараметр("Акт", Ссылка);
	Запрос.УстановитьПараметр("МассивИД", МассивИД);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ДокСост = Неопределено;
	ПервыйПакет = 3;
	ВторойПакет = ПервыйПакет + 1;
	ТекИерархия = Константы.торо_ИерархияДляВводаНовыхОР.Получить();
	Если Не РезультатЗапроса[ВторойПакет].Пустой() Тогда 
		ВыборкаДок = РезультатЗапроса[ВторойПакет].Выбрать();
		Если ВыборкаДок.Следующий() Тогда 
			ДокСост = ВыборкаДок.Ссылка.ПолучитьОбъект();
		КонецЕсли;
	КонецЕсли;
	Если Не РезультатЗапроса[ПервыйПакет].Пустой() Тогда 
		Если ДокСост = Неопределено Тогда 
			ДокСост = Документы.торо_СостоянияОбъектовРемонта.СоздатьДокумент();
			ДокСост.Дата = ТекущаяДата();
			ДокСост.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		Иначе
			Если ДокСост.ПометкаУдаления = Истина Тогда 
				ДокСост.УстановитьПометкуУдаления(Ложь);
			КонецЕсли;
		КонецЕсли;
		ДокСост.ВидОперации = Перечисления.торо_ВидыОперацийОтклоненияВРаботеОборудования.ВидЭксплуатации;
		ДокСост.Организация = Организация;
		ДокСост.Подразделение = Подразделение;
		ДокСост.ВидЭксплуатации = Справочники.торо_ВидыЭксплуатации.гкс_Эксплуатация;
		ДокСост.гкс_ПричинаСоздания = 2;
		ДокСост.ДокументОснование = Ссылка;
		ДокСост.ОбъектыРемонта.Очистить();
		Выборка = РезультатЗапроса[ПервыйПакет].Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрокаТабличнойЧасти = ДокСост.ОбъектыРемонта.Добавить();
			НоваяСтрокаТабличнойЧасти.ДатаОкончания = Выборка.ДатаОкончания;
			НоваяСтрокаТабличнойЧасти.ОбъектРемонта = Выборка.ФМ;
			НоваяСтрокаТабличнойЧасти.Иерархия = ТекИерархия;
			НоваяСтрокаТабличнойЧасти.ВидЭксплуатации = Справочники.торо_ВидыЭксплуатации.гкс_Эксплуатация;
			НоваяСтрокаТабличнойЧасти.ИзменятьСостояниеПодчиненныхОР = Истина;
		КонецЦикла;
		ДокСост.Записать(РежимЗаписиДокумента.Проведение);
	Иначе
		Если Не ДокСост = Неопределено И ДокСост.ПометкаУдаления = Ложь Тогда 
			ДокСост.УстановитьПометкуУдаления(Истина);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
// гкс- [Релиз 1] Куст 16.12.2020

#КонецОбласти

// гкс+ [разработка 2021] Куст 27.04.2021
&ИзменениеИКонтроль("ПередЗаписью")
Процедура гкс_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ФОВводНаОснованииПроведенного = Константы.торо_ВводПотребленияНаОснованииПроведенногоАкта.Получить();
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения И ФОВводНаОснованииПроведенного Тогда
		ПроверитьНаличиеВведенныхНаОснованииВнутренныхПотреблений(Отказ);
	КонецЕсли; 
	#Вставка
	// Гкс+[TOIR20-591] Зозуля А.В. от 23.06.2025. Добавлено:{
	Если ОбменДанными.Загрузка = Ложь И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если гкс_ИнтеграцияС1СДокументооборот.НетПрикрепленныхФайловДО(Ссылка) Тогда  
			ТекстСообщения = НСтр("es='Para publicar un documento, debe agregar un archivo a la pestaña «La circulación de documentos»';
									  |ru='Для проведения документа необходимо прикрепить файл на вкладку «Документооборот» в документе «Акт о выполнении этапа работ»';
									  |en='To post a document, you need to add a file to the “Document managment” tab'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Отказ = Истина;			
		КонецЕсли;	
	КонецЕсли;	
	// } Гкс-[TOIR20-591] Зозуля А.В. от 23.06.2025.
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		Для Каждого СтрокаРемонтныхРабот Из РемонтныеРаботы Цикл
			СтрокаРемонтныхРабот.Выполнено = Истина;
		КонецЦикла;
		гкс_РаботыВыполнены = Истина;
	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда 
		гкс_РаботыВыполнены = Ложь;
	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.Запись Тогда 
		гкс_РаботыВыполнены = Проведен;
	КонецЕсли;
	#КонецВставки
КонецПроцедуры
// гкс- [разработка 2021] Куст 27.04.2021

