#Область ОбработчикиСобытий

&После("ПередЗаписью")
Процедура Расш_гкс_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	МассивОР = ОбъектыРемонта.ВыгрузитьКолонку("ОбъектРемонта");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ОбъектыРемонта.Ссылка КАК ОР
		|ИЗ
		|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|ГДЕ
		|	торо_ОбъектыРемонта.Ссылка В(&Ссылка)
		|	И торо_ОбъектыРемонта.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто)";
	Запрос.УстановитьПараметр("Ссылка", МассивОР);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() = Ложь Тогда 
		Отказ = истина;
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru = """ + Выборка.ОР + 
				" является функциональным местом! Выберите объект ремонта."";");
			Сообщение.Сообщить();
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти