&НаКлиенте
Перем НужноСортироватьПланРемонтов;
&НаКлиенте
Перем ДатаНачСтрокиРедактирования;
&НаКлиенте
Перем ДатаКонСтрокиРедактирования;

&НаКлиенте
Перем УровеньПоложенияВДереве;
&НаКлиенте
Перем УровеньОрВДереве;


#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства

	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	Если Параметры.Свойство("Основание") Тогда
		торо_ЗаполнениеДокументов.ПроверитьВозможностьВводаНаОсновании(Параметры.Основание,Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	
	Если Параметры.Свойство("ID") Тогда
		
		Строки = Объект.ПланРемонтов.НайтиСтроки(Новый Структура("ID", Параметры.ID));
		Если Строки.Количество() Тогда
			Элементы.ПланРемонтов.ТекущаяСтрока = Строки[0].ПолучитьИдентификатор();
		КонецЕсли;
		
	КонецЕсли;
	
	ТекДата = ТекущаяДата();
	
	Если Параметры.Свойство("ВидОперации") Тогда 	
		Объект.ВидОперации = Параметры.ВидОперации;
	ИначеЕсли Объект.ВидОперации = Перечисления.торо_ВидыОперацийПланаГрафикаППР.ПустаяСсылка() Тогда
		
		Объект.ВидОперации = Перечисления.торо_ВидыОперацийПланаГрафикаППР.ПланРабот;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		// Заполнить реквизиты значениями по умолчанию.
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			Объект.Организация = Параметры.ЗначениеКопирования.Организация;
			Объект.Подразделение = Параметры.ЗначениеКопирования.Подразделение;
			Объект.ПериодичностьДетализации = Параметры.ЗначениеКопирования.ПериодичностьДетализации;
			Объект.КоличествоПериодов = Параметры.ЗначениеКопирования.КоличествоПериодов;
			
			Объект.ПланРемонтов.Очистить();
		Иначе 
			Если НЕ ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
				Объект.ДатаПланирования = КонецГода(ТекДата)+1;
				Объект.ПериодичностьДетализации = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
				"НастройкиТОиР",
				"ОсновнойПериодПланирования",
				Истина);
				
				Если НЕ ЗначениеЗаполнено(Объект.ПериодичностьДетализации) Тогда
					Объект.ПериодичностьДетализации = Перечисления.Периодичность.Год;
				КонецЕсли;
				
				Объект.КоличествоПериодов = 1;
			КонецЕсли;
			
			ОрганизацияИзНастроек = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
				"НастройкиТОиР",
				"ОсновнаяОрганизация");
			ПодразделениеИзНастроек = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
				"НастройкиТОиР",
				"ОсновноеПодразделение");	
				
			Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
				
				Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
					Объект.Организация = ОрганизацияИзНастроек;
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(Объект.Подразделение) Тогда
					Объект.Подразделение = ПодразделениеИзНастроек;
				КонецЕсли;
				
			Иначе
				Объект.Организация = ОрганизацияИзНастроек;
				
				Объект.Подразделение = ПодразделениеИзНастроек;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Объект.Ответственный) Тогда
				
				Объект.Ответственный = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
				"НастройкиТОиР",
				"ОсновнойОтветственный",
				Справочники.Пользователи.ПустаяСсылка());
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	мОтображатьПоложение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			"НастройкиТОиР",
			"ПоказыватьПоложениеОР",
			Истина);
			
	ПоказыватьСообщениеПриРасчетеППР = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			"НастройкиТОиР",
			"ПоказыватьСообщениеПриРасчетеППР",
			Истина);
			
	Элементы.ДеревоПланаГрафикаППРСУчетомПозицииПоказыватьПоложение.Пометка = мОтображатьПоложение;
	
	СтруктураИерархии = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			"НастройкиТОиР",
			"ОсновнаяСтруктураИерархии",
			Истина);
			
	Если Не ЗначениеЗаполнено(СтруктураИерархии) Тогда
		СтруктураИерархии = Константы.торо_ИерархияДляВводаНовыхОР.Получить();
	КонецЕсли; 
	
	ЗаполнитьДеревоПланаГрафикаППРСУчетомПозиции();
	ОбновитьДокументыЗаказНаВнПотреблениеСервер();

		
	// Запомнить текущие значения реквизитов формы.
	мТекущаяДатаДокумента       = Объект.Дата;
	Если ЗначениеЗаполнено(Объект.ПериодичностьДетализации) Тогда		
		мДатаОкончанияПланирования = ОбщегоНазначенияУТКлиентСервер.РассчитатьДатуОкончанияПериода(Объект.ДатаПланирования, Объект.ПериодичностьДетализации, Объект.КоличествоПериодов);
	Иначе
		ТекстСообщения = НСтр("es='de la planificación!';ru='Не выбран период планирования!';en='No planning period selected!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	ПравоИнтерактивнаяПометкаУдаленияДокументаЗаказНаВнутреннееПотребление = ПравоДоступа("ИнтерактивнаяПометкаУдаления", Метаданные.Документы.ЗаказНаВнутреннееПотребление);
	ПравоИнтерактивноеДобавлениеДокументаЗаказНаВнутреннееПотребление = ПравоДоступа("ИнтерактивноеДобавление", Метаданные.Документы.ЗаказНаВнутреннееПотребление);
	ПравоРедактирование = ПравоДоступа("Редактирование", Метаданные.Документы.торо_ПланГрафикРемонта);
	
	ФОИспользоватьОстановочные	= ПолучитьФункциональнуюОпцию("торо_ИспользоватьОстановочныеРемонты");
	
	Если ФОИспользоватьОстановочные Тогда
		ОбновитьОстановочные();
	КонецЕсли;
	ОбновитьДоступностьДляРедактирования();
		
	торо_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(Объект, ЭтаФорма, Строка(Объект.ВидОперации));
	
	// Согласование++
	ВидДокумента = Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_ПланГрафикРемонта;
	торо_РаботаССогласованиями.ПриСозданииНаСервере(ЭтаФорма, ВидДокумента);
	// Согласование --

	// Если открываем документ их обработки и нужно активировать указанную строку
	Если Параметры.Свойство("АктивироватьСтроку") Тогда
		ТекСтрокаИзВнеID = Параметры.ТекСтрокаИзОбработкиID;
	КонецЕсли;
	
	// Ограничение ввода на основании
	торо_СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка, Новый Структура("ОграничитьВводНаОсновании, УстановитьСвойствоЭлементовФормыОтПрав",Истина, Истина));
	
	// видимость легенды диаграммы
	Элементы.ЛегендаДиаграммы.Видимость = Элементы.ПоказатьЛегенду.Пометка;
	
	ФОИспользоватьПриоритетностьПеренесенныхРемонтов = Константы.торо_ИспользоватьПриоритетностьПеренесенныхРемонтов.Получить();
	Элементы.ПланРемонтовПеренесенный.Видимость = ФОИспользоватьПриоритетностьПеренесенныхРемонтов;
	
	УправлениеВидимостью(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
    УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	УстановитьДоступностьКнопкиНастройкаИерархии();
	РазвернутьВсеВетвиДеревьев();
	УстановитьВнешнийВидФормы();
	// Вывести в заголовке формы вид операции.
	
	// Если открываем документ их обработки и нужно активировать указанную строку
	Если ТекСтрокаИзВнеID<>"" Тогда
		АктивироватьСтрокуИзВне(ТекСтрокаИзВнеID);			
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПараметрыЗаписи.Вставить("НужноСортироватьПланРемонтов", НужноСортироватьПланРемонтов);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Объект.Дата > Объект.ДатаПланирования Тогда
		ТекстСообщения = НСтр("es='La fecha del documento no puede ser más de fechas de la planificación';ru='Дата документа не может быть больше даты планирования';en='The document date cannot be greater than the planning date.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

	ЗаписатьДеревоППРСУчетомПозиции(ТекущийОбъект);
	
	// Согласование++
	торо_РаботаССогласованиями.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	// Согласование--
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Согласование++
	торо_РаботаССогласованиями.ПриЗаписиНаСервере(ЭтаФорма, ТекущийОбъект);
	// Согласование--
	
	Если ПараметрыЗаписи.НужноСортироватьПланРемонтов Тогда
		
		ТекущийОбъект.ПланРемонтов.Сортировать("ДатаНач возр");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ФОИспользоватьОстановочные	= ПолучитьФункциональнуюОпцию("торо_ИспользоватьОстановочныеРемонты");
	Если ФОИспользоватьОстановочные Тогда
		ОбновитьОстановочные();
	КонецЕсли;	
	
	торо_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(Объект, ЭтаФорма, Строка(Объект.ВидОперации));
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	НужноСортироватьПланРемонтов = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства

	Если ИмяСобытия = "КорректировкаППРПоЛимитам" Тогда
		МассивСтрокУдаления = Параметр;
		Если МассивСтрокУдаления = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Для Каждого ТекЗначение Из МассивСтрокУдаления Цикл
			СтрокиРемонта = Объект.ПланРемонтов.НайтиСтроки(Новый Структура("ID",ТекЗначение));
			Для каждого ТекСтрока Из СтрокиРемонта Цикл
				ТекСтрока.Отменен = Истина;
			КонецЦикла;
		КонецЦикла;
		Модифицированность = Истина;
	КонецЕсли;
	
	Если ИмяСобытия = "СозданДокументЧерезРМТехСпец" ТОгда
		ОбновитьДоступностьДляРедактирования();
	КонецЕсли;
	
	// Согласование++
	Если ИмяСобытия = "УтверждениеСтатусаСогласования" Тогда
		Если Параметр.Документ = Объект.Ссылка Тогда
			ЗавершитьУтверждениеСтатусаДокумента(Параметр);
		КонецЕсли;
	КонецЕсли;
	// Согласование--
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница = Элементы.Страницы.ПодчиненныеЭлементы.ГруппаПланГрафикППР Тогда
		Если НужноСортироватьПланРемонтов Тогда
			параметрОбъект = Объект;
			ИзмОбъект = ВыполнитьСортировкуТЧПланРемонтов(параметрОбъект);
			КопироватьДанныеФормы(ИзмОбъект, Объект);
			НужноСортироватьПланРемонтов = Ложь;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолосаРегулированияДиаграммыГантаПриИзменении(Элемент)
	Если ПолосаРегулированияДиаграммыГанта < 1 Тогда
		ДиаграммаГантаППР.ПоддержкаМасштаба 				= ПоддержкаМасштабаДиаграммыГанта.ВсеДанные;
	Иначе
		ДиаграммаГантаППР.ПоддержкаМасштаба 				= ПоддержкаМасштабаДиаграммыГанта.Период;
		ДиаграммаГантаППР.ЕдиницаПериодическогоВарианта 	= ТипЕдиницыШкалыВремени["День"];
		ДиаграммаГантаППР.КратностьПериодическогоВарианта 	= ПолосаРегулированияДиаграммыГанта;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаГантаППРПриОкончанииРедактированияИнтервала(Элемент, Интервал, ОтменаРедактирования)
	
	Если НЕ ПравоРедактирование ИЛИ ЭтаФорма["СогласованиеТолькоПросмотр"] Тогда
		ОтменаРедактирования = Истина;
		Возврат;
	КонецЕсли;
	
	Если Интервал.Цвет = WebЦвета.Черный
		ИЛИ Интервал.Расшифровка.ДоступенДляРедактирования <> Истина 
		ИЛИ Интервал.Цвет = WebЦвета.Красный Тогда
		
		ОтменаРедактирования = Истина;
	КонецЕсли;
	
	Если Не ОтменаРедактирования Тогда
		
		ОР = Интервал.Значение.Точка.Родитель.Расшифровка;
		ВР = Интервал.Значение.Точка.Расшифровка;
		ID = Интервал.Расшифровка.ID;
		 		
		Для каждого СтрокаПланРемонтов Из Объект.ПланРемонтов Цикл
			
			Если СтрокаПланРемонтов.ОбъектРемонтныхРабот = ОР И СтрокаПланРемонтов.ВидРемонтныхРабот = ВР И СтрокаПланРемонтов.ID = ID Тогда
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если Интервал.Начало = НачалоДня(Интервал.Начало) И Интервал.Конец = КонецДня(Интервал.Конец) Тогда 
			// Ничего не делать.
		 	ОтменаРедактирования = Истина;
		 
		ИначеЕсли Интервал.Начало = НачалоДня(Интервал.Конец) Тогда 
			// Однодневный ремонт.
			Интервал.Начало =  НачалоДня(Интервал.Начало);
		 	Интервал.Конец = КонецДня(Интервал.Конец); 
		Иначе
			Если Интервал.Начало = НачалоДня(Интервал.Начало) Тогда  
				// Перемещение только правой границы.
				Интервал.Конец = КонецДня(Интервал.Конец); 
			ИначеЕсли Интервал.Конец = КонецДня(Интервал.Конец) Тогда  
				// Перемещение только левой границы.
				Интервал.Начало = НачалоДня(Интервал.Начало);
			ИначеЕсли Интервал.Конец = СтрокаПланРемонтов.ДатаНач Тогда
				// Перемещение правой границы за левую (либо интервала целиком).
				Интервал.Конец = КонецДня(Интервал.Конец - 86400);
			    Интервал.Начало = НачалоДня(Интервал.Начало);
			ИначеЕсли Интервал.Начало = СтрокаПланРемонтов.ДатаКон Тогда
				// Перемещение левой границы за правую (либо интервала целиком).
			    Интервал.Начало = НачалоДня(Интервал.Начало + 86400);
			    Интервал.Конец = КонецДня(Интервал.Конец);
			Иначе 
				// Перемещение интервала целиком.
				Если Интервал.Начало < СтрокаПланРемонтов.ДатаНач Тогда  
					// Мы двигали влево, двигаем влево и дальше.
				    Интервал.Начало = НачалоДня(Интервал.Начало);
			    	Интервал.Конец = КонецДня(Интервал.Конец - 86400)
				Иначе 
					// Мы двигали вправо, двигаем вправо.
			    	Интервал.Начало = НачалоДня(Интервал.Начало + 86400);
			    	Интервал.Конец = КонецДня(Интервал.Конец);
		  		КонецЕсли; 
		 	КонецЕсли;
		КонецЕсли;
				
		Интервал.Текст = Строка(Интервал.Начало) + " - " + Строка(Интервал.Конец);
		
		СтрокаПланРемонтов.ДатаНач = Интервал.Начало;
		СтрокаПланРемонтов.ДатаКон = Интервал.Конец;
		Если ФОИспользоватьПриоритетностьПеренесенныхРемонтов Тогда
			СтрокаПланРемонтов.Перенесенный = Истина;
		КонецЕсли;
		Модифицированность = Истина;
		НужноСортироватьПланРемонтов = Истина;

		
		ТочкиДиаграммы = НайтиНужнуюТочкуДиаграммыГанта(ОР, ВР);
		
		Для каждого Точка Из ТочкиДиаграммы Цикл
			ЗначениеДиаграммы = ДиаграммаГантаППР.ПолучитьЗначение(Точка, ДиаграммаГантаППР.Серии[0]);
			
			Для каждого Инт Из ЗначениеДиаграммы Цикл
				
				Если Инт.Расшифровка.ID = ID Тогда
					
					Инт.Начало = Интервал.Начало;
					Инт.Конец = Интервал.Конец;
					Инт.Текст = Строка(Инт.Начало) + " - " + Строка(Инт.Конец);
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = Объект.Организация Тогда
		СтандартнаяОбработка = Ложь;
	Иначе
		Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
			Объект.ДокументОснование = Неопределено;
			ДокументОснованиеПриИзмененииНаСервере();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДокументОснованиеПриИзмененииЗавершение", ЭтаФорма);
	ПоказатьВопрос(ОписаниеОповещения,НСтр("es='¡Los datos del documento serán limpiados! ¿Continuar?';ru='Данные документа будут очищены! Продолжить?';en='Document data will be cleared! Continue?'"), РежимДиалогаВопрос.ДаНет,60);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПланированияПриИзменении(Элемент)
	
	ЗагрузитьРемонтыИзДокументаОснования();
	ОбновитьДоступностьДляРедактирования();

КонецПроцедуры

&НаКлиенте
Процедура КоличествоПериодовПриИзменении(Элемент)
	
	ЗагрузитьРемонтыИзДокументаОснования();
	ОбновитьДоступностьДляРедактирования();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьДетализацииПриИзменении(Элемент)
	
	ЗагрузитьРемонтыИзДокументаОснования();
	ОбновитьДоступностьДляРедактирования();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьРемонтыИзДокументаОснования(ИзмененаТЧОР = Ложь)
	
	Если Объект.ВидОперации = Перечисления.торо_ВидыОперацийПланаГрафикаППР.Корректировка Тогда
		Если ЗначениеЗаполнено(Объект.ПериодичностьДетализации) Тогда		
			мДатаОкончанияПланирования = ОбщегоНазначенияУТКлиентСервер.РассчитатьДатуОкончанияПериода(Объект.ДатаПланирования, Объект.ПериодичностьДетализации, Объект.КоличествоПериодов);
		Иначе
			ТекстСообщения = НСтр("es='de la planificación!';ru='Не выбран период планирования!';en='No planning period selected!'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		Если Не ИзмененаТЧОР Тогда
			ЗаписатьДеревоППРСУчетомПозиции();
		КонецЕсли;
		ТЗ_ПланРемонтов = Документы.торо_ПланГрафикРемонта.ПодобратьРемонтыДляКорректировки(мДатаОкончанияПланирования, Объект.ДокументОснование, Объект.ДатаПланирования, Объект.Ссылка, Истина,Объект.ОбъектыРемонта.Выгрузить());
		Объект.ПланРемонтов.Загрузить(ТЗ_ПланРемонтов);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьОбъектыВидыРемонтовИзДокументаОснования()
	
	Если Объект.ВидОперации = Перечисления.торо_ВидыОперацийПланаГрафикаППР.Корректировка Тогда
		ТЗ_ОбъектыРемонтов = Документы.торо_ПланГрафикРемонта.ПодобратьОбъектыДляКорректировки(Объект.ДокументОснование, Объект.Ссылка);
		Объект.ОбъектыРемонта.Загрузить(ТЗ_ОбъектыРемонтов);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
		Если ЗначениеЗаполнено(Объект.Подразделение) Тогда 
		ЕстьЗаполненныйСклад = Ложь;
		Для каждого Строка Из Объект.ПланРемонтов Цикл 
			Если ЗначениеЗаполнено(Строка.Склад) Тогда 
				ЕстьЗаполненныйСклад = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ЕстьЗаполненныйСклад Тогда
			Оповещение = Новый ОписаниеОповещения("ВопросОПерезаполненииСкладаЗавершение", ЭтотОбъект);
			ТекстВопроса = НСтр("es='¿Перезаполнить el almacén en la parte tabular?';ru='Перезаполнить склад в табличной части?';en='Refill the warehouse in the tabular section?'");
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Иначе
			ЗаполнитьСкладИзПодразделения(Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоПланаГрафикаППРСУчетомПозици
&НаКлиенте
Процедура ДеревоПланаГрафикаППРСУчетомПозицииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.торо_ОбъектыРемонта") Тогда
		
		ДеревоППРОбработкаВыбора_ОбъектРемонта(ВыбранноеЗначение);
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.торо_ВидыРемонтов") Тогда
		
		ДеревоППРОбработкаВыбора_ВидРемонта(ВыбранноеЗначение);
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.торо_ЦепочкиРемонта") Тогда
		
		ДеревоППРОбработкаВыбора_ЦепочкаРемонта(ВыбранноеЗначение);
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		
		Если ВыбранноеЗначение.Свойство("ОбъектРемонта") И ВыбранноеЗначение.Свойство("МассивЦепочек") Тогда
			
			ДеревоППРОбработкаВыбора_ИзФормыПодбораЦепочек(ВыбранноеЗначение);
			
		ИначеЕсли ВыбранноеЗначение.Свойство("СоответствиеОбъектовРемонта") Тогда
			
			ДеревоППРОбработкаВыбора_ИзФормыПодбораОР(ВыбранноеЗначение);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПланаГрафикаППРСУчетомПозицииПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.ДеревоПланаГрафикаППРСУчетомПозиции.ТекущиеДанные;
	СтрокаВыбрана = Не (ТекущаяСтрока = Неопределено);
	Элементы.ДеревоПланаГрафикаППРСУчетомПозицииДобавитьРемонт.Доступность = (СтрокаВыбрана И ТекущаяСтрока.Ремонты <> ПредставлениеПустогоРодителя()) И ПравоРедактирование И НЕ ЭтаФорма["СогласованиеТолькоПросмотр"];
	Элементы.ДеревоПланаГрафикаППРСУчетомПозицииДобавитьЦепочку.Доступность = (СтрокаВыбрана И ТекущаяСтрока.Ремонты <> ПредставлениеПустогоРодителя()) И ПравоРедактирование И НЕ ЭтаФорма["СогласованиеТолькоПросмотр"];
	
	// Отбор строк в плане ремонтов
	Если СтрокаВыбрана Тогда
		УстановитьОтборСтрокВПланеРемонтов(ТекущаяСтрока);
	КонецЕсли;
	
	ТекОбъект = Элементы.ДеревоПланаГрафикаППРСУчетомПозиции.ТекущиеДанные;
	Если НЕ ТекОбъект = Неопределено Тогда
		СтрРодитель = ТекОбъект.ПолучитьРодителя();
		Если СтрРодитель <> Неопределено Тогда
			ЗаблокироватьСтрокиВПланеРемонтовПоID(ТекОбъект.Ремонты, СтрРодитель.Ремонты);
		Иначе
			ЗаблокироватьСтрокиВПланеРемонтовПоID(ТекОбъект.Ремонты);
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ПланРемонтов.ТекущаяСтрока = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПланаГрафикаППРСУчетомПозицииПослеУдаления(Элемент)
	МассивУдаляемыхСтрок = Новый Массив;
	Для Каждого ЭлементПервогоУровня Из ДеревоПланаГрафикаППРСУчетомПозиции.ПолучитьЭлементы() Цикл
		Если ЭлементПервогоУровня.ПолучитьЭлементы().Количество() = 0 Тогда
			МассивУдаляемыхСтрок.Добавить(ЭлементПервогоУровня);
		КонецЕсли;
	КонецЦикла;	
	Для Каждого УдаляемыйЭлемент Из МассивУдаляемыхСтрок Цикл
		Индекс = ДеревоПланаГрафикаППРСУчетомПозиции.ПолучитьЭлементы().Индекс(УдаляемыйЭлемент);
		ДеревоПланаГрафикаППРСУчетомПозиции.ПолучитьЭлементы().Удалить(Индекс);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПланаГрафикаППРСУчетомПозицииПередУдалением(Элемент, Отказ)
	
	Если МодифицируемыйОбъектРемонта Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекСтрокаДерева = Элементы.ДеревоПланаГрафикаППРСУчетомПозиции.ТекущиеДанные;
	
	Если ТипЗнч(ТекСтрокаДерева.Ремонты) = Тип("СправочникСсылка.торо_ВидыРемонтов") ИЛИ ТипЗнч(ТекСтрокаДерева.Ремонты) = Тип("СправочникСсылка.торо_ЦепочкиРемонта") Тогда
		УдалитьИнформациюПоСтрокеДереваПланаГрафикаППР(ТекСтрокаДерева.ПолучитьРодителя().Ремонты, ТекСтрокаДерева.Ремонты);
	Иначе
		
		СтрокиВидаРемонтов = ТекСтрокаДерева.ПолучитьЭлементы();
		Для каждого Стр Из СтрокиВидаРемонтов Цикл
			
			УдалитьИнформациюПоСтрокеДереваПланаГрафикаППР(ТекСтрокаДерева.Ремонты, Стр.Ремонты, Стр);
			
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПланаГрафикаППРСУчетомПозицииРемонтыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПланаГрафикаППРСУчетомПозицииРемонтыАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПланРемонтов
&НаКлиенте
Процедура ПланРемонтовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если Копирование Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТекСтрокаДерева = Элементы.ДеревоПланаГрафикаППРСУчетомПозиции.ТекущиеДанные;
	
	Если ТекСтрокаДерева = Неопределено ИЛИ ТипЗнч(ТекСтрокаДерева.Ремонты) <> Тип("СправочникСсылка.торо_ВидыРемонтов") Тогда
		
		ПоказатьПредупреждение(Неопределено,НСтр("es='¡Indiquen el tipo de los trabajos de reparación para la introducción de los datos del gráfico ППР!';ru='Укажите вид ремонтных работ для ввода данных графика ППР!';en='Specify the type of repair work for entering the data of the PPM schedule!'"), 20);
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПланРемонтовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		
		ТекДанные = Элементы.ПланРемонтов.ТекущиеДанные;
		ТекДанные.ID = Новый УникальныйИдентификатор;
		
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.торо_ВидыОперацийПланаГрафикаППР.Корректировка") Тогда
			ТекДанные.ДатаНачСт = Дата(1,1,1);
			ТекДанные.ДатаКонСт = Дата(1,1,1);
		КонецЕсли;
				
		Если Не Копирование Тогда
			
			ТекСтрокаДереваППР             = Элементы.ДеревоПланаГрафикаППРСУчетомПозиции.ТекущиеДанные;
			ТекДанные.ОбъектРемонтныхРабот = ТекСтрокаДереваППР.ПолучитьРодителя().Ремонты;
			ТекДанные.ВидРемонтныхРабот    = ТекСтрокаДереваППР.Ремонты;
			
		КонецЕсли; 
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПланРемонтовПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.торо_ВидыОперацийПланаГрафикаППР.Корректировка") Тогда
		мНеверныйПериодПоКорректировке = Ложь;			
		ТекСтрокаПланРемонтов = Элемент.ТекущиеДанные;		
		Если ТекСтрокаПланРемонтов.ДатаКонСт < ТекСтрокаПланРемонтов.ДатаНачСт Тогда
			ШаблонСообщения = НСтр("es='La fecha de la terminación del período es más pequeña que la fecha del comienzo (%1 - %2)';ru='Дата окончания периода меньше даты начала (%1 - %2)';en='Period end date is less than start date (%1 -%2)'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекСтрокаПланРемонтов.ДатаНачСт, ТекСтрокаПланРемонтов.ДатаКонСт);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			мНеверныйПериодПоКорректировке = Истина;			
		КонецЕсли;	
		Если ТекСтрокаПланРемонтов.ДатаКон < ТекСтрокаПланРемонтов.ДатаНач Тогда
			ШаблонСообщения = НСтр("es='La fecha de la terminación del nuevo período es más pequeña que la fecha del comienzo (%1 - %2)';ru='Дата окончания нового периода меньше даты начала (%1 - %2)';en='The end date of the new period is less than the start date (%1 -%2)'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекСтрокаПланРемонтов.ДатаНач, ТекСтрокаПланРемонтов.ДатаКон);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			мНеверныйПериодПоКорректировке = Истина;			
		КонецЕсли;	
	КонецЕсли;
	
	ТекДанныеПланаРемонтов = Элементы.ПланРемонтов.ТекущиеДанные;
	Если ТекДанныеПланаРемонтов<>Неопределено Тогда 
		ДатаНачалаРемонта = ТекДанныеПланаРемонтов.ДатаНач;
		ДатаОкончанияРемонта = ТекДанныеПланаРемонтов.ДатаКон;
	Иначе	
		ДатаНачалаРемонта = Дата(1,1,1);
		ДатаОкончанияРемонта = Дата(1,1,1);	
	КонецЕсли;
	Если  Не ДатаНачалаРемонта = Дата(1,1,1) И Не ДатаОкончанияРемонта = Дата(1,1,1) Тогда
		МассивСтрокВидаРемонта = Объект.ПланРемонтов.НайтиСтроки(Новый Структура("ОбъектРемонтныхРабот, ВидРемонтныхРабот", ТекДанныеПланаРемонтов.ОбъектРемонтныхРабот, ТекДанныеПланаРемонтов.ВидРемонтныхРабот));
		
		Для Каждого СтрокаВидаРемонта Из МассивСтрокВидаРемонта Цикл
			Если СтрокаВидаРемонта.ID <> Элемент.ТекущиеДанные.ID И ((СтрокаВидаРемонта.ДатаНач <= ДатаОкончанияРемонта И СтрокаВидаРемонта.ДатаНач >= ДатаНачалаРемонта)
				ИЛИ (СтрокаВидаРемонта.ДатаКон <= ДатаОкончанияРемонта И СтрокаВидаРемонта.ДатаКон >= ДатаНачалаРемонта)) Тогда
				ШаблонСообщения = НСтр("es='¡Para el objeto de la reparación %1 en el período de %2 - %3 es planeada ya la reparación con el tipo %4!';ru='Для объекта ремонта %1 на период %2 - %3 уже запланирован ремонт с видом %4!';en='For repair object%1 for the period%2 -%3, a repair with the view%4 has already been planned!'");
				ТекстСообщения = СтрШаблон(ШаблонСообщения, СтрокаВидаРемонта.ОбъектРемонтныхРабот, ДатаНачалаРемонта, ДатаОкончанияРемонта, СтрокаВидаРемонта.ВидРемонтныхРабот);
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
				мДублирующиесяРемонтыНаПериод = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.торо_ВидыОперацийПланаГрафикаППР.Корректировка") И ТекДанныеПланаРемонтов.Перенесенный И (ДатаНачСтрокиРедактирования<>ДатаНачалаРемонта ИЛИ ДатаКонСтрокиРедактирования<>ДатаОкончанияРемонта) Тогда
		ТекДанныеПланаРемонтов.ДатаНачСт = ДатаНачСтрокиРедактирования;
		ТекДанныеПланаРемонтов.ДатаКонСт = ДатаКонСтрокиРедактирования;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПланРемонтовПриАктивизацииСтроки(Элемент)
	ДанныеТекущейСтроки = Элементы.ПланРемонтов.ТекущиеДанные;
	Если (НЕ ДанныеТекущейСтроки = Неопределено) Тогда
		Если (НЕ МассивIDДляБлокировки = Неопределено) Тогда
			Если НЕ МассивIDДляБлокировки.НайтиПоЗначению(ДанныеТекущейСтроки.ID) = Неопределено Тогда
				ПопыткаМодификацииСтрокиСоСвязаннымДокументом = Истина;
			Иначе
				ПопыткаМодификацииСтрокиСоСвязаннымДокументом = Ложь;			
			КонецЕсли;	
		КонецЕсли;
		
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.торо_ВидыОперацийПланаГрафикаППР.Корректировка") Тогда
			Элементы.ПланРемонтовУдалить.Доступность = Не ЗначениеЗаполнено(ДанныеТекущейСтроки.ДатаНачСт);
		Иначе
			Элементы.ПланРемонтовУдалить.Доступность = Истина;
		КонецЕсли;
		
		Если ДанныеТекущейСтроки.Замещен Тогда
			Элементы.ДокументыЗаказНаВнПотреблениеДобавитьЗаказ.Доступность = Ложь;
			Элементы.ДокументыЗаказНаВнПотреблениеУдалитьЗаказНаВнПотребление.Доступность = Ложь;
			Элементы.ДокументыЗаказНаВнПотребление.Доступность = Ложь;
		Иначе
			Элементы.ДокументыЗаказНаВнПотреблениеДобавитьЗаказ.Доступность = Истина И ПравоИнтерактивноеДобавлениеДокументаЗаказНаВнутреннееПотребление;
			Элементы.ДокументыЗаказНаВнПотреблениеУдалитьЗаказНаВнПотребление.Доступность = Истина И ПравоИнтерактивнаяПометкаУдаленияДокументаЗаказНаВнутреннееПотребление;
			Элементы.ДокументыЗаказНаВнПотребление.Доступность = Истина;
		КонецЕсли;
		
		Элементы.ДокументыЗаказНаВнПотребление.ОтборСтрок = Новый ФиксированнаяСтруктура("ID", ДанныеТекущейСтроки.ID);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПланРемонтовПередУдалением(Элемент, Отказ)

	Если ПопыткаМодификацииСтрокиСоСвязаннымДокументом Или Не Элементы.ПланРемонтовУдалить.Доступность Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПланРемонтовПередНачаломИзменения(Элемент, Отказ)
	ТекущаяСтрокаРемонта = Элементы.ПланРемонтов.ТекущиеДанные;
	Если НЕ ТекущаяСтрокаРемонта = Неопределено Тогда
		
		Если ТекущаяСтрокаРемонта.Замещен Или ЗначениеЗаполнено(ТекущаяСтрокаРемонта.ВРамкахОстановочного) Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		МассивСтрок = МассивДоступныхДляКорректировкиСтрок.НайтиСтроки(Новый Структура("ID", ТекущаяСтрокаРемонта.ID));
		
		Если МассивСтрок.Количество() > 0 Тогда
			
			СтрокаДляРедактирования = Массивстрок[0];
			
			Если ПопыткаМодификацииСтрокиСоСвязаннымДокументом Тогда
				Отказ = Истина;
			ИначеЕсли Не СтрокаДляРедактирования = Неопределено И Не СтрокаДляРедактирования.ДоступенДляРедактирования Тогда
				Если ТекущаяСтрокаРемонта.Перенесенный Тогда
					Если ФОИспользоватьПриоритетностьПеренесенныхРемонтов Тогда
						Отказ = Истина;
					КонецЕсли;
				Иначе
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	ДатаНачСтрокиРедактирования = ТекущаяСтрокаРемонта.ДатаНач;
	ДатаКонСтрокиРедактирования = ТекущаяСтрокаРемонта.ДатаКон;
КонецПроцедуры

&НаКлиенте
Процедура ПланРемонтовИсполнительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущаяСтрока = Элементы.ПланРемонтов.ТекущиеДанные;
	Если ТекущаяСтрока.СпособВыполнения = ПредопределенноеЗначение("Перечисление.СпособыСтроительства.Хозспособ") Тогда
		ФормаВыбора = ПолучитьФорму("Справочник.СтруктураПредприятия.ФормаВыбора", , Элемент);
		
	ИначеЕсли ТекущаяСтрока.СпособВыполнения = ПредопределенноеЗначение("Перечисление.СпособыСтроительства.Подрядный") Тогда
		ФормаВыбора = ПолучитьФорму("Справочник.Контрагенты.ФормаВыбора", , Элемент);
	Иначе
		ПоказатьПредупреждение(Неопределено, НСтр("es='Para la elección del ejecutor indiquen el modo de la ejecución de la reparación.';ru='Для выбора исполнителя укажите способ выполнения ремонта.';en='To select an artist, specify the method of repair.'"));
		Возврат;
	КонецЕсли;
	
	Если ФормаВыбора <> Неопределено Тогда
		ФормаВыбора.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПланРемонтовИсполнительПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПланРемонтов.ТекущиеДанные;
	
	Если ТипЗнч(ТекущиеДанные.Исполнитель) = Тип ("СправочникСсылка.Контрагенты") Тогда
		Возврат;
	КонецЕсли;  
	
	Если ТипЗнч(ТекущиеДанные.Исполнитель) = Тип("СправочникСсылка.СтруктураПредприятия") Тогда
		торо_ЗаполнениеДокументовКлиент.ЗаполнитьСклад(ТекущиеДанные.Исполнитель, ТекущиеДанные.Склад);
	КонецЕсли;
	
	РассчитатьСтоимостиРемонтовНаСервере(Новый Структура("ID, ДатаНач, ОбъектРемонтныхРабот, ВидРемонтныхРабот", ТекущиеДанные.ID, ТекущиеДанные.ДатаНач, ТекущиеДанные.ОбъектРемонтныхРабот, ТекущиеДанные.ВидРемонтныхРабот));
КонецПроцедуры

&НаКлиенте
Процедура ПланРемонтовСпособВыполненияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПланРемонтов.ТекущиеДанные;
	ТекущиеДанные.Исполнитель = "";
	
	РассчитатьСтоимостиРемонтовНаСервере(Новый Структура("ID, ДатаНач, ОбъектРемонтныхРабот, ВидРемонтныхРабот", ТекущиеДанные.ID, ТекущиеДанные.ДатаНач, ТекущиеДанные.ОбъектРемонтныхРабот, ТекущиеДанные.ВидРемонтныхРабот));
	
КонецПроцедуры

&НаКлиенте
Процедура ПланРемонтовВидРемонтныхРаботАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПланРемонтовОбъектРемонтныхРаботАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПланРемонтовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Если Поле.Имя = "ПланРемонтовВРамкахОстановочного" И ЗначениеЗаполнено(ТекДанные.ВРамкахОстановочного) Тогда
			ОткрытьФорму("Документ.торо_ОстановочныеРемонты.ФормаОбъекта", Новый Структура("Ключ, ID", ТекДанные.ВРамкахОстановочного, ТекДанные.ID), ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПланРемонтовДатаНачПриИзменении(Элемент)
	
	Если ФОИспользоватьПриоритетностьПеренесенныхРемонтов Тогда
		ТекущиеДанные = Элементы.ПланРемонтов.ТекущиеДанные;
		ТекущиеДанные.Перенесенный = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПланРемонтовДатаКонПриИзменении(Элемент)
	
	Если ФОИспользоватьПриоритетностьПеренесенныхРемонтов Тогда
		ТекущиеДанные = Элементы.ПланРемонтов.ТекущиеДанные;
		ТекущиеДанные.Перенесенный = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументыЗаказНаВнПотребление
&НаКлиенте
Процедура ДокументыЗаказНаВнПотреблениеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		СтруктураПараметров = Новый Структура("Ключ", ТекущиеДанные.ЗаказНаВнутреннееПотребление);
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбновитьДокументыЗаказНаВнПотребление",ЭтаФорма);
		ОткрытьФорму("Документ.ЗаказНаВнутреннееПотребление.ФормаОбъекта",СтруктураПараметров,ЭтаФорма,,,,ОписаниеОповещения);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Рассчитать(Команда)
	
	Если НЕ ОбязательныеПроверкиБезВопросовпередРасчетомППР() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыРасчета_РасчетВФоне = Ложь;
	ПараметрыРасчета_РасчетВыборочный = Ложь;
	
	Если Модифицированность ИЛИ Объект.Ссылка.Пустая() Тогда
		ТекстВопроса = НСтр("es='Ante la ejecución del cálculo del plan-gráfico ППР es necesario anotar el documento. ¿Continuar?';ru='Перед выполнением расчета план-графика ППР необходимо записать документ. Продолжить?';en='Before performing the calculation of the schedule of PPM, you must write a document. Continue?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("РассчитатьЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	РассчитатьФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьВФоновомРежиме(Команда)
	
	Если НЕ ОбязательныеПроверкиБезВопросовпередРасчетомППР() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыРасчета_РасчетВФоне = Истина;
	ПараметрыРасчета_РасчетВыборочный = Ложь;
	
	Если Модифицированность Тогда
		ТекстВопроса = НСтр("es='Ante la ejecución del cálculo del plan-gráfico ППР es necesario anotar el documento. ¿Continuar?';ru='Перед выполнением расчета план-графика ППР необходимо записать документ. Продолжить?';en='Before performing the calculation of the schedule of PPM, you must write a document. Continue?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("РассчитатьЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	РассчитатьФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьВыборочно(Команда)
	
	Если НЕ ОбязательныеПроверкиБезВопросовпередРасчетомППР() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыРасчета_РасчетВФоне = Ложь;
	ПараметрыРасчета_РасчетВыборочный = Истина;
	
	Если Модифицированность ИЛИ Объект.Ссылка.Пустая() Тогда
		ТекстВопроса = НСтр("es='Ante la ejecución del cálculo del plan-gráfico ППР es necesario anotar el documento. ¿Continuar?';ru='Перед выполнением расчета план-графика ППР необходимо записать документ. Продолжить?';en='Before performing the calculation of the schedule of PPM, you must write a document. Continue?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("РассчитатьЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	РассчитатьФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьВФоновомРежимеВыборочно(Команда)
	
	Если НЕ ОбязательныеПроверкиБезВопросовпередРасчетомППР() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыРасчета_РасчетВФоне = Истина;
	ПараметрыРасчета_РасчетВыборочный = Истина;
	
	Если Модифицированность Тогда
		ТекстВопроса = НСтр("es='Ante la ejecución del cálculo del plan-gráfico ППР es necesario anotar el documento. ¿Continuar?';ru='Перед выполнением расчета план-графика ППР необходимо записать документ. Продолжить?';en='Before performing the calculation of the schedule of PPM, you must write a document. Continue?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("РассчитатьЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	РассчитатьФрагмент();
	
КонецПроцедуры


&НаКлиенте
Процедура ПоказыватьПоложение(Команда)
	
	Элементы.ДеревоПланаГрафикаППРСУчетомПозицииПоказыватьПоложение.Пометка = НЕ Элементы.ДеревоПланаГрафикаППРСУчетомПозицииПоказыватьПоложение.Пометка;
	
	мОтображатьПоложение = Элементы.ДеревоПланаГрафикаППРСУчетомПозицииПоказыватьПоложение.Пометка;
	
	// †6
	ЗаписатьДеревоППРСУчетомПозиции();
 	ЗаполнитьДеревоПланаГрафикаППРСУчетомПозиции();
	РазвернутьВсеВетвиДеревьев();
		
КонецПроцедуры

&НаКлиенте
Процедура НастройкаИерархии(Команда)
	
	СписокСтруктур = ЗаполнитьСписокСтруктурНаСервере(СтруктураИерархии, Истина);
	
	СтруктураИерархииПредыдущая = СтруктураИерархии;
	
	ТекущаяИерархия = СписокСтруктур.НайтиПоЗначению(СтруктураИерархии);
	СписокСтруктур.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("НастройкаИерархииЗавершение",ЭтотОбъект),НСтр("es='Escojan el tipo de la jerarquía:';ru='Выберите вид иерархии:';en='Select a hierarchy type:'"), ТекущаяИерархия);
		
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьОР(Команда)
	
	ЭлементДерево = Элементы.ДеревоПланаГрафикаППРСУчетомПозиции;
	ОткрытьФорму("Справочник.торо_ОбъектыРемонта.ФормаВыбора",,ЭлементДерево);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРемонт(Команда)
	
	ЭлементДерево = Элементы.ДеревоПланаГрафикаППРСУчетомПозиции;
	ФормаВыбора = ПолучитьФорму("Справочник.торо_ВидыРемонтов.ФормаВыбора",, ЭлементДерево);
	ПользовательскийОтбор = ФормаВыбора.Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ФормаВыбора.Список.КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки);
	ПользовательскийОтбор.Элементы.Очистить();
	
	ЭлементОтбора = ПользовательскийОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение     = Новый ПолеКомпоновкиДанных("ПланГрафикППР");
	ЭлементОтбора.ВидСравнения         = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
	
	ФормаВыбора.Открыть();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КлючНазначенияИспользования", "торо_ПланГрафикРемонта");
	ПараметрыФормы.Вставить("Организация", Объект.ОрганизацияВладелец);
	ПараметрыФормы.Вставить("Подразделение", Объект.ПодразделениеВладелец);
	ПараметрыФормы.Вставить("НеУчаствуетВПланировании", Истина);
	ПараметрыФормы.Вставить("СтруктураИерархии", СтруктураИерархии);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	
	ОткрытьФорму("Обработка.торо_ПодборОбъектовРемонтныхРабот.Форма.ФормаПодбораОбъектовДляПланаГрафикаППР",
		ПараметрыФормы, Элементы.ДеревоПланаГрафикаППРСУчетомПозиции, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИсполнителей(Команда)
	
    Перем ФормаЗаполненияИсполнителей;
    
    ФормаЗаполненияИсполнителей = ПолучитьФорму("Документ.торо_ПланГрафикРемонта.Форма.ФормаАвтозаполненияИсполнителей",
    	Новый Структура("ДокументППР, ТаблицаРемонтовИзППР, МассивДоступныхДляКорректировкиСтрок", Объект.Ссылка, Объект.ПланРемонтов, МассивДоступныхДляКорректировкиСтрок), ЭтаФорма, Объект.Ссылка, ВариантОткрытияОкна.ОтдельноеОкно);
		
    ФормаЗаполненияИсполнителей.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
    ФормаЗаполненияИсполнителей.ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ЗаполнитьИсполнителейЗавершение",ЭтотОбъект);
    ФормаЗаполненияИсполнителей.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура ОтображатьЗамещенные(Команда)
	
	Кнопка = Элементы.ПланРемонтовОтображатьЗамещенные;
	Кнопка.Пометка = НЕ Кнопка.Пометка;
	ТекущаяСтрока = Элементы.ДеревоПланаГрафикаППРСУчетомПозиции.ТекущиеДанные;
	СтрокаВыбрана = Не (ТекущаяСтрока = Неопределено);
	Если СтрокаВыбрана Тогда
		УстановитьОтборСтрокВПланеРемонтов(ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПостроитьДиаграммуГанта(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Ответ = Неопределено;

	Состояние("Построение диаграммы ремонтов Плана-графика...");
    ПостроитьДиаграммуГантаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоНаименованию(Команда)
	
	Если мОтображатьПоложение Тогда
		ТекстСообщения = НСтр("es='Filtrar los objetos de la reparación en la sucesión en el árbol es posible solamente a opción desconectado ""Representar la posición""';ru='Сортировать объекты ремонта в порядке следования в дереве возможно только при отключенной опции ""Отображать положение""';en='Sorting repair objects in the order in the tree is possible only if the ""Display position"" option is disabled'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	Элементы.СортироватьПоНаименованию.Пометка = НЕ Элементы.СортироватьПоНаименованию.Пометка;
	СортироватьПоНаименованию = Элементы.СортироватьПоНаименованию.Пометка;
	
	Если ДиаграммаГантаППР.Точки.Количество() > 0 Тогда
		
		СписокКнопок = Новый СписокЗначений;
		СписокКнопок.Добавить(КодВозвратаДиалога.Да,НСтр("es='Reconstruir es ahora';ru='Перестроить сейчас';en='Rebuild now'"));
		СписокКнопок.Добавить(КодВозвратаДиалога.Нет,НСтр("es='Reconstruir más tarde (a mano)';ru='Перестроить позже (вручную)';en='Rebuild later (manually)'"));
		ПоказатьВопрос(
			Новый ОписаниеОповещения("СортироватьПоНаименованиюЗавершение",ЭтаФорма),
			НСтр("es='Para la aplicación de los ajustes de la selección es necesario reconstruir el diagrama.';ru='Для применения настроек сортировки необходимо перестроить диаграмму.';en='To apply sorting settings, you must rebuild the chart.'"),
			СписокКнопок,,КодВозвратаДиалога.Да,НСтр("es='El cambio de los ajustes';ru='Изменение настроек';en='Change settings'"));
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоНаименованиюЗавершение(Результат,ДопПараметры = Неопределено) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПостроитьДиаграммуГанта(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КорректироватьППРПоЛимитам(Команда)
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.торо_ВидыОперацийПланаГрафикаППР.ПланРабот") Тогда
		ТекстСообщения = НСтр("es='¡Se puede corregir solamente el documento con el tipo correspondiente de la operación!';ru='Корректировать можно только документ с соответствующим видом операции!';en='You can only correct a document with the appropriate type of operation!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если Объект.ПланРемонтов.Количество() = 0 Тогда
		ТекстСообщения = НСтр("es='¡La corrección ППР por los límites es imposible, puesto que faltan las reparaciones planeadas!';ru='Корректировка ППР по лимитам невозможна, так как отсутствуют запланированные ремонты!';en='Correction of PPM by limits is impossible, since there are no scheduled repairs!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);	
		Возврат;
	КонецЕсли;
	
	ДатаНачалаЛимита = Дата(3999,1,1);
	ДатаОкончанияЛимита = Дата(1,1,1);
	
	МассивТЧ = Новый Массив;
	СписокОбъектов = Новый Массив;
	
	Для каждого Стр Из Объект.ПланРемонтов Цикл
		Если НЕ Стр.Замещен Тогда
			Если Стр.ДатаНач < ДатаНачалаЛимита Тогда
				ДатаНачалаЛимита = Стр.ДатаНач;
			КонецЕсли;
			Если Стр.ДатаКон > ДатаОкончанияЛимита Тогда
				ДатаОкончанияЛимита = Стр.ДатаКон;
			КонецЕсли;
			СписокОбъектов.Добавить(Стр.ОбъектРемонтныхРабот);
			
			СтрТЧ = Новый Структура("ID, ВидРемонтныхРабот, ДатаКон, ДатаНач, Исполнитель, ОбъектРемонтныхРабот, СпособВыполнения, Отменен, СуммаРемонта, Замещен");
			ЗаполнитьЗначенияСвойств(СтрТЧ, Стр);
			МассивТЧ.Добавить(СтрТЧ);
		КонецЕсли; 
	КонецЦикла; 
	
	Если НЕ ЕстьЛимитыНаПериод(Год(ДатаНачалаЛимита), Год(ДатаОкончанияЛимита)) Тогда
		ТекстСообщения = НСтр("es='Por el período (ППР) faltan los límites establecidos (el documento ""la Instalación de los límites a los trabajos de reparación planificados""). El trabajo correcto del tratamiento tiene que establecer los límites a los trabajos de reparación planificados por el documento indicado.';ru='По периоду (ППР) отсутствуют установленные лимиты (документ ""Установка лимитов на плановые ремонтные работы""). Для корректной работы обработки необходимо установить лимиты на плановые ремонтные работы указанным документом.';en='There are no established limits for the period (PPM) (document ""Setting limits for scheduled repair work""). For the correct operation of the processing, it is necessary to set limits for scheduled repair work with the specified document.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если НЕ ЕстьЛимитыНаОрганизацию(Год(ДатаНачалаЛимита), Год(ДатаОкончанияЛимита), СписокОбъектов) Тогда
		ТекстСообщения = НСтр("es='Por el período (ППР) faltan los límites establecidos (el documento ""la Instalación de los límites a los trabajos de reparación planificados"") para las organizaciones establecidas y las direcciones en las tarjetas ОР. "
"El trabajo correcto del tratamiento tiene que establecer los límites a los trabajos de reparación planificados por el documento indicado.';ru='По периоду (ППР) отсутствуют установленные лимиты (документ ""Установка лимитов на плановые ремонтные работы"") для установленных организаций и направлений в карточках ОР. "
"Для корректной работы обработки необходимо установить лимиты на плановые ремонтные работы указанным документом.';en='There are no established limits for the period (PPM) (document"" ""Setting limits for scheduled repair work"" "") for established organizations and directions in PR cards."
"For the correct operation of the processing, it is necessary to set limits for scheduled repair work with the specified document.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли; 
	
	ОткрытьФорму("Обработка.торо_КорректировкаППРПоРМ.Форма",Новый Структура("ДатаНачалаЛимита, ДатаОкончанияЛимита, СтруктураПланаРемонтов", Год(ДатаНачалаЛимита), Год(ДатаОкончанияЛимита), МассивТЧ), Объект.Ссылка, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОценкуРМ(Команда)
	
	Если объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.торо_ВидыОперацийПланаГрафикаППР.ПланРабот") Тогда
		ТекстСообщения = НСтр("es='¡La instalación de las apreciaciones РМ es posible solamente para los documentos con el tipo de la operación ""el Plan de las reparaciones""!';ru='Установка оценок РМ возможна только для документов с видом операции ""План ремонтов ""!';en='Setting PM ratings is possible only for documents with the operation type “Repair plan”!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) ИЛИ Модифицированность Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("УстановитьОценкуРМЗавершение", ЭтотОбъект), НСтр("es='Para la continuación de la operación es necesario anotar el documento. ¿Continuar?';ru='Для продолжения операции необходимо записать документ. Продолжить?';en='To continue the operation, you must record a document. Continue?'"), РежимДиалогаВопрос.ДаНет);
        Возврат;
	КонецЕсли;
	
	УстановитьОценкуРМФрагмент();
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьСтоимостиРемонтов(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьСтоимостиРемонтовЗавершение", ЭтотОбъект), НСтр("es='¿Перезаполнить planificado el coste de las reparaciones?';ru='Перезаполнить плановые стоимости ремонтов?';en='Refill planned repair costs?'"),РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЦепочку(Команда)
	
	ТекОбъектРемонтаЦепочки = Элементы.ДеревоПланаГрафикаППРСУчетомПозиции.ТекущиеДанные;
	Если ТипЗнч(ТекОбъектРемонтаЦепочки.Ремонты) = Тип("СправочникСсылка.торо_ОбъектыРемонта") Тогда
		СписокЦепочек = ПолучитьСписокЦепочек(ТекОбъектРемонтаЦепочки.Ремонты);
		
		ФормаВыбораЦепочек = ПолучитьФорму("Справочник.торо_ЦепочкиРемонта.ФормаВыбора", Новый Структура("СписокОтбора", СписокЦепочек), Элементы.ДеревоПланаГрафикаППРСУчетомПозиции, Объект.Ссылка);
		ФормаВыбораЦепочек.Открыть();
		Модифицированность = истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборЦепочек(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КлючНазначенияИспользования", "торо_ПланГрафикРемонта");
	ПараметрыФормы.Вставить("Организация", Объект.ОрганизацияВладелец);
	ПараметрыФормы.Вставить("Подразделение", Объект.ПодразделениеВладелец);
	ПараметрыФормы.Вставить("НеУчаствуетВПланировании", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	
	ОткрытьФорму("Обработка.торо_ПодборОбъектовРемонтныхРабот.Форма.ФормаПодбораОбъектовИЦепочекДляПланаГрафикаППР",
		ПараметрыФормы, Элементы.ДеревоПланаГрафикаППРСУчетомПозиции, Объект.Ссылка);
		
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсе(Команда)
	Для каждого ТочкаДиаграммыГанта Из ДиаграммаГантаППР.Точки Цикл
		ДиаграммаГантаППР.СвернутьТочку(ТочкаДиаграммыГанта, Истина);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсе(Команда)
	Для каждого ТочкаДиаграммыГанта Из ДиаграммаГантаППР.Точки Цикл
		ДиаграммаГантаППР.РазвернутьТочку(ТочкаДиаграммыГанта, Истина);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПоказательЛегенду(Команда)
	Элементы.ПоказатьЛегенду.Пометка = НЕ Элементы.ПоказатьЛегенду.Пометка;
	Элементы.ЛегендаДиаграммы.Видимость = Элементы.ПоказатьЛегенду.Пометка;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗаказНаВнПотребление(Команда)
	ТекущиеДанные = Элементы.ДокументыЗаказНаВнПотребление.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ЗаказСсылка",ТекущиеДанные.ЗаказНаВнутреннееПотребление);
		СтруктураПараметров.Вставить("ID"         ,ТекущиеДанные.ID);
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораДействияПользователяПередУдалениемВнЗаказа",ЭтаФорма, СтруктураПараметров);
		ПоказатьВопрос(ОписаниеОповещения,НСтр("es='El documento escogido será marcado a la desaparición. ¿Continuar?';ru='Выбранный документ будет помечен на удаление. Продолжить?';en='The selected document will be marked for deletion. Continue?'"),РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да,"Удаление связи с заказом на внутреннее потребление");
		
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗаказ(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда 
		ПоказатьВопрос(Новый ОписаниеОповещения("ДобавитьЗаказВопрос", ЭтотОбъект), НСтр("es='Para la formación del encargo en el consumo interior es necesario anotar el documento. ¿Continuar?';ru='Для формирования заказа на внутреннего потребления необходимо записать документ. Продолжить?';en='To form an order for domestic consumption, you need to write a document. Continue?'"), РежимДиалогаВопрос.ДаНет);
		Возврат; 
	Иначе 
		ДобавитьЗаказПослеВопроса();	
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте 
Процедура ДобавитьЗаказВопрос(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
        Возврат;
	Иначе
		Если НЕ Записать() Тогда
			Возврат;
		КонецЕсли;
		
		ДобавитьЗаказПослеВопроса();	 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте 
Процедура ДобавитьЗаказПослеВопроса() 
	
	ТекущийРемонт = Элементы.ПланРемонтов.ТекущиеДанные;
	
	Если Не ТекущийРемонт = Неопределено Тогда
		
		стрПараметров = Новый Структура("ОбъектРемонтныхРабот, ВидРемонтныхРабот, ДатаНач, ID, ДатаКон, Склад");
		ЗаполнитьЗначенияСвойств(стрПараметров, ТекущийРемонт);
		
		стрВозврата = СоздатьДокумент_ЗаказНаВнутреннеПотребление(стрПараметров);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьИзменитьЗаписиВРегистреТоро_ИнтеграцияДокументов",ЭтаФорма,стрВозврата.СтруктураПередаваемыхВОбработчикПараметров);
		ОткрытьФорму("Документ.ЗаказНаВнутреннееПотребление.ФормаОбъекта",стрВозврата.СтруктураПараметров,ЭтаФорма,,,,ОписаниеОповещения);
		
	КонецЕсли; 
	
КонецПроцедуры 

&НаКлиенте
Процедура СоздатьВнутренниеЗаказы(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда 
		ПоказатьВопрос(Новый ОписаниеОповещения("СоздатьВнутренниеЗаказыВопрос", ЭтотОбъект), НСтр("es='Para la formación de los encargos en el consumo interior es necesario anotar el documento. ¿Continuar?';ru='Для формирования заказов на внутреннего потребления необходимо записать документ. Продолжить?';en='To create orders for domestic consumption, you must record a document. Continue?'"), РежимДиалогаВопрос.ДаНет);
		Возврат; 
	Иначе 
		СоздатьВнутренниеЗаказыПослеВопроса();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте 
Процедура СоздатьВнутренниеЗаказыВопрос(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
        Возврат;
	Иначе
		Если НЕ Записать() Тогда
			Возврат;
		КонецЕсли;
		
		СоздатьВнутренниеЗаказыПослеВопроса();	 
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура СоздатьВнутренниеЗаказыПослеВопроса()
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Показать(Новый ОписаниеОповещения("СоздатьВнутренниеЗаказыЗавершение", ЭтотОбъект));
	
КонецПроцедуры 

&НаКлиенте
Процедура СоздатьВнутренниеЗаказыЗавершение(Период, ДополнительныеПараметры) Экспорт
	
	Если Период <> Неопределено Тогда 
		ВыбранныйПериод = Период;
	Иначе
		Возврат;
	КонецЕсли;	
	
	Для каждого текРемонт из Объект.ПланРемонтов Цикл
		
		Если текРемонт.ДатаНач >= ВыбранныйПериод.ДатаНачала
			и текРемонт.ДатаКон <= ВыбранныйПериод.ДатаОкончания
			и НЕ текРемонт.Замещен
			Тогда
			
			стрПараметров = Новый Структура("ОбъектРемонтныхРабот, ВидРемонтныхРабот, ДатаНач, ID, ДатаКон, Склад");
			ЗаполнитьЗначенияСвойств(стрПараметров, ТекРемонт);
			СоздатьДокумент_ЗаказНаВнутреннеПотребление(стрПараметров, Истина);		
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура УтвердитьСтатус(Команда)
	
	торо_РаботаССогласованиямиКлиент.УстановитьСтатус(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПланРемонтовВводНаОснованииАктОВыполненииРемонтныхРабот(Команда)

	ПараметрыФормы = Новый Структура("Основание, ВыделенныеСтроки", Объект.Ссылка, ПолучитьВыделенныеПланыРемонтов());
	ОткрытьФорму("Документ.торо_АктОВыполненииЭтапаРабот.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПланРемонтовВводНаОснованииЗаявкаНаРемонт(Команда)
	
	ПараметрыФормы = Новый Структура("Основание, ВыделенныеСтроки", Объект.Ссылка, ПолучитьВыделенныеПланыРемонтов());
	ОткрытьФорму("Документ.торо_ЗаявкаНаРемонт.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПланРемонтовВводНаОснованииНарядНаВыполнениеРемонтныхРабот(Команда)
	
	ПараметрыФормы = Новый Структура("Основание, ВыделенныеСтроки", Объект.Ссылка, ПолучитьВыделенныеПланыРемонтов());
	ОткрытьФорму("Документ.торо_НарядНаВыполнениеРемонтныхРабот.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработкаВыбораВДеревеППР

#Область ОбработкаВыбора_ОбъектРемонта
&НаКлиенте
Процедура ДеревоППРОбработкаВыбора_ОбъектРемонта(ВыбранноеЗначение)
	
	СтрВыбранноеЗначение = ПолучитьПараметрыОР(ВыбранноеЗначение);
	
	Если СтрВыбранноеЗначение.ЭтоГруппа Тогда
		
		ТекстСообщения = НСтр("es='¡En el documento no es posible aportar los grupos de los objetos de los trabajos de reparación!';ru='В документ нельзя вносить группы объектов ремонтных работ!';en='Groups of objects of repair work cannot be entered into the document!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
		
	КонецЕсли;
	
	Если СтрВыбранноеЗначение.НеУчаствуетВПланировании Тогда
		
		струкПараметров = Новый Структура("ВыбранноеЗначение", ВыбранноеЗначение);
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОР", ЭтотОбъект, струкПараметров);
		ПоказатьВопрос(Оповещение,
			СтрШаблон(
				НСтр("es='Para el objeto de la reparación ""%1"" es establecido el indicio ""no participa en la planificación"". ¿Añadir el objeto de la reparación?';ru='Для объекта ремонта ""%1"" установлен признак ""Не участвует в планировании"". Добавить объект ремонта?';en='For repair object ""% 1"" the sign ""Not involved in planning"" is set. Add repair facility?'"),
				СтрВыбранноеЗначение.Наименование),
			РежимДиалогаВопрос.ДаНет
		);
		
		Возврат;
	КонецЕсли;
	
	НайденныеСтроки = торо_ДанныеФормыДеревоКлиентСервер.НайтиСтроки(
		ДеревоПланаГрафикаППРСУчетомПозиции,
		Новый Структура("ОбъектРемонта", ВыбранноеЗначение),
		УровеньОрВДереве,УровеньОрВДереве,1// Ищем первое, оно же единственное совпадение, если есть
	);
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		ШаблонСообщения = НСтр("es='¡El objeto ""%1"" es incluido ya en la lista los objetos de los trabajos de reparación del plan-gráfico ППР!';ru='Объект ""%1"" уже внесен в список объектов ремонтных работ плана-графика ППР!';en='The object ""%1"" has already been included in the list of repair objects for the maintenance schedule!'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ВыбранноеЗначение);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ДополнитьДеревоРемонтов(ВыбранноеЗначение);

КонецПроцедуры

&НаКлиенте 
Процедура ПослеЗакрытияВопросаОР(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ДополнитьДеревоРемонтов(Параметры.ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьДеревоРемонтов(ОбъектРемонта, МассивВидовРемонта = Неопределено)
	
	Если мОтображатьПоложение Тогда
		ПоложениеОР = ОпределитьПоложениеОР(ОбъектРемонта, СтруктураИерархии);
	Иначе
		ПоложениеОР = ПредставлениеПустогоРодителя();
	КонецЕсли;
	
	НайденныеСтрокиПоПоложению = торо_ДанныеФормыДеревоКлиентСервер.НайтиСтроки(
		ДеревоПланаГрафикаППРСУчетомПозиции,
		Новый Структура("Положение", ПоложениеОР),
		УровеньПоложенияВДереве,УровеньПоложенияВДереве,1// Ищем первое, оно же единственное совпадение, если есть
	);
		
	Если НайденныеСтрокиПоПоложению.Количество() = 0 И Не ПоложениеОР = ПредставлениеПустогоРодителя() Тогда
		Корень = ДеревоПланаГрафикаППРСУчетомПозиции.ПолучитьЭлементы()[0];
		НайденнаяСтрокаРодитель = Корень.ПолучитьЭлементы().Добавить();
		НайденнаяСтрокаРодитель.Ремонты = ПоложениеОР;
		НайденнаяСтрокаРодитель.НомерКартинки = ?(ПоложениеОР = ПредставлениеПустогоРодителя(), 4, 2);
		НайденнаяСтрокаРодитель.Положение = ПоложениеОР;
		
		Модифицированность = Истина;
	ИначеЕсли НайденныеСтрокиПоПоложению.Количество() = 0 И ПоложениеОР = ПредставлениеПустогоРодителя() Тогда
		НайденнаяСтрокаРодитель = ДеревоПланаГрафикаППРСУчетомПозиции.ПолучитьЭлементы()[0];
	Иначе
		НайденнаяСтрокаРодитель = НайденныеСтрокиПоПоложению[0];
	КонецЕсли;
	
	НайденныеСтрокиОР = торо_ДанныеФормыДеревоКлиентСервер.НайтиСтроки(
		НайденнаяСтрокаРодитель,
		Новый Структура("ОбъектРемонта", ОбъектРемонта),
		1,1,1
	);
	Если НайденныеСтрокиОР.Количество() = 0 Тогда
		СтрокаОР = НайденнаяСтрокаРодитель.ПолучитьЭлементы().Добавить();
		СтрокаОР.Ремонты = ОбъектРемонта;
		СтрокаОР.ОбъектРемонта = ОбъектРемонта;
		СтрокаОР.НомерКартинки = 0;
		
		Модифицированность = Истина;
		
	Иначе
		СтрокаОР = НайденныеСтрокиОР[0];
	КонецЕсли;
	
	Если МассивВидовРемонта <> Неопределено Тогда
		
		Для Каждого СтрокаВР Из МассивВидовРемонта Цикл
				
			НайденныеСтроки = торо_ДанныеФормыДеревоКлиентСервер.НайтиСтроки(
				СтрокаОР,
				Новый Структура("Ремонты", СтрокаВР),
				,,1
			);
			
			Если НайденныеСтроки.Количество() = 0 Тогда
				НовСтрокаВидРемРабот = СтрокаОР.ПолучитьЭлементы().Добавить();
				НовСтрокаВидРемРабот.Ремонты = СтрокаВР;
				НовСтрокаВидРемРабот.НомерКартинки = 7;
				
				Модифицированность = Истина;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ИдентификаторСтрокиОР = СтрокаОР.ПолучитьИдентификатор();
	Элементы.ДеревоПланаГрафикаППРСУчетомПозиции.ТекущаяСтрока = ИдентификаторСтрокиОР;
	Элементы.ДеревоПланаГрафикаППРСУчетомПозиции.Развернуть(ИдентификаторСтрокиОР, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоППРОбработкаВыбора_ИзФормыПодбораОР(Знач ВыбранноеЗначение)

	// гкс+ [10.23] Деснол 12.10.2023
	Если ДеревоПланаГрафикаППРСУчетомПозиции.ПолучитьЭлементы().Количество() = 0 Тогда
		СоздатьКореньДерева(Ложь);
	КонецЕсли;
	// гкс- [10.23] Деснол 12.10.2023	
	РодителиОР = Новый Соответствие;
	
	УсловиеПоискаВДереве = торо_ДанныеФормыДеревоКлиентСервер.Новый_ГруппаИли_Условия();
	МассивОР = Новый Массив;
	Для каждого КлючИЗначение из ВыбранноеЗначение.СоответствиеОбъектовРемонта Цикл
		МассивОР.Добавить(КлючИЗначение.Ключ);
		торо_ДанныеФормыДеревоКлиентСервер.ДобавитьВГруппуУсловияЭлементИлиГруппу(УсловиеПоискаВДереве,
			торо_ДанныеФормыДеревоКлиентСервер.Новый_ЭлементУсловия("ОбъектРемонта", КлючИЗначение.Ключ)
		);
	КонецЦикла;
	Если мОтображатьПоложение Тогда
		РодителиОР = торо_РаботаСИерархией20.ПолучитьТекущихРодителейВИерархии(МассивОР, СтруктураИерархии, ТекущаяДата(), Истина);
	КонецЕсли;
	
	СтрокиОРВДереве = Новый Соответствие;
	Если МассивОР.Количество() > 0 Тогда
		СтрокиОРВДеревеМассив = торо_ДанныеФормыДеревоКлиентСервер.НайтиСтрокиПоСоставномуУсловию(
			ДеревоПланаГрафикаППРСУчетомПозиции,
			УсловиеПоискаВДереве,
			УровеньОрВДереве, УровеньОрВДереве
		);
		Для Каждого СтрокаОРВДереве Из СтрокиОРВДеревеМассив Цикл
			СтрокиОРВДереве.Вставить(СтрокаОРВДереве.ОбъектРемонта, СтрокаОРВДереве);
		КонецЦикла;
	КонецЕсли;
	Для каждого КлючИЗначение из ВыбранноеЗначение.СоответствиеОбъектовРемонта Цикл
		ОбъектРемонта = КлючИЗначение.Ключ;
		Корень = ДеревоПланаГрафикаППРСУчетомПозиции.ПолучитьЭлементы()[0];
		СтрокаОР = НайтиИлиДобавитьСтрокуОРВДереве(Корень, ОбъектРемонта, РодителиОР, СтрокиОРВДереве);
		
		Если ТипЗнч(КлючИЗначение.Значение) = Тип("Массив") Тогда
			Для каждого ВидРемонта из КлючИЗначение.Значение Цикл
				ДобавитьСтрокуВидаРемонтаВДерево(СтрокаОР, ВидРемонта);
			КонецЦикла;
		КонецЕсли;
		Если СтрокиОРВДереве.Получить(СтрокаОР.ОбъектРемонта) = Неопределено Тогда
			// Для оптимизации производительности не разворачиваем строки ОР которые уже существуют.
			// Альтернативный вариант - разворачивать все дерево.
			Элементы.ДеревоПланаГрафикаППРСУчетомПозиции.Развернуть(СтрокаОР.ПолучитьИдентификатор(), Ложь);
		КонецЕсли;
		Модифицированность = Истина;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Функция НайтиИлиДобавитьСтрокуОРВДереве(Родитель, ОбъектРемонта, РодителиОР, СтрокиОРВДереве)
	
	СтрокаОР = СтрокиОРВДереве.Получить(ОбъектРемонта);
	
	Если СтрокаОР = Неопределено Тогда
		Если мОтображатьПоложение Тогда
			ПоложениеОР = РодителиОР.Получить(ОбъектРемонта);
			Если ПоложениеОР = Неопределено ИЛИ ПоложениеОР = ПредопределенноеЗначение("Справочник.торо_ОбъектыРемонта.ПустаяСсылка") Тогда
				ПоложениеОР = ПредставлениеПустогоРодителя();
			КонецЕсли;
			
			СтрокиРодителя = торо_ДанныеФормыДеревоКлиентСервер.НайтиСтроки(
				Родитель,
				Новый Структура("Положение", ПоложениеОР),
				УровеньПоложенияВДереве,УровеньПоложенияВДереве,1
			);
			
			Если СтрокиРодителя.Количество() = 0 И ПоложениеОР = ПредставлениеПустогоРодителя() Тогда
				СтрокаРодителя = Родитель;
			ИначеЕсли СтрокиРодителя.Количество() = 0 И Не ПоложениеОР = ПредставлениеПустогоРодителя() Тогда
				СтрокаРодителя = ДобавитьСтрокуПоложенияВДерево(Родитель.ПолучитьЭлементы(), ПоложениеОР);
			Иначе
				СтрокаРодителя = СтрокиРодителя[0];
			КонецЕсли;
			
			СтрокаОР = ДобавитьСтрокуОРВДерево(СтрокаРодителя, ОбъектРемонта);
		Иначе
			СтрокаОР = ДобавитьСтрокуОРВДерево(Родитель, ОбъектРемонта);
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтрокаОР;
	
КонецФункции

#КонецОбласти

#Область ОбработкаВыбора_ВидРемонта
&НаКлиенте
Процедура ДеревоППРОбработкаВыбора_ВидРемонта(ВыбранноеЗначение)
	
	ЭлементДерево = Элементы.ДеревоПланаГрафикаППРСУчетомПозиции;
	
	ТекСтрокаДерева = ЭлементДерево.ТекущиеДанные;
	СтрокаРодитель = ТекСтрокаДерева;
	
	Если ТекСтрокаДерева = Неопределено 
		Или ТипЗнч(ТекСтрокаДерева.Ремонты) = Тип("СправочникСсылка.торо_ОбъектыРемонта") И ПолучитьПараметрыОР(ТекСтрокаДерева.Ремонты).ЭтоГруппа Тогда
		
		ТекстСообщения = НСтр("es='¡Indiquen el objeto de la reparación para la introducción del trabajo de reparación!';ru='Укажите объект ремонта для ввода ремонтной работы!';en='Specify the object of repair to enter the repair work!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
		
	ИначеЕсли ТипЗнч(ТекСтрокаДерева.Ремонты) = Тип("СправочникСсылка.торо_ВидыРемонтов") ИЛИ ТипЗнч(ТекСтрокаДерева.Ремонты) = Тип("СправочникСсылка.торо_ЦепочкиРемонта") Тогда
		
		СтрокаРодитель = ДеревоПланаГрафикаППРСУчетомПозиции.НайтиПоИдентификатору(ЭлементДерево.ТекущаяСтрока).ПолучитьРодителя();
		
	КонецЕсли; 
	
	СтрВыбранноеЗначение = ПолучитьПараметрыВР(ВыбранноеЗначение, СтрокаРодитель.Ремонты);
	Если СтрВыбранноеЗначение.НеУчаствуетВПланировании = Истина Тогда
		
		струкПараметров = Новый Структура("ВыбранноеЗначение, СтрокаРодитель", ВыбранноеЗначение, СтрокаРодитель);
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаВР", ЭтотОбъект, струкПараметров);
		ПоказатьВопрос(Оповещение, 
		СтрШаблон(
		НСтр("es='Para el tipo de la reparación ""%1"" es establecido el indicio ""no participa en la planificación"". ¿Añadir el tipo de la reparación?';ru='Для вида ремонта ""%1"" установлен признак ""Не участвует в планировании"". Добавить вид ремонта?';en='For the repair type ""% 1"", the flag ""Not involved in planning"" is set. Add type of repair?'"),
		СтрВыбранноеЗначение.Наименование),
		РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	ДеревоРемонтовОбработкаВыбораВР(ВыбранноеЗначение, СтрокаРодитель);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаВР(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ДеревоРемонтовОбработкаВыбораВР(Параметры.ВыбранноеЗначение, Параметры.СтрокаРодитель);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ДеревоРемонтовОбработкаВыбораВР(ВыбранноеЗначение, СтрокаРодитель, ИмяДобавляемогоЭлемента = "Ремонт ")
	
	Если СтрокаРодитель = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НайденныеСтроки = торо_ДанныеФормыДеревоКлиентСервер.НайтиСтроки(СтрокаРодитель, Новый Структура("Ремонты", ВыбранноеЗначение),,,1);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		
		НовСтрокаВидРемРабот = СтрокаРодитель.ПолучитьЭлементы().Добавить();
		НовСтрокаВидРемРабот.Ремонты = ВыбранноеЗначение;
		НовСтрокаВидРемРабот.НомерКартинки = 7;
		
		Элементы.ДеревоПланаГрафикаППРСУчетомПозиции.ТекущаяСтрока = НовСтрокаВидРемРабот.ПолучитьИдентификатор();
		
		Модифицированность = Истина;
		
	Иначе
		Если ИмяДобавляемогоЭлемента = "Ремонт " Тогда
			ШаблонСообщения = НСтр("en='%1 ""%2"" is already in the list for the object ""%3"" of the PPM schedule!';es='¡%1 ""%2"" es incluido ya en la lista para el objeto ""%3"" planes-gráficos ППР!';ru='%1 ""%2""  уже внесен в список для объекта ""%3"" плана-графика ППР!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ИмяДобавляемогоЭлемента, ВыбранноеЗначение, СтрокаРодитель.Ремонты);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Иначе
			ШаблонСообщения = НСтр("en='%1 ""%2"" is already in the list for the object ""%3"" of the PPM schedule!';es='¡%1 ""%2"" es incluido ya en la lista para el objeto ""%3"" planes-gráficos ППР!';ru='%1 ""%2""  уже внесен в список для объекта ""%3"" плана-графика ППР!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ИмяДобавляемогоЭлемента, ВыбранноеЗначение, СтрокаРодитель.Ремонты);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.торо_ВидыРемонтов") Тогда
		Если Не ЗаданыНормативы(СтрокаРодитель.Ремонты, ВыбранноеЗначение) Тогда
			ШаблонСообщения = НСтр("es='¡Para el tipo de la reparación %1 objetos de la reparación %2 no son dados las normas de la planificación!';ru='Для вида ремонта %1 объекта ремонта %2 не заданы нормативы планирования!';en='For the type of repair% 1 of the repair object% 2 no planning standards have been set!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ВыбранноеЗначение, СтрокаРодитель.Ремонты);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗаданыНормативы(ОбъектРемонта, ВидРемонта);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 РАЗРЕШЕННЫЕ
	|	торо_НормативныеРемонтыОборудования.ВидРемонта,
	|	торо_НормативныеРемонтыОборудования.ОбъектРемонта,
	|	торо_НормативныеРемонтыОборудования.НеУчаствуетВПланировании
	|ИЗ
	|	РегистрСведений.торо_НормативныеРемонтыОборудования КАК торо_НормативныеРемонтыОборудования
	|ГДЕ
	|	торо_НормативныеРемонтыОборудования.ОбъектРемонта = &Объект
	|	И торо_НормативныеРемонтыОборудования.ВидРемонта = &ВидРемонта
	|	И торо_НормативныеРемонтыОборудования.Приоритет";
	
	Запрос.УстановитьПараметр("Объект", ОбъектРемонта);
	Запрос.УстановитьПараметр("ВидРемонта", ВидРемонта);
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#Область ОбработкаВыбора_ЦепочкаРемонта
&НаКлиенте
Процедура ДеревоППРОбработкаВыбора_ЦепочкаРемонта(ВыбранноеЗначение)
	
	ЭлементДерево = Элементы.ДеревоПланаГрафикаППРСУчетомПозиции;
	
	ТекСтрокаДерева = ЭлементДерево.ТекущиеДанные;
	СтрокаРодитель = ТекСтрокаДерева;
	
	Если ТекСтрокаДерева = Неопределено Тогда
		
		ТекстСообщения = НСтр("es='¡Indiquen el objeto de la reparación para la introducción de la cadenita de los trabajos!';ru='Укажите объект ремонта для ввода цепочки работ!';en='Specify the object of repair to enter the chain of work!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
		
	ИначеЕсли ТипЗнч(ТекСтрокаДерева.Ремонты) = Тип("СправочникСсылка.торо_ОбъектыРемонта") И ЯвляетсяЛиЭлементГруппой(ТекСтрокаДерева.Ремонты) Тогда
		
		ТекстСообщения = НСтр("es='¡Indiquen el objeto de la reparación para la introducción de la cadenita de los trabajos!';ru='Укажите объект ремонта для ввода цепочки работ!';en='Specify the object of repair to enter the chain of work!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
		
	ИначеЕсли ТипЗнч(ТекСтрокаДерева.Ремонты) = Тип("СправочникСсылка.торо_ЦепочкиРемонта") Тогда
		
		СтрокаРодитель = ДеревоПланаГрафикаППРСУчетомПозиции.НайтиПоИдентификатору(ЭлементДерево.ТекущаяСтрока).ПолучитьРодителя();
		
	КонецЕсли; 
	
	ДеревоРемонтовОбработкаВыбораВР(ВыбранноеЗначение, СтрокаРодитель, "Цепочка ");

КонецПроцедуры

&НаКлиенте
Процедура ДеревоППРОбработкаВыбора_ИзФормыПодбораЦепочек(ВыбранноеЗначение)
	
	ДополнитьДеревоРемонтов(ВыбранноеЗначение.ОбъектРемонта, ВыбранноеЗначение.МассивЦепочек)
	
КонецПроцедуры
#КонецОбласти

#КонецОбласти

#Область РасчетППР

///////////////////////////////////////////////
// Расчет сразу

&НаКлиенте
Процедура РассчитатьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
	Ответ = РезультатВопроса;
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписьВыполнена = Ложь;
	Попытка
		ЗаписьВыполнена = Записать();
	Исключение
		ТекстСообщения = НСтр("es='¡La anotación del documento es imposible!';ru='Запись документа невозможна!';en='Writing is not possible!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		
		Если Объект.ДатаПланирования > Дата (3999,12,31,23,59,59) Тогда
			ТекстСообщения = НСтр("es='¡La fecha de la planificación no puede ser más de 31/12/3999!';ru='Дата планирования не может быть больше 31.12.3999 !';en='Planning date cannot be more than 12/31/999!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		Возврат;
	КонецПопытки;
	
	Если Не ЗаписьВыполнена Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьФрагмент()
	
	Если ПараметрыРасчета_РасчетВыборочный Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("РассчитатьВФоне", ПараметрыРасчета_РасчетВФоне);
		ПараметрыФормы.Вставить("мОтображатьПоложение", мОтображатьПоложение);
		ПараметрыФормы.Вставить("СтруктураИерархии", СтруктураИерархии);
		ПараметрыФормы.Вставить("ОбъектыРемонта", Объект.ОбъектыРемонта);
		ПараметрыФормы.Вставить("ДокументППР", Объект.Ссылка);
		
		Оповещение = Новый ОписаниеОповещения("РассчитатьВыборочноПослеВыбораРемонтов", ЭтотОбъект);
		ОткрытьФорму("Документ.торо_ПланГрафикРемонта.Форма.ФормаВыбораРемонтов", ПараметрыФормы, ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе
		
		МассивОР = Новый Массив;
		
		Для каждого Стр Из Объект.ОбъектыРемонта Цикл
			СтрТЧ = Новый Структура("ОбъектРемонтныхРабот, ВидРемонтныхРабот, ЭтоЦепочка");
			ЗаполнитьЗначенияСвойств(СтрТЧ, Стр);
			МассивОР.Добавить(СтрТЧ);
		КонецЦикла;
		
		РассчитатьПоМассивуОР(МассивОР);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьВыборочноПослеВыбораРемонтов(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивОР = Новый Массив;
	
	Для каждого Стр Из Результат.ОбъектыРемонта Цикл
		СтрТЧ = Новый Структура("ОбъектРемонтныхРабот, ВидРемонтныхРабот, ЭтоЦепочка");
		ЗаполнитьЗначенияСвойств(СтрТЧ, Стр);
		МассивОР.Добавить(СтрТЧ);
	КонецЦикла;
	
	РассчитатьПоМассивуОР(МассивОР);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьПоМассивуОР(МассивОР)
	
	ПараметрыРасчета_МассивВыбранныхОР.Очистить();
	Для каждого СтруктураОР из МассивОР Цикл
		ЗаполнитьЗначенияСвойств(ПараметрыРасчета_МассивВыбранныхОР.Добавить(), СтруктураОР);
	КонецЦикла;
	
	Если НЕ ПараметрыРасчета_РасчетВФоне Тогда
		
		ФОИспользоватьВозможностьОтменыРемонтов = ПолучитьЗначениеОпции("торо_ИспользоватьВозможностьОтменыРемонтов"); 
		
		Если ФОИспользоватьВозможностьОтменыРемонтов Тогда
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ОкончаниеРассчетаППР", ЭтаФорма);
			
			ПлановыеРемонтыНеНачатыРаботы = ПроверкаНеНачатыРемонтныеРаботы(МассивОР, Объект.ДатаПланирования);
			ОтменятьЗакрытиеЗаявок = НужноЛиОтменятьЗакрытиеЗаявок();
			
			Если ПлановыеРемонтыНеНачатыРаботы.Количество() > 0 Тогда
				
				Если ОтменятьЗакрытиеЗаявок Тогда
					ТекстВопроса = НСтр("es='No todos los trabajos planeados son cerrados por las actas (son comenzados los trabajos). Serán anulados. ¿Queréis dejar trabajos cualesquiera?';ru='Не все запланированные работы закрыты актами (начаты работы). Они будут отменены. Хотите оставить какие-либо работы?';en='Not all planned works are closed by acts (work has begun). They will be canceled. Want to leave any work?'");
				Иначе
					ТекстВопроса = НСтр("es='No todos los trabajos planeados son cerrados por las actas (son comenzados los trabajos). Queréis aportar las correcciones (¿anular, llevar) en estos trabajos?';ru='Не все запланированные работы закрыты актами (начаты работы). Хотите внести корректировки (отменить, перенести) в эти работы?';en='Not all planned works are closed by acts (work has begun). Want to make adjustments (cancel, reschedule) in these works?'");
				КонецЕсли;
				
				СтруктураПараметров = Новый Структура("ОписаниеОповещения, ПлановыеРемонтыНеНачатыРаботы, ОтменятьЗакрытиеЗаявок", ОписаниеОповещения, ПлановыеРемонтыНеНачатыРаботы, ОтменятьЗакрытиеЗаявок);
				ПоказатьВопрос(Новый ОписаниеОповещения("РассчитатьФрагментЗавершение", ЭтотОбъект, СтруктураПараметров), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
				
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОкончаниеРассчетаППР(Неопределено, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьФрагментЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ОписаниеОповещения = ДополнительныеПараметры.ОписаниеОповещения;
	ПлановыеРемонтыНеНачатыРаботы = ДополнительныеПараметры.ПлановыеРемонтыНеНачатыРаботы;
	ОтменятьЗакрытиеЗаявок = ДополнительныеПараметры.ОтменятьЗакрытиеЗаявок;
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		ДатаПланирования = Объект.ДатаПланирования - 1;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Владелец", Объект.Ссылка);
		ПараметрыФормы.Вставить("ДатаАктуальности", ДатаПланирования);
		ПараметрыФормы.Вставить("ЗакрываемыеРемонты", ПлановыеРемонтыНеНачатыРаботы);
		ПараметрыФормы.Вставить("ДоступностьКнопкиЗаполнить", Ложь);
		
		ОткрытьФорму("Обработка.торо_ЗакрытиеЗаявокИРемонтов.Форма", ПараметрыФормы, Объект.Ссылка, Объект.Ссылка,,,ОписаниеОповещения);
		
	Иначе
		
		Если ОтменятьЗакрытиеЗаявок Тогда
			СоздатьДокументЗакрытияЗаявокИРемонтов(Объект.Ссылка, Объект.Организация, ПлановыеРемонтыНеНачатыРаботы, Объект.ДатаПланирования);
		КонецЕсли;
		
		ОкончаниеРассчетаППР(Неопределено, Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеРассчетаППР(Результат, Параметры) Экспорт
	
	ПроверкаПередРассчетомПланГрафика(Новый ОписаниеОповещения("ОкончаниеРассчетаППРПослеПроверки",ЭтотОбъект,
																				Новый Структура("Результат, Параметры", Результат, Параметры)));
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеРассчетаППРПослеПроверки(Результат, Параметры) Экспорт
	
	ВыполнятьРасчет = Результат;
	
	Если ВыполнятьРасчет = Истина Тогда	
		
		ФОРассчитыватьПлановуюСтоимостьРемонтовПриПланировании = ПолучитьЗначениеОпции("торо_РассчитыватьПлановуюСтоимостьРемонтовПриПланировании");
		
		Если ТипЗнч(Параметры) <> Тип("Структура") Тогда
			Параметры = Новый Структура;
		КонецЕсли;
		Параметры.Вставить("ФОРассчитыватьПлановуюСтоимостьРемонтовПриПланировании", ФОРассчитыватьПлановуюСтоимостьРемонтовПриПланировании);
		
		Если ФОРассчитыватьПлановуюСтоимостьРемонтовПриПланировании И Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.торо_ВидыОперацийПланаГрафикаППР.ПланРабот") Тогда
			ПоказатьВопрос(Новый ОписаниеОповещения("ОкончаниеРассчетаППРЗавершение", ЭтотОбъект, Параметры), НСтр("es='¿Contar planificado el coste de las reparaciones, después del cálculo del plan-gráfico ППР?';ru='Рассчитать плановые стоимости ремонтов, после расчета план-графика ППР?';en='Calculate the planned cost of repairs, after calculating the schedule of PPM?'"), РежимДиалогаВопрос.ДаНет);
		Иначе
			ОкончаниеРассчетаППРЗавершение(КодВозвратаДиалога.Нет, Параметры);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеРассчетаППРЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ФОРассчитыватьПлановуюСтоимостьРемонтовПриПланировании = ДополнительныеПараметры.ФОРассчитыватьПлановуюСтоимостьРемонтовПриПланировании;
	
	Если ФОРассчитыватьПлановуюСтоимостьРемонтовПриПланировании 
		И РезультатВопроса = КодВозвратаДиалога.Да 
		И Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.торо_ВидыОперацийПланаГрафикаППР.Корректировка") Тогда
		РассчитыватьСтоимости = Истина;
	Иначе
		РассчитыватьСтоимости = Ложь;
	КонецЕсли;
	
	ПланРемонтовID = Новый Массив;
	Для каждого Стр Из Объект.ПланРемонтов Цикл
		ПланРемонтовID.Добавить(Стр.ID);
	КонецЦикла;
	
	ВопросОПерезаполнении = Ложь;
	
	Если НЕ ПараметрыРасчета_РасчетВФоне Тогда
		
		ВопросОПерезаполнении = (Объект.ПланРемонтов.Количество() > 0);
		
	Иначе
		
		СтруктураПоиска = Новый Структура("ОбъектРемонтныхРабот, ВидРемонтныхРабот");
		Для каждого СтрокаОР из ПараметрыРасчета_МассивВыбранныхОР Цикл
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаОР);
			СтрокиРемонта = Объект.ПланРемонтов.НайтиСтроки(СтруктураПоиска);
			Если СтрокиРемонта.Количество() > 0 Тогда
				ВопросОПерезаполнении = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если ВопросОПерезаполнении Тогда
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ОкончаниеРассчетаППРЗавершениеЗавершение", ЭтотОбъект, Новый Структура("РассчитыватьСтоимости", РассчитыватьСтоимости)), НСтр("es='¡Los datos de las reparaciones planeadas перезаполнены! ¿Continuar?';ru='Данные запланированных ремонтов будут перезаполнены! Продолжить?';en='Scheduled repairs will be replenished! Continue?'"),
			РежимДиалогаВопрос.ДаНет, 60);
		Возврат;
		
	КонецЕсли; 
	
	ОкончаниеРассчетаППРЗавершениеФрагмент(РассчитыватьСтоимости);
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеРассчетаППРЗавершениеЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    РассчитыватьСтоимости = ДополнительныеПараметры.РассчитыватьСтоимости;
    
    Если Не РезультатВопроса = КодВозвратаДиалога.Да Тогда
        Возврат;
    КонецЕсли;
    
    ОкончаниеРассчетаППРЗавершениеФрагмент(РассчитыватьСтоимости);

КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеРассчетаППРЗавершениеФрагмент(РассчитыватьСтоимости)    
	
	Если НЕ ПараметрыРасчета_РасчетВФоне Тогда
		
		ЗаписатьДеревоППРСУчетомПозиции();
		
		Если ПараметрыРасчета_МассивВыбранныхОР.Количество() = 0 Тогда
			
			ПоказатьПредупреждение(Неопределено, НСтр("es='ППР!';ru='Не заданы объекты ремонтных работ для заполнения плана-графика ППР!';en='Objects of repair work to fill the schedule of PPM are not set!'"));
			Возврат;
			
		КонецЕсли;
		
		РассчитатьППРНаСервере(РассчитыватьСтоимости);
		ОбновитьДоступностьДляРедактирования();
		
		Если ПоказыватьСообщениеПриРасчетеППР Тогда
			ТекстСообщения = НСтр("es='¡La atención! "
"El gráfico ППР es contado tomando en cuenta la ejecución de las reparaciones esperadas en el intervalo entre "
"la última reparación/fecha de la introducción en la explotación/fecha de la elaboración real (depende de los ajustes) "
"y la fecha de la planificación del gráfico ППР. Las reparaciones ОР cumplidas por los períodos después del período del cálculo se consideran de prioridad, "
"su presencia puede llevar a la ausencia de las reparaciones planificadas como resultado del cálculo.';ru='Внимание! "
"График ППР рассчитан с учетом выполнения ожидаемых ремонтов в интервале между "
"последним ремонтом/датой ввода в эксплуатацию/датой фактической наработки (в зависимости от настроек) "
"и датой планирования графика ППР. Выполненные ремонты ОР за периоды позже периода расчета считаются приоритетными,"
"их наличие может привести к отсутствию плановых ремонтов в результате расчета.';en='Warning!"
"The maintenance schedule is calculated taking into account the implementation of the expected repairs in the interval between"
"last repair / commissioning date / actual operating time (depending on settings)"
"and the date of planning the schedule of PPM. Completed repairs of the PR for periods later than the calculation period are considered priority,"
"their presence may lead to the absence of scheduled repairs as a result of the calculation.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
	Иначе
		
		Если ПараметрыРасчета_МассивВыбранныхОР.Количество() = 0 Тогда
			
			ПоказатьПредупреждение(Неопределено,НСтр("es='ППР!';ru='Не заданы объекты ремонтных работ для заполнения плана-графика ППР!';en='Objects of repair work to fill the schedule of PPM are not set!'"));
			Возврат;
			
		КонецЕсли;
		
		ЗаписатьДанныеВРегистр(Объект.Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьППРНаСервере(РассчитыватьСтоимости)
	
	Если НЕ ПараметрыРасчета_РасчетВыборочный Тогда
		
		ПланРемонтов = торо_РасчетППР.РасчетППР(Объект.Ссылка, РассчитыватьСтоимости);
		Если ТипЗнч(ПланРемонтов) = Тип("ТаблицаЗначений") Тогда
			Объект.ПланРемонтов.Загрузить(ПланРемонтов);
			Модифицированность = Истина;
		КонецЕсли;
		
	Иначе
		
		ПланРемонтов = торо_РасчетППР.РасчетППР(Объект.Ссылка, РассчитыватьСтоимости,,,ПараметрыРасчета_МассивВыбранныхОР.Выгрузить());
				
		Если ТипЗнч(ПланРемонтов) = Тип("ТаблицаЗначений") Тогда
			СтруктураПоиска = Новый Структура("ОбъектРемонтныхРабот, ВидРемонтныхРабот");
			
			Для каждого СтрокаОР из ПараметрыРасчета_МассивВыбранныхОР Цикл
				Если СтрокаОР.ЭтоЦепочка Тогда
					Для каждого ВидРемонтаИзЦепочки из СтрокаОР.ВидРемонтныхРабот.ПоследовательностьРемонтов Цикл
						ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаОР);
						СтруктураПоиска.ВидРемонтныхРабот = ВидРемонтаИзЦепочки.ВидРемонта;
						ЗаменитьСтрокиПланаРемонтовПоСтруктуреПоиска(ПланРемонтов, СтруктураПоиска);
					КонецЦикла;
				Иначе
					ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаОР);
					ЗаменитьСтрокиПланаРемонтовПоСтруктуреПоиска(ПланРемонтов, СтруктураПоиска);
				КонецЕсли;
			КонецЦикла;
			
			Модифицированность = Истина;
		КонецЕсли;
		
	КонецЕсли;
	ФОИспользоватьОстановочные	= ПолучитьФункциональнуюОпцию("торо_ИспользоватьОстановочныеРемонты");
	Если ФОИспользоватьОстановочные Тогда
		ОбновитьОстановочные();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаменитьСтрокиПланаРемонтовПоСтруктуреПоиска(ПланРемонтов, СтруктураПоиска)
	
	СтрокиРемонта = Объект.ПланРемонтов.НайтиСтроки(СтруктураПоиска);
	Для каждого СтрокаРемонта из СтрокиРемонта Цикл
		Объект.ПланРемонтов.Удалить(СтрокаРемонта);
	КонецЦикла;
	
	НовыеСтрокиРемонта = ПланРемонтов.НайтиСтроки(СтруктураПоиска);
	Для каждого НоваяСтрокаРемонта из НовыеСтрокиРемонта Цикл
		НовСтр = Объект.ПланРемонтов.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, НоваяСтрокаРемонта);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеВРегистр(Ссылка)
	
	НачатьТранзакцию();
		
	ПоследниеЗаписиПоППР = РегистрыСведений.торо_ППРДляРасчетаВФоновомРежиме.СрезПоследних(ТекущаяДата(),Новый Структура("ДокументППР", Ссылка));
	ИзменениеВыборочностиРасчета = Ложь;
	
	Если (ПоследниеЗаписиПоППР <> Неопределено И ПоследниеЗаписиПоППР.Количество() > 0 И Не ПоследниеЗаписиПоППР[0].Рассчитан) Тогда
		
		СуществующаяЗапись = ПоследниеЗаписиПоППР[0];
		Если СуществующаяЗапись.ВыборочныйРасчет <> ПараметрыРасчета_РасчетВыборочный Тогда
			
			ИзменениеВыборочностиРасчета = Истина;
			
			ППРДляРасчетаМенеджер = РегистрыСведений.торо_ППРДляРасчетаВФоновомРежиме.СоздатьМенеджерЗаписи();
			ППРДляРасчетаМенеджер.ДокументППР = СуществующаяЗапись.ДокументППР;
			ППРДляРасчетаМенеджер.Период = СуществующаяЗапись.Период;
			ППРДляРасчетаМенеджер.Прочитать();
			Если ППРДляРасчетаМенеджер.Выбран() Тогда
				ППРДляРасчетаМенеджер.ВыборочныйРасчет = ПараметрыРасчета_РасчетВыборочный;
				ППРДляРасчетаМенеджер.Записать();
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ППРДляРасчетаМенеджер = РегистрыСведений.торо_ППРДляРасчетаВФоновомРежиме.СоздатьМенеджерЗаписи();
		ППРДляРасчетаМенеджер.ДокументППР = Ссылка;
		ППРДляРасчетаМенеджер.Период = ТекущаяДата();
		ППРДляРасчетаМенеджер.ВыборочныйРасчет = ПараметрыРасчета_РасчетВыборочный;
		ППРДляРасчетаМенеджер.Записать();
		
	КонецЕсли;
		
	Если ПараметрыРасчета_РасчетВыборочный Тогда
		
		НаборЗаписейОбъектовРемонта = РегистрыСведений.торо_ОбъектыРемонтаДляВыборочногоРасчетаППРВФоновомРежиме.СоздатьНаборЗаписей();
		НаборЗаписейОбъектовРемонта.Отбор.ДокументППР.Установить(Ссылка);
		НаборЗаписейОбъектовРемонта.Прочитать();
		НаборЗаписейОбъектовРемонта.Очистить();
		
		Для каждого СтрокаОР из ПараметрыРасчета_МассивВыбранныхОР Цикл
			НовЗапись = НаборЗаписейОбъектовРемонта.Добавить();
			ЗаполнитьЗначенияСвойств(НовЗапись, СтрокаОР);
			НовЗапись.ДокументППР = Ссылка;
		КонецЦикла;
		
		НаборЗаписейОбъектовРемонта.Записать(Истина);
		
	Иначе
		
		Если ИзменениеВыборочностиРасчета Тогда
			НаборЗаписейОбъектовРемонта = РегистрыСведений.торо_ОбъектыРемонтаДляВыборочногоРасчетаППРВФоновомРежиме.СоздатьНаборЗаписей();
			НаборЗаписейОбъектовРемонта.Отбор.ДокументППР.Установить(Ссылка);
			НаборЗаписейОбъектовРемонта.Записать(Истина);
		КонецЕсли;
		
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры


///////////////////////////////////////////////
// Проверки

&НаКлиенте
Функция ОбязательныеПроверкиБезВопросовПередРасчетомППР()
	
	Отказ = Ложь;
	
	Если ИмеютсяДокументыНаОсновании(Объект.Ссылка) Тогда
		ТекстСообщения = НСтр("es='El recuento del gráfico ППР es imposible, porque hay unos documentos introducidos a su razón.';ru='Перерасчет графика ППР невозможен, т.к. имеются документы, введенные на его основании.';en='Recalculation of the PPM schedule is not possible, because there are documents introduced on its basis.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ПроверитьПравоДоступа() Тогда 
		ПоказатьПредупреждение(Неопределено,НСтр("es='¡La infracción de los derechos de admisión!';ru='Нарушение прав доступа!';en='Access violation!'"));
		Отказ = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДатаПланирования) Тогда
		ТекстСообщения = НСтр("es='de la planificación!';ru='Не заполнена начальная дата планирования!';en='The planning start date is not filled!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ПериодичностьДетализации) Тогда
		ПоказатьПредупреждение(Неопределено,НСтр("es='¡Para el cálculo del plan-gráfico de las reparaciones es necesario dar el período de la planificación!';ru='Для расчёта плана-графика ремонтов необходимо задать период планирования!';en='To calculate the schedule of repairs, you must specify the planning period!'"));
		Отказ = Истина;
	КонецЕсли;
	
	Возврат НЕ Отказ;
	
КонецФункции

&НаКлиенте
Процедура ПроверкаПередРассчетомПланГрафика(Знач Оповещение)
	
	Если ЗначениеЗаполнено(Объект.ПериодичностьДетализации) Тогда		
		ДатаПланированияОкончание = ОбщегоНазначенияУТКлиентСервер.РассчитатьДатуОкончанияПериода(Объект.ДатаПланирования, Объект.ПериодичностьДетализации, Объект.КоличествоПериодов);
	Иначе
		ТекстСообщения = НСтр("es='de la planificación!';ru='Не выбран период планирования!';en='No planning period selected!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	Если ДатаПланированияОкончание = Дата(4000,1,1) Тогда
		ПоказатьПредупреждение(Новый ОписаниеОповещения("ПроверкаПередРассчетомПланГрафикаЗавершение1", ЭтотОбъект, Новый Структура("ДатаПланированияОкончание, Оповещение", ДатаПланированияОкончание, Оповещение)), НСтр("es='¡El cálculo del plan-gráfico ППР puede ser cumplido solamente hasta 4000 años!';ru='Расчет план-графика ППР может быть выполнен только до 4000 года!';en='Calculation of the PPM schedule can be performed only until the year 4000!'"));
		Возврат;
	КонецЕсли;
	
	ПроверкаПередРассчетомПланГрафикаФрагмент(ДатаПланированияОкончание, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаПередРассчетомПланГрафикаЗавершение1(ДополнительныеПараметры) Экспорт
	
	ДатаПланированияОкончание = ДополнительныеПараметры.ДатаПланированияОкончание;
	Оповещение = ДополнительныеПараметры.Оповещение;
	
	ВыполнитьОбработкуОповещения(Оповещение,Ложь);
	
	ПроверкаПередРассчетомПланГрафикаФрагмент(ДатаПланированияОкончание, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаПередРассчетомПланГрафикаФрагмент(Знач ДатаПланированияОкончание, Знач Оповещение)
	
	Переменная = Объект.ДатаПланирования;
	НужныеГода = Новый СписокЗначений;
	Пока Переменная < ДатаПланированияОкончание Цикл
		НужныеГода.Добавить(ГОД(Переменная));
		Переменная = ДобавитьМесяц(Переменная,12);
	КонецЦикла;
	Если НужныеГода.НайтиПоЗначению(ГОД(ДатаПланированияОкончание)) = Неопределено Тогда 
		НужныеГода.Добавить(ГОД(ДатаПланированияОкончание));
	КонецЕсли;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.торо_ВидыОперацийПланаГрафикаППР.ПланРабот") Тогда
		МассивОР = Новый Массив;
		Для каждого Стр Из ПараметрыРасчета_МассивВыбранныхОР Цикл
			СтрТЧ = Новый Структура("ОбъектРемонтныхРабот, ВидРемонтныхРабот, ЭтоЦепочка");
			ЗаполнитьЗначенияСвойств(СтрТЧ, Стр);
			МассивОР.Добавить(СтрТЧ);
		КонецЦикла;
		
		Если ПроверкаНаПересеченияСДругимиППР(Объект.ДатаПланирования, Объект.ПериодичностьДетализации, Объект.Ссылка, ДатаПланированияОкончание, МассивОР) Тогда
			ВыполнитьОбработкуОповещения(Оповещение, Ложь);
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ПроверитьЗаполненностьГрафика(Объект.ДатаПланирования, ДатаПланированияОкончание, НужныеГода, Объект.Ссылка) Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПроверкаПередРассчетомПланГрафикаЗавершение", ЭтотОбъект,Новый Структура("Оповещение", Оповещение)), НСтр("es='"". ¿Continuar?';ru='Не заполнен календарь в справочнике ""График работ"". Продолжить?';en='The calendar in the ""Schedule"" directory is not filled. Continue?'"), РежимДиалогаВопрос.ДаНет);
	Иначе 
		ВыполнитьОбработкуОповещения(Оповещение,Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаПередРассчетомПланГрафикаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Оповещение = ДополнительныеПараметры.Оповещение;
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ВыполнитьОбработкуОповещения(Оповещение, Истина);
	Иначе 
		ВыполнитьОбработкуОповещения(Оповещение,Ложь);
	КонецЕсли;
	
КонецПроцедуры

/////////////////////////////////////////////////
// вспомогательное

&НаСервереБезКонтекста
Функция ПроверитьправоДоступа()
	
	Возврат ПравоДоступа("Изменение", Метаданные.Документы.торо_ПланГрафикРемонта) 
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЗначениеОпции(Опция)
	
	Возврат ПолучитьФункциональнуюОпцию(Опция);
	
КонецФункции

&НаСервереБезКонтекста
Функция НужноЛиОтменятьЗакрытиеЗаявок()
	
	Возврат Константы.торо_ОтменятьЗакрытиеЗаявок.Получить();

КонецФункции

&НаСервереБезКонтекста
Функция ПроверкаНеНачатыРемонтныеРаботы(МассивОР, ДатаПланирования)
	
	ОбъектыРемонта = Новый ТаблицаЗначений;
	ОбъектыРемонта.Колонки.Добавить("ОбъектРемонтныхРабот", Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта"));
	ОбъектыРемонта.Колонки.Добавить("ВидРемонтныхРабот", Новый ОписаниеТипов("СправочникСсылка.торо_ВидыРемонтов"));
	
	Для каждого Стр Из МассивОР Цикл
	
		НС = ОбъектыРемонта.Добавить();
		НС.ОбъектРемонтныхРабот = Стр.ОбъектРемонтныхРабот;
		НС.ВидРемонтныхРабот = Стр.ВидРемонтныхРабот;
	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаОРДокумента.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	               |	ТаблицаОРДокумента.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот
	               |ПОМЕСТИТЬ ТаблицаОРДокумента
	               |ИЗ
	               |	&ТаблицаОРДокумента КАК ТаблицаОРДокумента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	торо_Ремонты.Регистратор КАК Регистратор,
	               |	торо_Ремонты.ID КАК ID,
	               |	торо_Ремонты.ОбъектРемонта КАК ОбъектРемонта,
	               |	торо_Ремонты.ВидРемонта КАК ВидРемонта,
	               |	торо_Ремонты.ДатаНачалаПлан КАК ДатаНачалаПлан,
	               |	торо_Ремонты.ДатаОкончанияПлан КАК ДатаОкончанияПлан
	               |ПОМЕСТИТЬ РемонтыЗаявок
	               |ИЗ
	               |	РегистрСведений.торо_Ремонты КАК торо_Ремонты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОРДокумента КАК ТаблицаОРДокумента
	               |		ПО торо_Ремонты.ВидРемонта = ТаблицаОРДокумента.ВидРемонтныхРабот
	               |			И торо_Ремонты.ОбъектРемонта = ТаблицаОРДокумента.ОбъектРемонтныхРабот
	               |ГДЕ
	               |	ТИПЗНАЧЕНИЯ(торо_Ремонты.Регистратор) = ТИП(Документ.торо_ЗаявкаНаРемонт)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	РемонтыЗаявок.ID КАК ID,
	               |	РемонтыЗаявок.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ РемонтыСАктамиНарядами
	               |ИЗ
	               |	РегистрСведений.торо_Ремонты КАК торо_Ремонты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РемонтыЗаявок КАК РемонтыЗаявок
	               |		ПО торо_Ремонты.ID = РемонтыЗаявок.ID
	               |ГДЕ
	               |	(ТИПЗНАЧЕНИЯ(торо_Ремонты.Регистратор) = ТИП(Документ.торо_НарядНаВыполнениеРемонтныхРабот)
	               |			ИЛИ ТИПЗНАЧЕНИЯ(торо_Ремонты.Регистратор) = ТИП(Документ.торо_АктОВыполненииЭтапаРабот))
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	торо_Ремонты.ID КАК ID,
	               |	РемонтыСАктамиНарядами.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ РемонтыЗаявокСАктамиНарядами
	               |ИЗ
	               |	РемонтыСАктамиНарядами КАК РемонтыСАктамиНарядами
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_Ремонты КАК торо_Ремонты
	               |		ПО (торо_Ремонты.Регистратор = РемонтыСАктамиНарядами.Регистратор)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	торо_ПлановыеРемонтныеРаботыСрезПоследних.ID КАК ID,
	               |	торо_ПлановыеРемонтныеРаботыСрезПоследних.Регистратор КАК Регистратор,
	               |	торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаНачалаРемонтныхРабот КАК ДатаНачалаРемонтныхРабот
	               |ПОМЕСТИТЬ РемонтыПлановыеИДефекты
	               |ИЗ
	               |	ТаблицаОРДокумента КАК ТаблицаОРДокумента
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних КАК торо_ПлановыеРемонтныеРаботыСрезПоследних
	               |		ПО ТаблицаОРДокумента.ВидРемонтныхРабот = торо_ПлановыеРемонтныеРаботыСрезПоследних.ВидРемонтныхРабот
	               |			И ТаблицаОРДокумента.ОбъектРемонтныхРабот = торо_ПлановыеРемонтныеРаботыСрезПоследних.ОбъектРемонтныхРабот
	               |ГДЕ
	               |	торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаНачалаРемонтныхРабот <= &ДатаАктуальности
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	РемонтыПлановыеИДефекты.ID КАК ID
	               |ПОМЕСТИТЬ РемонтыПлановыеСПодчиненными
	               |ИЗ
	               |	РемонтыПлановыеИДефекты КАК РемонтыПлановыеИДефекты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_Ремонты КАК торо_Ремонты
	               |		ПО РемонтыПлановыеИДефекты.ID = торо_Ремонты.ID
	               |			И (ТИПЗНАЧЕНИЯ(торо_Ремонты.Регистратор) = ТИП(Документ.торо_НарядНаВыполнениеРемонтныхРабот)
	               |				ИЛИ ТИПЗНАЧЕНИЯ(торо_Ремонты.Регистратор) = ТИП(Документ.торо_АктОВыполненииЭтапаРабот))
	               |ГДЕ
	               |	торо_Ремонты.Регистратор ЕСТЬ NULL
	               |	И НЕ РемонтыПлановыеИДефекты.ID В
	               |				(ВЫБРАТЬ
	               |					РемонтыЗаявокСАктамиНарядами.ID
	               |				ИЗ
	               |					РемонтыЗаявокСАктамиНарядами КАК РемонтыЗаявокСАктамиНарядами)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РемонтыЗаявок.Регистратор КАК Регистратор,
	               |	РемонтыЗаявок.ID КАК ID,
	               |	РемонтыЗаявок.ОбъектРемонта КАК ОбъектРемонта,
	               |	РемонтыЗаявок.ВидРемонта КАК ВидРемонта,
	               |	РемонтыЗаявок.ДатаНачалаПлан КАК ДатаНачалаПлан,
	               |	РемонтыЗаявок.ДатаОкончанияПлан КАК ДатаОкончанияПлан
	               |ПОМЕСТИТЬ Заявки
	               |ИЗ
	               |	РемонтыЗаявок КАК РемонтыЗаявок
	               |ГДЕ
	               |	НЕ РемонтыЗаявок.ID В
	               |				(ВЫБРАТЬ
	               |					РемонтыЗаявокСАктамиНарядами.ID
	               |				ИЗ
	               |					РемонтыЗаявокСАктамиНарядами КАК РемонтыЗаявокСАктамиНарядами)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	торо_ПлановыеРемонтныеРаботыСрезПоследних.ID КАК ID,
	               |	торо_ПлановыеРемонтныеРаботыСрезПоследних.ОбъектРемонтныхРабот КАК ОбъектРемонта,
	               |	торо_ПлановыеРемонтныеРаботыСрезПоследних.ВидРемонтныхРабот КАК ВидРемонта,
	               |	ВЫБОР
	               |		КОГДА Заявки.Регистратор ЕСТЬ NULL
	               |			ТОГДА торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаНачалаРемонтныхРабот
	               |		ИНАЧЕ Заявки.ДатаНачалаПлан
	               |	КОНЕЦ КАК ДатаНачала,
	               |	ВЫБОР
	               |		КОГДА Заявки.Регистратор ЕСТЬ NULL
	               |			ТОГДА торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаОкончанияРемонтныхРабот
	               |		ИНАЧЕ Заявки.ДатаОкончанияПлан
	               |	КОНЕЦ КАК ДатаОкончания,
	               |	ВЫБОР
	               |		КОГДА Заявки.Регистратор ЕСТЬ NULL
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК ЕстьЗаявка,
	               |	Заявки.Регистратор КАК Заявка,
	               |	торо_ПлановыеРемонтныеРаботыСрезПоследних.Регистратор КАК Регистратор,
	               |	Константы.торо_ОтменятьЗакрытиеЗаявок КАК Отменен,
	               |	Константы.торо_ПричинаЗакрытияРемонтов КАК ПричинаЗакрытия
	               |ИЗ
	               |	РемонтыПлановыеСПодчиненными КАК РемонтыПлановыеСПодчиненными
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних КАК торо_ПлановыеРемонтныеРаботыСрезПоследних
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Заявки КАК Заявки
	               |			ПО торо_ПлановыеРемонтныеРаботыСрезПоследних.ID = Заявки.ID
	               |		ПО РемонтыПлановыеСПодчиненными.ID = торо_ПлановыеРемонтныеРаботыСрезПоследних.ID,
	               |	Константы КАК Константы
	               |ГДЕ
	               |	торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаНачалаРемонтныхРабот <= &ДатаАктуальности
	               |	И НЕ торо_ПлановыеРемонтныеРаботыСрезПоследних.Отменен
	               |	И НЕ торо_ПлановыеРемонтныеРаботыСрезПоследних.Замещен
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаНачала";
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаПланирования-1);
	Запрос.УстановитьПараметр("ТаблицаОРДокумента", ОбъектыРемонта);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивВозврата = Новый Массив;
	Пока Выборка.Следующий() Цикл
		СтрТЧ = Новый Структура("ID, ОбъектРемонта, ВидРемонта, ДатаНачала, ДатаОкончания, ЕстьЗаявка, Заявка, Регистратор, Отменен, ПричинаЗакрытия");
		ЗаполнитьЗначенияСвойств(СтрТЧ, Выборка);
		МассивВозврата.Добавить(СтрТЧ);
	КонецЦикла;
	
	Возврат МассивВозврата;
	
КонецФункции

&НаСервереБезКонтекста
Процедура СоздатьДокументЗакрытияЗаявокИРемонтов(Ссылка, Организация, ПлановыеРемонтыНеНачатыРаботы, ДатаПланирования)
	
	ДокументЗакрытиеЗаявокИРемонтов = Документы.торо_ЗакрытиеЗаявокИРемонтов.СоздатьДокумент();
	ДокументЗакрытиеЗаявокИРемонтов.ППРИнициатор = Ссылка;
	ДокументЗакрытиеЗаявокИРемонтов.Организация = Организация;
	
	Для каждого Стр Из ПлановыеРемонтыНеНачатыРаботы Цикл
		НС = ДокументЗакрытиеЗаявокИРемонтов.ЗакрываемыеРемонты.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Стр);
		
		Если Стр.ЕстьЗаявка Тогда
			НСЗаявка = ДокументЗакрытиеЗаявокИРемонтов.ЗакрываемыеЗаявки.Добавить();
			ЗаполнитьЗначенияСвойств(НСЗаявка, Стр);
		КонецЕсли;
	КонецЦикла;
			
	ДокументЗакрытиеЗаявокИРемонтов.ДатаАктуальности = ДатаПланирования-1;
	ДокументЗакрытиеЗаявокИРемонтов.Дата = ТекущаяДата();
	
	Попытка
		ДокументЗакрытиеЗаявокИРемонтов.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ТекстСообщения = НСтр("es='¡No consiguió anotar el documento ""el Cierre de las demandas y las reparaciones""! ';ru='Не удалось записать документ ""Закрытие заявок и ремонтов""! ';en='Failed to write the document ""Closing applications and repairs""! '") + ОписаниеОшибки();
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверкаНаПересеченияСДругимиППР(ДатаПланирования, ПериодичностьДетализации, Ссылка, ДатаОкончанияПланирования, ОбъектыРемонта)
	
	ТаблицаПроверкиПериодовПланирования = Новый ТаблицаЗначений;
	ТаблицаПроверкиПериодовПланирования.Колонки.Добавить("ОбъектРемонтныхРабот", Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта"));
	ТаблицаПроверкиПериодовПланирования.Колонки.Добавить("ВидРемонтныхРабот", Новый ОписаниеТипов("СправочникСсылка.торо_ВидыРемонтов"));
	ТаблицаПроверкиПериодовПланирования.Колонки.Добавить("ПериодичностьДетализации", Новый ОписаниеТипов("ПеречислениеСсылка.Периодичность"));
	ТаблицаПроверкиПериодовПланирования.Колонки.Добавить("ДатаПланирования", Новый ОписаниеТипов("Дата"));
	ТаблицаПроверкиПериодовПланирования.Колонки.Добавить("ДатаОкончанияПланирования", Новый ОписаниеТипов("Дата"));
	ТаблицаПроверкиПериодовПланирования.Колонки.Добавить("Регистратор", Новый ОписаниеТипов("ДокументСсылка.торо_ПланГрафикРемонта"));
	
	Для каждого Стр Из ОбъектыРемонта Цикл
	
		НС = ТаблицаПроверкиПериодовПланирования.Добавить();
		НС.ОбъектРемонтныхРабот = Стр.ОбъектРемонтныхРабот;
		НС.ВидРемонтныхРабот = Стр.ВидРемонтныхРабот;
		НС.ПериодичностьДетализации = ПериодичностьДетализации;
		НС.ДатаПланирования = ДатаПланирования;
		НС.ДатаОкончанияПланирования = ДатаОкончанияПланирования;
		НС.Регистратор = Ссылка;
	
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаПроверкиПериодовПланирования.ОбъектРемонтныхРабот,
	               |	ТаблицаПроверкиПериодовПланирования.ПериодичностьДетализации,
	               |	ТаблицаПроверкиПериодовПланирования.ДатаПланирования,
	               |	ТаблицаПроверкиПериодовПланирования.ДатаОкончанияПланирования,
	               |	ТаблицаПроверкиПериодовПланирования.ВидРемонтныхРабот,
	               |	ТаблицаПроверкиПериодовПланирования.Регистратор
	               |ПОМЕСТИТЬ ТаблицаПроверкиПериодовПланирования1
	               |ИЗ
	               |	&ТаблицаПроверкиПериодовПланирования КАК ТаблицаПроверкиПериодовПланирования
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПРЕДСТАВЛЕНИЕ(торо_ПериодыПланированияППР.ДатаПланирования),
	               |	ПРЕДСТАВЛЕНИЕ(торо_ПериодыПланированияППР.ПериодичностьДетализации),
	               |	ПРЕДСТАВЛЕНИЕ(торо_ПериодыПланированияППР.ОбъектРемонтныхРабот),
	               |	ПРЕДСТАВЛЕНИЕ(торо_ПериодыПланированияППР.Регистратор),
	               |	ПРЕДСТАВЛЕНИЕ(торо_ПериодыПланированияППР.ВидРемонтныхРабот)
	               |ИЗ
	               |	РегистрСведений.торо_ПериодыПланированияППР КАК торо_ПериодыПланированияППР
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПроверкиПериодовПланирования1 КАК ТаблицаПроверкиПериодовПланирования1
	               |		ПО торо_ПериодыПланированияППР.ОбъектРемонтныхРабот = ТаблицаПроверкиПериодовПланирования1.ОбъектРемонтныхРабот
	               |			И торо_ПериодыПланированияППР.ВидРемонтныхРабот = ТаблицаПроверкиПериодовПланирования1.ВидРемонтныхРабот
	               |			И торо_ПериодыПланированияППР.ДатаПланирования <= ТаблицаПроверкиПериодовПланирования1.ДатаОкончанияПланирования
	               |			И торо_ПериодыПланированияППР.ДатаОкончанияПланирования >= ТаблицаПроверкиПериодовПланирования1.ДатаПланирования
	               |			И торо_ПериодыПланированияППР.Регистратор <> ТаблицаПроверкиПериодовПланирования1.Регистратор";
	
	Запрос.УстановитьПараметр("ТаблицаПроверкиПериодовПланирования", ТаблицаПроверкиПериодовПланирования);
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ШаблонСообщения = НСтр("es='Para la maquinaria %1 y el tipo de la reparación ""%2"" para el período dado es compuesto ya el documento de la planificación: ¡%3!';ru='Для оборудования %1 и вида ремонта ""%2"" на данный период уже составлен документ планирования: %3!';en='For equipment%1 and repair type ""%2"", a planning document has already been drawn up for this period:%3!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Выборка.ОбъектРемонтныхРаботПредставление, Выборка.ВидРемонтныхРаботПредставление, Выборка.РегистраторПредставление);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
		КонецЦикла;
	Иначе	
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
	
КонецФункции


#КонецОбласти

#Область Согласование

&НаСервере
Процедура ЗавершитьУтверждениеСтатусаДокумента(ПараметрыОповещения)
	
	торо_РаботаССогласованиями.ЗавершитьУтверждениеСтатусаДокумента(ЭтаФорма, ПараметрыОповещения);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДеревоСогласующих(НовыйСпособСогласования = Ложь)  
	
	торо_РаботаССогласованиями.ОбновитьДеревоСогласующих(ЭтаФорма, НовыйСпособСогласования);
		
КонецПроцедуры

&НаКлиенте
Процедура СпособСогласованияПриИзменении(Элемент)
	Если фПослеОчистки = Ложь Тогда
		ОбновитьДеревоСогласующих(Истина);
		торо_РаботаССогласованиямиКлиентСервер.ДобавитьСтрокуВИсториюСтатусов(ЭтаФорма, СтатусДокументаРегистр,, Истина);
	Иначе
		фПослеОчистки = Ложь;
	КонецЕсли;
	
	УправлениеВидимостью(ЭтотОбъект);	
КонецПроцедуры

&НаКлиенте
Процедура СпособСогласованияОчистка(Элемент, СтандартнаяОбработка)
	Если Элемент.Значение = ПредопределенноеЗначение("Справочник.торо_СпособыСогласованияДокументов.ПустаяСсылка") Тогда
		фПослеОчистки = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СпособСогласованияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если СогласующиеРегистр.Количество() > 0 Тогда
					
		СтандартнаяОбработка = Ложь;
		ПоказатьВопрос(Новый ОписаниеОповещения("СпособСогласованияНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("Элемент",Элемент)),
						НСтр("es='¡Los datos de los estatus establecidos del documento serán limpiados! ¿Continuar?';ru='Данные по установленным статусам документа будут очищены! Продолжить?';en='Data on the established statuses of the document will be cleared! Continue?'"), РежимДиалогаВопрос.ДаНет);
								
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СпособСогласованияНачалоВыбораЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		СогласующиеРегистр.Очистить();
		Если мХранитьИсториюСогласованияВДокументах Тогда
			Объект.Согласующие.Очистить();
		КонецЕсли;
		ОткрытьФорму("Справочник.торо_СпособыСогласованияДокументов.ФормаВыбора",,ДополнительныеПараметры.Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияСтатусовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	торо_РаботаССогласованиямиКлиент.ОткрытьЗаписьИсторииСтатусов(ЭтаФорма, Элемент.ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаСервере
Процедура ОбновитьОстановочные(IDРемонта = Неопределено)
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	торо_ОстановочныеРемонтыСрезПоследних.IDЗависимого КАК ID,
	               |	торо_ОстановочныеРемонтыСрезПоследних.Регистратор
	               |ИЗ
	               |	РегистрСведений.торо_ОстановочныеРемонты.СрезПоследних(, IDЗависимого В (&ID)) КАК торо_ОстановочныеРемонтыСрезПоследних
	               |ГДЕ
	               |	НЕ торо_ОстановочныеРемонтыСрезПоследних.Отвязан";
	Запрос = Новый Запрос(ТекстЗапроса);
	Если IDРемонта = Неопределено Тогда
		Запрос.УстановитьПараметр("ID", Объект.ПланРемонтов.Выгрузить().ВыгрузитьКолонку("ID"));
	Иначе
		Запрос.УстановитьПараметр("ID", IDРемонта);
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НайденныеСтроки = Объект.ПланРемонтов.НайтиСтроки(Новый Структура("ID", Выборка.ID));
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			НайденнаяСтрока.ВРамкахОстановочного = Выборка.Регистратор;
		КонецЦикла;
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьДоступностьДляРедактирования()
	
	МассивID =Объект.ПланРемонтов.Выгрузить().ВыгрузитьКолонку("ID");
	МассивIDДляБлокировки = торо_Ремонты.ПроверитьДокументНаСвязанныеДокументыПоID(Объект.Ссылка, МассивID);
	Если МассивIDДляБлокировки.Количество() > 0 Тогда
		
		Элементы.Подразделение.ТолькоПросмотр = Истина;
		Элементы.Организация.ТолькоПросмотр = Истина;		
		Элементы.Дата.ТолькоПросмотр = Истина;		
		Элементы.Номер.ТолькоПросмотр = Истина;		
		Элементы.ДатаПланирования.ТолькоПросмотр = Истина;				
		Элементы.КоличествоПериодов.ТолькоПросмотр = Истина;				
		Элементы.ПериодичностьДетализации.ТолькоПросмотр = Истина;				
		Элементы.ДокументОснование.ТолькоПросмотр = Истина;				
		Элементы.Ответственный.ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
	МассивДоступныхДляКорректировкиСтрок.Загрузить(Документы.торо_ПланГрафикРемонта.ОбновитьДоступностьДляРедактирования(Объект.Ссылка, Объект.ВидОперации, Объект.ПланРемонтов.Выгрузить(,"ID")));
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоПланаГрафикаППРСУчетомПозиции()
	
	ТаблицаОбъектовРемонта = Объект.ОбъектыРемонта.Выгрузить();
	ДеревоПланаГрафикаППРСУчетомПозиции.ПолучитьЭлементы().Очистить();
	
	ТаблицаОбъектовРемонта.Колонки.Добавить("Положение", Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта"));
	
	Если мОтображатьПоложение Тогда
		МассивОР = ТаблицаОбъектовРемонта.ВыгрузитьКолонку("ОбъектРемонтныхРабот");
		СоответствиеПоложений = торо_РаботаСИерархией20.ПолучитьТекущихРодителейВИерархии(МассивОР, СтруктураИерархии,,Истина,Истина);
		
		Для каждого СтрокаТаблицы из ТаблицаОбъектовРемонта Цикл
			СтрокаТаблицы.Положение = СоответствиеПоложений[СтрокаТаблицы.ОбъектРемонтныхРабот];
		КонецЦикла;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаОбъектов.Положение КАК Положение,
	|	ТаблицаОбъектов.ОбъектРемонтныхРабот КАК ОбъектРемонта,
	|	ТаблицаОбъектов.ВидРемонтныхРабот КАК ВидРемонта
	|ПОМЕСТИТЬ ТаблицаОбъектов
	|ИЗ
	|	&ТаблицаОбъектов КАК ТаблицаОбъектов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОбъектов.Положение КАК Положение,
	|	ТаблицаОбъектов.ОбъектРемонта КАК ОбъектРемонта,
	|	ТаблицаОбъектов.ВидРемонта КАК ВидРемонта
	|ИЗ
	|	ТаблицаОбъектов КАК ТаблицаОбъектов
	|ИТОГИ ПО
	|	Положение,
	|	ОбъектРемонта";

	Запрос.УстановитьПараметр("ТаблицаОбъектов", ТаблицаОбъектовРемонта);
	ВыборкаПоложение = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СтрокиДерева = СоздатьКореньДерева();
	
	Пока ВыборкаПоложение.Следующий() Цикл
		
		Если ЗначениеЗаполнено(ВыборкаПоложение.Положение) Тогда
		    СтрокаПоложения = ДобавитьСтрокуПоложенияВДерево(СтрокиДерева.ПолучитьЭлементы(), ВыборкаПоложение.Положение);
		Иначе
			СтрокаПоложения = СтрокиДерева;
		КонецЕсли;
		
		ВыборкаОР = ВыборкаПоложение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаОР.Следующий() Цикл
			СтрокаОР = ДобавитьСтрокуОРВДерево(СтрокаПоложения, ВыборкаОР.ОбъектРемонта);
			ВыборкаВидовРемонта = ВыборкаОР.Выбрать(ОбходРезультатаЗапроса.Прямой);
			Пока ВыборкаВидовРемонта.Следующий() Цикл
				ДобавитьСтрокуВидаРемонтаВДерево(СтрокаОР, ВыборкаВидовРемонта.ВидРемонта);
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СоздатьКореньДерева(ВернутьКорень = Истина)
	
	Корень = ДеревоПланаГрафикаППРСУчетомПозиции.ПолучитьЭлементы().Добавить();
	Корень.Ремонты = ПредставлениеПустогоРодителя();
	Корень.НомерКартинки = 4;
	
	Если ВернутьКорень Тогда
		Возврат Корень;
	Иначе
		Возврат Истина;
	КонецЕсли

КонецФункции

&НаСервере
Процедура ЗаписатьДеревоППРСУчетомПозиции(ДокОбъект = Неопределено, ОбъектРемонтаДляОтбора = Неопределено)
	
	Если ДокОбъект = Неопределено Тогда
		ТЧДляЗаписи = Объект.ОбъектыРемонта;
	Иначе
		ТЧДляЗаписи = ДокОбъект.ОбъектыРемонта;
	КонецЕсли;
	ТЧДляЗаписи.Очистить();
	
	Если ОбъектРемонтаДляОтбора = Неопределено Тогда
		Для Каждого СтрокаДерева Из ДеревоПланаГрафикаППРСУчетомПозиции.ПолучитьЭлементы() Цикл
			ЗаписатьСтрокуДереваВТЧ(СтрокаДерева, ТЧДляЗаписи);
		КонецЦикла;
	Иначе
		СтрокаОР = торо_ОбщегоНазначенияКлиентСервер.НайтиСтрокуВДеревеФормы(ДеревоПланаГрафикаППРСУчетомПозиции.ПолучитьЭлементы(), "ОбъектРемонта", ОбъектРемонтаДляОтбора);
		Если СтрокаОР <> Неопределено Тогда
			ЗаписатьСтрокуДереваВТЧ(СтрокаОР, ТЧДляЗаписи);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСтрокуДереваВТЧ(СтрокаДерева, ТЧДляЗаписи)
	
	Если ТипЗнч(СтрокаДерева.Ремонты) = Тип("СправочникСсылка.торо_ВидыРемонтов") 
		ИЛИ ТипЗнч(СтрокаДерева.Ремонты) = Тип("СправочникСсылка.торо_ЦепочкиРемонта") Тогда
		
		НоваяСтрокаТЗ = ТЧДляЗаписи.Добавить();
		НоваяСтрокаТЗ.ВидРемонтныхРабот = СтрокаДерева.Ремонты;
		НоваяСтрокаТЗ.ОбъектРемонтныхРабот = СтрокаДерева.ПолучитьРодителя().Ремонты;
		Если ТипЗнч(СтрокаДерева.Ремонты) = Тип("СправочникСсылка.торо_ЦепочкиРемонта") Тогда
			НоваяСтрокаТЗ.ЭтоЦепочка = Истина;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(СтрокаДерева.Ремонты) = Тип("СправочникСсылка.торо_ОбъектыРемонта") И СтрокаДерева.ПолучитьЭлементы().Количество() = 0 Тогда
		НоваяСтрокаТЗ = ТЧДляЗаписи.Добавить();
		НоваяСтрокаТЗ.ОбъектРемонтныхРабот = СтрокаДерева.Ремонты;
 	КонецЕсли;
	
	Для Каждого СтрокаДЗ Из СтрокаДерева.ПолучитьЭлементы() Цикл
		ЗаписатьСтрокуДереваВТЧ(СтрокаДЗ, ТЧДляЗаписи);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсеВетвиДеревьев()
	ЭлементыДерева = ДеревоПланаГрафикаППРСУчетомПозиции.ПолучитьЭлементы();
	Если ЭлементыДерева.Количество() < 10 И ЭлементыДерева.Количество() > 0 и ЭлементыДерева[0].ПолучитьЭлементы().Количество() < 10 Тогда
		СтандартныеПодсистемыКлиент.РазвернутьУзлыДерева(ЭтаФорма, "ДеревоПланаГрафикаППРСУчетомПозиции",,Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастройкаИерархииЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
		
	ВыбранноеЗначение = ВыбранныйЭлемент;
	
	Если Не ВыбранноеЗначение = Неопределено Тогда
		
		СтруктураИерархии = ВыбранноеЗначение.Значение;
		ЗаполнитьДеревоПланаГрафикаППРСУчетомПозиции();
		РазвернутьВсеВетвиДеревьев();
		
	КонецЕсли; 
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаполнитьСписокСтруктурНаСервере(ТекСтруктураИерархии, БезТекИерархии = Ложь)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_СтруктурыОР.Ссылка,
	|	торо_СтруктурыОР.Наименование
	|ИЗ
	|	Справочник.торо_СтруктурыОР КАК торо_СтруктурыОР
	|ГДЕ
	|	торо_СтруктурыОР.ПометкаУдаления = ЛОЖЬ
	|	И торо_СтруктурыОР.СтроитсяАвтоматически = ЛОЖЬ";
	
	Если БезТекИерархии Тогда
		
		Запрос.Текст = Запрос.Текст + " И торо_СтруктурыОР.Ссылка <> &СтруктураИерархии";
		Запрос.УстановитьПараметр("СтруктураИерархии", ТекСтруктураИерархии);
		
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СписокСтруктурОР = Новый СписокЗначений;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СписокСтруктурОР.Добавить(ВыборкаДетальныеЗаписи.Ссылка, ВыборкаДетальныеЗаписи.Наименование);
		
	КонецЦикла;
	
	Если БезТекИерархии Тогда
		
		СписокСтруктурОР[0].Пометка = Истина;
	Иначе
		
		Для каждого ЭлементСписка Из СписокСтруктурОР Цикл
			
			ЭлементСписка.Пометка = ЭлементСписка.Значение = ТекСтруктураИерархии;	
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат СписокСтруктурОР;

КонецФункции

// Если открываем документ их обработки и нужно активировать указанную строку
&НаСервере
Процедура АктивироватьСтрокуИзВне(ТекСтрокаID)
	
	ПараметрПоиска = Новый Структура;
	ПараметрПоиска.Вставить("ID",ТекСтрокаID); 
	НужнаяСтрокаПланРемонтов = Объект.ПланРемонтов.НайтиСтроки(ПараметрПоиска); 
	
	ДеревоРемонтовОбъект = ДеревоПланаГрафикаППРСУчетомПозиции.ПолучитьЭлементы()[0].ПолучитьЭлементы();	
	
	Для каждого СтрокаОбъект ИЗ  ДеревоРемонтовОбъект Цикл
		Если СтрокаОбъект.Ремонты =	НужнаяСтрокаПланРемонтов[0].ОбъектРемонтныхРабот Тогда
			Для Каждого СтрокаРемонт ИЗ СтрокаОбъект.ПолучитьЭлементы() Цикл
				Если СтрокаРемонт.Ремонты =	НужнаяСтрокаПланРемонтов[0].ВидРемонтныхРабот Тогда
					Элементы.ПланРемонтов.ТекущаяСтрока = НужнаяСтрокаПланРемонтов[0].НомерСтроки-1;
					Элементы.ДеревоПланаГрафикаППРСУчетомПозиции.ТекущаяСтрока = СтрокаРемонт.ПолучитьИдентификатор();	
					Прервать;	
				КонецЕсли;
			КонецЦикла;			
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
// Процедура устанавливает внешний вид формы в зависимости от значения реквизита ВидОперации.
//
Процедура УстановитьВнешнийВидФормы()
	
	ЭтоКорректировкаППР = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.торо_ВидыОперацийПланаГрафикаППР.Корректировка");
	
	Если ЭтоКорректировкаППР Тогда
		 
		Элементы.ПериодСт.Видимость 	= Истина;
		
		Элементы.Период.Заголовок = НСтр("es='El nuevo período';ru='Новый период';en='New period'");
		ОтображатьЗамещенные = Ложь;
		Элементы.ПланРемонтовОтображатьЗамещенные.Пометка = ОтображатьЗамещенные;
		
	Иначе
		
		Элементы.ПериодСт.Видимость 	= Ложь;
		
		Элементы.Период.Заголовок = НСтр("es='El período';ru='Период';en='Period'");
		
		ОтображатьЗамещенные = Истина;
		Элементы.ПланРемонтовОтображатьЗамещенные.Пометка = ОтображатьЗамещенные;
		
	КонецЕсли; 
	
	Элементы.ДокументОснование.Видимость	= ЭтоКорректировкаППР;
	Элементы.ПланРемонтовОтменен.Видимость	= ЭтоКорректировкаППР;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьКнопкиНастройкаИерархии()
	
	Элементы.ДеревоПланаГрафикаППРСУчетомПозицииНастройкаИерархии.Доступность = мОтображатьПоложение;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЯвляетсяЛиЭлементГруппой(ОР)
	Возврат ОР.ЭтоГруппа;
КонецФункции

&НаКлиенте
Процедура ЗаполнитьИсполнителейЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	РезультатВыбора = РезультатЗакрытия;
	
	Если РезультатВыбора <> Неопределено Тогда
		
		Объект.ПланРемонтов.Очистить();
		ЭтаФорма.Модифицированность = Истина;
		
		Для каждого Стр Из РезультатВыбора Цикл
		
			НС = Объект.ПланРемонтов.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Стр);
		
		КонецЦикла; 
		
		ОбновитьДоступностьДляРедактирования();
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборСтрокВПланеРемонтов(ТекущаяСтрока)
	Элементы.ПланРемонтовВидРемонтныхРабот.Видимость = Не (ТипЗнч(ТекущаяСтрока.Ремонты) = Тип("СправочникСсылка.торо_ВидыРемонтов"));
	Элементы.ПланРемонтовОбъектРемонтныхРабот.Видимость = Не ((ТипЗнч(ТекущаяСтрока.Ремонты) = Тип("СправочникСсылка.торо_ОбъектыРемонта") И Не ПолучитьЗначениеСвойства(ТекущаяСтрока.Ремонты, "ЭтоГруппа") Или (ТипЗнч(ТекущаяСтрока.Ремонты) = Тип("СправочникСсылка.торо_ВидыРемонтов"))));
	
	Если ТипЗнч(ТекущаяСтрока.Ремонты) = Тип("СправочникСсылка.торо_ВидыРемонтов") Тогда
		УбратьУО();
		ОР = ТекущаяСтрока.ПолучитьРодителя().Ремонты;
		
		Если Элементы.ПланРемонтовОтображатьЗамещенные.Пометка Тогда
			Элементы.ПланРемонтов.ОтборСтрок = Новый ФиксированнаяСтруктура("ОбъектРемонтныхРабот, ВидРемонтныхРабот", ОР, ТекущаяСтрока.Ремонты);
		Иначе
			Элементы.ПланРемонтов.ОтборСтрок = Новый ФиксированнаяСтруктура("ОбъектРемонтныхРабот, ВидРемонтныхРабот, Замещен", ОР, ТекущаяСтрока.Ремонты, Ложь);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ТекущаяСтрока.Ремонты) = Тип("СправочникСсылка.торо_ОбъектыРемонта") 
		И ТекущаяСтрока.ПолучитьРодителя() <> Неопределено 
		Тогда
		УбратьУО();
		
		Подчиненные = ТекущаяСтрока.ПолучитьЭлементы();
		ОбъектыДляОтбора = Новый Массив;
		ОбъектыДляОтбора.Добавить(ТекущаяСтрока.Ремонты);
		
		Для каждого Подчиненный Из Подчиненные Цикл
			Если ТипЗнч(Подчиненный.Ремонты) = Тип("СправочникСсылка.торо_ОбъектыРемонта") Тогда
				ОбъектыДляОтбора.Добавить(Подчиненный.Ремонты);
			КонецЕсли; 
		КонецЦикла;
		
		Для каждого Ремонт Из Объект.ПланРемонтов Цикл
			Ремонт.Видимость = Ложь;
		КонецЦикла; 
		
		Для каждого Ремонт Из Объект.ПланРемонтов Цикл
			Если Не ОбъектыДляОтбора.Найти(Ремонт.ОбъектРемонтныхРабот) = Неопределено Тогда
			    Ремонт.Видимость = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если ОтображатьЗамещенные Тогда
			Элементы.ПланРемонтов.ОтборСтрок = Новый ФиксированнаяСтруктура("Видимость", Истина);
		Иначе
			Элементы.ПланРемонтов.ОтборСтрок = Новый ФиксированнаяСтруктура("Видимость, Замещен", Истина, Ложь);
		КонецЕсли;
		
		Если Элементы.ПланРемонтовОтображатьЗамещенные.Пометка Тогда
			Элементы.ПланРемонтов.ОтборСтрок = Новый ФиксированнаяСтруктура("Видимость", Истина);
		Иначе
			Элементы.ПланРемонтов.ОтборСтрок = Новый ФиксированнаяСтруктура("Видимость, Замещен", Истина, Ложь);
		КонецЕсли;
	ИначеЕсли ТипЗнч(ТекущаяСтрока.Ремонты) = Тип("СправочникСсылка.торо_ЦепочкиРемонта")
		И ТекущаяСтрока.ПолучитьРодителя() <> Неопределено 
		Тогда
		
		ОР = ТекущаяСтрока.ПолучитьРодителя().Ремонты;
		Если Элементы.ПланРемонтовОтображатьЗамещенные.Пометка Тогда
			Элементы.ПланРемонтов.ОтборСтрок = Новый ФиксированнаяСтруктура("ОбъектРемонтныхРабот", ОР);
		Иначе
			Элементы.ПланРемонтов.ОтборСтрок = Новый ФиксированнаяСтруктура("ОбъектРемонтныхРабот, Замещен", ОР, Ложь);
		КонецЕсли;
		Элементы.ПланРемонтовОбъектРемонтныхРабот.Видимость = Ложь;
		Элементы.ПланРемонтовВидРемонтныхРабот.Видимость = Истина;
		
		УстановитьУО(ТекущаяСтрока.Ремонты);
		
	Иначе
		УбратьУО();
		Если Элементы.ПланРемонтовОтображатьЗамещенные.Пометка Тогда
			Если Элементы.ПланРемонтов.ОтборСтрок <> Неопределено Тогда
				Элементы.ПланРемонтов.ОтборСтрок = Неопределено;
			КонецЕсли;
		Иначе
			Элементы.ПланРемонтов.ОтборСтрок = Новый ФиксированнаяСтруктура("Замещен", Ложь);
		КонецЕсли;
		Элементы.ПланРемонтовОбъектРемонтныхРабот.Видимость = Истина;
		Элементы.ПланРемонтовВидРемонтныхРабот.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначениеСвойства(Ссылка, ИмяРеквизита)
	Возврат Ссылка[ИмяРеквизита];
КонецФункции

&НаСервере
Процедура ЗаблокироватьСтрокиВПланеРемонтовПоID(РемонтыТекСтроки, РемонтыСтрокиРодителя = Неопределено)
	
	// Данный блок операторов выясняет, нет ли строк в ДеревоПланаГрафикаППРСУчетомПозиции, у которых есть подчиненные
	// строки в ПланРемонтов, которые должны быть заблокированы по ID строки из-за наличия связанных документов
	// и также устанавливает флаг блокировки изменений для строки в ДеревоПланаГрафикаППРСУчетомПозиции.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_ПланГрафикРемонтаПланРемонтов.Ссылка,
	|	торо_ПланГрафикРемонтаПланРемонтов.ID,
	|	торо_ПланГрафикРемонтаПланРемонтов.ОбъектРемонтныхРабот,
	|	торо_ПланГрафикРемонтаПланРемонтов.ВидРемонтныхРабот
	|ИЗ
	|	Документ.торо_ПланГрафикРемонта.ПланРемонтов КАК торо_ПланГрафикРемонтаПланРемонтов
	|ГДЕ
	|	торо_ПланГрафикРемонтаПланРемонтов.Ссылка = &Ссылка
	|	И торо_ПланГрафикРемонтаПланРемонтов.ID В (&ID)
	|";
	Если ТипЗнч(РемонтыТекСтроки) = Тип("СправочникСсылка.торо_ВидыРемонтов") Тогда
		Запрос.Текст = Запрос.Текст +	
		"	И торо_ПланГрафикРемонтаПланРемонтов.ОбъектРемонтныхРабот = &ОбъектРемонтныхРабот
		|";
		Запрос.Текст = Запрос.Текст +			
		"	И торо_ПланГрафикРемонтаПланРемонтов.ВидРемонтныхРабот = &ВидРемонтныхРабот
		|";
		Запрос.УстановитьПараметр("ОбъектРемонтныхРабот", РемонтыСтрокиРодителя);
		Запрос.УстановитьПараметр("ВидРемонтныхРабот", РемонтыТекСтроки);
	ИначеЕсли ТипЗнч(РемонтыТекСтроки) = Тип("СправочникСсылка.торо_ОбъектыРемонта") и РемонтыСтрокиРодителя <> Неопределено Тогда
		
		Запрос.Текст = Запрос.Текст +	
		"	И торо_ПланГрафикРемонтаПланРемонтов.ОбъектРемонтныхРабот = &ОбъектРемонтныхРабот
		|";
		Запрос.УстановитьПараметр("ОбъектРемонтныхРабот", РемонтыТекСтроки);
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + ";";
	
	Запрос.УстановитьПараметр("ID", МассивIDДляБлокировки.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);	
	
	Результат = Запрос.Выполнить();
	ТаблицаБлокируемых = Результат.Выгрузить();
	
	Если ТаблицаБлокируемых.Количество() > 0 Тогда
		МодифицируемыйОбъектРемонта = Истина;
	Иначе
		МодифицируемыйОбъектРемонта = Ложь;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьИнформациюПоСтрокеДереваПланаГрафикаППР(ОбъектРемонта, ВидРемонта, СтрокаДерева = Неопределено)
	
	Если ТипЗнч(ВидРемонта) = Тип("СправочникСсылка.торо_ВидыРемонтов") ИЛИ ТипЗнч(ВидРемонта) = Тип("СправочникСсылка.торо_ЦепочкиРемонта") Тогда
		
		Если ТипЗнч(ВидРемонта) = Тип("СправочникСсылка.торо_ЦепочкиРемонта") Тогда
			
			МассивВР = ПолучитьМассивВРЦепочкиНаСервере(ВидРемонта);
			Для каждого ВР Из МассивВР Цикл
				
				// Отбор строк в плане ремонтов по текущей строке
				СтруктураОтбора = Новый Структура("ОбъектРемонтныхРабот, ВидРемонтныхРабот", ОбъектРемонта, ВР);
			
				МассивСтрок = Объект.ПланРемонтов.НайтиСтроки(СтруктураОтбора);
				Для Каждого Элемент Из МассивСтрок Цикл
					
					Объект.ПланРемонтов.Удалить(Элемент);
					
				КонецЦикла;
				
			КонецЦикла;
		Иначе
			
			// Отбор строк в плане ремонтов по текущей строке
			СтруктураОтбора = Новый Структура("ОбъектРемонтныхРабот, ВидРемонтныхРабот", ОбъектРемонта, ВидРемонта);
		
			МассивСтрок = Объект.ПланРемонтов.НайтиСтроки(СтруктураОтбора);
			Для Каждого Элемент Из МассивСтрок Цикл
				
				Объект.ПланРемонтов.Удалить(Элемент);
				
			КонецЦикла; 
		КонецЕсли;
	Иначе
		
		ПодчиненныеСтроки = СтрокаДерева.ПолучитьЭлементы();
		
		Для каждого Стр Из ПодчиненныеСтроки Цикл
			
			УдалитьИнформациюПоСтрокеДереваПланаГрафикаППР(СтрокаДерева.Ремонты, Стр.Ремонты, Стр);
			
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПостроитьДиаграммуГантаНаСервере()
	
	Если ЗначениеЗаполнено(Объект.ПериодичностьДетализации) Тогда		
		мДатаОкончанияПланирования = ОбщегоНазначенияУТКлиентСервер.РассчитатьДатуОкончанияПериода(Объект.ДатаПланирования, Объект.ПериодичностьДетализации, Объект.КоличествоПериодов);
	Иначе
		ТекстСообщения = НСтр("es='de la planificación!';ru='Не выбран период планирования!';en='No planning period selected!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	ДеревоРемонтовОбъект = РеквизитФормыВЗначение("ДеревоПланаГрафикаППРСУчетомПозиции");
	ОбновитьДоступностьДляРедактирования();
	
	СортироватьПоНаименованию = Элементы.СортироватьПоНаименованию.Пометка;
	Если НЕ СортироватьПоНаименованию Тогда
		ТаблицаОР = Новый ТаблицаЗначений;
		ТаблицаОР.Колонки.Добавить("ОбъектРемонтныхРабот", Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта"));
		ТаблицаОР.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
		
		ЗаполнитьТаблицуОР(ТаблицаОР, ДеревоРемонтовОбъект.Строки);
		
	КонецЕсли;
	
	ОтображатьЗамещенные = Истина;
	ТаблицаПланРемонтовИсходная = ?(ОтображатьЗамещенные, Объект.ПланРемонтов.Выгрузить(), Объект.ПланРемонтов.Выгрузить(Новый Структура("Замещен",Ложь)));
	
	Если Не ОтображатьЗамещенные Тогда
		Для Каждого СтрокаПланаРемонтов Из ТаблицаПланРемонтовИсходная Цикл
			Если Объект.ВидОперации = Перечисления.торо_ВидыОперацийПланаГрафикаППР.Корректировка И СтрокаПланаРемонтов.ЗамещенСт Тогда
				СтрокаПланаРемонтов.ДатаНачСт = Дата(1,1,1);
				СтрокаПланаРемонтов.ДатаКонСт = Дата(1,1,1);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ТаблицаРемонтов = ДополнитьПланРемонтовДаннымиПоВЗ(ТаблицаПланРемонтовИсходная);
	
	ТаблицаРемонтов = ЗаполнитьДоступностьДляРедактирования(ТаблицаРемонтов);	
	
	ТаблицаРемонтов.Колонки.Добавить("ДокументППР", Новый ОписаниеТипов("ДокументСсылка.торо_ПланГрафикРемонта"));
	ТаблицаРемонтов.ЗаполнитьЗначения(Объект.Ссылка, "ДокументППР");
	
	Если НЕ СортироватьПоНаименованию Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Таб.ОбъектРемонтныхРабот,
		|	Таб.НомерСтроки
		|ПОМЕСТИТЬ ПорядокОР
		|ИЗ
		|	&Таб КАК Таб
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ПланГрафикРемонтаПланРемонтов.ID,
		|	торо_ПланГрафикРемонтаПланРемонтов.ВидРемонтныхРабот,
		|	торо_ПланГрафикРемонтаПланРемонтов.ДатаКон,
		|	торо_ПланГрафикРемонтаПланРемонтов.ДатаНач,
		|	торо_ПланГрафикРемонтаПланРемонтов.ДатаКонСт,
		|	торо_ПланГрафикРемонтаПланРемонтов.ДатаНачСт,
		|	торо_ПланГрафикРемонтаПланРемонтов.ОбъектРемонтныхРабот,
		|	торо_ПланГрафикРемонтаПланРемонтов.Отменен,
		|	торо_ПланГрафикРемонтаПланРемонтов.Замещен,
		|	торо_ПланГрафикРемонтаПланРемонтов.ЗамещенСт,
		|	торо_ПланГрафикРемонтаПланРемонтов.ЕстьДвиженияПоВЗ,
		|	торо_ПланГрафикРемонтаПланРемонтов.ЕстьВЗ,
		|	торо_ПланГрафикРемонтаПланРемонтов.ДокументППР,
		|	торо_ПланГрафикРемонтаПланРемонтов.ДоступенДляРедактирования
		|ПОМЕСТИТЬ торо_ПланГрафикРемонтаПланРемонтов
		|ИЗ
		|	&ТаблицаРемонтов КАК торо_ПланГрафикРемонтаПланРемонтов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ПланГрафикРемонтаПланРемонтов.ID,
		|	торо_ПланГрафикРемонтаПланРемонтов.ВидРемонтныхРабот,
		|	торо_ПланГрафикРемонтаПланРемонтов.ДатаКон,
		|	торо_ПланГрафикРемонтаПланРемонтов.ДатаНач,
		|	торо_ПланГрафикРемонтаПланРемонтов.ДатаКонСт,
		|	торо_ПланГрафикРемонтаПланРемонтов.ДатаНачСт,
		|	торо_ПланГрафикРемонтаПланРемонтов.ОбъектРемонтныхРабот,
		|	торо_ПланГрафикРемонтаПланРемонтов.Отменен,
		|	торо_ПланГрафикРемонтаПланРемонтов.Замещен,
		|	торо_ПланГрафикРемонтаПланРемонтов.ЗамещенСт,
		|	торо_ПланГрафикРемонтаПланРемонтов.ЕстьДвиженияПоВЗ,
		|	торо_ПланГрафикРемонтаПланРемонтов.ЕстьВЗ,
		|	торо_ПланГрафикРемонтаПланРемонтов.ДокументППР,
		|	торо_ПланГрафикРемонтаПланРемонтов.ДоступенДляРедактирования,
		|	ПорядокОР.НомерСтроки КАК НомерОР
		|ИЗ
		|	торо_ПланГрафикРемонтаПланРемонтов КАК торо_ПланГрафикРемонтаПланРемонтов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокОР КАК ПорядокОР
		|		ПО торо_ПланГрафикРемонтаПланРемонтов.ОбъектРемонтныхРабот = ПорядокОР.ОбъектРемонтныхРабот";
		
		Если НЕ ОтображатьЗамещенные Тогда
			Запрос.Текст = Запрос.Текст + " И торо_ПланГрафикРемонтаПланРемонтов.Замещен = ЛОЖЬ ";
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ТаблицаРемонтов", ТаблицаРемонтов);
		Запрос.УстановитьПараметр("Таб", ТаблицаОР);
		ТаблицаРемонтов = Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	
	ТабЦепочек = Объект.ОбъектыРемонта.Выгрузить(Новый Структура("ЭтоЦепочка",Истина));
	Если ТабЦепочек.Количество() > 0 и Не СортироватьПоНаименованию Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Таб.ОбъектРемонтныхРабот,
		               |	Таб.НомерСтроки
		               |ПОМЕСТИТЬ ПорядокОР
		               |ИЗ
		               |	&Таб КАК Таб
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	торо_ПланГрафикРемонтаПланРемонтов.ID,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ВидРемонтныхРабот,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ДатаКон,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ДатаНач,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ДатаКонСт,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ДатаНачСт,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ОбъектРемонтныхРабот,
		               |	торо_ПланГрафикРемонтаПланРемонтов.Отменен,
		               |	торо_ПланГрафикРемонтаПланРемонтов.Замещен,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ЗамещенСт,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ЕстьДвиженияПоВЗ,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ЕстьВЗ,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ДокументППР,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ДоступенДляРедактирования
		               |ПОМЕСТИТЬ торо_ПланГрафикРемонтаПланРемонтов
		               |ИЗ
		               |	&ТаблицаРемонтов КАК торо_ПланГрафикРемонтаПланРемонтов
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТабЦепочек.ВидРемонтныхработ КАК Цепочка,
		               |	ТабЦепочек.ОбъектРемонтныхРабот КАК ОбъектРемонта
		               |ПОМЕСТИТЬ ТабЦепочек
		               |ИЗ
		               |	&ТабЦепочек КАК ТабЦепочек
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТабЦепочек.ОбъектРемонта,
		               |	торо_ЦепочкиРемонтаПоследовательностьРемонтов.Ссылка,
		               |	торо_ЦепочкиРемонтаПоследовательностьРемонтов.ВидРемонта,
		               |	торо_ЦепочкиРемонтаПоследовательностьРемонтов.НомерСтроки
		               |ПОМЕСТИТЬ ТабВРЦепочек
		               |ИЗ
		               |	ТабЦепочек КАК ТабЦепочек
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ЦепочкиРемонта.ПоследовательностьРемонтов КАК торо_ЦепочкиРемонтаПоследовательностьРемонтов
		               |		ПО ТабЦепочек.Цепочка = торо_ЦепочкиРемонтаПоследовательностьРемонтов.Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	торо_ПланГрафикРемонтаПланРемонтов.ID,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ВидРемонтныхРабот,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ДатаКон,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ДатаНач,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ДатаКонСт,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ДатаНачСт,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ОбъектРемонтныхРабот,
		               |	торо_ПланГрафикРемонтаПланРемонтов.Отменен,
		               |	торо_ПланГрафикРемонтаПланРемонтов.Замещен,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ЗамещенСт,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ЕстьДвиженияПоВЗ,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ЕстьВЗ,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ДокументППР,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ДоступенДляРедактирования,
		               |	ЕСТЬNULL(ТабВРЦепочек.Ссылка, ЗНАЧЕНИЕ(Справочник.торо_ЦепочкиРемонта.ПустаяСсылка)) КАК Цепочка,
		               |	ЕСТЬNULL(ТабВРЦепочек.НомерСтроки, -1) КАК НомерСтрокиВРЦепочки,
		               |	ПорядокОР.НомерСтроки КАК НомерОР
		               |ИЗ
		               |	торо_ПланГрафикРемонтаПланРемонтов КАК торо_ПланГрафикРемонтаПланРемонтов
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТабВРЦепочек КАК ТабВРЦепочек
		               |		ПО торо_ПланГрафикРемонтаПланРемонтов.ВидРемонтныхРабот = ТабВРЦепочек.ВидРемонта
		               |			И торо_ПланГрафикРемонтаПланРемонтов.ОбъектРемонтныхРабот = ТабВРЦепочек.ОбъектРемонта
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокОР КАК ПорядокОР
		               |		ПО торо_ПланГрафикРемонтаПланРемонтов.ОбъектРемонтныхРабот = ПорядокОР.ОбъектРемонтныхРабот
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	НомерСтрокиВРЦепочки";
		Запрос.УстановитьПараметр("ТаблицаРемонтов", ТаблицаРемонтов);
		Запрос.УстановитьПараметр("Таб", ТаблицаОР);
		Запрос.УстановитьПараметр("ТабЦепочек", ТабЦепочек);			
		ТаблицаРемонтов = Запрос.Выполнить().Выгрузить();
	ИначеЕсли ТабЦепочек.Количество() > 0 и СортироватьПоНаименованию Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	торо_ПланГрафикРемонтаПланРемонтов.ID,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ВидРемонтныхРабот,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ДатаКон,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ДатаНач,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ДатаКонСт,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ДатаНачСт,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ОбъектРемонтныхРабот,
		               |	торо_ПланГрафикРемонтаПланРемонтов.Отменен,
		               |	торо_ПланГрафикРемонтаПланРемонтов.Замещен,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ЗамещенСт,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ЕстьДвиженияПоВЗ,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ЕстьВЗ,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ДокументППР,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ДоступенДляРедактирования
		               |ПОМЕСТИТЬ торо_ПланГрафикРемонтаПланРемонтов
		               |ИЗ
		               |	&ТаблицаРемонтов КАК торо_ПланГрафикРемонтаПланРемонтов
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТабЦепочек.ВидРемонтныхработ КАК Цепочка,
		               |	ТабЦепочек.ОбъектРемонтныхРабот КАК ОбъектРемонта
		               |ПОМЕСТИТЬ ТабЦепочек
		               |ИЗ
		               |	&ТабЦепочек КАК ТабЦепочек
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТабЦепочек.ОбъектРемонта,
		               |	торо_ЦепочкиРемонтаПоследовательностьРемонтов.Ссылка,
		               |	торо_ЦепочкиРемонтаПоследовательностьРемонтов.ВидРемонта,
		               |	торо_ЦепочкиРемонтаПоследовательностьРемонтов.НомерСтроки
		               |ПОМЕСТИТЬ ТабВРЦепочек
		               |ИЗ
		               |	ТабЦепочек КАК ТабЦепочек
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ЦепочкиРемонта.ПоследовательностьРемонтов КАК торо_ЦепочкиРемонтаПоследовательностьРемонтов
		               |		ПО ТабЦепочек.Цепочка = торо_ЦепочкиРемонтаПоследовательностьРемонтов.Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	торо_ПланГрафикРемонтаПланРемонтов.ID,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ВидРемонтныхРабот,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ДатаКон,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ДатаНач,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ДатаКонСт,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ДатаНачСт,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ОбъектРемонтныхРабот,
		               |	торо_ПланГрафикРемонтаПланРемонтов.Отменен,
		               |	торо_ПланГрафикРемонтаПланРемонтов.Замещен,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ЗамещенСт,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ЕстьДвиженияПоВЗ,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ЕстьВЗ,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ДокументППР,
		               |	торо_ПланГрафикРемонтаПланРемонтов.ДоступенДляРедактирования,
		               |	ЕСТЬNULL(ТабВРЦепочек.НомерСтроки, -1) КАК НомерСтрокиВРЦепочки
		               |ИЗ
		               |	торо_ПланГрафикРемонтаПланРемонтов КАК торо_ПланГрафикРемонтаПланРемонтов
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТабВРЦепочек КАК ТабВРЦепочек
		               |		ПО торо_ПланГрафикРемонтаПланРемонтов.ВидРемонтныхРабот = ТабВРЦепочек.ВидРемонта
		               |			И торо_ПланГрафикРемонтаПланРемонтов.ОбъектРемонтныхРабот = ТабВРЦепочек.ОбъектРемонта
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	НомерСтрокиВРЦепочки";
		Запрос.УстановитьПараметр("ТаблицаРемонтов", ТаблицаРемонтов);
		Запрос.УстановитьПараметр("ТабЦепочек", ТабЦепочек);			
		ТаблицаРемонтов = Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	
	ДиаграммаГантаППР.Обновление = Ложь;

	торо_Ремонты.ПостроитьДиаграммуГантаДляППР(ДиаграммаГантаППР, ТаблицаРемонтов, СтруктураИерархии, мОтображатьПоложение,,, Объект.ВидОперации = Перечисления.торо_ВидыОперацийПланаГрафикаППР.Корректировка, , , ,СортироватьПоНаименованию);
	ДиаграммаГантаППР.УстановитьПолныйИнтервал(НачалоДня(Объект.ДатаПланирования), КонецДня(мДатаОкончанияПланирования));
	ДиаграммаГантаППР.ОтображатьЛегенду = Ложь;
	ДиаграммаГантаППР.Обновление = Истина;

	
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьТаблицуОР(ТаблицаОР, КоллекцияСтрок, Сч = 1)
	
	ТаблицаОР.Индексы.Добавить("ОбъектРемонтныхРабот");
	Если КоллекцияСтрок.Количество() Тогда
		
		Для каждого Элемент Из КоллекцияСтрок Цикл
			Если ТипЗнч(Элемент.Ремонты) = Тип("СправочникСсылка.торо_ОбъектыРемонта") Тогда
				НайдСтрока = ТаблицаОР.Найти(Элемент.Ремонты, "ОбъектРемонтныхРабот");
				Если НайдСтрока = Неопределено Тогда 
					НС = ТаблицаОР.Добавить();
					НС.ОбъектРемонтныхРабот = Элемент.Ремонты;
					НС.НомерСтроки = Сч;
					Сч = Сч + 1;
				КонецЕсли;
			КонецЕсли;	
			ЗаполнитьТаблицуОР(ТаблицаОР, Элемент.Строки, Сч);
			
		КонецЦикла; 
		
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Функция ЗаполнитьДоступностьДляРедактирования(парамПланРемонтов)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	торо_ПланГрафикРемонтаПланРемонтов.ID,
	|	торо_ПланГрафикРемонтаПланРемонтов.ВидРемонтныхРабот,
	|	торо_ПланГрафикРемонтаПланРемонтов.ДатаКон,
	|	торо_ПланГрафикРемонтаПланРемонтов.ДатаНач,
	|	торо_ПланГрафикРемонтаПланРемонтов.ДатаКонСт,
	|	торо_ПланГрафикРемонтаПланРемонтов.ДатаНачСт,
	|	торо_ПланГрафикРемонтаПланРемонтов.ОбъектРемонтныхРабот,
	|	торо_ПланГрафикРемонтаПланРемонтов.Отменен,
	|	торо_ПланГрафикРемонтаПланРемонтов.Замещен,
	|	торо_ПланГрафикРемонтаПланРемонтов.ЗамещенСт,
	|	торо_ПланГрафикРемонтаПланРемонтов.ЕстьДвиженияПоВЗ,
	|	торо_ПланГрафикРемонтаПланРемонтов.ЕстьВЗ
	|ПОМЕСТИТЬ торо_ПланГрафикРемонтаПланРемонтов
	|ИЗ
	|	&ПланРемонтов КАК торо_ПланГрафикРемонтаПланРемонтов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДоступенДляРедакторования.ID,
	|	ТаблицаДоступенДляРедакторования.ДоступенДляРедактирования
	|ПОМЕСТИТЬ ТаблицаДоступенДляРедакторования
	|ИЗ
	|	&ТаблицаДоступенДляРедакторования КАК ТаблицаДоступенДляРедакторования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ПланГрафикРемонтаПланРемонтов.ID,
	|	торо_ПланГрафикРемонтаПланРемонтов.ВидРемонтныхРабот,
	|	торо_ПланГрафикРемонтаПланРемонтов.ДатаКон,
	|	торо_ПланГрафикРемонтаПланРемонтов.ДатаНач,
	|	торо_ПланГрафикРемонтаПланРемонтов.ДатаКонСт,
	|	торо_ПланГрафикРемонтаПланРемонтов.ДатаНачСт,
	|	торо_ПланГрафикРемонтаПланРемонтов.ОбъектРемонтныхРабот,
	|	торо_ПланГрафикРемонтаПланРемонтов.Отменен,
	|	торо_ПланГрафикРемонтаПланРемонтов.Замещен,
	|	торо_ПланГрафикРемонтаПланРемонтов.ЗамещенСт,
	|	торо_ПланГрафикРемонтаПланРемонтов.ЕстьДвиженияПоВЗ,
	|	торо_ПланГрафикРемонтаПланРемонтов.ЕстьВЗ,
	|	ЕстьNULL(ТаблицаДоступенДляРедакторования.ДоступенДляРедактирования,Истина) КАК ДоступенДляРедактирования
	|ИЗ
	|	торо_ПланГрафикРемонтаПланРемонтов КАК торо_ПланГрафикРемонтаПланРемонтов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДоступенДляРедакторования КАК ТаблицаДоступенДляРедакторования
	|		ПО торо_ПланГрафикРемонтаПланРемонтов.ID = ТаблицаДоступенДляРедакторования.ID";
	
	Запрос.УстановитьПараметр("ПланРемонтов",парамПланРемонтов);
	Запрос.УстановитьПараметр("ТаблицаДоступенДляРедакторования",МассивДоступныхДляКорректировкиСтрок.Выгрузить());
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

&НаСервере
Функция ДополнитьПланРемонтовДаннымиПоВЗ(ПланРемонтов)
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_ПланГрафикРемонтаПланРемонтов.ID,
	               |	торо_ПланГрафикРемонтаПланРемонтов.ВидРемонтныхРабот,
	               |	торо_ПланГрафикРемонтаПланРемонтов.ДатаКон,
	               |	торо_ПланГрафикРемонтаПланРемонтов.ДатаНач,
	               |	торо_ПланГрафикРемонтаПланРемонтов.ДатаКонСт,
	               |	торо_ПланГрафикРемонтаПланРемонтов.ДатаНачСт,
	               |	торо_ПланГрафикРемонтаПланРемонтов.ОбъектРемонтныхРабот,
	               |	торо_ПланГрафикРемонтаПланРемонтов.Отменен,
	               |	торо_ПланГрафикРемонтаПланРемонтов.Замещен,
	               |	торо_ПланГрафикРемонтаПланРемонтов.ЗамещенСт
	               |ПОМЕСТИТЬ ТабДокумента
	               |ИЗ
	               |	&ПланРемонтов КАК торо_ПланГрафикРемонтаПланРемонтов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТабДокумента.ID,
	               |	ТабДокумента.ВидРемонтныхРабот,
	               |	ТабДокумента.ДатаКон,
	               |	ТабДокумента.ДатаНач,
	               |	ТабДокумента.ДатаКонСт,
	               |	ТабДокумента.ДатаНачСт,
	               |	ТабДокумента.ОбъектРемонтныхРабот,
	               |	ТабДокумента.Отменен,
	               |	ТабДокумента.Замещен,
	               |	ТабДокумента.ЗамещенСт,
	               |	ЛОЖЬ КАК ЕстьВЗ,
	               |	ЛОЖЬ КАК ЕстьДвиженияПоВЗ
	               |ИЗ
	               |	ТабДокумента КАК ТабДокумента";
	
	Запрос.УстановитьПараметр("ПланРемонтов",ПланРемонтов);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаКлиенте
Процедура УстановитьОценкуРМЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
        Возврат;
    Иначе
        Записать();
    КонецЕсли;
    
    УстановитьОценкуРМФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОценкуРМФрагмент()
    
    Перем ФормаОбработка;
    
    ФормаОбработка = ПолучитьФорму("Обработка.торо_УстановкаОценкиРМПлановыхРемонтов.Форма", Новый Структура("ПланГрафикРемонта", Объект.Ссылка), Объект.Ссылка, Объект.Ссылка);
    
    ФормаОбработка.Открыть();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ИмеютсяДокументыНаОсновании(Ссылка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_ПланГрафикРемонта.Ссылка
	|ИЗ
	|	Документ.торо_ПланГрафикРемонта КАК торо_ПланГрафикРемонта
	|ГДЕ
	|	торо_ПланГрафикРемонта.ДокументОснование = &ДокументОснование
	|	И торо_ПланГрафикРемонта.Проведен
	|	И НЕ торо_ПланГрафикРемонта.ПометкаУдаления
	|	И НЕ торо_ПланГрафикРемонта.ДокументОснование = ЗНАЧЕНИЕ(Документ.торо_ПланГрафикРемонта.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ЗаявкаНаРемонтДокументыОснования.Ссылка
	|ИЗ
	|	Документ.торо_ЗаявкаНаРемонт.ДокументыОснования КАК торо_ЗаявкаНаРемонтДокументыОснования
	|ГДЕ
	|	торо_ЗаявкаНаРемонтДокументыОснования.ДокументОснование = &ДокументОснование
	|	И торо_ЗаявкаНаРемонтДокументыОснования.Ссылка.Проведен
	|	И НЕ торо_ЗаявкаНаРемонтДокументыОснования.Ссылка.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_НарядНаВыполнениеРемонтныхРаботДокументыОснования.Ссылка
	|ИЗ
	|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.ДокументыОснования КАК торо_НарядНаВыполнениеРемонтныхРаботДокументыОснования
	|ГДЕ
	|	торо_НарядНаВыполнениеРемонтныхРаботДокументыОснования.ДокументОснование = &ДокументОснование
	|	И торо_НарядНаВыполнениеРемонтныхРаботДокументыОснования.Ссылка.Проведен
	|	И НЕ торо_НарядНаВыполнениеРемонтныхРаботДокументыОснования.Ссылка.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_АктОВыполненииЭтапаРаботДокументыОснования.Ссылка
	|ИЗ
	|	Документ.торо_АктОВыполненииЭтапаРабот.ДокументыОснования КАК торо_АктОВыполненииЭтапаРаботДокументыОснования
	|ГДЕ
	|	торо_АктОВыполненииЭтапаРаботДокументыОснования.ДокументОснование = &ДокументОснование
	|	И торо_АктОВыполненииЭтапаРаботДокументыОснования.Ссылка.Проведен
	|	И НЕ торо_АктОВыполненииЭтапаРаботДокументыОснования.Ссылка.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ДокументОснование", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка.Следующий();
	
КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьЗаполненностьГрафика(ДатаПланированияНачала, ДатаПланированияОкончание, НужныеГодаСписок, Ссылка)
	
	НужныеГода = Новый ТаблицаЗначений;
	ТипГодГрафика = Новый Массив;
	ТипГодГрафика.Добавить(Тип("Число"));
	НужныеГода.Колонки.Добавить("ГодГрафика",Новый ОписаниеТипов(ТипГодГрафика), "ГодГрафика");
	
	Для каждого Элем Из НужныеГодаСписок Цикл
	
		НужныеГода.Добавить().ГодГрафика = Элем.Значение;
	
	КонецЦикла; 
	
	ГрафикЗаполнен = Истина;
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = 

    "ВЫБРАТЬ
    |	торо_НормативныеРемонтыОборудования.ГрафикРемонтныхРабот КАК ГрафикРемонтныхРабот
    |ПОМЕСТИТЬ ТабГрафиков
    |ИЗ
    |	Документ.торо_ПланГрафикРемонта.ОбъектыРемонта КАК торо_ПланГрафикРемонтаОбъектыРемонта
    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_НормативныеРемонтыОборудования КАК торо_НормативныеРемонтыОборудования
    |		ПО торо_ПланГрафикРемонтаОбъектыРемонта.ОбъектРемонтныхРабот = торо_НормативныеРемонтыОборудования.ОбъектРемонта
    |			И торо_ПланГрафикРемонтаОбъектыРемонта.ВидРемонтныхРабот = торо_НормативныеРемонтыОборудования.ВидРемонта
    |ГДЕ
    |	торо_ПланГрафикРемонтаОбъектыРемонта.Ссылка = &Ссылка
    |	И торо_НормативныеРемонтыОборудования.Приоритет
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	торо_ОбъектыРемонта.ПлановыйГрафикРаботы
    |ИЗ
    |	Документ.торо_ПланГрафикРемонта.ОбъектыРемонта КАК торо_ПланГрафикРемонтаОбъектыРемонта
    |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
    |		ПО торо_ПланГрафикРемонтаОбъектыРемонта.ОбъектРемонтныхРабот = торо_ОбъектыРемонта.Ссылка
    |ГДЕ
    |	торо_ПланГрафикРемонтаОбъектыРемонта.Ссылка = &Ссылка
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗЛИЧНЫЕ
    |	ТабГрафиков.ГрафикРемонтныхРабот КАК ГрафикРемонтныхРабот
    |ИЗ
    |	ТабГрафиков КАК ТабГрафиков";
	
	Результат = Запрос.Выполнить();
	МассивГрафиков = Результат.Выгрузить().ВыгрузитьКолонку("ГрафикРемонтныхРабот");
	
	КалендарныеГрафики.СоздатьВТРасписанияРаботыНаПериод(МенеджерВТ, МассивГрафиков, НачалоДня(ДатаПланированияНачала), ДатаПланированияОкончание);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = "ВЫБРАТЬ
	|	НужныеГода.ГодГрафика
	|ПОМЕСТИТЬ НужныеГода
	|ИЗ
	|  &НужныеГода КАК НужныеГода
	|;
	|ВЫБРАТЬ
	|	ТабГрафиков.ГрафикРемонтныхРабот,
	|	НужныеГода.ГодГрафика
	|ПОМЕСТИТЬ ВремТабл
	|ИЗ
	|	ТабГрафиков КАК ТабГрафиков,
	|	НужныеГода КАК НужныеГода
	|;
	|ВЫБРАТЬ
	|	ВТРасписанияРаботы.ГрафикРаботы,
	|	ГОД(ВТРасписанияРаботы.ДатаГрафика) КАК ГодГрафика,
	|	СУММА(РАЗНОСТЬДАТ(ВТРасписанияРаботы.ВремяНачала, ВТРасписанияРаботы.ВремяОкончания, СЕКУНДА)) КАК ОсновноеЗначение
	|ПОМЕСТИТЬ ВТРасписанияРаботыИзм
	|ИЗ
	|	ВТРасписанияРаботы КАК ВТРасписанияРаботы
	|СГРУППИРОВАТЬ ПО
	|	ВТРасписанияРаботы.ГрафикРаботы,
	|	ГОД(ВТРасписанияРаботы.ДатаГрафика)
	|;
	|ВЫБРАТЬ
	|	ВремТабл.ГрафикРемонтныхРабот КАК ГрафикРаботы,
	|	ВремТабл.ГодГрафика,
	|	ЕСТЬNULL(ВТРасписанияРаботыИзм.ОсновноеЗначение, 0) КАК ОсновноеЗначение
	|ИЗ
	|	ВремТабл КАК ВремТабл
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТРасписанияРаботыИзм КАК ВТРасписанияРаботыИзм
	|	ПО ВремТабл.ГодГрафика = ВТРасписанияРаботыИзм.ГодГрафика
	|		И ВремТабл.ГрафикРемонтныхРабот = ВТРасписанияРаботыИзм.ГрафикРаботы";
	
	Запрос.УстановитьПараметр("НужныеГода", НужныеГода);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ОсновноеЗначение = 0 Тогда
			ШаблонСообщения = НСтр("es='año.';ru='Не заполнен график %1 за %2 год.';en='Schedule%1 for%2 year not filled.'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Выборка.ГрафикРаботы, Выборка.ГодГрафика);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			ГрафикЗаполнен = Ложь;
     	КонецЕсли;
	КонецЦикла;
	
	Возврат ГрафикЗаполнен;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьСтоимостиРемонтовЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса = КодВозвратаДиалога.Да тогда
        РассчитатьСтоимостиРемонтовНаСервере();
		Модифицированность = Истина;
    КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура РассчитатьСтоимостиРемонтовНаСервере(ТекущиеДанные = Неопределено)
	
	ЗначениеВозврата = Документы.торо_ПланГрафикРемонта.РассчитатьСтоимостиРемонтов(Объект.ПланРемонтов.Выгрузить(), Объект.Ссылка, МассивДоступныхДляКорректировкиСтрок.Выгрузить(), ТекущиеДанные);
	
	Если ТипЗнч(ЗначениеВозврата) = Тип("Число") Тогда
		МассивСтрокТЧ = Объект.ПланРемонтов.НайтиСтроки(Новый Структура("ID", ТекущиеДанные.ID));
		Если МассивСтрокТЧ.Количество() = 0 Тогда
			СтрокаТЧ = МассивСтрокТЧ[0];
			СтрокаТЧ.СуммаРемонта = ЗначениеВозврата;
		КонецЕсли;
	Иначе
		Объект.ПланРемонтов.Загрузить(ЗначениеВозврата);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокЦепочек(ОбъектРемонта)
	
	СписокОтбора = Новый СписокЗначений;
	СписокОтбора.Добавить(ОбъектРемонта);
	СписокОтбора.Добавить(ОбъектРемонта.ТиповойОР);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_РемонтныеЦиклыОборудования.ВидЦепочки,
	|	торо_РемонтныеЦиклыОборудования.ГруппаОбъектовРемонтов
	|ИЗ
	|	РегистрСведений.торо_РемонтныеЦиклыОборудования КАК торо_РемонтныеЦиклыОборудования
	|ГДЕ
	|	торо_РемонтныеЦиклыОборудования.ГруппаОбъектовРемонтов В (&СписокОтбора)";
	
	Запрос.УстановитьПараметр("СписокОтбора", СписокОтбора);
	
	ТЗЦепочекОбъекта = Запрос.Выполнить().Выгрузить();
	МассивЦепочек = ТЗЦепочекОбъекта.ВыгрузитьКолонку("ВидЦепочки");
	
	СписокВозврата = Новый СписокЗначений;
	СписокВозврата.ЗагрузитьЗначения(МассивЦепочек);
	
	Возврат СписокВозврата;
	
КонецФункции

&НаКлиенте 
Процедура ДокументОснованиеПриИзмененииЗавершение(Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ДокументОснованиеПриИзмененииНаСервере();
		РазвернутьВсеВетвиДеревьев();
	КонецЕсли; 	
КонецПроцедуры

&НаСервере 
Функция СоздатьДокумент_ЗаказНаВнутреннеПотребление(ТекущийРемонт, СоздатьДокумент = ложь)
	
		МассивДанных = Новый Массив;
		
		Структура    = Новый Структура;
		Структура.Вставить("ОбъектРемонтныхРабот", ТекущийРемонт.ОбъектРемонтныхРабот);
		Структура.Вставить("ВидРемонтныхРабот"   , ТекущийРемонт.ВидРемонтныхРабот);
		Структура.Вставить("ДатаНач"             , ТекущийРемонт.ДатаНач);
		Структура.Вставить("ID"                  , ТекущийРемонт.ID);
		
		МассивДанных.Добавить(Структура);
		
		СтруктураПараметров = Новый Структура();
		СтруктураПередаваемыхВОбработчикПараметров = Новый Структура;
		СтруктураПередаваемыхВОбработчикПараметров.Вставить("ТекущийРемонт_ID",ТекущийРемонт.ID);
		
		стрВозврата = Новый Структура;
		стрВозврата.Вставить("СтруктураПараметров", СтруктураПараметров);
		стрВозврата.Вставить("СтруктураПередаваемыхВОбработчикПараметров", СтруктураПередаваемыхВОбработчикПараметров);		
		
		МассивСтрокНоменклатуры = СформироватьМассивНоменклатурыКЗаказуСервере(МассивДанных);	
		
		// Значение неопределено, когда вся имеющаяся в заявке номенклатура уже есть в документе заказ на вн потребл.
		Если МассивСтрокНоменклатуры = Неопределено и НЕ СоздатьДокумент Тогда
			МассивСтрокНоменклатуры = Новый Массив;
		ИначеЕсли МассивСтрокНоменклатуры = Неопределено и СоздатьДокумент Тогда
			ШаблонСообщения = НСтр("es='A todos los materiales planificados para el objeto de la reparación %1 para el tipo de la reparación %2 de %3 son introducidos los encargos del consumo interior';ru='На все плановые материалы для объекта ремонта %1 для вида ремонта %2 от %3 введены заказы на внутреннее потребление';en='Domestic consumption orders have been entered for all planned materials for repair object%1 for repair type%2 from%3'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекущийРемонт.ОбъектРемонтныхРабот, ТекущийРемонт.ВидРемонтныхРабот, ТекущийРемонт.ДатаНач);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат стрВозврата;
		КонецЕсли;		
		
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("МассивСтрокНоменклатуры",МассивСтрокНоменклатуры);
		
		ТекДата = ТекущаяДата();
		Если СоздатьДокумент ИЛИ НЕ ТекДата > ТекущийРемонт.ДатаНач Тогда 
			ЗначенияЗаполнения.Вставить("ДатаОтгрузки", ТекущийРемонт.ДатаНач);
		КонецЕсли;
		
		СтрокаКомментария = СтрШаблон(НСтр("es='El Plan-gráfico ППР %1 de %2 %3 %4 %5';ru='План-график ППР %1 от %2 %3 %4 %5';en='Schedule PPM %1 from %2 %3 %4%5'"),
							Объект.Номер, Объект.Дата, ТекущийРемонт.ОбъектРемонтныхРабот, ТекущийРемонт.ВидРемонтныхРабот, Формат(ТекущийРемонт.ДатаНач, НСтр("es='ÄÖ=DD. MM.yyyy';ru='ДФ=dd.MM.yyyy';en='ДФ=dd.MM.yyyy'")));
		ЗначенияЗаполнения.Вставить("Комментарий" , СтрокаКомментария);
		
		ЗначенияЗаполнения.Вставить("Склад", ТекущийРемонт.Склад);
		ЗначенияЗаполнения.Вставить("Подразделение", Объект.Подразделение);
		ЗначенияЗаполнения.Вставить("Организация", Объект.Организация);
		
		СтруктураПараметров.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
				
		Если СоздатьДокумент Тогда
			
			Если СтруктураПараметров.Количество() = 0 тогда
				Возврат стрВозврата;
			КонецЕсли;
			
			Попытка
				ДокОбъект = Документы.ЗаказНаВнутреннееПотребление.СоздатьДокумент();
				ДокОбъект.Заполнить(СтруктураПараметров.ЗначенияЗаполнения);
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
				
				СтруктураПередаваемыхВОбработчикПараметров.Вставить("Ссылка", ДокОбъект.Ссылка);
				ДобавитьИзменитьЗаписиВРегистреТоро_ИнтеграцияДокументовСервер(Неопределено, СтруктураПередаваемыхВОбработчикПараметров);
			Исключение
				ШаблонСообщения = НСтр("es='A la creación del documento ""el Encargo en es interior потребеление"" había una falta: %1.';ru='При создании документа ""Заказ на внутренне потребеление"" произошла ошибка: %1.';en='An error occurred while creating the document ""Domestic consumption order"":%1.'");
				ТекстСообщения = СтрШаблон(ШаблонСообщения, ОписаниеОшибки());
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			КонецПопытки;
		КонецЕсли;
		
		Возврат стрВозврата;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеВидимостью(ДокОбъект)
	Элементы = ДокОбъект.Элементы;
	Объект = ДокОбъект.Объект;
	Элементы.ДеревоСогласованияУтвердитьСтатус.Доступность = ЗначениеЗаполнено(Объект.СпособСогласования);
КонецПроцедуры

&НаСервере 
Функция ПолучитьПараметрыВР(ВыбранноеЗначение, ОР)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	торо_НормативныеРемонтыОборудования.НеУчаствуетВПланировании,
	               |	торо_НормативныеРемонтыОборудования.ВидРемонта.Наименование КАК Наименование
	               |ИЗ
	               |	РегистрСведений.торо_НормативныеРемонтыОборудования КАК торо_НормативныеРемонтыОборудования
	               |ГДЕ
	               |	торо_НормативныеРемонтыОборудования.ОбъектРемонта = &ОР
	               |	И торо_НормативныеРемонтыОборудования.ВидРемонта = &ВР";
				   
	Запрос.УстановитьПараметр("ОР", ОР);
	Запрос.УстановитьПараметр("ВР", ВыбранноеЗначение);
	
	стрВозврата = Новый Структура("Наименование, НеУчаствуетВПланировании");
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() тогда
		Возврат стрВозврата;
	КонецЕсли;
	
	Выборка = Результат.Выбрать(); 
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(стрВозврата, Выборка);
	Возврат стрВозврата;
	
КонецФункции

&НаСервере 
Функция ПолучитьПараметрыОР(ОР)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_ОбъектыРемонта.Наименование,
	               |	торо_ОбъектыРемонта.НеУчаствуетВПланировании,
				   |	торо_ОбъектыРемонта.ЭтоГруппа
	               |ИЗ
	               |	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	               |ГДЕ
	               |	торо_ОбъектыРемонта.Ссылка = &Ссылка";
				   
	Запрос.УстановитьПараметр("Ссылка", ОР);
	
	СтрВозврата = Новый Структура("Наименование, НеУчаствуетВПланировании, ЭтоГруппа", "", Ложь, Истина);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат СтрВозврата;
	КонецЕсли;
	
	Выборка = результат.Выбрать();
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(СтрВозврата, Выборка);
	
	Возврат СтрВозврата;
	
КонецФункции

&НаСервере
Функция СформироватьМассивНоменклатурыКЗаказуСервере(МассивДанных)
	
	Если Не МассивДанных.Количество() > 0 Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст =	"ВЫБРАТЬ
	              	|	НоменклатураКЗаказу.Номенклатура КАК Номенклатура,
	              	|	НоменклатураКЗаказу.Характеристика КАК Характеристика,
	              	|	НоменклатураКЗаказу.Количество КАК Количество
	              	|ПОМЕСТИТЬ НоменклатураКЗаказу
	              	|ИЗ
	              	|	&НоменклатураКЗаказу КАК НоменклатураКЗаказу
	              	|;
	              	|
	              	|////////////////////////////////////////////////////////////////////////////////
	              	|ВЫБРАТЬ
	              	|	торо_ИнтеграцияДокументов.ДокументЕРП КАК ДокументЕРП
	              	|ПОМЕСТИТЬ втДокументыНаОсновании
	              	|ИЗ
	              	|	РегистрСведений.торо_ИнтеграцияДокументов КАК торо_ИнтеграцияДокументов
	              	|ГДЕ
	              	|	торо_ИнтеграцияДокументов.ID = &ID
	              	|	И ТИПЗНАЧЕНИЯ(торо_ИнтеграцияДокументов.ДокументТОИР) = ТИП(Документ.торо_ПланГрафикРемонта)
	              	|;
	              	|
	              	|////////////////////////////////////////////////////////////////////////////////
	              	|ВЫБРАТЬ
	              	|	ЗаказыНаВнутреннееПотребление.Номенклатура КАК Номенклатура,
	              	|	СУММА(ВЫБОР
	              	|			КОГДА ЗаказыНаВнутреннееПотребление.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	              	|				ТОГДА 1
	              	|			ИНАЧЕ -1
	              	|		КОНЕЦ * ЗаказыНаВнутреннееПотребление.КОформлению) КАК Количество,
	              	|	ЗаказыНаВнутреннееПотребление.Характеристика КАК Характеристика
	              	|ПОМЕСТИТЬ УжеЗаказаннаяНоменклатура
	              	|ИЗ
	              	|	РегистрНакопления.ЗаказыНаВнутреннееПотребление КАК ЗаказыНаВнутреннееПотребление
	              	|ГДЕ
	              	|	ЗаказыНаВнутреннееПотребление.Регистратор В
	              	|			(ВЫБРАТЬ
	              	|				втДокументыНаОсновании.ДокументЕРП КАК Регистратор
	              	|			ИЗ
	              	|				втДокументыНаОсновании КАК втДокументыНаОсновании)
	              	|
	              	|СГРУППИРОВАТЬ ПО
	              	|	ЗаказыНаВнутреннееПотребление.Номенклатура,
	              	|	ЗаказыНаВнутреннееПотребление.Характеристика
	              	|;
	              	|
	              	|////////////////////////////////////////////////////////////////////////////////
	              	|ВЫБРАТЬ
	              	|	НоменклатураКЗаказу.Номенклатура КАК Номенклатура,
	              	|	НоменклатураКЗаказу.Количество - ЕСТЬNULL(УжеЗаказаннаяНоменклатура.Количество, 0) КАК Количество,
	              	|	НоменклатураКЗаказу.Характеристика КАК Характеристика
	              	|ИЗ
	              	|	НоменклатураКЗаказу КАК НоменклатураКЗаказу
	              	|		ЛЕВОЕ СОЕДИНЕНИЕ УжеЗаказаннаяНоменклатура КАК УжеЗаказаннаяНоменклатура
	              	|		ПО НоменклатураКЗаказу.Номенклатура = УжеЗаказаннаяНоменклатура.Номенклатура
	              	|ГДЕ
	              	|	НоменклатураКЗаказу.Количество - ЕСТЬNULL(УжеЗаказаннаяНоменклатура.Количество, 0) > 0";
		
	Запрос.УстановитьПараметр("ID", МассивДанных[0].ID);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	НоменклатураКЗаказу = ПолучитьТаблицуНоменклатурыКЗаказу(МассивДанных);
		
	НоменклатураКЗаказу.Свернуть("Номенклатура, Характеристика", "Количество");
	Запрос.УстановитьПараметр("НоменклатураКЗаказу", НоменклатураКЗаказу);
	
	Товары = торо_ОбщегоНазначения.РезультатЗапросаВМассивСтруктур(Запрос.Выполнить());
	
	Если Товары.Количество() > 0 Тогда
		Возврат Товары;
	Иначе
		Возврат Неопределено;
	КонецЕсли; 
		
КонецФункции

&НаСервере
Функция ПолучитьТаблицуНоменклатурыКЗаказу(Ремонты)
	
	ТаблицаОРВР = Новый ТаблицаЗначений;
	Массив = Новый Массив;
	Массив.Добавить(Тип("СправочникСсылка.торо_ОбъектыРемонта"));
	ОписаниеТипов = Новый ОписаниеТипов(Массив);
	ТаблицаОРВР.Колонки.Добавить("ОбъектРемонтныхРабот",ОписаниеТипов);
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("СправочникСсылка.торо_ВидыРемонтов"));
	ОписаниеТипов = Новый ОписаниеТипов(Массив);
	ТаблицаОРВР.Колонки.Добавить("ВидРемонтныхРабот",ОписаниеТипов);
		
	Массив = Новый Массив;
	Массив.Добавить(Тип("Дата"));
	ОписаниеТипов = Новый ОписаниеТипов(Массив,,,,,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
	ТаблицаОРВР.Колонки.Добавить("ДатаНач",ОписаниеТипов);
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТипов = Новый ОписаниеТипов(Массив,,,,Новый КвалификаторыСтроки(36));
	ТаблицаОРВР.Колонки.Добавить("ID",ОписаниеТипов);
	
	Для каждого Строка Из Ремонты Цикл
		НС = ТаблицаОРВР.Добавить();
		ЗаполнитьЗначенияСвойств(НС,Строка);
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.Текст =	"ВЫБРАТЬ
	              	|	ВЫРАЗИТЬ(ТаблицаОРВР.ОбъектРемонтныхРабот КАК Справочник.торо_ОбъектыРемонта) КАК ОбъектРемонтныхРабот,
	              	|	ТаблицаОРВР.ВидРемонтныхРабот КАК ВидРемонта,
	              	|	ТаблицаОРВР.ДатаНач КАК ДатаРемонта,
	              	|	ТаблицаОРВР.ID КАК ИД
	              	|ПОМЕСТИТЬ ТаблицаОРВР
	              	|ИЗ
	              	|	&ТаблицаОРВР КАК ТаблицаОРВР
	              	|;
	              	|
	              	|////////////////////////////////////////////////////////////////////////////////
	              	|ВЫБРАТЬ
	              	|	ТаблицаОРВР.ОбъектРемонтныхРабот.ТиповойОР КАК ТиповойОР
	              	|ПОМЕСТИТЬ ТаблицаТиповыхОР
	              	|ИЗ
	              	|	ТаблицаОРВР КАК ТаблицаОРВР
	              	|;
	              	|
	              	|////////////////////////////////////////////////////////////////////////////////
	              	|ВЫБРАТЬ
	              	|	торо_РемонтныеЦиклыОборудования.ВидЦепочки КАК ВидЦепочки,
	              	|	торо_РемонтныеЦиклыОборудования.ГруппаОбъектовРемонтов КАК ГруппаОбъектовРемонтов
	              	|ПОМЕСТИТЬ ТаблицаЦепочек
	              	|ИЗ
	              	|	РегистрСведений.торо_РемонтныеЦиклыОборудования КАК торо_РемонтныеЦиклыОборудования
	              	|ГДЕ
	              	|	торо_РемонтныеЦиклыОборудования.ГруппаОбъектовРемонтов В
	              	|			(ВЫБРАТЬ
	              	|				ТаблицаОРВР.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот
	              	|			ИЗ
	              	|				ТаблицаОРВР КАК ТаблицаОРВР
	              	|		
	              	|			ОБЪЕДИНИТЬ
	              	|		
	              	|			ВЫБРАТЬ
	              	|				ТаблицаТиповыхОР.ТиповойОР
	              	|			ИЗ
	              	|				ТаблицаТиповыхОР КАК ТаблицаТиповыхОР)
	              	|;
	              	|
	              	|////////////////////////////////////////////////////////////////////////////////
	              	|ВЫБРАТЬ
	              	|	ТаблицаЦепочек.ВидЦепочки КАК ВидЦепочки,
	              	|	ТаблицаЦепочек.ГруппаОбъектовРемонтов КАК ГруппаОбъектовРемонтов,
	              	|	торо_ЦепочкиРемонтаПоследовательностьРемонтов.НормативныйРемонт КАК НормативныйРемонт,
	              	|	торо_ЦепочкиРемонтаПоследовательностьРемонтов.ВидРемонта КАК ВидРемонта
	              	|ПОМЕСТИТЬ ТабПоследовательностьРемонтов
	              	|ИЗ
	              	|	ТаблицаЦепочек КАК ТаблицаЦепочек
	              	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ЦепочкиРемонта.ПоследовательностьРемонтов КАК торо_ЦепочкиРемонтаПоследовательностьРемонтов
	              	|		ПО ТаблицаЦепочек.ВидЦепочки = торо_ЦепочкиРемонтаПоследовательностьРемонтов.Ссылка
	              	|;
	              	|
	              	|////////////////////////////////////////////////////////////////////////////////
	              	|ВЫБРАТЬ
	              	|	ТаблицаОРВР.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	              	|	ТаблицаОРВР.ВидРемонта КАК ВидРемонта,
	              	|	ВЫБОР
	              	|		КОГДА торо_НормативныеРемонтыОборудования.ТиповойОР = ЗНАЧЕНИЕ(Справочник.торо_ТиповыеОР.ПустаяСсылка)
	              	|			ТОГДА 1
	              	|		ИНАЧЕ 0
	              	|	КОНЕЦ КАК Приоритет,
	              	|	торо_НормативныеРемонтыОборудования.НормативныйРемонт КАК НормативныйРемонт,
	              	|	ТаблицаОРВР.ДатаРемонта КАК ДатаРемонта,
	              	|	ТаблицаОРВР.ИД КАК ИД
	              	|ПОМЕСТИТЬ ТаблицаНормативов
	              	|ИЗ
	              	|	ТаблицаОРВР КАК ТаблицаОРВР
	              	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_НормативныеРемонтыОборудования КАК торо_НормативныеРемонтыОборудования
	              	|		ПО (ВЫБОР
	              	|				КОГДА торо_НормативныеРемонтыОборудования.ТиповойОР = ЗНАЧЕНИЕ(Справочник.торо_ТиповыеОР.ПустаяСсылка)
	              	|					ТОГДА ТаблицаОРВР.ОбъектРемонтныхРабот = торо_НормативныеРемонтыОборудования.ОбъектРемонта
	              	|				ИНАЧЕ ТаблицаОРВР.ОбъектРемонтныхРабот.ТиповойОР = торо_НормативныеРемонтыОборудования.ТиповойОР
	              	|						И ТаблицаОРВР.ОбъектРемонтныхРабот = торо_НормативныеРемонтыОборудования.ОбъектРемонта
	              	|			КОНЕЦ)
	              	|			И ТаблицаОРВР.ВидРемонта = торо_НормативныеРемонтыОборудования.ВидРемонта
	              	|;
	              	|
	              	|////////////////////////////////////////////////////////////////////////////////
	              	|ВЫБРАТЬ
	              	|	ТаблицаНормативов.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	              	|	ТаблицаНормативов.ВидРемонта КАК ВидРемонта,
	              	|	МАКСИМУМ(ТаблицаНормативов.Приоритет) КАК Приоритет,
	              	|	ТаблицаНормативов.ДатаРемонта КАК ДатаРемонта,
	              	|	ТаблицаНормативов.ИД КАК ИД
	              	|ПОМЕСТИТЬ втТабМаксимальныхПриоритетов
	              	|ИЗ
	              	|	ТаблицаНормативов КАК ТаблицаНормативов
	              	|
	              	|СГРУППИРОВАТЬ ПО
	              	|	ТаблицаНормативов.ВидРемонта,
	              	|	ТаблицаНормативов.ОбъектРемонтныхРабот,
	              	|	ТаблицаНормативов.ДатаРемонта,
	              	|	ТаблицаНормативов.ИД
	              	|;
	              	|
	              	|////////////////////////////////////////////////////////////////////////////////
	              	|ВЫБРАТЬ
	              	|	ТаблицаНормативов.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	              	|	ТаблицаНормативов.ВидРемонта КАК ВидРемонта,
	              	|	ТаблицаНормативов.НормативныйРемонт КАК ТехКарта,
	              	|	ТаблицаНормативов.ДатаРемонта КАК ДатаРемонта,
	              	|	ТаблицаНормативов.ИД КАК ИД
	              	|ИЗ
	              	|	ТаблицаНормативов КАК ТаблицаНормативов
	              	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТабМаксимальныхПриоритетов КАК втТабМаксимальныхПриоритетов
	              	|		ПО ТаблицаНормативов.ОбъектРемонтныхРабот = втТабМаксимальныхПриоритетов.ОбъектРемонтныхРабот
	              	|			И ТаблицаНормативов.ВидРемонта = втТабМаксимальныхПриоритетов.ВидРемонта
	              	|			И ТаблицаНормативов.Приоритет = втТабМаксимальныхПриоритетов.Приоритет
	              	|
	              	|ОБЪЕДИНИТЬ ВСЕ
	              	|
	              	|ВЫБРАТЬ
	              	|	ТаблицаОРВР.ОбъектРемонтныхРабот,
	              	|	ТаблицаОРВР.ВидРемонта,
	              	|	ТабПоследовательностьРемонтов.НормативныйРемонт,
	              	|	ТаблицаОРВР.ДатаРемонта,
	              	|	ТаблицаОРВР.ИД
	              	|ИЗ
	              	|	ТаблицаОРВР КАК ТаблицаОРВР
	              	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабПоследовательностьРемонтов КАК ТабПоследовательностьРемонтов
	              	|		ПО ТаблицаОРВР.ВидРемонта = ТабПоследовательностьРемонтов.ВидРемонта";
				   
	Запрос.УстановитьПараметр("ТаблицаОРВР",ТаблицаОРВР);
	
	ТЗНоменклатура = Новый ТаблицаЗначений;
	
	ТЗНоменклатура.Колонки.Добавить("ОбъектРемонтныхРабот");
	ТЗНоменклатура.Колонки.Добавить("ВидРемонта");
	ТЗНоменклатура.Колонки.Добавить("ДатаРемонта");
	ТЗНоменклатура.Колонки.Добавить("ИД");
	ТЗНоменклатура.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТЗНоменклатура.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЗНоменклатура.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьТЗНоменклатурой(ТЗНоменклатура, Выборка, Выборка.ТехКарта);	
	КонецЦикла; 
	
	Возврат ТЗНоменклатура;

КонецФункции

&НаСервере
Процедура ЗаполнитьТЗНоменклатурой(ТЗ, Выборка, ТехКарта, УчитыватьЗапчастиОР = Истина)
	
	Запрос = Новый Запрос;

	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_ТехКарты_СписокОпераций.Операция КАК Операция,
	               |	торо_ТехКарты_СписокОпераций.ID КАК ID,
	               |	торо_ТехКарты_СписокОпераций.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ СписокОпераций
	               |ИЗ
	               |	РегистрСведений.торо_ВерсииТехКарт.СрезПоследних(&ДатаРемонта, ИдентификаторТехКарты = &ТехКарта) КАК торо_ВерсииТехКартСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТехКарты.СписокОпераций КАК торо_ТехКарты_СписокОпераций
	               |		ПО торо_ВерсииТехКартСрезПоследних.ТехКарта = торо_ТехКарты_СписокОпераций.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	торо_РемонтыМатериальныеЗатраты.Номенклатура КАК Номенклатура,
	               |	торо_РемонтыМатериальныеЗатраты.Упаковка КАК Упаковка,
	               |	торо_РемонтыМатериальныеЗатраты.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	торо_РемонтыМатериальныеЗатраты.КоличествоУпаковок КАК КоличествоУпаковок,
	               |	торо_РемонтыМатериальныеЗатраты.ID КАК ID,
	               |	торо_РемонтыМатериальныеЗатраты.Характеристика КАК Характеристика
	               |ПОМЕСТИТЬ СписокМатериалов
	               |ИЗ
	               |	Справочник.торо_ТехКарты.МатериальныеЗатраты КАК торо_РемонтыМатериальныеЗатраты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокОпераций КАК СписокОпераций
	               |		ПО торо_РемонтыМатериальныеЗатраты.Ссылка = СписокОпераций.Ссылка
	               |			И торо_РемонтыМатериальныеЗатраты.ID = СписокОпераций.ID
	               |ГДЕ
	               |	торо_РемонтыМатериальныеЗатраты.Номенклатура.ВидНоменклатуры.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
				   |    И торо_РемонтыМатериальныеЗатраты.Номенклатура.ВидНоменклатуры.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) 
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СписокОпераций.Операция КАК Операция,
	               |	СписокМатериалов.Номенклатура КАК Номенклатура,
	               |	ВЫБОР
	               |		КОГДА СписокМатериалов.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	               |			ТОГДА 1
	               |		ИНАЧЕ СписокМатериалов.Упаковка.Коэффициент
	               |	КОНЕЦ * СписокМатериалов.КоличествоУпаковок КАК Количество,
	               |	СписокМатериалов.Характеристика КАК Характеристика
	               |ИЗ
	               |	СписокОпераций КАК СписокОпераций
	               |		ЛЕВОЕ СОЕДИНЕНИЕ СписокМатериалов КАК СписокМатериалов
	               |		ПО (СписокМатериалов.ID = СписокОпераций.ID)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	торо_НормыЗапчастейНаОбъектыРемонта.ВидРемонта,
	               |	торо_НормыЗапчастейНаОбъектыРемонта.Номенклатура,
	               |	торо_НормыЗапчастейНаОбъектыРемонта.Количество,
	               |	торо_НормыЗапчастейНаОбъектыРемонта.Характеристика
	               |ИЗ
	               |	РегистрСведений.торо_НормыЗапчастейНаОбъектыРемонта КАК торо_НормыЗапчастейНаОбъектыРемонта
	               |ГДЕ
	               |	торо_НормыЗапчастейНаОбъектыРемонта.ВидРемонта = &ВидРемонта
	               |	И торо_НормыЗапчастейНаОбъектыРемонта.ОбъектРемонта = &ОбъектРемонта
	               |	И торо_НормыЗапчастейНаОбъектыРемонта.Приоритет = ИСТИНА
	               |	И &УчитыватьЗапчастиОР
				   |	И торо_НормыЗапчастейНаОбъектыРемонта.Номенклатура.ВидНоменклатуры.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
				   |    И торо_НормыЗапчастейНаОбъектыРемонта.Номенклатура.ВидНоменклатуры.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)";

	Запрос.УстановитьПараметр("ДатаРемонта", Выборка.ДатаРемонта);
	Запрос.УстановитьПараметр("ОбъектРемонта", Выборка.ОбъектРемонтныхРабот);
	Запрос.УстановитьПараметр("ВидРемонта", Выборка.ВидРемонта);
	Запрос.УстановитьПараметр("ТехКарта", ТехКарта);
	Запрос.УстановитьПараметр("УчитыватьЗапчастиОР", УчитыватьЗапчастиОР);

	Результат = Запрос.Выполнить();
	Таблица = Запрос.Выполнить().Выгрузить();

	Для каждого Строка Из Таблица Цикл
		
		Если ТипЗнч(Строка.Операция) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда

			ЗаполнитьТЗНоменклатурой(ТЗ,Выборка,Строка.Операция, Ложь);
			
		ИначеЕсли ЗначениеЗаполнено(Строка.Номенклатура) И ЗначениеЗаполнено(Строка.Количество) Тогда	
			
			НС = ТЗ.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Выборка);
			ЗаполнитьЗначенияСвойств(НС, Строка);
			
		КонецЕсли;
	
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте 
Процедура ДобавитьИзменитьЗаписиВРегистреТоро_ИнтеграцияДокументов(Результат, ДополнительныеПараметры) Экспорт
	ДобавитьИзменитьЗаписиВРегистреТоро_ИнтеграцияДокументовСервер(Результат, ДополнительныеПараметры);	
КонецПроцедуры

&НаСервере 
Процедура ДобавитьИзменитьЗаписиВРегистреТоро_ИнтеграцияДокументовСервер(Результат, ДополнительныеПараметры) 
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	торо_ИнтеграцияДокументов.ДокументЕРП
		               |ИЗ
		               |	РегистрСведений.торо_ИнтеграцияДокументов КАК торо_ИнтеграцияДокументов
		               |ГДЕ
		               |	торо_ИнтеграцияДокументов.ID = &ID
		               |	И торо_ИнтеграцияДокументов.ДокументТОИР = &Ссылка
					   |	И торо_ИнтеграцияДокументов.ДокументЕРП  = &СсылкаНаДокЕРП";
					   
		Запрос.УстановитьПараметр("ID",ДополнительныеПараметры.ТекущийРемонт_ID);
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		Запрос.УстановитьПараметр("СсылкаНаДокЕРП", ДополнительныеПараметры.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			ДобавитьЗаписьВРегистрТоро_ИнтеграцияДокументовНаСервере(ДополнительныеПараметры.ТекущийРемонт_ID, Объект.Ссылка, ДополнительныеПараметры.Ссылка);
		КонецЕсли; 
		
	КонецЕсли; 	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗаписьВРегистрТоро_ИнтеграцияДокументовНаСервере(ID, ДокументТОИР, ДокументЕРП)
	
	Если Не ДокументЕРП = Документы.ЗаказНаВнутреннееПотребление.ПустаяСсылка() Тогда
		Запись = РегистрыСведений.торо_ИнтеграцияДокументов.СоздатьМенеджерЗаписи();
		Запись.ID           = ID;
		Запись.ДокументТОИР = ДокументТОИР;
		Запись.ДокументЕРП  = ДокументЕРП;
		Запись.Записать();
		ОбновитьДокументыЗаказНаВнПотреблениеСервер();
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДокументыЗаказНаВнПотребление(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	 ОбновитьДокументыЗаказНаВнПотреблениеСервер(Результат, ДополнительныеПараметры);
КонецПроцедуры

&НаСервере
Процедура ОбновитьДокументыЗаказНаВнПотреблениеСервер(Результат = Неопределено, ДополнительныеПараметры = Неопределено) 
	
	ДокументыЗаказНаВнПотребление.Очистить();
	
	СписокID = Объект.ПланРемонтов.Выгрузить(,"ID");
	Запрос  = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	торо_ИнтеграцияДокументов.ДокументЕРП КАК ЗаказНаВнутреннееПотребление,
	               |	ВЫБОР
	               |		КОГДА торо_ИнтеграцияДокументов.ДокументТОИР = &ЭтотДокумент
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ЗаказИзЭтогоДокумента,
	               |	ВЫБОР
	               |		КОГДА торо_ИнтеграцияДокументов.ДокументЕРП.Проведен
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ИндексКартинки,
	               |	торо_ИнтеграцияДокументов.ID
	               |ИЗ
	               |	РегистрСведений.торо_ИнтеграцияДокументов КАК торо_ИнтеграцияДокументов
	               |ГДЕ
	               |	торо_ИнтеграцияДокументов.ID В(&СписокID)
	               |	И НЕ торо_ИнтеграцияДокументов.ДокументЕРП.ПометкаУдаления
	               |	И ТИПЗНАЧЕНИЯ(торо_ИнтеграцияДокументов.ДокументЕРП) = ТИП(Документ.ЗаказНаВнутреннееПотребление)";

	Запрос.УстановитьПараметр("СписокID",СписокID);
	Запрос.УстановитьПараметр("ЭтотДокумент", Объект.Ссылка);
				   
	ДокументыЗаказНаВнПотребление.Загрузить(Запрос.Выполнить().Выгрузить());
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораДействияПользователяПередУдалениемВнЗаказа(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаказПомечен = ПометитьЗаказНаСервере(ДополнительныеПараметры);
		Если ТипЗнч(ЗаказПомечен) <> Тип("Булево") Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(ЗаказПомечен);
		КонецЕсли; 
	КонецЕсли; 	
КонецПроцедуры
 
&НаСервере
Функция ПометитьЗаказНаСервере(СтруктураПараметров)
	
	Попытка
		
		ОбъектЗаказ = СтруктураПараметров.ЗаказСсылка.ПолучитьОбъект();
		
		Если ОбъектЗаказ.Проведен Тогда
			ОбъектЗаказ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонецЕсли;
		
		ОбъектЗаказ.ПометкаУдаления = Истина;
		ОбъектЗаказ.Записать();
		
		МенеджерЗаписи = РегистрыСведений.торо_ИнтеграцияДокументов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ID = СтруктураПараметров.ID;
		МенеджерЗаписи.ДокументЕРП  = СтруктураПараметров.ЗаказСсылка;
		МенеджерЗаписи.ДокументТОИР = Объект.Ссылка;
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Удалить();
		КонецЕсли; 
		
		ОбновитьДокументыЗаказНаВнПотреблениеСервер();
		
	Исключение
	    
		Возврат ОписаниеОшибки();
		
	КонецПопытки; 
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ДокументОснованиеПриИзмененииНаСервере()
	
	Объект.ПланРемонтов.Очистить();
	Объект.ОбъектыРемонта.Очистить();
	
	Основание = Объект.ДокументОснование;	
	
	Если ЗначениеЗаполнено(Основание) тогда
		Объект.Подразделение = Основание.Подразделение;
		Объект.Организация = Основание.Организация;
	Иначе
		Объект.Организация = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			"НастройкиТОиР",
			"ОсновнаяОрганизация",
			Истина);
			
		Объект.Подразделение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			"НастройкиТОиР",
			"ОсновноеПодразделение",
			Истина);
	КонецЕсли;
	
	Если Основание.ВидОперации = Перечисления.торо_ВидыОперацийПланаГрафикаППР.Корректировка Тогда
		Объект.ДатаПланирования = Основание.ДатаПланирования;
		Объект.КоличествоПериодов = 1;
		Объект.ПериодичностьДетализации = Перечисления.Периодичность.Месяц;
	Иначе
		Объект.ДатаПланирования = Основание.ДатаПланирования;
		Объект.КоличествоПериодов = Основание.КоличествоПериодов;
		Объект.ПериодичностьДетализации = Основание.ПериодичностьДетализации;
	КонецЕсли;
	
	ЗагрузитьОбъектыВидыРемонтовИзДокументаОснования();
	
	ЗагрузитьРемонтыИзДокументаОснования(Истина);
	ОбновитьДоступностьДляРедактирования();
	
	мРабочаяДата = ТекущаяДата();
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		// Заполнить реквизиты значениями по умолчанию.
		Если НЕ ЗначениеЗаполнено(Объект.Ответственный) Тогда
			Объект.Ответственный = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			"НастройкиТОиР",
			"ОсновнойОтветственный",
			Справочники.Пользователи.ПустаяСсылка());
		КонецЕсли;	
	КонецЕсли; 	
	
	ЗаполнитьДеревоПланаГрафикаППРСУчетомПозиции();	
	
	ФОИспользоватьОстановочные	= ПолучитьФункциональнуюОпцию("торо_ИспользоватьОстановочныеРемонты");
	Если ФОИспользоватьОстановочные Тогда
		ОбновитьОстановочные();
	КонецЕсли;
	
	ОбновитьДокументыЗаказНаВнПотреблениеСервер();
	
КонецПроцедуры	

&НаКлиенте
Функция НайтиТочку(Искомое, Точки, МассивТочек)
	
	Для каждого текТочка из Точки Цикл
		Если текТочка.Расшифровка = Искомое Тогда
			МассивТочек.Добавить(текТочка);
			Возврат ТекТочка;
		Иначе
			Результат = НайтиТочку(Искомое, ТекТочка.Точки, МассивТочек);
			Если Результат <> Неопределено Тогда
				МассивТочек.Добавить(текТочка);
				возврат Результат
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Функция НайтиНужнуюТочкуДиаграммыГанта(ОР, ВР)
	
	ТочкаОР = Неопределено;
	ТочкаВР = Неопределено;
	МассивТочек = Новый Массив;
	
	ТочкаОР = НайтиТочку(ОР, ДиаграммаГантаППР.Точки, массивТочек);
	
	Если ТочкаОР = Неопределено тогда
		Возврат Новый Массив;
	Иначе 
		ТочкаВР = НайтиТочку(ВР, ТочкаОР.Точки, массивТочек);
	КонецЕсли;
	
	Если ТочкаВР = Неопределено Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Возврат массивТочек;
	
КонецФункции

&НаСервереБезКонтекста
Функция ВыполнитьСортировкуТЧПланРемонтов(параметрОбъект)
	
	ДокОбъект = ДанныеФормыВЗначение(параметрОбъект, Тип("ДокументОбъект.торо_ПланГрафикРемонта"));
	
	ДокОбъект.ПланРемонтов.Сортировать("ДатаНач возр");
	
	ЗначениеВДанныеФормы(ДокОбъект, параметрОбъект);
	
	Возврат параметрОбъект;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьМассивВРЦепочкиНаСервере(Цепочка)
	
	МассивВР = Новый Массив;
	
	Для каждого Элем Из Цепочка.ПоследовательностьРемонтов Цикл
		
		МассивВР.Добавить(Элем.ВидРемонта);
		
	КонецЦикла;
	
	Возврат МассивВР;
	
КонецФункции

&НаСервере 
Процедура УбратьУО()
	масУдаления = Новый Массив;
	Для каждого текЭлем из УсловноеОформление.Элементы цикл
		Если текЭлем.ИдентификаторПользовательскойНастройки = "ВидимостьДляТЧПланРемонтов" Тогда
			масУдаления.Добавить(текЭлем);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого текЭлем из масУдаления Цикл
		УсловноеОформление.Элементы.Удалить(текЭлем);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере 
Процедура УстановитьУО(Цепочка)
	
	УбратьУО();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_ЦепочкиРемонтаПоследовательностьРемонтов.ВидРемонта
	               |ИЗ
	               |	Справочник.торо_ЦепочкиРемонта.ПоследовательностьРемонтов КАК торо_ЦепочкиРемонтаПоследовательностьРемонтов
	               |ГДЕ
	               |	торо_ЦепочкиРемонтаПоследовательностьРемонтов.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Цепочка);
	
	резЗапроса = Запрос.Выполнить();
	сзВидовРемонтов = Новый СписокЗначений;
	Если НЕ резЗапроса.Пустой() Тогда
		Выборка = резЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			сзВидовРемонтов.Добавить(Выборка.ВидРемонта);
		КонецЦикла;
	КонецЕсли;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.ИдентификаторПользовательскойНастройки = "ВидимостьДляТЧПланРемонтов";
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ПланРемонтов.ВидРемонтныхРабот"); 
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
	ЭлементУсловия.ПравоеЗначение = сзВидовРемонтов;

	Для Каждого Колонка Из Элементы.ПланРемонтов.ПодчиненныеЭлементы Цикл
		ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();    
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Колонка.Имя);
	КонецЦикла;

	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();    
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ПланРемонтовДатаКон");
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();    
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ПланРемонтовДатаНач");	
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();    
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ПланРемонтовДатаКонСт");	
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();    
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ПланРемонтовДатаНачСт");	
КонецПроцедуры

&НаСервере
Функция ПолучитьВыделенныеПланыРемонтов()
	
	ВыделенныеСтроки = Новый Массив;
	
	Для Каждого СтрокаТЧ Из Элементы.ПланРемонтов.ВыделенныеСтроки Цикл
		
		ТекущиеДанныеСтроки = Объект.ПланРемонтов.НайтиПоИдентификатору(СтрокаТЧ);
		
		Если ТекущиеДанныеСтроки.Отменен Или ТекущиеДанныеСтроки.Замещен Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаРемонтовОборудования = Новый Структура("ID, ВидРемонтныхРабот, ДатаНачала, ДатаОкончания, ОбъектРемонта",
			ТекущиеДанныеСтроки.ID, ТекущиеДанныеСтроки.ВидРемонтныхРабот, ТекущиеДанныеСтроки.ДатаНач, ТекущиеДанныеСтроки.ДатаКон, ТекущиеДанныеСтроки.ОбъектРемонтныхРабот);
		
		ДанныеСтроки = Новый Структура("СтрокаРемонтовОборудования, МассивСтрокРемонтныхРабот",
			СтрокаРемонтовОборудования, ПолучитьМассивСтрокРемонтныхРабот(ТекущиеДанныеСтроки));
		
		ВыделенныеСтроки.Добавить(ДанныеСтроки);
		
	КонецЦикла;
	
	Возврат ВыделенныеСтроки;
	
КонецФункции

&НаСервере
Функция ПолучитьМассивСтрокРемонтныхРабот(ТекущиеДанныеСтроки)
	
	МассивСтрокРемонтныхРабот = Новый Массив;
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТаблицаРемонтовОборудования.ОбъектРемонта,
	|	ТаблицаРемонтовОборудования.ВидРемонтныхРабот
	|ПОМЕСТИТЬ ТаблицаРемонтовОборудования
	|ИЗ
	|	&ТаблицаРемонтовОборудования КАК ТаблицаРемонтовОборудования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_НормативныеРемонтыОборудования.НормативныйРемонт,
	|	торо_НормативныеРемонтыОборудования.СпособПланирования,
	|	торо_НормативныеРемонтыОборудования.ГрафикРемонтныхРабот,
	|	торо_НормативныеРемонтыОборудования.СпособВыполнения,
	|	торо_НормативныеРемонтыОборудования.НеИспользоватьВПланированииДатуВводаВЭксплуатацию,
	|	торо_НормативныеРемонтыОборудования.СпособУчетаДатыОтсчета,
	|	торо_НормативныеРемонтыОборудования.ВидРемонта,
	|	торо_НормативныеРемонтыОборудования.ОбъектРемонта,
	|	ТаблицаРемонтовОборудования.ОбъектРемонта,
	|	ТаблицаРемонтовОборудования.ВидРемонтныхРабот
	|ИЗ
	|	ТаблицаРемонтовОборудования КАК ТаблицаРемонтовОборудования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_НормативныеРемонтыОборудования КАК торо_НормативныеРемонтыОборудования
	|		ПО ТаблицаРемонтовОборудования.ОбъектРемонта = торо_НормативныеРемонтыОборудования.ОбъектРемонта
	|			И ТаблицаРемонтовОборудования.ВидРемонтныхРабот = торо_НормативныеРемонтыОборудования.ВидРемонта
	|ГДЕ
	|	торо_НормативныеРемонтыОборудования.Приоритет
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_РегламентныеМероприятияИСпискиОбъектов.НормативныйРемонт,
	|	торо_РегламентныеМероприятияИСпискиОбъектов.СпособПланирования,
	|	торо_РегламентныеМероприятияИСпискиОбъектов.ГрафикРемонтныхРабот,
	|	торо_РегламентныеМероприятияИСпискиОбъектов.СпособВыполнения,
	|	ЛОЖЬ КАК НеИспользоватьВПланированииДатуВводаВЭксплуатацию,
	|	торо_РегламентныеМероприятияИСпискиОбъектов.СпособУчетаДатыОтсчета,
	|	торо_РегламентныеМероприятияИСпискиОбъектов.ВидМероприятия КАК ВидРемонта,
	|	торо_РегламентныеМероприятияИСпискиОбъектов.СписокОбъектов КАК ГруппаОбьектовРемонтов,
	|	ТаблицаРемонтовОборудования.ОбъектРемонта,
	|	ТаблицаРемонтовОборудования.ВидРемонтныхРабот
	|ИЗ ТаблицаРемонтовОборудования КАК ТаблицаРемонтовОборудования
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_РегламентныеМероприятияИСпискиОбъектов КАК торо_РегламентныеМероприятияИСпискиОбъектов
	|		ПО ТаблицаРемонтовОборудования.ОбъектРемонта = торо_РегламентныеМероприятияИСпискиОбъектов.СписокОбъектов
	|			И ТаблицаРемонтовОборудования.ВидРемонтныхРабот = торо_РегламентныеМероприятияИСпискиОбъектов.ВидМероприятия
	|";
	
	ТаблицаРемонтовОборудования = Новый ТаблицаЗначений;
	ТаблицаРемонтовОборудования.Колонки.Добавить("ОбъектРемонта", Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта"));
	ТаблицаРемонтовОборудования.Колонки.Добавить("ВидРемонтныхРабот", Новый ОписаниеТипов("СправочникСсылка.торо_ВидыРемонтов"));
	
	НоваяСтрока = ТаблицаРемонтовОборудования.Добавить();
	НоваяСтрока.ОбъектРемонта = ТекущиеДанныеСтроки.ОбъектРемонтныхРабот;
	НоваяСтрока.ВидРемонтныхРабот = ТекущиеДанныеСтроки.ВидРемонтныхРабот;
	
	Запрос.УстановитьПараметр("ТаблицаРемонтовОборудования", ТаблицаРемонтовОборудования);
	
	ТаблицаДанныхНормативов = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаДанныхНормативов.Количество() > 0 Тогда
		
		ТехКартаРемонта = ТаблицаДанныхНормативов[0].НормативныйРемонт;
		ВерсияТехКарты = РегистрыСведений.торо_ВерсииТехКарт.ПолучитьВерсиюТехКарты(ТехКартаРемонта, ТекущиеДанныеСтроки.ДатаНач);
		
		Если ЗначениеЗаполнено(ВерсияТехКарты) Тогда			
			
			НовСтрокаРемонтныхРабот = Новый Структура("РемонтнаяРабота, Количество, Родитель_ID, РемонтыОборудования_ID, ID, ТехКартаРемонта");
			НовСтрокаРемонтныхРабот.РемонтнаяРабота = ТехКартаРемонта;
			НовСтрокаРемонтныхРабот.Количество = 0;
			НовСтрокаРемонтныхРабот.Родитель_ID = "";
			НовСтрокаРемонтныхРабот.РемонтыОборудования_ID = ТекущиеДанныеСтроки.ID;
			НовСтрокаРемонтныхРабот.ID = Новый УникальныйИдентификатор();
			НовСтрокаРемонтныхРабот.ТехКартаРемонта = Неопределено;
			
			МассивСтрокРемонтныхРабот.Добавить(НовСтрокаРемонтныхРабот);
			
			ДобавитьСтрокуРемонтныхРабот(НовСтрокаРемонтныхРабот,
				ТекущиеДанныеСтроки.ДатаНач,
				МассивСтрокРемонтныхРабот,
				ВерсияТехКарты,
				НовСтрокаРемонтныхРабот.ID);
			
		КонецЕсли;
		
	КонецЕсли;
		
	Возврат МассивСтрокРемонтныхРабот;
	
КонецФункции

Процедура ДобавитьСтрокуРемонтныхРабот(СтрокаРемонтныхРабот, ДатаНачала, МассивСтрокРемонтныхРабот, ТехКартаРемонта, Родитель_ID)
	
	Для Каждого СтрокаОперации Из ТехКартаРемонта.СписокОпераций Цикл
		
		Если НаличиеОперацииВМассиве(СтрокаОперации.Операция, МассивСтрокРемонтныхРабот, Родитель_ID) Тогда
			Продолжить;
		КонецЕсли;
		
		НовСтрокаРемонтныхРабот = Новый Структура("РемонтнаяРабота, Количество, Родитель_ID, РемонтыОборудования_ID, ID, ТехКартаРемонта");
		НовСтрокаРемонтныхРабот.РемонтнаяРабота = СтрокаОперации.Операция;
		НовСтрокаРемонтныхРабот.Количество = 0;
		НовСтрокаРемонтныхРабот.Родитель_ID = Родитель_ID;
		НовСтрокаРемонтныхРабот.РемонтыОборудования_ID = СтрокаРемонтныхРабот.РемонтыОборудования_ID;
		НовСтрокаРемонтныхРабот.ID = СтрокаОперации.ID;
		НовСтрокаРемонтныхРабот.ТехКартаРемонта = Неопределено;
		
		Если ЗначениеЗаполнено(ТехКартаРемонта) Тогда
			Попытка
				НовСтрокаРемонтныхРабот.ТехКартаРемонта = ТехКартаРемонта;
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		МассивСтрокРемонтныхРабот.Добавить(НовСтрокаРемонтныхРабот);
		
		Если ТипЗнч(СтрокаОперации.Операция) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда
			
			ТехКарта = РегистрыСведений.торо_ВерсииТехКарт.ПолучитьВерсиюТехКарты(СтрокаОперации.Операция, ДатаНачала);
			
			Если ЗначениеЗаполнено(ТехКарта) Тогда
				
				ДобавитьСтрокуРемонтныхРабот(СтрокаРемонтныхРабот,
				ДатаНачала,
				МассивСтрокРемонтныхРабот,
				ТехКарта,
				НовСтрокаРемонтныхРабот.ID); 
				
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

Функция НаличиеОперацииВМассиве(Операция, МассивСтрокРемонтныхРабот, Родитель_ID)
	
	Для Каждого РемРаб Из МассивСтрокРемонтныхРабот Цикл
		Если РемРаб.Родитель_ID = Родитель_ID И Операция = РемРаб.РемонтнаяРабота Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЕстьЛимитыНаПериод(ДатаНачалаЛимита, ДатаОкончанияЛимита)
	
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ГодовыеЛимитыРемонтныхРаботСрезПоследних.Регистратор
	|ИЗ
	|	РегистрСведений.торо_ГодовыеЛимитыРемонтныхРабот.СрезПоследних(
	|			,
	|			ГОД(Период) >= &ГодНач
	|				И ГОД(Период) <= &ГодКон) КАК торо_ГодовыеЛимитыРемонтныхРаботСрезПоследних";
	
	Запрос.УстановитьПараметр("ГодНач", ДатаНачалаЛимита);
	Запрос.УстановитьПараметр("ГодКон", ДатаОкончанияЛимита);
	
	Результат = Запрос.Выполнить();
	Возврат НЕ Результат.Пустой();
	
КонецФункции

&НаСервереБезКонтекста
Функция ЕстьЛимитыНаОрганизацию(ДатаНачалаЛимита, ДатаОкончанияЛимита, СписокОбъектовРемонта)
	
	Запрос = Новый Запрос;
	// Запрос.Текст = 
	// "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	// |	торо_ОбъектыРемонта.Направление КАК Направление,
	// |	торо_ОбъектыРемонта.Организация КАК Организация
	// |ПОМЕСТИТЬ ВТ_НаправленияИОрганизацииОР
	// |ИЗ
	// |	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	// |ГДЕ
	// |	торо_ОбъектыРемонта.Ссылка В(&СписокОбъектовРемонта)
	// |;
	// |
	// |////////////////////////////////////////////////////////////////////////////////
	// |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	// |	торо_ГодовыеЛимитыРемонтныхРаботСрезПоследних.Регистратор КАК Регистратор
	// |ИЗ
	// |	РегистрСведений.торо_ГодовыеЛимитыРемонтныхРабот.СрезПоследних(
	// |			,
	// |			ГОД(Период) >= &ГодНач
	// |				И ГОД(Период) <= &ГодКон
	// |				И (Организация В
	// |						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	// |							ВТ_НаправленияИОрганизацииОР.Организация
	// |						ИЗ
	// |							ВТ_НаправленияИОрганизацииОР КАК ВТ_НаправленияИОрганизацииОР)
	// |					ИЛИ Направление В
	// |						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	// |							ВТ_НаправленияИОрганизацииОР.Направление
	// |						ИЗ
	// |							ВТ_НаправленияИОрганизацииОР КАК ВТ_НаправленияИОрганизацииОР)
	// |					ИЛИ Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	// |					ИЛИ Направление = ЗНАЧЕНИЕ(Справочник.торо_НаправленияОбъектовРемонтныхРабот.ПустаяСсылка))) КАК торо_ГодовыеЛимитыРемонтныхРаботСрезПоследних";
	   
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ОбъектыРемонта.Направление КАК Направление,
	|	торо_ОбъектыРемонта.Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_НаправленияИОрганизацииОР
	|ИЗ
	|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	|ГДЕ
	|	торо_ОбъектыРемонта.Ссылка В(&СписокОбъектовРемонта)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ГодовыеЛимитыРемонтныхРаботСрезПоследних.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрСведений.торо_ГодовыеЛимитыРемонтныхРабот.СрезПоследних(
	|			,
	|			ГОД(Период) >= &ГодНач
	|				И ГОД(Период) <= &ГодКон
	|				И (((Организация, Направление) В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							ВТ_НаправленияИОрганизацииОР.Организация,
	|							ВТ_НаправленияИОрганизацииОР.Направление
	|						ИЗ
	|							ВТ_НаправленияИОрганизацииОР КАК ВТ_НаправленияИОрганизацииОР))
	|					ИЛИ (Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|						И Направление В
	|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|								ВТ_НаправленияИОрганизацииОР.Направление
	|							ИЗ
	|								ВТ_НаправленияИОрганизацииОР КАК ВТ_НаправленияИОрганизацииОР))
	|					ИЛИ (Направление = ЗНАЧЕНИЕ(Справочник.торо_НаправленияОбъектовРемонтныхРабот.ПустаяСсылка)
	|						И Организация В
	|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|								ВТ_НаправленияИОрганизацииОР.Организация
	|							ИЗ
	|								ВТ_НаправленияИОрганизацииОР КАК ВТ_НаправленияИОрганизацииОР))
	|					ИЛИ (Направление = ЗНАЧЕНИЕ(Справочник.торо_НаправленияОбъектовРемонтныхРабот.ПустаяСсылка)
	|						И Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)))) КАК торо_ГодовыеЛимитыРемонтныхРаботСрезПоследних";	
	
	Запрос.УстановитьПараметр("ГодНач", ДатаНачалаЛимита);
	Запрос.УстановитьПараметр("ГодКон", ДатаОкончанияЛимита);
	Запрос.УстановитьПараметр("СписокОбъектовРемонта", СписокОбъектовРемонта);
	
	Результат = Запрос.Выполнить();
	Возврат НЕ Результат.Пустой();
	
КонецФункции


&НаКлиенте
Процедура ДеревоППРСвернутьВсе(Команда)
	
	ЭлементыДереваПоложения = ДеревоПланаГрафикаППРСУчетомПозиции.ПолучитьЭлементы();
	Для Каждого СтрокаПоложение Из ЭлементыДереваПоложения Цикл
		ЭлементыДереваОбъектыРемонта = СтрокаПоложение.ПолучитьЭлементы();
		Для Каждого СтрокаОР Из ЭлементыДереваОбъектыРемонта Цикл
			Элементы.ДеревоПланаГрафикаППРСУчетомПозиции.Свернуть(СтрокаОР.ПолучитьИдентификатор());
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоППРРазвернутьВсе(Команда)
	
	СтандартныеПодсистемыКлиент.РазвернутьУзлыДерева(ЭтаФорма, "ДеревоПланаГрафикаППРСУчетомПозиции",,Истина);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ДобавитьСтрокуПоложенияВДерево(СтрокиДерева, ПоложениеОР)
		
	СтрокаПоложения = СтрокиДерева.Добавить();
	СтрокаПоложения.Ремонты = ПоложениеОР;
	СтрокаПоложения.Положение = ПоложениеОР;
	СтрокаПоложения.НомерКартинки = ?(ПоложениеОР = ПредставлениеПустогоРодителя(), 4, 2);
	
	Возврат СтрокаПоложения;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ДобавитьСтрокуОРВДерево(СтрокаПоложенияОР, ОбъектРемонта)
		
	СтрокаОР = СтрокаПоложенияОР.ПолучитьЭлементы().Добавить();
	СтрокаОР.Ремонты = ОбъектРемонта;
	СтрокаОР.ОбъектРемонта = ОбъектРемонта;
	СтрокаОР.НомерКартинки = 0;
	
	Возврат СтрокаОР;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьСтрокуВидаРемонтаВДерево(СтрокаОбъектаРемонта, ВидРемонта)
	
	СтрокиВР = торо_ДанныеФормыДеревоКлиентСервер.НайтиСтроки(
		СтрокаОбъектаРемонта,
		Новый Структура("Ремонты", ВидРемонта),
		,,1
	);
	
	Если СтрокиВР.Количество() = 0 Тогда
		СтрокаВР = СтрокаОбъектаРемонта.ПолучитьЭлементы().Добавить();
		СтрокаВР.Ремонты = ВидРемонта;
		СтрокаВР.НомерКартинки = 7;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОпределитьПоложениеОР(ОбъектРемонта, СтруктураИерархии)
	
	РодительОР = торо_РаботаСИерархией20.ПолучитьТекущегоРодителяВИерархии(ОбъектРемонта, СтруктураИерархии,,Истина,Истина);
	
	Если НЕ ЗначениеЗаполнено(РодительОР) Тогда
		ПоложениеОР = ПредставлениеПустогоРодителя();
	Иначе
		ПоложениеОР = ?(ТипЗнч(РодительОР) = Тип("СправочникСсылка.торо_ОбъектыРемонта"), РодительОР, Строка(РодительОР));
	КонецЕсли;
	
	Возврат ПоложениеОР;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПредставлениеПустогоРодителя()
	
	Возврат НСтр("es='<los Objetos y los tipos de la reparación>';ru='<Объекты и виды ремонта>';en='<Объекты и виды ремонта>'");
	
КонецФункции

&НаКлиенте
Процедура ВопросОПерезаполненииСкладаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ПерезаполнятьСклад = (Результат = КодВозвратаДиалога.Да);
	ЗаполнитьСкладИзПодразделения(ПерезаполнятьСклад);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСкладИзПодразделения(ПерезаполнятьСклад)
	
	Для каждого Строка Из Объект.ПланРемонтов Цикл	
		Если НЕ ЗначениеЗаполнено(Строка.Склад) ИЛИ ПерезаполнятьСклад Тогда
			торо_ЗаполнениеДокументовКлиент.ЗаполнитьСклад(Объект.Подразделение, Строка.Склад);
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");	
	
КонецПроцедуры



#КонецОбласти

фПослеОчистки = Ложь;

#Если Клиент Тогда
	НужноСортироватьПланРемонтов = Ложь;
	УровеньОрВДереве = 2;
	УровеньПоложенияВДереве = 1;
#КонецЕсли

#КонецОбласти