
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаголовокРедактируемогоЭлемента = НСтр("ru='(Выберите элемент для редактирования или создайте новый)'");
	
	// Подготовим колонки тех.карт.
	ТаблицыТехКарт = ПолучитьТаблицыАтрибутовТехкарт();
	// Состав тех.карты.
	ПодготовитьКолонкиАтрибутовПодчиненныхОбъектов(
		ТаблицыТехКарт[0].ИдОбъекта, ТаблицыТехКарт[0].ИмяТаблицы, ТаблицыТехКарт[0].ТаблицаАтрибутов);
	// Тех.карты.
	ПодготовитьКолонкиАтрибутовПодчиненныхОбъектов(
		ТаблицыТехКарт[1].ИдОбъекта, ТаблицыТехКарт[1].ИмяТаблицы, ТаблицыТехКарт[1].ТаблицаАтрибутов);
	
	// Заполним список табличных атрибутов операций.
	СписокТабличныхАтрибутовОпераций = Элементы.ПереключательТабличныхАтрибутовОпераций.СписокВыбора;
	ЗаполнитьВложенныеТабличныеЧасти(ТаблицыТехКарт[0].ТаблицаАтрибутов, 1, СписокТабличныхАтрибутовОпераций);
	Если СписокТабличныхАтрибутовОпераций.Количество() = 0 Тогда
		Элементы.ГруппаПереключательТаблицОпераций.Видимость  = Ложь;
		Элементы.ЗначениеТабличногоАтрибутаОперации.Видимость = Ложь;
	КонецЕсли;
	
	// Заполним список табличных атрибутов тех.карт.
	СписокТабличныхАтрибутовТехКарт = Элементы.ПереключательТабличныхАтрибутовТехКарт.СписокВыбора;
	ЗаполнитьВложенныеТабличныеЧасти(ТаблицыТехКарт[1].ТаблицаАтрибутов, 2, СписокТабличныхАтрибутовТехКарт);
	Если СписокТабличныхАтрибутовОпераций.Количество() = 0 Тогда
		Элементы.ПереключательТабличныхАтрибутовТехКарт.Видимость = Ложь;
	Иначе
		Найдено = СписочныеАтрибуты.НайтиСтроки(Новый Структура("ТипОбъекта, АтрибутКласса",
			2, ПланыВидовХарактеристик.АтрибутыКласса.ТехОперации));
		Если Найдено.Количество() > 0 Тогда
			ПереключательТабличныхАтрибутовТехКарт = Найдено[0].ИДАтрибута;
			ТекТаблицаТехКарты = ПланыВидовХарактеристик.АтрибутыКласса.ТехОперации;
		Иначе
			Найдено = СписочныеАтрибуты.НайтиСтроки(Новый Структура("ТипОбъекта", 2));
			ПереключательТабличныхАтрибутовТехКарт = Найдено[0].ИДАтрибута;
			ТекТаблицаТехКарты                     = Найдено[0].АтрибутКласса;
		КонецЕсли;
	КонецЕсли;
	
	ПравоИзмененияНоменклатуры = ПравоДоступа("Изменение", Метаданные.Справочники.НоменклатураКласса);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если НЕ Настройки["Объект.КолВоЗакладок"] = Неопределено Тогда
		Элементы.ПереключательАтрибутов.КоличествоКолонок = Объект.КолВоЗакладок;
	КонецЕсли;
	
	Если НЕ Настройки["Объект.МаксКолВоАтрибутов"] = Неопределено Тогда
		ПоказатьАтрибутыПоНастройке(Элементы.ГруппаАтрибуты.ПодчиненныеЭлементы, 
			ТекПозицияПрокруткиАтрибутов, КолВоАтрибутов, Объект.МаксКолВоАтрибутов);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КлассОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыВыбора = Новый Структура("НоменклатураКласса", Истина);
		ПараметрыОткрытия = Новый Структура("ПараметрыВыбора, ТекущаяСтрока", ПараметрыВыбора, Объект.Класс);
		ОткрытьФорму("Справочник.Классы.ФормаВыбора", ПараметрыОткрытия, Элемент, УникальныйИдентификатор);
	Иначе
		КлассПриИзмененииНаСервере(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КлассПриИзменении(Элемент)
	КлассПриИзмененииНаСервере();
	УстановитьЭлементыУправленияРедактированием(Элементы, Истина);
	ЗаполнитьАтрибуты(Объект.НоменклатураКласса.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	УстановитьЭлементыУправленияРедактированием(Элементы, Истина);
КонецПроцедуры

&НаКлиенте
Процедура КодПриИзменении(Элемент)
	
	Объект.ПрисвоенНомерПоШаблону = Ложь;
	Объект.НомерПоСчетчику         = 0;
	Объект.ШагСчетчика             = 0;
	
	УстановитьЭлементыУправленияРедактированием(Элементы, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключательАтрибутовПриИзменении(Элемент)
	
	ПереключитьСтраницуФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	УстановитьЭлементыУправленияРедактированием(Элементы, Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыНоменклатураСписок

&НаКлиенте
Процедура НоменклатураСписокПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	ВыбраннаяСтрока = Элементы.НоменклатураСписок.ТекущаяСтрока;
	Если Модифицированность Тогда
		ТекстВопроса = НСтр("ru='Данные были изменены. Сохранить изменения?'");
		ДопПараметры = Новый Структура("ВыбраннаяСтрока, РежимДобавления", ВыбраннаяСтрока, 0);
		ПоказатьВопрос(Новый ОписаниеОповещения("ПодготовитьФормуРедактированияЗавершение", ЭтаФорма, ДопПараметры), 
			ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		Возврат;
	КонецЕсли;
	
	ПодготовитьФормуРедактированияКласса(ВыбраннаяСтрока);
	Если ПереключательАтрибутов > 1 Тогда 
		ПереключательАтрибутов = 0;
		ПереключитьСтраницуФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураСписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	ВыбраннаяСтрока = Элементы.НоменклатураСписок.ТекущаяСтрока;
	
	Если ВыбраннаяСтрока = Неопределено Тогда
		ВыбраннаяСтрока = Родитель;
	КонецЕсли;
	
	Если Модифицированность Тогда
		ТекстВопроса = НСтр("ru='Данные были изменены. Сохранить изменения?'");
		ДопПараметры = Новый Структура("ВыбраннаяСтрока, РежимДобавления", ВыбраннаяСтрока, ?(Копирование, 2, 1));
		ПоказатьВопрос(Новый ОписаниеОповещения("ПодготовитьФормуРедактированияЗавершение", ЭтаФорма, ДопПараметры), 
			ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		Возврат;
	КонецЕсли;
	
	ПодготовитьФормуРедактированияКласса(ВыбраннаяСтрока, ?(Копирование, 2, 1));
	Если ПереключательАтрибутов > 1 Тогда 
		ПереключательАтрибутов = 0;
		ПереключитьСтраницуФормы();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыЗначенияТабличногоАтрибута

&НаКлиенте
Процедура ЗначениеТабличногоАтрибутаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекДанные = Элементы.ЗначениеТабличногоАтрибута.ТекущиеДанные;
	Если НоваяСтрока Тогда 
		ТекДанные.СтатусНаследования = 1;
		ТекДанные.ИДСтроки = НайтиНовыйИД(Объект.СтрокиТабличныхАтрибутов, "ИДСтроки");
	КонецЕсли;
	
	РедактированиеСтроки = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеТабличногоАтрибутаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	РедактированиеСтроки = Ложь;
	
	Если НоваяСтрока И ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.ЗначениеТабличногоАтрибута.ТекущиеДанные;
	
	СтруктураПоиска = Новый Структура(
		"ИДСтрокиРодителя, АтрибутКласса, ИДСтроки", 0, ТекСписочныйАтрибут, ТекДанные.ИДСтроки);
	НайденоСтроки = Объект.СтрокиТабличныхАтрибутов.НайтиСтроки(СтруктураПоиска);	
	
	Если НайденоСтроки.Количество() > 0 Тогда
		СтрокаТабличногоАтрибута = НайденоСтроки[0];
	ИначеЕсли НЕ ОтменаРедактирования Тогда
		СтрокаТабличногоАтрибута = Объект.СтрокиТабличныхАтрибутов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТабличногоАтрибута, СтруктураПоиска);
	КонецЕсли;
	
	// Заполняем источник значений.
	Если НЕ СтрокаТабличногоАтрибута = Неопределено 
			И НЕ ЗначениеЗаполнено(СтрокаТабличногоАтрибута.ИсточникЗначений) Тогда
		НайденоДанныеАтрибута = ПоляАтрибутовКласса.НайтиСтроки(Новый Структура("АтрибутКласса", ТекСписочныйАтрибут));
		СтрокаТабличногоАтрибута.ИсточникЗначений = НайденоДанныеАтрибута[0].ИсточникЗначений;
	КонецЕсли;
	
	Если НЕ ОтменаРедактирования Тогда
		СтрокаТабличногоАтрибута.СтатусНаследования = ТекДанные.СтатусНаследования;
		СтрокаТабличногоАтрибута.Порядок            = ЗначениеТабличногоАтрибута.Индекс(ТекДанные);
	КонецЕсли;
	
	ПоместитьЗначенияАтрибутовСтрокВДанныеОбработки(ТекДанные, ОтменаРедактирования, 0, ТекСписочныйАтрибут, 2); 
	
	ПодключитьОбработчикОжидания("ПодключаемыйУстановитьЭлементУправленияРедактированием", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеТабличногоАтрибутаПриИзменении(Элемент)
	
	ЗаполнитьПорядокСтрокТабличныхАтрибутов(ЗначениеТабличногоАтрибута, 0, ТекСписочныйАтрибут);
	Если НЕ РедактированиеСтроки Тогда
		ПодключитьОбработчикОжидания("ПодключаемыйУстановитьЭлементУправленияРедактированием", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеТабличногоАтрибутаПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	Выбраны = Элементы.ЗначениеТабличногоАтрибута.ВыделенныеСтроки;
	УдалитьВыбранныеСтрокиТабличногоАтрибута(ЗначениеТабличногоАтрибута, Выбраны, 0, ТекСписочныйАтрибут);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыТехКарты

&НаКлиенте
Процедура ТехКартыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекДанные = Элементы.ТехКарты.ТекущиеДанные;
	Если НоваяСтрока Тогда 
		ТекДанные.СтатусНаследования = 1;
		ТекДанные.ИДСтроки = НайтиНовыйИД(Объект.СтрокиТабличныхАтрибутов, "ИДСтроки");
	КонецЕсли;
	
	РедактированиеСтроки = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТехКартыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	РедактированиеСтроки = Ложь;
	
	ТекДанные = Элементы.ТехКарты.ТекущиеДанные;
	Если НоваяСтрока И ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	АтрибутТехКарты = ПредопределенноеЗначение("ПланВидовХарактеристик.АтрибутыКласса.ТехКарты");
	СтруктураПоиска = Новый Структура(
		"ИДСтрокиРодителя, АтрибутКласса, ИДСтроки", 0, АтрибутТехКарты, ТекДанные.ИДСтроки);
	НайденоСтроки = Объект.СтрокиТабличныхАтрибутов.НайтиСтроки(СтруктураПоиска);
	
	Если НайденоСтроки.Количество() > 0 Тогда
		СтрокаТабличногоАтрибута = НайденоСтроки[0];
	ИначеЕсли НЕ ОтменаРедактирования Тогда
		СтрокаТабличногоАтрибута = Объект.СтрокиТабличныхАтрибутов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТабличногоАтрибута, СтруктураПоиска);
		СтрокаТабличногоАтрибута.ИсточникЗначений = 
			ПредопределенноеЗначение("Справочник.Классы.ТехнологическиеКарты");
	КонецЕсли;
	
	Если НЕ ОтменаРедактирования Тогда
		ЗаполнитьЗначенияСвойств(СтрокаТабличногоАтрибута, ТекДанные, "ИДСтроки, Наименование, СтатусНаследования");
		СтрокаТабличногоАтрибута.АтрибутКласса = АтрибутТехКарты;
		СтрокаТабличногоАтрибута.Порядок       = ЗначениеТабличногоАтрибута.Индекс(ТекДанные);
	ИначеЕсли НЕ СтрокаТабличногоАтрибута = Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ТекДанные, СтрокаТабличногоАтрибута, "Наименование");
	КонецЕсли;
	
	ПоместитьЗначенияАтрибутовСтрокВДанныеОбработки(ТекДанные, ОтменаРедактирования, 0, АтрибутТехКарты, 1);
	
	// Заполняем наименование типа тех.карты.
	Если НЕ ОтменаРедактирования Тогда
		АтрибутТипТехкарты = ПредопределенноеЗначение("ПланВидовХарактеристик.АтрибутыКласса.ТипТехКарты");
		СоответствиеКолонок = ПолучитьСоответствиеКолонокПодчиненныхОбъектов(1, КолонкиАтрибутовПодчиненныхОбъектов);
		СтрокаКолонка = СоответствиеКолонок[АтрибутТипТехкарты];
		ТипТехКарты = ТекДанные[СтрокаКолонка.ИмяКолонки];
		Если ЗначениеЗаполнено(ТипТехКарты) Тогда
			ТекДанные.НаименованиеТипа = Строка(ТипТехКарты);
		КонецЕсли;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ПодключаемыйУстановитьЭлементУправленияРедактированием", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ТехКартыПриИзменении(Элемент)
	
	ЗаполнитьПорядокСтрокТабличныхАтрибутов(ТехКарты, 0, 
		ПредопределенноеЗначение("ПланВидовХарактеристик.АтрибутыКласса.ТехКарты"));
	ПодключитьОбработчикОжидания("ПодключаемыйУстановитьЭлементУправленияРедактированием", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ТехКартыПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	Выбраны = Элементы.ТехКарты.ВыделенныеСтроки;
	УдалитьВыбранныеСтрокиТабличногоАтрибута(ТехКарты, Выбраны, 0, 
		ПредопределенноеЗначение("ПланВидовХарактеристик.АтрибутыКласса.ТехКарты"));
	
КонецПроцедуры

&НаКлиенте
Процедура ТехКартыПослеУдаления(Элемент)
	
	Если Элементы.ТехКарты.ТекущаяСтрока = Неопределено Тогда
		ТекТехКарта = -1;
		ТекОперация = -1;
		Элементы.СоставТехКарты.ТолькоПросмотр = Истина;
		Элементы.ПереключательТабличныхАтрибутовТехКарт.ТолькоПросмотр = Истина;
		ЗначениеТабличногоАтрибута.Очистить();
		
		Если ТекТаблицаТехКарты = ПредопределенноеЗначение("ПланВидовХарактеристик.АтрибутыКласса.ТехОперации") Тогда
			ВывестиСоставТехКартыНаСервере(ТекТехКарта);
		Иначе
			ВывестиТаблицуВложенногоАтрибута("ЗначениеТабличногоАтрибута", ТекТехКарта, ТекТаблицаТехКарты, 2);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТехКартыПриАктивизацииСтроки(Элемент)
	
	Если НЕ ТекСписочныйАтрибут = ПредопределенноеЗначение("ПланВидовХарактеристик.АтрибутыКласса.ТехКарты") Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.ТехКарты.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		ТекТехКарта = -1;
		ТекОперация = -1;
		Элементы.СоставТехКарты.ТолькоПросмотр = Истина;
		Элементы.ПереключательТабличныхАтрибутовТехКарт.ТолькоПросмотр = Истина;
		ЗначениеТабличногоАтрибута.Очистить();
	Иначе
		Если ТекДанные.ИДСтроки = 0 Тогда
			ТекДанные.ИДСтроки = НайтиНовыйИД(Объект.СтрокиТабличныхАтрибутов, "ИДСтроки");
		КонецЕсли;
		Если ТекТехКарта = ТекДанные.ИДСтроки Тогда
			Возврат;
		КонецЕсли;
		ТекТехКарта = ТекДанные.ИДСтроки;
		ТекОперация = -1;
		
		Элементы.СоставТехКарты.ТолькоПросмотр = НЕ ПравоИзмененияНоменклатуры;
		Элементы.ПереключательТабличныхАтрибутовТехКарт.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
	Если ТекТаблицаТехКарты = ПредопределенноеЗначение("ПланВидовХарактеристик.АтрибутыКласса.ТехОперации") Тогда
		ВывестиСоставТехКартыНаСервере(ТекТехКарта);
	Иначе
		ВывестиТаблицуВложенногоАтрибута("ЗначениеТабличногоАтрибута", ТекТехКарта, ТекТаблицаТехКарты, 2);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТехКартыТипТехКартыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОтбора = Новый Структура("Класс, ЭтоГруппа", ПредопределенноеЗначение("Справочник.Классы.ТипыТехКарт"), Ложь);
	
	ПараметрыВыбора = Новый Структура();
	ПараметрыВыбора.Вставить("Отбор", ПараметрыОтбора);
	
	ФормаВыбора = ПолучитьФорму("Справочник.НоменклатураКласса.ФормаВыбора", ПараметрыВыбора, Элемент, УникальныйИдентификатор);
	ФормаВыбора.Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	
	ФормаВыбора.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СоставТехКартыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если НЕ Элемент.ТекущаяСтрока = Неопределено Тогда
		Отказ = Истина;
		ЭлементыДерева = СоставТехКарты.ПолучитьЭлементы();
		
		НоваяСтрока = ЭлементыДерева.Добавить();
		НоваяСтрока.СтатусНаследования = 1;
		НоваяСтрока.ИДСтроки = НайтиНовыйИД(Объект.СтрокиТабличныхАтрибутов, "ИДСтроки");
		НоваяСтрока.ОбъектОперации = Объект.Класс;
		
		Элемент.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		Элемент.ИзменитьСтроку();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставТехКартыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекДанные = Элементы.СоставТехКарты.ТекущиеДанные;
	Если НоваяСтрока Тогда 
		ТекДанные.СтатусНаследования = 1;
		ТекДанные.ИДСтроки = НайтиНовыйИД(Объект.СтрокиТабличныхАтрибутов, "ИДСтроки");
	КонецЕсли;
	
	РедактированиеСтроки = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставТехКартыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	РедактированиеСтроки = Ложь;
	
	Если НоваяСтрока И ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанныеТехКарты = Элементы.ТехКарты.ТекущиеДанные;
	Если ТекДанныеТехКарты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.СоставТехКарты.ТекущиеДанные;
	
	АтрибутТехОперации = ПредопределенноеЗначение("ПланВидовХарактеристик.АтрибутыКласса.ТехОперации");
	СтруктураПоиска = Новый Структура(
		"ИДСтрокиРодителя, АтрибутКласса, ИДСтроки", ТекДанныеТехКарты.ИДСтроки, АтрибутТехОперации, ТекДанные.ИДСтроки);
	НайденоСтроки = Объект.СтрокиТабличныхАтрибутов.НайтиСтроки(СтруктураПоиска);
	
	Если НайденоСтроки.Количество() > 0 Тогда
		СтрокаТабличногоАтрибута = НайденоСтроки[0];
	ИначеЕсли НЕ ОтменаРедактирования Тогда
		СтрокаТабличногоАтрибута = Объект.СтрокиТабличныхАтрибутов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТабличногоАтрибута, СтруктураПоиска);
		СтрокаТабличногоАтрибута.ИсточникЗначений = ?(ТекДанные.ТипСтроки = 0,
			ПредопределенноеЗначение("Справочник.Классы.СтрокиТехОпераций"),
			ПредопределенноеЗначение("Справочник.Классы.ВложенныеТехКарты"));
	КонецЕсли;
	
	Если НЕ ОтменаРедактирования Тогда
		ЗаполнитьЗначенияСвойств(СтрокаТабличногоАтрибута, ТекДанные, "ИДСтроки, Наименование, СтатусНаследования");
		СтрокаТабличногоАтрибута.АтрибутКласса = АтрибутТехОперации;
		СтрокаТабличногоАтрибута.Порядок       = ЗначениеТабличногоАтрибута.Индекс(ТекДанные);
	КонецЕсли;
	
	ПоместитьЗначенияАтрибутовСтрокВДанныеОбработки(ТекДанные, ОтменаРедактирования, ТекДанныеТехКарты.ИДСтроки, АтрибутТехОперации, 0);
	
	ПодключитьОбработчикОжидания("ПодключаемыйУстановитьЭлементУправленияРедактированием", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставТехКартыПриИзменении(Элемент)
	
	// Настройка порядка строк.
	ТекДанныеТехКарты = Элементы.ТехКарты.ТекущиеДанные;
	Если ТекДанныеТехКарты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементыДерева = СоставТехКарты.ПолучитьЭлементы();
	ЗаполнитьПорядокСтрокТабличныхАтрибутов(ЭлементыДерева, ТекДанныеТехКарты.ИДСтроки, 
		ПредопределенноеЗначение("ПланВидовХарактеристик.АтрибутыКласса.ТехОперации"));
		
	ПодключитьОбработчикОжидания("ПодключаемыйУстановитьЭлементУправленияРедактированием", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставТехКартыПередУдалением(Элемент, Отказ)
	
	Выбраны = Элементы.СоставТехКарты.ВыделенныеСтроки;
	
	УдалитьТехОперацию(Выбраны);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставТехКартыПриАктивизацииСтроки(Элемент)
	
	Если Элементы.ПереключательТабличныхАтрибутовОпераций.СписокВыбора.Количество() = 0 
			ИЛИ НЕ ЗначениеЗаполнено(ТекТаблицаОперации) 
			ИЛИ НЕ ТекСписочныйАтрибут = ПредопределенноеЗначение("ПланВидовХарактеристик.АтрибутыКласса.ТехКарты") Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.СоставТехКарты.ТекущиеДанные;
	Если НЕ ТекДанные = Неопределено И ТекОперация = ТекДанные.ИДСтроки Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ТекДанные = Неопределено Тогда
		ТекОперация = ТекДанные.ИДСтроки;
	КонецЕсли;
	
	Если ТекДанные = Неопределено ИЛИ ТекДанные.ТипСтроки > 0 Тогда
		Элементы.ЗначениеТабличногоАтрибутаОперации.ТолькоПросмотр = Истина;
		Элементы.ПереключательТабличныхАтрибутовОпераций.ТолькоПросмотр = Истина;
		ЗначениеТабличногоАтрибута.Очистить();
		ТекОперация = -1;
	Иначе
		Элементы.ЗначениеТабличногоАтрибутаОперации.ТолькоПросмотр = НЕ ПравоИзмененияНоменклатуры;
		Элементы.ПереключательТабличныхАтрибутовОпераций.ТолькоПросмотр = Ложь;
		ВывестиТаблицуВложенногоАтрибута("ЗначениеТабличногоАтрибута", ТекДанные.ИДСтроки, ТекТаблицаОперации, 2);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставТехКартыВидОперацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОтбора = Новый Структура("Класс, ЭтоГруппа", ПредопределенноеЗначение("Справочник.Классы.ВидыТехОпераций"), Ложь);
	
	ПараметрыВыбора = Новый Структура();
	ПараметрыВыбора.Вставить("Отбор", ПараметрыОтбора);
	
	ФормаВыбора = ПолучитьФорму("Справочник.НоменклатураКласса.ФормаВыбора", ПараметрыВыбора, Элемент, УникальныйИдентификатор);
	ФормаВыбора.Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	
	ФормаВыбора.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключательТабличныхАтрибутовОперацийПриИзменении(Элемент)
	
	Найдено = СписочныеАтрибуты.НайтиСтроки(
		Новый Структура("ТипОбъекта, ИДАтрибута", 1, ПереключательТабличныхАтрибутовОпераций));
	ТекТаблицаОперации = Найдено[0].АтрибутКласса;
	Элементы.ЗначениеТабличногоАтрибутаОперации.ИзменятьСоставСтрок = Найдено[0].ДобавлениеСтрокТабЧастиВНоменклатуреКласса;
	ПодготовитьТаблицуВложенногоАтрибута(Найдено[0].ИсточникЗначений, "ЗначениеТабличногоАтрибутаОперации");
	
	ТекДанные = Элементы.СоставТехКарты.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Элементы.ЗначениеТабличногоАтрибутаОперации.ТолькоПросмотр = Истина;
		ЗначениеТабличногоАтрибута.Очистить();
	Иначе
		Элементы.ЗначениеТабличногоАтрибутаОперации.ТолькоПросмотр = НЕ ПравоИзмененияНоменклатуры;
		ВывестиТаблицуВложенногоАтрибута("ЗначениеТабличногоАтрибута", ТекДанные.ИДСтроки, ТекТаблицаОперации, 2);
	КонецЕсли;
	
	Видимость = Элементы.ЗначениеТабличногоАтрибутаОперации.Видимость;
	Если НЕ Видимость Тогда
		Элементы.ЗначениеТабличногоАтрибутаОперации.Видимость = Истина;
		Элементы.СвернутьРазвернутьТабличныеАтрибутыОпераций.Картинка = БиблиотекаКартинок.гкс_ПанельРазвернута;
		
		Элементы.ТехКарты.Видимость = Ложь;
		Элементы.ТехКартыГруппаСтандартныеКоманды.Видимость = Ложь;
		Элементы.ТехКартыСвернутьРазвернутьТехКарты.Картинка = БиблиотекаКартинок.гкс_ПанельСвернута;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеТабличногоАтрибутаОперацииПриИзменении(Элемент)
	
	ТекДанные = Элементы.СоставТехКарты.ТекущиеДанные;
	Если НЕ ТекДанные = Неопределено Тогда
		ЗаполнитьПорядокСтрокТабличныхАтрибутов(ЗначениеТабличногоАтрибута, ТекДанные.ИДСтроки, ТекТаблицаОперации);
	КонецЕсли;
	ПодключитьОбработчикОжидания("ПодключаемыйУстановитьЭлементУправленияРедактированием", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеТабличногоАтрибутаОперацииПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	ТекДанные = Элементы.СоставТехКарты.ТекущиеДанные;
	Если НЕ ТекДанные = Неопределено Тогда
		Выбраны = Элементы.ЗначениеТабличногоАтрибутаОперации.ВыделенныеСтроки;
		УдалитьВыбранныеСтрокиТабличногоАтрибута(ЗначениеТабличногоАтрибута, Выбраны, ТекДанные.ИДСтроки, ТекТаблицаОперации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеТабличногоАтрибутаОперацииПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекДанные = Элементы.ЗначениеТабличногоАтрибутаОперации.ТекущиеДанные;
	Если НоваяСтрока Тогда 
		ТекДанные.СтатусНаследования = 1;
		ТекДанные.ИДСтроки = НайтиНовыйИД(Объект.СтрокиТабличныхАтрибутов, "ИДСтроки");
	КонецЕсли;
	
	РедактированиеСтроки = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеТабличногоАтрибутаОперацииПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	РедактированиеСтроки = Ложь;
	
	Если НоваяСтрока И ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанныеОперации = Элементы.СоставТехКарты.ТекущиеДанные;
	Если ТекДанныеОперации = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.ЗначениеТабличногоАтрибутаОперации.ТекущиеДанные;
	
	СтруктураПоиска = Новый Структура(
		"ИДСтрокиРодителя, АтрибутКласса, ИДСтроки", ТекДанныеОперации.ИДСтроки, ТекТаблицаОперации, ТекДанные.ИДСтроки);
	НайденоСтроки = Объект.СтрокиТабличныхАтрибутов.НайтиСтроки(СтруктураПоиска);
	
	Если НайденоСтроки.Количество() > 0 Тогда
		СтрокаТабличногоАтрибута = НайденоСтроки[0];
	ИначеЕсли НЕ ОтменаРедактирования Тогда
		СтрокаТабличногоАтрибута = Объект.СтрокиТабличныхАтрибутов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТабличногоАтрибута, СтруктураПоиска);
	КонецЕсли;
	
	// Заполняем источник значений.
	Если НЕ СтрокаТабличногоАтрибута = Неопределено 
			И НЕ ЗначениеЗаполнено(СтрокаТабличногоАтрибута.ИсточникЗначений) Тогда
		НайденоДанныеАтрибута = СписочныеАтрибуты.НайтиСтроки(Новый Структура("ТипОбъекта, АтрибутКласса", 1, ТекТаблицаОперации));
		СтрокаТабличногоАтрибута.ИсточникЗначений = НайденоДанныеАтрибута[0].ИсточникЗначений;
	КонецЕсли;
	
	Если НЕ ОтменаРедактирования Тогда
		ЗаполнитьЗначенияСвойств(СтрокаТабличногоАтрибута, ТекДанные, "ИДСтроки, СтатусНаследования");
		СтрокаТабличногоАтрибута.Порядок = ЗначениеТабличногоАтрибута.Индекс(ТекДанные);
	КонецЕсли;
	
	ПоместитьЗначенияАтрибутовСтрокВДанныеОбработки(ТекДанные, ОтменаРедактирования, ТекДанныеОперации.ИДСтроки, ТекТаблицаОперации, 2);
	
	ПодключитьОбработчикОжидания("ПодключаемыйУстановитьЭлементУправленияРедактированием", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключательТабличныхАтрибутовТехКартПриИзменении(Элемент)
	
	Найдено = СписочныеАтрибуты.НайтиСтроки(
		Новый Структура("ТипОбъекта, ИДАтрибута", 1, ПереключательТабличныхАтрибутовОпераций));
	ТекТаблицаТехКарты = Найдено[0].АтрибутКласса;
	
	ПодготовитьВложеннуюТаблицуТехкарт();
	
	Если ТекТаблицаТехКарты = ПредопределенноеЗначение("ПланВидовХарактеристик.АтрибутыКласса.ТехОперации") Тогда
		ВывестиСоставТехКартыНаСервере(ТекТехКарта);
		
		Элементы.ГруппаСтраницыТабЧастейТехКарты.ТекущаяСтраница = Элементы.ГруппаТехОперации;
	Иначе
		Если НЕ ТекТехКарта = Неопределено Тогда
			ВывестиТаблицуВложенногоАтрибута("ЗначениеТабличногоАтрибута", ТекТехКарта, ТекТаблицаТехКарты, 2);
		КонецЕсли;
		
		Элементы.ГруппаСтраницыТабЧастейТехКарты.ТекущаяСтраница = Элементы.ГруппаВложенныеТабличныеЧастиТехКарты;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеТабличногоАтрибутаТехКартыПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТехКарты.ТекущиеДанные;
	Если НЕ ТекДанные = Неопределено Тогда
		ЗаполнитьПорядокСтрокТабличныхАтрибутов(ЗначениеТабличногоАтрибута, ТекДанные.ИДСтроки, ТекТаблицаТехКарты);
	КонецЕсли;
	ПодключитьОбработчикОжидания("ПодключаемыйУстановитьЭлементУправленияРедактированием", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеТабличногоАтрибутаТехКартыПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	ТекДанные = Элементы.ТехКарты.ТекущиеДанные;
	Если НЕ ТекДанные = Неопределено Тогда
		Выбраны = Элементы.ЗначениеТабличногоАтрибутаТехКарты.ВыделенныеСтроки;
		УдалитьВыбранныеСтрокиТабличногоАтрибута(ЗначениеТабличногоАтрибута, Выбраны, ТекДанные.ИДСтроки, ТекТаблицаТехКарты);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеТабличногоАтрибутаТехКартыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекДанные = Элементы.ЗначениеТабличногоАтрибутаТехКарты.ТекущиеДанные;
	Если НоваяСтрока Тогда 
		ТекДанные.СтатусНаследования = 1;
		ТекДанные.ИДСтроки = НайтиНовыйИД(Объект.СтрокиТабличныхАтрибутов, "ИДСтроки");
	КонецЕсли;
	
	РедактированиеСтроки = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеТабличногоАтрибутаТехКартыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	РедактированиеСтроки = Ложь;
	
	Если НоваяСтрока И ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанныеТехКарты = Элементы.ТехКарты.ТекущиеДанные;
	Если ТекДанныеТехКарты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.ЗначениеТабличногоАтрибутаТехКарты.ТекущиеДанные;
	
	СтруктураПоиска = Новый Структура(
		"ИДСтрокиРодителя, АтрибутКласса, ИДСтроки", ТекДанныеТехКарты.ИДСтроки, ТекТаблицаТехКарты, ТекДанные.ИДСтроки);
	НайденоСтроки = Объект.СтрокиТабличныхАтрибутов.НайтиСтроки(СтруктураПоиска);
	
	Если НайденоСтроки.Количество() > 0 Тогда
		СтрокаТабличногоАтрибута = НайденоСтроки[0];
	ИначеЕсли НЕ ОтменаРедактирования Тогда
		СтрокаТабличногоАтрибута = Объект.СтрокиТабличныхАтрибутов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТабличногоАтрибута, СтруктураПоиска);
	КонецЕсли;
	
	// Заполняем источник значений.
	Если НЕ СтрокаТабличногоАтрибута = Неопределено 
			И НЕ ЗначениеЗаполнено(СтрокаТабличногоАтрибута.ИсточникЗначений) Тогда
		НайденоДанныеАтрибута = СписочныеАтрибуты.НайтиСтроки(Новый Структура("ТипОбъекта, АтрибутКласса", 2, ТекТаблицаТехКарты));
		СтрокаТабличногоАтрибута.ИсточникЗначений = НайденоДанныеАтрибута[0].ИсточникЗначений;
	КонецЕсли;
	
	Если НЕ ОтменаРедактирования Тогда
		ЗаполнитьЗначенияСвойств(СтрокаТабличногоАтрибута, ТекДанные, "ИДСтроки, СтатусНаследования");
		СтрокаТабличногоАтрибута.Порядок = ЗначениеТабличногоАтрибута.Индекс(ТекДанные);
	КонецЕсли;
	
	ПоместитьЗначенияАтрибутовСтрокВДанныеОбработки(ТекДанные, ОтменаРедактирования, ТекДанныеТехКарты.ИДСтроки, ТекТаблицаТехКарты, 2);
	
	ПодключитьОбработчикОжидания("ПодключаемыйУстановитьЭлементУправленияРедактированием", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИзменения(Команда)
	ЗаписатьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьРедактирование(Команда)
	ОтменитьРедактированиеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьКодПоШаблону(Команда)
	
	Отказ = Ложь;
	Если НЕ ЗначениеЗаполнено(Объект.ШаблонКодаРодителя) Тогда
		ТекстСообщения = НСтр("ru='Не возможно сформировать код по шаблону. Не заполнен шаблон кода номенклатуры у класса.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , , Отказ);
	КонецЕсли;
	Если НЕ Отказ И (НЕ ЗначениеЗаполнено(Объект.НоменклатураКласса.Ссылка) ИЛИ Модифицированность) Тогда
		ТекстСообщения = НСтр("ru='Перед формированием кода по шаблону необходимо записать номенклатуру класса.
			|Записать изменения номенклатуры класса?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("СформироватьКодПоШаблонуЗавершение", ЭтаФорма), ТекстСообщения, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	Если НЕ Отказ Тогда
		СформироватьКодПоШаблонуНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНаименованиеПоШаблону(Команда)
	
	Отказ = Ложь;
	НовоеНаименование = СформироватьНаименованиеНаСервере(Истина, Отказ);
	Если НЕ Отказ И НЕ Объект.Наименование = НовоеНаименование Тогда
		Объект.Наименование = НовоеНаименование;
		УстановитьЭлементыУправленияРедактированием(Элементы, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыОтображенияАтрибутов(Команда)
	
	ПараметрыОткрытия = Новый Структура("МаксКолВоАтрибутов, КолВоЗакладок");
	ЗаполнитьЗначенияСвойств(ПараметрыОткрытия, Объект);
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("НастройкиФормыПриЗакрытии", ЭтаФорма);
	ОткрытьФорму("Обработка.РедактированиеНоменклатурыКлассов.Форма.ФормаНастройки", 
		ПараметрыОткрытия, ЭтаФорма, , , , ОповещениеОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрокрутитьНиже(Команда)
	ТекПозицияПрокруткиАтрибутов = ?(ТекПозицияПрокруткиАтрибутов = 0, 1, ТекПозицияПрокруткиАтрибутов)
		+ Объект.МаксКолВоАтрибутов;
	ПоказатьАтрибутыПоНастройке(Элементы.ГруппаАтрибуты.ПодчиненныеЭлементы, 
		ТекПозицияПрокруткиАтрибутов, КолВоАтрибутов, Объект.МаксКолВоАтрибутов);
КонецПроцедуры

&НаКлиенте
Процедура ПрокрутитьВыше(Команда)
	ТекПозицияПрокруткиАтрибутов = ?(ТекПозицияПрокруткиАтрибутов > Объект.МаксКолВоАтрибутов, 
		ТекПозицияПрокруткиАтрибутов - Объект.МаксКолВоАтрибутов, 1);
	ПоказатьАтрибутыПоНастройке(Элементы.ГруппаАтрибуты.ПодчиненныеЭлементы, 
		ТекПозицияПрокруткиАтрибутов, КолВоАтрибутов, Объект.МаксКолВоАтрибутов);
КонецПроцедуры

&НаКлиенте
Процедура СвернутьРазвернутьТехКарты(Команда)
	
	Видимость = НЕ Элементы.ТехКарты.Видимость;
	
	Элементы.ТехКарты.Видимость = Видимость;
	Элементы.ТехКартыГруппаСтандартныеКоманды.Видимость = Видимость;
	Элементы.ТехКартыСвернутьРазвернутьТехКарты.Картинка = ?(Видимость,
		БиблиотекаКартинок.гкс_ПанельРазвернута, БиблиотекаКартинок.гкс_ПанельСвернута);
	
	Если Видимость Тогда
		Элементы.ЗначениеТабличногоАтрибутаОперации.Видимость = Ложь;
		Элементы.СвернутьРазвернутьТабличныеАтрибутыОпераций.Картинка = БиблиотекаКартинок.гкс_ПанельСвернута;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьРазвернутьТабличныеАтрибутыОпераций(Команда)
	
	Видимость = НЕ Элементы.ЗначениеТабличногоАтрибутаОперации.Видимость;
	
	Элементы.ЗначениеТабличногоАтрибутаОперации.Видимость = Видимость;
	Элементы.СвернутьРазвернутьТабличныеАтрибутыОпераций.Картинка = ?(Видимость,
		БиблиотекаКартинок.гкс_ПанельРазвернута, БиблиотекаКартинок.гкс_ПанельСвернута);
	
	Если Видимость Тогда
		Элементы.ТехКарты.Видимость = Ложь;
		Элементы.ТехКартыГруппаСтандартныеКоманды.Видимость = Ложь;
		Элементы.ТехКартыСвернутьРазвернутьТехКарты.Картинка = БиблиотекаКартинок.гкс_ПанельСвернута;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьРазвернутьДеревоНоменклатуры(Команда)
	Элементы.ГруппаЛеваяКолонка.Видимость = НЕ Элементы.ГруппаЛеваяКолонка.Видимость;
	Элементы.СвернутьРазвернутьДеревоНоменклатуры.Пометка = Элементы.ГруппаЛеваяКолонка.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура ГрупповоеРедактирование(Команда)
	
	ПараметрыОткрытия = Новый Структура("НоменклатураДляОбработки", Новый Массив);
	Для Каждого НоменклатураСсылка ИЗ Элементы.НоменклатураСписок.ВыделенныеСтроки Цикл
		ПараметрыОткрытия.НоменклатураДляОбработки.Добавить(НоменклатураСсылка);
	КонецЦикла;
	
	ОткрытьФорму("Обработка.ГрупповаяОбработкаНоменклатурыКлассов.Форма.Форма", ПараметрыОткрытия, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции управления интерфейсом пользователя

&НаКлиенте
Процедура СформироватьКодПоШаблонуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьНаСервере();
	СформироватьКодПоШаблонуНаСервере();
	
КонецПроцедуры

&НаКлиенте 
Процедура НастройкиФормыПриЗакрытии(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) = Тип("Структура") Тогда
		Если НЕ РезультатЗакрытия.КолВоЗакладок = Объект.КолВоЗакладок Тогда
			Объект.КолВоЗакладок = РезультатЗакрытия.КолВоЗакладок;
			Элементы.ПереключательАтрибутов.КоличествоКолонок = Объект.КолВоЗакладок;
		КонецЕсли;
		Если НЕ РезультатЗакрытия.МаксКолВоАтрибутов = Объект.МаксКолВоАтрибутов Тогда
			Объект.МаксКолВоАтрибутов = РезультатЗакрытия.МаксКолВоАтрибутов;
			ПоказатьАтрибутыПоНастройке(Элементы.ГруппаАтрибуты.ПодчиненныеЭлементы, 
				ТекПозицияПрокруткиАтрибутов, КолВоАтрибутов, Объект.МаксКолВоАтрибутов);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НужноОбновитьНаименованиеПриИзмененииАтрибута(АтрибутКласса, ШаблонНаименования)
	
	Возврат ШаблоныСтрокСервер.АтрибутИспользуетсяВШаблоне(АтрибутКласса, ШаблонНаименования);
	
КонецФункции

&НаСервере
Функция СформироватьНаименованиеНаСервере(ВыводитьСообщения, Отказ=Ложь)
	
	СтруктураДляФормирования = Новый Структура("Класс, Код, Наименование");
	ЗаполнитьЗначенияСвойств(СтруктураДляФормирования, Объект);
	СтруктураДляФормирования.Вставить("ТаблицаАтрибутов", ПоляАтрибутовКласса.Выгрузить());
	ЗаполнитьЗначенияСвойств(Объект.НоменклатураКласса, Объект);
	НоменклатураОбъект = ДанныеФормыВЗначение(Объект.НоменклатураКласса, Тип("СправочникОбъект.НоменклатураКласса"));
	СтруктураДляФормирования.Вставить("ПредставлениеОбъекта", Строка(НоменклатураОбъект));
	Если ПустаяСтрока(СтруктураДляФормирования.ПредставлениеОбъекта) Тогда
		СтруктураДляФормирования.Вставить("ПредставлениеОбъекта", НСтр("ru='<Номенклатура класса>'"));
	КонецЕсли;
	
	Наименование = ШаблоныСтрокСервер.СформироватьЗначениеПоШаблону(
		СтруктураДляФормирования, Объект.ШаблонНаименования, Объект.НомерПоСчетчику, Объект.ШагСчетчика, Отказ, 
		Ложь, ВыводитьСообщения);
	Возврат Наименование;
	
КонецФункции

&НаКлиенте 
Процедура ПриИзмененииАтрибута(Элемент)
	
	НайденоСтроки = ПоляАтрибутовКласса.НайтиСтроки(Новый Структура("ИмяПоля", Элемент.Имя));
	Если НайденоСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	СтрокаАтрибута = НайденоСтроки[0];
	
	Если СтрокаАтрибута.ЗначениеАтрибутаКласса = ЭтаФорма[Элемент.Имя] Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаАтрибута.ЗначениеАтрибутаКласса = ЭтаФорма[Элемент.Имя];
	Если НужноОбновитьНаименованиеПриИзмененииАтрибута(СтрокаАтрибута.АтрибутКласса, Объект.ШаблонНаименования) Тогда
		Объект.Наименование = СформироватьНаименованиеНаСервере(Ложь);
	КонецЕсли;
	
	// Проверка вложенных атрибутов.
	ВложенныеАтрибуты = ПоляАтрибутовКласса.НайтиСтроки(Новый Структура("ИсточникЗначений, ЭтоВложенныйАтрибут", СтрокаАтрибута.АтрибутКласса, Истина));
	Если ВложенныеАтрибуты.Количество() > 0 Тогда
		ЗаполнитьВложенныеАтрибуты = Ложь;
		Если ЗначениеЗаполнено(СтрокаАтрибута.ЗначениеАтрибутаКласса) Тогда
			СоответствиеОбъектов = Новый Соответствие;
			СоответствиеОбъектов.Вставить(СтрокаАтрибута.АтрибутКласса, СтрокаАтрибута.ЗначениеАтрибутаКласса);
			МассивКлассовДляЧтения = Новый Массив;
			МассивНоменклатурыДляЧтения = Новый Массив;
			Если ТипЗнч(СтрокаАтрибута.ЗначениеАтрибутаКласса) = Тип("СправочникСсылка.Классы") Тогда
				МассивКлассовДляЧтения.Добавить(СтрокаАтрибута.ЗначениеАтрибутаКласса);
			ИначеЕсли ТипЗнч(СтрокаАтрибута.ЗначениеАтрибутаКласса) = Тип("СправочникСсылка.НоменклатураКласса") Тогда
				МассивНоменклатурыДляЧтения.Добавить(СтрокаАтрибута.ЗначениеАтрибутаКласса);
			КонецЕсли;
			
			МассивВложенныхАтрибутов = Новый Массив;
			Для Каждого СтрокаВложенный ИЗ ВложенныеАтрибуты Цикл
				МассивВложенныхАтрибутов.Добавить(СтрокаВложенный.АтрибутКласса);
			КонецЦикла;
			
			ЗначенияВложенныхАтрибутов = ПрочитатьЗначенияВложенныхАтрибутов(СоответствиеОбъектов,
				МассивКлассовДляЧтения, МассивНоменклатурыДляЧтения, МассивВложенныхАтрибутов);
			ЗаполнитьВложенныеАтрибуты = Истина;
		КонецЕсли;
		
		Для Каждого СтрокаВложенный ИЗ ВложенныеАтрибуты Цикл
			ЗначениеВложенного = ?(ЗаполнитьВложенныеАтрибуты, 
				ЗначенияВложенныхАтрибутов[СтрокаВложенный.АтрибутКласса], Неопределено);
			СтрокаВложенный.ЗначениеАтрибутаКласса = ЗначениеВложенного;
			ЭтаФорма[СтрокаВложенный.ИмяПоля]      = ЗначениеВложенного;
		КонецЦикла;
	КонецЕсли;
	
	УстановитьЭлементыУправленияРедактированием(Элементы, Истина);
	
КонецПроцедуры

&НаКлиенте 
Процедура НачалоВыбораАтрибута(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НайденоСтроки = ПоляАтрибутовКласса.НайтиСтроки(Новый Структура("ИмяПоля", Элемент.Имя));
	Если НайденоСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	СтрокаАтрибута = НайденоСтроки[0];
	
	Если СтрокаАтрибута.НуженИсточникЗначений Тогда
		СтандартнаяОбработка = Ложь;
		
		ТипОбъектНоменклатуры = Тип("СправочникСсылка.ОбъектыНоменклатуры");
		ТипНоменклатураКласса = Тип("СправочникСсылка.НоменклатураКласса");
		ТипКлассы             = Тип("СправочникСсылка.Классы");
		
		ЭтоОбъектНоменклатуры = СтрокаАтрибута.ТипЗначения.СодержитТип(ТипОбъектНоменклатуры);
		ЭтоНоменклатураКласса = СтрокаАтрибута.ТипЗначения.СодержитТип(ТипНоменклатураКласса);
		ЭтоКласс              = СтрокаАтрибута.ТипЗначения.СодержитТип(ТипКлассы);
		
		ТипИсточника = ?(ЗначениеЗаполнено(СтрокаАтрибута.ИсточникЗначений), ТипЗнч(СтрокаАтрибута.ИсточникЗначений), Неопределено);
		ИсточникКласс = (ТипИсточника = ТипКлассы);
		ИсточникНоменклатура = (ТипИсточника = ТипНоменклатураКласса);
		
		Если НЕ СтрокаАтрибута.СписокДоступныхЗначений Тогда
			Если НЕ СтрокаАтрибута.СоставнойТипЗначения Тогда
				Если ЭтоНоменклатураКласса И ИсточникКласс Тогда
					ПараметрыОтбора = Новый Структура("Класс, ЭтоГруппа", СтрокаАтрибута.ИсточникЗначений, Ложь);
					
					ПараметрыВыбора = Новый Структура();
					ПараметрыВыбора.Вставить("Отбор", ПараметрыОтбора);
					
					ФормаВыбора = ПолучитьФорму("Справочник.НоменклатураКласса.ФормаВыбора", ПараметрыВыбора, Элемент, УникальныйИдентификатор);
					ФормаВыбора.Элементы.Список.Отображение = ОтображениеТаблицы.Список;
					
					ФормаВыбора.Открыть();
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе
		ТипВариантыЗначений = Тип("СправочникСсылка.ВариантыЗначенийАтрибутовКласса");
		
		ЭтоВариантыЗначений = СтрокаАтрибута.ТипЗначения.СодержитТип(ТипВариантыЗначений);
		
		Если НЕ СтрокаАтрибута.СписокДоступныхЗначений Тогда
			Если ЭтоВариантыЗначений Тогда
				СтандартнаяОбработка = Ложь;
				
				ПараметрыОтбора = Новый Структура("Владелец", СтрокаАтрибута.АтрибутКласса);
				
				ПараметрыВыбора = Новый Структура;
				ПараметрыВыбора.Вставить("Отбор", ПараметрыОтбора);
				
				ФормаВыбора = ПолучитьФорму("Справочник.ВариантыЗначенийАтрибутовКласса.ФормаВыбора", ПараметрыВыбора, Элемент, УникальныйИдентификатор);
				ФормаВыбора.Открыть();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьСтраницуФормы()
	
	Если ПереключательАтрибутов = 0 Тогда
		Элементы.ГруппаСтарницыАтрибутов.ТекущаяСтраница = Элементы.ГруппаСтраницаОбщие;
	Иначе
		Найдено = СписочныеАтрибуты.НайтиСтроки(Новый Структура("ТипОбъекта, ИДАтрибута", 0, ПереключательАтрибутов));
		Если Найдено.Количество() > 0 Тогда
			ТекСписочныйАтрибут = Найдено[0].АтрибутКласса;
			Если ТекСписочныйАтрибут = ПредопределенноеЗначение("ПланВидовХарактеристик.АтрибутыКласса.ТехКарты") Тогда
				// Вывод тех.карты.
				ВывестиТехкартыНаСервере();
				
				//РазвернутьДеревоФормы(Элементы.ДоступныеОперации, ДоступныеОперации);
				
				Элементы.ГруппаСтарницыАтрибутов.ТекущаяСтраница = Элементы.ГруппаСтраницаТехнологическаяКарта;
			ИначеЕсли Найдено[0].КлассТабличнаяЧасть Тогда
				// Вывод табличной части.
				ВывестиЗначенияТабличногоАтрибутаНаСервере(ТекСписочныйАтрибут);
				
				Элементы.ГруппаСтарницыАтрибутов.ТекущаяСтраница = Элементы.ГруппаСтраницаТабличныйАтрибут;
				
			Иначе
				//// Вывод значений для выбора.
				//ВывестиЗначенияСписочногоАтрибутаНаСервере(ТекСписочныйАтрибут);
				//
				//// Настройка элементов формы.
				//НастроитьВидимостьЭлементовЗначенийСписочногоАтрибута();
				
				Элементы.ГруппаСтарницыАтрибутов.ТекущаяСтраница = Элементы.ГруппаСтраницаСписочныйАтрибут;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтменитьРедактированиеНаСервере()
	
	Если ЗначениеЗаполнено(Объект.НоменклатураКласса.Ссылка) Тогда
		ПодготовитьФормуРедактированияКласса(Объект.НоменклатураКласса.Ссылка);
		ПереключательАтрибутов = 0;
		Элементы.ГруппаСтарницыАтрибутов.ТекущаяСтраница = Элементы.ГруппаСтраницаОбщие;
	Иначе
		ПустыеЗначения = Новый Структура("Наименование, НаименованиеПолное, Код, Класс, Родитель, Статус, 
			|НомерПоСчетчику, ШагСчетчика, ПрисвоенНомерПоШаблону",
			"", "", "", Справочники.Классы.ПустаяСсылка(), Справочники.НоменклатураКласса.ПустаяСсылка(),
			Перечисления.СтатусыОбъектовНСИ.ПустаяСсылка(), 0, 0, Ложь);
		ЗаполнитьЗначенияСвойств(Объект, ПустыеЗначения);
		
		ЗаголовокРедактируемогоЭлемента = НСтр("ru='(Выберите элемент для редактирования или создайте новый)'");
		
		ПереключательАтрибутов = 0;
		Элементы.ГруппаСтарницыАтрибутов.ТекущаяСтраница = Элементы.ГруппаСтраницаОбщие;
		
		УстановитьРежимТолькоПросмотра(Истина);
		
		Модифицированность = Ложь;
		УстановитьЭлементыУправленияРедактированием(Элементы, Ложь);
		ЗаполнитьАтрибуты(Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьРежимТолькоПросмотра(аТолькоПросмотр)
	
	Элементы.ГруппаРеквизитыШапки.ТолькоПросмотр                  = аТолькоПросмотр;
	Элементы.ГруппаСтраницаОбщие.ТолькоПросмотр                   = аТолькоПросмотр;
	Элементы.ГруппаСтраницаСписочныйАтрибут.ТолькоПросмотр        = аТолькоПросмотр;
	Элементы.ГруппаСтраницаТабличныйАтрибут.ТолькоПросмотр        = аТолькоПросмотр;
	Элементы.ГруппаТехКарты.ТолькоПросмотр                        = аТолькоПросмотр;
	Элементы.ЗначениеТабличногоАтрибутаОперации.ТолькоПросмотр    = аТолькоПросмотр;
	Элементы.ГруппаВложенныеТабличныеЧастиТехКарты.ТолькоПросмотр = аТолькоПросмотр;
	
	Элементы.СформироватьКодПоШаблону.Доступность = НЕ аТолькоПросмотр;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключаемыйУстановитьЭлементУправленияРедактированием()
	
	УстановитьЭлементыУправленияРедактированием(Элементы, Истина);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЭлементыУправленияРедактированием(Элементы, ВозможнаЗапись)
	
	Элементы.ЗаписатьИзменения.Доступность       = ВозможнаЗапись;
	Элементы.ЗаписатьИзменения.КнопкаПоУмолчанию = ВозможнаЗапись;
	Элементы.ОтменитьРедактирование.Видимость    = ВозможнаЗапись;
	
КонецПроцедуры

&НаСервере 
Процедура КлассПриИзмененииНаСервере(ВыбранноеЗначение=Неопределено)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Объект.Класс = ВыбранноеЗначение;
	КонецЕсли;
	
	Объект.Родитель = ПолучитьРодителяПоКлассу(Объект.Класс);
	Элементы.НоменклатураСписок.ТекущийРодитель = Объект.Родитель;
	
	МассивКлассов = ПолучитьСписокДоступныхКлассов(Объект.Родитель);
	СписокВыбора = Элементы.Класс.СписокВыбора;
	СписокВыбора.Очистить();
	Если ЗначениеЗаполнено(МассивКлассов) Тогда
		СписокВыбора.ЗагрузитьЗначения(МассивКлассов);
	КонецЕсли;
	СписокВыбора.Добавить(Справочники.Классы.ПустаяСсылка(), "Другие классы...");
	
	Объект.ОбъектыНоменклатуры = 
		УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначениеРеквизитаОбъекта(Объект.Класс, "ОбъектыНоменклатуры");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоместитьЗначенияАтрибутовСтрокВДанныеОбработки(ТекДанные, ОтменаРедактирования, ИДСтрокиРодителя, АтрибутКласса, ИДОбъекта, КолонкиДляИзменения=Неопределено)
	
	СтруктураПоиска = Новый Структура("ИДСтрокиРодителя, АтрибутКласса, ИДСтроки", 
		ИДСтрокиРодителя, АтрибутКласса, ТекДанные.ИДСтроки);
	
	НайденоЗначения = Объект.ЗначенияТабличныхАтрибутов.НайтиСтроки(СтруктураПоиска);
	Если КолонкиДляИзменения = Неопределено Тогда
		КолонкиДляИзменения  = КолонкиАтрибутовПодчиненныхОбъектов.НайтиСтроки(Новый Структура("ИДОбъекта", ИДОбъекта));
	КонецЕсли;
	// Чтение вложенных атрибутов.
	НайденоВложенныеАтрибуты = КолонкиАтрибутовПодчиненныхОбъектов.НайтиСтроки(Новый Структура("ИДОбъекта, ЭтоВложенныйАтрибут", ИДОбъекта, Истина));
	Если НайденоВложенныеАтрибуты.Количество() > 0 Тогда
		СоответствиеОбъектов        = Новый Соответствие;
		МассивВложенныхАтрибутов    = Новый Массив;
		МассивКлассовДляЧтения      = Новый Массив;
		МассивНоменклатурыДляЧтения = Новый Массив;
		
		Для Каждого СтрокаВложенныйАтрибут ИЗ НайденоВложенныеАтрибуты Цикл
			МассивВложенныхАтрибутов.Добавить(СтрокаВложенныйАтрибут.АтрибутКласса);
			Для Каждого КолонкаИсточник ИЗ КолонкиДляИзменения Цикл
				Если КолонкаИсточник.АтрибутКласса = СтрокаВложенныйАтрибут.ИсточникЗначений Тогда
					ОбъектИсточник = ТекДанные[КолонкаИсточник.ИмяКолонки];
					Если ЗначениеЗаполнено(ОбъектИсточник) И СоответствиеОбъектов[СтрокаВложенныйАтрибут.ИсточникЗначений] = Неопределено Тогда
						СоответствиеОбъектов.Вставить(СтрокаВложенныйАтрибут.ИсточникЗначений, ОбъектИсточник);
						Если ТипЗнч(ОбъектИсточник) = Тип("СправочникСсылка.Классы") Тогда
							МассивКлассовДляЧтения.Добавить(ОбъектИсточник);
						ИначеЕсли ТипЗнч(ОбъектИсточник) = Тип("СправочникСсылка.НоменклатураКласса") Тогда
							МассивНоменклатурыДляЧтения.Добавить(ОбъектИсточник);
						КонецЕсли;
					КонецЕсли;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		ЗначенияВложенныхАтрибутов = ПрочитатьЗначенияВложенныхАтрибутов(СоответствиеОбъектов,
			МассивКлассовДляЧтения, МассивНоменклатурыДляЧтения, МассивВложенныхАтрибутов);
	КонецЕсли;
	Для Каждого СтрокаКолонка ИЗ КолонкиДляИзменения Цикл
		Заполнено = Ложь;
		Если СтрокаКолонка.ЭтоВложенныйАтрибут Тогда
			Если НЕ ЗначенияВложенныхАтрибутов = Неопределено Тогда
				ЗначениеВложенногоАтрибута = ЗначенияВложенныхАтрибутов[СтрокаКолонка.АтрибутКласса];
			Иначе
				ЗначениеВложенногоАтрибута = Неопределено;
			КонецЕсли;
			
			ТекДанные[СтрокаКолонка.ИмяКолонки] = ЗначениеВложенногоАтрибута;
			
			Для Каждого СтрокаЗначение ИЗ НайденоЗначения Цикл
				Если СтрокаКолонка.АтрибутКласса = СтрокаЗначение.АтрибутТаблицы Тогда
					СтрокаЗначение.ЗначениеАтрибутаТаблицы = ЗначениеВложенногоАтрибута;
					Заполнено = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если НЕ Заполнено И ЗначениеЗаполнено(ЗначениеВложенногоАтрибута) Тогда
				СтрокаЗначение = Объект.ЗначенияТабличныхАтрибутов.Добавить();
				СтрокаЗначение.ИДСтрокиРодителя        = ИДСтрокиРодителя;
				СтрокаЗначение.АтрибутКласса           = АтрибутКласса;
				СтрокаЗначение.АтрибутТаблицы          = СтрокаКолонка.АтрибутКласса;
				СтрокаЗначение.ИДСтроки                = ТекДанные.ИДСтроки;
				СтрокаЗначение.ЗначениеАтрибутаТаблицы = ЗначениеВложенногоАтрибута;
			КонецЕсли;
			
		Иначе
			Для Каждого СтрокаЗначение ИЗ НайденоЗначения Цикл
				Если СтрокаКолонка.АтрибутКласса = СтрокаЗначение.АтрибутТаблицы Тогда
					Если ОтменаРедактирования Тогда
						// Восстановление предыдущих значений.
						ТекДанные[СтрокаКолонка.ИмяКолонки] = 
							СтрокаКолонка.ТипЗначения.ПривестиЗначение(СтрокаЗначение.ЗначениеАтрибутаТаблицы);
					Иначе
						// Сохранение новых значений.
						СтрокаЗначение.ЗначениеАтрибутаТаблицы = ТекДанные[СтрокаКолонка.ИмяКолонки];
					КонецЕсли;
					Заполнено = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если НЕ Заполнено Тогда
				Если ОтменаРедактирования Тогда
					// Восстановление предыдущих значений.
					ТекДанные[СтрокаКолонка.ИмяКолонки] = СтрокаКолонка.ТипЗначения.ПривестиЗначение();
				Иначе
					// Сохранение новых значений.
					СтрокаЗначение = Объект.ЗначенияТабличныхАтрибутов.Добавить();
					СтрокаЗначение.ИДСтрокиРодителя        = ИДСтрокиРодителя;
					СтрокаЗначение.АтрибутКласса           = АтрибутКласса;
					СтрокаЗначение.АтрибутТаблицы          = СтрокаКолонка.АтрибутКласса;
					СтрокаЗначение.ИДСтроки                = ТекДанные.ИДСтроки;
					СтрокаЗначение.ЗначениеАтрибутаТаблицы = ТекДанные[СтрокаКолонка.ИмяКолонки];
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПрочитатьЗначенияВложенныхАтрибутов(СоответствиеОбъектов, 
		МассивКлассовДляЧтения, МассивНоменклатурыДляЧтения, МассивВложенныхАтрибутов)
	
	Возврат Справочники.ВложенныеАтрибутыКласса.ПрочитатьЗначенияВложенныхАтрибутов(СоответствиеОбъектов, 
		МассивКлассовДляЧтения, МассивНоменклатурыДляЧтения, МассивВложенныхАтрибутов);
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПорядокСтрокТабличныхАтрибутов(ТаблицаФормы, ИДСтрокиРодителя, АтрибутКласса)
	
	// Настройка порядка строк.
	СоответствиеСтрок = Новый Соответствие;
	ТаблицаДерево = (ТипЗнч(ТаблицаФормы) = Тип("ДанныеФормыДерево"));
	Если ТаблицаДерево Тогда
		ЭлементыТаблицы = ТаблицаФормы.ПолучитьЭлементы();
	Иначе
		ЭлементыТаблицы = ТаблицаФормы;
	КонецЕсли;
	
	Для Каждого СтрокаТЧ ИЗ ЭлементыТаблицы Цикл
		СоответствиеСтрок.Вставить(СтрокаТЧ.ИДСтроки, ЭлементыТаблицы.Индекс(СтрокаТЧ));
	КонецЦикла;
	
	НайденоПорядок = Объект.СтрокиТабличныхАтрибутов.НайтиСтроки(
		Новый Структура("ИДСтрокиРодителя, АтрибутКласса", ИДСтрокиРодителя, АтрибутКласса));
	Для Каждого СтрокаПорядок ИЗ НайденоПорядок Цикл
		СтрокаПорядок.Порядок = СоответствиеСтрок[СтрокаПорядок.ИДСтроки];
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВложенныеСтрокиТабличногоАтрибута(ИДСтроки)
	
	СтруктураПоиска = Новый Структура("ИДСтрокиРодителя", ИДСтроки);
	
	Найдено = Объект.СтрокиТабличныхАтрибутов.НайтиСтроки(СтруктураПоиска);
	Для Каждого СтрокаНайдено ИЗ Найдено Цикл
		УдалитьВложенныеСтрокиТабличногоАтрибута(СтрокаНайдено.ИДСтроки);
		Объект.СтрокиТабличныхАтрибутов.Удалить(СтрокаНайдено);
	КонецЦикла;
	
	Найдено = Объект.ЗначенияТабличныхАтрибутов.НайтиСтроки(СтруктураПоиска);
	Для Каждого СтрокаНайдено ИЗ Найдено Цикл
		Объект.ЗначенияТабличныхАтрибутов.Удалить(СтрокаНайдено);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВыбранныеСтрокиТабличногоАтрибута(ТаблицаФормы, Выбраны, ИДСтрокиРодителя, АтрибутКласса)
	
	СтруктураПоиска = Новый Структура("ИДСтрокиРодителя, АтрибутКласса, ИДСтроки", ИДСтрокиРодителя, АтрибутКласса);
	
	КолВоУдалено = 0;
	
	ТаблицаДерево = (ТипЗнч(ТаблицаФормы) = Тип("ДанныеФормыДерево"));
	Если ТаблицаДерево Тогда
		ЭлементыДерева = ТаблицаФормы.ПолучитьЭлементы();
	КонецЕсли;
	
	Для Каждого ИДСтроки ИЗ Выбраны Цикл
		СтрокаКУдалению = ТаблицаФормы.НайтиПоИдентификатору(ИДСтроки);
		
		СтруктураПоиска.ИДСтроки = СтрокаКУдалению.ИДСтроки;
		
		Найдено = Объект.СтрокиТабличныхАтрибутов.НайтиСтроки(СтруктураПоиска);
		Если Найдено.Количество() > 0 Тогда
			Объект.СтрокиТабличныхАтрибутов.Удалить(Найдено[0]);
		КонецЕсли;
		
		Найдено = Объект.ЗначенияТабличныхАтрибутов.НайтиСтроки(СтруктураПоиска);
		Для Каждого СтрокаЗначение ИЗ Найдено Цикл
			Объект.ЗначенияТабличныхАтрибутов.Удалить(СтрокаЗначение);
		КонецЦикла;
		
		УдалитьВложенныеСтрокиТабличногоАтрибута(СтруктураПоиска.ИДСтроки);
		
		Если ТаблицаДерево Тогда
			ЭлементыДерева.Удалить(СтрокаКУдалению);
		Иначе
			ТаблицаФормы.Удалить(СтрокаКУдалению);
		КонецЕсли;
		
		КолВоУдалено = КолВоУдалено + 1;
		
	КонецЦикла;
	
	Если КолВоУдалено > 0 Тогда
		ЗаполнитьПорядокСтрокТабличныхАтрибутов(ТаблицаФормы, ИДСтрокиРодителя, АтрибутКласса);
		ПодключитьОбработчикОжидания("ПодключаемыйУстановитьЭлементУправленияРедактированием", 0.1, Истина);
	Иначе
		ТекстСообщения = НСтр("ru='Удаление унаследованных строк таб.части недоступно.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьКолонкиАтрибутовПодчиненныхОбъектов(ИДОбъекта, ИмяТаблицы)
	
	Найдено = КолонкиАтрибутовПодчиненныхОбъектов.НайтиСтроки(Новый Структура("ИДОбъекта", ИДОбъекта));
	МассивУдаляемых = Новый Массив;
	Для Каждого СтрокаКолонка ИЗ Найдено Цикл
		Если НЕ ПустаяСтрока(СтрокаКолонка.ИмяКолонки) Тогда
			МассивУдаляемых.Добавить(ИмяТаблицы + "." + СтрокаКолонка.ИмяКолонки);
			Элементы.Удалить(Элементы[СтрокаКолонка.ИмяПоля]);
		КонецЕсли;
		КолонкиАтрибутовПодчиненныхОбъектов.Удалить(СтрокаКолонка);
	КонецЦикла;
	
	ИзменитьРеквизиты(, МассивУдаляемых);
	
КонецПроцедуры

&НаКлиенте 
Процедура АтрибутПодчиненногоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НайденоСтроки = КолонкиАтрибутовПодчиненныхОбъектов.НайтиСтроки(Новый Структура("ИмяПоля", Элемент.Имя));
	Если НайденоСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТипОбъектНоменклатуры = Тип("СправочникСсылка.ОбъектыНоменклатуры");
	ТипНоменклатураКласса = Тип("СправочникСсылка.НоменклатураКласса");
	ТипКлассы             = Тип("СправочникСсылка.Классы");
	
	СтрокаАтрибута = НайденоСтроки[0];
	
	ЭтоОбъектНоменклатуры = СтрокаАтрибута.ТипЗначения.СодержитТип(ТипОбъектНоменклатуры);
	ЭтоНоменклатураКласса = СтрокаАтрибута.ТипЗначения.СодержитТип(ТипНоменклатураКласса);
	ЭтоКласс              = СтрокаАтрибута.ТипЗначения.СодержитТип(ТипКлассы);
	
	Если ЭтоКласс ИЛИ ЭтоНоменклатураКласса ИЛИ ЭтоОбъектНоменклатуры Тогда
		
		ТипИсточника  = ?(ЗначениеЗаполнено(СтрокаАтрибута.ИсточникЗначений), ТипЗнч(СтрокаАтрибута.ИсточникЗначений), Неопределено);
		ИсточникКласс = (ТипИсточника = ТипКлассы);
		ИсточникНоменклатура = (ТипИсточника = ТипНоменклатураКласса);
		СоставнойТип = (ЭтоНоменклатураКласса И ИсточникКласс
				ИЛИ ЭтоОбъектНоменклатуры И ИсточникКласс);
		
		Если НЕ СтрокаАтрибута.СписокДоступныхЗначений Тогда
			Если НЕ СоставнойТип Тогда
				Если ЭтоНоменклатураКласса И ИсточникКласс Тогда
					СтандартнаяОбработка = Ложь;
					
					ПараметрыОтбора = Новый Структура("Класс, ЭтоГруппа", СтрокаАтрибута.ИсточникЗначений, Ложь);
					
					ПараметрыВыбора = Новый Структура();
					ПараметрыВыбора.Вставить("Отбор", ПараметрыОтбора);
					
					ФормаВыбора = ПолучитьФорму("Справочник.НоменклатураКласса.ФормаВыбора", ПараметрыВыбора, Элемент, УникальныйИдентификатор);
					ФормаВыбора.Элементы.Список.Отображение = ОтображениеТаблицы.Список;
					
					ФормаВыбора.Открыть();
				КонецЕсли;
			Иначе
				Если ЭтоНоменклатураКласса И ИсточникКласс Тогда
					СтандартнаяОбработка = Ложь;
					
					ФормаВыбора = ПолучитьФорму("Справочник.НоменклатураКласса.ФормаВыбора", , Элемент, УникальныйИдентификатор);
					
					УправлениеНСИФункцииКлиентСерверПереопределяемый.УстановитьЭлементОтбораДинамическогоСписка(ФормаВыбора.Список, 
						"Класс", СтрокаАтрибута.ИсточникЗначений, ВидСравненияКомпоновкиДанных.ВИерархии,, Истина);
					ФормаВыбора.Элементы.Список.РодительВерхнегоУровня = 
						ПолучитьРодителяПоКлассу(СтрокаАтрибута.ИсточникЗначений);
					
					ФормаВыбора.Открыть();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АтрибутПодчиненногоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	КолонкиДляИзменения = КолонкиАтрибутовПодчиненныхОбъектов.НайтиСтроки(Новый Структура("ИмяПоля", Элемент.Имя));
	Если КолонкиДляИзменения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	РодительСоставТехКарты = (Элемент.Родитель.Имя = "СоставТехКарты");
	РодительТехКарты = (Элемент.Родитель.Имя = "ТехКарты");
	
	// Обработка только для подчиненных табличных частей.
	Если НЕ РодительТехКарты И НЕ РодительСоставТехКарты Тогда
		Возврат;
	КонецЕсли;
	
	Если РодительСоставТехКарты Тогда
		
		ТекДанныеТехКарты = Элементы.ТехКарты.ТекущиеДанные;
		Если ТекДанныеТехКарты = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ТекДанные = Элементы.СоставТехКарты.ТекущиеДанные;
		
		ИДСтрокиРодителя = ТекДанныеТехКарты.ИДСтроки;
		ИДОбъекта        = 0;
		
		Атрибут = ПредопределенноеЗначение("ПланВидовХарактеристик.АтрибутыКласса.ТехОперации");
		ИсточникЗначений = ?(ТекДанные.ТипСтроки = 0,
				ПредопределенноеЗначение("Справочник.Классы.СтрокиТехОпераций"),
				ПредопределенноеЗначение("Справочник.Классы.ВложенныеТехКарты"));
		
	ИначеЕсли РодительТехКарты Тогда
		
		ТекДанные = Элементы.ТехКарты.ТекущиеДанные;
		
		ИДСтрокиРодителя = 0;
		ИДОбъекта        = 1;
		
		Атрибут = ПредопределенноеЗначение("ПланВидовХарактеристик.АтрибутыКласса.ТехКарты");
		ИсточникЗначений = ПредопределенноеЗначение("Справочник.Классы.ТехнологическиеКарты");
		
	КонецЕсли;
	
	ТекДанные[КолонкиДляИзменения[0].ИмяКолонки] = ВыбранноеЗначение;
		
	СтруктураПоиска = Новый Структура(
		"ИДСтрокиРодителя, АтрибутКласса, ИДСтроки", ИДСтрокиРодителя, Атрибут, ТекДанные.ИДСтроки);
	НайденоСтроки = Объект.СтрокиТабличныхАтрибутов.НайтиСтроки(СтруктураПоиска);
		
	Если НайденоСтроки.Количество() > 0 Тогда
		СтрокаТабличногоАтрибута = НайденоСтроки[0];
	Иначе
		СтрокаТабличногоАтрибута = Объект.СтрокиТабличныхАтрибутов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТабличногоАтрибута, СтруктураПоиска);
		СтрокаТабличногоАтрибута.ИсточникЗначений = ИсточникЗначений;
	КонецЕсли;
		
	ЗаполнитьЗначенияСвойств(СтрокаТабличногоАтрибута, ТекДанные, "ИДСтроки, Наименование, СтатусНаследования");
	СтрокаТабличногоАтрибута.АтрибутКласса = Атрибут;
	СтрокаТабличногоАтрибута.Порядок       = ЗначениеТабличногоАтрибута.Индекс(ТекДанные);
	
	ПоместитьЗначенияАтрибутовСтрокВДанныеОбработки(
		ТекДанные, Ложь, ИДСтрокиРодителя, Атрибут, ИДОбъекта, КолонкиДляИзменения);
	
	Если РодительТехКарты Тогда
		АтрибутТипТехкарты = ПредопределенноеЗначение("ПланВидовХарактеристик.АтрибутыКласса.ТипТехКарты");
		СоответствиеКолонок = ПолучитьСоответствиеКолонокПодчиненныхОбъектов(1, КолонкиАтрибутовПодчиненныхОбъектов);
		СтрокаКолонка = СоответствиеКолонок[АтрибутТипТехкарты];
		ТипТехКарты = ТекДанные[СтрокаКолонка.ИмяКолонки];
		Если ЗначениеЗаполнено(ТипТехКарты) Тогда
			ТекДанные.НаименованиеТипа = Строка(ТипТехКарты);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПоказатьАтрибутыПоНастройке(Элементы, ТекПозицияПрокруткиАтрибутов, КолВоАтрибутов, МаксКолВоАтрибутов)
	
	Если МаксКолВоАтрибутов = 0 Тогда
		ТекПозицияПрокруткиАтрибутов = 1;
	ИначеЕсли ТекПозицияПрокруткиАтрибутов < 1 Тогда
		ТекПозицияПрокруткиАтрибутов = 1;
	ИначеЕсли КолВоАтрибутов - ТекПозицияПрокруткиАтрибутов <= МаксКолВоАтрибутов Тогда
		ТекПозицияПрокруткиАтрибутов = КолВоАтрибутов - МаксКолВоАтрибутов + 1;
	КонецЕсли;
	
	Элементы.ДекорацияЭлементыВыше.Видимость = (ТекПозицияПрокруткиАтрибутов > 1);
	
	ЭлементыНеУчитывать = "ДекорацияЭлементыВыше, ДекорацияНетАтрибутов, ДекорацияЭлементыНиже";
	
	Индекс = 0;
	
	Для Каждого Элемент ИЗ Элементы Цикл 
		Если Найти(ЭлементыНеУчитывать, Элемент.Имя) > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Индекс = Индекс + 1;
		
		Элемент.Видимость = (МаксКолВоАтрибутов = 0) ИЛИ НЕ (Индекс < ТекПозицияПрокруткиАтрибутов ИЛИ 
			Индекс - ТекПозицияПрокруткиАтрибутов >= МаксКолВоАтрибутов);
		
	КонецЦикла;
	
	Элементы.ДекорацияЭлементыНиже.Видимость = (МаксКолВоАтрибутов > 0) 
		И (Индекс - ТекПозицияПрокруткиАтрибутов > МаксКолВоАтрибутов);
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьКолонкиАтрибутовПодчиненныхОбъектов(ИДОбъекта, ИмяТаблицы, ТаблицаАтрибутов, Знач ИмяЭлемента="")
	
	КолонкиТаблицы = ТаблицаАтрибутов.Колонки;
	ЕстьСтатусНаследования  = НЕ (КолонкиТаблицы.Найти("СтатусНаследования") = Неопределено);
	ЕстьКлассТабличнаяЧасть = НЕ (КолонкиТаблицы.Найти("КлассТабличнаяЧасть") = Неопределено);
	
	Если ИмяЭлемента = "" Тогда
		ИмяЭлемента = ИмяТаблицы;
	КонецЕсли;
	
	ТипСтрока = Тип("Строка");
	
	Н = 1;
	МассивДобавляемых = Новый Массив;
	Для Каждого СтрокаКолонки ИЗ ТаблицаАтрибутов Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаКолонки.ТипЗначения) И ЗначениеЗаполнено(СтрокаКолонки.ТипЗначенияРеквизита) Тогда
			СтрокаКолонки.ТипЗначения = ЗначениеИзСтрокиВнутр(СтрокаКолонки.ТипЗначенияРеквизита);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаКолонки.ТипЗначения) Тогда
			Продолжить;
		КонецЕсли;
		
		ЭтоНенаследуемый = ЕстьСтатусНаследования И СтрокаКолонки.СтатусНаследования > 3;
		ЭтоСтрока = СтрокаКолонки.ТипЗначения.СодержитТип(ТипСтрока);
		Если ЭтоНенаследуемый ИЛИ НЕ ЭтоСтрока И СтрокаКолонки.МножественноеЗначение Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаКолонки.ИмяКолонки) Тогда
			ИмяРеквизита = ИмяТаблицы + "Атрибут" + Н;
			НовыйРеквизит = Новый РеквизитФормы(
				ИмяРеквизита, СтрокаКолонки.ТипЗначения, ИмяТаблицы, Строка(СтрокаКолонки.АтрибутКласса));
			МассивДобавляемых.Добавить(НовыйРеквизит);
			СтрокаКолонки.ИмяКолонки = ИмяРеквизита;
		Иначе
			ИмяРеквизита = СтрокаКолонки.ИмяКолонки;
		КонецЕсли;
		
		СтрокаТЧ = КолонкиАтрибутовПодчиненныхОбъектов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаКолонки);
		СтрокаТЧ.ИмяПоля = ИмяЭлемента + ИмяРеквизита;
		СтрокаТЧ.ИДОбъекта = ИДОбъекта;
		СтрокаТЧ.ЭтоВложенныйАтрибут = (ТипЗнч(СтрокаТЧ.АтрибутКласса) = Тип("СправочникСсылка.ВложенныеАтрибутыКласса"));
		
		Н = Н + 1;
	КонецЦикла;
	
	ИзменитьРеквизиты(МассивДобавляемых);
	
	Для Каждого СтрокаКолонки ИЗ ТаблицаАтрибутов Цикл
		Если ПустаяСтрока(СтрокаКолонки.ИмяКолонки) Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяПоля = ИмяЭлемента + СтрокаКолонки.ИмяКолонки;
		
		Найдено = Элементы.Найти(ИмяПоля);
		Если Не Найдено = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйЭлемент = Элементы.Добавить(ИмяПоля, Тип("ПолеФормы"), Элементы[ИмяЭлемента]);
		НовыйЭлемент.Вид         = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = ИмяТаблицы + "." + СтрокаКолонки.ИмяКолонки;
		НовыйЭлемент.Заголовок   = Строка(СтрокаКолонки.АтрибутКласса);
		НовыйЭлемент.Видимость   = Истина;
		НовыйЭлемент.Ширина      = 14;
		НовыйЭлемент.ТолькоПросмотр = (ТипЗнч(СтрокаКолонки.АтрибутКласса) = Тип("СправочникСсылка.ВложенныеАтрибутыКласса"));
		
		Если СтрокаКолонки.РежимЗаполнения = Перечисления.РежимыЗаполненияАтрибутов.ОбязательныйДляНоменклатуры Тогда
			НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;
		КонецЕсли;
		
		НовыйЭлемент.УстановитьДействие("НачалоВыбора", "АтрибутПодчиненногоНачалоВыбора");
		НовыйЭлемент.УстановитьДействие("ОбработкаВыбора", "АтрибутПодчиненногоОбработкаВыбора");
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСоответствиеКолонокПодчиненныхОбъектов(ИДОбъекта, КолонкиАтрибутовПодчиненныхОбъектов)
	Результат = Новый Соответствие;
	Найдено = КолонкиАтрибутовПодчиненныхОбъектов.НайтиСтроки(Новый Структура("ИДОбъекта", ИДОбъекта));
	Для Каждого СтрокаКолонка ИЗ Найдено Цикл
		Результат.Вставить(СтрокаКолонка.АтрибутКласса, СтрокаКолонка);
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ВывестиТаблицуВложенногоАтрибута(Знач ТаблицаФормы, ИДСтрокиРодителя, АтрибутКласса, ИДОбъекта)
	
	ТаблицаФормы = ЭтаФорма[ТаблицаФормы];
	
	СтруктураПоиска = Новый Структура("ИДСтрокиРодителя, АтрибутКласса", ИДСтрокиРодителя, АтрибутКласса);
	ТаблицаСтрок = Объект.СтрокиТабличныхАтрибутов.Выгрузить(СтруктураПоиска);
	ТаблицаСтрок.Сортировать("Порядок");
	ТаблицаФормы.Загрузить(ТаблицаСтрок);
	
	СоответствиеСтрокТабличногоАтрибута = Новый Соответствие;
	Для Каждого СтрокаТЗ ИЗ ТаблицаФормы Цикл
		СоответствиеСтрокТабличногоАтрибута.Вставить(СтрокаТЗ.ИДСтроки, СтрокаТЗ);
	КонецЦикла;
	
	// Заполнение колонок таб.части.
	Объект.ЗначенияТабличныхАтрибутов.Сортировать("ИДСтрокиРодителя, АтрибутКласса, ИДСтроки");
	НайденоЗначения = Объект.ЗначенияТабличныхАтрибутов.НайтиСтроки(СтруктураПоиска);
	
	СоответствиеКолонок = ПолучитьСоответствиеКолонокПодчиненныхОбъектов(ИДОбъекта, КолонкиАтрибутовПодчиненныхОбъектов);
	
	Для Каждого СтрокаЗначение ИЗ НайденоЗначения Цикл
		СтрокаТЧ = СоответствиеСтрокТабличногоАтрибута[СтрокаЗначение.ИДСтроки];
		Если СтрокаТЧ = Неопределено Тогда
			СтрокаТЧ = ТаблицаФормы.Добавить();
			СтрокаТЧ.ИДСтроки = СтрокаЗначение.ИДСтроки;
			СоответствиеСтрокТабличногоАтрибута.Вставить(СтрокаЗначение.ИДСтроки, СтрокаТЧ);
		КонецЕсли;
		
		СтрокаКолонка = СоответствиеКолонок[СтрокаЗначение.АтрибутТаблицы];
		Если НЕ СтрокаКолонка = Неопределено Тогда
			СтрокаТЧ[СтрокаКолонка.ИмяКолонки] = 
				СтрокаКолонка.ТипЗначения.ПривестиЗначение(СтрокаЗначение.ЗначениеАтрибутаТаблицы);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиЗначенияТабличногоАтрибутаНаСервере(АтрибутКласса)
	
	// Подготовка колонок.
	СтруктураПоиска = Новый Структура("АтрибутКласса", АтрибутКласса);
	Найдено = ПоляАтрибутовКласса.НайтиСтроки(СтруктураПоиска);
	Если Найдено.Количество() > 0 Тогда
		ИсточникЗначений = Найдено[0].ИсточникЗначений;
		Элементы.ЗначениеТабличногоАтрибута.ИзменятьСоставСтрок = 
			Найдено[0].ДобавлениеСтрокТабЧастиВНоменклатуреКласса;
	КонецЕсли;
	
	ТекСписокРодителей = Справочники.Классы.ПолучитьТаблицуРодителей(ИсточникЗначений);
	
	ТаблицаАтрибутов   = Справочники.Классы.ПолучитьТаблицуАтрибутов(ТекСписокРодителей);
	ТаблицаАтрибутов.Колонки.Добавить("ИмяКолонки", Новый ОписаниеТипов("Строка"));
	
	УдалитьКолонкиАтрибутовПодчиненныхОбъектов(2, "ЗначениеТабличногоАтрибута");
	ПодготовитьКолонкиАтрибутовПодчиненныхОбъектов(2, "ЗначениеТабличногоАтрибута", ТаблицаАтрибутов);
	
	// Заполнение строк таб.части.
	ВывестиТаблицуВложенногоАтрибута("ЗначениеТабличногоАтрибута", 0, АтрибутКласса, 2);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьКодПоШаблонуНаСервере()
	
	НомерПоСчетчику = Объект.НомерПоСчетчику;
	ШагСчетчика     = Объект.ШагСчетчика;
	
	Отказ = Ложь;
	Если НЕ Объект.ПрисвоенНомерПоШаблону Тогда
		НомерПоСчетчику = 0;
	КонецЕсли;
	
	НовыйКод = ШаблоныСтрокСервер.СформироватьЗначениеПоШаблону(
		Объект.НоменклатураКласса.Ссылка, Объект.ШаблонКодаРодителя, НомерПоСчетчику, ШагСчетчика, Отказ);
	Если НЕ Отказ Тогда
		Объект.Код             = НовыйКод;
		Объект.НомерПоСчетчику = НомерПоСчетчику;
		Объект.ШагСчетчика     = ШагСчетчика;
		Объект.ПрисвоенНомерПоШаблону = Истина;
		
		Модифицированность = Истина;
		УстановитьЭлементыУправленияРедактированием(Элементы, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиСоставТехКартыНаСервере(ТехКарта)
	
	Если ТехКарта = Неопределено Тогда
		СоставТехКарты.ПолучитьЭлементы().Очистить();
		Возврат;
	КонецЕсли;
	
	ДеревоСоставТехКарты = РеквизитФормыВЗначение("СоставТехКарты");
	ДеревоСоставТехКарты.Строки.Очистить();
	
	Объект.СтрокиТабличныхАтрибутов.Сортировать("ИДСтрокиРодителя, АтрибутКласса, Порядок");
	СтруктураПоиска = Новый Структура("ИДСтрокиРодителя", ТехКарта);
	НайденоСтроки = Объект.СтрокиТабличныхАтрибутов.НайтиСтроки(СтруктураПоиска);
	
	СоответствиеСтрокТабличногоАтрибута = Новый Соответствие;
	
	СтруктураПоискаПоТипам = Новый Структура("СтрокаОпераций");
	
	Для Каждого СтрокаОперация ИЗ НайденоСтроки Цикл
		СтрокаСостава = ДеревоСоставТехКарты.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСостава, СтрокаОперация);
		СоответствиеСтрокТабличногоАтрибута.Вставить(СтрокаОперация.ИДСтроки, СтрокаСостава);
		
		СтруктураПоискаПоТипам.СтрокаОпераций = ?(ЗначениеЗаполнено(СтрокаОперация.ЗначениеАтрибутаКласса),
			СтрокаОперация.ЗначениеАтрибутаКласса, СтрокаОперация.ИсточникЗначений);
		НайденоТипы = ТипыСтрок.НайтиСтроки(СтруктураПоискаПоТипам);
		Если НайденоТипы.Количество() > 0 Тогда
			СтрокаСостава.ТипСтроки = НайденоТипы[0].ТипСтроки;
		КонецЕсли;
	КонецЦикла;
	
	// Заполнение таб.части.
	Объект.ЗначенияТабличныхАтрибутов.Сортировать("ИДСтрокиРодителя, АтрибутКласса, ИДСтроки");
	НайденоЗначения = Объект.ЗначенияТабличныхАтрибутов.НайтиСтроки(СтруктураПоиска);
	
	СоответствиеКолонок = ПолучитьСоответствиеКолонокПодчиненныхОбъектов(0, КолонкиАтрибутовПодчиненныхОбъектов);
	
	ТипОбъектНоменклатуры = Тип("СправочникСсылка.ОбъектыНоменклатуры");
	ТипНоменклатураКласса = Тип("СправочникСсылка.НоменклатураКласса");
	ТипКласс = Тип("СправочникСсылка.Классы");
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(ТипОбъектНоменклатуры);
	МассивТипов.Добавить(ТипНоменклатураКласса);
	МассивТипов.Добавить(ТипКласс);
	
	Для Каждого СтрокаЗначение ИЗ НайденоЗначения Цикл
		СтрокаТЧ = СоответствиеСтрокТабличногоАтрибута[СтрокаЗначение.ИДСтроки];
		Если СтрокаТЧ = Неопределено Тогда
			СтрокаТЧ = ДеревоСоставТехКарты.Строки.Добавить();
			СтрокаТЧ.ИДСтроки = СтрокаЗначение.ИДСтроки;
			СоответствиеСтрокТабличногоАтрибута.Вставить(СтрокаЗначение.ИДСтроки, СтрокаТЧ);
		КонецЕсли;
		
		СтрокаКолонка = СоответствиеКолонок[СтрокаЗначение.АтрибутТаблицы];
		Если НЕ СтрокаКолонка = Неопределено Тогда
			СоставнойТип = (СтрокаКолонка.ТипЗначения.СодержитТип(ТипНоменклатураКласса) 
				ИЛИ СтрокаКолонка.ТипЗначения.СодержитТип(ТипОбъектНоменклатуры));
			ЭтоЭлементСоставногоТипа = СоставнойТип 
				И НЕ (МассивТипов.Найти(ТипЗнч(СтрокаЗначение.ЗначениеАтрибутаТаблицы)) = Неопределено);
			СтрокаТЧ[СтрокаКолонка.ИмяКолонки] = ?(СоставнойТип И ЭтоЭлементСоставногоТипа,
				СтрокаЗначение.ЗначениеАтрибутаТаблицы,
				СтрокаКолонка.ТипЗначения.ПривестиЗначение(СтрокаЗначение.ЗначениеАтрибутаТаблицы));
		КонецЕсли;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоСоставТехКарты, "СоставТехКарты");
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьТехОперацию(Выбраны, УдалитьИзДерева=Ложь)
	
	Отказ = Истина;
	ТекДанныеТехКарты = Элементы.ТехКарты.ТекущиеДанные;
	Если ТекДанныеТехКарты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьВыбранныеСтрокиТабличногоАтрибута(СоставТехКарты, Выбраны, ТекДанныеТехКарты.ИДСтроки, 
		ПредопределенноеЗначение("ПланВидовХарактеристик.АтрибутыКласса.ТехОперации"));
	
	Если УдалитьИзДерева Тогда
		ЭлементыДерева = СоставТехКарты.ПолучитьЭлементы();
		Для Каждого ИДСтроки ИЗ Выбраны Цикл
			СтрокаКУдалению = СоставТехКарты.НайтиПоИдентификатору(ИДСтроки);
				ЭлементыДерева.Удалить(СтрокаКУдалению);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере 
Функция ТекстЗапросаТипыСтрок()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Классы.Ссылка КАК СтрокаОпераций,
		|	0 КАК ТипСтроки
		|ИЗ
		|	Справочник.Классы КАК Классы
		|ГДЕ
		|	Классы.Ссылка В(&ЗначенияСтрок)
		|	И Классы.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.Классы.СтрокиТехОпераций))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Классы.Ссылка,
		|	1
		|ИЗ
		|	Справочник.Классы КАК Классы
		|ГДЕ
		|	Классы.Ссылка В(&ЗначенияСтрок)
		|	И Классы.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.Классы.ВложенныеТехКарты))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НоменклатураКласса.Ссылка,
		|	0
		|ИЗ
		|	Справочник.НоменклатураКласса КАК НоменклатураКласса
		|ГДЕ
		|	НоменклатураКласса.Ссылка В(&ЗначенияСтрок)
		|	И НоменклатураКласса.Класс В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.Классы.СтрокиТехОпераций))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НоменклатураКласса.Ссылка,
		|	1
		|ИЗ
		|	Справочник.НоменклатураКласса КАК НоменклатураКласса
		|ГДЕ
		|	НоменклатураКласса.Ссылка В(&ЗначенияСтрок)
		|	И НоменклатураКласса.Класс В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.Классы.ВложенныеТехКарты))";
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Процедура ВывестиТехкартыНаСервере()
	
	ВывестиТаблицуВложенногоАтрибута("ТехКарты", 0, ПланыВидовХарактеристик.АтрибутыКласса.ТехКарты, 1);
	
	// Заполним наиментвание типа тех.карты.
	СоответствиеКолонок = ПолучитьСоответствиеКолонокПодчиненныхОбъектов(1, КолонкиАтрибутовПодчиненныхОбъектов);
	АтрибутТипТХ = ПланыВидовХарактеристик.АтрибутыКласса.ТипТехКарты;
	СтрокаКолонка = СоответствиеКолонок[АтрибутТипТХ];
	Для Каждого СтрокаТЧ ИЗ ТехКарты Цикл
		СтрокаТЧ.НаименованиеТипа = Строка(СтрокаТЧ[СтрокаКолонка.ИмяКолонки]);
	КонецЦикла;
	
	//// Операции, доступные для подбора.
	//ВывесиДоступныеОперацииНаСервере();
	
	// Типы строк операций.
	ЗначенияСтрок = Объект.СтрокиТабличныхАтрибутов.Выгрузить(Новый Структура("АтрибутКласса", 
		ПланыВидовХарактеристик.АтрибутыКласса.ТехОперации), "ИсточникЗначений, ЗначениеАтрибутаКласса");
	Для Каждого СтрокаТЗ ИЗ ЗначенияСтрок Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТЗ.ЗначениеАтрибутаКласса) Тогда
			СтрокаТЗ.ЗначениеАтрибутаКласса = СтрокаТЗ.ИсточникЗначений;
		КонецЕсли;
	КонецЦикла;
	ЗначенияСтрок = ЗначенияСтрок.ВыгрузитьКолонку("ЗначениеАтрибутаКласса");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗначенияСтрок", ЗначенияСтрок);
	Запрос.Текст = ТекстЗапросаТипыСтрок();
	ЗначениеВРеквизитФормы(Запрос.Выполнить().Выгрузить(), "ТипыСтрок");
	
	ТекТехКарта = -1;
	ТекОперация = -1;
	
	// Таб.части операций.
	ПодготовитьВложеннуюТаблицуТехкарт();
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьТаблицуВложенногоАтрибута(ИсточникЗначений, ИмяЭлемента)
	
	ТекСписокРодителей = Справочники.Классы.ПолучитьТаблицуРодителей(ИсточникЗначений);
	ТаблицаАтрибутов   = Справочники.Классы.ПолучитьТаблицуАтрибутов(ТекСписокРодителей);
	ТаблицаАтрибутов.Колонки.Добавить("ИмяКолонки", Новый ОписаниеТипов("Строка"));
	
	УдалитьКолонкиАтрибутовПодчиненныхОбъектов(2, "ЗначениеТабличногоАтрибута");
	ПодготовитьКолонкиАтрибутовПодчиненныхОбъектов(2, "ЗначениеТабличногоАтрибута", ТаблицаАтрибутов, ИмяЭлемента);
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьВложеннуюТаблицуТехкарт()
	
	Если ТекТаблицаТехКарты = ПланыВидовХарактеристик.АтрибутыКласса.ТехОперации Тогда
		ТипОбъекта = 1;
		ТекТаблицаНаВывод    = "ТекТаблицаОперации";
		ПереключательТаблицы = "ПереключательТабличныхАтрибутовОпераций";
		ИмяЭлементаТаблицы   = "ЗначениеТабличногоАтрибутаОперации";
	Иначе
		ТипОбъекта = 2;
		ТекТаблицаНаВывод    = "ТекТаблицаТехКарты";
		ПереключательТаблицы = "ПереключательТабличныхАтрибутовТехКарт";
		ИмяЭлементаТаблицы   = "ЗначениеТабличногоАтрибутаТехКарты";
	КонецЕсли;
	
	НайденоТабЧасти = СписочныеАтрибуты.НайтиСтроки(Новый Структура("ТипОбъекта", ТипОбъекта));
	Если НайденоТабЧасти.Количество() > 0 Тогда
		ИсточникЗначений = Неопределено;
		ДобавлениеСтрок = Ложь;
		// Поиск таблицы на вывод.
		Если ЗначениеЗаполнено(ЭтаФорма[ТекТаблицаНаВывод]) Тогда
			Для Каждого СтрокаАтрибут ИЗ НайденоТабЧасти Цикл
				Если СтрокаАтрибут.АтрибутКласса = ЭтаФорма[ТекТаблицаНаВывод] Тогда
					ИсточникЗначений = СтрокаАтрибут.ИсточникЗначений;
					ДобавлениеСтрок = СтрокаАтрибут.ДобавлениеСтрокТабЧастиВНоменклатуреКласса;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		// Если таблица на вывод не найдена, выберем первую вложенную таблицу.
		Если ИсточникЗначений = Неопределено Тогда
			ЭтаФорма[ТекТаблицаНаВывод]    = НайденоТабЧасти[0].АтрибутКласса;
			ИсточникЗначений               = НайденоТабЧасти[0].ИсточникЗначений;
			ЭтаФорма[ПереключательТаблицы] = НайденоТабЧасти[0].ИДАтрибута;
		КонецЕсли;
		Элементы[ИмяЭлементаТаблицы].ИзменятьСоставСтрок = ДобавлениеСтрок;
		ПодготовитьТаблицуВложенногоАтрибута(ИсточникЗначений, ИмяЭлементаТаблицы);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицыАтрибутовТехкарт()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА НазначениеАтрибутов.Класс В (ЗНАЧЕНИЕ(Справочник.Классы.СтрокиТехОпераций), ЗНАЧЕНИЕ(Справочник.Классы.ВложенныеТехКарты))
		|			ТОГДА 0
		|		КОГДА НазначениеАтрибутов.Класс = ЗНАЧЕНИЕ(Справочник.Классы.ТехнологическиеКарты)
		|			ТОГДА 1
		|	КОНЕЦ КАК ИДОбъекта,
		|	НазначениеАтрибутов.АтрибутКласса,
		|	ВЫБОР
		|		КОГДА НазначениеАтрибутов.АтрибутКласса ССЫЛКА ПланВидовХарактеристик.АтрибутыКласса
		|			ТОГДА АтрибутыКласса.ТипЗначения
		|		КОГДА НазначениеАтрибутов.АтрибутКласса ССЫЛКА Справочник.ВложенныеАтрибутыКласса
		|				И ВложенныеАтрибутыКласса.АтрибутКласса ССЫЛКА ПланВидовХарактеристик.АтрибутыКласса
		|			ТОГДА ВЫРАЗИТЬ(ВложенныеАтрибутыКласса.АтрибутКласса КАК ПланВидовХарактеристик.АтрибутыКласса).ТипЗначения
		|	КОНЕЦ КАК ТипЗначения,
		|	НазначениеАтрибутов.МинЗначение,
		|	НазначениеАтрибутов.МаксЗначение,
		|	НазначениеАтрибутов.РежимЗаполнения,
		|	НазначениеАтрибутов.РежимИспользования,
		|	НазначениеАтрибутов.Формат,
		|	ВЫБОР
		|		КОГДА НазначениеАтрибутов.АтрибутКласса ССЫЛКА ПланВидовХарактеристик.АтрибутыКласса
		|			ТОГДА НазначениеАтрибутов.ИсточникЗначений
		|		КОГДА НазначениеАтрибутов.АтрибутКласса ССЫЛКА Справочник.ВложенныеАтрибутыКласса
		|			ТОГДА ВложенныеАтрибутыКласса.Источник
		|	КОНЕЦ КАК ИсточникЗначений,
		|	ВЫБОР
		|		КОГДА НазначениеАтрибутов.АтрибутКласса ССЫЛКА Справочник.ВложенныеАтрибутыКласса
		|				И ВложенныеАтрибутыКласса.АтрибутКласса ССЫЛКА Перечисление.РеквизитыКлассаНоменклатуры
		|			ТОГДА ВложенныеАтрибутыКласса.АтрибутКласса
		|	КОНЕЦ КАК ВложенныйРеквизит,
		|	НазначениеАтрибутов.СписокДоступныхЗначений,
		|	НазначениеАтрибутов.МножественноеЗначение,
		|	НазначениеАтрибутов.ДобавлениеСтрокТабЧастиВНоменклатуреКласса,
		|	НазначениеАтрибутов.Порядок КАК Порядок,
		|	ВЫБОР
		|		КОГДА НазначениеАтрибутов.АтрибутКласса = ЗНАЧЕНИЕ(ПланВидовХарактеристик.АтрибутыКласса.ТипТехКарты)
		|			ТОГДА ""ТипТехКарты""
		|		КОГДА НазначениеАтрибутов.АтрибутКласса = ЗНАЧЕНИЕ(ПланВидовХарактеристик.АтрибутыКласса.ВидОперации)
		|			ТОГДА ""ВидОперации""
		|		КОГДА НазначениеАтрибутов.АтрибутКласса = ЗНАЧЕНИЕ(ПланВидовХарактеристик.АтрибутыКласса.ОбъектОперации)
		|			ТОГДА ""ОбъектОперации""
		|		КОГДА НазначениеАтрибутов.АтрибутКласса = ЗНАЧЕНИЕ(ПланВидовХарактеристик.АтрибутыКласса.ТехКарты)
		|			ТОГДА ""ТехКартаВложенная""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ИмяКолонки,
		|	ВЫБОР
		|		КОГДА НазначениеАтрибутов.ИсточникЗначений ССЫЛКА Справочник.Классы
		|				И НЕ НазначениеАтрибутов.ИсточникЗначений = ЗНАЧЕНИЕ(Справочник.Классы.ПустаяСсылка)
		|			ТОГДА ВЫРАЗИТЬ(НазначениеАтрибутов.ИсточникЗначений КАК Справочник.Классы).КлассТабличнаяЧасть
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК КлассТабличнаяЧасть
		|ПОМЕСТИТЬ ВТ_ВсеАтрибуты
		|ИЗ
		|	РегистрСведений.НазначениеАтрибутов КАК НазначениеАтрибутов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.АтрибутыКласса КАК АтрибутыКласса
		|		ПО НазначениеАтрибутов.АтрибутКласса = АтрибутыКласса.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВложенныеАтрибутыКласса КАК ВложенныеАтрибутыКласса
		|		ПО НазначениеАтрибутов.АтрибутКласса = ВложенныеАтрибутыКласса.Ссылка
		|ГДЕ
		|	НазначениеАтрибутов.Класс В 
		|		(ЗНАЧЕНИЕ(Справочник.Классы.СтрокиТехОпераций), 
		|		 ЗНАЧЕНИЕ(Справочник.Классы.ВложенныеТехКарты), 
		|		 ЗНАЧЕНИЕ(Справочник.Классы.ТехнологическиеКарты))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВсеАтрибуты.ИДОбъекта,
		|	ВТ_ВсеАтрибуты.АтрибутКласса,
		|	ВТ_ВсеАтрибуты.ТипЗначения,
		|	ВТ_ВсеАтрибуты.ВложенныйРеквизит,
		|	ВТ_ВсеАтрибуты.МинЗначение,
		|	ВТ_ВсеАтрибуты.МаксЗначение,
		|	ВТ_ВсеАтрибуты.РежимЗаполнения,
		|	ВТ_ВсеАтрибуты.РежимИспользования,
		|	ВТ_ВсеАтрибуты.Формат,
		|	ВТ_ВсеАтрибуты.ИсточникЗначений,
		|	ВТ_ВсеАтрибуты.СписокДоступныхЗначений,
		|	ВТ_ВсеАтрибуты.МножественноеЗначение,
		|	ВТ_ВсеАтрибуты.ДобавлениеСтрокТабЧастиВНоменклатуреКласса,
		|	ВТ_ВсеАтрибуты.Порядок КАК Порядок,
		|	ВЫРАЗИТЬ(ВТ_ВсеАтрибуты.ИмяКолонки КАК СТРОКА(50)) КАК ИмяКолонки,
		|	ВТ_ВсеАтрибуты.КлассТабличнаяЧасть
		|ИЗ
		|	ВТ_ВсеАтрибуты КАК ВТ_ВсеАтрибуты
		|ГДЕ
		|	ВТ_ВсеАтрибуты.ИДОбъекта = 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВсеАтрибуты.ИДОбъекта,
		|	ВТ_ВсеАтрибуты.АтрибутКласса,
		|	ВТ_ВсеАтрибуты.ТипЗначения,
		|	ВТ_ВсеАтрибуты.ВложенныйРеквизит,
		|	ВТ_ВсеАтрибуты.МинЗначение,
		|	ВТ_ВсеАтрибуты.МаксЗначение,
		|	ВТ_ВсеАтрибуты.РежимЗаполнения,
		|	ВТ_ВсеАтрибуты.РежимИспользования,
		|	ВТ_ВсеАтрибуты.Формат,
		|	ВТ_ВсеАтрибуты.ИсточникЗначений,
		|	ВТ_ВсеАтрибуты.СписокДоступныхЗначений,
		|	ВТ_ВсеАтрибуты.МножественноеЗначение,
		|	ВТ_ВсеАтрибуты.ДобавлениеСтрокТабЧастиВНоменклатуреКласса,
		|	ВТ_ВсеАтрибуты.Порядок КАК Порядок,
		|	ВЫРАЗИТЬ(ВТ_ВсеАтрибуты.ИмяКолонки КАК СТРОКА(50)) КАК ИмяКолонки,
		|	ВТ_ВсеАтрибуты.КлассТабличнаяЧасть
		|ИЗ
		|	ВТ_ВсеАтрибуты КАК ВТ_ВсеАтрибуты
		|ГДЕ
		|	ВТ_ВсеАтрибуты.ИДОбъекта = 1
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВсеАтрибуты.АтрибутКласса,
		|	ВТ_ВсеАтрибуты.ИсточникЗначений,
		|	ВЫРАЗИТЬ(ВТ_ВсеАтрибуты.ИсточникЗначений КАК ПланВидовХарактеристик.АтрибутыКласса).ТипЗначения КАК ТипИсточникаЗначений,
		|	ВТ_ВсеАтрибуты.ВложенныйРеквизит
		|ИЗ
		|	ВТ_ВсеАтрибуты КАК ВТ_ВсеАтрибуты
		|ГДЕ
		|	НЕ ВТ_ВсеАтрибуты.ВложенныйРеквизит ЕСТЬ NULL";
	РезультатыЗапросов = Запрос.ВыполнитьПакет();
	
	Результат = Новый Массив;
	
	ТипыЗначенийРеквизитов = Новый Соответствие;
	
	ВыборкаВложенныхРеквизитов = РезультатыЗапросов[3].Выбрать();
	Пока ВыборкаВложенныхРеквизитов.Следующий() Цикл 
		ТипРеквизита = ТипыЗначенийРеквизитов[ВыборкаВложенныхРеквизитов.АтрибутКласса];
		Если ТипРеквизита = Неопределено Тогда
			МетаданныеСпр = Метаданные.НайтиПоТипу(ВыборкаВложенныхРеквизитов.ТипИсточникаЗначений.Типы()[0]);
			МетаданныеРеквизита = Перечисления.РеквизитыКлассаНоменклатуры.ПолучитьМетаданныеРеквизита(МетаданныеСпр, 
				ВыборкаВложенныхРеквизитов.ВложенныйРеквизит);
			ТипыЗначенийРеквизитов.Вставить(ВыборкаВложенныхРеквизитов.АтрибутКласса, МетаданныеРеквизита.Тип);
		КонецЕсли;
	КонецЦикла;
	
	ТипВложенныйАтрибут = Тип("СправочникСсылка.ВложенныеАтрибутыКласса");
	
	ТаблицаАтрибутов = РезультатыЗапросов[1].Выгрузить();
	ТаблицаАтрибутов.Колонки.Добавить("ТипЗначенияРеквизита", Новый ОписаниеТипов("Строка"));
	
	Для Каждого СтрокаТаблицы ИЗ ТаблицаАтрибутов Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ТипЗначения) И ТипЗнч(СтрокаТаблицы.АтрибутКласса) = ТипВложенныйАтрибут Тогда
			ТипРеквизита = ТипыЗначенийРеквизитов[СтрокаТаблицы.АтрибутКласса];
			Если НЕ ТипРеквизита = Неопределено Тогда
				СтрокаТаблицы.ТипЗначения = ТипРеквизита;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Результат.Добавить(Новый Структура("ИДОбъекта, ИмяТаблицы, ТаблицаАтрибутов", 
		0, "СоставТехКарты", ТаблицаАтрибутов));
	
	ТаблицаАтрибутов = РезультатыЗапросов[2].Выгрузить();
	ТаблицаАтрибутов.Колонки.Добавить("ТипЗначенияРеквизита", Новый ОписаниеТипов("Строка"));
	
	Для Каждого СтрокаТаблицы ИЗ ТаблицаАтрибутов Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ТипЗначения) И ТипЗнч(СтрокаТаблицы.АтрибутКласса) = ТипВложенныйАтрибут Тогда
			ТипРеквизита = ТипыЗначенийРеквизитов[СтрокаТаблицы.АтрибутКласса];
			Если НЕ ТипРеквизита = Неопределено Тогда
				СтрокаТаблицы.ТипЗначения = ТипРеквизита;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Результат.Добавить(Новый Структура("ИДОбъекта, ИмяТаблицы, ТаблицаАтрибутов", 
		1, "ТехКарты", ТаблицаАтрибутов));
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьВложенныеТабличныеЧасти(ТаблицаАтрибутов, ТипОбъекта, СписокЗначений)
	
	Для Каждого СтрокаАтрибут ИЗ ТаблицаАтрибутов Цикл
		Если СтрокаАтрибут.КлассТабличнаяЧасть И СтрокаАтрибут.МножественноеЗначение Тогда
			СписочныйАтрибут = СписочныеАтрибуты.Добавить();
			СписочныйАтрибут.ИДАтрибута          = НайтиНовыйИД(СписочныеАтрибуты, "ИДАтрибута", 2);
			СписочныйАтрибут.АтрибутКласса       = СтрокаАтрибут.АтрибутКласса;
			СписочныйАтрибут.КлассТабличнаяЧасть = Истина;
			СписочныйАтрибут.ТипОбъекта          = ТипОбъекта;
			СписочныйАтрибут.ИсточникЗначений    = СтрокаАтрибут.ИсточникЗначений;
			
			СписочныйАтрибут.ДобавлениеСтрокТабЧастиВНоменклатуреКласса = 
				СтрокаАтрибут.ДобавлениеСтрокТабЧастиВНоменклатуреКласса;
			
			СписокЗначений.Добавить(СписочныйАтрибут.ИДАтрибута, Строка(СписочныйАтрибут.АтрибутКласса));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции заполнения обработки

&НаКлиенте
Процедура ПодготовитьФормуРедактированияЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаписатьНаСервере();
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ПодготовитьФормуРедактированияКласса(ДополнительныеПараметры.ВыбраннаяСтрока, ДополнительныеПараметры.РежимДобавления);
	Если ПереключательАтрибутов > 1 Тогда 
		ПереключательАтрибутов = 0;
		ПереключитьСтраницуФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НайтиНовыйИД(ТаблицаФормы, КолонкаИД, Знач МинИД = Неопределено)
	
	Если НЕ ЗначениеЗаполнено(МинИД) Тогда
		МинИД = 1;
	КонецЕсли;
	
	НовыйИД = Макс(ТаблицаФормы.Количество() + 1, МинИД);
	СтруктураПоиска = Новый Структура(КолонкаИД, НовыйИД);
	
	Найдено = Истина;
	Пока Найдено Цикл
		Найдено = (ТаблицаФормы.НайтиСтроки(СтруктураПоиска).Количество() > 0);
		Если Найдено Тогда
			НовыйИД = НовыйИД + 1;
			СтруктураПоиска[КолонкаИД] = НовыйИД;
		КонецЕсли;
	КонецЦикла;
	
	Возврат НовыйИД;
	
КонецФункции

&НаСервере
Процедура ВыбратьОбъектРедактирования(Ссылка)
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		СпрОбъект = Ссылка.ПолучитьОбъект();
	Иначе
		СпрОбъект = Справочники.НоменклатураКласса.СоздатьЭлемент();
	КонецЕсли;
	ЗначениеВДанныеФормы(СпрОбъект, Объект.НоменклатураКласса);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокДоступныхКлассов(Родитель)
	
	КлассРодитель = ?(ЗначениеЗаполнено(Родитель), 
		УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначениеРеквизитаОбъекта(Родитель, "Класс"), 
		Справочники.Классы.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", КлассРодитель);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Классы.Ссылка
		|ПОМЕСТИТЬ ВТ_КлассыИсключений
		|ИЗ
		|	Справочник.Классы КАК Классы
		|ГДЕ
		|	Классы.Ссылка В ИЕРАРХИИ(&Ссылка)
		|	И Классы.ОтображатьВИерархииТО
		|	И НЕ Классы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Классы.Ссылка
		|ИЗ
		|	Справочник.Классы КАК Классы
		|ГДЕ
		|	(Классы.Ссылка В ИЕРАРХИИ (&Ссылка)
		|			ИЛИ Классы.Ссылка = &Ссылка)
		|	И НЕ Классы.Ссылка В ИЕРАРХИИ
		|				(ВЫБРАТЬ
		|					ВТ_КлассыИсключений.Ссылка
		|				ИЗ
		|					ВТ_КлассыИсключений КАК ВТ_КлассыИсключений)
		|	И Классы.НоменклатураКласса";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Результат = Неопределено;
	Иначе
		Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьАтрибуты(ИсточникЗаполнения)
	
	ТипСтрока = Тип("Строка");
	
	МассивСписочныхАктуальных = Новый Массив;
	СоответствиеАтрибутСтрока = Новый Соответствие;
	
	// Готовим список атрибутов для удаления.
	ТаблицаУдаляемых = РеквизитФормыВЗначение("ПоляАтрибутовКласса");
	МассивУдаляемых  = ТаблицаУдаляемых.ВыгрузитьКолонку("ИмяПоля");
	КолВо = ТаблицаУдаляемых.Количество();
	Для Н = 1 По КолВо Цикл
		Если НЕ ЗначениеЗаполнено(МассивУдаляемых[КолВо - Н]) Тогда
			МассивУдаляемых.Удалить(КолВо - Н);
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаСписочныеАтрибуты = РеквизитФормыВЗначение("СписочныеАтрибуты");
	
	ТипОбъектНоменклатуры = Тип("СправочникСсылка.ОбъектыНоменклатуры");
	ТипНоменклатураКласса = Тип("СправочникСсылка.НоменклатураКласса");
	ТипКлассы             = Тип("СправочникСсылка.Классы");
	ТипВариантыЗначений   = Тип("СправочникСсылка.ВариантыЗначенийАтрибутовКласса");
	
	МассивДобавляемых = Новый Массив;
	Если ЗначениеЗаполнено(Объект.Класс) Тогда
		
		ОписаниеТиповБулево = Новый ОписаниеТипов("Булево");
		
		// Получаем таблицу атрибутов, с учетом наследования
		СписокРодителей  = Справочники.Классы.ПолучитьТаблицуРодителей(Объект.Класс);
		ТаблицаАтрибутов = Справочники.Классы.ПолучитьТаблицуАтрибутов(СписокРодителей);
		ТаблицаАтрибутов.Колонки.Добавить("ИмяПоля", Новый ОписаниеТипов("Строка"));
		ТаблицаАтрибутов.Колонки.Добавить("СоставнойТипЗначения",  ОписаниеТиповБулево);
		ТаблицаАтрибутов.Колонки.Добавить("НуженИсточникЗначений", ОписаниеТиповБулево);
		ТаблицаАтрибутов.Колонки.Добавить("ЭтоВложенныйАтрибут",   ОписаниеТиповБулево);
		ТаблицаАтрибутов.Колонки.Добавить("ЭтотАтрибутВШаблоне",   ОписаниеТиповБулево);
		ТаблицаАтрибутов.Колонки.ЗначениеАтрибутаКласса.Имя = "ЗначениеПоУмолчанию";
		ТаблицаАтрибутов.Колонки.Добавить("ЗначениеАтрибутаКласса", 
			ТаблицаАтрибутов.Колонки.ЗначениеПоУмолчанию.ТипЗначения);
		
		// Создаем новые атрибуты.
		СоответствиеАтрибутовИСтрок = Новый Соответствие;
		ИспользованиеДляОбъектовНоменклатуры = 
			Перечисления.РежимыИспользованияАтрибутов.ТолькоДляОбъектовНоменклатуры;
			
		МассивВложенных = Новый Массив;
		АтрибутыИсточникиВложенных = Новый Соответствие;
			
		Н = 1;
		Для Каждого СтрокаТЗ ИЗ ТаблицаАтрибутов Цикл 
			
			Если НЕ ЗначениеЗаполнено(СтрокаТЗ.ТипЗначения) И ЗначениеЗаполнено(СтрокаТЗ.ТипЗначенияРеквизита) Тогда
				СтрокаТЗ.ТипЗначения = ЗначениеИзСтрокиВнутр(СтрокаТЗ.ТипЗначенияРеквизита);
			КонецЕсли;
			
			// Не учитываем: 
			//  - ненаследумые атрибуты;
			//  - списочные атрибуты (со множественными значениями).
			//  - атрибуты, используемые только для объктов номенклатуры.
			
			Если СтрокаТЗ.СтатусНаследования <= 3 И ЗначениеЗаполнено(СтрокаТЗ.ТипЗначения) 
					И НЕ СтрокаТЗ.ТипЗначения.СодержитТип(ТипСтрока) И СтрокаТЗ.МножественноеЗначение Тогда 
				//
				МассивСписочныхАктуальных.Добавить(СтрокаТЗ.АтрибутКласса);
				
				Найдено = ТаблицаСписочныеАтрибуты.НайтиСтроки(Новый Структура("ТипОбъекта, АтрибутКласса", 0, СтрокаТЗ.АтрибутКласса));
				Если Найдено.Количество() = 0 Тогда
					СписочныйАтрибут = ТаблицаСписочныеАтрибуты.Добавить();
					СписочныйАтрибут.ИДАтрибута          = НайтиНовыйИД(ТаблицаСписочныеАтрибуты, "ИДАтрибута", 2);
					СписочныйАтрибут.АтрибутКласса       = СтрокаТЗ.АтрибутКласса;
					СписочныйАтрибут.КлассТабличнаяЧасть = СтрокаТЗ.КлассТабличнаяЧасть;
					СписочныйАтрибут.ТипОбъекта          = 0;
					СписочныйАтрибут.ИсточникЗначений    = СтрокаТЗ.ИсточникЗначений;
					
					СписочныйАтрибут.ДобавлениеСтрокТабЧастиВНоменклатуреКласса =
						СтрокаТЗ.ДобавлениеСтрокТабЧастиВНоменклатуреКласса;
					
					СоответствиеАтрибутСтрока.Вставить(СтрокаТЗ.АтрибутКласса, СписочныйАтрибут);
				Иначе
					СоответствиеАтрибутСтрока.Вставить(СтрокаТЗ.АтрибутКласса, Найдено[0]);
					ЗаполнитьЗначенияСвойств(Найдено[0], СтрокаТЗ, 
						"ИсточникЗначений, ДобавлениеСтрокТабЧастиВНоменклатуреКласса");
				КонецЕсли;
				
				Продолжить;
				
			ИначеЕсли СтрокаТЗ.СтатусНаследования > 3 
					ИЛИ СтрокаТЗ.РежимИспользования = ИспользованиеДляОбъектовНоменклатуры Тогда
				//
				Продолжить;
				
			КонецЕсли;
			
			ИмяПоля = "АтрибутНоменклатуры" + Н;
			
			ТипРеквизита = СтрокаТЗ.ТипЗначения;
			ЭтоОбъектНоменклатуры = ЗначениеЗаполнено(ТипРеквизита) И (ТипРеквизита.СодержитТип(ТипОбъектНоменклатуры));
			ЭтоНоменклатураКласса = ЭтоОбъектНоменклатуры 
				ИЛИ ЗначениеЗаполнено(ТипРеквизита) И (ТипРеквизита.СодержитТип(ТипНоменклатураКласса));
			ЭтоКлассы = ЗначениеЗаполнено(ТипРеквизита) И (ТипРеквизита.СодержитТип(ТипКлассы));
			
			СтрокаТЗ.ЭтоВложенныйАтрибут = (ТипЗнч(СтрокаТЗ.АтрибутКласса) = Тип("СправочникСсылка.ВложенныеАтрибутыКласса"));
			Если СтрокаТЗ.ЭтоВложенныйАтрибут Тогда
				МассивВложенных.Добавить(СтрокаТЗ.АтрибутКласса);
				АтрибутыИсточникиВложенных.Вставить(СтрокаТЗ.ИсточникЗначений, Истина);
				
			ИначеЕсли НЕ СтрокаТЗ.ЭтоВложенныйАтрибут И Объект.ОбъектыНоменклатуры И (ЭтоОбъектНоменклатуры ИЛИ ЭтоНоменклатураКласса) Тогда
				МассивДобавляемыхТипов = Новый Массив;
				Если ЭтоОбъектНоменклатуры Тогда
					МассивДобавляемыхТипов.Добавить(ТипНоменклатураКласса);
				КонецЕсли;
				Если ЭтоНоменклатураКласса Тогда
					МассивДобавляемыхТипов.Добавить(ТипКлассы);
				КонецЕсли;
				ТипРеквизита = Новый ОписаниеТипов(ТипРеквизита, МассивДобавляемыхТипов); 
				СтрокаТЗ.СоставнойТипЗначения = Истина;
			КонецЕсли;
			
			СтрокаТЗ.НуженИсточникЗначений = НЕ СтрокаТЗ.ЭтоВложенныйАтрибут И (ЭтоКлассы ИЛИ ЭтоНоменклатураКласса ИЛИ ЭтоОбъектНоменклатуры);
			Если ЗначениеЗаполнено(ТипРеквизита) Тогда
				НовыйРеквизит = Новый РеквизитФормы(ИмяПоля, ТипРеквизита, , Строка(СтрокаТЗ.АтрибутКласса), Истина);
				МассивДобавляемых.Добавить(НовыйРеквизит);
				СтрокаТЗ.ИмяПоля = ИмяПоля;
			КонецЕсли;
			
			Если НЕ СтрокаТЗ.РежимЗаполнения = Перечисления.РежимыЗаполненияАтрибутов.ОбязательныйДляКласса Тогда
				СоответствиеАтрибутовИСтрок.Вставить(СтрокаТЗ.АтрибутКласса, СтрокаТЗ);
			КонецЕсли;
			
			Н = Н + 1;
			
		КонецЦикла;
	КонецЕсли;
	
	ИзменитьРеквизиты(МассивДобавляемых, МассивУдаляемых);
	
	КолВоАтрибутов = МассивДобавляемых.Количество();
	
	Элементы.ДекорацияНетАтрибутов.Видимость = (МассивДобавляемых.Количество() = 0);
	
	// Удаляем лишние элементы формы.
	Для Каждого ИмяПоля ИЗ МассивУдаляемых Цикл
		Элементы.Удалить(Элементы[ИмяПоля]);
	КонецЦикла;
	
	ЕстьШаблонНаименования = ЗначениеЗаполнено(Объект.ШаблонНаименования);
	Если ЕстьШаблонНаименования Тогда
		ЭлементыШаблона = УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначениеРеквизитаОбъекта(
			Объект.ШаблонНаименования, "ЭлементыШаблона").Выгрузить();
		СтруктураПоискаПоШаблону = Новый Структура("ТипСтроки, АтрибутКласса", Перечисления.ТипыСтрокШаблона.АтрибутОбъекта);
	КонецЕсли;
	
	// Создаем элементы формы.
	ТипЧисло  = Тип("Число");
	Если ЗначениеЗаполнено(Объект.Класс) Тогда
		Для Каждого СтрокаТЗ ИЗ ТаблицаАтрибутов Цикл
			Если ПустаяСтрока(СтрокаТЗ.ИмяПоля) Тогда
				Продолжить;
			КонецЕсли;
			СтрокаТЗ.ЗначениеАтрибутаКласса = СтрокаТЗ.ТипЗначения.ПривестиЗначение(СтрокаТЗ.ЗначениеПоУмолчанию);
			ЭтаФорма[СтрокаТЗ.ИмяПоля] = СтрокаТЗ.ЗначениеАтрибутаКласса;
			
			НовыйЭлемент = Элементы.Вставить(СтрокаТЗ.ИмяПоля, Тип("ПолеФормы"), Элементы.ГруппаАтрибуты, Элементы.ДекорацияЭлементыНиже);
			НовыйЭлемент.Вид         = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = СтрокаТЗ.ИмяПоля;
			НовыйЭлемент.Заголовок   = Строка(СтрокаТЗ.АтрибутКласса);
			НовыйЭлемент.Видимость   = Истина;
			Если СтрокаТЗ.ЭтоВложенныйАтрибут Тогда
				НовыйЭлемент.ТолькоПросмотр = Истина;
			Иначе
				Если СтрокаТЗ.РежимЗаполнения = Перечисления.РежимыЗаполненияАтрибутов.ОбязательныйДляНоменклатуры Тогда
					НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;
				ИначеЕсли СтрокаТЗ.РежимЗаполнения = Перечисления.РежимыЗаполненияАтрибутов.ОбязательныйДляКласса Тогда
					НовыйЭлемент.ТолькоПросмотр = Истина;
				КонецЕсли;
				Если ЕстьШаблонНаименования Тогда
					СтруктураПоискаПоШаблону.АтрибутКласса = СтрокаТЗ.АтрибутКласса;
					НайденоВШаблоне = ЭлементыШаблона.НайтиСтроки(СтруктураПоискаПоШаблону);
					Если НайденоВШаблоне.Количество() > 0 Тогда
						НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;
						СтрокаТЗ.ЭтотАтрибутВШаблоне = Истина;
					КонецЕсли;
				КонецЕсли;
				
				Если СтрокаТЗ.ТипЗначения.СодержитТип(ТипЧисло)
						И (ЗначениеЗаполнено(СтрокаТЗ.МинЗначение) ИЛИ ЗначениеЗаполнено(СтрокаТЗ.МаксЗначение)) Тогда
					НовыйЭлемент.МинимальноеЗначение = СтрокаТЗ.МинЗначение;
					НовыйЭлемент.МаксимальноеЗначение = СтрокаТЗ.МаксЗначение;
					НовыйЭлемент.Подсказка = УправлениеНСИФункцииКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
						НСтр("ru='от %1 до %2'"), СтрокаТЗ.МинЗначение, СтрокаТЗ.МаксЗначение);
					НовыйЭлемент.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСправа;
				ИначеЕсли СтрокаТЗ.ТипЗначения.СодержитТип(ТипСтрока) И СтрокаТЗ.МножественноеЗначение Тогда
					НовыйЭлемент.МногострочныйРежим = Истина; 
				ИначеЕсли СтрокаТЗ.НуженИсточникЗначений И НЕ СтрокаТЗ.СписокДоступныхЗначений И НЕ СтрокаТЗ.СоставнойТипЗначения
						И СтрокаТЗ.ТипЗначения.СодержитТип(ТипНоменклатураКласса) Тогда
					
					ТипИсточника = ?(ЗначениеЗаполнено(СтрокаТЗ.ИсточникЗначений), ТипЗнч(СтрокаТЗ.ИсточникЗначений), Неопределено);
					ИсточникКласс = (ТипИсточника = ТипКлассы);
					Если ИсточникКласс Тогда
						НовыйЭлемент.ВыборГруппИЭлементов = ГруппыИЭлементы.Элементы;
						ОтборПоКлассу = Новый ПараметрВыбора("Отбор.Класс", СтрокаТЗ.ИсточникЗначений);
						ПараметрыВыбора = Новый Массив;
						ПараметрыВыбора.Добавить(ОтборПоКлассу);
						НовыйЭлемент.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
					КонецЕсли;
					
				ИначеЕсли НЕ СтрокаТЗ.СписокДоступныхЗначений И СтрокаТЗ.ТипЗначения.СодержитТип(ТипВариантыЗначений) Тогда
					
					ОтборПоВладельцу = Новый ПараметрВыбора("Отбор.Владелец", СтрокаТЗ.АтрибутКласса);
					ПараметрыВыбора = Новый Массив;
					ПараметрыВыбора.Добавить(ОтборПоВладельцу);
					НовыйЭлемент.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
					
				КонецЕсли;
				
				НовыйЭлемент.ВыбиратьТип = СтрокаТЗ.СоставнойТипЗначения;
				
				НовыйЭлемент.УстановитьДействие("ПриИзменении", "ПриИзмененииАтрибута");
				НовыйЭлемент.УстановитьДействие("НачалоВыбора", "НачалоВыбораАтрибута");
			КонецЕсли;
			
		КонецЦикла;
		
		// Заполняем значениями номенклатуры класса.
		Если ЗначениеЗаполнено(ИсточникЗаполнения) И ТипЗнч(ИсточникЗаполнения) = Тип("СправочникСсылка.НоменклатураКласса") Тогда
			КлассыДляЧтенияВложенных = Новый Массив;
			НоменклатураДляЧтенияВложенных = Новый Массив;
			СоответствиеОбъектов = Новый Соответствие;
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Ссылка", ИсточникЗаполнения);
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЗначенияАтрибутовКласса.АтрибутКласса,
				|	ЗначенияАтрибутовКласса.ЗначениеАтрибутаКласса
				|ИЗ
				|	РегистрСведений.ЗначенияАтрибутовКласса КАК ЗначенияАтрибутовКласса
				|ГДЕ
				|	ЗначенияАтрибутовКласса.Класс = &Ссылка";
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				СтрокаТЗ = СоответствиеАтрибутовИСтрок[Выборка.АтрибутКласса];
				Если НЕ СтрокаТЗ = Неопределено Тогда
					СтрокаТЗ.ЗначениеАтрибутаКласса = СтрокаТЗ.ТипЗначения.ПривестиЗначение(Выборка.ЗначениеАтрибутаКласса);
					ЭтаФорма[СтрокаТЗ.ИмяПоля] = СтрокаТЗ.ЗначениеАтрибутаКласса;
					Если НЕ АтрибутыИсточникиВложенных[СтрокаТЗ.АтрибутКласса] = Неопределено 
							И ЗначениеЗаполнено(СтрокаТЗ.ЗначениеАтрибутаКласса) Тогда
						
						СоответствиеОбъектов.Вставить(СтрокаТЗ.АтрибутКласса, СтрокаТЗ.ЗначениеАтрибутаКласса);
						Если ТипЗнч(СтрокаТЗ.ЗначениеАтрибутаКласса) = Тип("СправочникСсылка.Классы") Тогда
							КлассыДляЧтенияВложенных.Добавить(СтрокаТЗ.ЗначениеАтрибутаКласса);
						ИначеЕсли ТипЗнч(СтрокаТЗ.ЗначениеАтрибутаКласса) = Тип("СправочникСсылка.НоменклатураКласса") Тогда
							НоменклатураДляЧтенияВложенных.Добавить(СтрокаТЗ.ЗначениеАтрибутаКласса);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			ЗначенияВложенныхАтрибутов = Справочники.ВложенныеАтрибутыКласса.ПрочитатьЗначенияВложенныхАтрибутов(СоответствиеОбъектов,
				КлассыДляЧтенияВложенных, НоменклатураДляЧтенияВложенных, МассивВложенных);
			
			Для Каждого ВложенныйАтрибут ИЗ МассивВложенных Цикл
				СтрокаТЗ = СоответствиеАтрибутовИСтрок[ВложенныйАтрибут];
				Если СтрокаТЗ = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				// Заполняем только те вложенные атрибуты, источник которых определен на уровне номенклатуры класса.
				ИсточникДанных = СоответствиеОбъектов[СтрокаТЗ.ИсточникЗначений];
				Если ИсточникДанных = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				ЗначениеВложенного = ЗначенияВложенныхАтрибутов[ВложенныйАтрибут];
				СтрокаТЗ.ЗначениеАтрибутаКласса = ?(ЗначениеВложенного = Неопределено, Неопределено, ЗначениеВложенного);
				ЭтаФорма[СтрокаТЗ.ИмяПоля] = СтрокаТЗ.ЗначениеАтрибутаКласса;
			КонецЦикла;
			
		КонецЕсли;
		
		ЗначениеВРеквизитФормы(ТаблицаАтрибутов, "ПоляАтрибутовКласса");
	Иначе
		ПоляАтрибутовКласса.Очистить();
	КонецЕсли;
	
	// Удаляем лишние списочные атрибуты.
	КолВо = ТаблицаСписочныеАтрибуты.Количество();
	Для Н = 1 По КолВо Цикл
		СписочныйАтрибут = ТаблицаСписочныеАтрибуты[КолВо - Н];
		Если СписочныйАтрибут.ТипОбъекта = 0 
				И СоответствиеАтрибутСтрока[СписочныйАтрибут.АтрибутКласса] = Неопределено Тогда
			ТаблицаСписочныеАтрибуты.Удалить(КолВо - Н);
		КонецЕсли;
	КонецЦикла;
	
	// Очищаем список страниц списочных атрибутов.
	КолВо = Элементы.ПереключательАтрибутов.СписокВыбора.Количество();
	Для Н = 1 По КолВо - 1 Цикл
		Элементы.ПереключательАтрибутов.СписокВыбора.Удалить(КолВо - Н);
	КонецЦикла;
	
	ТаблицаСписочныеАтрибуты.Сортировать("ТипОбъекта");
	
	// Сортировка списочных атрибутов, добавление в список выбора переключателя.
	Н = 0;
	Для Каждого АтрибутКласса ИЗ МассивСписочныхАктуальных Цикл
		СписочныйАтрибут = СоответствиеАтрибутСтрока[АтрибутКласса];
		Индекс = ТаблицаСписочныеАтрибуты.Индекс(СписочныйАтрибут);
		Если НЕ Индекс = Н Тогда
			ТаблицаСписочныеАтрибуты.Сдвинуть(Индекс, Н - Индекс);
		КонецЕсли;
		
		Элементы.ПереключательАтрибутов.СписокВыбора.Добавить(СписочныйАтрибут.ИДАтрибута, АтрибутКласса);
		Н = Н + 1;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ТаблицаСписочныеАтрибуты, "СписочныеАтрибуты");
	
	ПоказатьАтрибутыПоНастройке(Элементы.ГруппаАтрибуты.ПодчиненныеЭлементы, 
		ТекПозицияПрокруткиАтрибутов, КолВоАтрибутов, Объект.МаксКолВоАтрибутов);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияСписочныхАтрибутов(ИсточникЗаполнения)
	
	Если ЗначениеЗаполнено(ИсточникЗаполнения) И ТипЗнч(ИсточникЗаполнения) = Тип("СправочникСсылка.НоменклатураКласса") Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", ИсточникЗаполнения);
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	МножественныеЗначенияАтрибутов.АтрибутКласса КАК АтрибутКласса,
			|	МножественныеЗначенияАтрибутов.ЗначениеАтрибутаКласса КАК ЗначениеАтрибутаКласса,
			|	МножественныеЗначенияАтрибутов.Порядок КАК Порядок
			|ИЗ
			|	РегистрСведений.МножественныеЗначенияАтрибутов КАК МножественныеЗначенияАтрибутов
			|ГДЕ
			|	МножественныеЗначенияАтрибутов.Класс = &Ссылка
			|	И МножественныеЗначенияАтрибутов.ИспользуемоеЗначение
			|
			|УПОРЯДОЧИТЬ ПО
			|	АтрибутКласса,
			|	Порядок,
			|	ЗначениеАтрибутаКласса
			|АВТОУПОРЯДОЧИВАНИЕ";
		Результат = Запрос.Выполнить().Выбрать();
		Пока Результат.Следующий() Цикл
			СтрокаТЧ = Объект.ЗначенияСписочныхАтрибутов.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, Результат);
			СтрокаТЧ.СтатусНаследования = 2;
		КонецЦикла;
		
	КонецЕсли;
	
	СписокРодителей  = Справочники.Классы.ПолучитьТаблицуРодителей(Объект.Класс);
	
	ТаблицаДоступныхЗначенийАтрибутов = Справочники.Классы.ПолучитьЗначенияСписочныхАтрибутов(Объект.Класс, СписокРодителей);
	КолВо = ТаблицаДоступныхЗначенийАтрибутов.Количество();
	Для Н = 1 По КолВо Цикл
		СтрокаТЗ = ТаблицаДоступныхЗначенийАтрибутов[КолВо - Н];
		Если СтрокаТЗ.СтатусНаследования > 3 Тогда 
			ТаблицаДоступныхЗначенийАтрибутов.Удалить(СтрокаТЗ);
		ИначеЕсли СтрокаТЗ.ИспользуемоеЗначение Тогда
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ТекстЗапросаТаблицаРодителей()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Классы.Ссылка КАК КлассДляЧтения,
		|	Классы.Ссылка КАК Класс
		|ИЗ
		|	Справочник.Классы КАК Классы
		|ГДЕ
		|	НЕ Классы.ПометкаУдаления
		|	И Классы.Ссылка В (&КлассыДляЧтения)
		|ИТОГИ
		|	МАКСИМУМ(КлассДляЧтения)
		|ПО
		|	Класс,
		|	Класс ТОЛЬКО ИЕРАРХИЯ";
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Функция ПолучитьТаблицуРодителейКлассов(КлассыДляЧтения)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КлассыДляЧтения", КлассыДляЧтения);
	Запрос.Текст = ТекстЗапросаТаблицаРодителей();
	
	ТаблицаРодителей = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.Прямой);
	ТаблицаРодителей.Колонки.Добавить("Уровень", Новый ОписаниеТипов("Число"));
	
	ТекКлассДляЧтения = Неопределено;
	Для Каждого СтрокаТЗ ИЗ ТаблицаРодителей Цикл
		Если НЕ СтрокаТЗ.КлассДляЧтения = ТекКлассДляЧтения Тогда
			М = 0;
			ТекКлассДляЧтения = СтрокаТЗ.КлассДляЧтения;
			ПредКласс = Неопределено;
		КонецЕсли;
		Если НЕ ПредКласс = СтрокаТЗ.Класс Тогда // Не заполняем уровень у дублирующихся строк.
			СтрокаТЗ.Уровень = М;
			М = М + 1;
			ПредКласс = СтрокаТЗ.Класс;
		КонецЕсли;
	КонецЦикла;
	
	НайденоУдалить = ТаблицаРодителей.НайтиСтроки(Новый Структура("Уровень", 0));
	Для Каждого СтрокаТЗ ИЗ НайденоУдалить Цикл
		ТаблицаРодителей.Удалить(СтрокаТЗ);
	КонецЦикла;
	
	Возврат ТаблицаРодителей;
	
КонецФункции

&НаСервере
Процедура ПрочитатьЗначенияТабличныхАтрибутов(СписокНоменклатуры, СписокКлассов=Неопределено, ДанныеТабличныхАтрибутов, НовыйИДСтроки = 1, СоответствиеИДСтрок = Неопределено)
	
	// Чтение строк табличных атрибутов (строки-номенклатура классов).
	ТаблицаАтрибутов = Справочники.НоменклатураКласса.ПолучитьСтрокиТабличныхАтрибутов(
		СписокНоменклатуры, ДанныеТабличныхАтрибутов);
	ТаблицаАтрибутов.Колонки.Добавить("ИДСтроки");
	
	ПустаяНоменклатура = Справочники.НоменклатураКласса.ПустаяСсылка();
	
	// Строки-классы.
	СписокРодителей = Справочники.Классы.ПолучитьТаблицуРодителей(СписокКлассов);
	ТаблицаАтрибутовКлассов = Справочники.Классы.ПолучитьСтрокиТабличныхАтрибутов(
		СписокРодителей, ДанныеТабличныхАтрибутов);
	Для Каждого СтрокаТЗ ИЗ ТаблицаАтрибутовКлассов Цикл
		СтрокаКласса = ТаблицаАтрибутов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаКласса, СтрокаТЗ);
		СтрокаКласса.Объект = СтрокаТЗ.КлассДляЧтения;
		Если ЗначениеЗаполнено(СтрокаКласса.ЗначениеАтрибутаКласса) Тогда
			СтрокаКласса.ИсточникЗначений = СтрокаКласса.ЗначениеАтрибутаКласса;
			СтрокаКласса.ЗначениеАтрибутаКласса = ПустаяНоменклатура;
		КонецЕсли;
		Если СтрокаКласса.СтатусНаследования = 1 Тогда
			СтрокаКласса.СтатусНаследования = 3;
		КонецЕсли;
	КонецЦикла;
	
	СоответствиеИДСтрокВложенных = Новый Соответствие;
	НоменклатураВложенная        = Новый Массив;
	КлассыВложенные              = Новый Массив;
	
	ТипНоменклатура = Тип("СправочникСсылка.НоменклатураКласса");
	
	Для Каждого СтрокаТЗ ИЗ ТаблицаАтрибутов Цикл
		
		ЗначениеПоиска = ?(ЗначениеЗаполнено(СтрокаТЗ.ЗначениеАтрибутаКласса), 
			СтрокаТЗ.ЗначениеАтрибутаКласса, СтрокаТЗ.ИсточникЗначений);
			
		// СоответствиеИДСтрокВложенных - соответствие класса прочитанной строки и массива строк, добавленных в обработку.
		МассивСтрок = СоответствиеИДСтрокВложенных[ЗначениеПоиска];
		Если МассивСтрок = Неопределено Тогда
			МассивСтрок = Новый Массив;
			СоответствиеИДСтрокВложенных.Вставить(ЗначениеПоиска, МассивСтрок);
			// Использутся для чтения значений вложенных таб.частей.
			Если ТипЗнч(ЗначениеПоиска) = ТипНоменклатура Тогда
				НоменклатураВложенная.Добавить(ЗначениеПоиска);
			Иначе
				КлассыВложенные.Добавить(ЗначениеПоиска);
			КонецЕсли;
		КонецЕсли;
		
		// Соответствие родительских строк (из вызывающей процедуры при рекурсивном вызове).
		Если СоответствиеИДСтрок = Неопределено Тогда
			// Если родительских строк нет - значит ИД родительской строки = 0.
			МассивРодителей = Новый Массив;
			МассивРодителей.Добавить(Новый Структура("ИДСтроки, ЗначениеАтрибутаКласса, СтатусНаследования", 0, Неопределено, 1));
		Иначе
			МассивРодителей = СоответствиеИДСтрок[СтрокаТЗ.Объект];
			Если МассивРодителей = Неопределено Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		// Добавляем строки таб.части с привязкой к родительским строкам.
		Для Каждого СтрокаРодитель ИЗ МассивРодителей Цикл
			СтрокаТЗ.ИДСтроки = НовыйИДСтроки;
			
			СтрокаТЧ = Объект.СтрокиТабличныхАтрибутов.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаТЗ);
			
			СтрокаТЧ.ИДСтрокиРодителя   = СтрокаРодитель.ИДСтроки;
			Если СтрокаРодитель.ИДСтроки > 0 И НЕ ЗначениеЗаполнено(СтрокаРодитель.ЗначениеАтрибутаКласса) Тогда
				СтрокаТЧ.СтатусНаследования = Макс(СтрокаТЧ.СтатусНаследования, СтрокаРодитель.СтатусНаследования);
			КонецЕсли;
			МассивСтрок.Добавить(СтрокаТЧ);
			
			НовыйИДСтроки = НовыйИДСтроки + 1;
		КонецЦикла;
	КонецЦикла;
	
	// Чтение значений атрибутов строк (номенклатура классов).
	ЗначенияАтрибутов = Справочники.НоменклатураКласса.ПолучитьТаблицуАтрибутов(НоменклатураВложенная);
	ТипКолонки = Новый ОписаниеТипов(
		ЗначенияАтрибутов.Колонки.Объект.ТипЗначения, "СправочникСсылка.Классы");
	ЗначенияАтрибутов.Колонки.Объект.Имя = "ОбъектУдалить";
	ЗначенияАтрибутов.Колонки.Добавить("Объект", ТипКолонки);
	ЗначенияКолонки = ЗначенияАтрибутов.ВыгрузитьКолонку("ОбъектУдалить");
	ЗначенияАтрибутов.ЗагрузитьКолонку(ЗначенияКолонки, "Объект");
	// Строки-классы.
	СписокРодителей          = Справочники.Классы.ПолучитьТаблицуРодителей(КлассыВложенные);
	ЗначенияАтрибутовКлассов = Справочники.Классы.ПолучитьТаблицуАтрибутов(СписокРодителей);
	
	Для Каждого СтрокаТЗ ИЗ ЗначенияАтрибутовКлассов Цикл
		СтрокаЗначения = ЗначенияАтрибутов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаЗначения, СтрокаТЗ);
		СтрокаЗначения.Объект = СтрокаТЗ.КлассДляЧтения;
		Если НЕ ЗначениеЗаполнено(СтрокаТЗ.ТипЗначения) И ЗначениеЗаполнено(СтрокаТЗ.ТипЗначенияРеквизита) Тогда
			СтрокаЗначения.ТипЗначения = ЗначениеИзСтрокиВнутр(СтрокаТЗ.ТипЗначенияРеквизита);
		КонецЕсли;
	КонецЦикла;
	
	ДанныеТабличныхАтрибутовВложенных = Новый Массив;
	МассивОбъектовДляЧтения = Новый Массив;
	
	Для Каждого СтрокаЗначений ИЗ ЗначенияАтрибутов Цикл
		// Выписываем списочные атрибуты.
		Если СтрокаЗначений.МножественноеЗначение И СтрокаЗначений.КлассТабличнаяЧасть Тогда
			ДанныеТабличныхАтрибутовВложенных.Добавить(СтрокаЗначений.АтрибутКласса);
		КонецЕсли;
		
		МассивСтрок = СоответствиеИДСтрокВложенных[СтрокаЗначений.Объект];
		Если МассивСтрок = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		Для Каждого СтрокаТаб ИЗ МассивСтрок Цикл
			СтрокаТЧ = Объект.ЗначенияТабличныхАтрибутов.Добавить();
			СтрокаТЧ.ИДСтрокиРодителя        = СтрокаТаб.ИДСтрокиРодителя;
			СтрокаТЧ.АтрибутКласса           = СтрокаТаб.АтрибутКласса;
			СтрокаТЧ.ИДСтроки                = СтрокаТаб.ИДСтроки;
			СтрокаТЧ.АтрибутТаблицы          = СтрокаЗначений.АтрибутКласса;
			СтрокаТЧ.ЗначениеАтрибутаТаблицы = СтрокаЗначений.ЗначениеАтрибутаКласса;
		КонецЦикла;
	КонецЦикла;
	
	Если ДанныеТабличныхАтрибутовВложенных.Количество() > 0 Тогда
		ПрочитатьЗначенияТабличныхАтрибутов(НоменклатураВложенная, КлассыВложенные, 
			ДанныеТабличныхАтрибутовВложенных, НовыйИДСтроки, СоответствиеИДСтрокВложенных);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияТабличныхАтрибутов(ИсточникЗаполнения)
	
	Объект.СтрокиТабличныхАтрибутов.Очистить();
	Объект.ЗначенияТабличныхАтрибутов.Очистить();
	
	// Чтение строк табличных атрибутов.
	ДанныеТабличныхАтрибутов = СписочныеАтрибуты.Выгрузить(
		Новый Структура("ТипОбъекта, КлассТабличнаяЧасть", 0, Истина), "АтрибутКласса").ВыгрузитьКолонку("АтрибутКласса");
	Если ДанныеТабличныхАтрибутов.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	НовыйИДСтроки = 1;
	ОбъектЧтенияНоменклатура = Объект.НоменклатураКласса.Ссылка;
	ОбъектЧтенияКласс = ?(ЗначениеЗаполнено(ОбъектЧтенияНоменклатура), Неопределено, Объект.Класс);
	Если НЕ ЗначениеЗаполнено(Объект.Класс) Тогда
		Возврат;
	КонецЕсли;
	
	ПрочитатьЗначенияТабличныхАтрибутов(ОбъектЧтенияНоменклатура, ОбъектЧтенияКласс, ДанныеТабличныхАтрибутов, НовыйИДСтроки);
	
	Найдено = СписочныеАтрибуты.НайтиСтроки(Новый Структура("ТипОбъекта, АтрибутКласса", 0, ПланыВидовХарактеристик.АтрибутыКласса.ТехКарты));
	Если Найдено.Количество() > 0 Тогда
		ДобавлениеСтрокТехКарты = Найдено[0].ДобавлениеСтрокТабЧастиВНоменклатуреКласса;
		Элементы.ТехКарты.ИзменятьСоставСтрок = ДобавлениеСтрокТехКарты;
	КонецЕсли;
	Найдено = СписочныеАтрибуты.НайтиСтроки(Новый Структура("ТипОбъекта, АтрибутКласса", 2, ПланыВидовХарактеристик.АтрибутыКласса.ТехОперации));
	Если Найдено.Количество() > 0 Тогда
		Элементы.СоставТехКарты.ИзменятьСоставСтрок = 
			Найдено[0].ДобавлениеСтрокТабЧастиВНоменклатуреКласса;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуРедактированияКласса(ВыбраннаяСтрока, Режим=0)
	
	Модифицированность = Ложь;
	УстановитьЭлементыУправленияРедактированием(Элементы, Ложь);
	
	Если Режим = 0 Тогда
		
		РеквизитыНоменклатуры = УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначенияРеквизитовОбъекта(
			ВыбраннаяСтрока, "Наименование, Код, Класс, Родитель, Статус, НаименованиеПолное, ЭтоГруппа, 
				|НомерПоСчетчику, ШагСчетчика, ПрисвоенНомерПоШаблону, ОбъектТОИР");
		
		Если РеквизитыНоменклатуры.ЭтоГруппа Тогда
			ВыбратьОбъектРедактирования(Неопределено);
			ОтменитьРедактированиеНаСервере();
			Возврат;
		КонецЕсли;
		
		ВыбратьОбъектРедактирования(ВыбраннаяСтрока);
		
		ИсточникЗаполнения = ВыбраннаяСтрока;
		Если НЕ ЗначениеЗаполнено(РеквизитыНоменклатуры.Статус) Тогда
			РеквизитыНоменклатуры.Статус = Перечисления.СтатусыОбъектовНСИ.Черновик;
		КонецЕсли;
		
		ЗаголовокРедактируемогоЭлемента = УправлениеНСИФункцииКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
			НСтр("ru='Редактирование номенклатуры классов: %1'"), РеквизитыНоменклатуры.Наименование);
		
		СведенияОНоменклатуре = РегистрыСведений.СведенияОНоменклатуреКлассов.ПолучитьСведенияОНоменклатуре(ВыбраннаяСтрока);
		
		ДатаСоздания   = СведенияОНоменклатуре.ДатаСоздания;
		Автор          = СведенияОНоменклатуре.Автор;
		ДатаИзменения  = СведенияОНоменклатуре.ДатаИзменения;
		АвторИзменения = СведенияОНоменклатуре.АвторИзменения;
		
	ИначеЕсли Режим = 1 Тогда
		
		ВыбратьОбъектРедактирования(Неопределено);
		
		Если ЗначениеЗаполнено(ВыбраннаяСтрока) Тогда
			РеквизитыВыбранного = УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначенияРеквизитовОбъекта(
				ВыбраннаяСтрока, "ЭтоГруппа, Родитель");
			ТекРодитель = ?(РеквизитыВыбранного.ЭтоГруппа, ВыбраннаяСтрока, РеквизитыВыбранного.Родитель);
		Иначе
			ТекстСообщения = НСтр("ru='Выберите группу, в которой требуется создать номенклатуру класса.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			ОтменитьРедактированиеНаСервере();
			Возврат;
		КонецЕсли;
		
		РеквизитыНоменклатуры = Новый Структура("Статус, Родитель, Код, Наименование, НаименованиеПолное, 
			|Класс, НомерПоСчетчику, ШагСчетчика, ПрисвоенНомерПоШаблону", 
			Перечисления.СтатусыОбъектовНСИ.Черновик, ТекРодитель, "", "", "",
			Справочники.Классы.ПустаяСсылка(), 0, 0, Ложь);
		
		ЗаголовокРедактируемогоЭлемента = УправлениеНСИФункцииКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
			НСтр("ru='Редактирование номенклатуры классов: Создание (Родитель: %1)'"), ТекРодитель);
		
		Если НЕ Элементы.НоменклатураСписок.ТекущийРодитель = ТекРодитель Тогда
			Элементы.НоменклатураСписок.ТекущийРодитель = ТекРодитель;
		КонецЕсли;
		
		ДатаСоздания   = ТекущаяДатаСеанса();
		Автор          = Пользователи.ТекущийПользователь();
		ДатаИзменения  = Дата(1, 1, 1);
		АвторИзменения = Справочники.Пользователи.ПустаяСсылка();
		
	ИначеЕсли Режим = 2 Тогда
		
		ВыбратьОбъектРедактирования(Неопределено);
		
		Объект.Код = "";
		
		РеквизитыНоменклатуры = УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначенияРеквизитовОбъекта(
			ВыбраннаяСтрока, "Наименование, Класс, Родитель, НаименованиеПолное, ЭтоГруппа");
		Если РеквизитыНоменклатуры.ЭтоГруппа Тогда
			ОтменитьРедактированиеНаСервере();
			Возврат;
		КонецЕсли;
		
		РеквизитыНоменклатуры.Вставить("Статус", Перечисления.СтатусыОбъектовНСИ.Черновик);
		РеквизитыНоменклатуры.Вставить("НомерПоСчетчику",        0);
		РеквизитыНоменклатуры.Вставить("ШагСчетчика",            0);
		РеквизитыНоменклатуры.Вставить("ПрисвоенНомерПоШаблону", Ложь);
		ИсточникЗаполнения = ВыбраннаяСтрока;
		
		ЗаголовокРедактируемогоЭлемента = УправлениеНСИФункцииКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
			НСтр("ru='Редактирование классов: Создание (Копирование:%1)'"), ВыбраннаяСтрока);
			
		ДатаСоздания   = ТекущаяДатаСеанса();
		Автор          = Пользователи.ТекущийПользователь();
		ДатаИзменения  = Дата(1, 1, 1);
		АвторИзменения = Справочники.Пользователи.ПустаяСсылка();
		
	КонецЕсли;
	
	// Поиск классов, которые можно использовать в текущей группе номенклатуры.
	МассивКлассов = ПолучитьСписокДоступныхКлассов(РеквизитыНоменклатуры.Родитель);
	Если Режим > 0 И НЕ ЗначениеЗаполнено(МассивКлассов) Тогда
		ТекстСообщения = УправлениеНСИФункцииКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
			НСтр("ru='В группе %1 нет классов, для которых можно создавать номенклатуру классов. 
				|Выберите группу, в которой требуется создать номенклатуру класса.'"),
			Строка(ТекРодитель));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		ОтменитьРедактированиеНаСервере();
		Возврат;
	Иначе
		СписокВыбора = Элементы.Класс.СписокВыбора;
		СписокВыбора.Очистить();
		Если ЗначениеЗаполнено(МассивКлассов) Тогда
			СписокВыбора.ЗагрузитьЗначения(МассивКлассов);
		КонецЕсли;
		СписокВыбора.Добавить(Справочники.Классы.ПустаяСсылка(), "Другие классы...");
		Если Режим = 1 Тогда
			Если МассивКлассов.Количество() = 1 Тогда
				РеквизитыНоменклатуры.Вставить("Класс", МассивКлассов[0]);
				ИсточникЗаполнения = МассивКлассов[0];
			Иначе
				ИсточникЗаполнения = Справочники.НоменклатураКласса.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Объект, РеквизитыНоменклатуры);
	
	// Заплонение объекта по реквизитам класса.
	Если ЗначениеЗаполнено(Объект.Класс) Тогда
		РеквизитыКласса = УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначенияРеквизитовОбъекта(
			Объект.Класс, "ОбъектыНоменклатуры, ШаблонКодаНоменклатуры, ШаблонНаименованияНоменклатуры");
		Объект.ОбъектыНоменклатуры = РеквизитыКласса.ОбъектыНоменклатуры;
		Объект.ШаблонКодаРодителя  = РеквизитыКласса.ШаблонКодаНоменклатуры;
		Объект.ШаблонНаименования  = РеквизитыКласса.ШаблонНаименованияНоменклатуры;
	Иначе 
		Объект.ОбъектыНоменклатуры = Ложь;
		Объект.ШаблонКодаРодителя = Справочники.ШаблоныЗаполнения.ПустаяСсылка();
		Объект.ШаблонНаименования = Справочники.ШаблоныЗаполнения.ПустаяСсылка();
	КонецЕсли;
	
	Элементы.Наименование.ТолькоПросмотр = (ЗначениеЗаполнено(Объект.ШаблонНаименования));
	
	УстановитьРежимТолькоПросмотра(НЕ ПравоИзмененияНоменклатуры);
	
	ЗаполнитьАтрибуты(ИсточникЗаполнения);
	
	ЗаполнитьЗначенияТабличныхАтрибутов(ИсточникЗаполнения);
	
	ДатаАвторСоздания  = ПредставлениеДатыАвтораИзменения(ДатаСоздания,  Автор);
	ДатаАвторИзменения = ПредставлениеДатыАвтораИзменения(ДатаИзменения, АвторИзменения);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Запись изменений в базу данных.

&НаСервере
Процедура ЗаписатьНаСервере()
	
	СтатусАктивный = (Объект.Статус = Перечисления.СтатусыОбъектовНСИ.Активный);
	Отказ = Ложь;
	
	// При записи выполняем формирование наименования по шаблону. 
	// Если сформировать не удастся - отказ.
	Если ЗначениеЗаполнено(Объект.ШаблонНаименования) Тогда
		НовоеНаименование = СформироватьНаименованиеНаСервере(СтатусАктивный, Отказ);
	Иначе
		НовоеНаименование = Объект.Наименование;
	КонецЕсли;
	
	Объект.Наименование = НовоеНаименование;
	
	Если СтатусАктивный Тогда
		ПроверитьЗаполнениеАтрибутов(Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// 1. Реквизиты шапки.
	ЭтоНовый = Ложь;
	Если ЗначениеЗаполнено(Объект.НоменклатураКласса.Ссылка) Тогда
		Изменено = Ложь;
		РеквизитыШапки = УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначенияРеквизитовОбъекта(
			Объект.НоменклатураКласса.Ссылка, "Наименование, НаименованиеПолное, Код, Класс, Статус,
				|НомерПоСчетчику, ШагСчетчика, ПрисвоенНомерПоШаблону, ОбъектТОИР");
		Для Каждого КлючИЗначение ИЗ РеквизитыШапки Цикл
			Если НЕ Объект[КлючИЗначение.Ключ] = КлючИЗначение.Значение Тогда
				Изменено = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Изменено = Истина;
		ЭтоНовый = Истина;
	КонецЕсли;
	
	Если Изменено Тогда
		СпрОбъект = ДанныеФормыВЗначение(Объект.НоменклатураКласса, Тип("СправочникОбъект.НоменклатураКласса"));
		ЗаполнитьЗначенияСвойств(СпрОбъект, Объект);
		Отказ = НЕ СпрОбъект.ПроверитьЗаполнение();
		Если Отказ Тогда 
			Возврат;
		КонецЕсли;
		
		Попытка
			СпрОбъект.Записать();
			ЗаполнитьЗначенияСвойств(Объект, СпрОбъект, "Код, НомерПоСчетчику, ШагСчетчика, ПрисвоенНомерПоШаблону");
			ЗначениеВДанныеФормы(СпрОбъект, Объект.НоменклатураКласса);
			
			Если НЕ РеквизитыШапки = Неопределено И НЕ Объект.Класс = РеквизитыШапки.Класс Тогда
				МассивОбъектов = Новый Массив;
				МассивОбъектов.Добавить(СпрОбъект.Ссылка);
				Справочники.Классы.ВосстановитьНаследованиеТабЧастей(МассивОбъектов);
			КонецЕсли;
			
		Исключение
			ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации("Запись номенклатуры класса", УровеньЖурналаРегистрации.Ошибка, СпрОбъект.Метаданные(), 
				СпрОбъект.Ссылка, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ВыбратьОбъектРедактирования(Неопределено);
			ОтменитьРедактированиеНаСервере();
			Возврат;
			
		КонецПопытки;
		
		Элементы.НоменклатураСписок.Обновить();
		Если ЭтоНовый Тогда
			Объект.Код = Объект.НоменклатураКласса.Код;
			Элементы.НоменклатураСписок.ТекущаяСтрока = Объект.НоменклатураКласса.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Запись номенклатуры класса", УровеньЖурналаРегистрации.Информация, 
		Метаданные.Справочники.НоменклатураКласса, Объект.НоменклатураКласса.Ссылка, "Начало записи");
	
	ЗаписатьАтрибуты(Изменено);
	
	ЗаписатьЗначенияТабличныхАтрибутов(Изменено);
	
	Если Изменено Тогда
		ТекПользователь = Пользователи.ТекущийПользователь();
		ДатаСобытия = ДатаСоздания;
		Если НЕ ЭтоНовый Тогда
			АвторИзменения = ТекПользователь;
			ДатаСобытия = ТекущаяДатаСеанса();
			ДатаИзменения = ДатаСобытия;
		КонецЕсли;
		
		РегистрыСведений.СведенияОНоменклатуреКлассов.ЗаписатьСведенияОНоменклатуре(
			Объект.НоменклатураКласса.Ссылка, ТекПользователь, ДатаСобытия, ЭтоНовый);
		
		ДатаАвторСоздания  = ПредставлениеДатыАвтораИзменения(ДатаСоздания,  Автор);
		ДатаАвторИзменения = ПредставлениеДатыАвтораИзменения(ДатаИзменения, АвторИзменения);
		
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Запись номенклатуры класса", УровеньЖурналаРегистрации.Информация, 
		Метаданные.Справочники.НоменклатураКласса, Объект.НоменклатураКласса.Ссылка, "Окончание записи");
	
	Модифицированность = Ложь;
	УстановитьЭлементыУправленияРедактированием(Элементы, Ложь);
	
КонецПроцедуры

&НаСервере
Функция ТекстЗапросаИзмененияАтрибутов()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТаблицаАтрибутов.АтрибутКласса,
		|	ТаблицаАтрибутов.ЗначениеАтрибутаКласса,
		|	ТаблицаАтрибутов.ЗначениеПоУмолчанию,
		|	ТаблицаАтрибутов.МножественноеЗначение,
		|	ТаблицаАтрибутов.ЭтоСтроковыйАтрибут
		|ПОМЕСТИТЬ ВТ_ЗначенияАтрибутов
		|ИЗ
		|	&ТаблицаАтрибутов КАК ТаблицаАтрибутов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗначенияАтрибутовКласса.АтрибутКласса,
		|	ЗначенияАтрибутовКласса.ЗначениеАтрибутаКласса
		|ПОМЕСТИТЬ ВТ_ЗаписанныеЗначения
		|ИЗ
		|	РегистрСведений.ЗначенияАтрибутовКласса КАК ЗначенияАтрибутовКласса
		|ГДЕ
		|	ЗначенияАтрибутовКласса.Класс = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВТ_ЗначенияАтрибутов.АтрибутКласса, ВТ_ЗаписанныеЗначения.АтрибутКласса) КАК АтрибутКласса,
		|	ЕСТЬNULL(ВТ_ЗначенияАтрибутов.ЗначениеАтрибутаКласса, НЕОПРЕДЕЛЕНО) КАК ЗначениеАтрибутаКласса,
		|	ВЫБОР
		|		КОГДА НЕ ВТ_ЗначенияАтрибутов.ЗначениеАтрибутаКласса ЕСТЬ NULL
		|				И НЕ ВТ_ЗначенияАтрибутов.ЗначениеАтрибутаКласса = ВТ_ЗначенияАтрибутов.ЗначениеПоУмолчанию
		|				И НЕ ВТ_ЗначенияАтрибутов.ЗначениеАтрибутаКласса = ЕСТЬNULL(ВТ_ЗаписанныеЗначения.ЗначениеАтрибутаКласса, НЕОПРЕДЕЛЕНО)
		|			ТОГДА 1
		|		КОГДА ВТ_ЗначенияАтрибутов.ЗначениеАтрибутаКласса ЕСТЬ NULL
		|			ТОГДА -1
		|	КОНЕЦ КАК ВидОперации
		|ИЗ
		|	ВТ_ЗначенияАтрибутов КАК ВТ_ЗначенияАтрибутов
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ЗаписанныеЗначения КАК ВТ_ЗаписанныеЗначения
		|		ПО ВТ_ЗначенияАтрибутов.АтрибутКласса = ВТ_ЗаписанныеЗначения.АтрибутКласса
		|ГДЕ
		|	(ВТ_ЗначенияАтрибутов.ЗначениеАтрибутаКласса ЕСТЬ NULL
		|			ИЛИ (НЕ ВТ_ЗначенияАтрибутов.МножественноеЗначение ИЛИ ВТ_ЗначенияАтрибутов.ЭтоСтроковыйАтрибут)
		|				И НЕ ВТ_ЗначенияАтрибутов.ЗначениеАтрибутаКласса = ВТ_ЗначенияАтрибутов.ЗначениеПоУмолчанию
		|				И НЕ ВТ_ЗначенияАтрибутов.ЗначениеАтрибутаКласса = ЕСТЬNULL(ВТ_ЗаписанныеЗначения.ЗначениеАтрибутаКласса, НЕОПРЕДЕЛЕНО))";
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Процедура ЗаписатьАтрибуты(Изменено)
	
	ЗаписыватьАтрибуты = Ложь;
	
	ТаблицаАтрибутов = ПоляАтрибутовКласса.Выгрузить(Новый Структура("ЭтоВложенныйАтрибут", Ложь));
	ТаблицаАтрибутов.Колонки.Добавить("ЭтоСтроковыйАтрибут", Новый ОписаниеТипов("Булево"));
	ТипСтрока = Тип("Строка");
	Для Каждого СтрокаАтрибута ИЗ ТаблицаАтрибутов Цикл
		СтрокаАтрибута.ЭтоСтроковыйАтрибут = СтрокаАтрибута.ТипЗначения.СодержитТип(ТипСтрока);
		Если НЕ ЗаписыватьАтрибуты 
				И (НЕ СтрокаАтрибута.МножественноеЗначение ИЛИ СтрокаАтрибута.ЭтоСтроковыйАтрибут) 
				И ЗначениеЗаполнено(СтрокаАтрибута.ИмяПоля) Тогда
			ЗаписыватьАтрибуты = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЗаписыватьАтрибуты Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Объект.НоменклатураКласса.Ссылка);
	Запрос.УстановитьПараметр("ТаблицаАтрибутов", ТаблицаАтрибутов);
	Запрос.Текст = ТекстЗапросаИзмененияАтрибутов();
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.ЗначенияАтрибутовКласса.СоздатьМенеджерЗаписи();
		Запись.Класс = Объект.НоменклатураКласса.Ссылка;
		Запись.АтрибутКласса = Выборка.АтрибутКласса;
		Если Выборка.ВидОперации > 0 Тогда
			Запись.ЗначениеАтрибутаКласса = Выборка.ЗначениеАтрибутаКласса;
			Запись.Записать();
		Иначе
			Запись.Удалить();
		КонецЕсли;
		Изменено = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СформироватьНаименованиеСтрокиТабличногоАтрибута(СтрокаТЧ, КодЭлемента)
	
	Если СтрокаТЧ.АтрибутКласса = ПланыВидовХарактеристик.АтрибутыКласса.ТехКарты Тогда
		Если ПустаяСтрока(СтрокаТЧ.Наименование) Тогда
			НайденоТипТехКарты = Объект.ЗначенияТабличныхАтрибутов.НайтиСтроки(Новый Структура(
				"ИДСтрокиРодителя, АтрибутКласса, ИДСтроки, АтрибутТаблицы",
				СтрокаТЧ.ИДСтрокиРодителя, СтрокаТЧ.АтрибутКласса, СтрокаТЧ.ИДСтроки,
				ПланыВидовХарактеристик.АтрибутыКласса.ТипТехКарты));
			Если НайденоТипТехКарты.Количество() > 0 И ЗначениеЗаполнено(НайденоТипТехКарты[0].ЗначениеАтрибутаТаблицы) Тогда
				Результат = Строка(НайденоТипТехКарты[0].ЗначениеАтрибутаТаблицы);
			Иначе
				Результат = Строка(СтрокаТЧ.ИсточникЗначений);
			КонецЕсли;
		Иначе
			Результат = СтрокаТЧ.Наименование;
		КонецЕсли;
	Иначе
		Результат = Строка(СтрокаТЧ.ИсточникЗначений) + "/" + ШаблоныСтрокКлиентСервер.УдалитьНезначащиеНули(КодЭлемента);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ТекстЗапросаСтрокиТабличныхАтрибутов()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СтрокиТабличныхАтрибутов.ИДСтрокиРодителя,
		|	СтрокиТабличныхАтрибутов.АтрибутКласса,
		|	СтрокиТабличныхАтрибутов.ИДСтроки,
		|	СтрокиТабличныхАтрибутов.Порядок,
		|	СтрокиТабличныхАтрибутов.СтатусНаследования,
		|	СтрокиТабличныхАтрибутов.ИсточникЗначений,
		|	СтрокиТабличныхАтрибутов.ЗначениеАтрибутаКласса,
		|	СтрокиТабличныхАтрибутов.Наименование
		|ПОМЕСТИТЬ ВТ_СтрокиТабличныхАтрибутовНовые
		|ИЗ
		|	&СтрокиТабличныхАтрибутов КАК СтрокиТабличныхАтрибутов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗначенияТабличныхАтрибутов.ИДСтрокиРодителя,
		|	ЗначенияТабличныхАтрибутов.АтрибутКласса,
		|	ЗначенияТабличныхАтрибутов.АтрибутТаблицы,
		|	ЗначенияТабличныхАтрибутов.ЗначениеАтрибутаТаблицы,
		|	ЗначенияТабличныхАтрибутов.ИДСтроки
		|ПОМЕСТИТЬ ВТ_ЗначенияТабличныхАтрибутов
		|ИЗ
		|	&ЗначенияТабличныхАтрибутов КАК ЗначенияТабличныхАтрибутов";
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Функция ТекстЗапросаДанныеТабличныхАтрибутов()
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ТаблицаАтрибутов.АтрибутКласса КАК АтрибутКласса,
		|	ВТ_ТаблицаАтрибутов.Порядок КАК Порядок
		|ИЗ
		|	ВТ_ТаблицаАтрибутов КАК ВТ_ТаблицаАтрибутов
		|ГДЕ
		|	ВТ_ТаблицаАтрибутов.МножественноеЗначение
		|	И ВТ_ТаблицаАтрибутов.КлассТабличнаяЧасть
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,
		|	АтрибутКласса
		|АВТОУПОРЯДОЧИВАНИЕ";
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере 
Функция ТекстЗапросаЗначенияАтрибутовСтрокВременныеТаблицы()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВТ_СтрокиТабличныхАтрибутовНовые.ЗначениеАтрибутаКласса КАК Объект,
		|	ВТ_ЗначенияТабличныхАтрибутов.АтрибутТаблицы,
		|	ВТ_ЗначенияТабличныхАтрибутов.ЗначениеАтрибутаТаблицы
		|ПОМЕСТИТЬ ВТ_ЗначенияАтрибутовСтрокДляЗаписи
		|ИЗ
		|	ВТ_СтрокиТабличныхАтрибутовНовые КАК ВТ_СтрокиТабличныхАтрибутовНовые
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗначенияТабличныхАтрибутов КАК ВТ_ЗначенияТабличныхАтрибутов
		|		ПО ВТ_СтрокиТабличныхАтрибутовНовые.ИДСтрокиРодителя = ВТ_ЗначенияТабличныхАтрибутов.ИДСтрокиРодителя
		|			И ВТ_СтрокиТабличныхАтрибутовНовые.АтрибутКласса = ВТ_ЗначенияТабличныхАтрибутов.АтрибутКласса
		|			И ВТ_СтрокиТабличныхАтрибутовНовые.ИДСтроки = ВТ_ЗначенияТабличныхАтрибутов.ИДСтроки
		|ГДЕ
		|	ВТ_ЗначенияТабличныхАтрибутов.АтрибутТаблицы ССЫЛКА ПланВидовХарактеристик.АтрибутыКласса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СтрокиТабличныхАтрибутовНовые.ЗначениеАтрибутаКласса КАК Объект,
		|	ВТ_СтрокиТабличныхАтрибутовПодчиненныхНовые.АтрибутКласса,
		|	ВТ_СтрокиТабличныхАтрибутовПодчиненныхНовые.ЗначениеАтрибутаКласса КАК ЗначениеАтрибутаКласса,
		|	ВТ_СтрокиТабличныхАтрибутовПодчиненныхНовые.ИсточникЗначений КАК ИсточникЗначений,
		|	ВТ_СтрокиТабличныхАтрибутовПодчиненныхНовые.Порядок
		|ПОМЕСТИТЬ ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи
		|ИЗ
		|	ВТ_СтрокиТабличныхАтрибутовНовые КАК ВТ_СтрокиТабличныхАтрибутовНовые
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СтрокиТабличныхАтрибутовНовые КАК ВТ_СтрокиТабличныхАтрибутовПодчиненныхНовые
		|		ПО ВТ_СтрокиТабличныхАтрибутовНовые.ИДСтроки = ВТ_СтрокиТабличныхАтрибутовПодчиненныхНовые.ИДСтрокиРодителя
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Номенклатура,
		|	ВТ_СтрокиТабличныхАтрибутовНовые.АтрибутКласса,
		|	ВТ_СтрокиТабличныхАтрибутовНовые.ЗначениеАтрибутаКласса,
		|	ВТ_СтрокиТабличныхАтрибутовНовые.ИсточникЗначений,
		|	ВТ_СтрокиТабличныхАтрибутовНовые.Порядок
		|ИЗ
		|	ВТ_СтрокиТабличныхАтрибутовНовые КАК ВТ_СтрокиТабличныхАтрибутовНовые
		|ГДЕ
		|	ВТ_СтрокиТабличныхАтрибутовНовые.ИДСтрокиРодителя = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтрокиТабличныхАтрибутов.Объект,
		|	СтрокиТабличныхАтрибутов.АтрибутКласса,
		|	СтрокиТабличныхАтрибутов.ЗначениеАтрибутаКласса,
		|	СтрокиТабличныхАтрибутов.ИсточникЗначений,
		|	СтрокиТабличныхАтрибутов.Порядок,
		|	СтрокиТабличныхАтрибутов.СтатусНаследования,
		|	СтрокиТабличныхАтрибутов.Уровень,
		|	СтрокиТабличныхАтрибутов.УровеньТекКласса
		|ПОМЕСТИТЬ ВТ_СтрокиТабличныхАтрибутов
		|ИЗ
		|	&СтрокиТабличныхАтрибутов КАК СтрокиТабличныхАтрибутов";
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере 
Функция ТекстЗапросаЗначенияАтрибутовСтрок()
	
	// 0 - Значения атрибутов строк таб.частей.
	// 1 - Строки табличных атрибутов.
	// 2 - Ненаследуемые атрибуты.
	// 3 - Переименование строк.
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВТ_ЗначенияАтрибутовСтрокДляЗаписи.Объект,
		|	ВТ_ЗначенияАтрибутовСтрокДляЗаписи.АтрибутТаблицы КАК АтрибутКласса,
		|	ВТ_ЗначенияАтрибутовСтрокДляЗаписи.ЗначениеАтрибутаТаблицы КАК ЗначениеАтрибутаКласса
		|ИЗ
		|	ВТ_ЗначенияАтрибутовСтрокДляЗаписи КАК ВТ_ЗначенияАтрибутовСтрокДляЗаписи
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаАтрибутов КАК ВТ_ТаблицаАтрибутов
		|		ПО (ВТ_ТаблицаАтрибутов.Объект = ВТ_ЗначенияАтрибутовСтрокДляЗаписи.Объект)
		|			И (ВТ_ТаблицаАтрибутов.АтрибутКласса = ВТ_ЗначенияАтрибутовСтрокДляЗаписи.АтрибутТаблицы)
		|ГДЕ
		|	(ВТ_ТаблицаАтрибутов.ЗначениеАтрибутаКласса ЕСТЬ NULL
		|			ИЛИ НЕ ВТ_ЗначенияАтрибутовСтрокДляЗаписи.ЗначениеАтрибутаТаблицы = ВТ_ТаблицаАтрибутов.ЗначениеАтрибутаКласса)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи.Объект КАК Объект,
		|	ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи.АтрибутКласса,
		|	ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи.ЗначениеАтрибутаКласса,
		|	ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи.Порядок КАК Порядок,
		|	1 КАК ВидДействия
		|ИЗ
		|	ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи КАК ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтрокиТабличныхАтрибутов КАК ВТ_СтрокиТабличныхАтрибутов
		|		ПО ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи.Объект = ВТ_СтрокиТабличныхАтрибутов.Объект
		|			И ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи.АтрибутКласса = ВТ_СтрокиТабличныхАтрибутов.АтрибутКласса
		|			И ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи.ЗначениеАтрибутаКласса = ВТ_СтрокиТабличныхАтрибутов.ЗначениеАтрибутаКласса
		|ГДЕ
		|	(ВТ_СтрокиТабличныхАтрибутов.Порядок ЕСТЬ NULL
		|			ИЛИ НЕ ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи.Порядок = ВТ_СтрокиТабличныхАтрибутов.Порядок)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_СтрокиТабличныхАтрибутов.Объект,
		|	ВТ_СтрокиТабличныхАтрибутов.АтрибутКласса,
		|	ВТ_СтрокиТабличныхАтрибутов.ЗначениеАтрибутаКласса,
		|	0,
		|	-1
		|ИЗ
		|	ВТ_СтрокиТабличныхАтрибутов КАК ВТ_СтрокиТабличныхАтрибутов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи КАК ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи
		|		ПО ВТ_СтрокиТабличныхАтрибутов.Объект = ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи.Объект
		|			И ВТ_СтрокиТабличныхАтрибутов.АтрибутКласса = ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи.АтрибутКласса
		|			И ВТ_СтрокиТабличныхАтрибутов.ЗначениеАтрибутаКласса = ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи.ЗначениеАтрибутаКласса
		|ГДЕ
		|	ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи.ЗначениеАтрибутаКласса ЕСТЬ NULL
		//|	И ВТ_СтрокиТабличныхАтрибутов.Уровень = ВТ_СтрокиТабличныхАтрибутов.УровеньТекКласса
		|	И ВТ_СтрокиТабличныхАтрибутов.ЗначениеАтрибутаКласса ССЫЛКА Справочник.НоменклатураКласса
		|	И НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ВТ_СтрокиТабличныхАтрибутов.ЗначениеАтрибутаКласса КАК Справочник.НоменклатураКласса).ПометкаУдаления, ИСТИНА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_СтрокиТабличныхАтрибутов.Объект,
		|	ВТ_СтрокиТабличныхАтрибутов.АтрибутКласса,
		|	ВТ_СтрокиТабличныхАтрибутов.ИсточникЗначений КАК ЗначениеАтрибутаКласса
		|ИЗ
		|	ВТ_СтрокиТабличныхАтрибутов КАК ВТ_СтрокиТабличныхАтрибутов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи КАК ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи
		|		ПО ВТ_СтрокиТабличныхАтрибутов.Объект = ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи.Объект
		|			И ВТ_СтрокиТабличныхАтрибутов.АтрибутКласса = ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи.АтрибутКласса
		|			И ВТ_СтрокиТабличныхАтрибутов.ИсточникЗначений = ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи.ИсточникЗначений
		|ГДЕ
		|	ВТ_МножественныеЗначенияТабличныхАтрибутовДляЗаписи.ЗначениеАтрибутаКласса ЕСТЬ NULL
		|	И ВТ_СтрокиТабличныхАтрибутов.СтатусНаследования = 3
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СтрокиТабличныхАтрибутовНовые.ЗначениеАтрибутаКласса КАК ЗначениеАтрибутаКласса,
		|	ВТ_СтрокиТабличныхАтрибутовНовые.Наименование,
		|	ВТ_СтрокиТабличныхАтрибутовНовые.ИсточникЗначений,
		|	ВТ_СтрокиТабличныхАтрибутовНовые.ИДСтрокиРодителя,
		|	ВТ_СтрокиТабличныхАтрибутовНовые.АтрибутКласса,
		|	ВТ_СтрокиТабличныхАтрибутовНовые.ИДСтроки
		|ИЗ
		|	ВТ_СтрокиТабличныхАтрибутовНовые КАК ВТ_СтрокиТабличныхАтрибутовНовые
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НоменклатураКласса КАК НоменклатураКласса
		|		ПО ВТ_СтрокиТабличныхАтрибутовНовые.ЗначениеАтрибутаКласса = НоменклатураКласса.Ссылка
		|ГДЕ
		|	(ВТ_СтрокиТабличныхАтрибутовНовые.Наименование <> НоменклатураКласса.Наименование
		|			ИЛИ ВТ_СтрокиТабличныхАтрибутовНовые.Наименование = """")
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗначениеАтрибутаКласса
		|АВТОУПОРЯДОЧИВАНИЕ";
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Процедура ЗаписатьЗначенияТабличныхАтрибутов(Изменено)
	
	// 1. Запись номенклатуры новых строк.
	Для Каждого СтрокаТЧ ИЗ Объект.СтрокиТабличныхАтрибутов Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ЗначениеАтрибутаКласса) Тогда
			НоваяНоменклатура = Справочники.НоменклатураКласса.СоздатьЭлемент();
			
			НоваяНоменклатура.Класс  = СтрокаТЧ.ИсточникЗначений;
			НоваяНоменклатура.Статус = Перечисления.СтатусыОбъектовНСИ.Активный;
			НоваяНоменклатура.Родитель = ПолучитьРодителяПоКлассу(СтрокаТЧ.ИсточникЗначений);
			НоваяНоменклатура.Записать();
			
			НоваяНоменклатура.Наименование = 
				СформироватьНаименованиеСтрокиТабличногоАтрибута(СтрокаТЧ, НоваяНоменклатура.Код);
			
			НоваяНоменклатура.Записать();
			
			СтрокаТЧ.ЗначениеАтрибутаКласса = НоваяНоменклатура.Ссылка;
			СтрокаТЧ.Наименование           = НоваяНоменклатура.Наименование;
			Изменено = Истина;
		КонецЕсли;
	КонецЦикла;
	
	// 2. Чтение атрибутов классов.
	
	МассивНоменклатуры = Объект.СтрокиТабличныхАтрибутов.Выгрузить().ВыгрузитьКолонку("ЗначениеАтрибутаКласса");
	МассивНоменклатуры.Добавить(Объект.НоменклатураКласса.Ссылка);
	ДанныеДляЧтения = Справочники.НоменклатураКласса.ПрочитатьДанныеДляЧтенияНоменклатуры(МассивНоменклатуры);
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	Справочники.НоменклатураКласса.ПолучитьТаблицуАтрибутов(МассивНоменклатуры, ДанныеДляЧтения, МенеджерВТ);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.УстановитьПараметр("СтрокиТабличныхАтрибутов",   Объект.СтрокиТабличныхАтрибутов.Выгрузить());
	Запрос.УстановитьПараметр("ЗначенияТабличныхАтрибутов", Объект.ЗначенияТабличныхАтрибутов.Выгрузить());
	Запрос.Текст = ТекстЗапросаСтрокиТабличныхАтрибутов();
	Запрос.Выполнить();
	
	// Таблица списочных атрибутов строк таб.частей (вложеные таб.части).
	Запрос.Текст = ТекстЗапросаДанныеТабличныхАтрибутов();
	ТаблицаАтрибутов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("АтрибутКласса");
	
	// Записанные строки таб.частей.
	СтрокиТабличныхАтрибутов = Справочники.НоменклатураКласса.ПолучитьСтрокиТабличныхАтрибутов(МассивНоменклатуры, ТаблицаАтрибутов, ДанныеДляЧтения);
	
	// Сравниваем записанные строки с данными формы.
	Запрос.УстановитьПараметр("СтрокиТабличныхАтрибутов", СтрокиТабличныхАтрибутов);
	Запрос.УстановитьПараметр("Номенклатура", Объект.НоменклатураКласса.Ссылка);
	Запрос.Текст = ТекстЗапросаЗначенияАтрибутовСтрокВременныеТаблицы();
	Запрос.Выполнить();
	
	Запрос.Текст = ТекстЗапросаЗначенияАтрибутовСтрок();
	Результаты = Запрос.ВыполнитьПакет();
	
	// 3. Запись изменений.
	
	// Значения атрибутов строк таб.частей.
	Выборка = Результаты[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.ЗначенияАтрибутовКласса.СоздатьМенеджерЗаписи();
		Запись.Класс                  = Выборка.Объект;
		Запись.АтрибутКласса          = Выборка.АтрибутКласса;
		Запись.ЗначениеАтрибутаКласса = Выборка.ЗначениеАтрибутаКласса;
		Запись.Записать();
		Изменено = Истина;
	КонецЦикла;
	
	// Строки табличных атрибутов.
	Выборка = Результаты[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.МножественныеЗначенияАтрибутов.СоздатьМенеджерЗаписи();
		Запись.Класс                  = Выборка.Объект;
		Запись.АтрибутКласса          = Выборка.АтрибутКласса;
		Запись.ЗначениеАтрибутаКласса = Выборка.ЗначениеАтрибутаКласса;
		Если Выборка.ВидДействия > 0 Тогда
			Запись.Порядок = Выборка.Порядок;
			Запись.ИспользуемоеЗначение = Истина;
			Запись.ТабличныйАтрибут = Истина;
			Запись.Записать();
		Иначе
			Запись.Удалить();
		КонецЕсли;
		Изменено = Истина;
	КонецЦикла;
	
	// Ненаследуемые атрибуты.
	Выборка = Результаты[2].Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.НенаследуемыеЗначения.СоздатьМенеджерЗаписи();
		Запись.Класс                  = Выборка.Объект;
		Запись.АтрибутКласса          = Выборка.АтрибутКласса;
		Запись.ЗначениеАтрибутаКласса = Выборка.ЗначениеАтрибутаКласса;
		Запись.Записать();
		Изменено = Истина;
	КонецЦикла;
	
	// Переименование строк.
	Выборка = Результаты[3].Выбрать();
	Пока Выборка.Следующий() Цикл
		СпрОбъект = Выборка.ЗначениеАтрибутаКласса.ПолучитьОбъект();
		СпрОбъект.Наименование = СформироватьНаименованиеСтрокиТабличногоАтрибута(Выборка, СпрОбъект.Код);
		СпрОбъект.Записать();
		Изменено = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнениеАтрибутов(Отказ)
	
	ШаблонСообщения = НСтр("ru='Значение атрибута ''%1'' не заполнено.'");
	
	ТаблицаАтрибутов = ПоляАтрибутовКласса.Выгрузить(Новый Структура("ЭтоВложенныйАтрибут", Ложь));
	Для Каждого СтрокаАтрибута ИЗ ТаблицаАтрибутов Цикл
		Если НЕ СтрокаАтрибута.ЭтоВложенныйАтрибут И НЕ СтрокаАтрибута.ЭтотАтрибутВШаблоне
				И СтрокаАтрибута.РежимЗаполнения = Перечисления.РежимыЗаполненияАтрибутов.ОбязательныйДляНоменклатуры 
				И ЗначениеЗаполнено(СтрокаАтрибута.ИмяПоля) И НЕ ЗначениеЗаполнено(СтрокаАтрибута.ЗначениеАтрибутаКласса) Тогда
			ОбщегоНазначения.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонСообщения, Строка(СтрокаАтрибута.АтрибутКласса)), Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПредставлениеДатыАвтораИзменения(Дата, Автор)
	
	Если ЗначениеЗаполнено(Дата) Тогда
		ДатаПредставление = Формат(Дата, "ДЛФ=DT");
		ДатаЗаполнена = Истина;
	Иначе
		ДатаПредставление = "";
		ДатаЗаполнена = Ложь;
	КонецЕсли;
	
	АвторЗаполнен = ЗначениеЗаполнено(Автор);
	
	Если НЕ ДатаЗаполнена И НЕ АвторЗаполнен Тогда
		Результат = НСтр("ru='(нет данных)'");
	ИначеЕсли НЕ ДатаЗаполнена Тогда
		Результат = Строка(Автор);
	Иначе
		Результат = ДатаПредставление + ?(АвторЗаполнен, " " + Строка(Автор), "");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // } Гкс-[TOIR-1/00000092] Однодворцев И. от 27.06.2019.

&НаСервереБезКонтекста
Функция ПолучитьРодителяПоКлассу(Класс)
	
	Возврат Справочники.НоменклатураКласса.ПолучитьРодителяПоКлассу(Класс);	
	
КонецФункции

&НаКлиенте
Процедура СоздатьОбъектТОиР(Команда)

	СоздатьОбъектТОИРНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьОбъектТОИРНаСервере()
	
	
	
КонецПроцедуры 
 
#КонецОбласти
