#Область ОбработчикиСобытий

&Вместо("ОбработкаПолученияПолейПредставления")
Процедура Расш_гкс_ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	Возврат;
КонецПроцедуры

&Вместо("ОбработкаПолученияПредставления")
Процедура Расш_гкс_ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Возврат;
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&ИзменениеИКонтроль("ДобавитьКомандыПечати")
Процедура Расш_гкс_ДобавитьКомандыПечати(КомандыПечати)

	// Паспорт объекта ремонта
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Справочник.торо_ОбъектыРемонта";
	КомандаПечати.Идентификатор = "ПаспортОР";
	#Удаление
	КомандаПечати.Представление = НСтр("ru = 'Паспорт объекта ремонта'");
	#КонецУдаления
	#Вставка
	КомандаПечати.Представление = НСтр("es='El pasaporte del objeto de la reparación';ru='Паспорт объекта ремонта';en='Passport of the object of repair'");
	#КонецВставки
	КомандаПечати.Обработчик = "торо_Печать.ЗапроситьДопПараметрыПечатиОР";
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);

КонецПроцедуры

#КонецОбласти