#Область ОбработчикиСобытий

&После("ПриЗаписи")
Процедура Расш_гкс_ПриЗаписи(Отказ)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	гкс_ТекущиеФМОР.ТМ КАК ТМ
		|ИЗ
		|	РегистрСведений.гкс_ТекущиеФМОР КАК гкс_ТекущиеФМОР
		|ГДЕ
		|	гкс_ТекущиеФМОР.ОР = &Ссылка И Не гкс_ТекущиеФМОР.ТМ.ПометкаУдаления = &ПометкаУдаления";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ПометкаУдаления", ПометкаУдаления);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() = ложь Тогда 
		Выборка = РезультатЗапроса.Выбрать();	
		Выборка.Следующий();
		ТекущийОбъектТехническоеМесто = Выборка.ТМ.ПолучитьОбъект();
		ТекущийОбъектТехническоеМесто.УстановитьПометкуУдаления(ПометкаУдаления);
	КонецЕсли;
	
	Если НЕ Отказ Тогда 
		гкс_ОбщегоНазначенияСервер.ОбновитьКодировкиОР(Ссылка);;
	КонецЕсли;
КонецПроцедуры

&ИзменениеИКонтроль("ПередЗаписью")
Процедура Расш_гкс_ПередЗаписью(Отказ)

	Если НЕ ЭтоНовый() Тогда
		Если ПодразделениеИсполнитель <> Ссылка.ПодразделениеИсполнитель Тогда
			ДополнительныеСвойства.Вставить("НеобходимаРегистрацияЗаявокДляМобильныхБригад", Истина);
		КонецЕсли;
	Иначе
		Если ДополнительныеСвойства.Свойство("ТекСтруктураИерархии") И ДополнительныеСвойства.Свойство("РодительИерархии") Тогда
			СсылкаНаОбъект = торо_ОбщегоНазначения.ПолучитьСсылкуНаОбъект(ЭтотОбъект);

			Попытка
				торо_РаботаСИерархией20.ВключитьНовыйОбъектРемонтаВИерархию(СсылкаНаОбъект, ДополнительныеСвойства.ТекСтруктураИерархии, ДополнительныеСвойства.РодительИерархии, Отказ, ОбменДанными.Загрузка);
			Исключение
				#Удаление
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Исключение'"), УровеньЖурналаРегистрации.Предупреждение, 
				#КонецУдаления
				#Вставка
				ЗаписьЖурналаРегистрации(НСтр("es='La excepción';ru='Исключение';en='An exception'"), УровеньЖурналаРегистрации.Предупреждение, 
				#КонецВставки
				Метаданные.Справочники.торо_ОбъектыРемонта,,ОписаниеОшибки());
				Отказ = Истина;
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	#Вставка
	Если ЭтоГруппа = Ложь Тогда 
		Если ТипОбъекта = Перечисления.торо_ТипыОбъектовRCM.ФункциональноеМесто Тогда 
			Направление = Неопределено;
			ЭтоАктив = Ложь;
			ВнешнийОбъект = Ложь;
			ИнвентарныйНомер = "";
			СрокПолезногоИспользования = 0;
			Если ЗначениеЗаполнено(ДатаВводаВЭксплуатацию) И (ЗначениеЗаполнено(ДатаВыпуска) = Ложь ИЛИ ДатаВводаВЭксплуатацию < ДатаВыпуска) Тогда 
				ДатаВыпуска = ДатаВводаВЭксплуатацию - 1;
			КонецЕсли;
		ИначеЕсли ЗначениеЗаполнено(ТипОбъекта) = Ложь Тогда 
			ТипОбъекта = Перечисления.торо_ТипыОбъектовRCM.Объект;
		КонецЕсли;
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	торо_ОбъектыРемонта.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
			|ГДЕ
			|	торо_ОбъектыРемонта.Ссылка = &Ссылка
			|	И НЕ торо_ОбъектыРемонта.ТиповойОР = &ТиповойОР";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("ТиповойОР", ТиповойОР);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() = Ложь Тогда 
			НаборЗаписейРегистраторо_ОбъектыДляПроверкиТребованийФМ = 
				РегистрыСведений.торо_ОбъектыДляПроверкиТребованийФМ.СоздатьНаборЗаписей();
			НаборЗаписейРегистраторо_ОбъектыДляПроверкиТребованийФМ.Отбор.Объект.Установить(Ссылка);
			НоваяСтрокаНабораЗаписей = НаборЗаписейРегистраторо_ОбъектыДляПроверкиТребованийФМ.Добавить();
			НоваяСтрокаНабораЗаписей.Объект = Ссылка;
			НоваяСтрокаНабораЗаписей.Период = ТекущаяДата();
			НаборЗаписейРегистраторо_ОбъектыДляПроверкиТребованийФМ.Записать();
		КонецЕсли;
	КонецЕсли;
	
	// Гкс+[TOIR20-582] Зозуля А.В. от 27.05.2025. Добавлено:{
	Если Не ОбменДанными.Загрузка Тогда
		Если Не ЗначениеЗаполнено(Подразделение) И 
			(ТипОбъекта = Перечисления.торо_ТипыОбъектовRCM.Объект Или ТипОбъекта = Перечисления.торо_ТипыОбъектовRCM.ФункциональноеМесто) Тогда
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не заполнено подразделение'"),, "Объект.Подразделение");
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПодразделениеИсполнитель) И ТипОбъекта = Перечисления.торо_ТипыОбъектовRCM.Объект Тогда
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не заполнено подразделение-исполнитель'"),, "Объект.ПодразделениеИсполнитель");
		КонецЕсли;
	КонецЕсли;
	// } Гкс-[TOIR20-582] Зозуля А.В. от 27.05.2025.
	#КонецВставки
КонецПроцедуры

&ИзменениеИКонтроль("ПриКопировании")
Процедура Расш_гкс_ПриКопировании(ОбъектКопирования)

	#Вставка
	Если ЭтоГруппа = ложь Тогда 
		// Гкс+[TOIR20-131] Селимов от 14.07.2020. Добавлено:{
		Если Не Родитель.ЭтоГруппа Тогда
			Родитель = Неопределено;			
		КонецЕсли; // } Гкс-[TOIR20-131] 
	#КонецВставки
	УдалитьНаборСвойств = Неопределено;
	НеУчаствуетВПланировании = Ложь;
	#Вставка
	КонецЕсли;
	#КонецВставки

КонецПроцедуры

#КонецОбласти