#Область ОбработчикиСобытий

 // Гкс+[TOIR20-677] Оселедько В.С. от 01.08.2025. Добавлено:{
&Перед("ОбработкаПолученияФормы")
Процедура гкс_ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		
		ВремяНачала = ОценкаПроизводительности.НачатьЗамерВремени();
		Параметры.Вставить("ВремяНачалаОткрытияФормы", ВремяНачала);
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма = Метаданные.Документы.торо_ЗаявкаНаРемонт.Формы.ФормаДокумента.Имя;		
		
	ИначеЕсли ВидФормы = "ФормаСписка" Тогда	
		
		ВремяНачала = ОценкаПроизводительности.НачатьЗамерВремени();
		Параметры.Вставить("ВремяНачалаОткрытияФормы", ВремяНачала);
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма = Метаданные.Документы.торо_ЗаявкаНаРемонт.Формы.ФормаСписка.Имя;
		
	КонецЕсли;
			
КонецПроцедуры // Гкс+[TOIR20-677]

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// гкс+ [Релиз 1] Куст 17.03.2020
Функция ПечатьНарядЗадание(МассивОбъектов, ПараметрыПечати, НовыйСиноним)
	// Гкс+[TOIR20-504] Вялых Д.А. от 15.01.2025. Добавлено:{
	Если НовыйСиноним = "Техническое задание (выбор ПО) вер 2" Тогда
		ЭтоНоваяВерсияМакета = Истина;
	Иначе
		ЭтоНоваяВерсияМакета = Ложь;
	КонецЕсли;
	
	Если ЭтоНоваяВерсияМакета Тогда 
		Макет  = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_ЗаявкаНаРемонт.ПФ_MXL_дс_НарядЗадание_в2");
	Иначе
		// Гкс+[TOIR20-539] Вялых Д.А. от 20.02.2025. Добавлено:{
		//Макет  = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_ЗаявкаНаРемонт.ПФ_MXL_дс_НарядЗадание");
		Макет  = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_ЗаявкаНаРемонт.ПФ_MXL_дс_НарядЗадание_расш"); 
		// } Гкс-[TOIR20-539] Вялых Д.А. от 20.02.2025.
	КонецЕсли;
	// } Гкс-[TOIR20-504] Вялых Д.А. от 15.01.2025.
	
	ТабДокумент = Новый ТабличныйДокумент;
	Шапка = Макет.ПолучитьОбласть("Шапка");
	СтрокаРР = Макет.ПолучитьОбласть("СтрокаРР");
	ПодвалРР = Макет.ПолучитьОбласть("ПодвалРР");
	// Гкс+[TOIR20-504] Вялых Д.А. от 15.01.2025. Добавлено:{
	Если ЭтоНоваяВерсияМакета Тогда
		ШапкаИП = Макет.ПолучитьОбласть("ШапкаИП");
		СтрокаИП = Макет.ПолучитьОбласть("СтрокаИП");
		ШапкаМЗ = Макет.ПолучитьОбласть("ШапкаМЗ");
	КонецЕсли;
	// } Гкс-[TOIR20-504] Вялых Д.А. от 15.01.2025.
	СтрокаМЗ = Макет.ПолучитьОбласть("СтрокаМЗ");
	ШапкаИнструменты = Макет.ПолучитьОбласть("ШапкаИнструменты");
	СтрокаИнструменты = Макет.ПолучитьОбласть("СтрокаИнструменты");
	// Гкс+[TOIR20-504] Вялых Д.А. от 15.01.2025. Добавлено и изменено:{
	//Подвал = Макет.ПолучитьОбласть("Подвал");
	Если ЭтоНоваяВерсияМакета Тогда 
		Подвал_ч1 = Макет.ПолучитьОбласть("Подвал_ч1");
		ШапкаРаботПО = Макет.ПолучитьОбласть("ШапкаРаботПО");
		СтрокаРаботПО = Макет.ПолучитьОбласть("СтрокаРаботПО");
		ШапкаИспытания = Макет.ПолучитьОбласть("ШапкаИспытания");
		СтрокаИспытания = Макет.ПолучитьОбласть("СтрокаИспытания");
		ПодвалПрименяемая = Макет.ПолучитьОбласть("ПодвалПрименяемая"); 
		Подвал = Макет.ПолучитьОбласть("Подвал_ч2");	
	Иначе 
		Подвал = Макет.ПолучитьОбласть("Подвал");
	КонецЕсли;
		// } Гкс-[TOIR20-504] Вялых Д.А. от 15.01.2025.
	СдвигЧП = Час(ТекущаяДатаСеанса()) - Час(ТекущаяДата());
	ОтборСпособ = ПараметрыПечати.Свойство("ВсеСпособы") = Ложь;
	// Гкс+[TOIR20-548] Вялых Д.А. от 21.02.2025. Добавлено:{
	Если ЭтоНоваяВерсияМакета Тогда
		ОтборСпособ = Ложь;	
	КонецЕсли;
	// } Гкс-[TOIR20-548] Вялых Д.А. от 21.02.2025.
	// гкс+ [Релиз18] Деснол
	Если ПараметрыПечати.Свойство("ОтборИсполнитель") Тогда 
		ОтборИсполнитель = ПараметрыПечати.ОтборИсполнитель;
		ЕстьОтборИсполнитель = Истина;
	Иначе
		ОтборИсполнитель = Новый Массив();
		ЕстьОтборИсполнитель = Ложь;
	КонецЕсли;
	// гкс- [Релиз18]
	
	ЗапросДокументов = Новый Запрос;
	ЗапросДокументов.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ОбъектРемонта КАК ОР,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ID КАК ИД,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка КАК Док,
	|	МАКСИМУМ(ЕСТЬNULL(АктРемонты.Ссылка, ЗНАЧЕНИЕ(Документ.торо_АктОВыполненииЭтапаРабот.ПустаяСсылка))) КАК Акт,
	|	МАКСИМУМ(НЕ торо_ЗаявкаНаРемонтПрисоединенныеФайлы.Ссылка ЕСТЬ NULL) КАК ЕстьФайлы
	|ПОМЕСТИТЬ Ремонты
	|ИЗ
	|	Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК торо_ЗаявкаНаРемонтРемонтыОборудования
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ЗаявкаНаРемонтПрисоединенныеФайлы КАК торо_ЗаявкаНаРемонтПрисоединенныеФайлы
	|		ПО торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка = торо_ЗаявкаНаРемонтПрисоединенныеФайлы.ВладелецФайла
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК АктРемонты
	|		ПО торо_ЗаявкаНаРемонтРемонтыОборудования.ID = АктРемонты.ID
	// гкс+ [] Деснол 16.08.2022
	| " + ?(ЕстьОтборИсполнитель, "
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.ИсполнителиПоРемонтам КАК торо_ЗаявкаНаРемонтИсполнителиПоРемонтам
	|		ПО торо_ЗаявкаНаРемонтИсполнителиПоРемонтам.Ссылка = торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка
	|			И торо_ЗаявкаНаРемонтИсполнителиПоРемонтам.РемонтыОборудования_ID = торо_ЗаявкаНаРемонтРемонтыОборудования.ID
	|			И торо_ЗаявкаНаРемонтИсполнителиПоРемонтам.Исполнитель В (&ОтборИсполнитель)
	| ", "") + "
	// гкс- [] Деснол 16.08.2022
	|ГДЕ
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка В(&Ссылка)
	|	И торо_ЗаявкаНаРемонтРемонтыОборудования.ID В(&ID)
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ОбъектРемонта,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ID,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Док,
	|	ОР,
	|	ИД,
	|	Акт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(торо_ЗаявкаНаРемонтДокументыОснования.ДокументОснование.Ответственный) КАК ОтветственныйДО,
	|	МАКСИМУМ(торо_ЗаявкаНаРемонтДокументыОснования.ДокументОснование.Дата) КАК ДатаДО,
	|	Ремонты.Док КАК Док
	|ПОМЕСТИТЬ ДокументыОснования
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.ДокументыОснования КАК торо_ЗаявкаНаРемонтДокументыОснования
	|		ПО Ремонты.Док = торо_ЗаявкаНаРемонтДокументыОснования.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Ремонты.Док
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Док
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Ремонты.ОР КАК ОР,
	|	Ремонты.ОР.ИнвентарныйНомер КАК ИнвНомер,
	|	Ремонты.ОР.ТехНомер КАК ТехНомер,
	|	Ремонты.ОР.Организация КАК Организация,
	|	Ремонты.ОР.Направление КАК Специализация,
	|	РемонтыЗаявки.ОписаниеРемонта КАК НаправлениеНаУстранение,
	|	РемонтыЗаявки.Ссылка.Номер КАК НарядЗаданиеНомер,
	|	РемонтыЗаявки.Ссылка.Комментарий КАК КомментЗаявка,
	|	РемонтыЗаявки.Ссылка.Дата КАК Дата,
	|	РемонтыЗаявки.Ссылка.Ответственный КАК Ответственный,
	|	Ремонты.ИД КАК ИД,
	|	Ремонты.Док КАК Док,
	|	Ремонты.Док.гкс_НуженОстанов КАК Флаг1,
	|	Ремонты.Док.гкс_НуженПодготовка КАК Флаг2,
	|	Ремонты.Док.гкс_РаботаПовышеннойОпасности КАК Флаг3,
	|	Ремонты.Док.гкс_НуженИспытание КАК Флаг4,
	|	ЕСТЬNULL(торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.Ссылка.Описание,
	|	ЕСТЬNULL(торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.Описание,
	|	ЕСТЬNULL(торо_ВыявленныеДефектыСписокДефектов.ДефектОписание, РемонтыЗаявки.гкс_ИмяТехКартыРемонта))) 
	|	КАК ДефектОписание,
	|	Ремонты.ЕстьФайлы КАК ЕстьФайлы,
	// гкс+ [Релиз 1] Куст 05.11.2020
	|	ЕСТЬNULL(ИзМатрицы.КатегорияРиска, Ремонты.ОР.гкс_КатегорияРиска) КАК Приоритет,
	// гкс- [Релиз 1] Куст 05.11.2020
	|	Ремонты.Акт.Комментарий КАК Комментарий,
	|	Ремонты.ОР.ТиповойОР КАК ТОР,
	|	ЕСТЬNULL(ДокументыОснования.ОтветственныйДО, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОтветственныйДО,
	|	ЕСТЬNULL(ДокументыОснования.ДатаДО, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаДО,
	|	РемонтыЗаявки.ВидРемонтныхРабот КАК ВидРабот,
	|	РемонтыЗаявки.ДатаНачала КАК ДатаНачала,
	|	РемонтыЗаявки.ДатаОкончания КАК ДатаОкончания,
	// гкс+ [04.23] Деснол 14.04.2023
	|	ЕстьNULL(СобственноеТМ.Отметка, гкс_ТехническиеМеста.Отметка) КАК Отметка,
	|	ЕстьNULL(СобственноеТМ.Участок, гкс_ТехническиеМеста.Участок) КАК Участок,
	|	ЕстьNULL(СобственноеТМ.ЗаводПодразделение, гкс_ТехническиеМеста.ЗаводПодразделение) КАК Завод,
	|	ЕстьNULL(СобственноеТМ.МестоПлощадка, гкс_ТехническиеМеста.МестоПлощадка) КАК Место
	// гкс- [04.23] Деснол 14.04.2023
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК РемонтыЗаявки
	|		ПО Ремонты.Док = РемонтыЗаявки.Ссылка
	|			И Ремонты.ИД = РемонтыЗаявки.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ВыявленныеДефекты.РезультатыПодбораИзМатрицыОценкиРисков КАК ИзМатрицы
	|			ПО торо_ВыявленныеДефектыСписокДефектов.Ссылка = ИзМатрицы.Ссылка
	|				И торо_ВыявленныеДефектыСписокДефектов.ID = ИзМатрицы.ID_Ремонта
	|				И (ИзМатрицы.РезультатВыбора = ИСТИНА)
	|		ПО Ремонты.ИД = торо_ВыявленныеДефектыСписокДефектов.ID
	|			И (торо_ВыявленныеДефектыСписокДефектов.Ссылка.ПометкаУдаления = ЛОЖЬ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ВнешнееОснованиеДляРабот.ОбследованноеОборудование 
	|	КАК торо_ВнешнееОснованиеДляРаботОбследованноеОборудование
	|		ПО Ремонты.ИД = торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.ID
	|			И (торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.Ссылка.ПометкаУдаления = ЛОЖЬ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыОснования КАК ДокументыОснования
	|		ПО Ремонты.Док = ДокументыОснования.Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_ТекущиеФМОР КАК гкс_ТекущиеФМОР
	// гкс+ [04.23] Деснол 14.04.2023
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гкс_ТехническиеМеста КАК СобственноеТМ
	|			ПО (Не гкс_ТекущиеФМОР.ОР = гкс_ТекущиеФМОР.ФМ
	|						И гкс_ТекущиеФМОР.ТМ = СобственноеТМ.Ссылка)
	// гкс- [04.23] Деснол 14.04.2023
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гкс_ТехническиеМеста КАК гкс_ТехническиеМеста
	|			ПО (гкс_ТекущиеФМОР.ОР = гкс_ТекущиеФМОР.ФМ
	|						И гкс_ТекущиеФМОР.ТМ = гкс_ТехническиеМеста.Ссылка
	|					ИЛИ НЕ гкс_ТекущиеФМОР.ОР = гкс_ТекущиеФМОР.ФМ
	|						И гкс_ТекущиеФМОР.ТМФМ = гкс_ТехническиеМеста.Ссылка)
	|		ПО Ремонты.ОР = гкс_ТекущиеФМОР.ОР
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ЗаявкаНаРемонтТрудовыеЗатраты.Квалификация КАК Квалификация,
	|	торо_ЗаявкаНаРемонтТрудовыеЗатраты.Количество КАК Количество,
	|	Ремонты.ИД КАК ИД,
	|	Ремонты.Док КАК Док,
	|	торо_ЗаявкаНаРемонтТрудовыеЗатраты.ID КАК ИДРР,
	|	торо_ЗаявкаНаРемонтТрудовыеЗатраты.ВремяРаботы КАК ВремяРаботы
	|ПОМЕСТИТЬ ТрудовыеЗатраты
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.ТрудовыеЗатраты КАК торо_ЗаявкаНаРемонтТрудовыеЗатраты
	// гкс+ [Релиз18] Деснол
	| " + ?(ЕстьОтборИсполнитель, "
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтныеРаботы КАК торо_ЗаявкаНаРемонтРемонтныеРаботы
	|			ПО торо_ЗаявкаНаРемонтРемонтныеРаботы.Ссылка = торо_ЗаявкаНаРемонтТрудовыеЗатраты.Ссылка
	|			И торо_ЗаявкаНаРемонтРемонтныеРаботы.ID = торо_ЗаявкаНаРемонтТрудовыеЗатраты.ID
	|			И торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтыОборудования_ID = торо_ЗаявкаНаРемонтТрудовыеЗатраты.РемонтыОборудования_ID
	|			И торо_ЗаявкаНаРемонтРемонтныеРаботы.Исполнитель В (&ОтборИсполнитель)
	| ", "") + "
	// гкс- [Релиз18]
	|		ПО Ремонты.Док = торо_ЗаявкаНаРемонтТрудовыеЗатраты.Ссылка
	|			И Ремонты.ИД = торо_ЗаявкаНаРемонтТрудовыеЗатраты.РемонтыОборудования_ID
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Док,
	|	ИД,
	|	ИДРР
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ремонты.ИД КАК ИД,
	|	торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтнаяРабота КАК РР,
	|	торо_ЗаявкаНаРемонтРемонтныеРаботы.Количество КАК КолвоРР,
	|	торо_ЗаявкаНаРемонтРемонтныеРаботы.ID КАК ИДРР,
	|	торо_ЗаявкаНаРемонтРемонтныеРаботы.гкс_Примечание КАК гкс_Примечание,
	|	ТрудовыеЗатраты.Квалификация КАК Квалификация,
	|	ЕСТЬNULL(ТрудовыеЗатраты.Количество, 0) КАК Количество,
	|	ЕСТЬNULL(ТрудовыеЗатраты.ВремяРаботы, 0) КАК ВремяРаботы
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтныеРаботы КАК торо_ЗаявкаНаРемонтРемонтныеРаботы
	|			ЛЕВОЕ СОЕДИНЕНИЕ ТрудовыеЗатраты КАК ТрудовыеЗатраты
	|			ПО торо_ЗаявкаНаРемонтРемонтныеРаботы.Ссылка = ТрудовыеЗатраты.Док
	|				И торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтыОборудования_ID = ТрудовыеЗатраты.ИД
	|				И торо_ЗаявкаНаРемонтРемонтныеРаботы.ID = ТрудовыеЗатраты.ИДРР
	|		ПО Ремонты.Док = торо_ЗаявкаНаРемонтРемонтныеРаботы.Ссылка 
	|	" + ?(ОтборСпособ, "	И торо_ЗаявкаНаРемонтРемонтныеРаботы.гкс_СпособВыполнения = Значение(Перечисление.СпособыСтроительства.Подрядный)", "") + "
	|			И Ремонты.ИД = торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтыОборудования_ID
	// гкс+ [Релиз18] Деснол
	|" + ?(ЕстьОтборИсполнитель, "
	|			И торо_ЗаявкаНаРемонтРемонтныеРаботы.Исполнитель В (&ОтборИсполнитель)
	|", "") + "
	// гкс- [Релиз18]
	|
	|УПОРЯДОЧИТЬ ПО
	|	торо_ЗаявкаНаРемонтРемонтныеРаботы.НомерСтроки
	|ИТОГИ
	|	МАКСИМУМ(РР),
	|	МАКСИМУМ(КолвоРР),
	|	МАКСИМУМ(гкс_Примечание)
	|ПО
	|	ИД,
	|	ИДРР
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ЗаявкаНаРемонтМатериальныеЗатраты.Номенклатура КАК Номенклатура,
	// гкс+ [Релиз18] Деснол
	|	торо_ЗаявкаНаРемонтМатериальныеЗатраты.Номенклатура.Код КАК КодН,
	// гкс- [Релиз18]
	|	СУММА(ВЫБОР
	|			КОГДА торо_ЗаявкаНаРемонтМатериальныеЗатраты.гкс_Давальческие
	|				ТОГДА 0
	|			ИНАЧЕ торо_ЗаявкаНаРемонтМатериальныеЗатраты.Количество
	|		КОНЕЦ) КАК Колво,
	|	СУММА(ВЫБОР
	|			КОГДА торо_ЗаявкаНаРемонтМатериальныеЗатраты.гкс_Давальческие
	|				ТОГДА торо_ЗаявкаНаРемонтМатериальныеЗатраты.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Давал,
	|	ЕСТЬNULL(УпаковкиНоменклатуры.Ссылка, 
	|	торо_ЗаявкаНаРемонтМатериальныеЗатраты.Номенклатура.ЕдиницаИзмерения) КАК ЕдИзм,
	|	Ремонты.ИД КАК ИД
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.МатериальныеЗатраты 
	|	КАК торо_ЗаявкаНаРемонтМатериальныеЗатраты
	// гкс+ [Релиз18] Деснол
	| " + ?(ЕстьОтборИсполнитель, "
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтныеРаботы КАК торо_ЗаявкаНаРемонтРемонтныеРаботы
	|			ПО торо_ЗаявкаНаРемонтРемонтныеРаботы.Ссылка = торо_ЗаявкаНаРемонтМатериальныеЗатраты.Ссылка
	|			И торо_ЗаявкаНаРемонтРемонтныеРаботы.ID = торо_ЗаявкаНаРемонтМатериальныеЗатраты.ID
	|			И торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтыОборудования_ID = торо_ЗаявкаНаРемонтМатериальныеЗатраты.РемонтыОборудования_ID
	|			И торо_ЗаявкаНаРемонтРемонтныеРаботы.Исполнитель В (&ОтборИсполнитель)
	| ", "") + "
	// гкс- [Релиз18]
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
	|			ПО торо_ЗаявкаНаРемонтМатериальныеЗатраты.ЕдиницаИзмерения = УпаковкиНоменклатуры.Ссылка
	|		ПО Ремонты.Док = торо_ЗаявкаНаРемонтМатериальныеЗатраты.Ссылка
	|			И Ремонты.ИД = торо_ЗаявкаНаРемонтМатериальныеЗатраты.РемонтыОборудования_ID
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_ЗаявкаНаРемонтМатериальныеЗатраты.Номенклатура,
	|	ЕСТЬNULL(УпаковкиНоменклатуры.Ссылка, торо_ЗаявкаНаРемонтМатериальныеЗатраты.Номенклатура.ЕдиницаИзмерения),
	|	Ремонты.ИД
	|ИТОГИ ПО
	|	ИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ремонты.ИД КАК ИД,
	|	СУММА(торо_ЗаявкаНаРемонтИнструменты.Количество) КАК Колво,
	|	торо_ЗаявкаНаРемонтИнструменты.Инструмент КАК Номенклатура,
	// гкс+ [Релиз18] Деснол
	|	торо_ЗаявкаНаРемонтИнструменты.Инструмент.Код КАК КодН,
	// гкс- [Релиз18]
	|	ЕСТЬNULL(УпаковкиНоменклатуры.Ссылка, торо_ЗаявкаНаРемонтИнструменты.Инструмент.ЕдиницаИзмерения) КАК ЕдИзм
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.Инструменты КАК торо_ЗаявкаНаРемонтИнструменты
	// гкс+ [Релиз18] Деснол
	| " + ?(ЕстьОтборИсполнитель, "
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтныеРаботы КАК торо_ЗаявкаНаРемонтРемонтныеРаботы
	|			ПО торо_ЗаявкаНаРемонтРемонтныеРаботы.Ссылка = торо_ЗаявкаНаРемонтИнструменты.Ссылка
	|			И торо_ЗаявкаНаРемонтРемонтныеРаботы.ID = торо_ЗаявкаНаРемонтИнструменты.ID
	|			И торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтыОборудования_ID = торо_ЗаявкаНаРемонтИнструменты.РемонтыОборудования_ID
	|			И торо_ЗаявкаНаРемонтРемонтныеРаботы.Исполнитель В (&ОтборИсполнитель)
	| ", "") + "
	// гкс- [Релиз18]
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
	|			ПО торо_ЗаявкаНаРемонтИнструменты.Ссылка = УпаковкиНоменклатуры.Ссылка
	|		ПО Ремонты.Док = торо_ЗаявкаНаРемонтИнструменты.Ссылка
	|			И Ремонты.ИД = торо_ЗаявкаНаРемонтИнструменты.РемонтыОборудования_ID
	|
	|СГРУППИРОВАТЬ ПО
	|	Ремонты.ИД,
	|	торо_ЗаявкаНаРемонтИнструменты.Инструмент,
	|	ЕСТЬNULL(УпаковкиНоменклатуры.Ссылка, торо_ЗаявкаНаРемонтИнструменты.Инструмент.ЕдиницаИзмерения)
	|ИТОГИ ПО
	|	ИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ЗаявкаНаРемонтИсполнителиПоРемонтам.Исполнитель КАК Исполнитель,
	|	Ремонты.ИД КАК ИД,
	|	торо_ЗаявкаНаРемонтИсполнителиПоРемонтам.УточнениеИсполнителя КАК УточнениеИсполнителя
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.ИсполнителиПоРемонтам 
	|	КАК торо_ЗаявкаНаРемонтИсполнителиПоРемонтам
	|		ПО Ремонты.Док = торо_ЗаявкаНаРемонтИсполнителиПоРемонтам.Ссылка
	|			И Ремонты.ИД = торо_ЗаявкаНаРемонтИсполнителиПоРемонтам.РемонтыОборудования_ID
	// гкс+ [Релиз18] Деснол
	|" + ?(ЕстьОтборИсполнитель, "
	|			И торо_ЗаявкаНаРемонтИсполнителиПоРемонтам.Исполнитель В (&ОтборИсполнитель)
	|", "") + "
	// гкс- [Релиз18]
	|ИТОГИ ПО
	|	ИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ремонты.ИД КАК ИД,
	|	торо_ИсторияСтатусовСогласованияДокументовСрезПоследних.Пользователь КАК Пользователь,
	|	торо_ИсторияСтатусовСогласованияДокументовСрезПоследних.Период КАК Дата
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИсторияСтатусовСогласованияДокументов.СрезПоследних(
	|				,
	|				СтатусДокумента = &СтатусСогласован
	|					И СогласуемыйДокумент В
	|						(ВЫБРАТЬ
	|							ТЧ.Док
	|						ИЗ
	|							Ремонты КАК ТЧ)) КАК торо_ИсторияСтатусовСогласованияДокументовСрезПоследних
	|		ПО Ремонты.Док = торо_ИсторияСтатусовСогласованияДокументовСрезПоследних.СогласуемыйДокумент
	// гкс+ [] Деснол 16.09.2022
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ
	// гкс- [] Деснол 16.09.2022
	|ИТОГИ ПО
	|	ИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ID КАК ID,
	|	МАКСИМУМ(торо_ПлановыеРемонтныеРаботыСрезПоследних.Регистратор) КАК Регистратор,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Отменен КАК Отменен,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Замещен КАК Замещен,
	|	МАКСИМУМ(торо_ПлановыеРемонтныеРаботыСрезПоследних.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_ПлановыеРемонтныеРаботы
	|ИЗ
	|	РегистрСведений.торо_ПлановыеРемонтныеРаботы КАК торо_ПлановыеРемонтныеРаботыСрезПоследних
	|ГДЕ
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Отменен = ИСТИНА
    |
	|СГРУППИРОВАТЬ ПО
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ID,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Отменен,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Замещен
    |
	|ОБЪЕДИНИТЬ ВСЕ
    |
	|ВЫБРАТЬ
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ID,
	|	МАКСИМУМ(торо_ПлановыеРемонтныеРаботыСрезПоследних.Регистратор),
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Отменен,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Замещен,
	|	МАКСИМУМ(торо_ПлановыеРемонтныеРаботыСрезПоследних.Период)
	|ИЗ
	|	РегистрСведений.торо_ПлановыеРемонтныеРаботы КАК торо_ПлановыеРемонтныеРаботыСрезПоследних
	|ГДЕ
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Замещен = ИСТИНА
    |
	|СГРУППИРОВАТЬ ПО
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ID,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Отменен,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Замещен
	|;
    |
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ремонты.ИД КАК ИД,
	|	МАКСИМУМ(ЕСТЬNULL(торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала, ДАТАВРЕМЯ(1, 1, 1))) КАК ДатаНачала,
	|	МАКСИМУМ(ЕСТЬNULL(торо_АктуальныеПлановыеДатыРемонтов.ДатаОкончания, ДАТАВРЕМЯ(1, 1, 1))) КАК ДатаОкончания
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК торо_АктуальныеПлановыеДатыРемонтов
	|		ПО Ремонты.ИД = торо_АктуальныеПлановыеДатыРемонтов.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОтмененныеРемонты.СрезПоследних КАК торо_ОтмененныеРемонтыСрезПоследних
	|		ПО Ремонты.ИД = торо_ОтмененныеРемонтыСрезПоследних.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПлановыеРемонтныеРаботы КАК торо_ПлановыеРемонтныеРаботыСрезПоследних
	|		ПО Ремонты.ИД = торо_ПлановыеРемонтныеРаботыСрезПоследних.ID
	|ГДЕ
	|	торо_ОтмененныеРемонтыСрезПоследних.Регистратор ЕСТЬ NULL
	|	И торо_ПлановыеРемонтныеРаботыСрезПоследних.Регистратор ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	Ремонты.ИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ремонты.ИД КАК ИД,
	|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтнаяРабота КАК РР,
	|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.гкс_Примечание КАК гкс_Примечание,
	|	ЕСТЬNULL(торо_АктОВыполненииЭтапаРаботТрудовыеЗатраты.ВремяРаботы, 0) КАК ВремяРаботы
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтныеРаботы 
	|	КАК торо_АктОВыполненииЭтапаРаботРемонтныеРаботы
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.ТрудовыеЗатраты 
	|	КАК торо_АктОВыполненииЭтапаРаботТрудовыеЗатраты
	|			ПО торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтыОборудования_ID = 
	|	торо_АктОВыполненииЭтапаРаботТрудовыеЗатраты.РемонтыОборудования_ID
	|				И торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.ID = торо_АктОВыполненииЭтапаРаботТрудовыеЗатраты.ID
	|		ПО Ремонты.Акт = торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Ссылка
	|			И Ремонты.ИД = торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтыОборудования_ID
	|			И (торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.НоваяОперация = ИСТИНА)
	// гкс+ [Релиз18] Деснол
	|" + ?(ЕстьОтборИсполнитель, "
	|			И торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Исполнитель В (&ОтборИсполнитель)
	|", "") + "
	// гкс- [Релиз18]
	|ИТОГИ
	|	СУММА(ВремяРаботы),
	|	Максимум(гкс_Примечание)
	|ПО
	|	ИД,
	|	РР
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ремонты.ИД КАК ИД,
	|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Номенклатура КАК Номенклатура,
	|	СУММА(торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Количество) КАК Колво,
	|	ЕСТЬNULL(УпаковкиНоменклатуры.Наименование, 
	|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Номенклатура.ЕдиницаИзмерения) КАК ЕдИзм
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтныеРаботы 
	|	КАК торо_АктОВыполненииЭтапаРаботРемонтныеРаботы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.МатериальныеЗатраты 
	|	КАК торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
	|				ПО торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.ЕдиницаИзмерения = УпаковкиНоменклатуры.Ссылка
	|			ПО торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Ссылка = 
	|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Ссылка
	|				И торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтыОборудования_ID = 
	|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.РемонтыОборудования_ID
	|				И торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.ID = торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.ID
	|		ПО Ремонты.Акт = торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Ссылка
	|			И Ремонты.ИД = торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтыОборудования_ID
	|			И (торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.НоваяОперация = ИСТИНА)
	// гкс+ [Релиз18] Деснол
	|" + ?(ЕстьОтборИсполнитель, "
	|			И торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Исполнитель В (&ОтборИсполнитель)
	|", "") + "
	// гкс- [Релиз18]
	|
	|СГРУППИРОВАТЬ ПО
	|	Ремонты.ИД,
	|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Номенклатура,
	|	ЕСТЬNULL(УпаковкиНоменклатуры.Наименование, 
	|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Номенклатура.ЕдиницаИзмерения)
	|ИТОГИ ПО
	|	ИД";	
	ЗапросДокументов.УстановитьПараметр("Ссылка", МассивОбъектов);
	ЗапросДокументов.УстановитьПараметр("СтатусСогласован", 
	Справочники.торо_СтатусыСогласованияДокументовРемонтныхРабот.Согласован);
	// гкс+ [Релиз18] Деснол 
	ЗапросДокументов.УстановитьПараметр("ОтборИсполнитель", ОтборИсполнитель);
	// гкс- [Релиз18]
	Если ПараметрыПечати.Свойство("МассивID") Тогда
		ЗапросДокументов.УстановитьПараметр("ID", ПараметрыПечати.МассивID);
	Иначе
		ЗапросДокументов.Текст = СтрЗаменить(ЗапросДокументов.Текст, 
		"И торо_ЗаявкаНаРемонтРемонтыОборудования.ID В(&ID)", "");
	КонецЕсли;
	
	ЭтоПервый = Истина;
	ИндексВыборкиСДокументами = 2;
	ИндексВыборкиСРемонтнымиРаботами = 4;
	ИндексВыборкиСМатериальнымиЗатратами = 5;
	ИндексВыборкиСИнструментами = 6;
	ИндексВыборкиСИсполнителями = 7;
	ИндексВыборкиССогласующими = 8;
	ИндексВыборкиСАктуальнымиПериодами = 9;
	ИндексВыборкиСРемонтнымиРаботамиАкта = 10;
	ИндексВыборкиСМатериальнымиЗатратамиАкта = 12;
	
	РезультатЗапроса = ЗапросДокументов.ВыполнитьПакет();
	ВыборкаДокументов = РезультатЗапроса[ИндексВыборкиСДокументами].Выбрать();
	ВыборкаИДРР = РезультатЗапроса[ИндексВыборкиСРемонтнымиРаботами].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаМЗ = РезультатЗапроса[ИндексВыборкиСМатериальнымиЗатратами].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаИн = РезультатЗапроса[ИндексВыборкиСИнструментами].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаИспол = РезультатЗапроса[ИндексВыборкиСИсполнителями].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаСогл = РезультатЗапроса[ИндексВыборкиССогласующими].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаАктуальные = 
	РезультатЗапроса[ИндексВыборкиСАктуальнымиПериодами].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаРРАкта = 
	РезультатЗапроса[ИндексВыборкиСРемонтнымиРаботамиАкта].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаМЗАкта = 
	РезультатЗапроса[ИндексВыборкиСМатериальнымиЗатратамиАкта].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	// Гкс+[TOIR20-504] Вялых Д.А. от 15.01.2025. Добавлено:{
	Если ЭтоНоваяВерсияМакета Тогда
		ЗапросСведенийТехКарт = Новый Запрос;
		ЗапросСведенийТехКарт.Текст = "ВЫБРАТЬ
		|	ЗаявкаНаРемонт.Ссылка КАК Ссылка,
		|	ЗаявкаНаРемонтРемонтныеРаботы.РемонтнаяРабота КАК РемонтнаяРабота,
		|	ВерсииТехКарт.ТехКарта КАК ТехКарта
		|ПОМЕСТИТЬ ВТРемонтныеРаботы
		|ИЗ
		|	Документ.торо_ЗаявкаНаРемонт.РемонтныеРаботы КАК ЗаявкаНаРемонтРемонтныеРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт КАК ЗаявкаНаРемонт
		|		ПО (ЗаявкаНаРемонтРемонтныеРаботы.Ссылка = ЗаявкаНаРемонт.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВерсииТехКарт КАК ВерсииТехКарт
		|		ПО (ЗаявкаНаРемонтРемонтныеРаботы.РемонтнаяРабота = ВерсииТехКарт.ИдентификаторТехКарты)
		|ГДЕ
		|	ЗаявкаНаРемонт.Ссылка В(&Ссылка)
		|	И ЗаявкаНаРемонтРемонтныеРаботы.Родитель_ID = """"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТРемонтныеРаботы.Ссылка КАК Ссылка,
		|	ТехКартыИзмеряемыеПоказатели.Операция КАК Операция,
		|	ПоказательСсылка.Наименование КАК Наименование,
		|	""ИзмеряемыеПоказатели"" КАК ТипЗначения,
		|	ТехКартыИзмеряемыеПоказатели.гкс_ТребуемыйРезультатИзмерения КАК ТребуемыйРезультат
		|ПОМЕСТИТЬ ВТОперации
		|ИЗ
		|	ВТРемонтныеРаботы КАК ВТРемонтныеРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ТехКарты.ИзмеряемыеПоказатели КАК ТехКартыИзмеряемыеПоказатели
		|		ПО ВТРемонтныеРаботы.ТехКарта = ТехКартыИзмеряемыеПоказатели.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.торо_ИзмеряемыеПоказателиОбъектовРемонта КАК ПоказательСсылка
		|		ПО (ПоказательСсылка.Ссылка = ТехКартыИзмеряемыеПоказатели.Показатель)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТРемонтныеРаботы.Ссылка,
		|	ТехКартыМерыБезопасности.Операция,
		|	МерыБезопасностиСсылка.Наименование,
		|	""МерыБезопасности"",
		|	0
		|ИЗ
		|	ВТРемонтныеРаботы КАК ВТРемонтныеРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ТехКарты.МерыБезопасности КАК ТехКартыМерыБезопасности
		|		ПО ВТРемонтныеРаботы.ТехКарта = ТехКартыМерыБезопасности.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_МерыБезопасности КАК МерыБезопасностиСсылка
		|		ПО (МерыБезопасностиСсылка.Ссылка = ТехКартыМерыБезопасности.МераБезопасности)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТРемонтныеРаботы.Ссылка,
		|	ТехКартыИспытанияОборудования.Операция,
		|	ИспытанияСсылка.Наименование,
		|	""ИспытанияОборудования"",
		|	0
		|ИЗ
		|	ВТРемонтныеРаботы КАК ВТРемонтныеРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ТехКарты.гкс_ИспытанияОборудования КАК ТехКартыИспытанияОборудования
		|		ПО ВТРемонтныеРаботы.ТехКарта = ТехКартыИспытанияОборудования.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гкс_ИспытанияОборудования КАК ИспытанияСсылка
		|		ПО (ИспытанияСсылка.Ссылка = ТехКартыИспытанияОборудования.ИспытаниеОборудования)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Операции.Ссылка КАК Ссылка,
		|	Операции.Операция КАК Операция,
		|	Операции.Наименование КАК Наименование,
		|	Операции.ТипЗначения КАК ТипЗначения,
		|	Операции.ТребуемыйРезультат КАК ТребуемыйРезультат,
		|	ТехнологическиеОперацииРодитель.Наименование КАК ТОРодительНаименование,
		|	ИдентификаторыТехКартРодитель.Наименование КАК ИТКРодительНаименование
		|ПОМЕСТИТЬ ВТИтоговыеДанные
		|ИЗ
		|	ВТОперации КАК Операции
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ТехнологическиеОперации КАК ТехнологическиеОперации
		|		ПО (ТехнологическиеОперации.Ссылка = (ВЫРАЗИТЬ(Операции.Операция КАК Справочник.торо_ТехнологическиеОперации)))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ТехнологическиеОперации КАК ТехнологическиеОперацииРодитель
		|		ПО (ТехнологическиеОперацииРодитель.Ссылка = ТехнологическиеОперации.Родитель)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ИдентификаторыТехКарт КАК ИдентификаторыТехКарт
		|		ПО (ИдентификаторыТехКарт.Ссылка = (ВЫРАЗИТЬ(Операции.Операция КАК Справочник.торо_ИдентификаторыТехКарт)))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ИдентификаторыТехКарт КАК ИдентификаторыТехКартРодитель
		|		ПО (ИдентификаторыТехКартРодитель.Ссылка = ИдентификаторыТехКарт.Родитель)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТРемонтныеРаботы.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ВТРемонтныеРаботы.Операция) = ТИП(Справочник.торо_ТехнологическиеОперации)
		|				И ЕСТЬNULL(ВТРемонтныеРаботы.ТОРодительНаименование, """") <> """"
		|			ТОГДА ВТРемонтныеРаботы.Наименование + "" ("" + ВТРемонтныеРаботы.ТОРодительНаименование + "")""
		|		КОГДА ТИПЗНАЧЕНИЯ(ВТРемонтныеРаботы.Операция) = ТИП(Справочник.торо_ИдентификаторыТехКарт)
		|				И ЕСТЬNULL(ВТРемонтныеРаботы.ИТКРодительНаименование, """") <> """"
		|			ТОГДА ВТРемонтныеРаботы.Наименование + "" ("" + ВТРемонтныеРаботы.ИТКРодительНаименование + "")""
		|		ИНАЧЕ ВТРемонтныеРаботы.Наименование
		|	КОНЕЦ КАК Показатель,
		|	ВТРемонтныеРаботы.ТребуемыйРезультат КАК ТребуемыйРезультат
		|ИЗ
		|	ВТИтоговыеДанные КАК ВТРемонтныеРаботы
		|ГДЕ
		|	ВТРемонтныеРаботы.ТипЗначения = ""ИзмеряемыеПоказатели""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТРемонтныеРаботы.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ВТРемонтныеРаботы.Операция) = ТИП(Справочник.торо_ТехнологическиеОперации)
		|				И ЕСТЬNULL(ВТРемонтныеРаботы.ТОРодительНаименование, """") <> """"
		|			ТОГДА ВТРемонтныеРаботы.Наименование + "" ("" + ВТРемонтныеРаботы.ТОРодительНаименование + "")""
		|		КОГДА ТИПЗНАЧЕНИЯ(ВТРемонтныеРаботы.Операция) = ТИП(Справочник.торо_ИдентификаторыТехКарт)
		|				И ЕСТЬNULL(ВТРемонтныеРаботы.ИТКРодительНаименование, """") <> """"
		|			ТОГДА ВТРемонтныеРаботы.Наименование + "" ("" + ВТРемонтныеРаботы.ИТКРодительНаименование + "")""
		|		ИНАЧЕ ВТРемонтныеРаботы.Наименование
		|	КОНЕЦ КАК РаботаПО
		|ИЗ
		|	ВТИтоговыеДанные КАК ВТРемонтныеРаботы
		|ГДЕ
		|	ВТРемонтныеРаботы.ТипЗначения = ""МерыБезопасности""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТРемонтныеРаботы.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ВТРемонтныеРаботы.Операция) = ТИП(Справочник.торо_ТехнологическиеОперации)
		|				И ЕСТЬNULL(ВТРемонтныеРаботы.ТОРодительНаименование, """") <> """"
		|			ТОГДА ВТРемонтныеРаботы.Наименование + "" ("" + ВТРемонтныеРаботы.ТОРодительНаименование + "")""
		|		КОГДА ТИПЗНАЧЕНИЯ(ВТРемонтныеРаботы.Операция) = ТИП(Справочник.торо_ИдентификаторыТехКарт)
		|				И ЕСТЬNULL(ВТРемонтныеРаботы.ИТКРодительНаименование, """") <> """"
		|			ТОГДА ВТРемонтныеРаботы.Наименование + "" ("" + ВТРемонтныеРаботы.ИТКРодительНаименование + "")""
		|		ИНАЧЕ ВТРемонтныеРаботы.Наименование
		|	КОНЕЦ КАК Требование
		|ИЗ
		|	ВТИтоговыеДанные КАК ВТРемонтныеРаботы
		|ГДЕ
		|	ВТРемонтныеРаботы.ТипЗначения = ""ИспытанияОборудования""";
		ЗапросСведенийТехКарт.УстановитьПараметр("Ссылка", МассивОбъектов); 
		
		РезультатЗапросаСведенийТехКарт = ЗапросСведенийТехКарт.ВыполнитьПакет();
		ВыборкаИзмеряемыеПоказатели = РезультатЗапросаСведенийТехКарт[1].Выбрать();
		ВыборкаМерыБезопасности = РезультатЗапросаСведенийТехКарт[2].Выбрать();
		ВыборкаИспытанияОборудования = РезультатЗапросаСведенийТехКарт[3].Выбрать()
	КонецЕсли;
	
	// } Гкс-[TOIR20-504] Вялых Д.А. от 15.01.2025.
	
	Пока ВыборкаДокументов.Следующий() Цикл
		Если НЕ ЭтоПервый Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ЭтоПервый = Ложь;
		//
		Если ВыборкаСогл.НайтиСледующий(Новый Структура("ИД",ВыборкаДокументов.ИД)) Тогда 
			Выборка = ВыборкаСогл.Выбрать();
			Если Выборка.Следующий() Тогда 
				Шапка.Параметры.Утвердил = ПреобразоватьФИО(Выборка.Пользователь);
				Шапка.Параметры.ДатаУтверждения = Выборка.Дата + (СдвигЧП * 3600);
			КонецЕсли;
		КонецЕсли;
		//
		ЗаполнитьЗначенияСвойств(Шапка.Параметры,ВыборкаДокументов);
		Шапка.Параметры.Ответственный = ПреобразоватьФИО(ВыборкаДокументов.ОтветственныйДО);
		Шапка.Параметры.Дата = ВыборкаДокументов.ДатаДО + (СдвигЧП * 3600);
		Если ЗначениеЗаполнено(ВыборкаДокументов.Отметка) = Ложь Тогда 
			Шапка.Параметры.Отметка = "0,000";
		Иначе
			Шапка.Параметры.Отметка = Формат(ВыборкаДокументов.Отметка, "ЧДЦ=3");
		КонецЕсли;
		НовыйСиноним = " Техническое задание  " + ВыборкаДокументов.НарядЗаданиеНомер;
		Подвал.Параметры.ТОР = ВыборкаДокументов.ТОР;
		Подвал.Параметры.Ответственный = ВыборкаДокументов.Ответственный;
		Подвал.Параметры.Дата = ВыборкаДокументов.Дата + (СдвигЧП * 3600);
		// Гкс+[TOIR20-347] Лебедев Н.А. от 22.02.2023. Удалено:{
		//Подвал.Параметры.КомментарийАкта = ВыборкаДокументов.Комментарий;
		// } Гкс-[TOIR20-347] Лебедев Н.А. от 22.02.2023.
		ТабДокумент.Вывести(Шапка);
		//
		Итог1 = 0; Итог2 = 0;
		Если ВыборкаИДРР.НайтиСледующий(Новый Структура("ИД",ВыборкаДокументов.ИД)) Тогда 
			Выборка = ВыборкаИДРР.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока Выборка.Следующий() Цикл
				СтрокаРР.Параметры.РР = Строка(Выборка.РР) + " " + Выборка.гкс_Примечание;
				СтрокаРР.Параметры.КолвоРР = Выборка.КолвоРР;
				НуженВывод = Истина;
				ВыборкаТЗ = Выборка.Выбрать();
				Пока ВыборкаТЗ.Следующий() Цикл
					СтрокаРР.Параметры.Квалификация = ВыборкаТЗ.Квалификация;
					СтрокаРР.Параметры.Колво = ВыборкаТЗ.Количество;
					План = ВыборкаТЗ.ВремяРаботы / 60;
					Итог1 = Итог1 + (План * ВыборкаТЗ.Количество);
					Если План = Цел(План) Тогда 
						План = Строка(План);
					КонецЕсли;
					СтрокаРР.Параметры.План = План;
					ТабДокумент.Вывести(СтрокаРР);
					НуженВывод = Ложь;
					СтрокаРР.Параметры.КолвоРР = "";
					СтрокаРР.Параметры.Квалификация = "";
					СтрокаРР.Параметры.Колво = "";
					СтрокаРР.Параметры.План = "";
					СтрокаРР.Параметры.РР = "";
				КонецЦикла;
				Если НуженВывод Тогда 
					ТабДокумент.Вывести(СтрокаРР);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		ВыборкаИДРР.Сбросить();
		
		Итог2 = (ВыборкаДокументов.ДатаОкончания - ВыборкаДокументов.ДатаНачала) / 60;
		
		Если Итог1 = Цел(Итог1) Тогда 
			Итог1 = Строка(Итог1);
		КонецЕсли;
		Если Итог2 = Цел(Итог2) Тогда 
			Итог2 = Строка(Итог2);
		КонецЕсли;
		ПодвалРР.Параметры.Итог1 = Итог1;
		// гкс+ [02.23] Деснол 06.02.2023
		//ПодвалРР.Параметры.Итог2 = Итог2;
		// гкс- [02.23] Деснол 06.02.2023
		ТабДокумент.Вывести(ПодвалРР);
		
		// Гкс+[TOIR20-504] Вялых Д.А. от 15.01.2025. Добавлено:{
		Если ЭтоНоваяВерсияМакета Тогда
			ТабДокумент.Вывести(ШапкаИП);
			Пока ВыборкаИзмеряемыеПоказатели.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(СтрокаИП.Параметры, ВыборкаИзмеряемыеПоказатели);
				ТабДокумент.Вывести(СтрокаИП);
			КонецЦикла;
			ТабДокумент.Вывести(ШапкаМЗ);
		КонецЕсли;
		// } Гкс-[TOIR20-504] Вялых Д.А. от 15.01.2025.
		
		Если ВыборкаМЗ.НайтиСледующий(Новый Структура("ИД", ВыборкаДокументов.ИД)) Тогда 
			Выборка = ВыборкаМЗ.Выбрать();
			Пока Выборка.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(СтрокаМЗ.Параметры, Выборка);
				ТабДокумент.Вывести(СтрокаМЗ);
			КонецЦикла;
		КонецЕсли;
		ВыборкаМЗ.Сбросить();
		
		ТабДокумент.Вывести(ШапкаИнструменты);
		Если ВыборкаИн.НайтиСледующий(Новый Структура("ИД", ВыборкаДокументов.ИД)) Тогда 
			Выборка = ВыборкаИн.Выбрать();
			Пока Выборка.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(СтрокаИнструменты.Параметры, Выборка);
				ТабДокумент.Вывести(СтрокаИнструменты);
			КонецЦикла;
		КонецЕсли;
		ВыборкаИн.Сбросить(); 
		
		// Гкс+[TOIR20-504] Вялых Д.А. от 15.01.2025. Добавлено:{ 
		Если ЭтоНоваяВерсияМакета Тогда
			ТабДокумент.Вывести(Подвал_ч1);
			ТабДокумент.Вывести(ШапкаРаботПО);
			Пока ВыборкаМерыБезопасности.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(СтрокаРаботПО.Параметры, ВыборкаМерыБезопасности);
				ТабДокумент.Вывести(СтрокаРаботПО);
			КонецЦикла;
			ТабДокумент.Вывести(ШапкаИспытания);
			Пока ВыборкаИспытанияОборудования.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(СтрокаИспытания.Параметры, ВыборкаИспытанияОборудования);
				ТабДокумент.Вывести(СтрокаИспытания);
			КонецЦикла;
			ТабДокумент.Вывести(ПодвалПрименяемая);
		КонецЕсли;
		// } Гкс-[TOIR20-504] Вялых Д.А. от 15.01.2025.
		
		Если ВыборкаИспол.НайтиСледующий(Новый Структура("ИД", ВыборкаДокументов.ИД)) Тогда 
			Выборка = ВыборкаИспол.Выбрать();
			Если Выборка.Следующий() Тогда 
				Подвал.Параметры.Исполнитель = Выборка.Исполнитель;
				Если ТипЗнч(Выборка.Исполнитель) = Тип("СправочникСсылка.Контрагенты") Тогда 
					Подвал.Параметры.Договор = Выборка.УточнениеИсполнителя;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		ВыборкаИспол.Сбросить();
		
		ТемпТекст = "";
		Если ВыборкаРРАкта.НайтиСледующий(Новый Структура("ИД",ВыборкаДокументов.ИД)) Тогда 
			Выборка = ВыборкаРРАкта.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока Выборка.Следующий() Цикл
				ТемпТекст = ТемпТекст + ?(ЗначениеЗаполнено(ТемпТекст),", ","") 
				+ Выборка.РР + " " + Выборка.гкс_Примечание + "/ " +(Выборка.ВремяРаботы/60)+" мин.";
			КонецЦикла;
		КонецЕсли;
		Подвал.Параметры.СписокТО = ТемпТекст;
		ВыборкаРРАкта.Сбросить();
		
		ТемпТекст = "";
		Если ВыборкаМЗАкта.НайтиСледующий(Новый Структура("ИД",ВыборкаДокументов.ИД)) Тогда 
			Выборка = ВыборкаМЗАкта.Выбрать();
			Пока Выборка.Следующий() Цикл
				ТемпТекст = ТемпТекст + ?(ЗначениеЗаполнено(ТемпТекст),", ","") 
				+ Выборка.Номенклатура + "/ " +Выборка.Колво +" "+Выборка.ЕдИзм+".";
			КонецЦикла;
		КонецЕсли;
		Подвал.Параметры.МатЗатраты = ТемпТекст;
		ВыборкаМЗАкта.Сбросить();
		
		// Гкс+[TOIR20-347] Лебедев Н.А. от 22.02.2023. Удалено:{
		//Подвал.Параметры.СмФайлы = ВыборкаДокументов.КомментЗаявка;
		// } Гкс-[TOIR20-347] Лебедев Н.А. от 22.02.2023.	
		// Гкс+[TOIR20-351] Лебедев Н.А. от 15.03.2023. Удалено:{
		//Если ВыборкаДокументов.ЕстьФайлы Тогда 
		//	Подвал.Параметры.СмФайлы = Подвал.Параметры.СмФайлы + Символы.ПС
		//	+  "См. вложенные файлы";
		//КонецЕсли;
		// } Гкс-[TOIR20-351] Лебедев Н.А. от 15.03.2023.
		
		ТабДокумент.Вывести(Подвал);
	КонецЦикла;
	
	// Зададим параметры макета
	ТабДокумент.АвтоМасштаб	= Истина;
	ТабДокумент.ПолеСверху  = 0;
	ТабДокумент.ПолеСлева   = 0;
	ТабДокумент.ПолеСнизу   = 0;
	ТабДокумент.ПолеСправа  = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабДокумент.ТолькоПросмотр = Истина;
	
	Возврат ТабДокумент;
	
	
КонецФункции

Функция ПреобразоватьФИО(Сотрудник)
	МассивИмени = СтрРазделить(Строка(Сотрудник)," ",Ложь);
	Если МассивИмени.Количество() > 2 Тогда 
		Возврат МассивИмени[0] +" "+ Лев(МассивИмени[1],1) +". "+ Лев(МассивИмени[2],1)+".";
	КонецЕсли;
	Возврат Сотрудник;
КонецФункции
// гкс- [Релиз 1] Куст 17.03.2020

Функция гкс_ПечатьОбъемРабот(МассивОбъектов, ПараметрыПечати, НовыйСиноним)
	
	Макет  = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_ЗаявкаНаРемонт.ПФ_MXL_дс_НарядЗадание");
	ТабДокумент = Новый ТабличныйДокумент;
	Шапка = Макет.ПолучитьОбласть("Шапка2");
	СтрокаРР = Макет.ПолучитьОбласть("СтрокаРР");
	ПодвалРР = Макет.ПолучитьОбласть("ПодвалРР");
	СтрокаМЗ = Макет.ПолучитьОбласть("СтрокаМЗ");
	ШапкаИнструменты = Макет.ПолучитьОбласть("ШапкаИнструменты");
	СтрокаИнструменты = Макет.ПолучитьОбласть("СтрокаИнструменты");
	Подвал = Макет.ПолучитьОбласть("Подвал2");
	СдвигЧП = Час(ТекущаяДатаСеанса()) - Час(ТекущаяДата());
	
	ЗапросДокументов = Новый Запрос;
	ЗапросДокументов.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ОбъектРемонта КАК ОР,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ID КАК ИД,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка КАК Док,
	|	Максимум(АктРемонты.Ссылка) КАК Акт,
	|	МАКСИМУМ(НЕ торо_ЗаявкаНаРемонтПрисоединенныеФайлы.Ссылка ЕСТЬ NULL) КАК ЕстьФайлы
	|ПОМЕСТИТЬ Ремонты
	|ИЗ
	|	Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК торо_ЗаявкаНаРемонтРемонтыОборудования
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ЗаявкаНаРемонтПрисоединенныеФайлы КАК торо_ЗаявкаНаРемонтПрисоединенныеФайлы
	|		ПО торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка = торо_ЗаявкаНаРемонтПрисоединенныеФайлы.ВладелецФайла
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК АктРемонты
	|		ПО торо_ЗаявкаНаРемонтРемонтыОборудования.ID = АктРемонты.ID
	|ГДЕ
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка В(&Ссылка)
	|	И торо_ЗаявкаНаРемонтРемонтыОборудования.ID В(&ID)
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ОбъектРемонта,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ID,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(торо_ЗаявкаНаРемонтДокументыОснования.ДокументОснование.Ответственный) КАК ОтветственныйДО,
	|	МАКСИМУМ(торо_ЗаявкаНаРемонтДокументыОснования.ДокументОснование.Дата) КАК ДатаДО,
	|	Ремонты.Док КАК Док
	|ПОМЕСТИТЬ ДокументыОснования
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.ДокументыОснования КАК торо_ЗаявкаНаРемонтДокументыОснования
	|		ПО Ремонты.Док = торо_ЗаявкаНаРемонтДокументыОснования.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Ремонты.Док
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Ремонты.ОР КАК ОР,
	|	Ремонты.ОР.ИнвентарныйНомер КАК ИнвНомер,
	|	Ремонты.ОР.ТехНомер КАК ТехНомер,
	|	Ремонты.ОР.Организация КАК Организация,
	|	Ремонты.ОР.Направление КАК Специализация,
	|	РемонтыЗаявки.ОписаниеРемонта КАК НаправлениеНаУстранение,
	|	РемонтыЗаявки.Ссылка.Номер КАК НарядЗаданиеНомер,
	|	РемонтыЗаявки.Ссылка.Комментарий КАК КомментЗаявка,
	|	РемонтыЗаявки.Ссылка.Дата КАК Дата,
	|	РемонтыЗаявки.Ссылка.Ответственный КАК Ответственный,
	|	Ремонты.ИД КАК ИД,
	|	Ремонты.Док КАК Док,
	|	Ремонты.Док.гкс_НуженОстанов КАК Флаг1,
	|	Ремонты.Док.гкс_НуженПодготовка КАК Флаг2,
	|	Ремонты.Док.гкс_РаботаПовышеннойОпасности КАК Флаг3,
	|	Ремонты.Док.гкс_НуженИспытание КАК Флаг4,
	|	ЕСТЬNULL(торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.Ссылка.Описание,
	|	ЕСТЬNULL(торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.Описание,
	|	ЕСТЬNULL(торо_ВыявленныеДефектыСписокДефектов.ДефектОписание, РемонтыЗаявки.гкс_ИмяТехКартыРемонта))) 
	|	КАК ДефектОписание,
	|	Ремонты.ЕстьФайлы КАК ЕстьФайлы,
	|	ЕСТЬNULL(ИзМатрицы.КатегорияРиска, Ремонты.ОР.гкс_КатегорияРиска) КАК Приоритет,
	|	Ремонты.Акт.Комментарий КАК Комментарий,
	|	Ремонты.ОР.ТиповойОР КАК ТОР,
	|	ДокументыОснования.ОтветственныйДО КАК ОтветственныйДО,
	|	ДокументыОснования.ДатаДО КАК ДатаДО,
	|	РемонтыЗаявки.ВидРемонтныхРабот КАК ВидРабот,
	|	РемонтыЗаявки.ДатаНачала КАК ДатаНачала,
	|	РемонтыЗаявки.ДатаОкончания КАК ДатаОкончания,
	|	гкс_ТехническиеМеста.Отметка КАК Отметка,
	|	гкс_ТехническиеМеста.Участок КАК Участок,
	|	гкс_ТехническиеМеста.ЗаводПодразделение КАК Завод,
	|	гкс_ТехническиеМеста.МестоПлощадка КАК Место
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК РемонтыЗаявки
	|		ПО Ремонты.Док = РемонтыЗаявки.Ссылка
	|			И Ремонты.ИД = РемонтыЗаявки.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ВыявленныеДефекты.РезультатыПодбораИзМатрицыОценкиРисков КАК ИзМатрицы
	|			ПО торо_ВыявленныеДефектыСписокДефектов.Ссылка = ИзМатрицы.Ссылка
	|				И торо_ВыявленныеДефектыСписокДефектов.ID = ИзМатрицы.ID_Ремонта
	|				И (ИзМатрицы.РезультатВыбора = ИСТИНА)
	|		ПО Ремонты.ИД = торо_ВыявленныеДефектыСписокДефектов.ID
	|			И (торо_ВыявленныеДефектыСписокДефектов.Ссылка.ПометкаУдаления = ЛОЖЬ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ВнешнееОснованиеДляРабот.ОбследованноеОборудование 
	|	КАК торо_ВнешнееОснованиеДляРаботОбследованноеОборудование
	|		ПО Ремонты.ИД = торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.ID
	|			И (торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.Ссылка.ПометкаУдаления = ЛОЖЬ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыОснования КАК ДокументыОснования
	|		ПО Ремонты.Док = ДокументыОснования.Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_ТекущиеФМОР КАК гкс_ТекущиеФМОР
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гкс_ТехническиеМеста КАК гкс_ТехническиеМеста
	|			ПО (гкс_ТекущиеФМОР.ОР = гкс_ТекущиеФМОР.ФМ
	|						И гкс_ТекущиеФМОР.ТМ = гкс_ТехническиеМеста.Ссылка
	|					ИЛИ НЕ гкс_ТекущиеФМОР.ОР = гкс_ТекущиеФМОР.ФМ
	|						И гкс_ТекущиеФМОР.ТМФМ = гкс_ТехническиеМеста.Ссылка)
	|		ПО Ремонты.ОР = гкс_ТекущиеФМОР.ОР
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ЗаявкаНаРемонтТрудовыеЗатраты.Квалификация КАК Квалификация,
	|	торо_ЗаявкаНаРемонтТрудовыеЗатраты.Количество КАК Количество,
	|	Ремонты.ИД КАК ИД,
	|	Ремонты.Док КАК Док,
	|	торо_ЗаявкаНаРемонтТрудовыеЗатраты.ID КАК ИДРР,
	|	торо_ЗаявкаНаРемонтТрудовыеЗатраты.ВремяРаботы КАК ВремяРаботы
	|ПОМЕСТИТЬ ТрудовыеЗатраты
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.ТрудовыеЗатраты КАК торо_ЗаявкаНаРемонтТрудовыеЗатраты
	|		ПО Ремонты.Док = торо_ЗаявкаНаРемонтТрудовыеЗатраты.Ссылка
	|			И Ремонты.ИД = торо_ЗаявкаНаРемонтТрудовыеЗатраты.РемонтыОборудования_ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ремонты.ИД КАК ИД,
	|	торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтнаяРабота КАК РР,
	|	торо_ЗаявкаНаРемонтРемонтныеРаботы.Количество КАК КолвоРР,
	|	торо_ЗаявкаНаРемонтРемонтныеРаботы.ID КАК ИДРР,
	|	торо_ЗаявкаНаРемонтРемонтныеРаботы.гкс_Примечание КАК гкс_Примечание,
	|	ТрудовыеЗатраты.Квалификация КАК Квалификация,
	|	ЕСТЬNULL(ТрудовыеЗатраты.Количество, 0) КАК Количество,
	|	ЕСТЬNULL(ТрудовыеЗатраты.ВремяРаботы, 0) КАК ВремяРаботы
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтныеРаботы КАК торо_ЗаявкаНаРемонтРемонтныеРаботы
	|			ЛЕВОЕ СОЕДИНЕНИЕ ТрудовыеЗатраты КАК ТрудовыеЗатраты
	|			ПО торо_ЗаявкаНаРемонтРемонтныеРаботы.Ссылка = ТрудовыеЗатраты.Док
	|				И торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтыОборудования_ID = ТрудовыеЗатраты.ИД
	|				И торо_ЗаявкаНаРемонтРемонтныеРаботы.ID = ТрудовыеЗатраты.ИДРР
	|		ПО Ремонты.Док = торо_ЗаявкаНаРемонтРемонтныеРаботы.Ссылка 
	|			И Ремонты.ИД = торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтыОборудования_ID
	|
	|УПОРЯДОЧИТЬ ПО
	|	торо_ЗаявкаНаРемонтРемонтныеРаботы.НомерСтроки
	|ИТОГИ
	|	МАКСИМУМ(РР),
	|	МАКСИМУМ(КолвоРР),
	|	МАКСИМУМ(гкс_Примечание)
	|ПО
	|	ИД,
	|	ИДРР
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ЗаявкаНаРемонтМатериальныеЗатраты.Номенклатура КАК Номенклатура,
	|	СУММА(ВЫБОР
	|			КОГДА торо_ЗаявкаНаРемонтМатериальныеЗатраты.гкс_Давальческие
	|				ТОГДА 0
	|			ИНАЧЕ торо_ЗаявкаНаРемонтМатериальныеЗатраты.Количество
	|		КОНЕЦ) КАК Колво,
	|	СУММА(ВЫБОР
	|			КОГДА торо_ЗаявкаНаРемонтМатериальныеЗатраты.гкс_Давальческие
	|				ТОГДА торо_ЗаявкаНаРемонтМатериальныеЗатраты.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Давал,
	|	ЕСТЬNULL(УпаковкиНоменклатуры.Ссылка, 
	|	торо_ЗаявкаНаРемонтМатериальныеЗатраты.Номенклатура.ЕдиницаИзмерения) КАК ЕдИзм,
	|	Ремонты.ИД КАК ИД
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.МатериальныеЗатраты 
	|	КАК торо_ЗаявкаНаРемонтМатериальныеЗатраты
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
	|			ПО торо_ЗаявкаНаРемонтМатериальныеЗатраты.ЕдиницаИзмерения = УпаковкиНоменклатуры.Ссылка
	|		ПО Ремонты.Док = торо_ЗаявкаНаРемонтМатериальныеЗатраты.Ссылка
	|			И Ремонты.ИД = торо_ЗаявкаНаРемонтМатериальныеЗатраты.РемонтыОборудования_ID
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_ЗаявкаНаРемонтМатериальныеЗатраты.Номенклатура,
	|	ЕСТЬNULL(УпаковкиНоменклатуры.Ссылка, торо_ЗаявкаНаРемонтМатериальныеЗатраты.Номенклатура.ЕдиницаИзмерения),
	|	Ремонты.ИД
	|ИТОГИ ПО
	|	ИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ремонты.ИД КАК ИД,
	|	СУММА(торо_ЗаявкаНаРемонтИнструменты.Количество) КАК Колво,
	|	торо_ЗаявкаНаРемонтИнструменты.Инструмент КАК Номенклатура,
	|	ЕСТЬNULL(УпаковкиНоменклатуры.Ссылка, торо_ЗаявкаНаРемонтИнструменты.Инструмент.ЕдиницаИзмерения) КАК ЕдИзм
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.Инструменты КАК торо_ЗаявкаНаРемонтИнструменты
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
	|			ПО торо_ЗаявкаНаРемонтИнструменты.Ссылка = УпаковкиНоменклатуры.Ссылка
	|		ПО Ремонты.Док = торо_ЗаявкаНаРемонтИнструменты.Ссылка
	|			И Ремонты.ИД = торо_ЗаявкаНаРемонтИнструменты.РемонтыОборудования_ID
	|
	|СГРУППИРОВАТЬ ПО
	|	Ремонты.ИД,
	|	торо_ЗаявкаНаРемонтИнструменты.Инструмент,
	|	ЕСТЬNULL(УпаковкиНоменклатуры.Ссылка, торо_ЗаявкаНаРемонтИнструменты.Инструмент.ЕдиницаИзмерения)
	|ИТОГИ ПО
	|	ИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ЗаявкаНаРемонтИсполнителиПоРемонтам.Исполнитель КАК Исполнитель,
	|	Ремонты.ИД КАК ИД,
	|	торо_ЗаявкаНаРемонтИсполнителиПоРемонтам.УточнениеИсполнителя КАК УточнениеИсполнителя
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.ИсполнителиПоРемонтам 
	|	КАК торо_ЗаявкаНаРемонтИсполнителиПоРемонтам
	|		ПО Ремонты.Док = торо_ЗаявкаНаРемонтИсполнителиПоРемонтам.Ссылка
	|			И Ремонты.ИД = торо_ЗаявкаНаРемонтИсполнителиПоРемонтам.РемонтыОборудования_ID
	|ИТОГИ ПО
	|	ИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ремонты.ИД КАК ИД,
	|	торо_ИсторияСтатусовСогласованияДокументовСрезПоследних.Пользователь КАК Пользователь,
	|	торо_ИсторияСтатусовСогласованияДокументовСрезПоследних.Период КАК Дата
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИсторияСтатусовСогласованияДокументов.СрезПоследних(
	|				,
	|				СтатусДокумента = &СтатусСогласован
	|					И СогласуемыйДокумент В
	|						(ВЫБРАТЬ
	|							ТЧ.Док
	|						ИЗ
	|							Ремонты КАК ТЧ)) КАК торо_ИсторияСтатусовСогласованияДокументовСрезПоследних
	|		ПО Ремонты.Док = торо_ИсторияСтатусовСогласованияДокументовСрезПоследних.СогласуемыйДокумент
	// гкс+ [] Деснол 16.09.2022
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ
	// гкс- [] Деснол 16.09.2022
	|ИТОГИ ПО
	|	ИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ремонты.ИД КАК ИД,
	|	МАКСИМУМ(ЕСТЬNULL(торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала, ДАТАВРЕМЯ(1, 1, 1))) КАК ДатаНачала,
	|	МАКСИМУМ(ЕСТЬNULL(торо_АктуальныеПлановыеДатыРемонтов.ДатаОкончания, ДАТАВРЕМЯ(1, 1, 1))) КАК ДатаОкончания
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК торо_АктуальныеПлановыеДатыРемонтов
	|		ПО Ремонты.ИД = торо_АктуальныеПлановыеДатыРемонтов.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОтмененныеРемонты.СрезПоследних КАК торо_ОтмененныеРемонтыСрезПоследних
	|		ПО Ремонты.ИД = торо_ОтмененныеРемонтыСрезПоследних.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних 
	|	КАК торо_ПлановыеРемонтныеРаботыСрезПоследних
	|		ПО Ремонты.ИД = торо_ПлановыеРемонтныеРаботыСрезПоследних.ID
	|			И (торо_ПлановыеРемонтныеРаботыСрезПоследних.Отменен = ИСТИНА
	|				ИЛИ торо_ПлановыеРемонтныеРаботыСрезПоследних.Замещен = ИСТИНА)
	|ГДЕ
	|	торо_ОтмененныеРемонтыСрезПоследних.Регистратор ЕСТЬ NULL
	|	И торо_ПлановыеРемонтныеРаботыСрезПоследних.Регистратор ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	Ремонты.ИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ремонты.ИД КАК ИД,
	|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтнаяРабота КАК РР,
	|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.гкс_Примечание КАК гкс_Примечание,
	|	ЕСТЬNULL(торо_АктОВыполненииЭтапаРаботТрудовыеЗатраты.ВремяРаботы, 0) КАК ВремяРаботы
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтныеРаботы 
	|	КАК торо_АктОВыполненииЭтапаРаботРемонтныеРаботы
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.ТрудовыеЗатраты 
	|	КАК торо_АктОВыполненииЭтапаРаботТрудовыеЗатраты
	|			ПО торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтыОборудования_ID = 
	|	торо_АктОВыполненииЭтапаРаботТрудовыеЗатраты.РемонтыОборудования_ID
	|				И торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.ID = торо_АктОВыполненииЭтапаРаботТрудовыеЗатраты.ID
	|		ПО Ремонты.Акт = торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Ссылка
	|			И Ремонты.ИД = торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтыОборудования_ID
	|			И (торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.НоваяОперация = ИСТИНА)
	|ИТОГИ
	|	СУММА(ВремяРаботы),
	|	Максимум(гкс_Примечание)
	|ПО
	|	ИД,
	|	РР
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ремонты.ИД КАК ИД,
	|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Номенклатура КАК Номенклатура,
	|	СУММА(торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Количество) КАК Колво,
	|	ЕСТЬNULL(УпаковкиНоменклатуры.Наименование, 
	|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Номенклатура.ЕдиницаИзмерения) КАК ЕдИзм
	|ИЗ
	|	Ремонты КАК Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтныеРаботы 
	|	КАК торо_АктОВыполненииЭтапаРаботРемонтныеРаботы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.МатериальныеЗатраты 
	|	КАК торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
	|				ПО торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.ЕдиницаИзмерения = УпаковкиНоменклатуры.Ссылка
	|			ПО торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Ссылка = 
	|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Ссылка
	|				И торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтыОборудования_ID = 
	|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.РемонтыОборудования_ID
	|				И торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.ID = торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.ID
	|		ПО Ремонты.Акт = торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Ссылка
	|			И Ремонты.ИД = торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтыОборудования_ID
	|			И (торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.НоваяОперация = ИСТИНА)
	|
	|СГРУППИРОВАТЬ ПО
	|	Ремонты.ИД,
	|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Номенклатура,
	|	ЕСТЬNULL(УпаковкиНоменклатуры.Наименование, 
	|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Номенклатура.ЕдиницаИзмерения)
	|ИТОГИ ПО
	|	ИД";	
	ЗапросДокументов.УстановитьПараметр("Ссылка", МассивОбъектов);
	ЗапросДокументов.УстановитьПараметр("СтатусСогласован", 
	Справочники.торо_СтатусыСогласованияДокументовРемонтныхРабот.Согласован);
	Если ПараметрыПечати.Свойство("МассивID") Тогда
		ЗапросДокументов.УстановитьПараметр("ID", ПараметрыПечати.МассивID);
	Иначе
		ЗапросДокументов.Текст = СтрЗаменить(ЗапросДокументов.Текст, 
		"И торо_ЗаявкаНаРемонтРемонтыОборудования.ID В(&ID)", "");
	КонецЕсли;
	
	ЭтоПервый = Истина;
	ИндексВыборкиСДокументами = 2;
	ИндексВыборкиСРемонтнымиРаботами = 4;
	ИндексВыборкиСМатериальнымиЗатратами = 5;
	ИндексВыборкиСИнструментами = 6;
	ИндексВыборкиСИсполнителями = 7;
	ИндексВыборкиССогласующими = 8;
	ИндексВыборкиСАктуальнымиПериодами = 9;
	ИндексВыборкиСРемонтнымиРаботамиАкта = 10;
	ИндексВыборкиСМатериальнымиЗатратамиАкта = 11;
	
	РезультатЗапроса = ЗапросДокументов.ВыполнитьПакет();
	ВыборкаДокументов = РезультатЗапроса[ИндексВыборкиСДокументами].Выбрать();
	ВыборкаИДРР = РезультатЗапроса[ИндексВыборкиСРемонтнымиРаботами].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаМЗ = РезультатЗапроса[ИндексВыборкиСМатериальнымиЗатратами].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаИн = РезультатЗапроса[ИндексВыборкиСИнструментами].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаИспол = РезультатЗапроса[ИндексВыборкиСИсполнителями].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаСогл = РезультатЗапроса[ИндексВыборкиССогласующими].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаАктуальные = 
	РезультатЗапроса[ИндексВыборкиСАктуальнымиПериодами].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаРРАкта = 
	РезультатЗапроса[ИндексВыборкиСРемонтнымиРаботамиАкта].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаМЗАкта = 
	РезультатЗапроса[ИндексВыборкиСМатериальнымиЗатратамиАкта].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДокументов.Следующий() Цикл
		Если НЕ ЭтоПервый Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ЭтоПервый = Ложь;
		//
		ЗаполнитьЗначенияСвойств(Шапка.Параметры,ВыборкаДокументов);
		Шапка.Параметры.Номер = ВыборкаДокументов.НарядЗаданиеНомер;
		НовыйСиноним = " Объем работ по заявке " + ВыборкаДокументов.НарядЗаданиеНомер;
		ТабДокумент.Вывести(Шапка);
		//
		Итог1 = 0; Итог2 = 0;
		Если ВыборкаИДРР.НайтиСледующий(Новый Структура("ИД",ВыборкаДокументов.ИД)) Тогда 
			Выборка = ВыборкаИДРР.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока Выборка.Следующий() Цикл
				СтрокаРР.Параметры.РР = Строка(Выборка.РР) + " " + Выборка.гкс_Примечание;
				СтрокаРР.Параметры.КолвоРР = Выборка.КолвоРР;
				НуженВывод = Истина;
				ВыборкаТЗ = Выборка.Выбрать();
				Пока ВыборкаТЗ.Следующий() Цикл
					СтрокаРР.Параметры.Квалификация = ВыборкаТЗ.Квалификация;
					СтрокаРР.Параметры.Колво = ВыборкаТЗ.Количество;
					План = ВыборкаТЗ.ВремяРаботы / 60;
					Итог1 = Итог1 + (План * ВыборкаТЗ.Количество);
					Если План = Цел(План) Тогда 
						План = Строка(План);
					КонецЕсли;
					СтрокаРР.Параметры.План = План;
					ТабДокумент.Вывести(СтрокаРР);
					НуженВывод = Ложь;
					СтрокаРР.Параметры.КолвоРР = "";
					СтрокаРР.Параметры.Квалификация = "";
					СтрокаРР.Параметры.Колво = "";
					СтрокаРР.Параметры.План = "";
					СтрокаРР.Параметры.РР = "";
				КонецЦикла;
				Если НуженВывод Тогда 
					ТабДокумент.Вывести(СтрокаРР);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		ВыборкаИДРР.Сбросить();
		
		Итог2 = (ВыборкаДокументов.ДатаОкончания - ВыборкаДокументов.ДатаНачала) / 60;
		
		Если Итог1 = Цел(Итог1) Тогда 
			Итог1 = Строка(Итог1);
		КонецЕсли;
		Если Итог2 = Цел(Итог2) Тогда 
			Итог2 = Строка(Итог2);
		КонецЕсли;
		ПодвалРР.Параметры.Итог1 = Итог1;
		// гкс+ [02.23] Деснол 06.02.2023
		//ПодвалРР.Параметры.Итог2 = Итог2;
		// гкс- [02.23] Деснол 06.02.2023
		ТабДокумент.Вывести(ПодвалРР);
		
		Если ВыборкаМЗ.НайтиСледующий(Новый Структура("ИД",ВыборкаДокументов.ИД)) Тогда 
			Выборка = ВыборкаМЗ.Выбрать();
			Пока Выборка.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(СтрокаМЗ.Параметры,Выборка);
				ТабДокумент.Вывести(СтрокаМЗ);
			КонецЦикла;
		КонецЕсли;
		ВыборкаМЗ.Сбросить();
		
		ТабДокумент.Вывести(ШапкаИнструменты);
		Если ВыборкаИн.НайтиСледующий(Новый Структура("ИД",ВыборкаДокументов.ИД)) Тогда 
			Выборка = ВыборкаИн.Выбрать();
			Пока Выборка.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(СтрокаИнструменты.Параметры,Выборка);
				ТабДокумент.Вывести(СтрокаИнструменты);
			КонецЦикла;
		КонецЕсли;
		ВыборкаИн.Сбросить();
		
		// Гкс+[TOIR20-347] Лебедев Н.А. от 22.02.2023. Удалено:{
		//Подвал.Параметры.СмФайлы = ВыборкаДокументов.КомментЗаявка;
		// } Гкс-[TOIR20-347] Лебедев Н.А. от 22.02.2023.
		// Гкс+[TOIR20-351] Лебедев Н.А. от 15.03.2023. Удалено:{
		//Если ВыборкаДокументов.ЕстьФайлы Тогда 
		//	Подвал.Параметры.СмФайлы = Подвал.Параметры.СмФайлы + Символы.ПС
		//	+  "См. вложенные файлы";
		//КонецЕсли;
		// } Гкс-[TOIR20-351] Лебедев Н.А. от 15.03.2023.
		
		ТабДокумент.Вывести(Подвал);
	КонецЦикла;
	
	// Зададим параметры макета
	ТабДокумент.АвтоМасштаб	= Истина;
	ТабДокумент.ПолеСверху  = 0;
	ТабДокумент.ПолеСлева   = 0;
	ТабДокумент.ПолеСнизу   = 0;
	ТабДокумент.ПолеСправа  = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабДокумент.ТолькоПросмотр = Истина;
	
	Возврат ТабДокумент;
	
	
КонецФункции

// гкс+ [7729] Тарасов 28.09.2020
Функция ПечатьЗаказНаРаботу(МассивОбъектов, ПараметрыПечати)
	
	Если ПараметрыПечати.Свойство("ЭП") Тогда 
		ЭтоЭП = Истина;
	Иначе
		ЭтоЭП = Ложь;
	КонецЕсли;
	Макет  = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_ЗаявкаНаРемонт.ПФ_MXL_дс_ЗаказНаРаботу");
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Шапка 		= Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаОР 		= Макет.ПолучитьОбласть("ШапкаОР");
	// гкс+ [04.23] Деснол 13.04.2023
	ОбластьШапкаОР2 		= Макет.ПолучитьОбласть("ШапкаОР2");
	// гкс- [04.23] Деснол 13.04.2023
	ОбластьШапка2 		= Макет.ПолучитьОбласть("Шапка2");
	ШапкаРР 	= Макет.ПолучитьОбласть("ШапкаРР");
	ШапкаРР2 	= Макет.ПолучитьОбласть("ШапкаРР2");
	СтрокаРР 	= Макет.ПолучитьОбласть("СтрокаРР");
	ПодвалРР 	= Макет.ПолучитьОбласть("ПодвалРР");
	Подвал 		= Макет.ПолучитьОбласть("Подвал");
	// гкс+ [Релиз18] Деснол
	Если ПараметрыПечати.Свойство("ОтборИсполнитель") Тогда 
		ОтборИсполнитель = ПараметрыПечати.ОтборИсполнитель;
		ЕстьОтборИсполнитель = Истина;
	Иначе
		ОтборИсполнитель = Новый Массив();
		ЕстьОтборИсполнитель = Ложь;
	КонецЕсли;
	// гкс- [Релиз18]
	
	Запрос = Новый Запрос;
	#Область РемонтыПечатки
	// гкс+ [Печатки] Куст 14.10.2020
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаявкаНаРемонтРемонтыОборудования.Ссылка КАК Документ,
	|	ЗаявкаНаРемонтРемонтыОборудования.Ссылка.Организация КАК Организация,
	|	ЗаявкаНаРемонтРемонтыОборудования.ОбъектРемонта.Организация КАК ОрганизацияПолучатель,
	|	ЗаявкаНаРемонтРемонтыОборудования.Ссылка.Номер КАК Номер,
	|	ЗаявкаНаРемонтРемонтыОборудования.Ссылка.Дата КАК Дата,
	|	ЗаявкаНаРемонтРемонтыОборудования.Ссылка.Подразделение КАК Подразделение,
	|	ЗаявкаНаРемонтРемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта,
	|	ЗаявкаНаРемонтРемонтыОборудования.ОбъектРемонта.ТехНомер КАК ТехНомерОР,
	|	ЗаявкаНаРемонтРемонтыОборудования.ОбъектРемонта.ИнвентарныйНомер КАК ИнвентарныйНомерОР,
	// гкс+ [12.22] Деснол 12.12.2022
	|	ЗаявкаНаРемонтРемонтыОборудования.гкс_МежремонтныйПериод КАК гкс_МежремонтныйПериод,
	// гкс- [12.22] Деснол 12.12.2022
	// Гкс+[TOIR20-220] Селимов от 02.02.2021. Добавлено:{
	|	ЗаявкаНаРемонтРемонтыОборудования.ОбъектРемонта.гкс_ОсновноеСредство КАК ОС,
	// } Гкс-[TOIR20-220] 
	|	ВЫРАЗИТЬ(ЗаявкаНаРемонтРемонтыОборудования.ОписаниеРемонта КАК СТРОКА(1000)) КАК ОписаниеРемонта,
	|	ЗаявкаНаРемонтРемонтыОборудования.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	ЗаявкаНаРемонтРемонтыОборудования.ID КАК ID
	|ПОМЕСТИТЬ ВТ_РемонтыОборудования
	|ИЗ
	|	Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК ЗаявкаНаРемонтРемонтыОборудования
	// гкс+ [] Деснол 16.08.2022
	| " + ?(ЕстьОтборИсполнитель, "
	|	внутреннее соединение Документ.торо_ЗаявкаНаРемонт.ИсполнителиПоРемонтам КАК торо_ЗаявкаНаРемонтИсполнителиПоРемонтам
	|	ПО торо_ЗаявкаНаРемонтИсполнителиПоРемонтам.Ссылка = ЗаявкаНаРемонтРемонтыОборудования.Ссылка
	|	И торо_ЗаявкаНаРемонтИсполнителиПоРемонтам.РемонтыОборудования_ID = ЗаявкаНаРемонтРемонтыОборудования.ID
	|	И торо_ЗаявкаНаРемонтИсполнителиПоРемонтам.Исполнитель В (&ОтборИсполнитель)
	| ", "") + "
	// гкс- [] Деснол 16.08.2022
	|ГДЕ
	|	ЗаявкаНаРемонтРемонтыОборудования.Ссылка В(&МассивОбъектов)
	|	И ЗаявкаНаРемонтРемонтыОборудования.ID В(&ID)
	| " + " ; ";
	ТекИерархия = Константы.торо_ИерархияДляВводаНовыхОР.Получить();
	Если ТекИерархия.ИзменяетсяДокументами Тогда 
		Запрос.Текст = Запрос.Текст + "
		|	ВЫБРАТЬ
		|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.ОбъектИерархии КАК ОР,
		|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.РодительИерархии КАК Родитель
		|Поместить ТекИерархия
		|ИЗ
		|	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(,
		|СтруктураИерархии = &СтруктураИерархии) КАК торо_РасположениеОРВСтруктуреИерархииСрезПоследних
		|ГДЕ
		|торо_РасположениеОРВСтруктуреИерархииСрезПоследних.Удален = ЛОЖЬ	" + " ; " ;
	Иначе
		Запрос.Текст = Запрос.Текст + "
		|	ВЫБРАТЬ
		|	Рег.ОбъектИерархии КАК ОР,
		|	Рег.РодительИерархии КАК Родитель
		|Поместить ТекИерархия
		|ИЗ
		|	РегистрСведений.торо_ИерархическиеСтруктурыОР КАК Рег
		|ГДЕ Рег.СтруктураИерархии = &СтруктураИерархии
		|	" + " ; " ;
	КонецЕсли;
	#КонецОбласти
	#Область УровниОР
	Запрос.Текст = Запрос.Текст 
	+ "ВЫБРАТЬ
	|	Выбор когда ТЧ.ОР.ЭтоАктив Тогда ТЧ.ОР иначе ТЧ.Родитель конец КАК Родитель,
	|	ТЧ.ОР.ЭтоАктив ИЛИ (ТЧ.Родитель.ЭтоАктив
	|		И ТЧ.ОР.ИнвентарныйНомер = ТЧ.Родитель.ИнвентарныйНомер) КАК ЭтоАктив,
	|	ТЧ.ОР.ИнвентарныйНомер КАК ИН,
	|	ТЧ.ОР КАК ОР
	|ПОМЕСТИТЬ Уровень1
	|ИЗ
	|	ТекИерархия КАК ТЧ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РемонтыОборудования КАК ВТ_РемонтыОборудования
	|		ПО ТЧ.ОР = ВТ_РемонтыОборудования.ОбъектРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Уровень1.ЭтоАктив
	|			ТОГДА Уровень1.Родитель
	|		ИНАЧЕ ТЧ.Родитель
	|	КОНЕЦ КАК Родитель,
	|	ВЫБОР
	|		КОГДА Уровень1.ЭтоАктив
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ТЧ.Родитель.ЭтоАктив
	|				И ТЧ.Родитель.ИнвентарныйНомер = Уровень1.ИН
	|	КОНЕЦ КАК ЭтоАктив,
	|	Уровень1.ИН КАК ИН,
	|	Уровень1.ОР КАК ОР
	|ПОМЕСТИТЬ Уровень2
	|ИЗ
	|	Уровень1 КАК Уровень1
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТекИерархия КАК ТЧ
	|		ПО (ТЧ.ОР = Уровень1.Родитель)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Уровень1.ЭтоАктив
	|			ТОГДА Уровень1.Родитель
	|		ИНАЧЕ ТЧ.Родитель
	|	КОНЕЦ КАК Родитель,
	|	ВЫБОР
	|		КОГДА Уровень1.ЭтоАктив
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ТЧ.Родитель.ЭтоАктив
	|				И ТЧ.Родитель.ИнвентарныйНомер = Уровень1.ИН
	|	КОНЕЦ КАК ЭтоАктив,
	|	Уровень1.ИН КАК ИН,
	|	Уровень1.ОР КАК ОР
	|ПОМЕСТИТЬ Уровень3
	|ИЗ
	|	Уровень2 КАК Уровень1
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТекИерархия КАК ТЧ
	|		ПО (ТЧ.ОР = Уровень1.Родитель);
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Уровень1.ЭтоАктив
	|			ТОГДА Уровень1.Родитель
	|		ИНАЧЕ ТЧ.Родитель
	|	КОНЕЦ КАК Родитель,
	|	ВЫБОР
	|		КОГДА Уровень1.ЭтоАктив
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ТЧ.Родитель.ЭтоАктив
	|				И ТЧ.Родитель.ИнвентарныйНомер = Уровень1.ИН
	|	КОНЕЦ КАК ЭтоАктив,
	|	Уровень1.ИН КАК ИН,
	|	Уровень1.ОР КАК ОР
	|ПОМЕСТИТЬ Уровень4
	|ИЗ
	|	Уровень3 КАК Уровень1
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТекИерархия КАК ТЧ
	|		ПО (ТЧ.ОР = Уровень1.Родитель)" + " ; " 
	#КонецОбласти
	#Область КонецЗапроса
	+ "
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ВыявленныеДефектыСписокДефектов.гкс_СимптомДефекта КАК Симптом,
	|	ВТ_РемонтыОборудования.Документ КАК Документ,
	|	ВТ_РемонтыОборудования.ID КАК ID
	|ПОМЕСТИТЬ ВТ_СимптомыОбъектовРемонта
	|ИЗ
	|	ВТ_РемонтыОборудования КАК ВТ_РемонтыОборудования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов
	|		ПО ВТ_РемонтыОборудования.ID = торо_ВыявленныеДефектыСписокДефектов.ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_РемонтыОборудования.Документ КАК Документ,
	|	ВТ_РемонтыОборудования.Организация КАК Организация,
	|	ВТ_РемонтыОборудования.ОрганизацияПолучатель КАК ОрганизацияПолучатель,
	|	ВТ_РемонтыОборудования.Номер КАК Номер,
	|	ВТ_РемонтыОборудования.Дата КАК Дата,
	|	ВТ_РемонтыОборудования.Подразделение КАК Подразделение,
	|	ВТ_РемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта,
	|	ВТ_РемонтыОборудования.ТехНомерОР КАК ТехНомерОР,
	|	ВТ_РемонтыОборудования.ИнвентарныйНомерОР КАК ИнвентарныйНомерОР,
	|	ЕСТЬNULL(ВТ_СимптомыОбъектовРемонта.Симптом, ЗНАЧЕНИЕ(Справочник.гкс_СимптомыДефектов.ПустаяСсылка)) КАК СимптомДефекта,
	|	ВТ_РемонтыОборудования.ОписаниеРемонта КАК ОписаниеРемонта,
	|	ВТ_РемонтыОборудования.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	// гкс+ [04.23] Деснол 13.04.2023
	|	ВТ_РемонтыОборудования.ВидРемонтныхРабот.Код КАК КодВР,
	// гкс- [04.23] Деснол 13.04.2023
	// гкс+ [12.22] Деснол 12.12.2022
	|	ВТ_РемонтыОборудования.гкс_МежремонтныйПериод КАК гкс_МежремонтныйПериод,
	// гкс- [12.22] Деснол 12.12.2022
	|	ВТ_РемонтыОборудования.ID КАК ID,
	// Гкс+[TOIR20-220] Селимов от 02.02.2021. Изменено:{
	// |	Уровень3.Родитель КАК ОС,
	// }На:{
	|	ВТ_РемонтыОборудования.ОС КАК ОС,
	// } Гкс-[TOIR20-220]
	|	ПРЕДСТАВЛЕНИЕ(ВТ_РемонтыОборудования.Организация) КАК ОрганизацияПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_РемонтыОборудования.ОрганизацияПолучатель) КАК ОрганизацияПолучательПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_РемонтыОборудования.Подразделение) КАК ПодразделениеПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_РемонтыОборудования.ОбъектРемонта) КАК ОбъектРемонтаПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(ВТ_СимптомыОбъектовРемонта.Симптом, ЗНАЧЕНИЕ(Справочник.гкс_СимптомыДефектов.ПустаяСсылка))) КАК СимптомДефектаПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_РемонтыОборудования.ВидРемонтныхРабот) КАК ВидРемонтныхРаботПредставление
	|ИЗ
	|	ВТ_РемонтыОборудования КАК ВТ_РемонтыОборудования
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СимптомыОбъектовРемонта КАК ВТ_СимптомыОбъектовРемонта
	|		ПО ВТ_РемонтыОборудования.ID = ВТ_СимптомыОбъектовРемонта.ID
	|		Левое соединение Уровень4 КАК Уровень3
	|		ПО Уровень3.ОР = ВТ_РемонтыОборудования.ОбъектРемонта И Уровень3.ЭтоАктив
	|Итоги 
	|Максимум(Номер)
	|
	|
	|
	|ПО
	|Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкаНаРемонтРемонтныеРаботы.Ссылка КАК Документ,
	|	ЗаявкаНаРемонтРемонтныеРаботы.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	ЗаявкаНаРемонтРемонтныеРаботы.НомерСтроки КАК НомерСтроки,
	|	ЗаявкаНаРемонтРемонтныеРаботы.Количество КАК КОлвоРР,
	|	ЗаявкаНаРемонтРемонтныеРаботы.ID КАК РемонтнаяРабота_ID,
	|	ЗаявкаНаРемонтРемонтныеРаботы.РемонтнаяРабота КАК РемонтнаяРабота,
	|	ЗаявкаНаРемонтРемонтныеРаботы.гкс_Примечание КАК Примечание
	|ПОМЕСТИТЬ ВТ_РемонтныеРаботы
	|ИЗ
	|	Документ.торо_ЗаявкаНаРемонт.РемонтныеРаботы КАК ЗаявкаНаРемонтРемонтныеРаботы
	|ГДЕ
	// гкс+ [Релиз18] Деснол
	| " + ?(ЕстьОтборИсполнитель, "
	|	ЗаявкаНаРемонтРемонтныеРаботы.Исполнитель В (&ОтборИсполнитель) И
	| ", "") + "
	// гкс- [Релиз18]
	|	(ЗаявкаНаРемонтРемонтныеРаботы.Ссылка, ЗаявкаНаРемонтРемонтныеРаботы.РемонтыОборудования_ID) В
	|			(ВЫБРАТЬ
	|				ВТ_РемонтыОборудования.Документ КАК Документ,
	|				ВТ_РемонтыОборудования.ID КАК ID
	|			ИЗ
	|				ВТ_РемонтыОборудования)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РемонтыОборудования.Документ КАК Документ,
	|	ВТ_РемонтыОборудования.ID КАК ID,
	|	ВТ_РемонтныеРаботы.НомерСтроки КАК НомерСтроки,
	|	ВТ_РемонтныеРаботы.РемонтнаяРабота_ID КАК РемонтнаяРабота_ID,
	|	ВТ_РемонтныеРаботы.КолвоРР  КАК КолвоРР,
	|	ВТ_РемонтныеРаботы.РемонтнаяРабота КАК РемонтнаяРабота,
	|	ВТ_РемонтныеРаботы.Примечание КАК Примечание,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_РемонтныеРаботы.РемонтнаяРабота) КАК РемонтнаяРаботаПредставление
	|ИЗ
	|	ВТ_РемонтыОборудования КАК ВТ_РемонтыОборудования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РемонтныеРаботы КАК ВТ_РемонтныеРаботы
	|		ПО ВТ_РемонтыОборудования.Документ = ВТ_РемонтныеРаботы.Документ
	|			И ВТ_РемонтыОборудования.ID = ВТ_РемонтныеРаботы.РемонтыОборудования_ID
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|ИТОГИ ПО
	|	ID,
	|	Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РемонтныеРаботы.Документ КАК Документ,
	|	ВТ_РемонтныеРаботы.РемонтыОборудования_ID КАК ID,
	|	ВТ_РемонтныеРаботы.РемонтнаяРабота_ID КАК РемонтнаяРабота_ID,
	|	ЕСТЬNULL(ЗаявкаНаРемонтТрудовыеЗатраты.Количество, 0) КАК КоличествоЧеловек,
	|	ЕСТЬNULL(ЗаявкаНаРемонтТрудовыеЗатраты.ВремяРаботы, 0) / 60 КАК ВремяРаботыМин
	|ИЗ
	|	ВТ_РемонтныеРаботы КАК ВТ_РемонтныеРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.ТрудовыеЗатраты КАК ЗаявкаНаРемонтТрудовыеЗатраты
	|		ПО ВТ_РемонтныеРаботы.Документ = ЗаявкаНаРемонтТрудовыеЗатраты.Ссылка
	|			И ВТ_РемонтныеРаботы.РемонтыОборудования_ID = ЗаявкаНаРемонтТрудовыеЗатраты.РемонтыОборудования_ID
	|			И ВТ_РемонтныеРаботы.РемонтнаяРабота_ID = ЗаявкаНаРемонтТрудовыеЗатраты.ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РемонтыОборудования.Документ КАК Документ,
	|	ВТ_РемонтыОборудования.ID КАК ID,
	|	ЗаявкаНаРемонтИсполнителиПоРемонтам.Исполнитель КАК ИсполнительПоРемонту,
	|	ЗаявкаНаРемонтИсполнителиПоРемонтам.УточнениеИсполнителя КАК УточнениеИсполнителя,
	|	ПРЕДСТАВЛЕНИЕ(ЗаявкаНаРемонтИсполнителиПоРемонтам.Исполнитель) КАК ИсполнительПоРемонтуПредставление
	|ИЗ
	|	ВТ_РемонтыОборудования КАК ВТ_РемонтыОборудования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.ИсполнителиПоРемонтам КАК ЗаявкаНаРемонтИсполнителиПоРемонтам
	|		ПО ВТ_РемонтыОборудования.Документ = ЗаявкаНаРемонтИсполнителиПоРемонтам.Ссылка
	|			И ВТ_РемонтыОборудования.ID = ЗаявкаНаРемонтИсполнителиПоРемонтам.РемонтыОборудования_ID
	|Упорядочить По ЗаявкаНаРемонтИсполнителиПоРемонтам.НомерСтроки
	|ИТОГИ ПО
	|	ID,
	|	Документ";
	#КонецОбласти
	#Область Согласование
	Если ЭтоЭП Тогда 
		Запрос.Текст = Запрос.Текст + " ; "
		+ "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Рег.Пользователь КАК Пользователь,
		|	Рег.СтатусДокумента КАК Статус,
		|	Рег.Период КАК Период,
		|	Рег.СогласуемыйДокумент КАК Док
		|ПОМЕСТИТЬ ТЧ_ИсторияСогласования
		|ИЗ
		|	РегистрСведений.торо_ИсторияСтатусовСогласованияДокументов КАК Рег
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РемонтыОборудования КАК ТЧ
		|		ПО (ТЧ.Документ = Рег.СогласуемыйДокумент)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Рег.ТекущаяДолжность КАК Должность,
		|	ТЧ.Пользователь КАК Пользователь,
		|	ТЧ.Статус.Код КАК Статус,
		|	ТЧ.Период КАК Период,
		|	ТЧ.Док КАК Док,
		|	ТЧ.Пользователь.ФизическоеЛицо КАК ФИО
		|ИЗ
		|	ТЧ_ИсторияСогласования КАК ТЧ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК Рег
		|		ПО ТЧ.Пользователь.ФизическоеЛицо = Рег.ФизическоеЛицо
		// гкс+ [] Деснол 16.09.2022
		|УПОРЯДОЧИТЬ ПО
		|	Период
		// гкс- [] Деснол 16.09.2022
		|ИТОГИ ПО
		|	Док";
	КонецЕсли;
	#КонецОбласти
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("СтруктураИерархии", ТекИерархия);
	// гкс- [Печатки] Куст 14.10.2020
	// гкс+ [Релиз18] Деснол
	Запрос.УстановитьПараметр("ОтборИсполнитель", ОтборИсполнитель);
	// гкс- [Релиз18]
	Если ПараметрыПечати.Свойство("МассивID") Тогда
		Запрос.УстановитьПараметр("ID", ПараметрыПечати.МассивID);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, 
		"И ЗаявкаНаРемонтРемонтыОборудования.ID В(&ID)", "");
	КонецЕсли;
	
	ЭтоПервый = Истина;
	ИндексВыборкиСДокументами 			= 7;
	ИндексВыборкиСРемонтнымиРаботами 	= ИндексВыборкиСДокументами + 2;
	ИндексВыборкиСТрудовымиЗатратами 	= ИндексВыборкиСРемонтнымиРаботами + 1;
	ИндексВыборкиСИсполнителями 		= ИндексВыборкиСТрудовымиЗатратами + 1;
	// >> [Деснол] [Куст А.Л.] [16.02.2021]
	ПакетСогласования = ИндексВыборкиСИсполнителями + 2;
	// << [Деснол] [Куст А.Л.] [16.02.2021]
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаДокументов 		= РезультатыЗапроса[ИндексВыборкиСДокументами].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаРемонтныеРаботы 	= РезультатыЗапроса[ИндексВыборкиСРемонтнымиРаботами].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаТрудовыеЗатраты	= РезультатыЗапроса[ИндексВыборкиСТрудовымиЗатратами].Выбрать();
	ВыборкаИсполнители		= РезультатыЗапроса[ИндексВыборкиСИсполнителями].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	// >> [Деснол] [Куст А.Л.] [16.02.2021]
	Если ЭтоЭП Тогда 
		ВыборкаСогласования = РезультатыЗапроса[ПакетСогласования].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	КонецЕсли;
	// << [Деснол] [Куст А.Л.] [16.02.2021]
	
	Пока ВыборкаДокументов.Следующий() Цикл
		Если НЕ ЭтоПервый Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ЭтоПервый = Ложь;
		
		// Заполняем Шапку табличного документа
		ЗаполнитьЗначенияСвойств(Шапка.Параметры, ВыборкаДокументов);
		// гкс+ [Печатка] Куст 27.10.2020
		ОбластьШапка2.Параметры.ЗРДолжность = "";
		ОбластьШапка2.Параметры.ЗРПодпись = "";
		ОбластьШапка2.Параметры.ЗРДата = "";
		ОбластьШапка2.Параметры.ЗРФИО = "";
		ОбластьШапка2.Параметры.ЗКДолжность = "";
		ОбластьШапка2.Параметры.ЗКПодпись = "";
		ОбластьШапка2.Параметры.ЗКДата = "";
		ОбластьШапка2.Параметры.ЗКФИО = "";
		Подвал.Параметры.З1Должность = "";
		Подвал.Параметры.З1Подпись = "";
		Подвал.Параметры.З1Дата = "";
		Подвал.Параметры.З1ФИО = "";
		Подвал.Параметры.З2Должность = "";
		Подвал.Параметры.З2Подпись = "";
		Подвал.Параметры.З2Дата = "";
		Подвал.Параметры.З2ФИО = "";
		Подвал.Параметры.З3Должность = "";
		Подвал.Параметры.З3Подпись = "";
		Подвал.Параметры.З3Дата = "";
		Подвал.Параметры.З3ФИО = "";
		
		ВыборкаРемонтовДокумента = ВыборкаДокументов.Выбрать();
		ВыборкаРемонтовДокумента.Следующий();
		ЗаполнитьЗначенияСвойств(Шапка.Параметры, ВыборкаРемонтовДокумента);
		// гкс+ [04.23] Деснол 13.04.2023
		// Задача: Убрать поле совсем
		// гкс+ [03.23] Деснол 17.03.2023
		//Шапка.Параметры.Получатель = "Содружество-Соя ЗАО";
		//Если СтрНайти(Шапка.Параметры.ОрганизацияПредставление, "КУРСКАГРОТЕРМИНАЛ") > 0 Тогда 
		//	Шапка.Параметры.Получатель = Шапка.Параметры.ОрганизацияПредставление;
		//КонецЕсли;
		// гкс- [03.23] Деснол 17.03.2023
		// гкс- [04.23] Деснол 13.04.2023
		
		ВыборкаРемонтовДокумента.Сбросить();
		ТабличныйДокумент.Вывести(Шапка);
		Пока ВыборкаРемонтовДокумента.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ОбластьШапкаОР.Параметры, ВыборкаРемонтовДокумента);
			ТабличныйДокумент.Вывести(ОбластьШапкаОР);
			// гкс+ [04.23] Деснол 13.04.2023
			Если Не ВыборкаРемонтовДокумента.КодВР = "PM-06" Тогда //Анг раскладка
				Если ВыборкаРемонтовДокумента.гкс_МежремонтныйПериод = 0 Тогда 
					ОбластьШапкаОР2.Параметры.гкс_МежремонтныйПериод = "Не капитализируемый внеплановый ремонт";
				// Гкс+[TOIR20-531] Вялых Д.А. от 14.02.2025. Добавлено:{	
				Иначе
					ОбластьШапкаОР2.Параметры.гкс_МежремонтныйПериод = Строка(ВыборкаРемонтовДокумента.гкс_МежремонтныйПериод);
				// } Гкс-[TOIR20-531] Вялых Д.А. от 14.02.2025.
				КонецЕсли;
				ТабличныйДокумент.Вывести(ОбластьШапкаОР2);
			КонецЕсли;
			// гкс- [04.23] Деснол 13.04.2023
		
			СтруктураПоискаID = Новый Структура("ID", ВыборкаРемонтовДокумента.ID);
			СтруктураПоискаIDДокумент = Новый Структура("ID, Документ", ВыборкаРемонтовДокумента.ID, ВыборкаРемонтовДокумента.Документ);
			// гкс+ [] Деснол 21.09.2022
			ИсполнительПодразделение = Истина;
			ВыборкаИсполнители.Сбросить();
			Если ВыборкаИсполнители.НайтиСледующий(СтруктураПоискаID) Тогда 
				
				ВыборкаИсполнителиДокумент = ВыборкаИсполнители.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Если ВыборкаИсполнителиДокумент.НайтиСледующий(СтруктураПоискаIDДокумент) Тогда
					Выборка = ВыборкаИсполнителиДокумент.Выбрать();
					Если Выборка.Следующий() Тогда
						// гкс+ [] Деснол 17.08.2022
						Если ОтборИсполнитель.Количество() И ЕстьОтборИсполнитель Тогда 
							ЗаполнитьЗначенияСвойств(Подвал.Параметры, Новый Структура("ИсполнительПоРемонтуПредставление", ОтборИсполнитель[0]));
						Иначе
							ЗаполнитьЗначенияСвойств(Подвал.Параметры, Выборка);
						КонецЕсли;
						// гкс- [] Деснол 17.08.2022
						Если ЗначениеЗаполнено(Выборка.ИсполнительПоРемонту) И 
							ТипЗнч(Выборка.ИсполнительПоРемонту) = Тип("СправочникСсылка.Контрагенты") Тогда 
							ИсполнительПодразделение = Ложь;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;

			Если ЭтоЭП Тогда 
				ВременыйТекст = Подвал.Параметры.ИсполнительПоРемонтуПредставление;
				Если ИсполнительПодразделение Тогда 
					ОбластьШапка2 		= Макет.ПолучитьОбласть("Шапка2_Подр");
					Подвал 		= Макет.ПолучитьОбласть("Подвал_Подр");
				Иначе
					ОбластьШапка2 		= Макет.ПолучитьОбласть("Шапка2");
					Подвал 		= Макет.ПолучитьОбласть("Подвал");
				КонецЕсли;
				Подвал.Параметры.ИсполнительПоРемонтуПредставление = ВременыйТекст;
				Шапка.Параметры.Номер = Шапка.Параметры.Номер + "  " 
				+ Формат(ВыборкаДокументов.Дата, "ДФ=""дд.ММ.гггг""");
				ВыборкаСогласования.Сбросить();
				Если ВыборкаСогласования.НайтиСледующий(Новый Структура("Док", ВыборкаДокументов.документ)) Тогда 
					ВыборкаИС = ВыборкаСогласования.Выбрать();
					Если ИсполнительПодразделение Тогда 
						#Область ЕслиПодразделение
						Пока ВыборкаИС.Следующий() Цикл
							Если ВыборкаИС.Статус = "П00000117" Тогда 
								ОбластьШапка2.Параметры.ЗРДолжность = ВыборкаИС.Должность;
								ОбластьШапка2.Параметры.ЗРПодпись = "Согласовано в 1С ТОиР";
								ОбластьШапка2.Параметры.ЗРФИО = ПреобразоватьФИО(ВыборкаИС.ФИО);
							ИначеЕсли ВыборкаИС.Статус = "П00000104" 
								ИЛИ (ВыборкаИС.Статус = "П00000108") Тогда 
								ОбластьШапка2.Параметры.ЗКДолжность = ВыборкаИС.Должность;
								ОбластьШапка2.Параметры.ЗКПодпись = "Согласовано в 1С ТОиР";
								ОбластьШапка2.Параметры.ЗКФИО = ПреобразоватьФИО(ВыборкаИС.ФИО);
							ИначеЕсли ВыборкаИС.Статус = "П00000110" ИЛИ ВыборкаИС.Статус = "П00000127" Тогда 
								Подвал.Параметры.З1Должность = ВыборкаИС.Должность;
								Подвал.Параметры.З1Подпись = "Согласовано в 1С ТОиР";
								Подвал.Параметры.З1ФИО = ПреобразоватьФИО(ВыборкаИС.ФИО);
								Подвал.Параметры.З1Подтверждение = "Объем работ согласован";
							ИначеЕсли ВыборкаИС.Статус = "П00000111" Тогда 
								Подвал.Параметры.З2Должность = ВыборкаИС.Должность;
								Подвал.Параметры.З2Подпись = "Согласовано в 1С ТОиР";
								Подвал.Параметры.З2ФИО = ПреобразоватьФИО(ВыборкаИС.ФИО);
								Подвал.Параметры.З2Подтверждение = "Согласован исполнитель";
							ИначеЕсли ВыборкаИС.Статус = "П00000003" Тогда 
								Подвал.Параметры.З3Должность = ВыборкаИС.Должность;
								Подвал.Параметры.З3Подпись = "Согласовано в 1С ТОиР";
								Подвал.Параметры.З3ФИО = ПреобразоватьФИО(ВыборкаИС.ФИО);
								Подвал.Параметры.З3Подтверждение = "Утверждаю";
							КонецЕсли;
						КонецЦикла;
						#КонецОбласти
					Иначе
						#Область ЕслиКонтрагент
						Пока ВыборкаИС.Следующий() Цикл
							Если ВыборкаИС.Статус = "П00000117" Тогда 
								ОбластьШапка2.Параметры.ЗРДолжность = ВыборкаИС.Должность;
								ОбластьШапка2.Параметры.ЗРПодпись = "Согласовано в 1С ТОиР";
								ОбластьШапка2.Параметры.ЗРДата = ВыборкаИС.Период;
								ОбластьШапка2.Параметры.ЗРФИО = ПреобразоватьФИО(ВыборкаИС.ФИО);
							ИначеЕсли ВыборкаИС.Статус = "П00000104" 
									ИЛИ (ВыборкаИС.Статус = "П00000108") Тогда 
								ОбластьШапка2.Параметры.ЗКДолжность = ВыборкаИС.Должность;
								ОбластьШапка2.Параметры.ЗКПодпись = "Согласовано в 1С ТОиР";
								ОбластьШапка2.Параметры.ЗКДата = ВыборкаИС.Период;
								ОбластьШапка2.Параметры.ЗКФИО = ПреобразоватьФИО(ВыборкаИС.ФИО);
							ИначеЕсли ВыборкаИС.Статус = "П00000114" Тогда 
								Подвал.Параметры.З1Должность = ВыборкаИС.Должность;
								Подвал.Параметры.З1Подпись = "Согласовано в 1С ТОиР";
								Подвал.Параметры.З1Дата = ВыборкаИС.Период;
								Подвал.Параметры.З1ФИО = ПреобразоватьФИО(ВыборкаИС.ФИО);
								Подвал.Параметры.З1Подтверждение = "Передать подрядной организации";
							ИначеЕсли ВыборкаИС.Статус = "П00000046" Тогда 
								Подвал.Параметры.З2Должность = ВыборкаИС.Должность;
								Подвал.Параметры.З2Подпись = "Согласовано в 1С ТОиР";
								Подвал.Параметры.З2Дата = ВыборкаИС.Период;
								Подвал.Параметры.З2ФИО = ПреобразоватьФИО(ВыборкаИС.ФИО);
								Подвал.Параметры.З2Подтверждение = "Согласован исполнитель";
							ИначеЕсли ВыборкаИС.Статус = "П00000003" Тогда 
								Подвал.Параметры.З3Должность = ВыборкаИС.Должность;
								Подвал.Параметры.З3Подпись = "Согласовано в 1С ТОиР";
								Подвал.Параметры.З3Дата = ВыборкаИС.Период;
								Подвал.Параметры.З3ФИО = ПреобразоватьФИО(ВыборкаИС.ФИО);
								Подвал.Параметры.З3Подтверждение = "Утверждаю";
							КонецЕсли;
						КонецЦикла;
						#КонецОбласти
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			// гкс- [] Деснол 21.09.2022
			ВыборкаИсполнители.Сбросить();
			Если ИсполнительПодразделение Тогда
				ТабличныйДокумент.Вывести(ШапкаРР);
				
				// Заполняем строки ремонтных работ табличного документа
				ОбщаяВремяРаботМин = 0;
				Если ВыборкаРемонтныеРаботы.НайтиСледующий(СтруктураПоискаID) Тогда
					
					ВыборкаРемонтныеРаботамыДокумент = ВыборкаРемонтныеРаботы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Если ВыборкаРемонтныеРаботамыДокумент.НайтиСледующий(СтруктураПоискаIDДокумент) Тогда
						Выборка = ВыборкаРемонтныеРаботамыДокумент.Выбрать();
						Пока Выборка.Следующий() Цикл
							
							ЗаполнитьЗначенияСвойств(СтрокаРР.Параметры, Выборка);
							СтрокаРР.Параметры.РемонтнаяРаботаПредставление = ""+СтрокаРР.Параметры.РемонтнаяРаботаПредставление+" "+Выборка.Примечание; 
							
							КоличествоЧеловек 	= 0;
							ВремяРаботыМин 		= 0;
							СтруктураПоиска = Новый Структура("Документ, ID, РемонтнаяРабота_ID", Выборка.Документ, Выборка.ID, Выборка.РемонтнаяРабота_ID);
							Пока ВыборкаТрудовыеЗатраты.НайтиСледующий(СтруктураПоиска) Цикл
								КоличествоЧеловек = КоличествоЧеловек + ВыборкаТрудовыеЗатраты.КоличествоЧеловек;	
								ВремяРаботыМин	  = ВремяРаботыМин + ВыборкаТрудовыеЗатраты.ВремяРаботыМин;
								
								ОбщаяВремяРаботМин = ОбщаяВремяРаботМин + ВыборкаТрудовыеЗатраты.ВремяРаботыМин*ВыборкаТрудовыеЗатраты.КоличествоЧеловек;
							КонецЦикла;
							ВыборкаТрудовыеЗатраты.Сбросить();
							СтрокаРР.Параметры.КоличествоЧеловек = КоличествоЧеловек;	
							СтрокаРР.Параметры.ВремяРаботыМин	= ВремяРаботыМин;
							
							ТабличныйДокумент.Вывести(СтрокаРР);
							
						КонецЦикла;
					КонецЕсли;
					
				КонецЕсли;
				ВыборкаРемонтныеРаботы.Сбросить();
				
				// Заполняем подвал ремонтных работ табличного документа
				Если ОбщаяВремяРаботМин = Цел(ОбщаяВремяРаботМин) Тогда 
					ОбщаяВремяРаботМин = Строка(ОбщаяВремяРаботМин);
				КонецЕсли;
				ПодвалРР.Параметры.ОбщаяВремяРаботМин = ОбщаяВремяРаботМин;
				ТабличныйДокумент.Вывести(ПодвалРР);
			Иначе
				ТабличныйДокумент.Вывести(ШапкаРР2);
			КонецЕсли;
			
		КонецЦикла;
		ТабличныйДокумент.Вывести(ОбластьШапка2);
		ТабличныйДокумент.Вывести(Подвал);
	КонецЦикла;	
	
	// Зададим параметры макета
	ТабличныйДокумент.АвтоМасштаб	= Истина;
	ТабличныйДокумент.ПолеСверху  = 0;
	ТабличныйДокумент.ПолеСлева   = 0;
	ТабличныйДокумент.ПолеСнизу   = 0;
	ТабличныйДокумент.ПолеСправа  = 0;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // гкс- [7729] Тарасов 28.09.2020

&ИзменениеИКонтроль("Печать")
Процедура Расш_гкс_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	
	НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Заявка");
	Если НужноПечататьМакет Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"Заявка",
		#Удаление
		НСтр("ru = 'Смета ремонта (Заявка на ремонт)'"),
		#КонецУдаления
		#Вставка
		НСтр("es='El presupuesto de la reparación (la Demanda por la reparación)';ru='Смета ремонта (Заявка на ремонт)';"
		+"en='Repair estimate (Request for repair)'"),
		#КонецВставки
		
		ПечатьЗаявки(МассивОбъектов, ПараметрыПечати),
		, 
		"Документ.торо_ЗаявкаНаРемонт.ПФ_MXL_Заявка");
		
	КонецЕсли;
	#Вставка
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "дс_ОбъемРабот") Тогда
		НомерПП = 0;
		Для каждого СтрокаМассива Из МассивОбъектов Цикл
			ИмяМакета = "дс_ОбъемРабот";
			Если НомерПП > 0 Тогда 
				ИмяМакета = ИмяМакета + Строка(НомерПП);
				ОписаниеПечатнойФормы = КоллекцияПечатныхФорм.Найти(ВРег("дс_ОбъемРабот"), "ИмяВРЕГ");
				Если ОписаниеПечатнойФормы = Неопределено Тогда 
					Продолжить;
				КонецЕсли;
				НоваяПечатнаяФорма = КоллекцияПечатныхФорм.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяПечатнаяФорма, ОписаниеПечатнойФормы);
				НоваяПечатнаяФорма.ИмяВРЕГ = ВРег(ИмяМакета);
				НоваяПечатнаяФорма.ТабличныйДокумент = Неопределено;
				НоваяПечатнаяФорма.СинонимМакета = "";
				НоваяПечатнаяФорма.ИмяМакета = ИмяМакета;
				НоваяПечатнаяФорма.Картинка = Неопределено;
				НоваяПечатнаяФорма.ПолныйПутьКМакету = Неопределено;
				НоваяПечатнаяФорма.ИмяФайлаПечатнойФормы = Неопределено;
			КонецЕсли;
			ТемпМассив = Новый Массив();
			ТемпМассив.Добавить(СтрокаМассива);
			НовыйСиноним = "Объем работ";
			ТабДок = гкс_ПечатьОбъемРабот(ТемпМассив, ПараметрыПечати, НовыйСиноним);
			НовыйСиноним = СтрЗаменить(НовыйСиноним, "-", " ");
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
			ИмяМакета, 
			НовыйСиноним,     
			ТабДок,
			,
			"Документ.торо_ЗаявкаНаРемонт.ПФ_MXL_дс_НарядЗадание");
			НомерПП = НомерПП + 1;
		КонецЦикла;
	// гкс+ [Релиз16] Деснол
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "дс_ТехЗаданиеПО") Тогда
		НомерПП = 0;
		Для каждого СтрокаМассива Из МассивОбъектов Цикл
			ИмяМакета = "дс_ТехЗаданиеПО";
			Если НомерПП > 0 Тогда 
				ИмяМакета = ИмяМакета + Строка(НомерПП);
				ОписаниеПечатнойФормы = КоллекцияПечатныхФорм.Найти(ВРег("дс_ТехЗаданиеПО"), "ИмяВРЕГ");
				Если ОписаниеПечатнойФормы = Неопределено Тогда 
					Продолжить;
				КонецЕсли;
				НоваяПечатнаяФорма = КоллекцияПечатныхФорм.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяПечатнаяФорма, ОписаниеПечатнойФормы);
				НоваяПечатнаяФорма.ИмяВРЕГ = ВРег(ИмяМакета);
				НоваяПечатнаяФорма.ТабличныйДокумент = Неопределено;
				НоваяПечатнаяФорма.СинонимМакета = "";
				НоваяПечатнаяФорма.ИмяМакета = ИмяМакета;
				НоваяПечатнаяФорма.Картинка = Неопределено;
				НоваяПечатнаяФорма.ПолныйПутьКМакету = Неопределено;
				НоваяПечатнаяФорма.ИмяФайлаПечатнойФормы = Неопределено;
			КонецЕсли;
			ТемпМассив = Новый Массив();
			ТемпМассив.Добавить(СтрокаМассива);
			НовыйСиноним = "Техническое задание (выбор ПО)";
			ТабДок = ПечатьНарядЗадание(ТемпМассив, ПараметрыПечати, НовыйСиноним);
			НовыйСиноним = СтрЗаменить(НовыйСиноним, "-", " ");
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
			ИмяМакета, 
			НовыйСиноним,     
			ТабДок,
			,
			"Документ.торо_ЗаявкаНаРемонт.ПФ_MXL_дс_НарядЗадание");
			НомерПП = НомерПП + 1;
		КонецЦикла;
	// гкс- [Релиз16]
	// } Гкс-[TOIR20-504] Вялых Д.А. от 15.01.2025.
	// Гкс+[TOIR20-504] Вялых Д.А. от 15.01.2025. Добавлено:{
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "дс_ТехЗаданиеПОв2") Тогда
		НомерПП = 0;
		Для каждого СтрокаМассива Из МассивОбъектов Цикл
			ИмяМакета = "дс_ТехЗаданиеПОв2";
			Если НомерПП > 0 Тогда 
				ИмяМакета = ИмяМакета + Строка(НомерПП);
				ОписаниеПечатнойФормы = КоллекцияПечатныхФорм.Найти(ВРег("дс_ТехЗаданиеПОв2"), "ИмяВРЕГ");
				Если ОписаниеПечатнойФормы = Неопределено Тогда 
					Продолжить;
				КонецЕсли;
				НоваяПечатнаяФорма = КоллекцияПечатныхФорм.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяПечатнаяФорма, ОписаниеПечатнойФормы);
				НоваяПечатнаяФорма.ИмяВРЕГ = ВРег(ИмяМакета);
				НоваяПечатнаяФорма.ТабличныйДокумент = Неопределено;
				НоваяПечатнаяФорма.СинонимМакета = "";
				НоваяПечатнаяФорма.ИмяМакета = ИмяМакета;
				НоваяПечатнаяФорма.Картинка = Неопределено;
				НоваяПечатнаяФорма.ПолныйПутьКМакету = Неопределено;
				НоваяПечатнаяФорма.ИмяФайлаПечатнойФормы = Неопределено;
			КонецЕсли;
			ТемпМассив = Новый Массив();
			ТемпМассив.Добавить(СтрокаМассива);
			НовыйСиноним = "Техническое задание (выбор ПО) вер 2";
			ТабДок = ПечатьНарядЗадание(ТемпМассив, ПараметрыПечати, НовыйСиноним);
			НовыйСиноним = СтрЗаменить(НовыйСиноним, "-", " ");
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
			ИмяМакета, 
			НовыйСиноним,     
			ТабДок,
			,
			"Документ.торо_ЗаявкаНаРемонт.ПФ_MXL_дс_НарядЗадание_в2");
			НомерПП = НомерПП + 1;
		КонецЦикла;
		// } Гкс-[TOIR20-504] Вялых Д.А. от 15.01.2025.
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "дс_НарядЗадание") Тогда
		НомерПП = 0;
		Для каждого СтрокаМассива Из МассивОбъектов Цикл
			ИмяМакета = "дс_НарядЗадание";
			Если НомерПП > 0 Тогда 
				ИмяМакета = ИмяМакета + Строка(НомерПП);
				ОписаниеПечатнойФормы = КоллекцияПечатныхФорм.Найти(ВРег("дс_НарядЗадание"), "ИмяВРЕГ");
				Если ОписаниеПечатнойФормы = Неопределено Тогда 
					Продолжить;
				КонецЕсли;
				НоваяПечатнаяФорма = КоллекцияПечатныхФорм.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяПечатнаяФорма, ОписаниеПечатнойФормы);
				НоваяПечатнаяФорма.ИмяВРЕГ = ВРег(ИмяМакета);
				НоваяПечатнаяФорма.ТабличныйДокумент = Неопределено;
				НоваяПечатнаяФорма.СинонимМакета = "";
				НоваяПечатнаяФорма.ИмяМакета = ИмяМакета;
				НоваяПечатнаяФорма.Картинка = Неопределено;
				НоваяПечатнаяФорма.ПолныйПутьКМакету = Неопределено;
				НоваяПечатнаяФорма.ИмяФайлаПечатнойФормы = Неопределено;
			КонецЕсли;
			ТемпМассив = Новый Массив();
			ТемпМассив.Добавить(СтрокаМассива);
			НовыйСиноним = "Техническое задание";
			// гкс+ [Релиз16] Деснол
			ПараметрыПечати.Вставить("ВсеСпособы", Истина);
			// гкс- [Релиз16]
			ТабДок = ПечатьНарядЗадание(ТемпМассив, ПараметрыПечати, НовыйСиноним);
			НовыйСиноним = СтрЗаменить(НовыйСиноним, "-", " ");
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
			ИмяМакета, 
			НовыйСиноним,     
			ТабДок,
			,
			"Документ.торо_ЗаявкаНаРемонт.ПФ_MXL_дс_НарядЗадание");
			НомерПП = НомерПП + 1;
		КонецЦикла;
		// гкс+ [7729] Тарасов 28.09.2020
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "дс_ЗаказНаРаботу") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"дс_ЗаказНаРаботу", 
		"Заказ на работу", 
		ПечатьЗаказНаРаботу(МассивОбъектов, ПараметрыПечати),
		,
		"Документ.торо_ЗаявкаНаРемонт.ПФ_MXL_дс_ЗаказНаРаботу");
		// гкс- [7729] Тарасов 28.09.2020	
		// гкс+ [Релиз 1] Куст 16.02.2021
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "дс_ЗаказНаРаботуЭП") Тогда
		ПараметрыПечати.Вставить("ЭП", Истина);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"дс_ЗаказНаРаботуЭП", 
		"Заказ на работу (ЭП)", 
		ПечатьЗаказНаРаботу(МассивОбъектов, ПараметрыПечати),
		,
		"Документ.торо_ЗаявкаНаРемонт.ПФ_MXL_дс_ЗаказНаРаботу");
		// гкс- [Релиз 1] Куст 16.02.2021
	// гкс+ [Релиз18] Деснол
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "гкс_АктПередачи") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"гкс_АктПередачи", 
		"Акт передачи оборудования в ремонт", 
		ПечатьАктПередачи(МассивОбъектов, ПараметрыПечати),
		,
		"Документ.торо_ЗаявкаНаРемонт.ПФ_MXL_гкс_АктПередачи");
	// гкс- [Релиз18]
	// гкс+ [11.22] Деснол 03.11.2022
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "гкс_Лимитка") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"гкс_Лимитка", 
		"Лимитно-заборная карта", 
		гкс_ПечатьЛимитки(МассивОбъектов, ПараметрыПечати),
		,
		"Документ.торо_ЗаявкаНаРемонт.ПФ_MXL_гкс_Лимитка");
	// гкс- [11.22] Деснол 03.11.2022
	КонецЕсли;
	#КонецВставки
КонецПроцедуры

&ИзменениеИКонтроль("ДобавитьКомандыПечати")
Процедура Расш_гкс_ДобавитьКомандыПечати(КомандыПечати)
	
	// Заявка на ремонт
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_ЗаявкаНаРемонт";
	КомандаПечати.Идентификатор = "Заявка";
	#Удаление
	КомандаПечати.Представление = НСтр("ru = 'Смета ремонта (Заявка на ремонт)'");
	#КонецУдаления
	#Вставка
	КомандаПечати.Представление = НСтр("es='El presupuesto de la reparación (la Demanda por la reparación)';
	|ru='Смета ремонта (Заявка на ремонт)';en='Repair estimate (Request for repair)'");
	КомандаПечати.Обработчик = "торо_Печать.гкс_ЗапроситьИсполнителейПередПечатью";
	#КонецВставки
	#Удаление
	КомандаПечати.Обработчик = "торо_Печать.ЗапроситьУПользователяДополнительныеПараметрыПередПечатью";
	#КонецУдаления
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	
	#Вставка 
	// Гкс+[TOIR20-536] Вялых Д.А. от 13.02.2025. Закомментировано:{
	// гкс+ [Релиз16] Деснол
	// Наряд задание  по
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.МенеджерПечати = "Документ.торо_ЗаявкаНаРемонт";
	//КомандаПечати.Идентификатор = "дс_ТехЗаданиеПО";
	//КомандаПечати.Представление = НСтр("ru='Техническое задание (выбор ПО)';en='Technical (selection by)'");
	//КомандаПечати.Обработчик = "торо_Печать.гкс_ЗапроситьИсполнителейПередПечатью";
	//КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	//"НастройкиТОиР",
	//"ПечатьДокументовБезПредварительногоПросмотра",
	//Ложь);
	// гкс- [Релиз16]
	// } Гкс-[TOIR20-536] Вялых Д.А. от 13.02.2025.
	// Гкс+[TOIR20-504] Вялых Д.А. от 15.01.2025. Добавлено:{
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_ЗаявкаНаРемонт";
	КомандаПечати.Идентификатор = "дс_ТехЗаданиеПОв2";
	// Гкс+[TOIR20-536] Вялых Д.А. от 13.02.2025. Закомментировано и добавлено:{
	//КомандаПечати.Представление = НСтр("ru='Техническое задание (выбор ПО) (вер 2)';en='Technical (selection by) (ver 2)'");
	КомандаПечати.Представление = НСтр("ru='Техническое задание (выбор ПО)';en='Technical (selection by)'");
	// } Гкс-[TOIR20-536] Вялых Д.А. от 13.02.2025.
	КомандаПечати.Обработчик = "торо_Печать.гкс_ЗапроситьИсполнителейПередПечатью";
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	// } Гкс-[TOIR20-504] Вялых Д.А. от 15.01.2025.
	// Наряд задание
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_ЗаявкаНаРемонт";
	КомандаПечати.Идентификатор = "дс_НарядЗадание";
	КомандаПечати.Представление = НСтр("ru='Техническое задание';en='Technical task'");
	// Гкс+[TOIR20-537] Вялых Д.А. от 05.03.2025. Добавлено и закомментировано:{
	//КомандаПечати.Обработчик = "торо_Печать.гкс_ЗапроситьИсполнителейПередПечатью"; 
	КомандаПечати.Обработчик = "торо_Печать.гкс_ЗапроситьНеобходимостьПечататьSOPиOPL";
	// } Гкс-[TOIR20-537] Вялых Д.А. от 05.03.2025.
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	// Объем работ
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_ЗаявкаНаРемонт";
	КомандаПечати.Идентификатор = "дс_ОбъемРабот";
	КомандаПечати.Представление = НСтр("ru='Объем работ';en='Scope of work'");
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	//
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_ЗаявкаНаРемонт";
	КомандаПечати.Идентификатор = "дс_ЗаказНаРаботу";
	КомандаПечати.Представление = НСтр("ru='Заказ на работу';en='Work order'");
	КомандаПечати.Обработчик = "торо_Печать.гкс_ЗапроситьИсполнителейПередПечатью";
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	//
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_ЗаявкаНаРемонт";
	КомандаПечати.Идентификатор = "дс_ЗаказНаРаботуЭП";
	КомандаПечати.Представление = НСтр("ru='Заказ на работу (ЭП)';en='Work order (ES)'");
	КомандаПечати.Обработчик = "торо_Печать.гкс_ЗапроситьИсполнителейПередПечатью";
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	// гкс+ [Релиз18] Деснол
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_ЗаявкаНаРемонт";
	КомандаПечати.Идентификатор = "гкс_АктПередачи";
	КомандаПечати.Представление = НСтр("ru='Акт передачи оборудования в ремонт';en='Certificate of transfer of equipment for repair'");
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	// гкс- [Релиз18]
	// гкс+ [11.22] Деснол 03.11.2022
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_ЗаявкаНаРемонт";
	КомандаПечати.Идентификатор = "гкс_Лимитка";
	КомандаПечати.Представление = НСтр("ru='Лимитно-заборная карта';en='Лимитно-заборная карта'");
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	// гкс- [11.22] Деснол 03.11.2022
	#КонецВставки
КонецПроцедуры

&ИзменениеИКонтроль("ПечатьЗаявки")
Функция Расш_гкс_ПечатьЗаявки(МассивОбъектов, ПараметрыПечати)
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	#Вставка
	СдвигЧП = Час(ТекущаяДатаСеанса()) - Час(ТекущаяДата());
	// гкс+ [Релиз18] Деснол
	Если ПараметрыПечати.Свойство("ОтборИсполнитель") Тогда 
		ОтборИсполнитель = ПараметрыПечати.ОтборИсполнитель;
		ЕстьОтборИсполнитель = Истина;
	Иначе
		ОтборИсполнитель = Новый Массив();
		ЕстьОтборИсполнитель = Ложь;
	КонецЕсли;
	// гкс- [Релиз18]
	#КонецВставки
	
	ИспользоватьХарактеристики = Константы.торо_ИспользоватьХарактеристикиНоменклатуры.Получить();
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_ЗаявкаНаРемонт.ПФ_MXL_Заявка");
	ШапкаДокумента                = Макет.ПолучитьОбласть("ШапкаДокумента");
	ШапкаСоставРабот              = Макет.ПолучитьОбласть("ШапкаСоставРаботКомментарий");
	
	ПроверкаШапкиСФО = Макет.Области.Найти("ШапкаНоменклатураФО"); 
	ПроверкаСтрокиСФО = Макет.Области.Найти("СтрокаТаблицыНоменклатурыФО");
	Если ИспользоватьХарактеристики И ТипЗнч(ПроверкаШапкиСФО) <> Тип("Неопределено") 
		И ТипЗнч(ПроверкаСтрокиСФО)<> Тип("Неопределено")Тогда 
		ШапкаНоменклатуры         = Макет.ПолучитьОбласть("ШапкаНоменклатураФО");
		СтрокаТаблицыНоменклатуры = Макет.ПолучитьОбласть("СтрокаТаблицыНоменклатурыФО");
	Иначе
		ШапкаНоменклатуры         = Макет.ПолучитьОбласть("ШапкаНоменклатура");
		СтрокаТаблицыНоменклатуры = Макет.ПолучитьОбласть("СтрокаТаблицыНоменклатуры");
	КонецЕсли;
	
	ПроверкаШапкиСФО = Макет.Области.Найти("ШапкаЗапчастиФО"); 
	ПроверкаСтрокиСФО = Макет.Области.Найти("СтрокаТаблицыЗапчастейФО");
	Если ИспользоватьХарактеристики И ТипЗнч(ПроверкаШапкиСФО) <> Тип("Неопределено") 
		И ТипЗнч(ПроверкаСтрокиСФО)<> Тип("Неопределено")Тогда
		ШапкаЗапчасти             = Макет.ПолучитьОбласть("ШапкаЗапчастиФО");
		СтрокаТаблицыЗапчастей    = Макет.ПолучитьОбласть("СтрокаТаблицыЗапчастейФО")
	Иначе 
		ШапкаЗапчасти             = Макет.ПолучитьОбласть("ШапкаЗапчасти");
		СтрокаТаблицыЗапчастей    = Макет.ПолучитьОбласть("СтрокаТаблицыЗапчастей");
	КонецЕсли;
	
	ШапкаМерыБезопасности         = Макет.ПолучитьОбласть("ШапкаМерыБезопасности");
	ШапкаТрудозатраты             = Макет.ПолучитьОбласть("ШапкаТрудозатраты");
	ШапкаИнструменты              = Макет.ПолучитьОбласть("ШапкаИнструменты");
	СтрокаТаблицыРабот            = Макет.ПолучитьОбласть("СтрокаТаблицыРаботКомментарий");
	СтрокаТаблицыМерыБезопасности = Макет.ПолучитьОбласть("СтрокаТаблицыМерыБезопасности");
	СтрокаТаблицыТрудозатрат      = Макет.ПолучитьОбласть("СтрокаТаблицыТрудозатрат");
	СтрокаТаблицыИнструментов     = Макет.ПолучитьОбласть("СтрокаТаблицыИнструментов");
	ИтогоТрудозатраты             = Макет.ПолучитьОбласть("ИтогоТрудозатраты");
	ИтогоМатериалы                = Макет.ПолучитьОбласть("ИтогоМатериалы");
	ИтогоЗапчасти                 = Макет.ПолучитьОбласть("ИтогоЗапчасти");
	Подвал                        = Макет.ПолучитьОбласть("Подвал");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка КАК Ссылка,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка.Номер КАК Номер,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка.Дата КАК Дата,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка.Организация КАК Организация,
	#Вставка
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка.Организация.гкс_ВидЦены КАК ТипЦены,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка.Организация.гкс_ВидЦены.ВалютаЦены КАК Валюта,
	#КонецВставки
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка.Подразделение КАК Подразделение,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка.Ответственный КАК Ответственный,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ID КАК ID,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаНачала КАК ДатаНачала,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаОкончания КАК ДатаОкончания,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ОписаниеРемонта КАК ОписаниеРемонта,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ОбъектРемонта.ИнвентарныйНомер КАК ИнвентарныйНомер
	|ИЗ
	|	Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК торо_ЗаявкаНаРемонтРемонтыОборудования
	#Вставка
	// гкс+ [] Деснол 16.08.2022
	| " + ?(ЕстьОтборИсполнитель, "
	|	внутреннее соединение Документ.торо_ЗаявкаНаРемонт.ИсполнителиПоРемонтам КАК торо_ЗаявкаНаРемонтИсполнителиПоРемонтам
	|	ПО торо_ЗаявкаНаРемонтИсполнителиПоРемонтам.Ссылка = торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка
	|	И торо_ЗаявкаНаРемонтИсполнителиПоРемонтам.РемонтыОборудования_ID = торо_ЗаявкаНаРемонтРемонтыОборудования.ID
	|	И торо_ЗаявкаНаРемонтИсполнителиПоРемонтам.Исполнитель В (&ОтборИсполнитель)
	| ", "") + "
	// гкс- [] Деснол 16.08.2022
	#КонецВставки
	|ГДЕ
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка В(&Ссылка)
	|	И торо_ЗаявкаНаРемонтРемонтыОборудования.ID В(&ID)
	|ИТОГИ
	|	МАКСИМУМ(Номер),
	|	МАКСИМУМ(Дата),
	#Вставка
	|	МАКСИМУМ(ТипЦены),
	|	МАКСИМУМ(Валюта),
	#КонецВставки
	|	МАКСИМУМ(Организация),
	|	МАКСИМУМ(Подразделение),
	|	МАКСИМУМ(Ответственный)
	|ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	Если ПараметрыПечати.Свойство("МассивID") Тогда
		Запрос.УстановитьПараметр("ID", ПараметрыПечати.МассивID);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И торо_ЗаявкаНаРемонтРемонтыОборудования.ID В(&ID)", "");
	КонецЕсли;
	#Вставка
	// гкс+ [] Деснол 16.08.2022
	Запрос.УстановитьПараметр("ОтборИсполнитель", ОтборИсполнитель);
	// гкс- [] Деснол 16.08.2022
	#КонецВставки
	
	ВыборкаШапки = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
	ЭтоПервый = Истина;
	
	Пока ВыборкаШапки.Следующий() Цикл
		#Вставка
		ВалютаШапки = ВыборкаШапки.Валюта;
		Если Не ЗначениеЗаполнено(ВалютаШапки) Тогда 
			ВалютаШапки = Константы.ВалютаУправленческогоУчета.Получить();
		КонецЕсли;
		ТипЦеныШапки = ВыборкаШапки.ТипЦены;
		Если Не ЗначениеЗаполнено(ТипЦеныШапки) Тогда 
			ТипЦеныШапки = Константы.торо_ТипЦеныДляРасчетаСебестоимостиРемонта.Получить();
		КонецЕсли;
		#КонецВставки
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтнаяРабота ССЫЛКА Справочник.торо_ТехнологическиеОперации
		|			ТОГДА ВЫБОР
		|					КОГДА торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтнаяРабота.НаименованиеДляПечати = """"
		|						ТОГДА торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтнаяРабота.Наименование
		|					ИНАЧЕ торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтнаяРабота.НаименованиеДляПечати
		|				  КОНЕЦ
		|		ИНАЧЕ торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтнаяРабота.Наименование
		|	КОНЕЦ КАК Работа,
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.ID КАК ID,
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.Родитель_ID КАК Родитель_ID,
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.Количество КАК Количество,
		#Вставка
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.гкс_Примечание КАК гкс_Примечание,
		#КонецВставки
		|	ТехнологическиеОперации.СодержаниеРабот КАК Комментарий,
		|	ТехнологическиеОперации.БазоваяЕдиницаИзмерения КАК ЕдИзм
		|ИЗ
		|	Документ.торо_ЗаявкаНаРемонт.РемонтныеРаботы КАК торо_ЗаявкаНаРемонтРемонтныеРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ТехнологическиеОперации КАК ТехнологическиеОперации
		|		ПО торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтнаяРабота = ТехнологическиеОперации.Ссылка
		|ГДЕ
		#Вставка
		// гкс+ [Релиз18] Деснол
		| " + ?(ЕстьОтборИсполнитель, "
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.Исполнитель В (&ОтборИсполнитель) И
		| ", "") + "
		// гкс- [Релиз18]
		#КонецВставки
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.Ссылка = &Заявка";
		
		Запрос.УстановитьПараметр("Заявка", ВыборкаШапки.Ссылка);	
		#Вставка
		// гкс+ [Релиз18] Деснол
		Запрос.УстановитьПараметр("ОтборИсполнитель", ОтборИсполнитель);
		// гкс- [Релиз18]
		#КонецВставки
		тзСписокРаботИсх = Запрос.Выполнить().Выгрузить();
		
		ВыборкаРемонтов = ВыборкаШапки.Выбрать(ОбходРезультатаЗапроса.Прямой);
		
		Пока ВыборкаРемонтов.Следующий() Цикл
			
			ОбщийИтог = 0;
			
			Если НЕ ЭтоПервый Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ЭтоПервый = Ложь;
			
			ШапкаДокумента.Параметры.Организация                 = ВыборкаШапки.Организация;
			ШапкаДокумента.Параметры.Подразделение               = ВыборкаШапки.Подразделение;
			#Вставка
			ШапкаДокумента.Параметры.ДатаНачалаРемонтныхРабот    = ВыборкаРемонтов.ДатаНачала + (СдвигЧП * 3600);
			ШапкаДокумента.Параметры.ДатаОкончанияРемонтныхРабот = ВыборкаРемонтов.ДатаОкончания + (СдвигЧП * 3600);
			#КонецВставки
			#Удаление
			ШапкаДокумента.Параметры.ДатаНачалаРемонтныхРабот    = ВыборкаРемонтов.ДатаНачала;
			ШапкаДокумента.Параметры.ДатаОкончанияРемонтныхРабот = ВыборкаРемонтов.ДатаОкончания;
			#КонецУдаления
			ШапкаДокумента.Параметры.ИнвНомер                    = ВыборкаРемонтов.ИнвентарныйНомер;
			ШапкаДокумента.Параметры.ВидРемонтныхРабот           = торо_ЗаполнениеДокументов.ПолучитьПредоставленияВРДляПечати(ВыборкаРемонтов.ВидРемонтныхРабот);
			ШапкаДокумента.Параметры.Номер                       = ВыборкаШапки.Номер;
			#Вставка
			ШапкаДокумента.Параметры.ДатаНомерЗаявки = Формат(ВыборкаШапки.Дата + (СдвигЧП * 3600), "ДФ=dd.MM.yyyy");
			#КонецВставки
			#Удаление
			ШапкаДокумента.Параметры.ДатаНомерЗаявки             = Формат(ВыборкаШапки.Дата,"ДФ=dd.MM.yyyy");
			#КонецУдаления
			
			ОбъектРемонта = ВыборкаРемонтов.ОбъектРемонта; 
			ШапкаДокумента.Параметры.ОбъектРемонта = торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(ОбъектРемонта);
			// Заполнить поле Ответственный
			Если НЕ ЗначениеЗаполнено(ВыборкаШапки.Ответственный) Тогда
				Подвал.Параметры.Ответственный = "                                           ";
			Иначе
				Подвал.Параметры.Ответственный = ВыборкаШапки.Ответственный;
			КонецЕсли;
			
			ТабДок.Вывести(ШапкаДокумента);
			ТабДок.Вывести(ШапкаСоставРабот);
			
			// Накладываем отбор по РемонтуОборудования. Если делать это в запросе - теряется последовательность ремонтов.
			ПараметрыОтбора = Новый Структура("РемонтыОборудования_ID",ВыборкаРемонтов.ID);
			тзСписокРабот = тзСписокРаботИсх.Скопировать(ПараметрыОтбора);	
			Ном = "1";
			МассивID = Новый Массив;
			
			МассивСтрок = тзСписокРабот.НайтиСтроки(Новый Структура("Родитель_ID",""));
			
			// Определяем используются ли комментарии или нет
			ВывестиРаботы(МассивСтрок,тзСписокРабот,СтрокаТаблицыРабот,ТабДок,МассивID,Ном,Истина,Истина);
			
			// Вывод трудовых затрат 
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	торо_ЗаявкаНаРемонтТрудовыеЗатраты.Квалификация КАК Квалификация,
			|	СУММА(торо_ЗаявкаНаРемонтТрудовыеЗатраты.ВремяРаботы * торо_ЗаявкаНаРемонтТрудовыеЗатраты.Количество) КАК ВремяРаботы,
			|	СУММА(торо_ЗаявкаНаРемонтТрудовыеЗатраты.Количество) КАК Количество
			#Вставка
			|,	торо_ЗаявкаНаРемонтТрудовыеЗатраты.Ссылка.Организация КАК Организация
			|,	ЕСТЬNULL(Документторо_ЗаявкаНаРемонтРемонтныеРаботы.гкс_ПовКоэф.Коэффициент, 1) КАК Коэффициент
			#КонецВставки
			|ПОМЕСТИТЬ втКвалификации
			|ИЗ
			|	Документ.торо_ЗаявкаНаРемонт.ТрудовыеЗатраты КАК торо_ЗаявкаНаРемонтТрудовыеЗатраты
			#Вставка
			|	Внутреннее соединение Документ.торо_ЗаявкаНаРемонт.РемонтныеРаботы КАК Документторо_ЗаявкаНаРемонтРемонтныеРаботы
			|	ПО Документторо_ЗаявкаНаРемонтРемонтныеРаботы.ID = торо_ЗаявкаНаРемонтТрудовыеЗатраты.ID
			|	И Документторо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтыОборудования_ID 
			| = торо_ЗаявкаНаРемонтТрудовыеЗатраты.РемонтыОборудования_ID
			// гкс+ [Релиз18] Деснол
			| " + ?(ЕстьОтборИсполнитель, "
			|	И Документторо_ЗаявкаНаРемонтРемонтныеРаботы.Исполнитель В (&ОтборИсполнитель)
			| ", "") + "
			// гкс- [Релиз18]
			#КонецВставки
			|ГДЕ
			|	торо_ЗаявкаНаРемонтТрудовыеЗатраты.РемонтыОборудования_ID = &РемонтыОборудования_ID
			|	И торо_ЗаявкаНаРемонтТрудовыеЗатраты.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	торо_ЗаявкаНаРемонтТрудовыеЗатраты.Квалификация
			#Вставка
			|, торо_ЗаявкаНаРемонтТрудовыеЗатраты.Ссылка.Организация
			|,	ЕСТЬNULL(Документторо_ЗаявкаНаРемонтРемонтныеРаботы.гкс_ПовКоэф.Коэффициент, 1)
			#КонецВставки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	торо_СтоимостьЧасаКвалификацииСрезПоследних.Квалификация КАК Квалификация,
			|	торо_СтоимостьЧасаКвалификацииСрезПоследних.Стоимость КАК Стоимость
			#Вставка
			|,	торо_СтоимостьЧасаКвалификацииСрезПоследних.Организация КАК Организация
			#КонецВставки
			|ПОМЕСТИТЬ втЦеныЗаЧас
			|ИЗ
			|	РегистрСведений.торо_СтоимостьЧасаКвалификации.СрезПоследних(
			|			&Дата,
			|				Квалификация В
			|					(ВЫБРАТЬ
			|						втКвалификации.Квалификация КАК Квалификация
			|					ИЗ
			|						втКвалификации КАК втКвалификации)) КАК торо_СтоимостьЧасаКвалификацииСрезПоследних
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	втКвалификации.Квалификация КАК Квалификация,
			|	втКвалификации.ВремяРаботы КАК ВремяРаботы,
			|	втКвалификации.Количество КАК Количество,
			|    ЕСТЬNULL(втЦеныЗаЧас.Стоимость, 0) КАК ЦенаЗаЧас, 
			#Вставка
			|	втКвалификации.Коэффициент *
			#конецВставки
			|    втКвалификации.ВремяРаботы / 3600 * ЕСТЬNULL(втЦеныЗаЧас.Стоимость, 0) КАК Стоимость
			|ИЗ
			|	втКвалификации КАК втКвалификации
			|		ЛЕВОЕ СОЕДИНЕНИЕ втЦеныЗаЧас КАК втЦеныЗаЧас
			#Удаление
			|		ПО втКвалификации.Квалификация = втЦеныЗаЧас.Квалификация";
			#КонецУдаления
			#Вставка
			|		ПО втКвалификации.Квалификация = втЦеныЗаЧас.Квалификация
			|		И втКвалификации.Организация = втЦеныЗаЧас.Организация";
			#КонецВставки
			
			Запрос.УстановитьПараметр("Ссылка", ВыборкаШапки.Ссылка);
			Запрос.УстановитьПараметр("РемонтыОборудования_ID", ВыборкаРемонтов.ID);
			Запрос.УстановитьПараметр("Дата", ВыборкаРемонтов.ДатаНачала); 
			#Удаление
			Запрос.УстановитьПараметр("Валюта",Константы.ВалютаУправленческогоУчета.Получить());
			#КонецУдаления
			#Вставка
			Запрос.УстановитьПараметр("Валюта", ВалютаШапки);
			// гкс+ [Релиз18] Деснол
			Запрос.УстановитьПараметр("ОтборИсполнитель", ОтборИсполнитель);
			// гкс- [Релиз18]
			#КонецВставки
			
			СтрокиТрудозатрат = Запрос.Выполнить().Выгрузить();
			Если СтрокиТрудозатрат.Количество() > 0 Тогда
				ТабДок.Вывести(ШапкаТрудозатраты);
				
				Ном = 1;
				Итого = 0;
				Для Каждого Стр Из СтрокиТрудозатрат Цикл
					СтрокаТаблицыТрудозатрат.Параметры.Номер = Ном;
					СтрокаТаблицыТрудозатрат.Параметры.Квалификация = Стр.Квалификация;
					#Удаление
					СтрокаТаблицыТрудозатрат.Параметры.Количество = Стр.Количество;
					#КонецУдаления
					СтрокаТаблицыТрудозатрат.Параметры.ВремяРаботы = торо_ОбщегоНазначенияКлиентСервер.СформироватьЗаголовокПоПродолжительности(Стр.ВремяРаботы);
					СтрокаТаблицыТрудозатрат.Параметры.Стоимость = Стр.Стоимость;
					ТабДок.Вывести(СтрокаТаблицыТрудозатрат);
					Ном = Ном +1;
					Итого = Итого + СтрокаТаблицыТрудозатрат.Параметры.Стоимость;
				КонецЦикла;
				
				ИтогоТрудозатраты.Параметры.Итого = Итого;
				ТабДок.Вывести(ИтогоТрудозатраты);
				ОбщийИтог = ОбщийИтог + Итого;
			КонецЕсли;
			
			// Вывод материальных затрат 
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	торо_ЗаявкаНаРемонтМатериальныеЗатраты.Номенклатура КАК Номенклатура,
			|	торо_ЗаявкаНаРемонтМатериальныеЗатраты.Количество КАК Количество,
			|	ВЫБОР
			|		КОГДА торо_ЗаявкаНаРемонтМатериальныеЗатраты.ЕдиницаИзмерения = &ПустаяСсылкаЕдИзм
			|			ТОГДА торо_ЗаявкаНаРемонтМатериальныеЗатраты.Номенклатура.ЕдиницаИзмерения
			|		ИНАЧЕ торо_ЗаявкаНаРемонтМатериальныеЗатраты.ЕдиницаИзмерения
			|	КОНЕЦ КАК ЕдИзм,
			|	торо_ЗаявкаНаРемонтМатериальныеЗатраты.ХарактеристикаНоменклатуры КАК Характеристика
			|ПОМЕСТИТЬ МатЗатраты_Упаковки
			|ИЗ
			|	Документ.торо_ЗаявкаНаРемонт.МатериальныеЗатраты КАК торо_ЗаявкаНаРемонтМатериальныеЗатраты
			#Вставка
			// гкс+ [Релиз18] Деснол
			| " + ?(ЕстьОтборИсполнитель, "
			|	Внутреннее соединение Документ.торо_ЗаявкаНаРемонт.РемонтныеРаботы КАК торо_ЗаявкаНаРемонтРемонтныеРаботы
			|	ПО торо_ЗаявкаНаРемонтРемонтныеРаботы.ID = торо_ЗаявкаНаРемонтМатериальныеЗатраты.ID
			|	И торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтыОборудования_ID 
			|	= торо_ЗаявкаНаРемонтМатериальныеЗатраты.РемонтыОборудования_ID
			|	И торо_ЗаявкаНаРемонтРемонтныеРаботы.Исполнитель В (&ОтборИсполнитель)
			| ", "") + "
			// гкс- [Релиз18]
			#КонецВставки
			|ГДЕ
			|	торо_ЗаявкаНаРемонтМатериальныеЗатраты.Ссылка = &Заявка
			|	И торо_ЗаявкаНаРемонтМатериальныеЗатраты.РемонтыОборудования_ID = &РемонтыОборудования_ID
			| 
			|ИНДЕКСИРОВАТЬ ПО
			|	ЕдИзм
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СУММА(МатериальныеЗатраты.Количество * ЕСТЬNULL(УпаковкиНоменклатуры.Коэффициент, 1)) КАК Количество,
			|	МатериальныеЗатраты.Номенклатура КАК Номенклатура,
			|	МатериальныеЗатраты.Характеристика КАК Характеристика,
			|	МатериальныеЗатраты.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
			|ПОМЕСТИТЬ МатЗатраты
			|ИЗ
			|	МатЗатраты_Упаковки КАК МатериальныеЗатраты
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
			|		ПО МатериальныеЗатраты.ЕдИзм = УпаковкиНоменклатуры.Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|    МатериальныеЗатраты.Номенклатура, 
			|    МатериальныеЗатраты.Характеристика,
			|    МатериальныеЗатраты.Номенклатура.ЕдиницаИзмерения
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура,
			|	Характеристика,
			|	ЕдиницаИзмерения
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЦеныНоменклатуры.Цена КАК Цена,
			|	ЦеныНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
			|	ЦеныНоменклатуры.Характеристика КАК Характеристика
			|ПОМЕСТИТЬ ЦеныНоменклатурыСрезПоследних
			|ИЗ
			|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
			|			&Дата,
			|			ВидЦены = &ТипЦены
			|				И (Номенклатура, Характеристика) В
			|					(ВЫБРАТЬ
			|						Таб.Номенклатура КАК Номенклатура,
			|						Таб.Характеристика КАК Характеристика
			|					ИЗ
			|						МатЗатраты КАК Таб)) КАК ЦеныНоменклатуры
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура,
			|	Характеристика,
			|	ЕдиницаИзмерения
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	МатериальныеЗатраты.Количество КАК Количество,
			|	МатериальныеЗатраты.Номенклатура КАК Номенклатура,
			|	МатериальныеЗатраты.Характеристика КАК Характеристика,
			|	МатериальныеЗатраты.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена,
			|	МатериальныеЗатраты.Количество * ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Стоимость
			|ИЗ
			|	МатЗатраты КАК МатериальныеЗатраты
			|		ЛЕВОЕ СОЕДИНЕНИЕ ЦеныНоменклатурыСрезПоследних КАК ЦеныНоменклатурыСрезПоследних
			|		ПО МатериальныеЗатраты.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
			|			И МатериальныеЗатраты.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика";
			
			Запрос.УстановитьПараметр("Заявка",ВыборкаШапки.Ссылка);
			Запрос.УстановитьПараметр("РемонтыОборудования_ID", ВыборкаРемонтов.ID);
			Запрос.УстановитьПараметр("ПустаяСсылкаЕдИзм", Справочники.УпаковкиНоменклатуры.ПустаяСсылка());
			Запрос.УстановитьПараметр("Дата", ВыборкаРемонтов.ДатаНачала);
			#Удаление
			Запрос.УстановитьПараметр("ТипЦены",Константы.торо_ТипЦеныДляРасчетаСебестоимостиРемонта.Получить()); 			
			#КонецУдаления
			#Вставка
			Запрос.УстановитьПараметр("ТипЦены",ТипЦеныШапки); 			
			// гкс+ [Релиз18] Деснол
			Запрос.УстановитьПараметр("ОтборИсполнитель", ОтборИсполнитель);
			// гкс- [Релиз18]
			#КонецВставки
			ТаблицаМатериалов = Запрос.Выполнить().Выгрузить();
			
			Если ТаблицаМатериалов.Количество()>0 Тогда
				ТабДок.Вывести(ШапкаНоменклатуры);
				
				Ном = 0;
				Итого = 0;
				Для Каждого Стр Из ТаблицаМатериалов Цикл
					Ном = Ном + 1;
					СтрокаТаблицыНоменклатуры.Параметры.Номер = Ном; 
					СтрокаТаблицыНоменклатуры.Параметры.Заполнить(Стр);
					Итого = Итого + СтрокаТаблицыНоменклатуры.Параметры.Стоимость;  
					ТабДок.Вывести(СтрокаТаблицыНоменклатуры);
				КонецЦикла;
				
				ИтогоМатериалы.Параметры.Итого = Итого;
				ТабДок.Вывести(ИтогоМатериалы);
				ОбщийИтог = ОбщийИтог + Итого;
			КонецЕсли;
			
			// Вывод запчастей  
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	торо_ЗаявкаНаРемонтЗапчастиРемонта.Номенклатура КАК Номенклатура,
			|	торо_ЗаявкаНаРемонтЗапчастиРемонта.Количество КАК Количество,
			|	торо_ЗаявкаНаРемонтЗапчастиРемонта.ХарактеристикаНоменклатуры КАК Характеристика,
			|	ВЫБОР
			|		КОГДА торо_ЗаявкаНаРемонтЗапчастиРемонта.ЕдиницаИзмерения = &ПустаяСсылкаЕдИзм
			|			ТОГДА торо_ЗаявкаНаРемонтЗапчастиРемонта.Номенклатура.ЕдиницаИзмерения
			|		ИНАЧЕ торо_ЗаявкаНаРемонтЗапчастиРемонта.ЕдиницаИзмерения
			|	КОНЕЦ КАК ЕдиницаИзмерения
			|ПОМЕСТИТЬ Запчасти_Упаковки
			|ИЗ
			|	Документ.торо_ЗаявкаНаРемонт.ЗапчастиРемонта КАК торо_ЗаявкаНаРемонтЗапчастиРемонта
			#Вставка
			// гкс+ [Релиз18] Деснол
			| " + ?(ЕстьОтборИсполнитель, "
			|	Внутреннее соединение Документ.торо_ЗаявкаНаРемонт.РемонтныеРаботы КАК торо_ЗаявкаНаРемонтРемонтныеРаботы
			|	ПО торо_ЗаявкаНаРемонтРемонтныеРаботы.ID = торо_ЗаявкаНаРемонтЗапчастиРемонта.ID
			|	И торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтыОборудования_ID 
			|	= торо_ЗаявкаНаРемонтЗапчастиРемонта.РемонтыОборудования_ID
			|	И торо_ЗаявкаНаРемонтРемонтныеРаботы.Исполнитель В (&ОтборИсполнитель)
			| ", "") + "
			// гкс- [Релиз18]
			#КонецВставки
			|ГДЕ
			|	торо_ЗаявкаНаРемонтЗапчастиРемонта.Ссылка = &Заявка
			|	И торо_ЗаявкаНаРемонтЗапчастиРемонта.РемонтыОборудования_ID = &РемонтыОборудования_ID
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ЕдиницаИзмерения
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Запчасти_Упаковки.Номенклатура КАК Номенклатура,
			|	Запчасти_Упаковки.Характеристика КАК Характеристика,
			|	Запчасти_Упаковки.Номенклатура.ЕдиницаИзмерения КАК ЕдИзм,
			|	СУММА(Запчасти_Упаковки.Количество * ЕСТЬNULL(УпаковкиНоменклатуры.Коэффициент, 1)) КАК Количество
			|ПОМЕСТИТЬ Запчасти
			|ИЗ
			|	Запчасти_Упаковки КАК Запчасти_Упаковки
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
			|		ПО Запчасти_Упаковки.ЕдиницаИзмерения = УпаковкиНоменклатуры.Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	Запчасти_Упаковки.Номенклатура,
			|	Запчасти_Упаковки.Характеристика,
			|	Запчасти_Упаковки.Номенклатура.ЕдиницаИзмерения
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура,
			|	Характеристика,
			|	ЕдИзм
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
			|	ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
			|	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика
			|ПОМЕСТИТЬ ЦеныНоменклатуры
			|ИЗ
			|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
			|			&Дата,
			|			ВидЦены = &ТипЦены
			|				И (Номенклатура, Характеристика) В
			|					(ВЫБРАТЬ
			|						Таб.Номенклатура КАК Номенклатура,
			|						Таб.Характеристика КАК Характеристика
			|					ИЗ
			|						Запчасти КАК Таб)) КАК ЦеныНоменклатурыСрезПоследних
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура,
			|	Характеристика,
			|	ЕдиницаИзмерения
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Запчасти.Количество КАК Количество,
			|	Запчасти.Номенклатура КАК Запчасть,
			|	Запчасти.Характеристика КАК Характеристика,
			|	Запчасти.ЕдИзм КАК ЕдИзм,
			|	Запчасти.Количество * ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) КАК Стоимость
			|ИЗ
			|	Запчасти КАК Запчасти
			|		ЛЕВОЕ СОЕДИНЕНИЕ ЦеныНоменклатуры КАК ЦеныНоменклатуры
			|		ПО Запчасти.Номенклатура = ЦеныНоменклатуры.Номенклатура
			|			И Запчасти.Характеристика = ЦеныНоменклатуры.Характеристика";
			
			Запрос.УстановитьПараметр("Заявка",ВыборкаШапки.Ссылка);
			Запрос.УстановитьПараметр("РемонтыОборудования_ID", ВыборкаРемонтов.ID);
			Запрос.УстановитьПараметр("ПустаяСсылкаЕдИзм", Справочники.УпаковкиНоменклатуры.ПустаяСсылка());
			Запрос.УстановитьПараметр("Дата", ВыборкаРемонтов.ДатаНачала);
			Запрос.УстановитьПараметр("ТипЦены",Константы.торо_ТипЦеныДляРасчетаСебестоимостиРемонта.Получить()); 			
			#Вставка
			// гкс+ [Релиз18] Деснол
			Запрос.УстановитьПараметр("ОтборИсполнитель", ОтборИсполнитель);
			// гкс- [Релиз18]
			#КонецВставки
			ТаблицаЗапчастей = Запрос.Выполнить().Выгрузить();
			
			Если ТаблицаЗапчастей.Количество()>0 Тогда
				ТабДок.Вывести(ШапкаЗапчасти);
				
				Ном = 0;
				Итого = 0;
				Для Каждого Стр Из ТаблицаЗапчастей Цикл
					Ном = Ном + 1;
					СтрокаТаблицыЗапчастей.Параметры.Номер = Ном; 
					СтрокаТаблицыЗапчастей.Параметры.Заполнить(Стр);
					Итого = Итого + СтрокаТаблицыЗапчастей.Параметры.Стоимость;  
					ТабДок.Вывести(СтрокаТаблицыЗапчастей);
				КонецЦикла;
				
				ИтогоЗапчасти.Параметры.Итого = Итого;
				ТабДок.Вывести(ИтогоЗапчасти);
				ОбщийИтог = ОбщийИтог + Итого;
			КонецЕсли;
			
			// Вывод инструментов 
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	торо_ЗаявкаНаРемонтИнструменты.Инструмент КАК Инструмент,
			|	торо_ЗаявкаНаРемонтИнструменты.Количество КАК Количество,
			|	ВЫБОР
			|		КОГДА торо_ЗаявкаНаРемонтИнструменты.ЕдиницаИзмерения = &ПустаяСсылкаЕдИзм
			|			ТОГДА торо_ЗаявкаНаРемонтИнструменты.Инструмент.ЕдиницаИзмерения
			|		ИНАЧЕ торо_ЗаявкаНаРемонтИнструменты.ЕдиницаИзмерения
			|	КОНЕЦ КАК ЕдиницаИзмерения
			|ПОМЕСТИТЬ Инстурменты_Упаковки
			|ИЗ
			|	Документ.торо_ЗаявкаНаРемонт.Инструменты КАК торо_ЗаявкаНаРемонтИнструменты
			#Вставка
			// гкс+ [Релиз18] Деснол
			| " + ?(ЕстьОтборИсполнитель, "
			|	Внутреннее соединение Документ.торо_ЗаявкаНаРемонт.РемонтныеРаботы КАК торо_ЗаявкаНаРемонтРемонтныеРаботы
			|	ПО торо_ЗаявкаНаРемонтРемонтныеРаботы.ID = торо_ЗаявкаНаРемонтИнструменты.ID
			|	И торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтыОборудования_ID 
			|	= торо_ЗаявкаНаРемонтИнструменты.РемонтыОборудования_ID
			|	И торо_ЗаявкаНаРемонтРемонтныеРаботы.Исполнитель В (&ОтборИсполнитель)
			| ", "") + "
			// гкс- [Релиз18]
			#КонецВставки
			|ГДЕ
			|	торо_ЗаявкаНаРемонтИнструменты.Ссылка = &Заявка
			|	И торо_ЗаявкаНаРемонтИнструменты.РемонтыОборудования_ID = &РемонтыОборудования_ID
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Инстурменты_Упаковки.Инструмент КАК Инструмент,
			|	СУММА(Инстурменты_Упаковки.Количество * ЕСТЬNULL(УпаковкиНоменклатуры.Коэффициент, 1)) КАК Количество,
			|	Инстурменты_Упаковки.Инструмент.ЕдиницаИзмерения КАК ЕдИзм
			|ИЗ
			|	Инстурменты_Упаковки КАК Инстурменты_Упаковки
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
			|		ПО Инстурменты_Упаковки.ЕдиницаИзмерения = УпаковкиНоменклатуры.Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	Инстурменты_Упаковки.Инструмент,
			|	Инстурменты_Упаковки.Инструмент.ЕдиницаИзмерения";
			
			Запрос.УстановитьПараметр("Заявка",ВыборкаШапки.Ссылка);
			Запрос.УстановитьПараметр("РемонтыОборудования_ID", ВыборкаРемонтов.ID);
			Запрос.УстановитьПараметр("ПустаяСсылкаЕдИзм", Справочники.УпаковкиНоменклатуры.ПустаяСсылка());
			#Вставка
			// гкс+ [Релиз18] Деснол
			Запрос.УстановитьПараметр("ОтборИсполнитель", ОтборИсполнитель);
			// гкс- [Релиз18]
			#КонецВставки
			
			ТаблицаИнструментов = Запрос.Выполнить().Выгрузить();
			Если ТаблицаИнструментов.Количество() > 0  Тогда 
				ТабДок.Вывести(ШапкаИнструменты);
			КонецЕсли;
			
			Ном = 0;
			Для каждого Стр Из ТаблицаИнструментов Цикл
				Ном = Ном +1;
				СтрокаТаблицыИнструментов.Параметры.Номер = Ном;
				СтрокаТаблицыИнструментов.Параметры.Заполнить(Стр);
				ТабДок.Вывести(СтрокаТаблицыИнструментов);
			КонецЦикла;
			
			Если ВыборкаШапки.Ссылка.МерыБезопасности.Количество()>0 Тогда
				ТабДок.Вывести(ШапкаМерыБезопасности);
			КонецЕсли;
			
			Для Каждого Стр Из ВыборкаШапки.Ссылка.МерыБезопасности Цикл
				СтрокаТаблицыМерыБезопасности.Параметры.Номер = Стр.НомерСтроки;
				СтрокаТаблицыМерыБезопасности.Параметры.МерыБезопасности = Стр.МераБезопасности;
				ТабДок.Вывести(СтрокаТаблицыМерыБезопасности);   
			КонецЦикла;
			
			Подвал.Параметры.СуммаУслуг = ОбщийИтог;
			#Удаление
			ФормСтрока = "Л = ru_RU; ДП = Истина";
			#КонецУдаления
			#Вставка
			ФормСтрока = "ДП = Истина";  
			ПарамПред  = Справочники.Валюты.НайтиПоНаименованию(ВалютаШапки).ПараметрыПрописи;
			СуммаУслуг = " " + Строка(ВалютаШапки)+" ("+ ЧислоПрописью(ОбщийИтог, ФормСтрока, ПарамПред)+")";
			#КонецВставки
			#Удаление
			ПарамПред  = Справочники.Валюты.НайтиПоНаименованию(Константы.ВалютаУправленческогоУчета.Получить()).ПараметрыПрописи;
			СуммаУслуг = " " + Строка(Константы.ВалютаУправленческогоУчета.Получить())+" ("+ ЧислоПрописью(ОбщийИтог, ФормСтрока, ПарамПред)+")";
			#КонецУдаления
			Подвал.Параметры.СуммаУслугПрописью = СуммаУслуг;
			ТабДок.Вывести(Подвал);
			
		КонецЦикла;
	КонецЦикла;
	
	ТабДок.ТолькоПросмотр = Истина;
	Возврат ТабДок;	
	
КонецФункции

&ИзменениеИКонтроль("ВывестиРаботы")
Процедура Расш_гкс_ВывестиРаботы(МассивСтрок, тзСписокРабот, СтрокаТаблицыРабот, ТабДок, МассивID, Ном, Комментарии, КолВо)
	Для каждого СписокРабот Из МассивСтрок Цикл
		СтрокаТаблицыРабот.Параметры.Номер = Ном;
		СтрокаТаблицыРабот.Параметры.Работа = СписокРабот.Работа;
		#Вставка
		СтрокаТаблицыРабот.Параметры.Работа = СтрокаТаблицыРабот.Параметры.Работа + " " 
		+ СписокРабот.гкс_Примечание;
		#КонецВставки
		Если КолВо = Истина Тогда
			СтрокаТаблицыРабот.Параметры.Количество=СписокРабот.Количество; 
			СтрокаТаблицыРабот.Параметры.ЕдИзм=СписокРабот.ЕдИзм; 
		КонецЕсли;	
		Если Комментарии = Истина Тогда
			СтрокаТаблицыРабот.Параметры.Комментарий = СписокРабот.Комментарий;
		КонецЕсли;
		ТабДок.Вывести(СтрокаТаблицыРабот);
		МассивID.Добавить(СписокРабот.ID);
		ВывестиРаботы(тзСписокРабот.НайтиСтроки(Новый Структура("Родитель_ID",СписокРабот.ID)),тзСписокРабот,СтрокаТаблицыРабот,ТабДок,МассивID,Ном + ".1",Комментарии,КолВо);
		
		посТочка = СтрНайти(ном, ".", НаправлениеПоиска.СКонца);
		Если посТочка <> 0 Тогда
			ном = лев(Ном, посТочка) + Строка(Число(Прав(Ном, СтрДлина(Ном) - посТочка))+1);
		Иначе
			ном = Строка(Число(Ном) + 1);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// гкс+ [Релиз18] Деснол
Функция ПечатьАктПередачи(МассивОбъектов, ПараметрыПечати)
	
	Макет  = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_ЗаявкаНаРемонт.ПФ_MXL_гкс_АктПередачи");
	ТабДокумент = Новый ТабличныйДокумент;
	Шапка = Макет.ПолучитьОбласть("Шапка");
	СтрокаТЧ = Макет.ПолучитьОбласть("СтрокаТЧ");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	ТипИТК = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка КАК Ссылка,
		|	торо_ЗаявкаНаРемонтРемонтыОборудования.ОбъектРемонта КАК ОР,
		|	торо_ЗаявкаНаРемонтРемонтыОборудования.ID КАК ИД,
		|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка.Организация КАК Организация,
		|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка.Подразделение КАК Подразделение,
		|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка.Номер КАК Номер,
		|	торо_ЗаявкаНаРемонтРемонтыОборудования.ОбъектРемонта.ТехНомер КАК ТехНомер
		|ИЗ
		|	Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК торо_ЗаявкаНаРемонтРемонтыОборудования
		|ГДЕ
		|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка В(&Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.Ссылка КАК Ссылка,
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтнаяРабота КАК РемонтнаяРабота,
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.ID КАК ИД,
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.Родитель_ID КАК Родитель_ИД,
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтыОборудования_ID КАК ИД_Ремонта,
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.гкс_Примечание КАК Примечание
		|ИЗ
		|	Документ.торо_ЗаявкаНаРемонт.РемонтныеРаботы КАК торо_ЗаявкаНаРемонтРемонтныеРаботы
		|ГДЕ
		|	торо_ЗаявкаНаРемонтРемонтныеРаботы.Ссылка В(&Ссылка)
		|ИТОГИ ПО
		|	Ссылка,
		|	ИД_Ремонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_ЗаявкаНаРемонтИсполнителиПоРемонтам.Ссылка КАК Ссылка,
		|	торо_ЗаявкаНаРемонтИсполнителиПоРемонтам.Исполнитель КАК Исполнитель,
		|	торо_ЗаявкаНаРемонтИсполнителиПоРемонтам.РемонтыОборудования_ID КАК ИД_Ремонта
		|ИЗ
		|	Документ.торо_ЗаявкаНаРемонт.ИсполнителиПоРемонтам КАК торо_ЗаявкаНаРемонтИсполнителиПоРемонтам
		|ГДЕ
		|	торо_ЗаявкаНаРемонтИсполнителиПоРемонтам.Ссылка В(&Ссылка)
		|ИТОГИ ПО
		|	Ссылка,
		|	ИД_Ремонта";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	НомерПакетаДокументов = 0;
	НомерПакетаТО = 1;
	НомерПакетаИсполнители = 2;
	
	ВыборкаДок = РезультатЗапроса[НомерПакетаДокументов].Выбрать();
	ВыборкаТО = РезультатЗапроса[НомерПакетаТО].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаИсполнители = РезультатЗапроса[НомерПакетаИсполнители].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыводитьРазделитель = Ложь;
	Пока ВыборкаДок.Следующий() Цикл
		Если ВыводитьРазделитель Тогда 
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ВыводитьРазделитель = Истина;
		//
		Шапка.Параметры.Номер = ВыборкаДок.Номер;
		Шапка.Параметры.ТехНомер = ВыборкаДок.ТехНомер;
		Шапка.Параметры.ОР = ВыборкаДок.ОР;
		Шапка.Параметры.Организация = ВыборкаДок.Организация;
		Шапка.Параметры.Подразделение = ВыборкаДок.Подразделение;
		СтруктураПоискаДок = Новый Структура("Ссылка", ВыборкаДок.Ссылка);
		СтруктураПоискаИД = Новый Структура("ИД_Ремонта", ВыборкаДок.ИД);
		#Область ОбходТехКарт
		МассивТекстаТК = Новый Массив();
		ВыборкаТО.Сбросить();
		Если ВыборкаТО.НайтиСледующий(СтруктураПоискаДок) Тогда 
			ВыборкаТОИД = ВыборкаТО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Если ВыборкаТОИД.НайтиСледующий(СтруктураПоискаДок) Тогда 
				МассивТК = Новый Массив();
				МассивТО = Новый Массив();
				Выборка = ВыборкаТОИД.Выбрать();
				Пока Выборка.Следующий() Цикл
					ИмяТО = Строка(Выборка.РемонтнаяРабота);
					Если ЗначениеЗаполнено(Выборка.Примечание) Тогда 
						ИмяТО = ИмяТО + " " + Выборка.Примечание;
					КонецЕсли;
					Если ТипЗнч(Выборка.РемонтнаяРабота) = ТипИТК Тогда 
						Если Не ЗначениеЗаполнено(Выборка.Родитель_ИД) Тогда 
							СтруктураТК = Новый Структура("ИД,Имя,Строки", Выборка.ИД, ИмяТО, Новый Массив());
							МассивТК.Добавить(СтруктураТК);
						КонецЕсли;
					Иначе
						Если ЗначениеЗаполнено(Выборка.Родитель_ИД) Тогда 
							ТКНайдена = Ложь;
							Для Каждого СтрокаМассива Из МассивТК Цикл
								Если СтрокаМассива.ИД = Выборка.Родитель_ИД Тогда 
									СтрокаМассива.Строки.Добавить(ИмяТО);
									ТКНайдена = Истина;
									Прервать;
								КонецЕсли;
							КонецЦикла;
							Если Не ТКНайдена Тогда 
								МассивТО.Добавить(Новый Структура("ИД,Имя", Выборка.Родитель_ИД, ИмяТО));
							КонецЕсли;
						Иначе
							СтруктураТК = Новый Структура("ИД,Имя,Строки", Выборка.ИД, ИмяТО, Новый Массив());
							МассивТК.Добавить(СтруктураТК);
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				Для Каждого СтрокаМассива Из МассивТО Цикл
					Для Каждого СтрокаТК Из МассивТК Цикл
						Если СтрокаТК.ИД = СтрокаМассива.ИД Тогда 
							СтрокаТК.Строки.Добавить(СтрокаМассива.Имя);
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
				Для Каждого СтрокаТК ИЗ МассивТК Цикл
					МассивТекстаТК.Добавить(СтрокаТК.Имя);
					Для Каждого СтрокаМассива Из СтрокаТК.Строки Цикл
						МассивТекстаТК.Добавить(СтрокаМассива);
					КонецЦикла;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		#КонецОбласти
		Шапка.Параметры.ТКиТО = СтрСоединить(МассивТекстаТК, ", ");
		ТабДокумент.Вывести(Шапка);
		ТабДокумент.Вывести(СтрокаТЧ);
		#Область ОбходИсполнителей
		МассивТекстаИсполнителей = Новый Массив();
		ВыборкаИсполнители.Сбросить();
		Если ВыборкаИсполнители.НайтиСледующий(СтруктураПоискаДок) Тогда 
			ВыборкаИспИД = ВыборкаИсполнители.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Если ВыборкаИспИД.НайтиСледующий(СтруктураПоискаДок) Тогда 
				Выборка = ВыборкаИспИД.Выбрать();
				Пока Выборка.Следующий() Цикл
					МассивТекстаИсполнителей.Добавить(Выборка.Исполнитель);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;		
		#КонецОбласти
		Подвал.Параметры.Исполнители = СтрСоединить(МассивТекстаИсполнителей, ", ");
		ТабДокумент.Вывести(Подвал);
	КонецЦикла;
	
	ТабДокумент.АвтоМасштаб	= Истина;
	ТабДокумент.ПолеСверху  = 0;
	ТабДокумент.ПолеСлева   = 0;
	ТабДокумент.ПолеСнизу   = 0;
	ТабДокумент.ПолеСправа  = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабДокумент.ТолькоПросмотр = Истина;
	
	Возврат ТабДокумент;
КонецФункции // гкс- [Релиз18]


// гкс+ [11.22] Деснол 03.11.2022

Функция гкс_ПечатьЛимитки(МассивОбъектов, ПараметрыПечати)
	
	Макет  = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_ЗаявкаНаРемонт.ПФ_MXL_гкс_Лимитка");
	ТабДокумент = Новый ТабличныйДокумент;
	Шапка = Макет.ПолучитьОбласть("Шапка");
	СтрокаТЧ = Макет.ПолучитьОбласть("СтрокаТЧ");
	
	СдвигЧП = Час(ТекущаяДатаСеанса()) - Час(ТекущаяДата());
	
	ЗапросДокументов = Новый Запрос;
	ЗапросДокументов.Текст = 
	"ВЫБРАТЬ
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ОписаниеРемонта КАК ОписаниеРемонта,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ID КАК ИД,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка.Номер КАК НомерСметы,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка.Подразделение.Код КАК Подразделение
	|ИЗ
	|	Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК торо_ЗаявкаНаРемонтРемонтыОборудования
	|ГДЕ
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка В(&Ссылка)
	|	И торо_ЗаявкаНаРемонтРемонтыОборудования.ID В(&ID)";	
	
	ЗапросДокументов.УстановитьПараметр("Ссылка", МассивОбъектов);
	Если ПараметрыПечати.Свойство("МассивID") Тогда
		ЗапросДокументов.УстановитьПараметр("ID", ПараметрыПечати.МассивID);
	Иначе
		ЗапросДокументов.Текст = СтрЗаменить(ЗапросДокументов.Текст, 
		"И торо_ЗаявкаНаРемонтРемонтыОборудования.ID В(&ID)", "");
	КонецЕсли;
	
	ЭтоПервый = Истина;
	ИндексВыборкиСДокументами = 0;
	
	
	РезультатЗапроса = ЗапросДокументов.ВыполнитьПакет();
	ВыборкаДокументов = РезультатЗапроса[ИндексВыборкиСДокументами].Выбрать();
	Пока ВыборкаДокументов.Следующий() Цикл
		Если НЕ ЭтоПервый Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ЭтоПервый = Ложь;
		//
		ЗаполнитьЗначенияСвойств(Шапка.Параметры,ВыборкаДокументов);
		ТабДокумент.Вывести(Шапка);
		Для Сч = 1 По 25 Цикл
			ТабДокумент.Вывести(СтрокаТЧ);
		КонецЦикла;
	КонецЦикла;
	
	// Зададим параметры макета
	ТабДокумент.АвтоМасштаб	= Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабДокумент.ТолькоПросмотр = Истина;
	
	Возврат ТабДокумент;
	
	
КонецФункции // гкс- [11.22] Деснол 03.11.2022

// гкс+ [06.23] Деснол 16.06.2023
Функция гкс_ПолучитьПФТехЗадание(Ссылка) Экспорт
	МассивОбъектов = Новый Массив();
	МассивОбъектов.Добавить(Ссылка);
	ПараметрыПечати = Новый Структура();
	НовыйСиноним = "Техническое задание";
	ПараметрыПечати.Вставить("ВсеСпособы", Истина);
	//
	Возврат ПечатьНарядЗадание(МассивОбъектов, ПараметрыПечати, НовыйСиноним);
КонецФункции // гкс- [06.23] Деснол 16.06.2023

Процедура гкс_ДобавитьПФТехЗаданияВДО(ВнешнийОбъект, НеОбновлять = Ложь) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Док.Номер КАК Номер
		|ИЗ
		|	Документ.торо_ЗаявкаНаРемонт КАК Док
		|ГДЕ
		|	Док.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ВнешнийОбъект);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();	
	Выборка.Следующий();
	Имя = "Техническое задание " + Выборка.Номер;
	Файлы = ИнтеграцияС1СДокументооборотВызовСервера.ФайлыПоОбъектуПотребителю(
		ВнешнийОбъект.УникальныйИдентификатор(), Строка(ВнешнийОбъект), ВнешнийОбъект.Метаданные().ПолноеИмя());
	Идентификатор = "";
	Для каждого СведенияОФайле Из Файлы.files Цикл
		Если СведенияОФайле.name = Имя Тогда
			Идентификатор = СведенияОФайле.objectId.id;
			Если НеОбновлять Тогда 
				Возврат;
			КонецЕсли;
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	//
	УникальныйИдентификаторФормы = Неопределено;
	//
	ПолныйПуть = ПолучитьИмяВременногоФайла("pdf");
	ДопПараметры = Новый Структура();
	ДопПараметры.Вставить("Идентификатор", Идентификатор);
	ДопПараметры.Вставить("Имя", Имя);
	ДопПараметры.Вставить("Расширение", "pdf");
	ДопПараметры.Вставить("УникальныйИдентификаторФормы", УникальныйИдентификаторФормы);
	ДопПараметры.Вставить("ОписаниеОповещения", Неопределено);
	ДопПараметры.Вставить("ОсвободитьФайл", Ложь);
	ДопПараметры.Вставить("ОбновитьСведенияОРедактировании", Ложь);	
	//
	ТабДок = документы.торо_ЗаявкаНаРемонт.гкс_ПолучитьПФТехЗадание(ВнешнийОбъект);
	ТабДок.Записать(ПолныйПуть, ТипФайлаТабличногоДокумента.PDF);
	ДвоичныйФайл = Новый ДвоичныеДанные(ПолныйПуть);
	АдресВХ = ПоместитьВоВременноеХранилище(ДвоичныйФайл, УникальныйИдентификаторФормы);
	ДопПараметры.Вставить("АдресВХ", АдресВХ);
	ДопПараметры.Вставить("Размер", 100);
	ДопПараметры.Вставить("ВремяИзменения", ТекущаяДата());
	ДопПараметры.Вставить("ВремяИзмененияУниверсальное", ТекущаяДата());
	//	
	Если Идентификатор = "" Тогда 
		СоздатьНовыйДО(ВнешнийОбъект, ДопПараметры);
		//
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Печатная форма добавлена в файлы ДО";
		Сообщение.Сообщить();
	Иначе
		СведенияОРедактировании = ИнтеграцияС1СДокументооборотВызовСервера.
			ПолучитьСведенияОРедактированииФайла(ДопПараметры.Идентификатор, "DMFile");
		ДопПараметры.Вставить("СведенияОРедактировании", СведенияОРедактировании);
		ОбновитьПФНаСервереПосле(АдресВХ, ПолныйПуть, ДопПараметры);
		//
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Печатная форма обновлена в списке файлов ДО";
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

Процедура ОбновитьПФНаСервереПосле(Адрес, ПолныйПуть, Параметры)
	Параметры.Вставить("АдресВременногоХранилищаФайла", Адрес);
	СтруктураИмени = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ПолныйПуть, Ложь);
	
	Параметры.Вставить("Расширение", СтруктураИмени.Расширение);
	
	Файл = Новый Файл(ПолныйПуть);
	Параметры.Вставить("Размер", Файл.Размер());
	Параметры.Вставить("ДатаМодификации", Файл.ПолучитьВремяИзменения());
	Параметры.Вставить("ДатаМодификацииУниверсальная", Файл.ПолучитьУниверсальноеВремяИзменения());
	
	Параметры.Вставить("Текст", "");
	
	// Удалим параметры, которые передавать на сервер нельзя и не нужно.
	ОписаниеОповещения = Параметры.ОписаниеОповещения;
	Параметры.Удалить("ОписаниеОповещения");
	
	Если ИнтеграцияС1СДокументооборотВызовСервера.
		ОбновитьФайлДвоичнымиДаннымиВременногоХранилища(Параметры) Тогда
	КонецЕсли;
КонецПроцедуры

Процедура СоздатьНовыйДО(ВнешнийОбъект, ПараметрыСоздания)
	Прокси = ИнтеграцияС1СДокументооборотПовтИсп.ПолучитьПрокси();
	
	Запрос = ИнтеграцияС1СДокументооборот.СоздатьОбъект(Прокси, "DMAddLinkedFileRequest");
	
	Запрос.rootFolderID = ПолучитьИдентификаторКорневойПапкиФайлов1СДокументооборот();
	
	Запрос.file = ИнтеграцияС1СДокументооборот.СоздатьОбъект(Прокси, "DMFile");
	
	Запрос.file.externalObject = ИнтеграцияС1СДокументооборот.СоздатьОбъект(Прокси, "ExternalObject");
	Запрос.file.externalObject.name = Строка(ВнешнийОбъект);
	Запрос.file.externalObject.id = Строка(ВнешнийОбъект.УникальныйИдентификатор());
	Запрос.file.externalObject.type = ВнешнийОбъект.Метаданные().ПолноеИмя();
	
	Запрос.file.objectId = ИнтеграцияС1СДокументооборот.СоздатьObjectID(Прокси, "", "DMFile");
	Запрос.file.binaryData = ПолучитьИзВременногоХранилища(ПараметрыСоздания.АдресВХ);
	Запрос.file.extension = ПараметрыСоздания.Расширение;
	Запрос.file.modificationDate = ПараметрыСоздания.ВремяИзменения;
	Запрос.file.modificationDateUniversal = ПараметрыСоздания.ВремяИзмененияУниверсальное;
	Запрос.file.name = ПараметрыСоздания.Имя;
	Запрос.file.size = ПараметрыСоздания.Размер;
	
	МаксРазмерФайла = ИнтеграцияС1СДокументооборотВызовСервера.МаксимальныйРазмерПередаваемогоФайла();
	Если ПараметрыСоздания.Размер > МаксРазмерФайла Тогда
		РазмерВМб = ПараметрыСоздания.Размер / (1024 * 1024);
		РазмерВМбМакс = МаксРазмерФайла / (1024 * 1024);
		ВызватьИсключение
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("es='La dimensión del fichero ""%1"" (%2 Mb) supera máximamente admisible (%3 Mb).';ru='Размер файла ""%1"" (%2 Мб) превышает максимально допустимый (%3 Мб).';en='File size ""%1"" (%2 Mb) exceeds the maximum allowed (%3 Mb).'"),
			ПараметрыСоздания.Имя, 
			РаботаСФайламиСлужебныйКлиентСервер.ПолучитьСтрокуСРазмеромФайла(РазмерВМб),
			РаботаСФайламиСлужебныйКлиентСервер.ПолучитьСтрокуСРазмеромФайла(РазмерВМбМакс));
	КонецЕсли;
		
	Ответ = Прокси.execute(Запрос);
	ИнтеграцияС1СДокументооборот.ПроверитьВозвратВебСервиса(Прокси, Ответ);
	
	//Ответ.file.objectId.id;
КонецПроцедуры

Функция ПолучитьИдентификаторКорневойПапкиФайлов1СДокументооборот() 
	
	УстановитьПривилегированныйРежим(Истина);
	ИдентификаторКорневойПапкиФайлов1СДокументооборот = 
		Константы.ИдентификаторКорневойПапкиФайлов1СДокументооборот.Получить();
	Возврат ИдентификаторКорневойПапкиФайлов1СДокументооборот;
	
КонецФункции

#КонецОбласти