#Область ОбработчикиСобытий

&ИзменениеИКонтроль("ОбработкаПроверкиЗаполнения")
Процедура Расш_гкс_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	СписокТЧ = Новый Структура();
	СписокТЧ.Вставить("РемонтыОборудования", "Ремонты оборудования");
	СписокТЧ.Вставить("РемонтныеРаботы", "Ремонтные работы");

	#Удаление
	ШаблонСообщения = НСтр("ru = 'В табличной части ""%1"" нет строк.'");
	#КонецУдаления
	#Вставка
	ШаблонСообщения = НСтр("es='En la parte tabular ""%1"" no hay líneas.';
		|ru='В табличной части ""%1"" нет строк.';en='There are no rows in the table part ""%1"".'");
	#КонецВставки

	Для каждого текТЧ из СписокТЧ Цикл
		Если ЭтотОбъект[ТекТЧ.Ключ].Количество() = 0 Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекТЧ.Значение);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЕсли;
	КонецЦикла;

	Если Отказ тогда
		Возврат;
	КонецЕсли;

	// Проверить заполнение ТЧ
	ПроверитьЗаполнениеТабличнойЧастиРемонтыОборудования(Отказ);
	ПроверитьЗаполнениеТабличнойЧастиРемонтныеРаботы(Отказ);
	ПроверитьЗаполнениеТабличнойЧастиМатериальныеЗатраты(Отказ);
	ПроверитьЗаполнениеТабличнойЧастиИнструментыИТехника(Отказ);
	ПроверитьЗаполнениеТабличнойЧастиЗапчасти(Отказ);
	ПроверитьЗаполнениеТабличнойЧастиДокументыОснования(Отказ);
	ПроверитьЗаполнениеТабличнойЧастиТрудовыеЗатраты(Отказ);

	ФОИспользоватьХарактеристикиНоменклатуры = ПолучитьФункциональнуюОпцию("торо_ИспользоватьХарактеристикиНоменклатуры");
	МассивНепроверяемыхРеквизитов = Новый Массив;
	МассивНепроверяемыхРеквизитов.Добавить("МатериальныеЗатраты.ХарактеристикаНоменклатуры");
	Если ФОИспользоватьХарактеристикиНоменклатуры = Истина Тогда
		ПараметрыПроверки = Новый Структура("СуффиксХарактеристики, ИмяТЧ", "Номенклатуры", "МатериальныеЗатраты");
		НоменклатураСервер.ПроверитьЗаполнениеХарактеристик(ЭтотОбъект,МассивНепроверяемыхРеквизитов,Отказ, ПараметрыПроверки);
	КонецЕсли;

	Если Не Отказ И ОбщегоНазначенияУТ.ПроверитьЗаполнениеРеквизитовОбъекта(ЭтотОбъект, ПроверяемыеРеквизиты) Тогда
		Отказ = Истина;
	КонецЕсли;

	ПроверитьДублиИсполнителей(Отказ);

КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура Расш_гкс_ОбработкаПроведения(Отказ, РежимПроведения)

	МассивДокументовОснований = ОбщегоНазначения.ВыгрузитьКолонку(ДокументыОснования, "ДокументОснование");

	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ВнешнееОснованиеДляРабот.Ссылка КАК Ссылка,
	|	торо_ВнешнееОснованиеДляРабот.Проведен КАК Проведен
	|ИЗ
	|	Документ.торо_ВнешнееОснованиеДляРабот КАК торо_ВнешнееОснованиеДляРабот
	|ГДЕ
	|	торо_ВнешнееОснованиеДляРабот.Ссылка В(&МассивДокОсн)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ВыявленныеДефекты.Ссылка,
	|	торо_ВыявленныеДефекты.Проведен
	|ИЗ
	|	Документ.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефекты
	|ГДЕ
	|	торо_ВыявленныеДефекты.Ссылка В(&МассивДокОсн)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ПланГрафикРемонта.Ссылка,
	|	торо_ПланГрафикРемонта.Проведен
	|ИЗ
	|	Документ.торо_ПланГрафикРемонта КАК торо_ПланГрафикРемонта
	|ГДЕ
	|	торо_ПланГрафикРемонта.Ссылка В(&МассивДокОсн)");

	Запрос.УстановитьПараметр("МассивДокОсн", МассивДокументовОснований); 	
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		Если Не Выборка.Проведен Тогда
			ТекстСообщения = НСтр("ru = 'Есть непроведенный документ основание: " + Строка(Выборка.Ссылка) + "'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			Возврат;
		КонецЕсли;		
	КонецЦикла;

	#Удаление
	ШаблонСообщения = НСтр("ru = 'Для объекта ремонта ""%1"" с видом ремонта ""%2"" отсутствуют строки в дереве ремонтных работ.'");
	#КонецУдаления
	#Вставка
	ШаблонСообщения = НСтр("es='Para el objeto de la reparación ""%1"" con el tipo de la reparación ""%2"" "
	+ "faltan las líneas en el árbol de los trabajos de reparación.';ru='Для объекта ремонта ""%1"" с видом "
	+ "ремонта ""%2"" отсутствуют строки в дереве ремонтных "
	+ "работ.';en='For repair object ""%1"" with repair type ""%2"", there are no lines in the repair tree.'");
	#КонецВставки

	Для Каждого СтрокаСРемонтом Из РемонтыОборудования Цикл
		МассивСтрок = РемонтныеРаботы.НайтиСтроки(Новый структура("РемонтыОборудования_ID", СтрокаСРемонтом.ID));
		Если МассивСтрок.Количество() = 0 Тогда			
			ТекстСообщения = СтрШаблон(ШаблонСообщения, СтрокаСРемонтом.ОбъектРемонта, СтрокаСРемонтом.ВидРемонтныхРабот);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Возврат;			
		КонецЕсли;
	КонецЦикла;	

	Если ДокументыОснования.Количество()>0 Тогда
		ПроверитьДатуДокумента(Отказ);
	КонецЕсли;

	Если Не Отказ Тогда

		УстановитьУправляемыеБлокировки();
		ДвиженияПоРегистрам(РежимПроведения, Отказ);

	КонецЕсли;

	торо_РаботаСоСтатусамиДокументовСервер.УстановитьСтатусРемонтовПриПроведенииЗаявки(ЭтотОбъект);
	торо_РаботаСоСтатусамиДокументовСервер.УстановитьСтатусДокумента(Ссылка, Ссылка, Движения, Перечисления.торо_СтатусыДокументов.Зарегистрирован);
	торо_РаботаСоСтатусамиДокументовСервер.ИзменитьСтатусыДокументовОснований(Ссылка);

КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаЗаполнения")
Процедура Расш_гкс_ОбработкаЗаполнения(Основание)
	
	торо_ЗаполнениеДокументов20.ЗаполнениеНаОсновании(Основание, ЭтотОбъект, Ложь);
	#Вставка
	// гкс+ [8220] Тарасов 19.10.2020
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.торо_ВыявленныеДефекты") Тогда
		ЭтотОбъект.гкс_СрочностьВоздействия = Основание.гкс_СрочностьВоздействия;
	КонецЕсли;
	// гкс- [8220] Тарасов 19.10.2020
	#КонецВставки
	
КонецПроцедуры

// гкс+ [разработка 2021] Куст 06.05.2021
&ИзменениеИКонтроль("ПередЗаписью")
Процедура гкс_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И Не ЭтоНовый() Тогда
		// Сохраняем информацию по статусу
		ТекДанныеСтатусов = торо_РаботаСоСтатусамиДокументовСервер.ТекДанныеСтатусовРемонтовЗаявки(Ссылка);
		Если Не ТекДанныеСтатусов.Свойство("Ошибка") Тогда
			ДополнительныеСвойства.Вставить("ТекДанныеСтатусов", ТекДанныеСтатусов);
		КонецЕсли;

	КонецЕсли;

	#Вставка
	// гкс+ [разработка 2021] Куст 06.05.2021
	Если Не БезусловнаяЗапись = Истина И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		гкс_ПроверитьДубльРемонта(Отказ);
		Если Отказ Тогда 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	// гкс- [разработка 2021] Куст 06.05.2021
	Если ОбменДанными.Загрузка = Ложь Тогда 
		// гкс+ [10.23] Деснол 05.04.2024
		Если Не БезусловнаяЗапись = Истина И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
			Для Каждого СТ Из РемонтыОборудования Цикл
				Если Не ЗначениеЗаполнено(СТ.ОписаниеРемонта) Тогда 
					Отказ = Истина;
					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = "Не заполнено описание ремонта";
					Сообщение.Сообщить();
					Возврат;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		// гкс- [10.23] Деснол 05.04.2024
		Для Каждого СтрокаТаблицыРемонтовОборудования Из РемонтыОборудования Цикл
			Если ЗначениеЗаполнено(СтрокаТаблицыРемонтовОборудования.гкс_ИмяТехКартыРемонта) = Ложь 
					И ЗначениеЗаполнено(СтрокаТаблицыРемонтовОборудования.ДатаНачала) Тогда 
				СтрокаТаблицыРемонтовОборудования.гкс_ИмяТехКартыРемонта = 
					ПолучитьИмяТехКартыРемонта(СтрокаТаблицыРемонтовОборудования.ID);
			КонецЕсли;
		КонецЦикла;
		//
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
			Если гкс_НуженОстанов = "" ИЛИ гкс_НуженИспытание = "" ИЛИ гкс_НуженПодготовка = "" ИЛИ гкс_РаботаПовышеннойОпасности = "" Тогда 
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = НСтр("ru='Обязательные поля не заполнены!'");
				Сообщение.Сообщить();
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЕсли;
		//
		// гкс+ [05.23] Деснол 10.05.2023
		Если Не РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда 
			Если Не БезусловнаяЗапись = Истина Тогда 
				МассивПустых = Новый Массив();
				Для Каждого СТ Из РемонтыОборудования Цикл
					Если Не ЗначениеЗаполнено(СТ.КритичностьДефекта) Тогда 
						МассивПустых.Добавить(СТ.ID);
					КонецЕсли;
				КонецЦикла;
				Запрос = Новый Запрос();
				Запрос.Текст = "ВЫБРАТЬ
				               |	Дефекты.ID КАК ID
				               |ИЗ
				               |	РегистрСведений.торо_ВыявленныеДефекты.СрезПоследних(, ID В (&ТЧ1)) КАК Дефекты";
				Запрос.УстановитьПараметр("ТЧ1", МассивПустых);
				РезультатЗапроса = Запрос.Выполнить();
				Если Не РезультатЗапроса.Пустой() Тогда 
					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = НСтр("ru='Критичность дефекта не заполнена!'");
					Сообщение.Сообщить();
					Отказ = Истина;
					Возврат;
				КонецЕсли
			КонецЕсли;
		КонецЕсли;
		// гкс- [05.23] Деснол 10.05.2023
	КонецЕсли;
	// гкс+ [8589] Куст 29.10.2020
	МассивОписаний = Новый Массив();
	Для Каждого СТ Из РемонтыОборудования Цикл
		Если ЗначениеЗаполнено(СТ.ОписаниеРемонта) Тогда 
			МассивОписаний.Добавить(СТ.ОписаниеРемонта);
		КонецЕсли;
	КонецЦикла;
	гкс_ОбщееОписаниеРемонта = СтрСоединить(МассивОписаний, ", ");
	// гкс- [8589] Куст 29.10.2020
	// гкс+ [разработка 2021] Куст 27.04.2021
	Если ЗначениеЗаполнено(гкс_НуженИспытание) = Ложь Тогда 
		гкс_НуженИспытание = "ДА";
	КонецЕсли;
	// гкс- [разработка 2021] Куст 27.04.2021
	// гкс+ [Релиз18] Деснол
	МассивТекста = Новый Массив();
	Для Каждого СтрокаТаблицы Из ИсполнителиПоРемонтам Цикл
		Если ЗначениеЗаполнено(СтрокаТаблицы.Исполнитель) 
			И МассивТекста.Найти(СтрокаТаблицы.Исполнитель) = Неопределено Тогда 
			МассивТекста.Добавить(СтрокаТаблицы.Исполнитель);
		КонецЕсли;
	КонецЦикла;
	гкс_ИсполнительСтрокой = СтрСоединить(МассивТекста, ", ");
	// гкс- [Релиз18]
	// гкс+ [05.23] Деснол 05.05.2023
	МассивТекста2 = Новый Массив();
	Для Каждого СтрокаТаблицы Из РемонтыОборудования Цикл
		Если ЗначениеЗаполнено(СтрокаТаблицы.ОбъектРемонта) 
			И МассивТекста2.Найти(СтрокаТаблицы.ОбъектРемонта) = Неопределено Тогда 
			МассивТекста2.Добавить(СтрокаТаблицы.ОбъектРемонта);
		КонецЕсли;
	КонецЦикла;
	гкс_ОРСтрокой = СтрСоединить(МассивТекста2, ", ");
	// гкс- [05.23] Деснол 05.05.2023
	
	// гкс+ [06.23] Деснол 16.06.2023
	#Область ПроверкаИзменения
	Если ПроверитьИзменениеДляПФ() Тогда 
		ДополнительныеСвойства.Вставить("ЕстьИзмененийРеквизитовТЗ", Истина);
	КонецЕсли;
	#КонецОбласти
	// гкс- [06.23] Деснол 16.06.2023
	#КонецВставки
КонецПроцедуры
// гкс- [разработка 2021] Куст 06.05.2021

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// гкс+ [разработка 2021] Куст 07.05.2021
&ИзменениеИКонтроль("СформироватьТаблицуТрудовыхЗатрат")
Функция гкс_СформироватьТаблицуТрудовыхЗатрат(МенеджерВТ)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТаблицаТрудовыхЗатрат.ID,
	|	ТаблицаТрудовыхЗатрат.Квалификация,
	|	ТаблицаТрудовыхЗатрат.Количество,
	|	ТаблицаТрудовыхЗатрат.ВремяРаботы,
	|	ТаблицаТрудовыхЗатрат.РемонтыОборудования_ID
	|ПОМЕСТИТЬ ТаблицаТрудЗатрат
	|ИЗ
	|	Документ.торо_ЗаявкаНаРемонт.ТрудовыеЗатраты КАК ТаблицаТрудовыхЗатрат
	|ГДЕ
	|	ТаблицаТрудовыхЗатрат.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТаблицаТрудовыхЗатрат.ID,
	|	ТаблицаТрудовыхЗатрат.РемонтыОборудования_ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРемРабот.ДатаНачала КАК ДатаНач,
	|	КурсыВалют.Период,
	|	КурсыВалют.Кратность,
	|	КурсыВалют.Курс,
	|	КурсыВалют.Валюта
	|ПОМЕСТИТЬ ТабДатВалют
	|ИЗ
	|	ТаблицаРемРабот КАК ТаблицаРемРабот
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|		ПО (КурсыВалют.Период <= ТаблицаРемРабот.ДатаНачала)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КурсыВалют.Валюта,
	|	ДатаНач,
	|	КурсыВалют.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабДатВалют.ДатаНач,
	|	ТабДатВалют.Валюта,
	|	МАКСИМУМ(ТабДатВалют.Период) КАК Период
	|ПОМЕСТИТЬ ТабМаксДатВалют
	|ИЗ
	|	ТабДатВалют КАК ТабДатВалют
	|
	|СГРУППИРОВАТЬ ПО
	|	ТабДатВалют.ДатаНач,
	|	ТабДатВалют.Валюта
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТабДатВалют.Валюта,
	|	ТабДатВалют.ДатаНач,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТабДатВалют.ДатаНач,
	|	ТабДатВалют.Курс,
	|	ТабДатВалют.Кратность,
	|	ТабДатВалют.Валюта,
	|	ТабДатВалют.Период
	|ПОМЕСТИТЬ ТабКурсовВалют
	|ИЗ
	|	ТабДатВалют КАК ТабДатВалют
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабМаксДатВалют КАК ТабМаксДатВалют
	|		ПО ТабДатВалют.Валюта = ТабМаксДатВалют.Валюта
	|			И ТабДатВалют.ДатаНач = ТабМаксДатВалют.ДатаНач
	|			И ТабДатВалют.Период = ТабМаксДатВалют.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТабДатВалют.Валюта,
	|	ТабДатВалют.ДатаНач
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРемРабот.ДатаНачала КАК ДатаНач,
	|	Квалификации.Период,
	|	Квалификации.Стоимость,
	|	Квалификации.Валюта,
	|	Квалификации.Квалификация
	|ПОМЕСТИТЬ ТабДатКвалификаций
	|ИЗ
	|	ТаблицаРемРабот КАК ТаблицаРемРабот
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_СтоимостьЧасаКвалификации КАК Квалификации
	|		ПО (Квалификации.Период <= ТаблицаРемРабот.ДатаНачала)
	#Вставка
	|	И Квалификации.Организация = &Организация
	#КонецВставки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Квалификации.Квалификация,
	|	ДатаНач,
	|	Квалификации.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабДатКвалификаций.ДатаНач,
	|	ТабДатКвалификаций.Квалификация,
	|	МАКСИМУМ(ТабДатКвалификаций.Период) КАК Период
	|ПОМЕСТИТЬ ТабМаксДатКвалификаций
	|ИЗ
	|	ТабДатКвалификаций КАК ТабДатКвалификаций
	|
	|СГРУППИРОВАТЬ ПО
	|	ТабДатКвалификаций.ДатаНач,
	|	ТабДатКвалификаций.Квалификация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТабДатКвалификаций.Квалификация,
	|	ТабДатКвалификаций.ДатаНач,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТабДатКвалификаций.ДатаНач,
	|	ТабДатКвалификаций.Валюта,
	|	ТабДатКвалификаций.Стоимость,
	|	ТабДатКвалификаций.Квалификация
	|ПОМЕСТИТЬ ТабСтоимостейКвалификаций
	|ИЗ
	|	ТабДатКвалификаций КАК ТабДатКвалификаций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабМаксДатКвалификаций КАК ТабМаксДатКвалификаций
	|		ПО ТабДатКвалификаций.Квалификация = ТабМаксДатКвалификаций.Квалификация
	|			И ТабДатКвалификаций.ДатаНач = ТабМаксДатКвалификаций.ДатаНач
	|			И ТабДатКвалификаций.Период = ТабМаксДатКвалификаций.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТабДатКвалификаций.Валюта,
	|	ТабДатКвалификаций.ДатаНач
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабСтоимостейКвалификаций.ДатаНач,
	|	ТабСтоимостейКвалификаций.Валюта,
	|	ТабСтоимостейКвалификаций.Стоимость,
	|	ТабСтоимостейКвалификаций.Квалификация,
	|	ЕСТЬNULL(ТабКурсовВалют.Курс, 0) КАК Курс,
	|	ЕСТЬNULL(ТабКурсовВалют.Кратность, 1) КАК Кратность
	|ПОМЕСТИТЬ ТабСтоимостейКвалификацийИКурсов
	|ИЗ
	|	ТабСтоимостейКвалификаций КАК ТабСтоимостейКвалификаций
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабКурсовВалют КАК ТабКурсовВалют
	|		ПО ТабСтоимостейКвалификаций.Валюта = ТабКурсовВалют.Валюта
	|			И ТабСтоимостейКвалификаций.ДатаНач = ТабКурсовВалют.ДатаНач
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТабСтоимостейКвалификаций.Квалификация,
	|	ТабСтоимостейКвалификаций.ДатаНач
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ЗаявкаНаРемонтРемонтныеРаботы.ID,
	|	торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтнаяРабота,
	|	торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтыОборудования_ID,
	|	торо_ЗаявкаНаРемонтРемонтныеРаботы.ОбъектРемонта,
	|	торо_ЗаявкаНаРемонтРемонтныеРаботы.ВидРемонтныхРабот,
	|	торо_ЗаявкаНаРемонтРемонтныеРаботы.ДатаНачала,
	|	торо_ЗаявкаНаРемонтРемонтныеРаботы.ДатаОкончания,
	|	торо_ЗаявкаНаРемонтРемонтныеРаботы.ДокументОснование,
	|	торо_ЗаявкаНаРемонтРемонтныеРаботы.Родитель_ID,
	|	торо_ЗаявкаНаРемонтТрудовыеЗатраты.Количество,
	|	торо_ЗаявкаНаРемонтТрудовыеЗатраты.Квалификация,
	|	торо_ЗаявкаНаРемонтТрудовыеЗатраты.ВремяРаботы
	|ПОМЕСТИТЬ торо_ЗаявкаНаРемонт
	|ИЗ
	|	ТаблицаТрудЗатрат КАК торо_ЗаявкаНаРемонтТрудовыеЗатраты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаРемРабот КАК торо_ЗаявкаНаРемонтРемонтныеРаботы
	|		ПО торо_ЗаявкаНаРемонтТрудовыеЗатраты.ID = торо_ЗаявкаНаРемонтРемонтныеРаботы.ID
	|			И торо_ЗаявкаНаРемонтТрудовыеЗатраты.РемонтыОборудования_ID = торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтыОборудования_ID
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	торо_ЗаявкаНаРемонтТрудовыеЗатраты.Квалификация,
	|	торо_ЗаявкаНаРемонтРемонтныеРаботы.ДатаНачала
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ЗаявкаНаРемонт.Квалификация,
	|	торо_ЗаявкаНаРемонт.ID,
	|	торо_ЗаявкаНаРемонт.РемонтнаяРабота,
	|	торо_ЗаявкаНаРемонт.РемонтыОборудования_ID,
	|	торо_ЗаявкаНаРемонт.ОбъектРемонта,
	|	торо_ЗаявкаНаРемонт.ВидРемонтныхРабот,
	|	торо_ЗаявкаНаРемонт.ДатаНачала,
	|	торо_ЗаявкаНаРемонт.ДатаОкончания,
	|	торо_ЗаявкаНаРемонт.ДокументОснование,
	|	торо_ЗаявкаНаРемонт.Родитель_ID,
	|	торо_ЗаявкаНаРемонт.ВремяРаботы,
	|	СУММА(ЕСТЬNULL(ТабСтоимостейКвалификацийИКурсов.Стоимость, 0) * ЕСТЬNULL(ТабСтоимостейКвалификацийИКурсов.Курс, 0) / ЕСТЬNULL(ТабСтоимостейКвалификацийИКурсов.Кратность, 1) * торо_ЗаявкаНаРемонт.ВремяРаботы / 3600 * торо_ЗаявкаНаРемонт.Количество) КАК Сумма,
	|	СУММА(торо_ЗаявкаНаРемонт.Количество) КАК Количество
	|ИЗ
	|	торо_ЗаявкаНаРемонт КАК торо_ЗаявкаНаРемонт
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабСтоимостейКвалификацийИКурсов КАК ТабСтоимостейКвалификацийИКурсов
	|		ПО торо_ЗаявкаНаРемонт.Квалификация = ТабСтоимостейКвалификацийИКурсов.Квалификация
	|			И торо_ЗаявкаНаРемонт.ДатаНачала = ТабСтоимостейКвалификацийИКурсов.ДатаНач
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_ЗаявкаНаРемонт.Квалификация,
	|	торо_ЗаявкаНаРемонт.ID,
	|	торо_ЗаявкаНаРемонт.РемонтнаяРабота,
	|	торо_ЗаявкаНаРемонт.РемонтыОборудования_ID,
	|	торо_ЗаявкаНаРемонт.ОбъектРемонта,
	|	торо_ЗаявкаНаРемонт.ВидРемонтныхРабот,
	|	торо_ЗаявкаНаРемонт.ДатаНачала,
	|	торо_ЗаявкаНаРемонт.ДатаОкончания,
	|	торо_ЗаявкаНаРемонт.ДокументОснование,
	|	торо_ЗаявкаНаРемонт.Родитель_ID,
	|	торо_ЗаявкаНаРемонт.ВремяРаботы
	|;
	|
	|УНИЧТОЖИТЬ торо_ЗаявкаНаРемонт
	|;
	|
	|УНИЧТОЖИТЬ ТабСтоимостейКвалификацийИКурсов
	|;
	|
	|УНИЧТОЖИТЬ ТабСтоимостейКвалификаций
	|;
	|
	|УНИЧТОЖИТЬ ТабМаксДатКвалификаций
	|;
	|
	|УНИЧТОЖИТЬ ТаблицаТрудЗатрат
	|;
	|
	|УНИЧТОЖИТЬ ТабДатВалют
	|;
	|
	|УНИЧТОЖИТЬ ТабМаксДатВалют
	|;
	|
	|УНИЧТОЖИТЬ ТабКурсовВалют
	|;
	|
	|УНИЧТОЖИТЬ ТабДатКвалификаций
	|;";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	#Вставка
	Запрос.УстановитьПараметр("Организация", Организация);
	#КонецВставки

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции
// гкс- [разработка 2021] Куст 07.05.2021

// гкс+ [разработка 2021] Куст 06.05.2021
Процедура гкс_ПроверитьДубльРемонта(Отказ)
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЧ.ID КАК ID
	               |ПОМЕСТИТЬ Исходные
	               |ИЗ
	               |	&ТЧ1 КАК ТЧ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Рег.Регистратор КАК Ссылка
	               |ИЗ
	               |	РегистрСведений.торо_ЗаявкиПоРемонтам.СрезПоследних(
	               |			,
	               |			IDРемонта В
	               |					(ВЫБРАТЬ
	               |						ТЧ.ID
	               |					ИЗ
	               |						Исходные КАК ТЧ)
	               |				И НЕ Регистратор = &Ссылка
	               |				И Регистратор ССЫЛКА Документ.торо_ЗаявкаНаРемонт) КАК Рег";
	Запрос.УстановитьПараметр("ТЧ1", РемонтыОборудования.Выгрузить());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() = Ложь Тогда 
		Отказ = Истина;
		МассивСсылок = Новый Массив();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивСсылок.Добавить(Строка(Выборка.Ссылка));
		КонецЦикла;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='По ремонту уже есть проведенные заявки: ';en='there are already orders for repairs'")
			+ СтрСоединить(МассивСсылок, ", ");
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры
// гкс- [разработка 2021] Куст 06.05.2021

// гкс+ [Релиз 1] Куст 17.03.2020
Функция ПолучитьИмяТехКартыРемонта(ИД)
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = новый МенеджерВременныхТаблиц();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
		|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ВидРемонтныхРабот КАК ВидРемонтныхРабот
		|ПОМЕСТИТЬ ПлановыйРемонт
		|ИЗ
		|	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(, ID = &ИД) КАК торо_ПлановыеРемонтныеРаботыСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПлановыйРемонт.ВидРемонтныхРабот КАК ВидРемонтныхРабот
		|ИЗ
		|	ПлановыйРемонт КАК ПлановыйРемонт
		|";
	Запрос.УстановитьПараметр("ИД", ИД);
	РезультатЗапроса = Запрос.Выполнить();	
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат "-";
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_НормативныеРемонтыОборудования.НормативныйРемонт КАК НормативныйРемонт,
	               |	торо_НормативныеРемонтыОборудования.Приоритет КАК Приоритет
	               |ПОМЕСТИТЬ СПриоритетами
	               |ИЗ
	               |	ПлановыйРемонт КАК ПлановыйРемонт
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_НормативныеРемонтыОборудования КАК торо_НормативныеРемонтыОборудования
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_НормативныеРемонтыОборудованияУдаленные КАК торо_НормативныеРемонтыОборудованияУдаленные
	               |			ПО торо_НормативныеРемонтыОборудования.ОбъектРемонта = торо_НормативныеРемонтыОборудованияУдаленные.ОбъектРемонта
	               |				И торо_НормативныеРемонтыОборудования.ВидРемонта = торо_НормативныеРемонтыОборудованияУдаленные.ВидРемонта
	               |				И торо_НормативныеРемонтыОборудования.ТиповойОР = торо_НормативныеРемонтыОборудованияУдаленные.ТиповойОР
	               |		ПО ПлановыйРемонт.ОбъектРемонтныхРабот = торо_НормативныеРемонтыОборудования.ОбъектРемонта
	               |			И ПлановыйРемонт.ВидРемонтныхРабот = торо_НормативныеРемонтыОборудования.ВидРемонта
	               |ГДЕ
	               |	торо_НормативныеРемонтыОборудованияУдаленные.ОбъектРемонта ЕСТЬ NULL
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(СПриоритетами.Приоритет) КАК Приоритет
	               |ПОМЕСТИТЬ ТолькоПриоритет
	               |ИЗ
	               |	СПриоритетами КАК СПриоритетами
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СПриоритетами.НормативныйРемонт.Наименование КАК Наименование
	               |ИЗ
	               |	СПриоритетами КАК СПриоритетами
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТолькоПриоритет КАК ТолькоПриоритет
	               |		ПО СПриоритетами.Приоритет = ТолькоПриоритет.Приоритет";
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Наименование;
	КонецЕсли;
	
КонецФункции
// гкс- [Релиз 1] Куст 17.03.2020

&После("ПриЗаписи")
Процедура гкс_ПриЗаписи(Отказ)
	// гкс+ [10.23] Деснол 28.02.2024
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	// гкс- [10.23] Деснол 28.02.2024
	// гкс+ [06.23] Деснол 16.06.2023
	Если ДополнительныеСвойства.Свойство("ЕстьИзмененийРеквизитовТЗ") 
		И ДополнительныеСвойства.ЕстьИзмененийРеквизитовТЗ Тогда 
		ВыбранныйСтатус = Неопределено;
		НаборЗаписей = РегистрыСведений.торо_ТекущиеСтатусыСогласованияДокументов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.СогласуемыйДокумент.Установить(Ссылка);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() Тогда 
			ВыбранныйСтатус = НаборЗаписей[0].СтатусДокумента;
		КонецЕсли;
		Если Не ВыбранныйСтатус = Неопределено Тогда 
			НужноДобавитьПФвДО = Ложь;
			Настройка = Справочники.гкс_ПроизвольныеНастройкиИнтеграций.СтатусыЗаявокКВыгрузке;
			МассивСвойств = Справочники.гкс_ПроизвольныеНастройкиИнтеграций.ПолучитьСвойства(Настройка, "Свойства");
			Для каждого Свойство Из МассивСвойств Цикл
				Если Свойство.Значение = ВыбранныйСтатус Тогда 
					НужноДобавитьПФвДО = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если НужноДобавитьПФвДО Тогда 
				Попытка
					Документы.торо_ЗаявкаНаРемонт.гкс_ДобавитьПФТехЗаданияВДО(Ссылка);
				Исключение
					ОписаниеОшибки = ОписаниеОшибки();
					ЗаписьЖурналаРегистрации(НСтр("es='La excepción';ru='Исключение';en='An exception'"), УровеньЖурналаРегистрации.Предупреждение,, ОписаниеОшибки);
					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = ОписаниеОшибки;
					Сообщение.Сообщить();
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	// гкс- [06.23] Деснол 16.06.2023
	// гкс+ [10.23] Деснол 28.02.2024
	Если гкс_РаботыТСПожаротушения = "Да" И Не Отказ И Проведен И Не БезусловнаяЗапись = Истина Тогда 
		// При проведении отправлять уведомление. когда останавливать неизвестно
		СобытиеСсылка = Константы.гкс_СобытиеПроведенияСметыПожаротушения.Получить();
		Если ЗначениеЗаполнено(СобытиеСсылка) Тогда 
			МассивСвойств = Новый Массив();
			МассивСвойств.Добавить(Новый Структура("Ключ,Значение", "НавСсылка", ПолучитьНавигационнуюСсылку(Ссылка)));
			торо_РаботаСУведомлениями.гкс_ЗаписатьУведомленияСрокаСогласования(Ссылка, СобытиеСсылка, Новый Массив(), , МассивСвойств);
		КонецЕсли;
	КонецЕсли;
	// гкс- [10.23] Деснол 28.02.2024
КонецПроцедуры

// гкс+ [06.23] Деснол 16.06.2023
Функция ПроверитьИзменениеДляПФ()
	Если Не Ссылка.РемонтныеРаботы.Количество() = РемонтныеРаботы.Количество() Тогда 
		Возврат Истина;
	Иначе
		Для Сч = 0 По РемонтныеРаботы.Количество() - 1 Цикл
			Строка1 = РемонтныеРаботы[Сч];
			Строка2 = Ссылка.РемонтныеРаботы[Сч];
			Если Не (Строка1.РемонтнаяРабота = Строка2.РемонтнаяРабота
				И Строка1.Количество = Строка2.Количество) Тогда 
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если Не Ссылка.МатериальныеЗатраты.Количество() = МатериальныеЗатраты.Количество() Тогда 
		Возврат Истина;
	Иначе
		Для Сч = 0 По МатериальныеЗатраты.Количество() - 1 Цикл
			Строка1 = МатериальныеЗатраты[Сч];
			Строка2 = Ссылка.МатериальныеЗатраты[Сч];
			Если Не (Строка1.Номенклатура = Строка2.Номенклатура
				И Строка1.Количество = Строка2.Количество
				И Строка1.гкс_Давальческие = Строка2.гкс_Давальческие) Тогда 
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если Не Ссылка.Инструменты.Количество() = Инструменты.Количество() Тогда 
		Возврат Истина;
	Иначе
		Для Сч = 0 По Инструменты.Количество() - 1 Цикл
			Строка1 = Инструменты[Сч];
			Строка2 = Ссылка.Инструменты[Сч];
			Если Не (Строка1.Инструмент = Строка2.Инструмент
				И Строка1.Количество = Строка2.Количество) Тогда 
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если Не Ссылка.ИсполнителиПоРемонтам.Количество() = ИсполнителиПоРемонтам.Количество() Тогда 
		Возврат Истина;
	Иначе
		Для Сч = 0 По ИсполнителиПоРемонтам.Количество() - 1 Цикл
			Строка1 = ИсполнителиПоРемонтам[Сч];
			Строка2 = Ссылка.ИсполнителиПоРемонтам[Сч];
			Если Не (Строка1.Исполнитель = Строка2.Исполнитель
				И Строка1.УточнениеИсполнителя = Строка2.УточнениеИсполнителя) Тогда 
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если Не Ссылка.ТрудовыеЗатраты.Количество() = ТрудовыеЗатраты.Количество() Тогда 
		Возврат Истина;
	Иначе
		Для Сч = 0 По ТрудовыеЗатраты.Количество() - 1 Цикл
			Строка1 = ТрудовыеЗатраты[Сч];
			Строка2 = Ссылка.ТрудовыеЗатраты[Сч];
			Если Не (Строка1.Квалификация = Строка2.Квалификация
				И Строка1.Количество = Строка2.Количество
				И Строка1.ВремяРаботы = Строка2.ВремяРаботы) Тогда 
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат Ложь;
КонецФункции // гкс- [06.23] Деснол 16.06.2023

#КонецОбласти