////////////////////////////////////////////////////////////////////////////////
// торо_СЛКСервер: методы, для работы с защищенными обработками
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

 // Функция предназначена для получения номера версии обработки.
 //
 // Параметры:
 //  Имя		 	- Строка - Имя обработки.
 //  Серия	 		- Строка - Серия ключа защиты.
 //  ОписаниеОшибки	- Строка - Описание ошибки.
 // Возвращаемое значение:
 //  Строка - Версия защищенной обработки.
Функция Версия_Session(Имя,Серия = "28DD", ОписаниеОшибки = "") Экспорт

	Обработка = слкМенеджерЗащиты.СоздатьОбъект(Серия, Имя, ОписаниеОшибки);
	Если Обработка = неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Обработка.Версия();
	
КонецФункции

// Функция подключает защищенную обработку.
//
// Параметры:
//  Имя		 	- Строка - Имя обработки.
//  Серия	 	- Строка - Серия ключа защиты.
//
// Возвращаемое значение:
//		ВнешняяОбработка - обработка работы с мнемосхемами.
Функция ПодключитьЗащищеннуюОбработку_Session(Имя = "торо_ЗащитаРаботаСМнемосхемами", Серия = "28DD") Экспорт
	
	ОбработкаЗащита = Неопределено;
	
	Если Метаданные.Отчеты.Найти(Имя) <> Неопределено Тогда
		ОбработкаЗащита = Отчеты[Имя].Создать();
	ИначеЕсли Метаданные.Обработки.Найти(Имя) <> Неопределено Тогда
		ОбработкаЗащита = Обработки[Имя].Создать();
	Иначе
		ОбработкаЗащита = слкМенеджерЗащиты.СоздатьОбъект(Серия, имя);
	КонецЕсли; 

	Возврат ОбработкаЗащита;
	
КонецФункции

// Функция выполняет заполнение таблицы данных плана-графика ППР.
//
// Параметры:
//		Имя - Строка - Имя внешней обработки.
//		СтруктураДанных - Структура - Структура данных.
//		Серия - Строка - серия ключа защиты.
//		СсылкаНаППР - ДокументСсылка.торо_ПланГрафикППР - ссылка на документ ППР.
//		ВидРемонта - СправочникСсылка.торо_ВидыРемонта - вид ремонта.
//		ТаблицаНормативов - ТаблицаЗначений - таблица нормативов.
//
//	Возвращаемое значение:
//		ТаблицаЗначений - таблица ремонтов.
Функция ЗаполнитьПланГрафикППР_Session(Имя, СтруктураДанных, Серия = "28DD", СсылкаНаППР = Неопределено,ВидРемонта = Неопределено,ТаблицаНормативов = Неопределено) Экспорт

	Обработка = Неопределено;
	
	Если Метаданные.Отчеты.Найти(Имя) <> Неопределено Тогда
		Обработка = Отчеты[Имя].Создать();
	ИначеЕсли Метаданные.Обработки.Найти(Имя) <> Неопределено Тогда
		Обработка = Обработки[Имя].Создать();
	Иначе
		Обработка = слкМенеджерЗащиты.СоздатьОбъект(Серия, имя);
		Если Обработка = Неопределено Тогда
			ТекстСообщения = Нстр("es='¡La licencia no es descubierta! El relleno del documento es imposible.';ru='Лицензия не обнаружена! Заполнение документа невозможно.';en='No license found! Filling out the document is not possible.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли; 
		
	Если ТипЗнч(СсылкаНаППР) = Тип("ДокументСсылка.торо_ГрафикРегламентныхМероприятийТОиР") Тогда
		
		Возврат Обработка.ЗаполнитьПланГрафикРегламентныхМероприятий(СтруктураДанных.ТаблицаПланРемонтов,
		СтруктураДанных.ТаблицаОбъектыРемонта, СтруктураДанных.ДатаПланирования,
		СтруктураДанных.ПериодичностьДетализации, СтруктураДанных.КоличествоПериодов,,, СсылкаНаППР);
		
	ИначеЕсли СтруктураДанных.Свойство("КалькуляторРЦ") И НЕ СтруктураДанных.Свойство("ВРНачалоЦикла") Тогда
		Возврат Обработка.ЗаполнитьПланГрафикППР(СтруктураДанных.ТаблицаПланРемонтов,
			СтруктураДанных.ТаблицаОбъектыРемонта, СтруктураДанных.ТаблицаЦепочки, СтруктураДанных.ДатаПланирования,
			СтруктураДанных.ПериодичностьДетализации, СтруктураДанных.КоличествоПериодов,,,
			СсылкаНаППР,ВидРемонта, ТаблицаНормативов, СтруктураДанных.ТабПредшествующие,
			СтруктураДанных.ТаблицаНормативов, СтруктураДанных.ЗавершенныеРемонты,
			СтруктураДанных.ПлановыеРемонты, СтруктураДанных.ТабПараметрыНаработкиОбъектовРемонта, СтруктураДанных.ПараметрыЗамещения,
			СтруктураДанных.ТабНаработкаОбъектовРемонта);		
			
	ИначеЕсли СтруктураДанных.Свойство("КалькуляторРЦ") И СсылкаНаППР = Неопределено Тогда
		Возврат Обработка.ЗаполнитьПланГрафикППР(СтруктураДанных.ТаблицаПланРемонтов,
						СтруктураДанных.ТаблицаОбъектыРемонта, СтруктураДанных.ТаблицаЦепочки, СтруктураДанных.ДатаПланирования,
						СтруктураДанных.ПериодичностьДетализации, СтруктураДанных.КоличествоПериодов,,,
						Неопределено, СтруктураДанных.ВРНачалоЦикла, ТаблицаНормативов,СтруктураДанных.ТабПредшествующие,
						СтруктураДанных.ТаблицаНормативов,,,СтруктураДанных.ТабПараметрыНаработкиОбъектовРемонта, СтруктураДанных.ПараметрыЗамещения,,, 
						СтруктураДанных.ВизуализацияТипОР, СтруктураДанных.ДатаОкончанияВизуализации);
		
	ИначеЕсли СсылкаНаППР = Неопределено Тогда
		                  
		Возврат Обработка.ЗаполнитьПланГрафикППР(СтруктураДанных.ТаблицаПланРемонтов,
						СтруктураДанных.ТаблицаОбъектыРемонта, СтруктураДанных.ТаблицаЦепочки, СтруктураДанных.ДатаПланирования,
						СтруктураДанных.ПериодичностьДетализации, СтруктураДанных.КоличествоПериодов,,,
						Неопределено, СтруктураДанных.ВРНачалоЦикла, ТаблицаНормативов,,,,,
						СтруктураДанных.ТабПараметрыНаработкиОбъектовРемонта,,,, СтруктураДанных.ВизуализацияТипОР, СтруктураДанных.ДатаОкончанияВизуализации);
		
	Иначе
						  // ЗаполнитьПланГрафикППР
		Возврат Обработка.ЗаполнитьПланГрафикППР(СтруктураДанных.ТаблицаПланРемонтов,
		СтруктураДанных.ТаблицаОбъектыРемонта, СтруктураДанных.ТаблицаЦепочки, СтруктураДанных.ДатаПланирования,
		СтруктураДанных.ПериодичностьДетализации, СтруктураДанных.КоличествоПериодов,,, СсылкаНаППР);
		
	КонецЕсли;
	
						
КонецФункции

#КонецОбласти