#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТемпСтрукт = новый Структура("ФормаСкопировать,ФормаСоздать", Неопределено, Неопределено);
	ЗаполнитьЗначенияСвойств(ТемпСтрукт,Элементы);
	Если Не ТемпСтрукт.ФормаСкопировать = Неопределено Тогда 
		Элементы.ФормаСкопировать.Доступность = Ложь;
		Элементы.ФормаСкопировать.Видимость = Ложь;
	КонецЕсли;
	Если Не ТемпСтрукт.ФормаСоздать = Неопределено Тогда 
		Элементы.ФормаСоздать.Доступность = Ложь;
		Элементы.ФормаСоздать.Видимость = Ложь;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаГлобальные;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	#Область ТекстЗапроса
	// гкс+ [10.23] Деснол 18.03.2024
	// в запрос добавлен подзапрос
	// гкс- [10.23] Деснол 18.03.2024
	Список.ТекстЗапроса = "ВЫБРАТЬ Различные
	|ДокТЧ.Ссылка КАК Ссылка
	|Поместить ВТ_НеВыполнено
	|ИЗ Документ.гкс_ЕВОБланк.МероприятияПоПредупреждению КАК ДокТЧ
	|Где ДокТЧ.Выполнено = Ложь
	|;
	|Выбрать
	                      |	Документгкс_ЕВОБланк.Ссылка КАК Ссылка,
	                      |	Документгкс_ЕВОБланк.ПометкаУдаления КАК ПометкаУдаления,
	                      |	Документгкс_ЕВОБланк.Номер КАК Номер,
	                      |	Документгкс_ЕВОБланк.Дата КАК Дата,
	                      |	Документгкс_ЕВОБланк.Проведен КАК Проведен,
	                      |	Документгкс_ЕВОБланк.СпособСогласования КАК СпособСогласования,
	                      |	Документгкс_ЕВОБланк.Организация КАК Организация,
	                      |	Документгкс_ЕВОБланк.Подразделение КАК Подразделение,
	                      |	ЕСТЬNULL(Спр.Наименование, Документгкс_ЕВОБланк.КорневаяПричинаТекст) КАК КорневаяПричина,
	                      |	Документгкс_ЕВОБланк.ТипКорневойПричины КАК ТипКорневойПричины,
	                      |	Документгкс_ЕВОБланк.ДокументОснование КАК ДокументОснование,
	                      |	Документгкс_ЕВОБланк.Ответственный КАК Ответственный,
	                      |	Документгкс_ЕВОБланк.ВремяНачалаОстановки КАК ВремяНачалаОстановки,
	                      |	Документгкс_ЕВОБланк.ВремяВызоваТС КАК ВремяВызоваТС,
	                      |	Документгкс_ЕВОБланк.ВремяЗапуска КАК ВремяЗапуска,
	                      |	Документгкс_ЕВОБланк.СтатусДокумента КАК СтатусДокумента,
	                      |	Документгкс_ЕВОБланк.ВидДефекта КАК ВидДефекта,
	                      |	Документгкс_ЕВОБланк.ИсторияСтатусов.(
	                      |		Ссылка КАК Ссылка,
	                      |		НомерСтроки КАК НомерСтроки,
	                      |		Дата КАК Дата,
	                      |		Пользователь КАК Пользователь,
	                      |		ЗаКого КАК ЗаКого,
	                      |		СтатусДокумента КАК СтатусДокумента
	                      |	) КАК ИсторияСтатусов,
	                      |	Документгкс_ЕВОБланк.Согласующие.(
	                      |		Ссылка КАК Ссылка,
	                      |		НомерСтроки КАК НомерСтроки,
	                      |		Согласующий КАК Согласующий,
	                      |		Согласовано КАК Согласовано,
	                      |		ПроведениеДокумента КАК ПроведениеДокумента,
	                      |		Порядок КАК Порядок,
	                      |		СтатусДокумента КАК СтатусДокумента,
	                      |		Замещающий КАК Замещающий
	                      |	) КАК Согласующие,
	                      |	Документгкс_ЕВОБланк.МероприятияПоПредупреждению.(
	                      |		Ссылка КАК Ссылка,
	                      |		НомерСтроки КАК НомерСтроки,
	                      |		Мероприятие КАК Мероприятие,
	                      |		Ответственный КАК Ответственный,
	                      |		Срок КАК Срок,
	                      |		Выполнено КАК Выполнено
	                      |	) КАК МероприятияПоПредупреждению,
	                      |	Документгкс_ЕВОБланк.АнализПричины.(
	                      |		Ссылка КАК Ссылка,
	                      |		НомерСтроки КАК НомерСтроки,
	                      |		Причина КАК Причина
	                      |	) КАК АнализПричины,
	                      |	Документгкс_ЕВОБланк.МоментВремени КАК МоментВремени,
	                      |	Документгкс_ЕВОБланк.ЕвоБланкПринят КАК ЕвоБланкПринят,
	                      |	Документгкс_ЕВОБланк.РазборТребуется КАК РазборТребуется,
						  |	ВТ_НеВыполнено.Ссылка есть NULL КАК МероприятияВыполнены
	                      |ИЗ
	                      |	Документ.гкс_ЕВОБланк КАК Документгкс_ЕВОБланк
						  |		Левое соединение ВТ_НеВыполнено КАК ВТ_НеВыполнено
						  |		ПО ВТ_НеВыполнено.Ссылка = Документгкс_ЕВОБланк.Ссылка
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гкс_КорневыеПричины КАК Спр
	                      |		ПО Документгкс_ЕВОБланк.КорневаяПричина = Спр.Ссылка";
	#КОнецОбласти
	//
	НЭлем = Элементы.Добавить("Список_РазборТребуется", Тип("ПолеФормы"), Элементы.Список);
	НЭлем.Вид = ВидПоляФормы.ПолеФлажка;
	НЭлем.ПутьКДанным = "Список.РазборТребуется";
	//
	НЭлем = Элементы.Добавить("Список_ЕвоБланкПринят", Тип("ПолеФормы"), Элементы.Список);
	НЭлем.Вид = ВидПоляФормы.ПолеФлажка;
	НЭлем.ПутьКДанным = "Список.ЕвоБланкПринят";
	//
	// гкс+ [10.23] Деснол 18.03.2024
	НЭлем = Элементы.Добавить("Список_МероприятияВыполнены", Тип("ПолеФормы"), Элементы.Список);
	НЭлем.Вид = ВидПоляФормы.ПолеФлажка;
	НЭлем.ПутьКДанным = "Список.МероприятияВыполнены";
	// гкс- [10.23] Деснол 18.03.2024
	
	// гкс+ [Часовые пояса] Куст 14.04.2020
	Сдвиг = Час(ТекущаяДатаСеанса()) - Час(ТекущаяДата());
	ТекстыЗамены = Новый Массив();
	ТекстыЗамены.Добавить(Новый Структура("До, После", "Документгкс_ЕВОБланк.Дата,",
		" ДобавитьКДате(ДокУментгкс_ЕВОБланк.Дата, Час, " + Сдвиг + ") КАК Дата,"));
	ТекстыЗамены.Добавить(Новый Структура("До, После", "Документгкс_ЕВОБланк.ВремяНачалаОстановки,",
		" ДобавитьКДате(ДокУментгкс_ЕВОБланк.ВремяНачалаОстановки, Час, " + Сдвиг + ") КАК ВремяНачалаОстановки,"));
	ТекстыЗамены.Добавить(Новый Структура("До, После", "Документгкс_ЕВОБланк.ВремяВызоваТС,",
		" ДобавитьКДате(ДокУментгкс_ЕВОБланк.ВремяВызоваТС, Час, " + Сдвиг + ") КАК ВремяВызоваТС,"));
	ТекстыЗамены.Добавить(Новый Структура("До, После", "Документгкс_ЕВОБланк.ВремяЗапуска,",
		" ДобавитьКДате(ДокУментгкс_ЕВОБланк.ВремяЗапуска, Час, " + Сдвиг + ") КАК ВремяЗапуска,"));
	Список.ТекстЗапроса = гкс_ЧасовыеПоясаВызовСервера.ИзменитьТекстЗапросаФормыСписка(
		Список.ТекстЗапроса, ТекстыЗамены);
	// гкс- [Часовые пояса] Куст 14.04.2020
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИфункции

&НаКлиенте
Процедура СоздатьНаОсновании(Команда)
	ОписаниеОповещенияПослеВыбора = Новый ОписаниеОповещения("СоздатьБланкПослеВыбораВД", ЭтотОбъект);
	ДопПараметры = Новый Структура("ОтборСтатусУстранен",Истина);
	ОткрытьФорму("Документ.торо_ВыявленныеДефекты.ФормаВыбора", ДопПараметры, ЭтотОбъект,,,,
		ОписаниеОповещенияПослеВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьБланкПослеВыбораВД(Результат, ДопПараметры)Экспорт
	Если ЗначениеЗаполнено(Результат) Тогда 
		ОткрытьФорму("Документ.гкс_ЕВОБланк.ФормаОбъекта", Новый Структура("ДокументОснование",Результат));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
#КонецОбласти
