///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2018, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ПолучитьДанныеМонитора(ПараметрыЗадания, АдресРезультата) Экспорт
	
	МониторПортала1СИТС.ЗаписатьИнформациюВЖурналРегистрации(
		НСтр("es='El comienzo de la recepción de los datos del Monitor del Portal 1С:ИТС';ru='Начало получения данных Монитора Портала 1С:ИТС';en='Start of receiving Portal Monitor 1C: ITS data'"));
	
	РезультатОперации = МониторПортала1СИТС.ДанныеМонитора();
	
	Если ПустаяСтрока(РезультатОперации.ИмяОшибки) Тогда
		ДополнительныеДанные = Неопределено;
		МониторПортала1СИТСПереопределяемый.ПриПолученииДополнительныхДанныхМонитора(
			ДополнительныеДанные,
			ПараметрыЗадания.ПараметрыПолученияДополнительныхДанных);
		РезультатОперации.Вставить("ДополнительныеДанные", ДополнительныеДанные);
	ИначеЕсли РезультатОперации.ИмяОшибки <> "НеЗаполненыДанныеАутентификации" Тогда
		МониторПортала1СИТС.ЗаписатьОшибкуВЖурналРегистрации(
			НСтр("es='No consiguió recibir los datos del Monitor del Portal 1С:ИТС.';ru='Не удалось получить данные Монитора Портала 1С:ИТС.';en='Failed to get Portal Monitor 1C: ITS data.'")
				+ Символы.ПС
				+ РезультатОперации.ИнформацияОбОшибке);
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(РезультатОперации, АдресРезультата);
	
	МониторПортала1СИТС.ЗаписатьИнформациюВЖурналРегистрации(
		НСтр("es='Es acabada la recepción de los datos del Monitor del Portal 1С:ИТС';ru='Завершено получение данных Монитора Портала 1С:ИТС';en='Completed the acquisition of Portal Monitor 1C: ITS data'"));
	
КонецПроцедуры

Процедура ПолучитьДеталиДанныхМонитора(Параметры, АдресРезультата) Экспорт
	
	МониторПортала1СИТС.ЗаписатьИнформациюВЖурналРегистрации(
		НСтр("es='El comienzo de la recepción de los detalles de los datos del Monitor del Portal 1С:ИТС';ru='Начало получения деталей данных Монитора Портала 1С:ИТС';en='Start of receiving details of the Portal Monitor 1C: ITS'"));
	
	РезультатОперации = МониторПортала1СИТС.ДеталиДанныхМонитора(
		Параметры.Логин,
		Параметры.Договоры1СИТС,
		Параметры.АктивацияСервисовСопровождения,
		Параметры.ДоговорыНаСервисы);
	ПоместитьВоВременноеХранилище(РезультатОперации, АдресРезультата);
	
	Если Не ПустаяСтрока(РезультатОперации.ИмяОшибки) Тогда
		МониторПортала1СИТС.ЗаписатьОшибкуВЖурналРегистрации(
			НСтр("es='No consiguió recibir los detalles de los datos del Monitor del Portal 1С:ИТС.';ru='Не удалось получить детали данных Монитора Портала 1С:ИТС.';en='Failed to get the details of the Portal Monitor 1C: ITS.'")
				+ Символы.ПС
				+ РезультатОперации.ИнформацияОбОшибке);
	КонецЕсли;
	
	МониторПортала1СИТС.ЗаписатьИнформациюВЖурналРегистрации(
		НСтр("es='Es acabada la recepción de los detalles de los datos del Monitor del Portal 1С:ИТС';ru='Завершено получение деталей данных Монитора Портала 1С:ИТС';en='Completed the receipt of data details of the Portal Monitor 1C: ITS'"));
	
КонецПроцедуры

Процедура ПолучитьДеталиИнформацияОДоступномОбновлении(Параметры, АдресРезультата) Экспорт
	
	МониторПортала1СИТС.ЗаписатьИнформациюВЖурналРегистрации(
		НСтр("es='El comienzo de la recepción de los detalles de la información sobre la renovación accesible';ru='Начало получения деталей информации о доступном обновлении';en='Start getting details of available update information'"));
	
	МодульПолучениеОбновленийПрограммы = ОбщегоНазначения.ОбщийМодуль("ПолучениеОбновленийПрограммы");
	ИнформацияОбОбновлении = МодульПолучениеОбновленийПрограммы.ИнформацияОДоступномОбновлении();
	ПоместитьВоВременноеХранилище(ИнформацияОбОбновлении, АдресРезультата);
	
	Если Не ПустаяСтрока(ИнформацияОбОбновлении.ИмяОшибки) Тогда
		МониторПортала1СИТС.ЗаписатьОшибкуВЖурналРегистрации(
			НСтр("es='No consiguió recibir los detalles de la información sobre la renovación accesible.';ru='Не удалось получить детали информации о доступном обновлении.';en='Failed to get details of available update information.'")
				+ Символы.ПС
				+ ИнформацияОбОбновлении.ИнформацияОбОшибке);
	КонецЕсли;
	
	МониторПортала1СИТС.ЗаписатьИнформациюВЖурналРегистрации(
		НСтр("es='Es acabada la recepción de los detalles de la información sobre la renovación accesible';ru='Завершено получение деталей информации о доступном обновлении';en='Completed receiving details of available update information'"));
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли