
#Область ОбработчикиСобытийЭлементовТаблицыФормыСоставКомиссии

&НаКлиенте
Процедура СоставКомиссииПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ТекущиеДанные = Элементы.СоставКомиссии.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		Если Не ЗначениеЗаполнено(ТекущиеДанные.ЧленКомиссии) Тогда
			Объект.СоставКомиссии.Удалить(ТекущиеДанные);
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииЧленКомиссииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		МассивСтрок = Объект.СоставКомиссии.НайтиСтроки(Новый Структура("ЧленКомиссии", ВыбранноеЗначение));
		Если МассивСтрок.Количество() > 0 Тогда
			СтандартнаяОбработка = Ложь;
			ПоказатьПредупреждение(Неопределено, СтрЗаменить(Нстр("es='El empleado %Сотрдуник del % hay ya como parte de la comisión';ru='Сотрудник %Сотрдуник% уже имеется в составе комиссии';en='Employee %Сотрудник% is already on the commission'"),"%Сотрдуник%", ВыбранноеЗначение),,НСтр("es='La elección del miembro de la comisión...';ru='Выбор члена комиссии...';en='Selection of a member of the commission ...'") );
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		МассивСтрок = Объект.СоставКомиссии.НайтиСтроки(Новый Структура("ЧленКомиссии", ВыбранноеЗначение));
		Если МассивСтрок.Количество() > 0 Тогда
			СтандартнаяОбработка = Ложь;
			ПоказатьПредупреждение(Неопределено, СтрЗаменить(Нстр("es='El empleado %Сотрдуник del % hay ya como parte de la comisión';ru='Сотрудник %Сотрдуник% уже имеется в составе комиссии';en='Employee %Сотрудник% is already on the commission'"),"%Сотрдуник%", ВыбранноеЗначение),,НСтр("es='La elección del miembro de la comisión...';ru='Выбор члена комиссии...';en='Selection of a member of the commission ...'") );
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти





