#Область СлужебныеПроцедурыИФункции

// Добавляет служебные реквизиты на форму                           
Процедура ДобавитьНовыеЭлементы(ЭтаФорма, ГруппаРодитель = Неопределено, ДопПараметры = Неопределено)Экспорт
	НовыеРеквизиты = Новый Массив();
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("гкс_СдвигЧП", Новый ОписаниеТипов("Число",,, 
		Новый КвалификаторыЧисла(2,0))));
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("гкс_РеквизитыДаты", Новый ОписаниеТипов("Строка",,,, 
		Новый КвалификаторыСтроки(900))));
	ЭтаФорма.ИзменитьРеквизиты(НовыеРеквизиты);
	
	Если Не ДопПараметры = Неопределено Тогда 
		Если ДопПараметры.Свойство("ДатаКлиента") Тогда 
			ДатаСервера = ТекущаяДата();
			Если Секунда(ДатаСервера) >= Секунда(ДопПараметры.ДатаКлиента) Тогда 
				Разница = Час(ДопПараметры.ДатаКлиента) - Час(ДатаСервера) ;
			Иначе
				Разница = Час(ДопПараметры.ДатаКлиента) - Час(ДатаСервера) + 1;
			КонецЕсли;
			ЭтаФорма["гкс_СдвигЧП"] = Разница;
		Иначе
			ДатаСервера = ТекущаяДата();
			ДатаКлиента = ТекущаяДатаСеанса();
			Если Секунда(ДатаСервера) >= Секунда(ДатаКлиента) Тогда 
				Разница = Час(ДатаКлиента) - Час(ДатаСервера) ;
			Иначе
				Разница = Час(ДатаКлиента) - Час(ДатаСервера) + 1;
			КонецЕсли;
			ЭтаФорма["гкс_СдвигЧП"] = Разница;
		КонецЕсли;
	Иначе
		ДопПараметры = новый Структура();
		ДатаСервера = ТекущаяДата();
		ДатаКлиента = ТекущаяДатаСеанса();
		Если Секунда(ДатаСервера) >= Секунда(ДатаКлиента) Тогда 
			Разница = Час(ДатаКлиента) - Час(ДатаСервера) ;
		Иначе
			Разница = Час(ДатаКлиента) - Час(ДатаСервера) + 1;
		КонецЕсли;
		ЭтаФорма["гкс_СдвигЧП"] = Разница;
	КонецЕсли;
	
	Если ДопПараметры.Свойство("гкс_РеквизитыДаты") Тогда 
		ЭтаФорма["гкс_РеквизитыДаты"] = ДопПараметры.гкс_РеквизитыДаты;
	КонецЕсли;
	
	Если Не ГруппаРодитель = Неопределено Тогда 
		НЭлем = ЭтаФорма.Элементы.Добавить("гкс_чп_Сдвиг",Тип("ПолеФормы"),ГруппаРодитель);
		НЭлем.Вид = ВидПоляФормы.ПолеВвода;
		НЭлем.ТолькоПросмотр = Истина;
		НЭлем.ПутьКДанным = "гкс_СдвигЧП";
		НЭлем.Заголовок = НСтр("ru='Сдвиг';en='Сдвиг';es='Сдвиг'");
		НЭлем.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

// Переводит реквизиты формы на часовой пояс клиента
Процедура ПеревестиНаЧПКлиента(ЭтаФорма, Реквизиты = Неопределено,
								Объект = Неопределено, 
								ДатаКлиента = Неопределено)Экспорт
	Если Не ДатаКлиента = Неопределено Тогда 
		ДатаСервера = ТекущаяДата();
		Если Секунда(ДатаСервера) >= Секунда(ДатаКлиента) Тогда 
			Разница = Час(ДатаКлиента) - Час(ДатаСервера) ;
		Иначе
			Разница = Час(ДатаКлиента) - Час(ДатаСервера) + 1;
		КонецЕсли;
		ЭтаФорма["гкс_СдвигЧП"] = Разница;
		ЭтаФорма["гкс_РеквизитыДаты"] = Реквизиты;
	КонецЕсли;
	
	Если Реквизиты = Неопределено Тогда 
		Реквизиты = ЭтаФорма["гкс_РеквизитыДаты"];
	//ИначеЕсли Не ЭтаФорма["гкс_РеквизитыДаты"] = Реквизиты Тогда 
	//	ЭтаФорма["гкс_РеквизитыДаты"] = Реквизиты;
	КонецЕсли;
	
	Если Объект = Неопределено Тогда 
		Объект = ЭтаФорма.Объект;
	КонецЕсли;
	
	ПеревестиРеквизиты(Объект, Реквизиты, (ЭтаФорма["гкс_СдвигЧП"] * 3600));
	
КонецПроцедуры

// Переводит реквизиты формы на часовой пояс сервера
Процедура ПеревестиНаЧПСервера(ЭтаФорма, Реквизиты = Неопределено, Объект = Неопределено)Экспорт
	Если Реквизиты = Неопределено Тогда 
		Реквизиты = ЭтаФорма["гкс_РеквизитыДаты"];
	КонецЕсли;
	
	Если Объект = Неопределено Тогда 
		Объект = ЭтаФорма.Объект;
	КонецЕсли;
	
	ПеревестиРеквизиты(Объект, Реквизиты, (ЭтаФорма["гкс_СдвигЧП"] * -3600));
КонецПроцедуры

// Переводит реквизиты-даты объекта по сдвигу
Процедура ПеревестиРеквизиты(Объект, Реквизиты, Сдвиг)	
	Если Сдвиг = 0 Тогда 
		Возврат;
	КонецЕсли;
	МассивИменРеквизитов = СтрРазделить(Реквизиты, ",", Ложь);
	Для Каждого ИмяРеквизита Из МассивИменРеквизитов Цикл
		ЧастиИмени = СтрРазделить(ИмяРеквизита, ".", Ложь);
		Если ЧастиИмени.Количество() = 1 Тогда 
			Если ЗначениеЗаполнено(Объект[ИмяРеквизита]) Тогда 
				//Если Объект[ИмяРеквизита] = НачалоДня(Объект[ИмяРеквизита]) Тогда 
				//	Продолжить;
				//ИначеЕсли Объект[ИмяРеквизита] = КонецДня(Объект[ИмяРеквизита]) Тогда 
				//	Продолжить;
				//КонецЕсли;
				Объект[ИмяРеквизита] = Объект[ИмяРеквизита] + Сдвиг;
				//Если Объект[ИмяРеквизита] = НачалоДня(Объект[ИмяРеквизита]) Тогда 
				//	Объект[ИмяРеквизита] = Объект[ИмяРеквизита] + 1;
				//ИначеЕсли Объект[ИмяРеквизита] = КонецДня(Объект[ИмяРеквизита]) Тогда 
				//	Объект[ИмяРеквизита] = Объект[ИмяРеквизита] - 1;
				//КонецЕсли;
			КонецЕсли;
		Иначе
			Для Каждого СтрокаТаблицы Из Объект[ЧастиИмени[0]] Цикл
				СтруктураПроверки = Новый Структура(ЧастиИмени[1], Неопределено);
				ЗаполнитьЗначенияСвойств(СтруктураПроверки, СтрокаТаблицы);
				Если Не СтруктураПроверки[ЧастиИмени[1]] = Неопределено И ЗначениеЗаполнено(СтрокаТаблицы[ЧастиИмени[1]]) Тогда 
					//Если СтрокаТаблицы[ЧастиИмени[1]] = НачалоДня(СтрокаТаблицы[ЧастиИмени[1]]) Тогда 
					//	Продолжить;
					//ИначеЕсли СтрокаТаблицы[ЧастиИмени[1]] = КонецДня(СтрокаТаблицы[ЧастиИмени[1]]) Тогда 
					//	Продолжить;
					//КонецЕсли;
					СтрокаТаблицы[ЧастиИмени[1]] = СтрокаТаблицы[ЧастиИмени[1]] + Сдвиг;
					//Если СтрокаТаблицы[ЧастиИмени[1]] = НачалоДня(СтрокаТаблицы[ЧастиИмени[1]]) Тогда 
					//	СтрокаТаблицы[ЧастиИмени[1]] = СтрокаТаблицы[ЧастиИмени[1]] + 1;
					//ИначеЕсли СтрокаТаблицы[ЧастиИмени[1]] = КонецДня(СтрокаТаблицы[ЧастиИмени[1]]) Тогда 
					//	СтрокаТаблицы[ЧастиИмени[1]] = СтрокаТаблицы[ЧастиИмени[1]] - 1;
					//КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Изменяет текст запроса, под нужный часовой пояс
Функция ИзменитьТекстЗапросаФормыСписка(ИсходныйТекст, Реквизиты)Экспорт
	ВременныйТекст = ИсходныйТекст;
	Для Каждого Имя Из Реквизиты Цикл
		ВременныйТекст = СтрЗаменить(ВременныйТекст,Имя.До,Имя.После);
	КонецЦикла;
	Возврат ВременныйТекст;
КонецФункции

// Устанавливает часовой пояс сеанса из времени клиента на момент запуска
Процедура ИзменитьЧасовойПоясСеанса(ДатаКлиента)Экспорт
	ДатаСервера = ТекущаяУниверсальнаяДата();
	Если Секунда(ДатаСервера) >= Секунда(ДатаКлиента) Тогда 
		Разница = Час(ДатаКлиента) - Час(ДатаСервера) ;
	Иначе
		Разница = Час(ДатаКлиента) - Час(ДатаСервера) + 1;
	КонецЕсли;
	
	
	УстановитьЧасовойПоясСеанса("GMT" + ?(Разница > 0, "+", "") + Разница);
КонецПроцедуры

// ПОлуение представления со сдвигом Часового пояса
Процедура гкс_ОбработкаПолученияПредставленияОбработкаПолученияПредставления(Источник, Данные, Представление, СтандартнаяОбработка) Экспорт
	СдвигЧП = Час(ТекущаяДатаСеанса()) - Час(ТекущаяДата());
	Если Не СдвигЧП = 0 Тогда 
			СтандартнаяОбработка = Ложь;
			Представление = Данные.Ссылка.Метаданные().Синоним + " " + Данные.Номер + НСтр("ru=' от ';en=' from '")
				+ Формат(Данные.Дата + (СдвигЧП * 3600),"ДФ=дд.ММ.гггг ЧЧ:мм:сс");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти