
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьЭлементовПоПравамПользвателя();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовПоПравамПользвателя()
	
	СоответствиеЭлементов = Новый Соответствие;
	СоответствиеЭлементов.Вставить("ГруппаСтруктурыОбъектовРемонта", Метаданные.Справочники.торо_СтруктурыОР);
	СоответствиеЭлементов.Вставить("ГруппаПриоритетыОбъектовРемонта", Метаданные.Справочники.торо_ПриоритетыОбъектовРемонта);
	СоответствиеЭлементов.Вставить("ГруппаНаправленияОбъектовРемонтныхРабот", Метаданные.Справочники.торо_НаправленияОбъектовРемонтныхРабот);
	СоответствиеЭлементов.Вставить("ГруппаВидыКоэффициентовРемонтныхОсобенностей", Метаданные.Справочники.торо_ВидыКоэффициентовРемонтныхОсобенностей);
	СоответствиеЭлементов.Вставить("ГруппаЗначенияКоэффициентовРемонтныхОсобенностей", Метаданные.Справочники.торо_ЗначенияКоэффициентовРемонтныхОсобенностей);
	СоответствиеЭлементов.Вставить("ГруппаКонтролируемыеПоказателиОбъектовРемонта", Метаданные.ПланыВидовХарактеристик.торо_ИзмеряемыеПоказателиОбъектовРемонта);
	СоответствиеЭлементов.Вставить("ГруппаЗначенияИзмеряемыхПоказателейОбъектовРемонта", Метаданные.Справочники.торо_ЗначенияИзмеряемыхПоказателейОбъектовРемонта);
	СоответствиеЭлементов.Вставить("ГруппаПараметрыВыработкиОС", Метаданные.Справочники.ПараметрыВыработкиОС);
	СоответствиеЭлементов.Вставить("ГруппаПричиныИзмененияНаработки", Метаданные.Справочники.торо_ПричиныИзмененияНаработки);
	СоответствиеЭлементов.Вставить("ГруппаЦепочкиРемонтов", Метаданные.Справочники.торо_ЦепочкиРемонта);
	СоответствиеЭлементов.Вставить("ГруппаМерыБезопасности", Метаданные.Справочники.торо_МерыБезопасности);
	
	Для каждого КлючИЗначение из СоответствиеЭлементов Цикл
		Если НЕ ПравоДоступа("Просмотр", КлючИЗначение.Значение) И Элементы.Найти(КлючИЗначение.Ключ) <> Неопределено Тогда
			Элементы[КлючИЗначение.Ключ].Видимость = Ложь;	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьВидыКоэффициентовРемонтныхОсобенностей(Команда)
	
	ОткрытьФорму("Справочник.торо_ВидыКоэффициентовРемонтныхОсобенностей.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗначенияКоэффициентовРемонтныхОсобенностей(Команда)
	
	ОткрытьФорму("Справочник.торо_ЗначенияКоэффициентовРемонтныхОсобенностей.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтруктурыОбъектовРемонта(Команда)
	
	ОткрытьФорму("Справочник.торо_СтруктурыОР.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПриоритетыОбъектовРемонта(Команда)
	
	ОткрытьФорму("Справочник.торо_ПриоритетыОбъектовРемонта.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНаправленияОбъектовРемонтныхРабот(Команда)
	
	ОткрытьФорму("Справочник.торо_НаправленияОбъектовРемонтныхРабот.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЦепочкиРемонта(Команда)
	
	ОткрытьФорму("Справочник.торо_ЦепочкиРемонта.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьМерыБезопасности(Команда)
	
	ОткрытьФорму("Справочник.торо_МерыБезопасности.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКонтролируемыеПоказателиОбъектовРемонта(Команда)
	ОткрытьФорму("ПланВидовХарактеристик.торо_ИзмеряемыеПоказателиОбъектовРемонта.ФормаСписка", , ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗначенияИзмеряемыхПоказателейОбъектовРемонта(Команда)
	ОткрытьФорму("Справочник.торо_ЗначенияИзмеряемыхПоказателейОбъектовРемонта.ФормаСписка", , ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПричиныИзмененияНаработки(Команда)
	ОткрытьФорму("Справочник.торо_ПричиныИзмененияНаработки.ФормаСписка", , ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПараметрыВыработкиОС(Команда)
	ОткрытьФорму("Справочник.ПараметрыВыработкиОС.ФормаСписка", , ЭтаФорма);
КонецПроцедуры

#КонецОбласти
