
#Область ОбработчикиСобытийФормы

&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура гкс_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("Основание") Тогда
		#Удаление
		торо_ЗаполнениеДокументов.ПроверитьВозможностьВводаНаОсновании(Параметры.Основание, Отказ);
		#КонецУдаления
		#Вставка
		// гкс+ [Релиз16] Деснол
		торо_ЗаполнениеДокументов.гкс_ПроверитьВозможностьВводаНаОснованииСтарый(Параметры.Основание, Отказ);
		// гкс- [Релиз16]
		#КонецВставки
		Если Отказ Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	#Вставка
	// гкс+ [2021] Куст
	Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда
		Объект.гкс_Сводный = Истина;
	КонецЕсли;
	// гкс+ [03.23] Деснол 13.03.2023
	Если Не РольДоступна("гкс_РедактированиеЗаявкиНаРемонт") Тогда 
		Элементы.Дата.ТолькоПросмотр = Истина;
	КонецЕсли;
	// гкс- [03.23] Деснол 13.03.2023
	#КонецВставки

	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	Если Параметры.Свойство("ID") Тогда

		Строки = Объект.СвязанныеРемонты.НайтиСтроки(Новый Структура("ID", Параметры.ID));
		Если Строки.Количество() Тогда
			Элементы.СвязанныеРемонты.ТекущаяСтрока = Строки[0].ПолучитьИдентификатор();
		ИначеЕсли Параметры.ID = Объект.IDОсновногоРемонта Тогда
			ЭтаФорма.ТекущийЭлемент = Элементы.ДокументОснование;
		КонецЕсли;

	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.КорректируемыйДокумент) И ТипЗнч(Объект.КорректируемыйДокумент) = Тип("ДокументСсылка.торо_ОстановочныеРемонты") Тогда
		Объект.ДокументОснование = Объект.КорректируемыйДокумент.ДокументОснование;
	КонецЕсли; 

	//торо_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(РеквизитФормыВЗначение("Объект"), ЭтаФорма, Строка(Объект.ВидОперации));
	торо_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(Объект, ЭтаФорма, Строка(Объект.ВидОперации));
	торо_СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка, Новый Структура("УстановитьСвойствоЭлементовФормыОтПрав", Истина));

	// Согласование++
	ВидДокумента = Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_ОстановочныеРемонты;
	торо_РаботаССогласованиями.ПриСозданииНаСервере(ЭтаФорма, ВидДокумента);
	// Согласование --

	УстановитьУсловноеОформление();

	ОбновитьДоступностьДляРедактирования();

	УправлениеВидимостью(ЭтотОбъект);

	ДиаграммаРемонтов.ОтображатьЗаголовок = Ложь;
	ДиаграммаРемонтов.ОтображатьЛегенду   = Ложь;

	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПроставитьПризнакЗависимыйПодчиненный();
	КонецЕсли; 
	#Вставка
	// Гкс+[TOIR20-188] Селимов 
	ДобавитьЭлементыФормы();   
	// гкс+ [Часовые пояса] Куст 
	гкс_ЧасовыеПоясаВызовСервера.ДобавитьНовыеЭлементы(ЭтаФорма, Элементы.ШапкаДатаНомер,
		Новый Структура("гкс_РеквизитыДаты", "Дата,ДатаНачалаРемонта,ДатаОкончанияРемонта," 
		+ "СвязанныеРемонты.ДатаНачалаРемонта,СвязанныеРемонты.ДатаОкончанияРемонта" +
		",СвязанныеРемонты.ДатаНачалаРемонтаСтарая,СвязанныеРемонты.ДатаОкончанияРемонтаСтарая"));
	#КонецВставки 

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПриОткрытии")
Процедура гкс_ПриОткрытии(Отказ)

	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	УстановитьВидимостьДоступность();

	Если Не ЗначениеЗаполнено(Объект.Ссылка) И Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.торо_ВидыОперацийДокументаОстановочныйРемонт.ОстановочныйРемонт") И ЗначениеЗаполнено(Объект.ДокументОснование) И Объект.IDОсновногоРемонта = "" Тогда
		ПодключитьОбработчикОжидания("ОткрытьФормуДляПодбораОстановочногоРемонта", 0.1, Истина);
	КонецЕсли;
    #Вставка
	гкс_ПриОткрытииНаСервере();
	// Гкс+[TOIR20-188] Селимов 
	Этаформа["ТрудовыеРесурсы_ПериодС"] = Объект.ДатаНачалаРемонта;
	Этаформа["ТрудовыеРесурсы_ПериодПо"] = Объект.ДатаОкончанияРемонта;
	ЗаполнитьТрудовыеРесурсы(); 
	#КонецВставки

КонецПроцедуры

// гкс+ [2021] Куст
&НаСервере
Процедура гкс_ПриОткрытииНаСервере()
	гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПКлиента(ЭтаФорма, 
		"Дата,ДатаНачалаРемонта,ДатаОкончанияРемонта," 
		+ "СвязанныеРемонты.ДатаНачалаРемонта,СвязанныеРемонты.ДатаОкончанияРемонта" +
		",СвязанныеРемонты.ДатаНачалаРемонтаСтарая,СвязанныеРемонты.ДатаОкончанияРемонтаСтарая" ,,);
КонецПроцедуры

// гкс+ [2021] Куст
&НаКлиенте
Процедура гкс_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	Если Объект.гкс_Сводный Тогда
		Если ЗначениеЗаполнено(Объект.ДокументОснование) И Объект.СвязанныеРемонты.Количество() Тогда
			Объект.ДокументОснование = Объект.СвязанныеРемонты[0].ДокументИсточник;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// гкс+ [2021] Куст
&НаСервере
&ИзменениеИКонтроль("ПередЗаписьюНаСервере")
Процедура гкс_ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

	// Согласование++
	торо_РаботаССогласованиями.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	// Согласование--

	#Вставка
	гкс_ИзменитьИсполнителейВОснованиях(Отказ);
	гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПСервера(ЭтаФорма,, ТекущийОбъект);
	#КонецВставки
КонецПроцедуры

// гкс+ [2021] Куст
&НаСервере
&ИзменениеИКонтроль("ПриЗаписиНаСервере")
Процедура гкс_ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	// Согласование++
	торо_РаботаССогласованиями.ПриЗаписиНаСервере(ЭтаФорма, ТекущийОбъект);
	// Согласование--

	#Вставка
	гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПКлиента(ЭтаФорма,
		"Дата,ДатаНачалаРемонта,ДатаОкончанияРемонта," 
		+ "СвязанныеРемонты.ДатаНачалаРемонта,СвязанныеРемонты.ДатаОкончанияРемонта" +
		",СвязанныеРемонты.ДатаНачалаРемонтаСтарая,СвязанныеРемонты.ДатаОкончанияРемонтаСтарая", ТекущийОбъект);
	#КонецВставки
КонецПроцедуры

// гкс+ [2021] Куст
&НаСервере
&ИзменениеИКонтроль("ПриЧтенииНаСервере")
Процедура гкс_ПриЧтенииНаСервере(ТекущийОбъект)
	#Вставка
	СтруктураПроверки = Новый Структура("гкс_СдвигЧП", Неопределено);
	ЗаполнитьЗначенияСвойств(СтруктураПроверки, ЭтотОбъект);
	Если Не СтруктураПроверки.гкс_СдвигЧП = Неопределено Тогда 
		гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПКлиента(ЭтаФорма,
		"Дата,ДатаНачалаРемонта,ДатаОкончанияРемонта," 
		+ "СвязанныеРемонты.ДатаНачалаРемонта,СвязанныеРемонты.ДатаОкончанияРемонта" +
		",СвязанныеРемонты.ДатаНачалаРемонтаСтарая,СвязанныеРемонты.ДатаОкончанияРемонтаСтарая", Объект);
	КонецЕсли;
	#КонецВставки

	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
&ИзменениеИКонтроль("ДатаНачалаРемонтаПриИзменении")
Процедура гкс_ДатаНачалаРемонтаПриИзменении(Элемент)

	#Вставка
	// Гкс+[TOIR20-190] Селимов 
	ПриИзмененииДатРемонта(Истина, Ложь); 
	// Гкс+[TOIR20-188] Селимов 
	Этаформа["ТрудовыеРесурсы_ПериодС"] = Объект.ДатаНачалаРемонта;
	Этаформа["ТрудовыеРесурсы_ПериодПо"] = Объект.ДатаОкончанияРемонта;
	ЗаполнитьТрудовыеРесурсы(); 
	#КонецВставки 
	Если Объект.ДатаНачалаРемонта > Объект.ДатаОкончанияРемонта Тогда
		ТекстСообщения = НСтр("es='¡La fecha del comienzo de la reparación es más grande que la fecha de la terminación!';ru='Дата начала ремонта больше даты окончания!';en='Repair start date is greater than the end date!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ДатаОкончанияРемонтаПриИзменении")
Процедура гкс_ДатаОкончанияРемонтаПриИзменении(Элемент)

	#Вставка
	// Гкс+[TOIR20-190] Селимов 
	ПриИзмененииДатРемонта(Ложь, Истина);
	// Гкс+[TOIR20-188] Селимов 
	Этаформа["ТрудовыеРесурсы_ПериодС"] = Объект.ДатаНачалаРемонта;
	Этаформа["ТрудовыеРесурсы_ПериодПо"] = Объект.ДатаОкончанияРемонта;
	ЗаполнитьТрудовыеРесурсы(); 
	#КонецВставки 
	Если Объект.ДатаНачалаРемонта > Объект.ДатаОкончанияРемонта Тогда
		ТекстСообщения = НСтр("es='¡La fecha del comienzo de la reparación es más grande que la fecha de la terminación!';ru='Дата начала ремонта больше даты окончания!';en='Repair start date is greater than the end date!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура гкс_ОрганизацияПриИзмененииВместо(Элемент)
	// Гкс+[TOIR20-188] Селимов 
	ЗаполнитьТрудовыеРесурсыНаСервере(); 	
КонецПроцедуры

&НаКлиенте
Процедура гкс_ПодразделениеПриИзмененииВместо(Элемент)
	// Гкс+[TOIR20-188] Селимов 
	ЗаполнитьТрудовыеРесурсыНаСервере(); 
КонецПроцедуры

&НаКлиенте
Процедура ТрудовыеРесурсыпериодПриИзменении(Элемент)
	// Гкс+[TOIR20-188] Селимов 
	ЗаполнитьТрудовыеРесурсы(); 
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_СвязанныеРемонты

// Гкс+[TOIR20-189] Селимов 
Функция ПолучитьПлановыеТрудозатраты(ИДРемонтов, ДокументыИсточники = Неопределено)
	
	// гкс+ [2021] Куст
	СекундВМинуте = 60;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	// гкс+ [Релиз16] Деснол
	"ВЫБРАТЬ
	|	ПлановыеТрудозатраты.Квалификация КАК Квалификация,
	|	СУММА(ВЫБОР
		|			КОГДА ПлановыеТрудозатраты.Количество = 0
		|				ТОГДА 1
		|			ИНАЧЕ ПлановыеТрудозатраты.Количество
		|		КОНЕЦ * ВЫБОР
		|			КОГДА ПлановыеТрудозатраты.ВремяРаботы = 0
		|				ТОГДА 1
		|			ИНАЧЕ ПлановыеТрудозатраты.ВремяРаботы
		|	КОНЕЦ / " + СекундВМинуте + ") КАК Требуется
	|ИЗ
	|	РегистрНакопления.торо_ПлановыеТрудовыеЗатратыРемонтныхРабот КАК ПлановыеТрудозатраты
	|ГДЕ
	|	ПлановыеТрудозатраты.РемонтыОборудования_ID В(&РемонтыОборудования_ID)
	|	И ПлановыеТрудозатраты.Регистратор В(&ДокументыИсточники)
	|
		|СГРУППИРОВАТЬ ПО
		|	ПлановыеТрудозатраты.Квалификация
	|";
	// гкс- [Релиз16]
	
	Запрос.УстановитьПараметр("РемонтыОборудования_ID", ИДРемонтов);
	
	Если ДокументыИсточники = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПлановыеТрудозатраты.Регистратор В(&ДокументыИсточники)", "Истина");
	Иначе
		Запрос.УстановитьПараметр("ДокументыИсточники", ДокументыИсточники);
	КонецЕсли; 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ТребуемыеТрудовыеЗатраты = Новый Массив;
	Пока Выборка.Следующий() Цикл
		ТребуемыеТрудовыеЗатраты.Добавить(Новый Структура("Квалификация, Требуется", 
															Выборка.Квалификация, Выборка.Требуется));
	КонецЦикла; 
	
	Возврат ТребуемыеТрудовыеЗатраты;

КонецФункции 

&НаКлиенте
&ИзменениеИКонтроль("СвязанныеРемонтыДобавитьСтроку")
Процедура гкс_СвязанныеРемонтыДобавитьСтроку(ВыбранноеЗначение)

	Если Объект.СвязанныеРемонты.НайтиСтроки(Новый Структура("ID",ВыбранноеЗначение.СтрокаРемонтовОборудования.ID)).Количество() = 0 
		И ВыбранноеЗначение.СтрокаРемонтовОборудования.ID <> Объект.IDОсновногоРемонта Тогда

		ДатаНачалаВыбранного = ВыбранноеЗначение.СтрокаРемонтовОборудования.ДатаНачала;
		ДатаОкончанияВыбранного = ВыбранноеЗначение.СтрокаРемонтовОборудования.ДатаОкончания;

		НС                           = Объект.СвязанныеРемонты.Добавить();
		НС.ID                        = ВыбранноеЗначение.СтрокаРемонтовОборудования.ID;
		НС.ОбъектРемонта             = ВыбранноеЗначение.СтрокаРемонтовОборудования.ОбъектРемонта;
		НС.ВидРемонта                = ВыбранноеЗначение.СтрокаРемонтовОборудования.ВидРемонтныхРабот;
		НС.ДатаНачалаРемонта         = ДатаНачалаВыбранного;
		НС.ДатаОкончанияРемонта      = ДатаОкончанияВыбранного;
		НС.ДатаНачалаРемонтаСтарая   = ДатаНачалаВыбранного;
		НС.ДатаОкончанияРемонтаСтарая= ДатаОкончанияВыбранного;
		НС.ДокументИсточник          = ВыбранноеЗначение.ДокументОснование;
		НС.Добавлен                  = Истина;
		НС.Зависимый                 = ВыбранноеЗначение.СтрокаРемонтовОборудования.Зависимый;
		НС.Подчиненный               = ВыбранноеЗначение.СтрокаРемонтовОборудования.Подчиненный;
		НС.Исполнитель               = ВыбранноеЗначение.СтрокаРемонтовОборудования.Исполнитель;
		НС.СпособВыполнения          = ВыбранноеЗначение.СтрокаРемонтовОборудования.СпособВыполнения;
		НС.КритичностьДефекта        = ВыбранноеЗначение.СтрокаРемонтовОборудования.КритичностьДефекта;
		#Вставка
		НС.гкс_ОписаниеРемонта        = ВыбранноеЗначение.СтрокаРемонтовОборудования.ОписаниеРемонта;
		НС.гкс_Статус        = ВыбранноеЗначение.СтрокаРемонтовОборудования.Статус;
		#КонецВставки

		НС.Добавлен                  = Истина;

		Если Объект.ДатаНачалаРемонта > ДатаНачалаВыбранного Или Объект.ДатаОкончанияРемонта < ДатаОкончанияВыбранного Тогда
			ТекстСообщения = НСтр("es='¡La reparación escogida sale por las fronteras del intervalo de la reparación básica!';ru='Выбранный ремонт выходит за границы интервала основного ремонта!';en='The selected repair is outside the basic repair interval!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;

		ОбновитьДоступностьДляРедактирования();
		Модифицированность = Истина;
		#Вставка
		// гкс+ [2021] Куст 
		ЗаполнитьТрудовыеРесурсы();
		#КонецВставки

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура гкс_СвязанныеРемонтыПриОкончанииРедактированияВместо(Элемент, НоваяСтрока, ОтменаРедактирования)
	// Гкс+[TOIR20-189] Селимов 
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если НоваяСтрока И ЗначениеЗаполнено(Элемент.ТекущиеДанные.ID) Тогда
		ОтразитьТребуемыеРесурсыВТаблицеТрудозатрат(Элемент.ТекущиеДанные.ID, Элемент.ТекущиеДанные.ДокументИсточник);		
	КонецЕсли; 	 
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("СвязанныеРемонтыДатаНачалаРемонтаПриИзменении")
Процедура гкс_СвязанныеРемонтыДатаНачалаРемонтаПриИзменении(Элемент)
	ПроставитьПризнакИзмененВТекущейСтроке();
	#Вставка
	// Гкс+[TOIR20-190] Селимов 
	ТекущиеДанные = Элементы.СвязанныеРемонты.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.ID) Тогда
		Продолжительность = ПолучитьПродолжительностьСвязанногоРемонтаИзДокумета(Объект.Ссылка, ТекущиеДанные.ID);
		ТекущиеДанные.ДатаОкончанияРемонта = ТекущиеДанные.ДатаНачалаРемонта + Продолжительность; 
	КонецЕсли; 
	#КонецВставки
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("СвязанныеРемонтыДатаОкончанияРемонтаПриИзменении")
Процедура гкс_СвязанныеРемонтыДатаОкончанияРемонтаПриИзменении(Элемент)
	ПроставитьПризнакИзмененВТекущейСтроке();
	#Вставка
	// Гкс+[TOIR20-190] Селимов 
	ТекущиеДанные = Элементы.СвязанныеРемонты.ТекущиеДанные;
	Продолжительность = ПолучитьПродолжительностьСвязанногоРемонтаИзДокумета(Объект.Ссылка, ТекущиеДанные.ID);
	ТекущиеДанные.ДатаНачалаРемонта = ТекущиеДанные.ДатаОкончанияРемонта - Продолжительность; 
	#КонецВставки
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ТрудовыеРесурсы

// Гкс+[TOIR20-188] Селимов 
&НаКлиенте
Процедура КолонкаДоступноПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы["ТаблицаТрудозатрат"].ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		
		ПараметрыЗаполнения = Новый Структура;
		ПараметрыЗаполнения.Вставить("Дата", Объект.Дата);		
		ПараметрыЗаполнения.Вставить("ВидОперации",
			ПредопределенноеЗначение("Перечисление.гкс_ВидыОперацииВводДанныхПоТрудовымРесурсам.Корректировка"));			
		ПараметрыЗаполнения.Вставить("Организация", Объект.Организация);
		ПараметрыЗаполнения.Вставить("Подразделение", Объект.Подразделение);
		ПараметрыЗаполнения.Вставить("Квалификация", ТекущиеДанные.Квалификация);
		ПараметрыЗаполнения.Вставить("ПериодПланирования", НачалоДня(ЭтаФорма["ТрудовыеРесурсы_ПериодС"]));
		// гкс+ [2021] Куст 
		СекундВМинуте = 60;
		КорректировочноеЗначение = (ТекущиеДанные.Доступно * СекундВМинуте) - ТекущиеДанные.ДоступноИсходное; // гкс- [2021]
		Если КорректировочноеЗначение > 0 Тогда
			ПараметрыЗаполнения.Вставить("ВидДвижения", ПредопределенноеЗначение("Перечисление.гкс_ВидДвижения.Приход"));
			ПараметрыЗаполнения.Вставить("Доступно", КорректировочноеЗначение); 
		Иначе
			ПараметрыЗаполнения.Вставить("ВидДвижения", ПредопределенноеЗначение("Перечисление.гкс_ВидДвижения.Расход"));			
			ПараметрыЗаполнения.Вставить("Доступно", - КорректировочноеЗначение); 
		КонецЕсли; 
		
		СоздатьДокументКорректирвкиТрудовыхРесурсов(ПараметрыЗаполнения);			
		
	КонецЕсли;   
	
КонецПроцедуры // } Гкс- [TOIR20-188] 

&НаСервереБезКонтекста
Процедура СоздатьДокументКорректирвкиТрудовыхРесурсов(ТекущиеДанные)
	
	КорректировкаТР = Документы.гкс_ВводДанныхПоТрудовымРесурсам.СоздатьДокумент();
	КорректировкаТР.Заполнить(ТекущиеДанные);
	КорректировкаТР.Записать(РежимЗаписиДокумента.Проведение);
		
КонецПроцедуры // } Гкс- [TOIR20-188]       

&НаКлиенте
Процедура ТаблицаТрудовыеРесурсыПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ИДРемонтов = Новый Массив;
		Для каждого ТекущаяСтрока Из Объект.СвязанныеРемонты Цикл
			ИДРемонтов.Добавить(ТекущаяСтрока.ID);		
		КонецЦикла; 
		РесурсовДостаточно = ТекущиеДанные.Доступно > ТекущиеДанные.Требуется;
		// гкс+ [2021] Куст 
		Если ЭтотОбъект["гкс_ОтборПоРемонтам"] = Ложь Тогда 
			ВыделитьСвязанныеРемонтыПоКвалификации(ТекущиеДанные.Квалификация, ИДРемонтов, РесурсовДостаточно);
		КонецЕсли; // гкс- [2021] Куст 
	КонецЕсли;    	 	
КонецПроцедуры  
// Гкс-[TOIR20-189]                                             

&НаКлиенте
&ИзменениеИКонтроль("СвязанныеРемонтыПередУдалением")
Процедура гкс_СвязанныеРемонтыПередУдалением(Элемент, Отказ)

	Отказ = Истина;

	ЭтоКорректировка = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.торо_ВидыОперацийДокументаОстановочныйРемонт.Корректировка");

	Для Каждого ВыдСтрока Из Элемент.ВыделенныеСтроки Цикл

		ДанныеСтроки = Элемент.ДанныеСтроки(ВыдСтрока);

		Если НЕ ЗначениеЗаполнено(ДанныеСтроки.ID) 
			ИЛИ ДанныеСтроки.Добавлен Тогда
			Объект.СвязанныеРемонты.Удалить(ДанныеСтроки);
			#Вставка
			// Гкс+[TOIR20-189] Селимов 
			УдалитьДанныеИзТаблицыТрудовыхРесурсов(ДанныеСтроки.ID, ДанныеСтроки.ДокументИсточник);
			#КонецВставки
			Продолжить;
		КонецЕсли;

		НайденныеСтроки = МассивДоступныхДляКорректировкиСтрок.НайтиСтроки(Новый Структура("ID", ДанныеСтроки.ID));

		Если НайденныеСтроки.Количество() > 0 
			И НайденныеСтроки[0].ДоступенДляРедактирования 
			И Не ЭтоКорректировка Тогда

			Объект.СвязанныеРемонты.Удалить(ДанныеСтроки);
			#Вставка
			// Гкс+[TOIR20-189] Селимов 
			УдалитьДанныеИзТаблицыТрудовыхРесурсов(ДанныеСтроки.ID, ДанныеСтроки.ДокументИсточник); 
			#КонецВставки 

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

// Гкс+[TOIR20-188] Селимов
&НаКлиенте
Процедура ПоказатьТаблицуТрудовыхРесурсов(Команда)

	ВидимостьТаблицыТР = Элементы["гкс_ДостпупностьТрудовыхРесурсов"].Видимость;
	
	Элементы["гкс_ДостпупностьТрудовыхРесурсов"].Видимость = Не ВидимостьТаблицыТР;
	Элементы["КомандаПоказатьТаблицуТрудовыхРесурсов"].Пометка = Не ВидимостьТаблицыТР;
	
	Если ВидимостьТаблицыТР = Ложь Тогда
		УдалитьУсловноеОформлениеПоКвалификации();		
	КонецЕсли; 
	
КонецПроцедуры  

// Гкс+[TOIR20-190] Селимов
&НаКлиенте
Процедура УдалитьСвязанныеРемонтыНеВходящиеВПериодОстановочного(Команда)
	
	ДатаНачалаРемонта = Объект.ДатаНачалаРемонта;	
	ДатаОкончанияРемонта = Объект.ДатаОкончанияРемонта;	
	
	СтрокиКУдалению = Новый Массив;
	Для каждого ТекущаяСтрока Из Объект.СвязанныеРемонты Цикл
		Если ТекущаяСтрока.ДатаНачалаРемонта < ДатаНачалаРемонта
			ИЛИ ТекущаяСтрока.ДатаОкончанияРемонта > ДатаОкончанияРемонта Тогда
			СтрокиКУдалению.Добавить(ТекущаяСтрока);
		КонецЕсли; 		
	КонецЦикла; 
	
	Для каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
		Объект.СвязанныеРемонты.Удалить(СтрокаКУдалению);		
	КонецЦикла; 
	
КонецПроцедуры 

// Гкс+[TOIR20-190] Селимов
&НаКлиенте
Процедура ПеренестиВПериодОстановочногоРемонта(Команда)
	
	СтрокиКУдалению = Новый Массив;
	ПродолжительностьОстановочного = Объект.ДатаОкончанияРемонта - Объект.ДатаНачалаРемонта;
	Для каждого ТекущаяСтрока Из Объект.СвязанныеРемонты Цикл
		ПродолжительностьСвязанного = ТекущаяСтрока.ДатаОкончанияРемонта - ТекущаяСтрока.ДатаНачалаРемонта;
		Если ПродолжительностьСвязанного > ПродолжительностьОстановочного Тогда
			СтрокиКУдалению.Добавить(ТекущаяСтрока);
		Иначе
			ТекущаяСтрока.ДатаНачалаРемонта = Объект.ДатаНачалаРемонта;
			ТекущаяСтрока.ДатаОкончанияРемонта = ТекущаяСтрока.ДатаНачалаРемонта + ПродолжительностьСвязанного;
		КонецЕсли; 				
	КонецЦикла; 
	
	Для каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
		Объект.СвязанныеРемонты.Удалить(СтрокаКУдалению);		
	КонецЦикла; 
	
КонецПроцедуры 
 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Гкс+[TOIR20-188] Селимов 
&НаСервере
Процедура ДобавитьЭлементыФормы()
	
	// РЕКВИЗИТЫ
	ТипЧисло = Новый ОписаниеТипов("Число");
	ТипДата = Новый ОписаниеТипов("Дата");
	
	Реквизиты = Новый Массив;

	Реквизиты.Добавить(Новый РеквизитФормы("ТаблицаТрудозатрат", Новый ОписаниеТипов("ТаблицаЗначений")));
	Реквизиты.Добавить(Новый РеквизитФормы("Квалификация", 
		Новый ОписаниеТипов("СправочникСсылка.торо_КвалификацииРемонтногоПерсонала"), "ТаблицаТрудозатрат"));
	Реквизиты.Добавить(Новый РеквизитФормы("Доступно", ТипЧисло, "ТаблицаТрудозатрат"));
	Реквизиты.Добавить(Новый РеквизитФормы("ДоступноИсходное", ТипЧисло, "ТаблицаТрудозатрат"));
	Реквизиты.Добавить(Новый РеквизитФормы("Требуется", ТипЧисло, "ТаблицаТрудозатрат"));
	
	Реквизиты.Добавить(Новый РеквизитФормы("ТрудовыеРесурсы_ПериодС", ТипДата, , , Истина)); 
	Реквизиты.Добавить(Новый РеквизитФормы("ТрудовыеРесурсы_ПериодПо", ТипДата, , , Истина)); 
	// гкс+ [2021] Куст 
	Реквизиты.Добавить(Новый РеквизитФормы("гкс_ТолькоХозспособ", Новый ОписаниеТипов("Булево"))); 
	Реквизиты.Добавить(Новый РеквизитФормы("гкс_ОтборПоРемонтам", Новый ОписаниеТипов("Булево"))); 
	Реквизиты.Добавить(
		Новый РеквизитФормы("гкс_ИзмененИсполнитель", Новый ОписаниеТипов("Булево"),"Объект.СвязанныеРемонты")); 
	// гкс- [2021] Куст 
	
	ИзменитьРеквизиты(Реквизиты);
	
	// ЭЛЕМЕНТЫ	
	// гкс_ДостпупностьТрудовыхРесурсов
	НовыйЭлемент = Элементы.Добавить("гкс_ДостпупностьТрудовыхРесурсов",
						Тип("ГруппаФормы"), Элементы["СтраницаСвязанныеРемонты"]);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь;  	
	Элементы["гкс_ДостпупностьТрудовыхРесурсов"].Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	// гкс_ДостпупностьТрудовыхРесурсовПериод
	НовыйЭлемент = Элементы.Добавить("гкс_ДостпупностьТрудовыхРесурсовПериод", 
						Тип("ГруппаФормы"), Элементы["гкс_ДостпупностьТрудовыхРесурсов"]);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь;  	
	Элементы["гкс_ДостпупностьТрудовыхРесурсовПериод"].Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	#Область ТаблицаТрудовыеРесурсы
	Элементы.СтраницаСвязанныеРемонты.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	ТаблицаТрудовыеРесурсы = Элементы.Добавить("ТаблицаТрудозатрат", 
											   Тип("ТаблицаФормы"), 
											   Элементы["гкс_ДостпупностьТрудовыхРесурсов"]);
	ТаблицаТрудовыеРесурсы.ПутьКДанным = "ТаблицаТрудозатрат";

	ТаблицаТрудовыеРесурсы.ИзменятьСоставСтрок = Ложь;
	ТаблицаТрудовыеРесурсы.ИзменятьПорядокСтрок = Ложь;
	ТаблицаТрудовыеРесурсы.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	ТаблицаТрудовыеРесурсы.УстановитьДействие("ПриАктивизацииСтроки", "ТаблицаТрудовыеРесурсыПриАктивизацииСтроки");
	
	НовыйЭлемент = Элементы.Добавить("КолонкаКвалификация", Тип("ПолеФормы"), ТаблицаТрудовыеРесурсы);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "ТаблицаТрудозатрат.Квалификация";
	НовыйЭлемент.Заголовок = "Квалификация";

	НовыйЭлемент = Элементы.Добавить("КолонкаДоступно", Тип("ПолеФормы"), ТаблицаТрудовыеРесурсы);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ТаблицаТрудозатрат.Доступно";
	// гкс+ [2021] Куст 
	НовыйЭлемент.Заголовок = "Доступно, мин";// гкс- [2021] 
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "КолонкаДоступноПриИзменении");
	
	НовыйЭлемент = Элементы.Добавить("КолонкаДоступноИсходное", Тип("ПолеФормы"), ТаблицаТрудовыеРесурсы);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "ТаблицаТрудозатрат.ДоступноИсходное";
	Элементы["КолонкаДоступноИсходное"].Видимость = Ложь;
	
	НовыйЭлемент = Элементы.Добавить("КолонкаТребуется", Тип("ПолеФормы"), ТаблицаТрудовыеРесурсы);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "ТаблицаТрудозатрат.Требуется";
	// гкс+ [2021] Куст 
	НовыйЭлемент.Заголовок = "Требуется, мин"; // гкс- [2021] 
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
    
	ОтборУО = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборУО.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаТрудозатрат.Требуется");
	ОтборУО.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	ОтборУО.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаТрудозатрат.Доступно");
	    
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТаблицаТрудозатрат");
	    
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоРозовый);
	Элементы["гкс_ДостпупностьТрудовыхРесурсов"].Видимость = Ложь;
	#КонецОбласти 

	НовыйЭлемент = Элементы.Добавить("ТрудовыеРесурсы_ПериодС", Тип("ПолеФормы"), 
									Элементы["гкс_ДостпупностьТрудовыхРесурсовПериод"]);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ТрудовыеРесурсы_ПериодС";
	НовыйЭлемент.Заголовок = "Период";
	НовыйЭлемент.УстановитьДействие("ПриИзменении","ТрудовыеРесурсыпериодПриИзменении");
	
	НовыйЭлемент = Элементы.Добавить("ТрудовыеРесурсы_ПериодПо", Тип("ПолеФормы"), 
									Элементы["гкс_ДостпупностьТрудовыхРесурсовПериод"]);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ТрудовыеРесурсы_ПериодПо";
	НовыйЭлемент.Заголовок = "-";
	НовыйЭлемент.УстановитьДействие("ПриИзменении","ТрудовыеРесурсыпериодПриИзменении"); 
	
	// КОМАНДЫ
	НоваяКоманда = ЭтаФорма.Команды.Добавить("КомандаПоказатьТаблицуТрудовыхРесурсов");
	НоваяКоманда.Действие = "ПоказатьТаблицуТрудовыхРесурсов";
	НоваяКоманда.Заголовок = "Таблица трудовых ресурсов";
	НовыйЭлемент = Элементы.Добавить("КомандаПоказатьТаблицуТрудовыхРесурсов", Тип("КнопкаФормы"), 
										Элементы.СвязанныеРемонты.КоманднаяПанель);
	НовыйЭлемент.ИмяКоманды = "КомандаПоказатьТаблицуТрудовыхРесурсов";
	
	// Гкс+[TOIR20-190] Селимов 
	НоваяКоманда = ЭтаФорма.Команды.Добавить("КомандаПеренестиВПериодОстановочногоРемонта");
	НоваяКоманда.Действие = "ПеренестиВПериодОстановочногоРемонта";
	НоваяКоманда.Заголовок = "Перенести в период";
	НоваяКоманда.Подсказка = "Все связанные ремонты переносятся в период остановочного "
							"ремонта, если они не выходят за его границы. "
							"Если продолжительность связанного ремонта больше продолжительности "
							"остановочного, то связанный ремонт удаляется из таблицы";
	НоваяКоманда.Картинка = БиблиотекаКартинок.Обновить;
	НоваяКоманда.Отображение = ОтображениеКнопки.КартинкаИТекст;
	НовыйЭлемент = Элементы.Добавить("КомандаПеренестиВПериодОстановочногоРемонта", Тип("КнопкаФормы"), 
										Элементы.СвязанныеРемонты.КоманднаяПанель);
	НовыйЭлемент.ИмяКоманды = "КомандаПеренестиВПериодОстановочногоРемонта";
	
	НоваяКоманда = ЭтаФорма.Команды.Добавить("КомандаУдалитьСвязанныеРемонтыНеВходящиеВПериодОстановочного");
	НоваяКоманда.Действие = "УдалитьСвязанныеРемонтыНеВходящиеВПериодОстановочного";
	НоваяКоманда.Заголовок = "Удалить не входящие в период";
	НоваяКоманда.Подсказка = "Удаляет связанные ремонты, период у которых выходит за "
								"границы периода остановочного ремонта";
	НоваяКоманда.Картинка = БиблиотекаКартинок.УдалитьЭлементСписка;
	НоваяКоманда.Отображение = ОтображениеКнопки.КартинкаИТекст;
	НовыйЭлемент = Элементы.Добавить("КомандаУдалитьСвязанныеРемонтыНеВходящиеВПериодОстановочного", Тип("КнопкаФормы"), 
										Элементы.СвязанныеРемонты.КоманднаяПанель);
	НовыйЭлемент.ИмяКоманды = "КомандаУдалитьСвязанныеРемонтыНеВходящиеВПериодОстановочного"; 
	
	// гкс+ [2021] Куст 
	Если Объект.гкс_Сводный Тогда 
		Элементы.ОбъектИВидРемонта.Видимость = Ложь;
		Элементы.ДокументОснование.Видимость = Ложь;
	КонецЕсли;
	НЭлем = Элементы.Добавить("гкс_ТолькоХозспособГруппа", Тип("ГруппаФормы"), Элементы["гкс_ДостпупностьТрудовыхРесурсов"]);
	НЭлем.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НЭлем.ОтображатьЗаголовок = Ложь;
	//        
	ЭтотОбъект["гкс_ТолькоХозспособ"] = Истина;
	НЭлем = Элементы.Добавить("гкс_ТолькоХозспособ", Тип("ПолеФормы"), Элементы["гкс_ТолькоХозспособГруппа"]);
	НЭлем.Вид = ВидПоляФормы.ПолеФлажка;
	НЭлем.ПутьКДанным = "гкс_ТолькоХозспособ";
	НЭлем.Заголовок = НСтр("es='';ru='Только собственными силами';en='only on their own'");
	НЭлем.УстановитьДействие("ПриИзменении", "гкс_ТолькоХозспособПриИзменении");
	//
	НЭлем = Элементы.Добавить("гкс_ОтборПоРемонтам", Тип("ПолеФормы"), Элементы["гкс_ТолькоХозспособГруппа"]);
	НЭлем.Вид = ВидПоляФормы.ПолеФлажка;
	НЭлем.ПутьКДанным = "гкс_ОтборПоРемонтам";
	НЭлем.Заголовок = НСтр("es='';ru='Отбор по ремонтам';en='selection for repairs'");
	НЭлем.УстановитьДействие("ПриИзменении", "гкс_ОтборПоРемонтамПриИзменении");
	//
	НКом = Команды.Добавить("гкс_ОбновитьТрудовыеРесурсы");
	НКом.Действие = "гкс_ОбновитьТрудовыеРесурсы";
	//
	НКноп = Элементы.Добавить("гкс_ОбновитьТрудовыеРесурсыКнопка", Тип("КнопкаФормы"), Элементы["гкс_ТолькоХозспособГруппа"]);
	НКноп.ИмяКоманды = "гкс_ОбновитьТрудовыеРесурсы";
	НКноп.вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НКноп.Заголовок = "Обновить";
	
	НоваяКоманда = Команды.Добавить("гкс_ОбновитьЗаявки");
	НоваяКоманда.Действие = "гкс_ОбновитьЗаявки";
	//
	НоваяКнопка = Элементы.Добавить("гкс_ОбновитьЗаявки", Тип("КнопкаФормы"), Элементы.СвязанныеРемонтыКоманднаяПанель);
	НоваяКнопка.ИмяКоманды = "гкс_ОбновитьЗаявки";
	НоваяКнопка.вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НоваяКнопка.Заголовок = "Обновить заявки";
	
	НовыйЭлемент = Элементы.Вставить("Ремонты_НомерСтроки", Тип("ПолеФормы"),Элементы.СвязанныеРемонты, Элементы.СвязанныеРемонтыОтвязать);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.СвязанныеРемонты.НомерСтроки";
	НовыйЭлемент.Заголовок = "№";
	НовыйЭлемент.Ширина = 3;
	//
	НовыйЭлемент = Элементы.Вставить("Ремонты_ОписаниеРемонта", Тип("ПолеФормы"), Элементы.СвязанныеРемонты, Элементы.СвязанныеРемонтыГруппаДатыТекущие);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.СвязанныеРемонты.гкс_ОписаниеРемонта";
	НовыйЭлемент.Заголовок = НСтр("es='La descripción de la reparación';ru='Описание ремонта';en='Repair description'");
	//
	НовыйЭлемент = Элементы.Вставить("Ремонты_Статус", Тип("ПолеФормы"), Элементы.СвязанныеРемонты, Элементы.СвязанныеРемонтыГруппаДатыТекущие);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.СвязанныеРемонты.гкс_Статус";
	НовыйЭлемент.Заголовок = НСтр("es='status';ru='Статус';en='status'");
	
	
	// гкс+ [] Деснол 16.09.2022
	#Область ПоляПоиска
	Элементы.СтраницаСвязанныеРемонты.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	МассРеквизитов = Новый Массив();
	МассРеквизитов.Добавить(Новый РеквизитФормы("гкс_СтрокаПоиска", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(150))));
	ИзменитьРеквизиты(МассРеквизитов);
	//
	НоваяГруппа = Элементы.Вставить("гкс_ГруппаПоиск", Тип("ГруппаФормы"), Элементы.СтраницаСвязанныеРемонты, Элементы.СвязанныеРемонты);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.отображатьЗаголовок = Ложь;
	//
	НовыйЭлемент = Элементы.Добавить("гкс_СтрокаПоиска", Тип("ПолеФормы"), Элементы["гкс_ГруппаПоиск"]);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "гкс_СтрокаПоиска";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	//
	НКом = Команды.Добавить("гкс_НайтиСтрокуДалее");
	НКом.Действие = "гкс_НайтиСтрокуДалее";
	НКом.Заголовок = "Найти далее";
	//
	НКноп = Элементы.Добавить("гкс_НайтиСтрокуДалееКнопка", Тип("КнопкаФормы"), Элементы["гкс_ГруппаПоиск"]);
	НКноп.ИмяКоманды = "гкс_НайтиСтрокуДалее";
	НКноп.вид = ВидКнопкиФормы.ОбычнаяКнопка;
	#КонецОбласти
	// гкс- [] Деснол 16.09.2022
КонецПроцедуры  


// гкс+ [] Деснол 16.09.2022
&НаКлиенте
Функция гкс_НайденоВСтрокеТЧ(СтрокаТЧ)
	СтрокаСтроки = Строка(СтрокаТЧ.ДокументИсточник) + Строка(СтрокаТЧ.ОбъектРемонта) + Строка(СтрокаТЧ.ВидРемонта)
	+ Строка(СтрокаТЧ.Исполнитель) + Строка(СтрокаТЧ.СпособВыполнения) + Строка(СтрокаТЧ.гкс_ОписаниеРемонта) + Строка(СтрокаТЧ.гкс_Статус);
	
	Если СтрНайти(СтрокаСтроки, ЭтотОбъект["гкс_СтрокаПоиска"]) > 0 Тогда 
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции // гкс- [] Деснол 16.09.2022

// гкс+ [] Деснол 16.09.2022
&НаКлиенте
Процедура гкс_НайтиСтрокуДалее(Команда)
	ТекДанные = Элементы.СвязанныеРемонты.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		НачальныйНомер = 0;
	Иначе
		НачальныйНомер = ТекДанные.НомерСтроки;
	КонецЕсли;
	НайденныйИд = Неопределено;
	Для Каждого СтрокаТЧ из Объект.СвязанныеРемонты Цикл
		Если СтрокаТЧ.НомерСтроки <= НачальныйНомер Тогда 
			Продолжить;
		КонецЕсли;
		Если гкс_НайденоВСтрокеТЧ(СтрокаТЧ) Тогда
			НайденныйИд = СтрокаТЧ.ПолучитьИдентификатор();
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если НайденныйИд = Неопределено Тогда 
		Для Каждого СтрокаТЧ из Объект.СвязанныеРемонты Цикл
			Если СтрокаТЧ.НомерСтроки > НачальныйНомер Тогда 
				Прервать;
			КонецЕсли;
			Если гкс_НайденоВСтрокеТЧ(СтрокаТЧ) Тогда
				НайденныйИд = СтрокаТЧ.ПолучитьИдентификатор();
				Прервать;
			КонецЕсли;                                                
		КонецЦикла;
	КонецЕсли;
	
	Если НайденныйИд = Неопределено Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "поиск не дал результатов";
		Сообщение.Сообщить();
	Иначе
		Элементы.СвязанныеРемонты.ТекущаяСтрока = НайденныйИд;
	КонецЕсли;
КонецПроцедуры // гкс- [] Деснол 16.09.2022

// Гкс+[TOIR20-188] Селимов 
&НаКлиенте
Процедура ЗаполнитьТрудовыеРесурсы()
	
	ЗаполнитьТрудовыеРесурсыНаСервере();
	
	// гкс+ [2021] Куст
	ДокументыИсточники = Новый Массив;
	ИДРемонтов = Новый Массив;
	Если ЭтотОбъект["гкс_ОтборПоРемонтам"] Тогда 
		ТекДанные = Элементы.СвязанныеРемонты.ТекущиеДанные;
		РемонтПодходит = Истина;
		Если ЭтотОбъект["гкс_ТолькоХозспособ"] И ЗначениеЗаполнено(ТекДанные.Исполнитель) Тогда
			РемонтПодходит = гкс_ЭтоСобственныйИсполнитель(ТекДанные.Исполнитель);
		КонецЕсли;
		Если РемонтПодходит Тогда 
			Если Не ТекДанные = Неопределено Тогда 
				ДокументыИсточники.Добавить(ТекДанные.ДокументИсточник);
				ИДРемонтов.Добавить(ТекДанные.ID);
			КонецЕсли;
		КонецЕсли;
	Иначе
		ОтразитьТрудовыеРесурсыНаСервере(ИДРемонтов, ДокументыИсточники);
	КонецЕсли;
	ОтразитьТребуемыеРесурсыВТаблицеТрудозатрат(ИДРемонтов, ДокументыИсточники);
	МассивУдаления = Новый массив();
	Для Каждого СтрокаТаблицы Из ЭтотОбъект["ТаблицаТрудозатрат"] Цикл
		Если СтрокаТаблицы.Требуется <= 0 Тогда 
			МассивУдаления.Добавить(СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
	Для Каждого СтрокаМассива Из МассивУдаления Цикл
		ЭтотОбъект["ТаблицаТрудозатрат"].Удалить(СтрокаМассива);
	КонецЦикла; // гкс- [2021] 
	
КонецПроцедуры	 

// гкс+ [2021] Куст 
&НаКлиенте
Процедура гкс_ОбновитьТрудовыеРесурсы(Команда)
	ЗаполнитьТрудовыеРесурсы();
КонецПроцедуры

// гкс+ [2021] Куст 
&НаСервереБезКонтекста
Функция гкс_ЭтоСобственныйИсполнитель(Ссылка)
	Возврат ТипЗнч(Ссылка) = Тип("СправочникСсылка.СтруктураПредприятия");
КонецФункции

// гкс+ [2021] Куст 
&НаСервере
Процедура ОтразитьТрудовыеРесурсыНаСервере(ИДРемонтов, ДокументыИсточники)
	
	ТипПодразделение = Тип("СправочникСсылка.СтруктураПредприятия");
	Для каждого ТекущаяСтрока Из Объект.СвязанныеРемонты Цикл
		Если ЭтотОбъект["гкс_ТолькоХозспособ"] = Ложь ИЛИ ТипЗнч(ТекущаяСтрока.Исполнитель) = ТипПодразделение
			ИЛИ ЗначениеЗаполнено(ТекущаяСтрока.Исполнитель) = Ложь Тогда 
			ИДРемонтов.Добавить(ТекущаяСтрока.ID);
			ДокументыИсточники.Добавить(ТекущаяСтрока.ДокументИсточник);
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

// гкс+ [2021] Куст 
&НаКлиенте
Процедура гкс_ТолькоХозспособПриИзменении(Элемент)
	ЗаполнитьТрудовыеРесурсы();
КонецПроцедуры

// гкс+ [2021] Куст 
&НаКлиенте
Процедура гкс_ОтборПоРемонтамПриИзменении(Элемент)
	ЗаполнитьТрудовыеРесурсы();
	Если ЭтотОбъект["гкс_ОтборПоРемонтам"] Тогда 
		УдалитьУсловноеОформлениеПоКвалификации();
		Элементы["КолонкаДоступно"].Видимость = Ложь;
	Иначе
		Элементы["КолонкаДоступно"].Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

// Гкс+[TOIR20-188] Селимов 
&НаСервере
Процедура ЗаполнитьТрудовыеРесурсыНаСервере()

	РезультатЗапроса = ДанныеТрудовыхРесурсов(Этаформа["ТрудовыеРесурсы_ПериодС"],
											  Этаформа["ТрудовыеРесурсы_ПериодПо"]);
											  
	ТаблицаТрудозатрат = РезультатЗапроса.Выгрузить();										  
	Для каждого ТекущаяСтрока Из ТаблицаТрудозатрат Цикл
		ТекущаяСтрока.ДоступноИсходное = ТекущаяСтрока.Доступно;		
	КонецЦикла; 
	ЗначениеВРеквизитФормы(ТаблицаТрудозатрат, "ТаблицаТрудозатрат");	
	
КонецПроцедуры 

// Гкс+[TOIR20-188] Селимов 
&НаСервере
Функция ДанныеТрудовыхРесурсов(ПериодПланированияС, ПериодПланированияПо, Квалификация = Неопределено)
	// гкс+ [2021] Куст 13.05.2021
	СекундВМинуте = 60;	// гкс- [2021]
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	гкс_ТрудовыеРесурсыОстатки.Квалификация КАК Квалификация,
		|	ВЫБОР
		|		КОГДА гкс_ТрудовыеРесурсыОстатки.ДоступноОстаток - гкс_ТрудовыеРесурсыОстатки.ЗапланированоОстаток < 0
		|			ТОГДА 0
		|		ИНАЧЕ гкс_ТрудовыеРесурсыОстатки.ДоступноОстаток - гкс_ТрудовыеРесурсыОстатки.ЗапланированоОстаток
		// гкс+ [2021] Куст 
		// теперь в минутах
		|	/ " + СекундВМинуте + "
		// гкс- [2021] Куст 
		|	КОНЕЦ КАК Доступно,
		|	0 КАК Требуется,
		|	0 КАК ДоступноИсходное
		|ИЗ
		|	РегистрНакопления.гкс_ТрудовыеРесурсы.Остатки(
		|			,
		|			ПериодПланирования МЕЖДУ &ПериодС И &ПериодПо
		|				И Квалификация = &Квалификация
		|				И Организация = &Организация
		|				И Подразделение = &Подразделение) КАК гкс_ТрудовыеРесурсыОстатки";
	
	Если Квалификация = Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Квалификация = &Квалификация", "Истина");
	Иначе
		Запрос.УстановитьПараметр("Квалификация", Объект.Квалификация);		
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Организация = &Организация", "Истина");
	Иначе
		Запрос.УстановитьПараметр("Организация", Объект.Организация);		
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Объект.Подразделение) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Подразделение = &Подразделение", "Истина");
	Иначе
		Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);		
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("ПериодС", ПериодПланированияС);
	Запрос.УстановитьПараметр("ПериодПо", ПериодПланированияПо);
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();

	Возврат РезультатЗапроса;
	
КонецФункции 

// Гкс+[TOIR20-189] Селимов 
&НаКлиенте
Функция ОтразитьТребуемыеРесурсыВТаблицеТрудозатрат(ИДРемонтов, 
													ДокументыИсточники, 
													ОбъектРемонта = "", 
													СообщитьОНехваткеРесурса = Ложь)
	КвалификацииСНедостаточнымРесурсов = "";
	ПлановыеТрудозатраты = ПолучитьПлановыеТрудозатраты(ИДРемонтов, ДокументыИсточники);	
	Для каждого ТекущаяСтрока Из ПлановыеТрудозатраты Цикл
		ПараметрыПоиска = Новый Структура("Квалификация", ТекущаяСтрока.Квалификация);
		ПоискСтрок = ЭтаФорма["ТаблицаТрудозатрат"].НайтиСтроки(ПараметрыПоиска);
		Если ПоискСтрок.Количество() > 0 Тогда
			ПоискСтрок[0].Требуется = ПоискСтрок[0].Требуется + ТекущаяСтрока.Требуется;
			Доступно = ПоискСтрок[0].Доступно;
		Иначе
			НоваяСтрока = ЭтаФорма["ТаблицаТрудозатрат"].Добавить();
			НоваяСтрока.Квалификация = ТекущаяСтрока.Квалификация;
			НоваяСтрока.Требуется = ТекущаяСтрока.Требуется;
			Доступно = 0;
		КонецЕсли; 
		Если СообщитьОНехваткеРесурса И 
			Доступно < ТекущаяСтрока.Требуется Тогда
			КвалификацииСНедостаточнымРесурсов = КвалификацииСНедостаточнымРесурсов 
												+ ТекущаяСтрока.Квалификация 
												+ ", доступно:" + Доступно 
												+ ", требуется:" + ТекущаяСтрока.Требуется + ";" + Символы.ПС;
		КонецЕсли; 			
	КонецЦикла;
	
	Если СообщитьОНехваткеРесурса И Не КвалификацииСНедостаточнымРесурсов = "" Тогда
		ТекстСообшения = нСтр("ru='Для выполнения ремонта недостаточно трудовых ресурсов: %1, %2'", "ru");
		ТекстСообшения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообшения,
															ОбъектРемонта,
															КвалификацииСНедостаточнымРесурсов);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообшения);
	КонецЕсли; 
	
КонецФункции 

// Гкс+[TOIR20-189] Селимов 
&НаКлиенте
Процедура УдалитьДанныеИзТаблицыТрудовыхРесурсов(ИДРемонтов, ДокументИсточник)
	
	ПлановыеТрудозатраты = ПолучитьПлановыеТрудозатраты(ИДРемонтов, ДокументИсточник);	
	Для каждого ТекущаяСтрока Из ПлановыеТрудозатраты Цикл
		ПараметрыПоиска = Новый Структура("Квалификация", ТекущаяСтрока.Квалификация);
		ПоискСтрок = ЭтаФорма["ТаблицаТрудозатрат"].НайтиСтроки(ПараметрыПоиска);
		Если ПоискСтрок.Количество() > 0 Тогда
			ПоискСтрок[0].Требуется = ПоискСтрок[0].Требуется - ТекущаяСтрока.Требуется;
			Если ПоискСтрок[0].Требуется = 0 Тогда
				ЭтаФорма["ТаблицаТрудозатрат"].Удалить(ПоискСтрок[0]);					
			КонецЕсли; 
		КонецЕсли; 			
	КонецЦикла;
	
КонецПроцедуры                                   

// Гкс+[TOIR20-189] Селимов 
&НаСервере
Процедура ВыделитьСвязанныеРемонтыПоКвалификации(Квалификация, ИДРемонтов, РесурсовДостаточно)
	
	ИДРемонтовПоКвалификации = ПолучитьИДРемонтовПоКвалификации(Квалификация, ИДРемонтов);
	
	ПоследнийЭлементУО = УсловноеОформление.Элементы.Получить(УсловноеОформление.Элементы.Количество() - 1);
	Если ПоследнийЭлементУО.ИдентификаторПользовательскойНастройки = "ПоКвалификации" Тогда
		УсловноеОформление.Элементы.Удалить(ПоследнийЭлементУО);			
	КонецЕсли; 
	
	НовыйЭлементУО = УсловноеОформление.Элементы.Добавить();
	НовыйЭлементУО.ИдентификаторПользовательскойНастройки = "ПоКвалификации";    
	
	ОтборУО = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборУО.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СвязанныеРемонты.ID");
	ОтборУО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборУО.ПравоеЗначение = ИДРемонтовПоКвалификации;
	    
	ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СвязанныеРемонты");
	
	Если РесурсовДостаточно Тогда
		Цвет = WebЦвета.СветлоЗеленый;
	Иначе
		Цвет = WebЦвета.СветлоРозовый;
	КонецЕсли; 
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Цвет);
	
КонецПроцедуры   

// Гкс+[TOIR20-189] Селимов 
&НаСервереБезКонтекста
Функция ПолучитьИДРемонтовПоКвалификации(Квалификация, ИДРемонтов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПлановыеТрудозатраты.РемонтыОборудования_ID КАК ИД
	|ИЗ
	|	РегистрНакопления.торо_ПлановыеТрудовыеЗатратыРемонтныхРабот.Обороты(
	|			,
	|			,
	|			,
	|			РемонтыОборудования_ID В (&ИДРемонтов)
	|				И Квалификация = &Квалификация) КАК ПлановыеТрудозатраты
	|
	|СГРУППИРОВАТЬ ПО
	|	ПлановыеТрудозатраты.РемонтыОборудования_ID";
	
	Запрос.УстановитьПараметр("ИДРемонтов", ИДРемонтов);
	Запрос.УстановитьПараметр("Квалификация", Квалификация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ИДРемонтовПоКвалификации = Новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
		ИДРемонтовПоКвалификации.Добавить(Выборка.ИД);
	КонецЦикла; 
	
	Возврат ИДРемонтовПоКвалификации;
	
КонецФункции  

// Гкс+[TOIR20-189] Селимов 
&НаСервере
Процедура УдалитьУсловноеОформлениеПоКвалификации()
	
	ПоследнийЭлементУО = УсловноеОформление.Элементы.Получить(УсловноеОформление.Элементы.Количество() - 1);
	Если ПоследнийЭлементУО.ИдентификаторПользовательскойНастройки = "ПоКвалификации" Тогда
		УсловноеОформление.Элементы.Удалить(ПоследнийЭлементУО);			
	КонецЕсли; 
	
КонецПроцедуры  

// Гкс+[TOIR20-190] Селимов 
&НаКлиенте
Процедура ПриИзмененииДатРемонта(ИзмененаДатаНачала, ИзмененаДатаОкончания)
	
	ИсходныеДаты = ПолучитьДатыИзДокумета(Объект.Ссылка);
	
	Если ИсходныеДаты <> Неопределено Тогда
		Сдвиг = 0;
		Если ИзмененаДатаНачала Тогда
			Сдвиг = Объект.ДатаНачалаРемонта - ИсходныеДаты.ДатаНачалаРемонта;
			Объект.ДатаОкончанияРемонта = ИсходныеДаты.ДатаОкончанияРемонта + Сдвиг; 
		КонецЕсли;		
		// гкс+ [2021] Куст 
		Если Объект.гкс_Сводный = Ложь Тогда // гкс- [2021]  
			Если ИзмененаДатаОкончания Тогда
				Сдвиг = Объект.ДатаОкончанияРемонта - ИсходныеДаты.ДатаОкончанияРемонта;
				Объект.ДатаНачалаРемонта = ИсходныеДаты.ДатаНачалаРемонта + Сдвиг; 
			КонецЕсли;		
		// гкс+ [2021] Куст 
		КонецЕсли; // гкс- [2021] 
		ИзменитьДатыВСвязанныхРемонты(Сдвиг);
		
	КонецЕсли; 
	
КонецПроцедуры // } Гкс-[TOIR20-190] 

// Гкс+[TOIR20-190] Селимов 
&НаКлиенте
Процедура ИзменитьДатыВСвязанныхРемонты(Сдвиг)
	// гкс+ [2021] Куст 
	Если Сдвиг = 0 Тогда 
		Возврат;
	КонецЕсли; // гкс- [2021] 
	
	Для каждого ТекущаяСтрока Из Объект.СвязанныеРемонты Цикл
		ТекущаяСтрока.ДатаНачалаРемонта    = ТекущаяСтрока.ДатаНачалаРемонта + Сдвиг;
		ТекущаяСтрока.ДатаОкончанияРемонта = ТекущаяСтрока.ДатаОкончанияРемонта + Сдвиг;
		ТекущаяСтрока.Изменен = Истина;
	КонецЦикла; 		

КонецПроцедуры 

// Гкс+[TOIR20-190] Селимов от 16.12.2020. Добавлено:{
&НаСервереБезКонтекста
Функция ПолучитьДатыИзДокумета(ОбъектСсылка)
	// гкс+ [2021] Куст
	Если ЗначениеЗаполнено(ОбъектСсылка) = Ложь Тогда 
		Возврат Новый Структура("ДатаНачалаРемонта, ДатаОкончанияРемонта", Дата(1,1,1), Дата(1,1,1));
	КонецЕсли; // гкс- [2021]
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОбъектСсылка, "ДатаНачалаРемонта, ДатаОкончанияРемонта");
	
КонецФункции 

// Гкс+[TOIR20-190] Селимов
&НаСервереБезКонтекста
Функция ПолучитьПродолжительностьСвязанногоРемонтаИзДокумета(ОбъектСсылка, ИДРемонта)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РАЗНОСТЬДАТ(СвязанныеРемонты.ДатаНачалаРемонта, СвязанныеРемонты.ДатаОкончанияРемонта, СЕКУНДА) КАК Продолжительность
		|ИЗ
		|	Документ.торо_ОстановочныеРемонты.СвязанныеРемонты КАК СвязанныеРемонты
		|ГДЕ
		|	СвязанныеРемонты.Ссылка = &Ссылка
		|	И СвязанныеРемонты.ID = &ID";
	
	Запрос.УстановитьПараметр("ID", ИДРемонта);
	Запрос.УстановитьПараметр("Ссылка", ОбъектСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.Продолжительность;
	
КонецФункции   

// гкс+ [2021] Куст 
&НаКлиенте
&ИзменениеИКонтроль("ОткрытьФормуДляПодбораЗависимыхРемонтов")
Процедура гкс_ОткрытьФормуДляПодбораЗависимыхРемонтов()

	#Вставка
	Если Объект.гкс_Сводный Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Владелец"             , Объект.Ссылка);
		ПараметрыФормы.Вставить("ДокументИсточник"     , Объект.Ссылка);
		ПараметрыФормы.Вставить("гкс_Сводный"     , Истина);

		ПараметрыФормы.Вставить("ВладелецДата"         , Объект.Дата);
		ПараметрыФормы.Вставить("ЗакрыватьПриВыборе"   , Ложь);
		ПараметрыФормы.Вставить("Заголовок"            , НСтр("es='La selección de las reparaciones dependientes';ru='Подбор зависимых ремонтов';en='Selection of dependent repairs'"));
		ПараметрыФормы.Вставить("IDОстановочного"      , Объект.IDОсновногоРемонта);
		ПараметрыФормы.Вставить("ОР"                   , Объект.ОбъектРемонта);
		ПараметрыФормы.Вставить("ВР"                   , Объект.ВидРемонта);
		ПараметрыФормы.Вставить("ДатаНачалаРемонта"    , Объект.ДатаНачалаРемонта);
		ПараметрыФормы.Вставить("ДатаОкончанияРемонта" , Объект.ДатаОкончанияРемонта);
		
		ОткрытьФорму("Обработка.торо_ПодборРемонтныхРаботОборудования.Форма.ФормаПодбораПоОстановочнымРемонтам",
		ПараметрыФормы, Элементы.СвязанныеРемонты, ЭтаФорма, ВариантОткрытияОкна.ОтдельноеОкно,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ИначеЕсли ЗначениеЗаполнено(Объект.ДокументОснование) И ЗначениеЗаполнено(Объект.ОбъектРемонта) Тогда
	#КонецВставки
	#Удаление
	Если ЗначениеЗаполнено(Объект.ДокументОснование) И ЗначениеЗаполнено(Объект.ОбъектРемонта) Тогда
	#КонецУдаления

		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Владелец"             , Объект.Ссылка);
		ПараметрыФормы.Вставить("ДокументИсточник"     , Объект.Ссылка);

		ПараметрыФормы.Вставить("ВладелецДата"         , Объект.Дата);
		ПараметрыФормы.Вставить("ЗакрыватьПриВыборе"   , Ложь);
		ПараметрыФормы.Вставить("Заголовок"            , НСтр("es='La selección de las reparaciones dependientes';ru='Подбор зависимых ремонтов';en='Selection of dependent repairs'"));
		ПараметрыФормы.Вставить("IDОстановочного"      , Объект.IDОсновногоРемонта);
		ПараметрыФормы.Вставить("ОР"                   , Объект.ОбъектРемонта);
		ПараметрыФормы.Вставить("ВР"                   , Объект.ВидРемонта);
		ПараметрыФормы.Вставить("ДатаНачалаРемонта"    , Объект.ДатаНачалаРемонта);
		ПараметрыФормы.Вставить("ДатаОкончанияРемонта" , Объект.ДатаОкончанияРемонта);


		ДокументыОснования = Новый СписокЗначений;
		Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
			ДокументыОснования.Добавить(Объект.ДокументОснование);
		КонецЕсли;
		Для Каждого Ремонт Из Объект.СвязанныеРемонты Цикл
			Если ДокументыОснования.НайтиПоЗначению(Ремонт.ДокументИсточник) = Неопределено Тогда
				ДокументыОснования.Добавить(Ремонт.ДокументИсточник);
			КонецЕсли;
		КонецЦикла;

		ПараметрыФормы.Вставить("ДокументыОснования", ДокументыОснования);

		ОткрытьФорму("Обработка.торо_ПодборРемонтныхРаботОборудования.Форма.ФормаПодбораПоОстановочнымРемонтам",
		ПараметрыФормы, Элементы.СвязанныеРемонты, ЭтаФорма, ВариантОткрытияОкна.ОтдельноеОкно,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	Иначе
		ТекстСообщения = НСтр("es='la reparación de parada!';ru='Не выбран остановочный ремонт!';en='Stop repair not selected!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,"ДокументОснование","Объект");
	КонецЕсли;

КонецПроцедуры

// гкс+ [2021] Куст 
&НаКлиенте
Процедура гкс_СвязанныеРемонтыПриАктивизацииСтрокиПосле(Элемент)
	Если ЭтотОбъект["гкс_ОтборПоРемонтам"] Тогда 
		ЗаполнитьТрудовыеРесурсы();
	КонецЕсли;
КонецПроцедуры

// гкс+ [2021] Куст 
&НаСервере
Процедура гкс_ИзменитьИсполнителейВОснованиях(Отказ)
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	ТипЗаявка = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт");
	ТипППР = Тип("ДокументСсылка.торо_ПланГрафикРемонта");
	ТипКонтрагент = Тип("СправочникСсылка.Контрагенты");
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЧ.Исполнитель КАК Исполнитель,
	               |	ТЧ.ДокументИсточник КАК ДокументИсточник,
	               |	ТЧ.ID КАК ИД
	               |ПОМЕСТИТЬ Исходные
	               |ИЗ
	               |	&ТЧ1 КАК ТЧ
	               |ГДЕ
	               |	ТЧ.гкс_ИзмененИсполнитель
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Исходные.ДокументИсточник КАК ДокументИсточник,
	               |	Исходные.Исполнитель КАК Исполнитель,
	               |	Исходные.ИД КАК ИД
	               |ИЗ
	               |	Исходные КАК Исходные
	               |ИТОГИ ПО
	               |	ДокументИсточник";
	Запрос.УстановитьПараметр("ТЧ1", Объект.СвязанныеРемонты.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДокумент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	НачатьТранзакцию();
	Попытка
		Пока ВыборкаДокумент.Следующий() Цикл
			Если ТипЗнч(ВыборкаДокумент.ДокументИсточник) = ТипЗаявка Тогда 
				ДокОбъект = ВыборкаДокумент.ДокументИсточник.ПолучитьОбъект();
				НаборЗаписей = РегистрыСведений.торо_ЗаявкиПоРемонтам.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаДокумент.ДокументИсточник);
				НаборЗаписей.Прочитать();
				ЕстьИзменения = Ложь;
				Выборка = ВыборкаДокумент.Выбрать();
				Пока Выборка.Следующий() Цикл
					СтарыйИсполнитель = Неопределено;
					Для Каждого СтрокаТаблицы Из ДокОбъект.ИсполнителиПоРемонтам Цикл
						Если СтрокаТаблицы.РемонтыОборудования_ID = Выборка.ИД Тогда 
							Если Не СтрокаТаблицы.Исполнитель = Выборка.Исполнитель Тогда 
								СтарыйИсполнитель = СтрокаТаблицы.Исполнитель;
								СтрокаТаблицы.Исполнитель = Выборка.Исполнитель;
								ЕстьИзменения = Истина;
							КонецЕсли;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					//
					Если ЗначениеЗаполнено(СтарыйИсполнитель) Тогда 
						Для Каждого СтрокаТаблицы Из ДокОбъект.РемонтныеРаботы Цикл
							Если СтрокаТаблицы.РемонтыОборудования_ID = Выборка.ИД Тогда 
								Если СтрокаТаблицы.Исполнитель = СтарыйИсполнитель Тогда 
									СтрокаТаблицы.Исполнитель = Выборка.Исполнитель;
								КонецЕсли;
								Прервать;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
					//
					Для Каждого СтрокаНабора Из НаборЗаписей Цикл
						Если СтрокаНабора.IDРемонта = Выборка.ИД Тогда 
							СтрокаНабора.Исполнитель = Выборка.Исполнитель;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
				Если ЕстьИзменения Тогда 
					ДокОбъект.БезусловнаяЗапись = Истина;
					ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
					//
					НаборЗаписей.Записать();
				КонецЕсли;
			ИначеЕсли ТипЗнч(ВыборкаДокумент.ДокументИсточник) = ТипППР Тогда 
				ДокОбъект = ВыборкаДокумент.ДокументИсточник.ПолучитьОбъект();
				НаборЗаписей = РегистрыСведений.торо_ПлановыеРемонтныеРаботы.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаДокумент.ДокументИсточник);
				НаборЗаписей.Прочитать();
				ЕстьИзменения = Ложь;
				Выборка = ВыборкаДокумент.Выбрать();
				Пока Выборка.Следующий() Цикл
					ЭтоКонтрагент = ТипКонтрагент = ТипЗнч(Выборка.Исполнитель);
					Для Каждого СтрокаТаблицы Из ДокОбъект.ПланРемонтов Цикл
						Если СтрокаТаблицы.ID = Выборка.ИД Тогда 
							Если Не СтрокаТаблицы.Исполнитель = Выборка.Исполнитель Тогда 
								СтрокаТаблицы.Исполнитель = Выборка.Исполнитель;
								ЕстьИзменения = Истина;
								Если ЭтоКонтрагент Тогда 
									СтрокаТаблицы.СпособВыполнения = Перечисления.СпособыСтроительства.Подрядный;
								Иначе
									СтрокаТаблицы.СпособВыполнения = Перечисления.СпособыСтроительства.Хозспособ;
								КонецЕсли;
							КонецЕсли;
							Прервать;
						КонецЕсли;
						//
						Для Каждого СтрокаНабора Из НаборЗаписей Цикл
							Если СтрокаНабора.ID = Выборка.ИД Тогда 
								СтрокаНабора.Исполнитель = Выборка.Исполнитель;
								Прервать;
								Если ЭтоКонтрагент Тогда 
									СтрокаНабора.СпособВыполнения = Перечисления.СпособыСтроительства.Подрядный;
								Иначе
									СтрокаНабора.СпособВыполнения = Перечисления.СпособыСтроительства.Хозспособ;
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
				Если ЕстьИзменения Тогда 
					ДокОбъект.БезусловнаяЗапись = Истина;
					ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
				//
					НаборЗаписей.Записать();
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Для Каждого СтрокаРемонта Из Объект.СвязанныеРемонты Цикл
			СтрокаРемонта["гкс_ИзмененИсполнитель"] = Ложь;
		КонецЦикла;
	Исключение
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();
		Отказ = Истина;
		ОтменитьТранзакцию();
		Возврат;
	КонецПопытки;
	Если Отказ Тогда 
		ОтменитьТранзакцию();
		Возврат;
	КонецЕсли;
	ЗафиксироватьТранзакцию();
КонецПроцедуры

// гкс+ [2021] Куст 
&НаКлиенте
Процедура гкс_СвязанныеРемонтыИсполнительПриИзмененииПосле(Элемент)
	ТекДанные = Элементы.СвязанныеРемонты.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		ТекДанные["гкс_ИзмененИсполнитель"] = Истина;
	КонецЕсли;
КонецПроцедуры

// гкс+ [2021] Куст 
&НаКлиенте
&ИзменениеИКонтроль("СвязанныеРемонтыВыбор")
Процедура гкс_СвязанныеРемонтыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	#Вставка
	Если Поле.Имя = "СвязанныеРемонтыИсполнитель" Тогда 
		ДанныеСтроки = Элемент.ДанныеСтроки(ВыбраннаяСтрока);
		МассивТипов = Новый Массив();
		МассивТипов.Добавить(Тип("СправочникСсылка.Контрагенты"));
		МассивТипов.Добавить(Тип("СправочникСсылка.СтруктураПредприятия"));
		ТипИсполнитель = Новый ОписаниеТипов(МассивТипов);
		ОписаниеОп = Новый ОписаниеОповещения("гкс_ПослеВыбораИсполнителя", ЭтотОбъект);
		ПоказатьВводЗначения(ОписаниеОп, ДанныеСтроки.Исполнитель,, ТипИсполнитель);
		Возврат;
	КонецЕсли;
	#КонецВставки

	Если Поле.Имя <> "СвязанныеРемонтыОтвязать" И Поле.Имя <> "СвязанныеРемонтыДатаНачалаРемонта" И Поле.Имя <> "СвязанныеРемонтыДатаОкончанияРемонта" Тогда
		ДанныеСтроки = Элемент.ДанныеСтроки(ВыбраннаяСтрока);
		ОткрытьДокументСРемонтом(ДанныеСтроки.ДокументИсточник, ДанныеСтроки.ID);
	КонецЕсли;

КонецПроцедуры

// гкс+ [2021] Куст 
&НаКлиенте
Процедура гкс_ПослеВыбораИсполнителя(Результат, ДопПараметры)Экспорт
	Если Не Результат = Неопределено Тогда 
		ТекДанные = Элементы.СвязанныеРемонты.ТекущиеДанные;
		Если Не ТекДанные = Неопределено Тогда 
			ТекДанные.Исполнитель = Результат;
			ТекДанные["гкс_ИзмененИсполнитель"] = Истина;
			ТекДанные.СпособВыполнения = гкс_ПолучитьСпособВыполненияИсполнителя(Результат);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// гкс+ [2021] Куст 
&НаСервереБезКонтекста
Функция гкс_ПолучитьСпособВыполненияИсполнителя(Ссылка)
	Если ЗначениеЗаполнено(Ссылка) И ТипЗнч(Ссылка) = Тип("СправочникСсылка.Контрагенты") Тогда 
		Возврат Перечисления.СпособыСтроительства.Подрядный;
	Иначе
		Возврат Перечисления.СпособыСтроительства.Хозспособ;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура гкс_ОбновитьЗаявки(Команда)
	гкс_ОбновитьЗаявкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура гкс_ОбновитьЗаявкиНаСервере()
	МассивИД = Новый Массив();
	Для Каждого СтрокаТаблицы Из Объект.СвязанныеРемонты Цикл
		МассивИД.Добавить(СтрокаТаблицы.ID);
	КонецЦикла;
//
	Запрос = Новый Запрос();
		# Область ТекстЗапроса
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
|	РегистрСведенийторо_РемонтыСрезПоследних.ID КАК ID,
|	РегистрСведенийторо_РемонтыСрезПоследних.ОбъектРемонта КАК ОбъектРемонта,
|	РегистрСведенийторо_РемонтыСрезПоследних.ВидРемонта КАК ВидРемонта,
|	РегистрСведенийторо_РемонтыСрезПоследних.Регистратор КАК Регистратор
|ПОМЕСТИТЬ ВсеРемонты
|ИЗ
|	РегистрСведений.торо_Ремонты.СрезПоследних(
|			,
|			ТИПЗНАЧЕНИЯ(Регистратор) = ТИП(Документ.торо_ЗаявкаНаРемонт)
|				И ID В (&МассивИД)) КАК РегистрСведенийторо_РемонтыСрезПоследних
|
|ИНДЕКСИРОВАТЬ ПО
|	Регистратор
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	Документторо_ЗаявкаНаРемонтИсполнителиПоРемонтам.Исполнитель КАК Исполнитель,
|	Документторо_ЗаявкаНаРемонтИсполнителиПоРемонтам.НомерСтроки КАК НомерСтроки,
|	ВсеРемонты.ID КАК ИД,
|	ВсеРемонты.Регистратор КАК Регистратор
|ПОМЕСТИТЬ ВсеИсполнители
|ИЗ
|	ВсеРемонты КАК ВсеРемонты
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.ИсполнителиПоРемонтам КАК Документторо_ЗаявкаНаРемонтИсполнителиПоРемонтам
|		ПО (Документторо_ЗаявкаНаРемонтИсполнителиПоРемонтам.Ссылка = ВсеРемонты.Регистратор)
|			И (Документторо_ЗаявкаНаРемонтИсполнителиПоРемонтам.РемонтыОборудования_ID = ВсеРемонты.ID)
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВсеИсполнители.ИД КАК ИД,
|	ВсеИсполнители.Регистратор КАК Регистратор,
|	МИНИМУМ(ВсеИсполнители.НомерСтроки) КАК НомерСтроки
|ПОМЕСТИТЬ ПервыеСтрокиИсполнителей
|ИЗ
|	ВсеИсполнители КАК ВсеИсполнители
|
|СГРУППИРОВАТЬ ПО
|	ВсеИсполнители.ИД,
|	ВсеИсполнители.Регистратор
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВсеИсполнители.ИД КАК ИД,
|	ВсеИсполнители.Регистратор КАК Регистратор,
|	ВсеИсполнители.Исполнитель КАК Исполнитель
|ПОМЕСТИТЬ ТЧ_Исполнители
|ИЗ
|	ВсеИсполнители КАК ВсеИсполнители
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПервыеСтрокиИсполнителей КАК ПервыеСтрокиИсполнителей
|		ПО ВсеИсполнители.ИД = ПервыеСтрокиИсполнителей.ИД
|			И ВсеИсполнители.НомерСтроки = ПервыеСтрокиИсполнителей.НомерСтроки
|			И ВсеИсполнители.Регистратор = ПервыеСтрокиИсполнителей.Регистратор
|;
|
|////////////////////////////////////////////////////////////////////////////////
|УНИЧТОЖИТЬ ВсеИсполнители
|;
|
|////////////////////////////////////////////////////////////////////////////////
|УНИЧТОЖИТЬ ПервыеСтрокиИсполнителей
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	РегистрСведенийторо_ПлановыеРемонтныеРаботыСрезПоследних.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
|	РегистрСведенийторо_ПлановыеРемонтныеРаботыСрезПоследних.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
|	РегистрСведенийторо_ПлановыеРемонтныеРаботыСрезПоследних.ID КАК ID,
|	РегистрСведенийторо_ПлановыеРемонтныеРаботыСрезПоследних.Регистратор КАК Регистратор,
|	РегистрСведенийторо_ПлановыеРемонтныеРаботыСрезПоследних.СпособВыполнения КАК СпособВыполнения,
|	РегистрСведенийторо_ПлановыеРемонтныеРаботыСрезПоследних.Исполнитель КАК Исполнитель
|ПОМЕСТИТЬ ПлановыеРемонты
|ИЗ
|	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(
|			,
|			(ТИПЗНАЧЕНИЯ(Регистратор) = ТИП(Документ.торо_ПланГрафикРемонта)
|				ИЛИ ТИПЗНАЧЕНИЯ(Регистратор) = ТИП(Документ.торо_ЗакрытиеЗаявокИРемонтов))
|				И ID В (&МассивИД)) КАК РегистрСведенийторо_ПлановыеРемонтныеРаботыСрезПоследних
|
|ИНДЕКСИРОВАТЬ ПО
|	ID
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ПлановыеРемонты.ID КАК ID,
|	ПлановыеРемонты.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
|	ПлановыеРемонты.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
|	ПлановыеРемонты.Регистратор КАК Регистратор,
|	ПлановыеРемонты.СпособВыполнения КАК СпособВыполнения,
|	ПлановыеРемонты.Исполнитель КАК Исполнитель
|ПОМЕСТИТЬ ВсеНезавершенные
|ИЗ
|	ПлановыеРемонты КАК ПлановыеРемонты
|		ЛЕВОЕ СОЕДИНЕНИЕ ВсеРемонты КАК РемонтыЗаявокБезОтмененных
|		ПО ПлановыеРемонты.ID = РемонтыЗаявокБезОтмененных.ID
|ГДЕ
|	РемонтыЗаявокБезОтмененных.ID ЕСТЬ NULL
|
|ОБЪЕДИНИТЬ ВСЕ
|
|ВЫБРАТЬ
|	РемонтыЗаявокБезОтмененных.ID,
|	РемонтыЗаявокБезОтмененных.ОбъектРемонта,
|	РемонтыЗаявокБезОтмененных.ВидРемонта,
|	РемонтыЗаявокБезОтмененных.Регистратор,
|	ВЫБОР
|		КОГДА НЕ ТЧ_Исполнители.Исполнитель ЕСТЬ NULL
|				И ТЧ_Исполнители.Исполнитель ССЫЛКА Справочник.Контрагенты
|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный)
|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.ХозСпособ)
|	КОНЕЦ,
|	ТЧ_Исполнители.Исполнитель
|ИЗ
|	ВсеРемонты КАК РемонтыЗаявокБезОтмененных
|		ЛЕВОЕ СОЕДИНЕНИЕ ТЧ_Исполнители КАК ТЧ_Исполнители
|		ПО (ТЧ_Исполнители.ИД = РемонтыЗаявокБезОтмененных.ID)
|			И РемонтыЗаявокБезОтмененных.Регистратор = ТЧ_Исполнители.Регистратор
|
|ИНДЕКСИРОВАТЬ ПО
|	ID
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВсеНезавершенные.ID КАК ID,
|	ВсеНезавершенные.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
|	ВсеНезавершенные.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
|	ЕСТЬNULL(торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаНачалаРемонтныхРабот,
|	ЕСТЬNULL(торо_АктуальныеПлановыеДатыРемонтов.ДатаОкончания, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОкончанияРемонтныхРабот,
|	ВсеНезавершенные.Регистратор КАК Регистратор,
|	ВсеНезавершенные.СпособВыполнения КАК СпособВыполнения,
|	ВсеНезавершенные.Исполнитель КАК Исполнитель
|ПОМЕСТИТЬ ИтоговаяТаблицаДоОтборовПоЗависимымИДатам
|ИЗ
|	ВсеНезавершенные КАК ВсеНезавершенные
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК торо_АктуальныеПлановыеДатыРемонтов
|		ПО ВсеНезавершенные.ID = торо_АктуальныеПлановыеДатыРемонтов.IDРемонта
|
|ИНДЕКСИРОВАТЬ ПО
|	ОбъектРемонтныхРабот
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗРЕШЕННЫЕ
|	торо_ВыявленныеДефектыСрезПоследних.ID КАК ID,
|	торо_ВыявленныеДефектыСрезПоследних.КритичностьДефекта КАК КритичностьДефекта
|ПОМЕСТИТЬ ВТ_Критичности
|ИЗ
|	РегистрСведений.торо_ВыявленныеДефекты.СрезПоследних(
|			,
|			ID В
|				(ВЫБРАТЬ
|					ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.ID КАК ID
|				ИЗ
|					ИтоговаяТаблицаДоОтборовПоЗависимымИДатам КАК ИтоговаяТаблицаДоОтборовПоЗависимымИДатам)) КАК торо_ВыявленныеДефектыСрезПоследних
|
|ИНДЕКСИРОВАТЬ ПО
|	ID
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗРЕШЕННЫЕ
|	РемонтыОборудования.ID КАК ID,
|	РемонтыОборудования.КритичностьДефекта КАК КритичностьДефекта,
|	РемонтыОборудования.ОписаниеРемонта КАК ОписаниеРемонта,
|	РемонтыОборудования.Ссылка КАК Ссылка
|ПОМЕСТИТЬ ВТ_Критичности2
|ИЗ
|	Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК РемонтыОборудования
|ГДЕ
|	РемонтыОборудования.Ссылка.Проведен
|	И РемонтыОборудования.ID В
|			(ВЫБРАТЬ
|				ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.ID КАК ID
|			ИЗ
|				ИтоговаяТаблицаДоОтборовПоЗависимымИДатам КАК ИтоговаяТаблицаДоОтборовПоЗависимымИДатам)
|
|ИНДЕКСИРОВАТЬ ПО
|	ID
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.Регистратор КАК Регистратор,
|	торо_ТекущиеСтатусыСогласованияДокументов.СтатусДокумента КАК Статус
|ПОМЕСТИТЬ ВТ_Статусы
|ИЗ
|	ИтоговаяТаблицаДоОтборовПоЗависимымИДатам КАК ИтоговаяТаблицаДоОтборовПоЗависимымИДатам
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ТекущиеСтатусыСогласованияДокументов КАК торо_ТекущиеСтатусыСогласованияДокументов
|		ПО (торо_ТекущиеСтатусыСогласованияДокументов.СогласуемыйДокумент = ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.Регистратор)
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗРЕШЕННЫЕ
|	ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.ID КАК ИД,
|	ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.ОбъектРемонтныхРабот КАК ОР,
|	ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.ВидРемонтныхРабот КАК ВР,
|	ДОБАВИТЬКДАТЕ(ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.ДатаНачалаРемонтныхРабот, ЧАС, &Сдвиг) КАК ДатаНачала,
|	ДОБАВИТЬКДАТЕ(ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.ДатаОкончанияРемонтныхРабот, ЧАС, &Сдвиг) КАК ДатаОкончания,
|	ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.Регистратор КАК ДокументОснование,
|	ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.СпособВыполнения КАК СпособВыполнения,
|	ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.Исполнитель КАК Исполнитель,
|	ЕСТЬNULL(ВТ_Критичности2.КритичностьДефекта, ЕСТЬNULL(ВТ_Критичности.КритичностьДефекта,
|	ЗНАЧЕНИЕ(Справочник.торо_КритичностьДефекта.ПустаяСсылка))) КАК КритичностьДефекта,
|	ВТ_Критичности2.ОписаниеРемонта КАК ОписаниеРемонта,
|	ВТ_Статусы.Статус КАК Статус
|ИЗ
|	ИтоговаяТаблицаДоОтборовПоЗависимымИДатам КАК ИтоговаяТаблицаДоОтборовПоЗависимымИДатам
|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Критичности КАК ВТ_Критичности
|		ПО ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.ID = ВТ_Критичности.ID
|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Критичности2 КАК ВТ_Критичности2
|		ПО ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.ID = ВТ_Критичности2.ID
|			И ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.Регистратор = ВТ_Критичности2.Ссылка
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Статусы КАК ВТ_Статусы
|		ПО (ВТ_Статусы.Регистратор = ИтоговаяТаблицаДоОтборовПоЗависимымИДатам.Регистратор)";
	# КонецОбласти

	Запрос.УстановитьПараметр("МассивИД", МассивИД);
	Сдвиг = Час(ТекущаяДатаСеанса()) - Час(ТекущаяДата());
	Запрос.УстановитьПараметр("Сдвиг", Сдвиг);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() = Ложь Тогда 
		Выборка = РезультатЗапроса.Выбрать();
		Для Каждого СтрокаТаблицы Из Объект.СвязанныеРемонты Цикл
			Выборка.Сбросить();
			Если Выборка.НайтиСледующий(Новый Структура("ИД", СтрокаТаблицы.ID)) Тогда 
				СтрокаТаблицы.ОбъектРемонта = Выборка.ОР;
				СтрокаТаблицы.ВидРемонта = Выборка.ВР;
				СтрокаТаблицы.Исполнитель = Выборка.Исполнитель;
				СтрокаТаблицы.СпособВыполнения = Выборка.СпособВыполнения;
				СтрокаТаблицы.КритичностьДефекта = Выборка.КритичностьДефекта;
				СтрокаТаблицы.гкс_ОписаниеРемонта = Выборка.ОписаниеРемонта;
				СтрокаТаблицы.гкс_Статус = Выборка.Статус;
				СтрокаТаблицы.ДатаНачалаРемонтаСтарая = Выборка.ДатаНачала;
				СтрокаТаблицы.ДатаОкончанияРемонтаСтарая = Выборка.ДатаОкончания;

			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры


#КонецОбласти
