#Область ЗапросыКДокументообороту

&ИзменениеИКонтроль("СоздатьОбъектДОПоПравилу")
Функция гкс_СоздатьОбъектДОПоПравилу(ОбъектИС, Правило)

	#Удаление
	Прокси = ИнтеграцияС1СДокументооборотПовтИсп.ПолучитьПрокси();
	#КонецУдаления
	#Вставка
	Прокси = ИнтеграцияС1СДокументооборот.ПолучитьПрокси(Истина, , , Истина);
	#КонецВставки
	ОбъектДОИлиСообщение = ИнтеграцияС1СДокументооборот.СоздатьОбъектДОПоПравилу(
	Прокси, ОбъектИС, Правило);

	Если ТипЗнч(ОбъектДОИлиСообщение) = Тип("Строка") Тогда
		Возврат ОбъектДОИлиСообщение;
	КонецЕсли;

	Результат = Новый Структура;
	Результат.Вставить("name", ОбъектДОИлиСообщение.name);
	Результат.Вставить("id", ОбъектДОИлиСообщение.objectId.id);
	Результат.Вставить("type", ОбъектДОИлиСообщение.objectId.type);

	Возврат Результат;

КонецФункции

#КонецОбласти

#Область ПроцессыИЗадачи

&ИзменениеИКонтроль("ПолучитьЗадачиСогласования")
Функция гкс_ПолучитьЗадачиСогласования(Знач ПредметДО)

	Результат = Новый Массив;

	// Выберем активные задачи пользователя, потребовав указать их тип.
	Прокси = ИнтеграцияС1СДокументооборотПовтИсп.ПолучитьПрокси();
	Запрос = ИнтеграцияС1СДокументооборот.СоздатьОбъект(Прокси, "DMGetObjectListRequest");
	Запрос.type = "DMBusinessProcessApprovalTaskApproval";
	Запрос.query = ИнтеграцияС1СДокументооборот.СоздатьОбъект(Прокси, "DMObjectListQuery");

	Условие = ИнтеграцияС1СДокументооборот.СоздатьОбъект(Прокси, "DMObjectListCondition");
	Условие.property = "target";
	Условие.value = ИнтеграцияС1СДокументооборот.СоздатьObjectID(Прокси, 
	ПредметДО.id, ПредметДО.type);
	Запрос.query.conditions.Добавить(Условие);

	Условие = ИнтеграцияС1СДокументооборот.СоздатьОбъект(Прокси, "DMObjectListCondition");
	Условие.property = "byUser";
	Условие.value = Истина;
	Запрос.query.conditions.Добавить(Условие);
	#Вставка
	Условие = ИнтеграцияС1СДокументооборот.СоздатьОбъект(Прокси, "DMObjectListCondition");
	Условие.property = "byUserName";
	Условие.value = гкс_Интеграция1СДокументооборотПовтИсп.ПолучитьИмяПользователяИБ();
	Запрос.query.conditions.Добавить(Условие);
	#КонецВставки

	Условие = ИнтеграцияС1СДокументооборот.СоздатьОбъект(Прокси, "DMObjectListCondition");
	Условие.property = "typed";
	Условие.value = Истина;
	Запрос.query.conditions.Добавить(Условие);

	Условие = ИнтеграцияС1СДокументооборот.СоздатьОбъект(Прокси, "DMObjectListCondition");
	Условие.property = "withExecuted";
	Условие.value = Ложь;
	Запрос.query.conditions.Добавить(Условие);

	Условие = ИнтеграцияС1СДокументооборот.СоздатьОбъект(Прокси, "DMObjectListCondition");
	Условие.property = "withDelayed";
	Условие.value = Ложь;
	Запрос.query.conditions.Добавить(Условие);

	Ответ = Прокси.execute(Запрос);
	ИнтеграцияС1СДокументооборот.ПроверитьВозвратВебСервиса(Прокси, Ответ);

	// Отберем полученные задачи по типу "Согласование".
	Для каждого Элемент из Ответ.items Цикл
		Задача = Элемент.object;
		Если ИнтеграцияС1СДокументооборот.ПроверитьТип(Прокси, Задача, 
			"DMBusinessProcessApprovalTaskApproval") Тогда
			Результат.Добавить(Задача.objectId.id);
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

#КонецОбласти