#Область ОбработчикиСобытийЭлементовТаблицыФормыСоставНаправления
&НаКлиенте
Процедура СоставНаправленияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	НайденныеСтроки = СоставНаправления.НайтиСтроки(Новый Структура("Направление", ВыбранноеЗначение));
	Если НайденныеСтроки.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	НС = СоставНаправления.Добавить();	
	НС.Направление = ВыбранноеЗначение;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставНаправленияПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если НЕ ОтменаРедактирования Тогда
		ТекДанные = Элементы.СоставНаправления.ТекущиеДанные;
		НайденныеСтроки = СоставНаправления.НайтиСтроки(Новый Структура("Направление", ТекДанные.Направление));
		Дубль = Ложь;
		ИдТекСтроки = ТекДанные.ПолучитьИдентификатор();
		Для каждого НайденаяСтрока из НайденныеСтроки Цикл
			Если НайденаяСтрока.ПолучитьИдентификатор() <> ИдТекСтроки Тогда
				Дубль = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если Дубль > 0 Тогда
			ТекстСообщения = НСтр("es='Esta dirección es añadida ya';ru='Это направление уже добавлено';en='This direction has already been added.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СложитьИзНаименований(Команда)
	Наименование = "";
	Первый = Истина;
	
	Для каждого СтрНаправление Из СоставНаправления Цикл
		Если Найти(Строка(СтрНаправление.Направление), " ") = 0 Тогда
			
			ПервоеСлово = Строка(СтрНаправление.Направление);
			
		Иначе
			
			ПервоеСлово = Лев(Строка(СтрНаправление.Направление), Найти(Строка(СтрНаправление.Направление), " " ));
			
		КонецЕсли;	
		
		Наименование = ?(Первый = Истина, ПервоеСлово, Наименование + "_" + ПервоеСлово);
		
		Первый = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДатаИВремяСоздания(Команда)
	Наименование = "Составлено " + Строка(ТекущаяДата());
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	
	НомерСтроки = 1;
	СписокНаправлений = Новый СписокЗначений;
	Для каждого Стр Из СоставНаправления Цикл
		Если НЕ ЗначениеЗаполнено(Стр.Направление) Тогда
			ШаблонСообщения = НСтр("es='En la línea %1 no es rellenada la dirección';ru='В строке %1 не заполнено направление';en='Direction in line%1 is not filled'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, НомерСтроки);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		СписокНаправлений.Добавить(Стр.Направление);	
	   НомерСтроки = НомерСтроки + 1;
	КонецЦикла; 
	
	ПараметрыОткрытия = Новый Структура("Наименование,СписокНаправлений",Наименование,СписокНаправлений);
	ОткрытьФорму("Справочник.торо_НаправленияОбъектовРемонтныхРабот.Форма.ФормаЭлемента",ПараметрыОткрытия);
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ФормаНаправлений = ПолучитьФорму("Справочник.торо_НаправленияОбъектовРемонтныхРабот.ФормаВыбора", , Элементы.СоставНаправления);
	
	ФормаНаправлений.ЗакрыватьПриВыборе = ЛОЖЬ;
	
	ФормаНаправлений.Открыть();
	
КонецПроцедуры
#КонецОбласти






















