#Область СлужебныеПроцедурыИФункции

Функция ПроверитьВозможностьИзмененияСтатусаДефекта(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ЗаявкаНаРемонт.Ссылка КАК Заявка,
		|	торо_АктОВыполненииЭтапаРаботДокументыОснования.Ссылка КАК Акт
		|ПОМЕСТИТЬ ЗаявкаСФлагом
		|ИЗ
		|	Документ.торо_АктОВыполненииЭтапаРабот.ДокументыОснования КАК торо_АктОВыполненииЭтапаРаботДокументыОснования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт КАК торо_ЗаявкаНаРемонт
		|		ПО (торо_АктОВыполненииЭтапаРаботДокументыОснования.Ссылка = &Ссылка)
		|			И торо_АктОВыполненииЭтапаРаботДокументыОснования.ДокументОснование = торо_ЗаявкаНаРемонт.Ссылка
		|			И (торо_ЗаявкаНаРемонт.гкс_НуженИспытание = ""ДА"")
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_ЗаявкаНаРемонт.Ссылка,
		|	торо_АктОВыполненииЭтапаРаботДокументыОснования.Ссылка
		|ИЗ
		|	Документ.торо_АктОВыполненииЭтапаРабот.ДокументыОснования КАК торо_АктОВыполненииЭтапаРаботДокументыОснования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_НарядНаВыполнениеРемонтныхРабот.ДокументыОснования КАК торо_НарядНаВыполнениеРемонтныхРаботДокументыОснования
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт КАК торо_ЗаявкаНаРемонт
		|			ПО (торо_ЗаявкаНаРемонт.гкс_НуженИспытание = ""ДА"")
		|				И торо_НарядНаВыполнениеРемонтныхРаботДокументыОснования.ДокументОснование = торо_ЗаявкаНаРемонт.Ссылка
		|		ПО (торо_АктОВыполненииЭтапаРаботДокументыОснования.Ссылка = &Ссылка)
		|			И торо_АктОВыполненииЭтапаРаботДокументыОснования.ДокументОснование = торо_НарядНаВыполнениеРемонтныхРаботДокументыОснования.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаявкаСФлагом.Заявка КАК Заявка,
		|	ЗаявкаСФлагом.Акт КАК Акт,
		// Гкс+[TOIR20-558] Вялых Д.А. от 06.03.2025. Добавлено:{
		|	торо_ЗаявкаНаРемонтДокументыОснования.ДокументОснование КАК Дефект
		//|	торо_ВыявленныеДефекты.Ссылка КАК Дефект 
		// } Гкс-[TOIR20-558] Вялых Д.А. от 05.03.2025.
		|ПОМЕСТИТЬ ВсяЦепочка
		|ИЗ
		|	ЗаявкаСФлагом КАК ЗаявкаСФлагом
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.ДокументыОснования КАК торо_ЗаявкаНаРемонтДокументыОснования
		// Гкс+[TOIR20-558] Вялых Д.А. от 06.03.2025. Добавлено:{
		//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефекты
		//|			ПО торо_ЗаявкаНаРемонтДокументыОснования.ДокументОснование = торо_ВыявленныеДефекты.Ссылка
		// } Гкс-[TOIR20-558] Вялых Д.А. от 05.03.2025.
		|		ПО ЗаявкаСФлагом.Заявка = торо_ЗаявкаНаРемонтДокументыОснования.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ЕСТЬNULL(торо_АктПриемкиОборудованияДокументыОснования.Ссылка.Проведен, ЛОЖЬ)) КАК АктПроведен
		|ИЗ
		|	ВсяЦепочка КАК ВсяЦепочка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_АктПриемкиОборудования.ДокументыОснования КАК торо_АктПриемкиОборудованияДокументыОснования
		|		ПО (ВсяЦепочка.Заявка = торо_АктПриемкиОборудованияДокументыОснования.ДокументОснование
		|				ИЛИ ВсяЦепочка.Акт = торо_АктПриемкиОборудованияДокументыОснования.ДокументОснование
		|				ИЛИ ВсяЦепочка.Дефект = торо_АктПриемкиОборудованияДокументыОснования.ДокументОснование)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() = Ложь Тогда 
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() И Выборка.АктПроведен = Ложь Тогда 
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции 

&ИзменениеИКонтроль("ПолучитьТаблицуУстанавливаемыхСтатусовПоСсылке")
Функция Расш_гкс_ПолучитьТаблицуУстанавливаемыхСтатусовПоСсылке(Регистратор, ДокументыОснования)

	ТипДокументаСтрока = ПолучитьТипДокументаКакСтроку(Регистратор);
	
	#Удаление
	Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.торо_АктОВыполненииЭтапаРабот")
		ИЛИ ТипЗнч(Регистратор) = ТИП("ДокументСсылка.торо_АктОВыполненииРегламентногоМероприятия") Тогда
	#КонецУдаления
	#Вставка
	НужноПодменитьСтатус = Ложь;
	Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.торо_АктОВыполненииЭтапаРабот") Тогда 
		Если ПроверитьВозможностьИзмененияСтатусаДефекта(Регистратор) Тогда 
			ЗавершитьРемонтныеРаботы = Регистратор.ЗавершитьРемонтныеРаботы;
		Иначе
			ЗавершитьРемонтныеРаботы = Ложь;
			НужноПодменитьСтатус = Истина;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Регистратор) = ТИП("ДокументСсылка.торо_АктОВыполненииРегламентногоМероприятия") Тогда
	#КонецВставки
		ЗавершитьРемонтныеРаботы = Регистратор.ЗавершитьРемонтныеРаботы;
	Иначе
		ЗавершитьРемонтныеРаботы = Ложь;
	КонецЕсли;

	ТаблицаУстанавливаемыхСтатусов = торо_РаботаСоСтатусамиДокументовПовтИсп.ПолучитьТаблицуУстанавливаемыхСтатусов(ТипДокументаСтрока, ДокументыОснования, ЗавершитьРемонтныеРаботы);
	#Вставка
	// Гкс+[TOIR20-558] Вялых Д.А. от 06.03.2025. Закоментировано:{
	//Если НужноПодменитьСтатус = Истина Тогда 
		//Для Каждого СтрокаТаблицы Из ТаблицаУстанавливаемыхСтатусов Цикл
		//	Если (СтрокаТаблицы.УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.Устраняется
		//		И СтрокаТаблицы.ТипДокумента = Документы.торо_ВыявленныеДефекты.ПустаяСсылка())
		//		Тогда 
		//		СтрокаТаблицы.УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.гкс_ВыполненНеобходимАктПриемки;
		//	ИначеЕсли (СтрокаТаблицы.УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.Выполняется
		//		И СтрокаТаблицы.ТипДокумента = Документы.торо_ЗаявкаНаРемонт.ПустаяСсылка() И СтрокаТаблицы.Порядок = 2) Тогда 
		//		СтрокаТаблицы.УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.Выполнен;
		//		СтрокаТаблицы.Порядок = 3;
		//	ИначеЕсли (СтрокаТаблицы.УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.Выполняется
		//		И СтрокаТаблицы.ТипДокумента = Документы.торо_НарядНаВыполнениеРемонтныхРабот.ПустаяСсылка()
		//		И СтрокаТаблицы.Порядок = 1) Тогда 
		//		СтрокаТаблицы.УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.Выполнен;
		//		СтрокаТаблицы.Порядок = 2;
		//	ИначеЕсли (СтрокаТаблицы.УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.Устраняется
		//		И СтрокаТаблицы.ТипДокумента = Документы.торо_ВнешнееОснованиеДляРабот.ПустаяСсылка()
		//		И СтрокаТаблицы.Порядок = 2) Тогда 
		//		СтрокаТаблицы.УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.Устранен;
		//		СтрокаТаблицы.Порядок = 3;
		//	КонецЕсли;
		//КонецЦикла;
	//КонецЕсли;
	// } Гкс-[TOIR20-558] Вялых Д.А. от 05.03.2025.
	#КонецВставки

	Возврат ТаблицаУстанавливаемыхСтатусов;

КонецФункции

&ИзменениеИКонтроль("УстановитьВручнуюСтатусДляРемонтаВЗаявке")
Функция Расш_гкс_УстановитьВручнуюСтатусДляРемонтаВЗаявке(Знач ЗаявкаСсылка, Знач ИДРемонта, Знач Статус, Знач ВремяУстановки, Знач КомментарийКСтатусу, Знач Пользователь, ПерезаписыватьСтандартныеСтатусы, Регистратор)

	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;

	Если Не ТипЗнч(ИДРемонта) = Тип("Массив") Тогда
		МассивИДРемонта = Новый Массив(1);
		МассивИДРемонта[0] = ИДРемонта;
	Иначе
		МассивИДРемонта = ИДРемонта;
	КонецЕсли;

	Если ВремяУстановки = Неопределено Тогда
		ВремяУстановки = ТекущаяДатаСеанса();
	КонецЕсли;
	ДатаЗаявки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаявкаСсылка, "Дата");

	МассивРезультатовПоРемонтам = Новый Массив;
	НачатьТранзакцию();

	Блокировки = Новый БлокировкаДанных;

	Блк = Блокировки.Добавить("РегистрСведений.торо_СтатусыРемонтовВЗаявках");
	Блк.Режим = РежимБлокировкиДанных.Исключительный;
	Блк.УстановитьЗначение("ЗаявкаНаРемонт", ЗаявкаСсылка);

	Блокировки.Заблокировать();

	ТекДанныеСтатусов = ТекДанныеСтатусовРемонтовЗаявки(ЗаявкаСсылка);

	флЗаписывать = Ложь;

	НЗСтатусыВЗаявках = РегистрыСведений.торо_СтатусыРемонтовВЗаявках.СоздатьНаборЗаписей();
	НЗСтатусыВЗаявках.Отбор.ЗаявкаНаРемонт.Установить(ЗаявкаСсылка);
	НЗСтатусыВЗаявках.Прочитать();

	сзУдаляемыеЗаписи = Новый СписокЗначений;
	Для Каждого Запись Из НЗСтатусыВЗаявках Цикл
		Если Запись.ДокументИсточник = Регистратор Тогда
			сзУдаляемыеЗаписи.Добавить(Запись);
		КонецЕсли; 
	КонецЦикла;

	Для каждого ЭлтСз Из сзУдаляемыеЗаписи Цикл
		НЗСтатусыВЗаявках.Удалить(ЭлтСз.Значение);
	КонецЦикла;

	Для Каждого ИДРемонта Из МассивИДРемонта Цикл
		РезультатОбработкиРемонта = Новый Структура("ИДРемонта, Успешно, СтатусУстановлен, ОписаниеРезультатаТекст",ИДРемонта, Истина, Ложь, "");
		ПоменятьСтатусНаВыполнен = РемонтЗавершен(ИДРемонта, Регистратор);

		УстанавливаемыйСтатус = Статус;
		Если ПоменятьСтатусНаВыполнен Тогда
			УстанавливаемыйСтатус = Перечисления.торо_СтатусыДокументов.Выполнен;
		КонецЕсли;

		РезультатПроверки = МожноУстановитьСтатусДляРемонтаВЗаявке(ТекДанныеСтатусов, ИДРемонта, УстанавливаемыйСтатус, Регистратор);
		Если РезультатПроверки.Возможно Тогда

			флЗаписывать = Истина;
               
			Запись = НЗСтатусыВЗаявках.Добавить();

			Запись.ЗаявкаНаРемонт = ЗаявкаСсылка;
			Запись.ИДРемонта = ИДРемонта;
			Запись.Период = ВремяУстановки;
			Запись.Статус = УстанавливаемыйСтатус;
			Запись.КомментарийКСтатусу = КомментарийКСтатусу;
			Запись.Пользователь = Пользователь;
			Запись.ДокументИсточник = Регистратор;

			РезультатОбработкиРемонта.СтатусУстановлен = Истина;

		Иначе
			// Формируем описание причины, почему не был установлен статус, в некоторых случаям устанавливаем Успешно в Ложь
			Если РезультатПроверки.Причина = "УжеУстановлен" Тогда
				#Удаление
				РезультатОбработкиРемонта.ОписаниеРезультатаТекст = СтрШаблон(НСтр("ru = 'Статус %1 уже установлен!'"), УстанавливаемыйСтатус);
				#КонецУдаления
				#Вставка
				РезультатОбработкиРемонта.ОписаниеРезультатаТекст = СтрШаблон(НСтр("es='¡El estatus %1 es establecido ya!';ru='Статус %1 уже установлен!';en='Status %1 already set!'"), УстанавливаемыйСтатус);
				#КонецВставки
			ИначеЕсли РезультатПроверки.Причина = "СтатусЗаявкиНеУстановлен" Тогда
				РезультатОбработкиРемонта.Успешно = Ложь;
				#Удаление
				РезультатОбработкиРемонта.ОписаниеРезультатаТекст = НСтр("ru = 'Для заявки не установлен никакой статус, заявка не проведена!'");
				#КонецУдаления
				#Вставка
				РезультатОбработкиРемонта.ОписаниеРезультатаТекст = НСтр("es='¡Para la demanda no es establecido ningún estatus, la demanda no es pasada!';ru='Для заявки не установлен никакой статус, заявка не проведена!';en='No status has been set for the application, no application has been submitted!'");
				#КонецВставки
			ИначеЕсли РезультатПроверки.Причина = "РемонтОтсутствуетВЗаявке" Тогда
				РезультатОбработкиРемонта.Успешно = Ложь;
				#Удаление
				РезультатОбработкиРемонта.ОписаниеРезультатаТекст = НСтр("ru = 'Ремонт отсутствует в заявке!'");
				#КонецУдаления
				#Вставка
				РезультатОбработкиРемонта.ОписаниеРезультатаТекст = НСтр("es='¡La reparación falta en la demanda!';ru='Ремонт отсутствует в заявке!';en='Repair is not in the application!'");
				#КонецВставки
			ИначеЕсли РезультатПроверки.Причина = "УстановленБолееПриоритетный" Тогда
				#Удаление
				РезультатОбработкиРемонта.ОписаниеРезультатаТекст = СтрШаблон(НСтр("ru = 'Более приоритетный статус %1 уже установлен!'"), РезультатПроверки.ТекСтатусРемонта);
				#КонецУдаления
				#Вставка
				РезультатОбработкиРемонта.ОписаниеРезультатаТекст = СтрШаблон(НСтр("es='¡Un estatus más de prioridad %1 es establecido ya!';ru='Более приоритетный статус %1 уже установлен!';en='The priority status%1 is already set!'"), РезультатПроверки.ТекСтатусРемонта);
				#КонецВставки
			Иначе
				РезультатОбработкиРемонта.Успешно = Ложь;
				РезультатОбработкиРемонта.ОписаниеРезультатаТекст = РезультатПроверки.Причина;
			КонецЕсли;

		КонецЕсли;
		МассивРезультатовПоРемонтам.Добавить(РезультатОбработкиРемонта);
	КонецЦикла;

	Если флЗаписывать Тогда
		НЗСтатусыВЗаявках.Записать();
	КонецЕсли;
	ЗафиксироватьТранзакцию();

	Возврат МассивРезультатовПоРемонтам;

КонецФункции

&Вместо("УстановитьСтатусДокумента")
Процедура Расш_гкс_УстановитьСтатусДокумента(Ссылка, Регистратор, Движения, Статус, СтатусУстановлен)
	НовыйСтатусУстановлен = СтатусУстановлен;
	Если Статус = Перечисления.торо_СтатусыДокументов.гкс_ВыполненНеобходимАктПриемки Тогда 
		НовыйСтатусУстановлен = Истина;
	КонецЕсли;
	ПродолжитьВызов(Ссылка, Регистратор, Движения, Статус, НовыйСтатусУстановлен);
КонецПроцедуры

&ИзменениеИКонтроль("ПолучитьТекстЗапросаСрезаПоследнихПоРегистру")
Функция гкс_ПолучитьТекстЗапросаСрезаПоследнихПоРегистру(ИмяРегистра, ПоДокументу, ОбъединитьСОснованиями, КромеРегистратора, ПоРегистратору, ИмяВременнойТаблицы, ОбъединитьВсе)

	Если ОбъединитьСОснованиями Тогда
		ВыбираемыеПоля = "	торо_СтатусыДокументовСрезПоследних.ИзменяемыйДокумент,
		|	торо_СтатусыДокументовСрезПоследних.СтатусДокумента";

	Иначе
		ВыбираемыеПоля = "	торо_СтатусыДокументовСрезПоследних.Период,
		|	торо_СтатусыДокументовСрезПоследних.Регистратор,
		|	торо_СтатусыДокументовСрезПоследних.НомерСтроки,
		|	торо_СтатусыДокументовСрезПоследних.Активность,
		|	торо_СтатусыДокументовСрезПоследних.ИзменяемыйДокумент,
		|	торо_СтатусыДокументовСрезПоследних.СтатусДокумента,
		|	торо_СтатусыДокументовСрезПоследних.СтатусУстановлен";
	КонецЕсли;

	ТекстЗапроса = "ВЫБРАТЬ " + ВыбираемыеПоля + 
	" %ИспользоватьВременнуюТаблицу%
	|ИЗ
	|	РегистрСведений." + ИмяРегистра + ".СрезПоследних(
	|			,
	|			СтатусУстановлен = ИСТИНА %Условие1% %Условие2% %Условие3%) КАК торо_СтатусыДокументовСрезПоследних";

	ЕстьПредыдущееУсловие = Ложь;

	Если ПоДокументу Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%Условие1%"," И ИзменяемыйДокумент = &Документ ");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%Условие1%"," ");
	КонецЕсли;

	Если КромеРегистратора Тогда 
		#Удаление 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%Условие2%"," И Регистратор <> &Регистратор ");
		#КонецУдаления
		#Вставка 
		// Гкс+[TOIR20-558] Вялых Д.А. от 06.03.2025. Добавлено:{
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%Условие2%"," И Регистратор В
		|	(ВЫБРАТЬ
		|		ДокументыОснования.ДокументОснование
		|	ИЗ
		|		ДокументыОснования КАК ДокументыОснования) ");
		// } Гкс-[TOIR20-558] Вялых Д.А. от 05.03.2025.
		#КонецВставки
	ИначеЕсли ПоРегистратору Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%Условие2%"," И Регистратор = &Регистратор ");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%Условие2%"," ");
	КонецЕсли;

	Если ОбъединитьСОснованиями Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%Условие3%"," И ИзменяемыйДокумент В
		|(ВЫБРАТЬ
		|	ДокументыОснования.ДокументОснование
		|ИЗ
		|	ДокументыОснования" + ИмяРегистра + " КАК ДокументыОснования) ");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%Условие3%"," ");
	КонецЕсли;

	Если ИмяВременнойТаблицы = "" Тогда
		Если ОбъединитьВсе Тогда
			ТекстЗапроса = Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС + СтрЗаменить(ТекстЗапроса, "%ИспользоватьВременнуюТаблицу%", "");
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ИспользоватьВременнуюТаблицу%", "");
		КонецЕсли;
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ИспользоватьВременнуюТаблицу%", "ПОМЕСТИТЬ " + ИмяВременнойТаблицы);
	КонецЕсли;

	Возврат ТекстЗапроса;

КонецФункции

// Процедура - Добавить статус в заголовок формы
//
// Параметры:
//  Заголовок - Строка - Заголовок формы.
//  Ссылка - УправляемаяФорма - Форма которой в заголовок следует добавить статус документа.
//
// Возвращаемое значение:
//  Строка - заголовок формы.
Функция гкс_ДобавитьСтатусВЗаголовокФормы(Заголовок, Ссылка) Экспорт
	// Гкс+[TOIR20-608] Вялых Д.А. от 21.07.2025. Добавлено:{	
	ТекущийСтатусДокумента = ПолучитьТекущийСтатусДокумента(Ссылка);
	
	Если ТекущийСтатусДокумента <> Неопределено Тогда
		Возврат Заголовок + " [" + Строка(ТекущийСтатусДокумента) + "]";
	Иначе
		Возврат Заголовок;
	КонецЕсли;
	// } Гкс-[TOIR20-558] Вялых Д.А. от 21.07.2025.		
КонецФункции

#КонецОбласти