#Область СлужебныеПроцедурыИФункции

&ИзменениеИКонтроль("ДополнитьОтобратьМассивВыбранныхСтрок")
Функция Расш_гкс_ДополнитьОтобратьМассивВыбранныхСтрок(МассивДанныхВыбранныхСтрок, ВариантУчетаИерархииЭлементов, СтруктураИерархии, РазрешитьВыборГрупп, ДатаСреза, ОтборСтатусыВУчете, ДополнительныеОтборы)

	МассивСсылок = Новый массив;
	Для каждого ДанныеСтр из МассивДанныхВыбранныхСтрок Цикл
		МассивСсылок.Добавить(ДанныеСтр.Ссылка);
	КонецЦикла;	

	Если ВариантУчетаИерархииЭлементов = Перечисления.торо_ВариантыУчетаИерархииЭлементовПриПодборе.УчитыватьИерархию Тогда 

		// Нужна полная иерархия.
		ПолныйМассивСсылок = ПолучитьМассивПодчиненныхОбъектов(МассивСсылок, СтруктураИерархии, ДатаСреза, Истина, ОтборСтатусыВУчете, ДополнительныеОтборы);

	ИначеЕсли ВариантУчетаИерархииЭлементов = Перечисления.торо_ВариантыУчетаИерархииЭлементовПриПодборе.УчитыватьИерархиюТолько1Уровня Тогда

		// Нужны только подчиненные одного уровня иерархии.
		ПолныйМассивСсылок = Новый Массив;
		ДополнитьМассивПодчиненнымиОР(МассивСсылок, ПолныйМассивСсылок, Ложь, СтруктураИерархии, ДатаСреза, ОтборСтатусыВУчете, ДополнительныеОтборы);

	ИначеЕсли ВариантУчетаИерархииЭлементов = Перечисления.торо_ВариантыУчетаИерархииЭлементовПриПодборе.УчитыватьИерархию1Уровня Тогда

		// Нужны сами выбранные ОР и подчиненные одного уровня иерархии.
		ПолныйМассивСсылок = Новый Массив;
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПолныйМассивСсылок, МассивСсылок);

		ДополнитьМассивПодчиненнымиОР(МассивСсылок, ПолныйМассивСсылок, Ложь, СтруктураИерархии, ДатаСреза, ОтборСтатусыВУчете, ДополнительныеОтборы);
	КонецЕсли;

	// Индекс картинки получается не очень точно,
	// т.к. в цикле дальше имеют значение только свойства ЭтоГруппа и ПометкаУдаления.
	// Не группы с подчиненными нам безразличны.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ОбъектыРемонта.Ссылка КАК Ссылка,
	|	торо_ОбъектыРемонта.ПометкаУдаления КАК ПометкаУдаления,
	#Вставка
	|	торо_ОбъектыРемонта.Ссылка.ТипОбъекта КАК ТипОбъекта,
	#КонецВставки
	|	ВЫБОР
	|		КОГДА торо_ОбъектыРемонта.ЭтоГруппа
	|			ТОГДА ВЫБОР
	|					КОГДА торо_ОбъектыРемонта.ПометкаУдаления
	|						ТОГДА 6
	|					ИНАЧЕ 5
	|				КОНЕЦ
	#Вставка
	|		КОГДА торо_ОбъектыРемонта.Ссылка.ТипОбъекта = Значение(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто)
	|			ТОГДА ВЫБОР
	|					КОГДА торо_ОбъектыРемонта.ПометкаУдаления
	|						ТОГДА 12
	|					ИНАЧЕ 11
	|				КОНЕЦ
	#КонецВставки
	|		ИНАЧЕ ВЫБОР
	|				КОГДА торо_ОбъектыРемонта.ПометкаУдаления
	|					ТОГДА 1
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК ИндексКартинки
	|ИЗ
	|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	|ГДЕ
	|	торо_ОбъектыРемонта.Ссылка В(&МассивСсылок)
	|	И торо_ОбъектыРемонта.ЭтоГруппа = ЛОЖЬ";

	Запрос.УстановитьПараметр("МассивСсылок", ПолныйМассивСсылок);

	Если РазрешитьВыборГрупп Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И торо_ОбъектыРемонта.ЭтоГруппа = Ложь", ""); 
	КонецЕсли;

	РезультатЗапроса = Запрос.Выполнить();
	Возврат торо_ОбщегоНазначения.РезультатЗапросаВМассивСтруктур(РезультатЗапроса);

КонецФункции

&ИзменениеИКонтроль("УстановитьЗапросВСпискеПоИерархии")
Процедура Расш_гкс_УстановитьЗапросВСпискеПоИерархии(Список, СтруктураПараметровИерархии, ПустойРодитель, ПолучатьСтатусыВУчете)

	ИерархияРеквизитОР = СтруктураПараметровИерархии.РеквизитОР;
	ИерархияТипРеквизитаОР = СтруктураПараметровИерархии.ТипРеквизитаОР;

	Если СтруктураПараметровИерархии.СтроитсяАвтоматически Тогда

		Список.ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ОбъектыРемонта.Ссылка КАК Ссылка,
		|	торо_ОбъектыРемонта.ПометкаУдаления КАК ПометкаУдаления,
		|	торо_ОбъектыРемонта.Код КАК Код,
		#Вставка
		|	торо_ОбъектыРемонта.ТипОбъекта КАК ТипОбъекта,
		#КонецВставки
		|	торо_ОбъектыРемонта.Наименование КАК Наименование,
		|	торо_ОбъектыРемонта.АдресМестонахождения КАК АдресМестонахождения,
		|	торо_ОбъектыРемонта.ВестиУчетСерийныхЗапчастей КАК ВестиУчетСерийныхЗапчастей,
		|	торо_ОбъектыРемонта.ВнешнийОбъект КАК ВнешнийОбъект,
		|	торо_ОбъектыРемонта.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
		|	торо_ОбъектыРемонта.ДатаВыпуска КАК ДатаВыпуска,
		|	торо_ОбъектыРемонта.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	торо_ОбъектыРемонта.ЗаводскойНомер КАК ЗаводскойНомер,
		|	торо_ОбъектыРемонта.Изготовитель КАК Изготовитель,
		|	торо_ОбъектыРемонта.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	торо_ОбъектыРемонта.КодОР КАК КодОР,
		|	торо_ОбъектыРемонта.КодПоОКОФ КАК КодПоОКОФ,
		|	торо_ОбъектыРемонта.Комментарий КАК Комментарий,
		|	торо_ОбъектыРемонта.Контрагент КАК Контрагент,
		|	торо_ОбъектыРемонта.КонтрагентИсполнительРемонта КАК КонтрагентИсполнительРемонта,
		|	торо_ОбъектыРемонта.Направление КАК Направление,
		|	торо_ОбъектыРемонта.НеУчаствуетВПланировании КАК НеУчаствуетВПланировании,
		|	торо_ОбъектыРемонта.НомерПаспорта КАК НомерПаспорта,
		|	торо_ОбъектыРемонта.Организация КАК Организация,
		|	торо_ОбъектыРемонта.ПлановыйГрафикРаботы КАК ПлановыйГрафикРаботы,
		|	торо_ОбъектыРемонта.Подразделение КАК Подразделение,
		|	торо_ОбъектыРемонта.ПодразделениеИсполнитель КАК ПодразделениеИсполнитель,
		|	торо_ОбъектыРемонта.Приоритет КАК Приоритет,
		|	торо_ОбъектыРемонта.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
		|	торо_ОбъектыРемонта.ТехНомер КАК ТехНомер,
		|	торо_ОбъектыРемонта.ТиповойОР КАК ТиповойОР,
		|	торо_ОбъектыРемонта.ЭтоАктив КАК ЭтоАктив,
		|	торо_ОбъектыРемонта.ФайлКартинки КАК ФайлКартинки,
		|	торо_ОбъектыРемонта.УсловиеРемонта КАК УсловиеРемонта,
		|	торо_ОбъектыРемонта.ШтрихКод КАК ШтрихКод,
		|	торо_ОбъектыРемонта.ЭтоГруппа КАК ЭтоГруппа,
		|	ЕСТЬNULL(НаличиеФайлов.ЕстьФайлы, ЛОЖЬ) КАК ЕстьФайлы,
		|	0 КАК ИндексКартинки,
		|   Константы.торо_КартинкаДинамическогоСписка КАК КартинкаОтображаемая,
		|	ЛОЖЬ КАК ЭтоСоставной,
		|	ЕСТЬNULL(торо_ПорядокОРПоИерархии.РеквизитДопУпорядочиванияОР, 0) КАК РеквизитДопУпорядочивания,
		|	торо_ОбъектыРемонта."+ИерархияРеквизитОР+" КАК Родитель,
		|" + ?(ПолучатьСтатусыВУчете,
		"	ВЫБОР
		|		КОГДА НЕ торо_ОбъектыРемонта.ЭтоГруппа
		|			ТОГДА ЕСТЬNULL(торо_СтатусыОбъектовРемонтаВУчете.СтатусОР, ЗНАЧЕНИЕ(Перечисление.торо_СтатусыОРВУчете.НеПринятоКУчету))
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.торо_СтатусыОРВУчете.ПустаяСсылка)
		|	КОНЕЦ КАК СтатусВУчете",
		"НЕОПРЕДЕЛЕНО КАК СтатусВУчете") + "
		|ИЗ
		|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НаличиеФайлов КАК НаличиеФайлов
		|		ПО торо_ОбъектыРемонта.Ссылка = НаличиеФайлов.ОбъектСФайлами
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ПорядокОРПоИерархии КАК торо_ПорядокОРПоИерархии
		|		ПО торо_ОбъектыРемонта.Ссылка = торо_ПорядокОРПоИерархии.ОбъектРемонта
		|			И (торо_ПорядокОРПоИерархии.СтруктураИерархии = &СтруктураИерархии)
		|" + ?(ПолучатьСтатусыВУчете,
		" ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_СтатусыОбъектовРемонтаВУчете.СрезПоследних КАК торо_СтатусыОбъектовРемонтаВУчете
		| ПО торо_ОбъектыРемонта.Ссылка = торо_СтатусыОбъектовРемонтаВУчете.ОбъектРемонта",
		"") + ",
		|     Константы КАК Константы		
		|ГДЕ
		|	НЕ торо_ОбъектыРемонта.ЭтоГруппа
		|";

		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "СтруктураИерархии", СтруктураПараметровИерархии.ТекСтруктураИерархии);

	Иначе

		Если СтруктураПараметровИерархии.ИзменяетсяДокументами Тогда

			Список.ТекстЗапроса =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ВТ_СтруктураИерархии.РодительИерархии КАК РодительИерархии,
			|	ИСТИНА КАК ЭтоСоставной
			|ПОМЕСТИТЬ ВТ_РодителиИерархии
			|ИЗ
			|	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(, СтруктураИерархии = &СтруктураИерархии) КАК ВТ_СтруктураИерархии
			|ГДЕ
			|	ВТ_СтруктураИерархии.Удален = ЛОЖЬ
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	РодительИерархии
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	торо_ОбъектыРемонта.Ссылка КАК Ссылка,
			|	торо_ОбъектыРемонта.ПометкаУдаления КАК ПометкаУдаления,
			|	торо_ОбъектыРемонта.Код КАК Код,
			|	торо_ОбъектыРемонта.ТипОбъекта КАК ТипОбъекта,
			|	торо_ОбъектыРемонта.Наименование КАК Наименование,
			|	торо_ОбъектыРемонта.АдресМестонахождения КАК АдресМестонахождения,
			|	торо_ОбъектыРемонта.ВестиУчетСерийныхЗапчастей КАК ВестиУчетСерийныхЗапчастей,
			|	торо_ОбъектыРемонта.ВнешнийОбъект КАК ВнешнийОбъект,
			|	торо_ОбъектыРемонта.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
			|	торо_ОбъектыРемонта.ДатаВыпуска КАК ДатаВыпуска,
			|	торо_ОбъектыРемонта.ДоговорКонтрагента КАК ДоговорКонтрагента,
			|	торо_ОбъектыРемонта.ЗаводскойНомер КАК ЗаводскойНомер,
			|	торо_ОбъектыРемонта.Изготовитель КАК Изготовитель,
			|	торо_ОбъектыРемонта.ИнвентарныйНомер КАК ИнвентарныйНомер,
			|	торо_ОбъектыРемонта.КодОР КАК КодОР,
			|	торо_ОбъектыРемонта.КодПоОКОФ КАК КодПоОКОФ,
			|	торо_ОбъектыРемонта.Комментарий КАК Комментарий,
			|	торо_ОбъектыРемонта.Контрагент КАК Контрагент,
			|	торо_ОбъектыРемонта.КонтрагентИсполнительРемонта КАК КонтрагентИсполнительРемонта,
			|	торо_ОбъектыРемонта.Направление КАК Направление,
			|	торо_ОбъектыРемонта.НеУчаствуетВПланировании КАК НеУчаствуетВПланировании,
			|	торо_ОбъектыРемонта.НомерПаспорта КАК НомерПаспорта,
			|	торо_ОбъектыРемонта.Организация КАК Организация,
			|	торо_ОбъектыРемонта.ПлановыйГрафикРаботы КАК ПлановыйГрафикРаботы,
			|	торо_ОбъектыРемонта.Подразделение КАК Подразделение,
			|	торо_ОбъектыРемонта.ПодразделениеИсполнитель КАК ПодразделениеИсполнитель,
			|	торо_ОбъектыРемонта.Приоритет КАК Приоритет,
			|	торо_ОбъектыРемонта.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
			|	торо_ОбъектыРемонта.ТехНомер КАК ТехНомер,
			|	торо_ОбъектыРемонта.ТиповойОР КАК ТиповойОР,
			|	торо_ОбъектыРемонта.ЭтоАктив КАК ЭтоАктив,
			|	торо_ОбъектыРемонта.ФайлКартинки КАК ФайлКартинки,
			|	торо_ОбъектыРемонта.УсловиеРемонта КАК УсловиеРемонта,
			|	торо_ОбъектыРемонта.ШтрихКод КАК ШтрихКод,
			|	торо_ОбъектыРемонта.ЭтоГруппа КАК ЭтоГруппа,
			|	ЕСТЬNULL(НаличиеФайлов.ЕстьФайлы, ЛОЖЬ) КАК ЕстьФайлы,
			|	0 КАК ИндексКартинки,
			|   Константы.торо_КартинкаДинамическогоСписка КАК КартинкаОтображаемая,
			|	ЕСТЬNULL(ВТ_РодителиИерархии.ЭтоСоставной, ЛОЖЬ) КАК ЭтоСоставной,
			|	ЕСТЬNULL(торо_ПорядокОРПоИерархии.РеквизитДопУпорядочиванияОР, 0) КАК РеквизитДопУпорядочивания,
			|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.РодительИерархии КАК Родитель,
			|" + ?(ПолучатьСтатусыВУчете,
			"	ВЫБОР
			|		КОГДА НЕ торо_ОбъектыРемонта.ЭтоГруппа
			|			ТОГДА ЕСТЬNULL(торо_СтатусыОбъектовРемонтаВУчете.СтатусОР, ЗНАЧЕНИЕ(Перечисление.торо_СтатусыОРВУчете.НеПринятоКУчету))
			|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.торо_СтатусыОРВУчете.ПустаяСсылка)
			|	КОНЕЦ КАК СтатусВУчете",
			"НЕОПРЕДЕЛЕНО КАК СтатусВУчете") + "
			|ИЗ
			|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(, СтруктураИерархии = &СтруктураИерархии) КАК торо_РасположениеОРВСтруктуреИерархииСрезПоследних
			|		ПО торо_ОбъектыРемонта.Ссылка = торо_РасположениеОРВСтруктуреИерархииСрезПоследних.ОбъектИерархии
			|			И торо_РасположениеОРВСтруктуреИерархииСрезПоследних.Удален = ЛОЖЬ
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РодителиИерархии КАК ВТ_РодителиИерархии
			|		ПО торо_ОбъектыРемонта.Ссылка = ВТ_РодителиИерархии.РодительИерархии
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НаличиеФайлов КАК НаличиеФайлов
			|		ПО торо_ОбъектыРемонта.Ссылка = НаличиеФайлов.ОбъектСФайлами
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ПорядокОРПоИерархии КАК торо_ПорядокОРПоИерархии
			|		ПО торо_ОбъектыРемонта.Ссылка = торо_ПорядокОРПоИерархии.ОбъектРемонта
			|			И (торо_ПорядокОРПоИерархии.СтруктураИерархии = &СтруктураИерархии)
			|" + ?(ПолучатьСтатусыВУчете,
			" ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_СтатусыОбъектовРемонтаВУчете.СрезПоследних КАК торо_СтатусыОбъектовРемонтаВУчете
			| ПО торо_ОбъектыРемонта.Ссылка = торо_СтатусыОбъектовРемонтаВУчете.ОбъектРемонта",
			"") + ",
			|     Константы КАК Константы		
			|";

		Иначе

			Список.ТекстЗапроса =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	торо_ОбъектыРемонта.Ссылка КАК Ссылка,
			|	торо_ОбъектыРемонта.ПометкаУдаления КАК ПометкаУдаления,
			|	торо_ОбъектыРемонта.Код КАК Код,
			|	торо_ОбъектыРемонта.ТипОбъекта КАК ТипОбъекта,
			|	торо_ОбъектыРемонта.Наименование КАК Наименование,
			|	торо_ОбъектыРемонта.АдресМестонахождения КАК АдресМестонахождения,
			|	торо_ОбъектыРемонта.ВестиУчетСерийныхЗапчастей КАК ВестиУчетСерийныхЗапчастей,
			|	торо_ОбъектыРемонта.ВнешнийОбъект КАК ВнешнийОбъект,
			|	торо_ОбъектыРемонта.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
			|	торо_ОбъектыРемонта.ДатаВыпуска КАК ДатаВыпуска,
			|	торо_ОбъектыРемонта.ДоговорКонтрагента КАК ДоговорКонтрагента,
			|	торо_ОбъектыРемонта.ЗаводскойНомер КАК ЗаводскойНомер,
			|	торо_ОбъектыРемонта.Изготовитель КАК Изготовитель,
			|	торо_ОбъектыРемонта.ИнвентарныйНомер КАК ИнвентарныйНомер,
			|	торо_ОбъектыРемонта.КодОР КАК КодОР,
			|	торо_ОбъектыРемонта.КодПоОКОФ КАК КодПоОКОФ,
			|	торо_ОбъектыРемонта.Комментарий КАК Комментарий,
			|	торо_ОбъектыРемонта.Контрагент КАК Контрагент,
			|	торо_ОбъектыРемонта.КонтрагентИсполнительРемонта КАК КонтрагентИсполнительРемонта,
			|	торо_ОбъектыРемонта.Направление КАК Направление,
			|	торо_ОбъектыРемонта.НеУчаствуетВПланировании КАК НеУчаствуетВПланировании,
			|	торо_ОбъектыРемонта.НомерПаспорта КАК НомерПаспорта,
			|	торо_ОбъектыРемонта.Организация КАК Организация,
			|	торо_ОбъектыРемонта.ПлановыйГрафикРаботы КАК ПлановыйГрафикРаботы,
			|	торо_ОбъектыРемонта.Подразделение КАК Подразделение,
			|	торо_ОбъектыРемонта.ПодразделениеИсполнитель КАК ПодразделениеИсполнитель,
			|	торо_ОбъектыРемонта.Приоритет КАК Приоритет,
			|	торо_ОбъектыРемонта.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
			|	торо_ОбъектыРемонта.ТехНомер КАК ТехНомер,
			|	торо_ОбъектыРемонта.ТиповойОР КАК ТиповойОР,
			|	торо_ОбъектыРемонта.ЭтоАктив КАК ЭтоАктив,
			|	торо_ОбъектыРемонта.ФайлКартинки КАК ФайлКартинки,
			|	торо_ОбъектыРемонта.УсловиеРемонта КАК УсловиеРемонта,
			|	торо_ОбъектыРемонта.ШтрихКод КАК ШтрихКод,
			|	торо_ОбъектыРемонта.ЭтоГруппа КАК ЭтоГруппа,
			|	ЕСТЬNULL(НаличиеФайлов.ЕстьФайлы, ЛОЖЬ) КАК ЕстьФайлы,
			|	0 КАК ИндексКартинки,
			|   Константы.торо_КартинкаДинамическогоСписка КАК КартинкаОтображаемая,
			|	ЕСТЬNULL(торо_ОбъектыРемонтаГруппы.ОбъектГруппа, ЛОЖЬ) КАК ЭтоСоставной,
			|	ЕСТЬNULL(торо_ПорядокОРПоИерархии.РеквизитДопУпорядочиванияОР, 0) КАК РеквизитДопУпорядочивания,
			|	торо_ИерархическиеСтруктурыОР.РодительИерархии КАК Родитель,
			|" + ?(ПолучатьСтатусыВУчете,
			"	ВЫБОР
			|		КОГДА НЕ торо_ОбъектыРемонта.ЭтоГруппа
			|			ТОГДА ЕСТЬNULL(торо_СтатусыОбъектовРемонтаВУчете.СтатусОР, ЗНАЧЕНИЕ(Перечисление.торо_СтатусыОРВУчете.НеПринятоКУчету))
			|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.торо_СтатусыОРВУчете.ПустаяСсылка)
			|	КОНЕЦ КАК СтатусВУчете",
			"НЕОПРЕДЕЛЕНО КАК СтатусВУчете") + "
			|ИЗ
			|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИерархическиеСтруктурыОР КАК торо_ИерархическиеСтруктурыОР
			|		ПО торо_ОбъектыРемонта.Ссылка = торо_ИерархическиеСтруктурыОР.ОбъектИерархии
			|			И (торо_ИерархическиеСтруктурыОР.СтруктураИерархии = &СтруктураИерархии)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОбъектыРемонтаГруппы КАК торо_ОбъектыРемонтаГруппы
			|		ПО торо_ОбъектыРемонта.Ссылка = торо_ОбъектыРемонтаГруппы.ОбъектИерархии
			|			И (торо_ОбъектыРемонтаГруппы.СтруктураИерархии = &СтруктураИерархии)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НаличиеФайлов КАК НаличиеФайлов
			|		ПО торо_ОбъектыРемонта.Ссылка = НаличиеФайлов.ОбъектСФайлами
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ПорядокОРПоИерархии КАК торо_ПорядокОРПоИерархии
			|		ПО торо_ОбъектыРемонта.Ссылка = торо_ПорядокОРПоИерархии.ОбъектРемонта
			|			И (торо_ПорядокОРПоИерархии.СтруктураИерархии = &СтруктураИерархии)
			|" + ?(ПолучатьСтатусыВУчете,
			" ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_СтатусыОбъектовРемонтаВУчете.СрезПоследних КАК торо_СтатусыОбъектовРемонтаВУчете
			| ПО торо_ОбъектыРемонта.Ссылка = торо_СтатусыОбъектовРемонтаВУчете.ОбъектРемонта",
			"") + ",
			|     Константы КАК Константы		
			|";

		КонецЕсли;

		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "СтруктураИерархии", СтруктураПараметровИерархии.ТекСтруктураИерархии);
	КонецЕсли;

	торо_РаботаСИерархией20КлиентСервер.УстановитьОтборСпискаПоРодителю(Список, ПустойРодитель);

КонецПроцедуры

&ИзменениеИКонтроль("СписокПриПолученииДанныхНаСервере")
Процедура Расш_гкс_СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки, ИспользоватьКартинкиТОР)

	Для каждого Строка из Строки Цикл
		ДанныеСтроки = Строка.Значение.Данные;
		Если ДанныеСтроки <> Неопределено Тогда
			#Вставка
			Если ДанныеСтроки.Свойство("ТипОбъекта") Тогда 
				ДанныеСтроки.ИндексКартинки = 
				гкс_ПолучитьИндексКартинкиДереваНеавтоматическойИерархии(
					ДанныеСтроки.ПометкаУдаления, ДанныеСтроки.ЭтоГруппа, ДанныеСтроки.ЭтоСоставной,
					ДанныеСтроки.ТипОбъекта = Перечисления.торо_ТипыОбъектовRCM.ФункциональноеМесто);
			Иначе
				ДанныеСтроки.ИндексКартинки = 
				торо_РаботаСИерархией20КлиентСервер.ПолучитьИндексКартинкиДереваНеавтоматическойИерархии(
					ДанныеСтроки.ПометкаУдаления, ДанныеСтроки.ЭтоГруппа, ДанныеСтроки.ЭтоСоставной);
			КонецЕсли;
			#КонецВставки
			Если ИспользоватьКартинкиТОР И ТипЗнч(ДанныеСтроки.Ссылка) = Тип("СправочникСсылка.торо_ОбъектыРемонта")
				И (Не ДанныеСтроки.Ссылка.ПометкаУдаления) И ЗначениеЗаполнено(ДанныеСтроки.Ссылка.ТиповойОР) Тогда
				КартинкаТОР = ДанныеСтроки.Ссылка.ТиповойОР.ФайлКартинки;
				Если НЕ КартинкаТОР = Справочники.торо_ТиповыеОРПрисоединенныеФайлы.ПустаяСсылка() Тогда
					УИД = ДанныеСтроки.Ссылка.ТиповойОР.УникальныйИдентификатор();
					АдресКартинки = РаботаСФайлами.ДанныеФайла(КартинкаТОР, УИД).СсылкаНаДвоичныеДанныеФайла;
					ДанныеСтроки.КартинкаОтображаемая = АдресКартинки; 
				Иначе
					ДанныеСтроки.КартинкаОтображаемая = ДанныеСтроки.ИндексКартинки;
				КонецЕсли;
			Иначе 
				ДанныеСтроки.КартинкаОтображаемая = ДанныеСтроки.ИндексКартинки;
			КонецЕсли;	
		КонецЕсли; 
	КонецЦикла;

КонецПроцедуры

&ИзменениеИКонтроль("ПолучитьМассивСтрокВерхнегоУровняИерархии")
Функция Расш_гкс_ПолучитьМассивСтрокВерхнегоУровняИерархии(СтруктураПараметровИерархии, РодительИерархии, ПолучатьСтатусыВУчете, ОтборСтатусыВУчете, ВключаяКонечныеЭлементы, ДополнительныеОтборы)

	Если СтруктураПараметровИерархии.СтроитсяАвтоматически И НЕ СтруктураПараметровИерархии.ИерархическийСправочник Тогда

		Запрос = Новый Запрос;

		Если ВключаяКонечныеЭлементы Тогда

			ПолучатьСтатусыВУчетеФакт = (ПолучатьСтатусыВУчете = Истина) И ОтборСтатусыВУчете <> Неопределено И ОтборСтатусыВУчете.Количество() > 0;

			Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
			Если ПолучатьСтатусыВУчетеФакт Тогда
				Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	торо_СтатусыОбъектовРемонтаВУчетеСрезПоследних.ОбъектРемонта КАК ОбъектРемонта,
				|	торо_СтатусыОбъектовРемонтаВУчетеСрезПоследних.СтатусОР КАК СтатусОР
				|ПОМЕСТИТЬ ВТ_СтатусыОРВУчете
				|ИЗ
				|	РегистрСведений.торо_СтатусыОбъектовРемонтаВУчете.СрезПоследних КАК торо_СтатусыОбъектовРемонтаВУчетеСрезПоследних
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	ОбъектРемонта";
			Иначе
				Запрос.Текст =
				"ВЫБРАТЬ
				|	НЕОПРЕДЕЛЕНО КАК ОбъектРемонта,
				|	НЕОПРЕДЕЛЕНО КАК СтатусОР
				|ПОМЕСТИТЬ ВТ_СтатусыОРВУчете";
			КонецЕсли;

			Запрос.Выполнить();

			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ИСТИНА КАК ЕстьПодчиненные,
			|	торо_ОбъектыРемонта." + СтруктураПараметровИерархии.РеквизитОР + " КАК РодительИерархии
			|ПОМЕСТИТЬ ВТ_НаличиеПодчиненных
			|ИЗ
			|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтатусыОРВУчете КАК ВТ_СтатусыОРВУчете
			|		ПО торо_ОбъектыРемонта.Ссылка = ВТ_СтатусыОРВУчете.ОбъектРемонта
			|ГДЕ
			|	торо_ОбъектыРемонта.ЭтоГруппа = ЛОЖЬ
			|	И &УсловиеПоСтатусамВУчете
			|	И &ДополнительныеОтборы
			|	И торо_ОбъектыРемонта." + СтруктураПараметровИерархии.РеквизитОР + " <> &РодительИерархии
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	РодительИерархии
			|;
			|///////////////////////////////////////////////////////////////
			|
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СправочникСсылка.Ссылка КАК ОбъектИерархии,
			|	НЕОПРЕДЕЛЕНО КАК ОбъектРемонта,
			|	&РодительИерархии КАК РодительИерархии,
			|	СправочникСсылка.Наименование КАК Наименование,
			|	СправочникСсылка.ПометкаУдаления КАК ПометкаУдаления,
			|	ЛОЖЬ КАК ЭтоГруппа,
			|	Null КАК ТипОбъекта,
			|	ВЫБОР
			|		КОГДА СправочникСсылка.ПометкаУдаления
			|			ТОГДА 10
			|		ИНАЧЕ 9
			|	КОНЕЦ КАК ИндексКартинки,
			|	0 КАК РеквизитДопУпорядочивания,
			|	ЕСТЬNULL(ВТ_НаличиеПодчиненных.ЕстьПодчиненные, ЛОЖЬ) КАК ЕстьПодчиненные 
			|ИЗ
			|	Справочник."+СтруктураПараметровИерархии.ТипРеквизитаОР+" КАК СправочникСсылка
			|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НаличиеПодчиненных КАК ВТ_НаличиеПодчиненных
			|		ПО СправочникСсылка.Ссылка = ВТ_НаличиеПодчиненных.РодительИерархии
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	торо_ОбъектыРемонта.Ссылка,
			|	торо_ОбъектыРемонта.Ссылка,
			|	торо_ОбъектыРемонта." + СтруктураПараметровИерархии.РеквизитОР + ",
			|	ПРЕДСТАВЛЕНИЕ(торо_ОбъектыРемонта.Ссылка),
			|	торо_ОбъектыРемонта.ПометкаУдаления,
			|	торо_ОбъектыРемонта.ЭтоГруппа,
			#Вставка
			|	торо_ОбъектыРемонта.Ссылка.ТипОбъекта ,
			#КонецВставки
			|	ВЫБОР
			|		КОГДА торо_ОбъектыРемонта.ЭтоГруппа
			|			ТОГДА ВЫБОР
			|					КОГДА торо_ОбъектыРемонта.ПометкаУдаления
			|						ТОГДА 6
			|					ИНАЧЕ 5
			|				КОНЕЦ
			#Вставка
			|		КОГДА торо_ОбъектыРемонта.ТипОбъекта = Значение(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто)
			|			ТОГДА ВЫБОР
			|					КОГДА торо_ОбъектыРемонта.ПометкаУдаления
			|						ТОГДА 12
			|					ИНАЧЕ 11
			|				КОНЕЦ
			#КонецВставки
			|		ИНАЧЕ ВЫБОР
			|				КОГДА торо_ОбъектыРемонта.ПометкаУдаления
			|					ТОГДА 1
			|				ИНАЧЕ 0
			|			КОНЕЦ
			|	КОНЕЦ,
			|	ЕСТЬNULL(торо_ПорядокОРПоИерархии.РеквизитДопУпорядочиванияОР, 0),
			|	ЛОЖЬ КАК ЕстьПодчиненные
			|ИЗ
			|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ПорядокОРПоИерархии КАК торо_ПорядокОРПоИерархии
			|		ПО торо_ОбъектыРемонта.Ссылка = торо_ПорядокОРПоИерархии.ОбъектРемонта
			|			И (торо_ПорядокОРПоИерархии.СтруктураИерархии = &СтруктураИерархии)
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтатусыОРВУчете КАК ВТ_СтатусыОРВУчете
			|		ПО торо_ОбъектыРемонта.Ссылка = ВТ_СтатусыОРВУчете.ОбъектРемонта
			|ГДЕ
			|	торо_ОбъектыРемонта." + СтруктураПараметровИерархии.РеквизитОР + " = &РодительИерархии
			|	И торо_ОбъектыРемонта.ЭтоГруппа = ЛОЖЬ
			|	И &УсловиеПоСтатусамВУчете
			|	И &ДополнительныеОтборы";

			Запрос.УстановитьПараметр("СтруктураИерархии", СтруктураПараметровИерархии.ТекСтруктураИерархии);

			Если ПолучатьСтатусыВУчетеФакт Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоСтатусамВУчете", 
				"ЕСТЬNULL(ВТ_СтатусыОРВУчете.СтатусОР, ЗНАЧЕНИЕ(Перечисление.торо_СтатусыОРВУчете.НеПринятоКУчету)) В (&СписокСтатусов)");
				Запрос.УстановитьПараметр("СписокСтатусов", ОтборСтатусыВУчете);
			Иначе
				Запрос.УстановитьПараметр("УсловиеПоСтатусамВУчете", Истина);
			КонецЕсли;

			Если ДополнительныеОтборы <> Неопределено И ДополнительныеОтборы.Количество() > 0 Тогда
				ТекстДопОтбора = СформироватьСтрокуДополнительныхОтборовИУстановитьПараметры(ДополнительныеОтборы, "торо_ОбъектыРемонта", Запрос);
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДополнительныеОтборы",	ТекстДопОтбора);
			Иначе
				Запрос.УстановитьПараметр("ДополнительныеОтборы", Истина);
			КонецЕсли;

		Иначе

			Запрос.Текст =	
			СтрЗаменить("ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СправочникСсылка.Ссылка КАК ОбъектИерархии,
			|	НЕОПРЕДЕЛЕНО КАК ОбъектРемонта,
			|	&РодительИерархии КАК РодительИерархии,
			|	СправочникСсылка.Наименование КАК Наименование,
			|	СправочникСсылка.ПометкаУдаления КАК ПометкаУдаления,
			|	ЛОЖЬ КАК ЭтоГруппа,
			|	ВЫБОР
			|		КОГДА СправочникСсылка.ПометкаУдаления
			|			ТОГДА 10
			|		ИНАЧЕ 9
			|	КОНЕЦ КАК ИндексКартинки,
			|	0 КАК РеквизитДопУпорядочивания,
			|	ЛОЖЬ КАК ЕстьПодчиненные
			|ИЗ
			|	Справочник.СтруктураПредприятия КАК СправочникСсылка", 
			"СтруктураПредприятия", СтруктураПараметровИерархии.ТипРеквизитаОР);

		КонецЕсли;

		Запрос.УстановитьПараметр("РодительИерархии", РодительИерархии);
		Результат = Запрос.Выполнить();
		МассивСтруктур = торо_ОбщегоНазначения.РезультатЗапросаВМассивСтруктур(Результат);

		Для каждого ДанныеСтроки из МассивСтруктур Цикл
			Если НЕ ЗначениеЗаполнено(ДанныеСтроки.Наименование) Тогда
				ДанныеСтроки.Наименование = Строка(ДанныеСтроки.ОбъектИерархии);
			КонецЕсли;
		КонецЦикла;

		Возврат МассивСтруктур;

	Иначе

		РодителиИерархии = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(РодительИерархии);
		МассивСтрокПервогоУровня =  ПолучитьМассивСтрокОдногоУровняИерархииСКоличествомПодчиненных(СтруктураПараметровИерархии, РодителиИерархии, ПолучатьСтатусыВУчете, ОтборСтатусыВУчете, ВключаяКонечныеЭлементы, ДополнительныеОтборы); 

		Возврат МассивСтрокПервогоУровня;

	КонецЕсли;

КонецФункции

&ИзменениеИКонтроль("ПолучитьМассивСтрокОдногоУровняИерархии")
Функция Расш_гкс_ПолучитьМассивСтрокОдногоУровняИерархии(СтруктураПараметровИерархии, РодителиИерархии, ПолучатьСтатусыВУчете, ОтборСтатусыВУчете, ВключаяКонечныеЭлементы, ДополнительныеОтборы)

	// В этой функции поле "ЕстьПодчиненные" выбирается только для того, 
	// чтобы оно всегда было в структуре. Всегда выбирается ЛОЖЬ.
	// Настоящее значение проставляется с помощью дополнительной проверки в другой функции, с помощью ОтобратьРодителейСПодчиненными().

	ПолучатьСтатусыВУчетеФакт = (ПолучатьСтатусыВУчете = Истина) И ОтборСтатусыВУчете <> Неопределено И ОтборСтатусыВУчете.Количество() > 0;

	Если СтруктураПараметровИерархии.СтроитсяАвтоматически Тогда

		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("РодителиИерархии", РодителиИерархии);

		Если СтруктураПараметровИерархии.ИерархическийСправочник Тогда

			Если ВключаяКонечныеЭлементы Тогда

				МенеджерВТ = Новый МенеджерВременныхТаблиц;
				Запрос.МенеджерВременныхТаблиц = МенеджерВТ;

				Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	торо_ОбъектыРемонта.Ссылка КАК ОбъектИерархии,
				|	торо_ОбъектыРемонта." + СтруктураПараметровИерархии.РеквизитОР + " КАК Родитель,
				|	ПРЕДСТАВЛЕНИЕ(торо_ОбъектыРемонта.Ссылка) КАК Наименование,
				|	торо_ОбъектыРемонта.ПометкаУдаления КАК ПометкаУдаления,
				|	торо_ОбъектыРемонта.ЭтоГруппа КАК ЭтоГруппа
				|ПОМЕСТИТЬ ВТ_ОР
				|ИЗ
				|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
				|ГДЕ
				|	торо_ОбъектыРемонта." + СтруктураПараметровИерархии.РеквизитОР + " В(&РодителиИерархии)
				|	И НЕ торо_ОбъектыРемонта.ЭтоГруппа
				|	И &ДополнительныеОтборы";

				Если ДополнительныеОтборы <> Неопределено И ДополнительныеОтборы.Количество() > 0 Тогда
					ТекстДопОтбора = СформироватьСтрокуДополнительныхОтборовИУстановитьПараметры(ДополнительныеОтборы, "торо_ОбъектыРемонта", Запрос);
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДополнительныеОтборы",	ТекстДопОтбора);
				Иначе
					Запрос.УстановитьПараметр("ДополнительныеОтборы", Истина);
				КонецЕсли;

				Запрос.Выполнить();

				Если ПолучатьСтатусыВУчетеФакт Тогда
					СоздатьВременнуюТаблицуСОтборомПоСтатусу(МенеджерВТ, ОтборСтатусыВУчете, "ВТ_ОР");
				КонецЕсли;

				Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	СправочникСсылка.Ссылка КАК ОбъектИерархии,
				|	НЕОПРЕДЕЛЕНО КАК ОбъектРемонта,
				|	СправочникСсылка.Родитель КАК РодительИерархии,
				|	СправочникСсылка.Наименование КАК Наименование,
				|	СправочникСсылка.ПометкаУдаления КАК ПометкаУдаления,
				|	NULL КАК ТипОбъекта,
				|	ЛОЖЬ КАК ЭтоГруппа,
				|	ВЫБОР
				|		КОГДА СправочникСсылка.ПометкаУдаления
				|			ТОГДА 10
				|		ИНАЧЕ 9
				|	КОНЕЦ КАК ИндексКартинки,
				|	0 КАК РеквизитДопУпорядочивания,
				|	ЛОЖЬ КАК ЕстьПодчиненные
				|ИЗ
				|	Справочник."+СтруктураПараметровИерархии.ТипРеквизитаОР+" КАК СправочникСсылка
				|ГДЕ
				|	СправочникСсылка.Родитель В(&РодителиИерархии)
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ 
				|	ВТ_ОР.ОбъектИерархии КАК ОбъектИерархии,
				|	ВТ_ОР.ОбъектИерархии КАК ОбъектРемонта,
				|	ВТ_ОР.Родитель КАК РодительИерархии,
				|	ВТ_ОР.Наименование КАК Наименование,
				|	ВТ_ОР.ПометкаУдаления КАК ПометкаУдаления,
				|	ВТ_ОР.ЭтоГруппа КАК ЭтоГруппа,
				#Вставка
				|	ВТ_ОР.Ссылка.ТипОбъекта,
				#КонецВставки
				|	ВЫБОР
				|		КОГДА ВТ_ОР.ЭтоГруппа
				|			ТОГДА ВЫБОР
				|					КОГДА ВТ_ОР.ПометкаУдаления
				|						ТОГДА 6
				|					ИНАЧЕ 5
				|				КОНЕЦ
				#Вставка
				|		КОГДА ВТ_ОР.Ссылка.ТипОбъекта = Значение(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто)
				|			ТОГДА ВЫБОР
				|					КОГДА ВТ_ОР.ПометкаУдаления
				|						ТОГДА 12
				|					ИНАЧЕ 11
				|				КОНЕЦ
				#КонецВставки
				|		ИНАЧЕ ВЫБОР
				|				КОГДА ВТ_ОР.ПометкаУдаления
				|					ТОГДА 1
				|				ИНАЧЕ 0
				|			КОНЕЦ
				|	КОНЕЦ КАК ИндексКартинки,
				|	ЕСТЬNULL(торо_ПорядокОРПоИерархии.РеквизитДопУпорядочиванияОР, 0) КАК РеквизитДопУпорядочивания,
				|	ЛОЖЬ КАК ЕстьПодчиненные
				|ИЗ
				|	ВТ_ОР КАК ВТ_ОР
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ПорядокОРПоИерархии КАК торо_ПорядокОРПоИерархии
				|		ПО ВТ_ОР.ОбъектИерархии = торо_ПорядокОРПоИерархии.ОбъектРемонта
				|			И (торо_ПорядокОРПоИерархии.СтруктураИерархии = &СтруктураИерархии)
				|ГДЕ
				|	&УсловиеПоСтатусамВУчете
				|";

				Запрос.УстановитьПараметр("СтруктураИерархии", СтруктураПараметровИерархии.ТекСтруктураИерархии);

				Если ПолучатьСтатусыВУчетеФакт Тогда
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоСтатусамВУчете", 
					"ВТ_ОР.ОбъектИерархии В
					|		(ВЫБРАТЬ
					|			ВТ_ОтборОРПоСтатусам.ОбъектИерархии КАК ОбъектИерархии
					|		ИЗ
					|			ВТ_ОтборОРПоСтатусам КАК ВТ_ОтборОРПоСтатусам)");
				Иначе
					Запрос.УстановитьПараметр("УсловиеПоСтатусамВУчете", Истина);
				КонецЕсли;

			Иначе

				Запрос.Текст =	
				СтрЗаменить("ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	СправочникСсылка.Ссылка КАК ОбъектИерархии,
				|	НЕОПРЕДЕЛЕНО КАК ОбъектРемонта,
				|	СправочникСсылка.Родитель КАК РодительИерархии,
				|	СправочникСсылка.Наименование КАК Наименование,
				|	СправочникСсылка.ПометкаУдаления КАК ПометкаУдаления,
				|	ЛОЖЬ КАК ЭтоГруппа,
				|	ВЫБОР
				|		КОГДА СправочникСсылка.ПометкаУдаления
				|			ТОГДА 10
				|		ИНАЧЕ 9
				|	КОНЕЦ КАК ИндексКартинки,
				|	0 КАК РеквизитДопУпорядочивания,
				|	ЛОЖЬ КАК ЕстьПодчиненные
				|ИЗ
				|	Справочник.СтруктураПредприятия КАК СправочникСсылка
				|ГДЕ
				|	СправочникСсылка.Родитель В(&РодителиИерархии)", 
				"СтруктураПредприятия", СтруктураПараметровИерархии.ТипРеквизитаОР);

			КонецЕсли;

		Иначе // Не иерархиеский.

			Если ВключаяКонечныеЭлементы Тогда

				МенеджерВТ = Новый МенеджерВременныхТаблиц;
				Запрос.МенеджерВременныхТаблиц = МенеджерВТ;

				Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	торо_ОбъектыРемонта.Ссылка КАК ОбъектИерархии,
				|	торо_ОбъектыРемонта." + СтруктураПараметровИерархии.РеквизитОР + " КАК Родитель,
				|	ПРЕДСТАВЛЕНИЕ(торо_ОбъектыРемонта.Ссылка) КАК Наименование,
				|	торо_ОбъектыРемонта.ПометкаУдаления КАК ПометкаУдаления,
				|	торо_ОбъектыРемонта.ЭтоГруппа КАК ЭтоГруппа
				|ПОМЕСТИТЬ ВТ_ОР
				|ИЗ
				|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
				|ГДЕ
				|	торо_ОбъектыРемонта." + СтруктураПараметровИерархии.РеквизитОР + " В(&РодителиИерархии)
				|	И НЕ торо_ОбъектыРемонта.ЭтоГруппа
				|	И &ДополнительныеОтборы";

				Если ДополнительныеОтборы <> Неопределено И ДополнительныеОтборы.Количество() > 0 Тогда
					ТекстДопОтбора = СформироватьСтрокуДополнительныхОтборовИУстановитьПараметры(ДополнительныеОтборы, "торо_ОбъектыРемонта", Запрос);
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДополнительныеОтборы",	ТекстДопОтбора);
				Иначе
					Запрос.УстановитьПараметр("ДополнительныеОтборы", Истина);
				КонецЕсли;

				Запрос.Выполнить();

				Если ПолучатьСтатусыВУчетеФакт Тогда
					СоздатьВременнуюТаблицуСОтборомПоСтатусу(МенеджерВТ, ОтборСтатусыВУчете, "ВТ_ОР");
				КонецЕсли;

				Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ВТ_ОР.ОбъектИерархии КАК ОбъектИерархии,
				|	ВТ_ОР.ОбъектИерархии КАК ОбъектРемонта,
				|	ВТ_ОР.Родитель КАК РодительИерархии,
				|	ВТ_ОР.Наименование КАК Наименование,
				|	ВТ_ОР.ПометкаУдаления КАК ПометкаУдаления,
				|	ВТ_ОР.ЭтоГруппа КАК ЭтоГруппа,
				#Вставка
				|	ВТ_ОР.Ссылка.ТипОбъекта КАК ТипОбъекта,
				#КонецВставки
				|	ВЫБОР
				|		КОГДА ВТ_ОР.ЭтоГруппа
				|			ТОГДА ВЫБОР
				|					КОГДА ВТ_ОР.ПометкаУдаления
				|						ТОГДА 6
				|					ИНАЧЕ 5
				|				КОНЕЦ
				#Вставка
				|		КОГДА ВТ_ОР.Ссылка.ТипОбъекта = Значение(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто)
				|			ТОГДА ВЫБОР
				|					КОГДА ВТ_ОР.ПометкаУдаления
				|						ТОГДА 12
				|					ИНАЧЕ 11
				|				КОНЕЦ
				#КонецВставки
				|		ИНАЧЕ ВЫБОР
				|				КОГДА ВТ_ОР.ПометкаУдаления
				|					ТОГДА 1
				|				ИНАЧЕ 0
				|			КОНЕЦ
				|	КОНЕЦ КАК ИндексКартинки,
				|	ЕСТЬNULL(торо_ПорядокОРПоИерархии.РеквизитДопУпорядочиванияОР, 0) КАК РеквизитДопУпорядочивания,
				|	ЛОЖЬ КАК ЕстьПодчиненные
				|ИЗ
				|	ВТ_ОР КАК ВТ_ОР
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ПорядокОРПоИерархии КАК торо_ПорядокОРПоИерархии
				|		ПО ВТ_ОР.ОбъектИерархии = торо_ПорядокОРПоИерархии.ОбъектРемонта
				|			И (торо_ПорядокОРПоИерархии.СтруктураИерархии = &СтруктураИерархии)
				|ГДЕ
				|	&УсловиеПоСтатусамВУчете
				|";

				Запрос.УстановитьПараметр("СтруктураИерархии", СтруктураПараметровИерархии.ТекСтруктураИерархии);

				Если ПолучатьСтатусыВУчетеФакт Тогда
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоСтатусамВУчете", 
					"ВТ_ОР.ОбъектИерархии В
					|		(ВЫБРАТЬ
					|			ВТ_ОтборОРПоСтатусам.ОбъектИерархии КАК ОбъектИерархии
					|		ИЗ
					|			ВТ_ОтборОРПоСтатусам КАК ВТ_ОтборОРПоСтатусам)");
				Иначе
					Запрос.УстановитьПараметр("УсловиеПоСтатусамВУчете", Истина);
				КонецЕсли;

			Иначе

				Возврат Новый Массив;

			КонецЕсли;

		КонецЕсли;

		Результат = Запрос.Выполнить();

	Иначе // Не строится автоматически.

		Если СтруктураПараметровИерархии.ИзменяетсяДокументами Тогда

			Запрос = Новый Запрос;

			МенеджерВТ = Новый МенеджерВременныхТаблиц;
			Запрос.МенеджерВременныхТаблиц = МенеджерВТ;

			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВТ_Иерархия.ОбъектИерархии КАК ОбъектИерархии,
			|	ВТ_Иерархия.РодительИерархии КАК РодительИерархии
			|ПОМЕСТИТЬ ОР_ПервогоУровня
			|ИЗ
			|	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(, СтруктураИерархии = &СтруктураИерархии) КАК ВТ_Иерархия
			|ГДЕ
			|	ВТ_Иерархия.РодительИерархии В(&РодителиИерархии)
			|	И ВТ_Иерархия.Удален = ЛОЖЬ
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ОбъектИерархии";

			Запрос.УстановитьПараметр("РодителиИерархии", РодителиИерархии);
			Запрос.УстановитьПараметр("СтруктураИерархии", СтруктураПараметровИерархии.ТекСтруктураИерархии);
			Запрос.Выполнить();

			Если ПолучатьСтатусыВУчетеФакт Тогда
				СоздатьВременнуюТаблицуСОтборомПоСтатусу(МенеджерВТ, ОтборСтатусыВУчете, "ОР_ПервогоУровня");
			КонецЕсли;

			Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ВТ_Иерархия.РодительИерархии КАК РодительИерархии
			|ПОМЕСТИТЬ ВТ_РодителиИерархии
			|ИЗ
			|	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(, СтруктураИерархии = &СтруктураИерархии) КАК ВТ_Иерархия
			|ГДЕ
			|	ВТ_Иерархия.РодительИерархии В
			|			(ВЫБРАТЬ
			|				ОР_ПервогоУровня.ОбъектИерархии
			|			ИЗ
			|				ОР_ПервогоУровня КАК ОР_ПервогоУровня)
			|	И ВТ_Иерархия.Удален = ЛОЖЬ
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	РодительИерархии
			|";

			Запрос.Выполнить();

		Иначе

			Запрос = Новый Запрос;
			МенеджерВТ = Новый МенеджерВременныхТаблиц;
			Запрос.МенеджерВременныхТаблиц = МенеджерВТ;

			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВТ_Иерархия.ОбъектИерархии КАК ОбъектИерархии,
			|	ВТ_Иерархия.РодительИерархии КАК РодительИерархии
			|ПОМЕСТИТЬ ОР_ПервогоУровня
			|ИЗ
			|	РегистрСведений.торо_ИерархическиеСтруктурыОР КАК ВТ_Иерархия
			|ГДЕ
			|	ВТ_Иерархия.РодительИерархии В(&РодителиИерархии)
			|	И ВТ_Иерархия.СтруктураИерархии = &СтруктураИерархии
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ОбъектИерархии";

			Запрос.УстановитьПараметр("РодителиИерархии", РодителиИерархии);
			Запрос.УстановитьПараметр("СтруктураИерархии", СтруктураПараметровИерархии.ТекСтруктураИерархии);
			Запрос.Выполнить();

			Если ПолучатьСтатусыВУчетеФакт Тогда
				СоздатьВременнуюТаблицуСОтборомПоСтатусу(МенеджерВТ, ОтборСтатусыВУчете, "ОР_ПервогоУровня");
			КонецЕсли;

			Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ВТ_Иерархия.РодительИерархии КАК РодительИерархии
			|ПОМЕСТИТЬ ВТ_РодителиИерархии
			|ИЗ
			|	РегистрСведений.торо_ИерархическиеСтруктурыОР КАК ВТ_Иерархия
			|ГДЕ
			|	ВТ_Иерархия.РодительИерархии В
			|			(ВЫБРАТЬ
			|				ОР_ПервогоУровня.ОбъектИерархии
			|			ИЗ
			|				ОР_ПервогоУровня КАК ОР_ПервогоУровня)
			|	И ВТ_Иерархия.СтруктураИерархии = &СтруктураИерархии
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	РодительИерархии";

			Запрос.Выполнить();

		КонецЕсли;

		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОР_ПервогоУровня.ОбъектИерархии КАК ОбъектИерархии,
		|	ОР_ПервогоУровня.РодительИерархии КАК РодительИерархии,
		|	торо_ОбъектыРемонта.ПометкаУдаления КАК ПометкаУдаления,
		|	торо_ОбъектыРемонта.ЭтоГруппа КАК ЭтоГруппа,
		|	ОР_ПервогоУровня.ОбъектИерархии КАК ОбъектРемонта,
		#Вставка
		|	торо_ОбъектыРемонта.ТипОбъекта КАК ТипОбъекта,
		#КонецВставки
		|	ПРЕДСТАВЛЕНИЕ(ОР_ПервогоУровня.ОбъектИерархии) КАК Наименование,
		|	ВЫБОР
		|		КОГДА торо_ОбъектыРемонта.ЭтоГруппа
		|			ТОГДА ВЫБОР
		|					КОГДА торо_ОбъектыРемонта.ПометкаУдаления
		|						ТОГДА 6
		|					ИНАЧЕ 5
		|				КОНЕЦ
		#Вставка
		|		КОГДА торо_ОбъектыРемонта.ТипОбъекта = Значение(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто)
		|			ТОГДА ВЫБОР
		|					КОГДА торо_ОбъектыРемонта.ПометкаУдаления
		|						ТОГДА 12
		|					ИНАЧЕ 11
		|				КОНЕЦ
		#КонецВставки
		|		КОГДА ВТ_РодителиИерархии.РодительИерархии ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА торо_ОбъектыРемонта.ПометкаУдаления
		|						ТОГДА 1
		|					ИНАЧЕ 0
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА торо_ОбъектыРемонта.ПометкаУдаления
		|					ТОГДА 3
		|				ИНАЧЕ 2
		|			КОНЕЦ
		|	КОНЕЦ КАК ИндексКартинки,
		|	ЕСТЬNULL(торо_ПорядокОРПоИерархии.РеквизитДопУпорядочиванияОР, 0) КАК РеквизитДопУпорядочивания,
		|	ЛОЖЬ КАК ЕстьПодчиненные
		|ИЗ
		|	ОР_ПервогоУровня КАК ОР_ПервогоУровня
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|		ПО ОР_ПервогоУровня.ОбъектИерархии = торо_ОбъектыРемонта.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ПорядокОРПоИерархии КАК торо_ПорядокОРПоИерархии
		|		ПО ОР_ПервогоУровня.ОбъектИерархии = торо_ПорядокОРПоИерархии.ОбъектРемонта
		|			И (торо_ПорядокОРПоИерархии.СтруктураИерархии = &СтруктураИерархии)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РодителиИерархии КАК ВТ_РодителиИерархии
		|		ПО ОР_ПервогоУровня.ОбъектИерархии = ВТ_РодителиИерархии.РодительИерархии
		|ГДЕ
		|	(торо_ОбъектыРемонта.ЭтоГруппа = ИСТИНА
		|			ИЛИ (&ВключаяКонечныеЭлементы = ИСТИНА
		|				ИЛИ НЕ ВТ_РодителиИерархии.РодительИерархии ЕСТЬ NULL)
		|				И &УсловиеПоСтатусамВУчете
		|				И &ДополнительныеОтборы)
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеквизитДопУпорядочивания";

		Если ПолучатьСтатусыВУчетеФакт Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоСтатусамВУчете", 
			"ОР_ПервогоУровня.ОбъектИерархии В
			|		(ВЫБРАТЬ
			|			ВТ_ОтборОРПоСтатусам.ОбъектИерархии КАК ОбъектИерархии
			|		ИЗ
			|			ВТ_ОтборОРПоСтатусам КАК ВТ_ОтборОРПоСтатусам)");
		Иначе
			Запрос.УстановитьПараметр("УсловиеПоСтатусамВУчете", Истина);
		КонецЕсли;

		Если ДополнительныеОтборы <> Неопределено И ДополнительныеОтборы.Количество() > 0 Тогда
			ТекстДопОтбора = СформироватьСтрокуДополнительныхОтборовИУстановитьПараметры(ДополнительныеОтборы, "ОР_ПервогоУровня.ОбъектИерархии", Запрос);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДополнительныеОтборы",	ТекстДопОтбора);
		Иначе
			Запрос.УстановитьПараметр("ДополнительныеОтборы", Истина);
		КонецЕсли;

		Запрос.УстановитьПараметр("ВключаяКонечныеЭлементы", ВключаяКонечныеЭлементы);
		Запрос.УстановитьПараметр("СтруктураИерархии", СтруктураПараметровИерархии.ТекСтруктураИерархии);
		Результат = Запрос.Выполнить();

	КонецЕсли;

	МассивСтруктур = торо_ОбщегоНазначения.РезультатЗапросаВМассивСтруктур(Результат);

	Для каждого ДанныеСтроки из МассивСтруктур Цикл
		Если НЕ ЗначениеЗаполнено(ДанныеСтроки.Наименование) Тогда
			ДанныеСтроки.Наименование = Строка(ДанныеСтроки.ОбъектИерархии);
		КонецЕсли;
	КонецЦикла;
	#Вставка
	// Гкс+[TOIR20-100] Борисов В.М. от 20.05.2020. Добавлено:{
	// отсортируем дерево по наименованию
	Если МассивСтруктур.Количество() Тогда
		Таблица = Новый ТаблицаЗначений;
		Для каждого КлючИЗначение Из МассивСтруктур[0] Цикл
			Таблица.Колонки.Добавить(КлючИЗначение.Ключ);
		КонецЦикла;
		Таблица.Колонки.Добавить("Структура");
		
		Для каждого Элемент Из МассивСтруктур Цикл
			СтрокаТЗ = Таблица.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЗ, Элемент);
			СтрокаТЗ.Структура = Элемент;
		КонецЦикла;
		
		Таблица.Сортировать("Наименование Возр");
		МассивСтруктур = Таблица.ВыгрузитьКолонку("Структура");
	КонецЕсли;
	// } Гкс-[TOIR20-100] Борисов В.М. от 20.05.2020.
	#КонецВставки

	Возврат МассивСтруктур;

КонецФункции

&ИзменениеИКонтроль("ПолучитьСтруктуруДанныхСтрокиДляДереваОР")
Функция Расш_гкс_ПолучитьСтруктуруДанныхСтрокиДляДереваОР(СтруктураПараметровИерархии, ОбъектРемонта, ВключаяКонечныеЭлементы)

	СтруктураДанных = Новый Структура("ОбъектИерархии, Наименование, ПометкаУдаления, ЭтоГруппа, ИндексКартинки, РеквизитДопУпорядочивания");

	Запрос = Новый Запрос;

	Если СтруктураПараметровИерархии.СтроитсяАвтоматически Тогда

		Если ВключаяКонечныеЭлементы Тогда

			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	торо_ОбъектыРемонта.Ссылка КАК Ссылка,
			|	ПРЕДСТАВЛЕНИЕ(торо_ОбъектыРемонта.Ссылка) КАК Наименование,
			|	торо_ОбъектыРемонта.ПометкаУдаления КАК ПометкаУдаления,
			|	торо_ОбъектыРемонта.ЭтоГруппа КАК ЭтоГруппа
			|ПОМЕСТИТЬ ВТ_ОР
			|ИЗ
			|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
			|ГДЕ
			|	торо_ОбъектыРемонта.Ссылка = &ОбъектРемонта
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВТ_ОР.Ссылка КАК ОбъектИерархии,
			|	ВТ_ОР.Наименование КАК Наименование,
			|	ВТ_ОР.ПометкаУдаления КАК ПометкаУдаления,
			|	ВТ_ОР.ЭтоГруппа КАК ЭтоГруппа,
			#Вставка
			|	ВТ_ОР.Ссылка.ТипОбъекта КАК ТипОбъекта,
			#КонецВставки
			|	ВЫБОР
			|		КОГДА ВТ_ОР.ЭтоГруппа
			|			ТОГДА ВЫБОР
			|					КОГДА ВТ_ОР.ПометкаУдаления
			|						ТОГДА 6
			|					ИНАЧЕ 5
			|				КОНЕЦ
			#Вставка
			|		КОГДА ВТ_ОР.Ссылка.ТипОбъекта = Значение(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто)
			|			ТОГДА ВЫБОР
			|					КОГДА ВТ_ОР.ПометкаУдаления
			|						ТОГДА 12
			|					ИНАЧЕ 11
			|				КОНЕЦ
			#КонецВставки
			|		ИНАЧЕ ВЫБОР
			|				КОГДА ВТ_ОР.ПометкаУдаления
			|					ТОГДА 1
			|				ИНАЧЕ 0
			|			КОНЕЦ
			|	КОНЕЦ КАК ИндексКартинки,
			|	ЕСТЬNULL(торо_ПорядокОРПоИерархии.РеквизитДопУпорядочиванияОР, 0) КАК РеквизитДопУпорядочивания
			|ИЗ
			|	ВТ_ОР КАК ВТ_ОР
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ПорядокОРПоИерархии КАК торо_ПорядокОРПоИерархии
			|		ПО ВТ_ОР.Ссылка = торо_ПорядокОРПоИерархии.ОбъектРемонта
			|			И (торо_ПорядокОРПоИерархии.СтруктураИерархии = &СтруктураИерархии)";

			Запрос.УстановитьПараметр("СтруктураИерархии", СтруктураПараметровИерархии.ТекСтруктураИерархии);
			Запрос.УстановитьПараметр("ОбъектРемонта", ОбъектРемонта);
			Результат = Запрос.Выполнить();

		Иначе
			Возврат Неопределено;
		КонецЕсли;

	Иначе

		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

		Если СтруктураПараметровИерархии.ИзменяетсяДокументами Тогда

			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.РодительИерархии КАК РодительИерархии
			|ПОМЕСТИТЬ ВТ_РодителиИерархии
			|ИЗ
			|	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(, СтруктураИерархии = &СтруктураИерархии) КАК торо_РасположениеОРВСтруктуреИерархииСрезПоследних
			|ГДЕ
			|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.РодительИерархии = &ОбъектРемонта
			|	И торо_РасположениеОРВСтруктуреИерархииСрезПоследних.Удален = ЛОЖЬ";

		Иначе

			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	торо_ИерархическиеСтруктурыОР.РодительИерархии КАК РодительИерархии
			|ПОМЕСТИТЬ ВТ_РодителиИерархии
			|ИЗ
			|	РегистрСведений.торо_ИерархическиеСтруктурыОР КАК торо_ИерархическиеСтруктурыОР
			|ГДЕ
			|	торо_ИерархическиеСтруктурыОР.СтруктураИерархии = &СтруктураИерархии
			|	И торо_ИерархическиеСтруктурыОР.РодительИерархии = &ОбъектРемонта";

		КонецЕсли;

		Запрос.УстановитьПараметр("СтруктураИерархии", СтруктураПараметровИерархии.ТекСтруктураИерархии);
		Запрос.УстановитьПараметр("ОбъектРемонта", ОбъектРемонта);

		Запрос.Выполнить();

		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ОбъектыРемонта.Ссылка КАК Ссылка,
		|	ПРЕДСТАВЛЕНИЕ(торо_ОбъектыРемонта.Ссылка) КАК Наименование,
		|	торо_ОбъектыРемонта.ПометкаУдаления КАК ПометкаУдаления,
		|	торо_ОбъектыРемонта.ЭтоГруппа КАК ЭтоГруппа
		|ПОМЕСТИТЬ ВТ_ОР
		|ИЗ
		|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|ГДЕ
		|	торо_ОбъектыРемонта.Ссылка = &ОбъектРемонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ОР.Ссылка КАК ОбъектИерархии,
		|	ВТ_ОР.Наименование КАК Наименование,
		|	ВТ_ОР.ПометкаУдаления КАК ПометкаУдаления,
		|	ВТ_ОР.ЭтоГруппа КАК ЭтоГруппа,
		#Вставка
		|	ВТ_ОР.Ссылка.ТипОбъекта КАК ТипОбъекта,
		#КонецВставки
		|	ВЫБОР
		|		КОГДА ВТ_ОР.ЭтоГруппа
		|			ТОГДА ВЫБОР
		|					КОГДА ВТ_ОР.ПометкаУдаления
		|						ТОГДА 6
		|					ИНАЧЕ 5
		|				КОНЕЦ
		#Вставка
		|		КОГДА ВТ_ОР.Ссылка.ТипОбъекта = Значение(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто)
		|			ТОГДА ВЫБОР
		|					КОГДА ВТ_ОР.ПометкаУдаления
		|						ТОГДА 12
		|					ИНАЧЕ 11
		|				КОНЕЦ
		#КонецВставки
		|		КОГДА ВТ_РодителиИерархии.РодительИерархии ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА ВТ_ОР.ПометкаУдаления
		|						ТОГДА 1
		|					ИНАЧЕ 0
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВТ_ОР.ПометкаУдаления
		|					ТОГДА 3
		|				ИНАЧЕ 2
		|			КОНЕЦ
		|	КОНЕЦ КАК ИндексКартинки,
		|	ЕСТЬNULL(торо_ПорядокОРПоИерархии.РеквизитДопУпорядочиванияОР, 0) КАК РеквизитДопУпорядочивания
		|ИЗ
		|	ВТ_ОР КАК ВТ_ОР
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ПорядокОРПоИерархии КАК торо_ПорядокОРПоИерархии
		|		ПО ВТ_ОР.Ссылка = торо_ПорядокОРПоИерархии.ОбъектРемонта
		|			И (торо_ПорядокОРПоИерархии.СтруктураИерархии = &СтруктураИерархии)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РодителиИерархии КАК ВТ_РодителиИерархии
		|		ПО ВТ_ОР.Ссылка = ВТ_РодителиИерархии.РодительИерархии
		|ГДЕ
		|	(&ВключаяКонечныеЭлементы = ИСТИНА
		|			ИЛИ ВТ_ОР.ЭтоГруппа
		|			ИЛИ НЕ ВТ_РодителиИерархии.РодительИерархии ЕСТЬ NULL)";

		Запрос.УстановитьПараметр("ВключаяКонечныеЭлементы", ВключаяКонечныеЭлементы);
		Результат = Запрос.Выполнить();

	КонецЕсли;

	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();

		ЗаполнитьЗначенияСвойств(СтруктураДанных, Выборка);

		Если НЕ ЗначениеЗаполнено(СтруктураДанных.Наименование) Тогда
			СтруктураДанных.Наименование = Строка(СтруктураДанных.ОбъектИерархии);
		КонецЕсли;

		Возврат СтруктураДанных;
	КонецЕсли;

КонецФункции

// ПОлучает Индекст картинки ОР в дереве
Функция гкс_ПолучитьИндексКартинкиДереваНеавтоматическойИерархии(ПометкаУдаления, ЭтоГруппа, ЭтоСоставной, ЭтоФМ = Ложь)
	ИндексКартинки = 0;
	
	Если ЭтоГруппа Тогда
		Если ПометкаУдаления Тогда
			ИндексКартинки = 6;
		Иначе
			ИндексКартинки = 5;
		КонецЕсли;
	ИначеЕсли ЭтоФМ Тогда
		Если ПометкаУдаления Тогда
			ИндексКартинки = 12;
		Иначе
			ИндексКартинки = 11;
		КонецЕсли;
	ИначеЕсли ЭтоСоставной Тогда
		Если ПометкаУдаления Тогда
			ИндексКартинки = 3;
		Иначе
			ИндексКартинки = 2;
		КонецЕсли;
	Иначе
		Если ПометкаУдаления Тогда
			ИндексКартинки = 1;
		Иначе
			ИндексКартинки = 0;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ИндексКартинки;
	
КонецФункции
#КонецОбласти