Процедура НайтиППРкПролонгации() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Док.Ссылка КАК Ссылка,
		|	Док.КоличествоПериодов КАК КоличествоПериодов,
		|	Док.ДатаПланирования КАК ДатаПланирования,
		|	Док.ПериодичностьДетализации КАК Периодичность
		|ИЗ
		|	РегистрСведений.гкс_ПролонгацияППР КАК Рег
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ПланГрафикРемонта КАК Док
		|		ПО Рег.Документ = Док.Ссылка
		|ГДЕ
		|	Док.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Периодичность = Перечисления.Периодичность.Год Тогда 
			НоваяДатаНачала = ДобавитьМесяц(Выборка.ДатаПланирования, Выборка.КоличествоПериодов * 12);
			ДатаПриближения = ДобавитьМесяц(НоваяДатаНачала, -2);
		ИначеЕсли Выборка.Периодичность = Перечисления.Периодичность.Полугодие Тогда 
			НоваяДатаНачала = ДобавитьМесяц(Выборка.ДатаПланирования, Выборка.КоличествоПериодов * 6);
			ДатаПриближения = ДобавитьМесяц(НоваяДатаНачала, -1);
		ИначеЕсли Выборка.Периодичность = Перечисления.Периодичность.Месяц Тогда 
			НоваяДатаНачала = ДобавитьМесяц(Выборка.ДатаПланирования, Выборка.КоличествоПериодов);
			ДатаПриближения = НоваяДатаНачала - 10 * 86400;
		ИначеЕсли Выборка.Периодичность = Перечисления.Периодичность.Квартал Тогда 
			НоваяДатаНачала = ДобавитьМесяц(Выборка.ДатаПланирования, Выборка.КоличествоПериодов * 4);
			ДатаПриближения = ДобавитьМесяц(НоваяДатаНачала, -2);
		Иначе
			ВключитьПролонгациюППР(Выборка.Ссылка, Ложь);
		КонецЕсли;
		Если ДатаПриближения < ТекущаяДата() Тогда 
			СоздатьИПровестиКопиюППР(Выборка.Ссылка, НоваяДатаНачала);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьИПровестиКопиюППР(СтарыйППР, НоваяДатаНачала)
	ДокОб = СтарыйППР.Скопировать();
	ДокОб.Дата = ТекущаяДата();
	ДокОб.Номер = "";
	ДокОб.ДатаПланирования = НоваяДатаНачала;
	ДокОб.ПланРемонтов.Очистить();
	ДокОб.ИсторияСтатусов.Очистить();
	ДокОб.Согласующие.Очистить();
	ДокОб.Записать();
	//
	ВыполинтьРасчет = Истина;
	#Область Нормативы
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Таб.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	               |	Таб.НомерСтроки,
	               |	Таб.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	               |	Таб.ЭтоЦепочка
	               |ПОМЕСТИТЬ ВТ_ОбъектыРемонтаИзППР
	               |ИЗ
	               |	&Таб КАК Таб
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ВидРемонтныхРабот,
	               |	ОбъектРемонтныхРабот
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ОбъектыРемонтаИзППР.ВидРемонтныхРабот,
	               |	ВТ_ОбъектыРемонтаИзППР.НомерСтроки,
	               |	ВТ_ОбъектыРемонтаИзППР.ОбъектРемонтныхРабот,
	               |	ВТ_ОбъектыРемонтаИзППР.ЭтоЦепочка
	               |ИЗ
	               |	ВТ_ОбъектыРемонтаИзППР КАК ВТ_ОбъектыРемонтаИзППР
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_НормативныеРемонтыОборудования КАК торо_НормативныеРемонтыОборудования
	               |		ПО ВТ_ОбъектыРемонтаИзППР.ВидРемонтныхРабот = торо_НормативныеРемонтыОборудования.ВидРемонта
	               |			И ВТ_ОбъектыРемонтаИзППР.ОбъектРемонтныхРабот = торо_НормативныеРемонтыОборудования.ОбъектРемонта
	               |			И (НЕ ВТ_ОбъектыРемонтаИзППР.ЭтоЦепочка)
	               |ГДЕ
	               |	торо_НормативныеРемонтыОборудования.НеУчаствуетВПланировании = ЛОЖЬ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_ОбъектыРемонтаИзППР.ВидРемонтныхРабот,
	               |	ВТ_ОбъектыРемонтаИзППР.НомерСтроки,
	               |	ВТ_ОбъектыРемонтаИзППР.ОбъектРемонтныхРабот,
	               |	ВТ_ОбъектыРемонтаИзППР.ЭтоЦепочка
	               |ИЗ
	               |	ВТ_ОбъектыРемонтаИзППР КАК ВТ_ОбъектыРемонтаИзППР
	               |ГДЕ
	               |	ВТ_ОбъектыРемонтаИзППР.ЭтоЦепочка
						|	И ВЫРАЗИТЬ(ВТ_ОбъектыРемонтаИзППР.ОбъектРемонтныхРабот КАК Справочник.торо_ОбъектыРемонта).НеУчаствуетВПланировании = ЛОЖЬ";
						
	
	Запрос.УстановитьПараметр("Таб", ДокОб.ОбъектыРемонта.Выгрузить());
	
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		// нет нормативов
		ВыполинтьРасчет = Ложь;
	Иначе
		ОбъектыРемонтаИзППР = Результат.Выгрузить();
	КонецЕсли;
	#КонецОбласти
	Если ВыполинтьРасчет Тогда 
		ТаблицаОбъектыРемонта = Новый ТаблицаЗначений;
		ТаблицаОбъектыРемонта.Колонки.Добавить("ОбъектРемонтныхРабот", Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта"));
		ТаблицаОбъектыРемонта.Колонки.Добавить("ВидРемонтныхРабот",    Новый ОписаниеТипов("СправочникСсылка.торо_ВидыРемонтов"));
		
		ТаблицаЦепочки = Новый ТаблицаЗначений;
		ТаблицаЦепочки.Колонки.Добавить("ОбъектРемонтныхРабот", Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта"));
		ТаблицаЦепочки.Колонки.Добавить("Цепочка",              Новый ОписаниеТипов("СправочникСсылка.торо_ЦепочкиРемонта"));
		//
		Для Каждого ОР Из ОбъектыРемонтаИзППР Цикл
			Если ТипЗнч(ОР.ВидРемонтныхРабот) = Тип("СправочникСсылка.торо_ЦепочкиРемонта") Тогда
				НС = ТаблицаЦепочки.Добавить();
				ЗаполнитьЗначенияСвойств(НС,ОР);
				НС.Цепочка = ОР.ВидРемонтныхРабот;
			ИначеЕсли ТипЗнч(ОР.ВидРемонтныхРабот) = Тип("СправочникСсылка.торо_ВидыРемонтов") Тогда
				Если ОР.ОбъектРемонтныхРабот.НеУчаствуетВПланировании тогда Продолжить; КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(ТаблицаОбъектыРемонта.Добавить(),ОР);
			КонецЕсли;
		КонецЦикла;
		
		СтруктураДанных = Новый Структура();
		
		
		СтруктураДанных.Вставить("ТаблицаПланРемонтов", ДокОб.ПланРемонтов.Выгрузить());
		
		СтруктураДанных.Вставить("ТаблицаОбъектыРемонта",    ТаблицаОбъектыРемонта);
		СтруктураДанных.Вставить("ТаблицаЦепочки",           ТаблицаЦепочки);
		СтруктураДанных.Вставить("ДатаПланирования",         ДокОб.ДатаПланирования);
		СтруктураДанных.Вставить("ПериодичностьДетализации", ДокОб.ПериодичностьДетализации);
		СтруктураДанных.Вставить("КоличествоПериодов",       ДокОб.КоличествоПериодов);
		//
		ИмяОбработки = "торо_ЗащитаУправлениеРемонтами83";
		ТабР = торо_СЛКСервер.ЗаполнитьПланГрафикППР_Session(ИмяОбработки, СтруктураДанных,, ДокОб.Ссылка);
		ДокОб.ПланРемонтов.Очистить();
		Для Каждого СТ Из ТабР Цикл
			НС = ДокОб.ПланРемонтов.Добавить();
			ЗаполнитьЗначенияСвойств(НС, СТ);
		КонецЦикла;
	КонецЕсли;
	ВключитьПролонгациюППР(СтарыйППР, Ложь);
	ВключитьПролонгациюППР(ДокОб.Ссылка, Истина);
	Попытка
		ДокОб.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		//
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не удалось провести пролонгированный " + Строка(ДокОб.Ссылка);
		Сообщение.Сообщить();
	КонецПопытки;
КонецПроцедуры

Процедура ВключитьПролонгациюППР(Ссылка, Добавить) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	НЗ = РегистрыСведений.гкс_ПролонгацияППР.СоздатьНаборЗаписей();
	НЗ.Отбор.Документ.Установить(Ссылка);
	Если Добавить Тогда 
		НС = НЗ.Добавить();
		НС.Документ = Ссылка;
	КонецЕсли;
	НЗ.Записать();
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Процедура ДобавитьЭлементыНаФорму(Форма, Родитель) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	МассРекв = Новый Массив();
	МассРекв.Добавить(Новый РеквизитФормы("гкс_ПродлеватьАвтоматически", Новый ОписаниеТипов("Булево"),, "Автоматическое пролонгирование"));
	Форма.ИзменитьРеквизиты(МассРекв);
	//
	НЭлем = Форма.Элементы.Добавить("гкс_АвтоматическоеПролонгирование", Тип("ПолеФормы"), Родитель);
	НЭлем.Вид = ВидПоляФормы.ПолеФлажка;
	НЭлем.Заголовок = НСтр("ru='Автоматическое пролонгирование'");
	НЭлем.ПутьКДанным = "гкс_ПродлеватьАвтоматически";
	НЭлем.УстановитьДействие("ПриИзменении", "гкс_ПродлеватьАвтоматическиПриИзменении");
	//
	НЗ = РегистрыСведений.гкс_ПролонгацияППР.СоздатьНаборЗаписей();
	НЗ.Отбор.Документ.Установить(Форма.Объект.Ссылка);
	НЗ.Прочитать();
	Если НЗ.Количество() Тогда 
		Форма.ЭтотОбъект["гкс_ПродлеватьАвтоматически"] = Истина;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Процедура гкс_ПролонгацияППР() Экспорт
	НайтиППРкПролонгации();
КонецПроцедуры

// Добавлять на форму
//&НаКлиенте
//Процедура гкс_ПродлеватьАвтоматическиПриИзменении(Элемент)
//	гкс_ПересчетППР.ВключитьПролонгациюППР(Объект.Ссылка, ЭтотОбъект["гкс_ПродлеватьАвтоматически"]);
//КонецПроцедуры