///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТолькоПросмотр = Истина;
	
	РасшифровкаСоставаПолей = РасшифровкаСоставаПолей(Объект.СоставПолей);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВключитьВозможностьРедактирования(Команда)
	
	ТолькоПросмотр = Ложь;
	
	ПоказатьПредупреждение(,
		НСтр("es='No debe cambiar la clave de acceso, puesto que él es confrontado con los objetos diferentes. "
"Para corregir el problema no estandartizado debe quitar la clave de acceso o "
"el enlace con él en los registros y cumplir el procedimiento de la renovación del acceso.';ru='Ключ доступа не следует изменять, так как он сопоставлен с разными объектами."
"Чтобы исправить нестандартную проблему следует удалить ключ доступа или"
"связь с ним в регистрах и выполнить процедуру обновления доступа.';en='The passkey should not be changed because it is mapped to different objects."
"To fix a non-standard problem, delete the passkey or"
"contact him in the registers and perform the update access procedure. '"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция РасшифровкаСоставаПолей(СоставПолей)
	
	ТекущееЧисло = СоставПолей;
	Расшифровка = "";
	
	НомерТабличнойЧасти = 0;
	Пока ТекущееЧисло > 0 Цикл
		Остаток = ТекущееЧисло - Цел(ТекущееЧисло / 16) * 16;
		Если НомерТабличнойЧасти = 0 Тогда
			Расшифровка = НСтр("es='El gorro';ru='Шапка';en='Header   '") + ": " + Остаток;
		Иначе
			Расшифровка = Расшифровка + ", " + НСтр("es='La parte tabular';ru='Табличная часть';en='Tabular part'") + " " + НомерТабличнойЧасти + ": " + Остаток;
		КонецЕсли;
		ТекущееЧисло = Цел(ТекущееЧисло / 16);
		НомерТабличнойЧасти = НомерТабличнойЧасти + 1;
	КонецЦикла;
	
	Возврат Расшифровка;
	
КонецФункции

#КонецОбласти
