#Область ОбработчикиСобытийФормы

&НаСервере
&После("ПриСозданииНаСервере")
Процедура Расш_гкс_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДобавитьНовыеЭлементы();
	
	торо_ЛокализацияМодификацияФорм.ПеревестиДинамическийСписок(ЭтаФорма, Список, "Комментарий,Наименование",
		Метаданные.Справочники.торо_ОбъектыРемонта);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьНовыеЭлементы()
	МассивРеквизитов = Новый Массив();
	
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ФОИспользоватьФункциональныеМеста", Новый ОписаниеТипов("Булево")));
	
	ИзменитьРеквизиты(МассивРеквизитов);
	//
	ЭтотОбъект["ФОИспользоватьФункциональныеМеста"] = Константы.торо_ИспользоватьФункциональныеМеста.Получить();
	//
	НГруппа = элементы.Добавить("ПодменюФМ", Тип("ГруппаФормы"), Элементы.ОсновнаяКоманднаяПанель);
	НГруппа.Заголовок = НСтр("en='Add FP';es='Añadir fm';ru='Добавить ФМ'");
	НГруппа.Вид = ВидГруппыФормы.Подменю;
	НГруппа.Видимость = ЭтотОбъект["ФОИспользоватьФункциональныеМеста"];
	//
	НКом = Команды.Добавить("СоздатьФМ");
	НКом.Действие = "СоздатьФМ";
	НКом.Заголовок = НСтр("en='New';es='Nuevo';ru='Новое'");
	НКом.Подсказка = "Создать функциональное место";
	НКом.Картинка = БиблиотекаКартинок.СоздатьЭлементСписка;
	//
	НЭлем = Элементы.Добавить("Кнопка_СоздатьФМ", Тип("КнопкаФормы"), Элементы["ПодменюФМ"]);
	НЭлем.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НЭлем.ИмяКоманды = "СоздатьФМ";
	//
	НКом = Команды.Добавить("ДобавитьФМИзИерархии");
	НКом.Действие = "ФМИзДругойИерархии";
	НКом.Заголовок = НСтр("en='From a different hierarchy';es='De otra jerarquía';ru='Из другой иерархии'");
	НКом.Подсказка = "Создать функциональное место";
	НКом.Картинка = БиблиотекаКартинок.СоздатьЭлементСписка;
	//
	НЭлем = Элементы.Добавить("Кнопка_ДобавитьФМИзИерархии", Тип("КнопкаФормы"), Элементы["ПодменюФМ"]);
	НЭлем.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НЭлем.ИмяКоманды = "ДобавитьФМИзИерархии";
	//
	ТемпСтрукт = Новый Структура("ФормаСоздатьГруппу,ФормаИзменить,ПереключитьНаВидДерева",
		Неопределено, Неопределено, Неопределено);
	ЗаполнитьЗначенияСвойств(ТемпСтрукт,Элементы);
	Если Не ТемпСтрукт.ФормаСоздатьГруппу = Неопределено Тогда 
		Элементы.Переместить(Элементы["ПодменюФМ"], Элементы.ОсновнаяКоманднаяПанель, Элементы.ФормаСоздатьГруппу);
	ИначеЕсли Не ТемпСтрукт.ФормаИзменить = Неопределено Тогда 
		Элементы.Переместить(Элементы["ПодменюФМ"], Элементы.ОсновнаяКоманднаяПанель, Элементы.ФормаИзменить);
	ИначеЕсли Не ТемпСтрукт.ПереключитьНаВидДерева = Неопределено Тогда 
		Элементы.Переместить(Элементы["ПодменюФМ"], Элементы.ОсновнаяКоманднаяПанель, Элементы.ПереключитьНаВидДерева);
	КонецЕсли;
	
	// гкс+ [8220] Тарасов 19.10.2020
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "НЕОПРЕДЕЛЕНО КАК СтатусВУчете", 
																"НЕОПРЕДЕЛЕНО КАК СтатусВУчете,
																|	торо_ОбъектыРемонта.гкс_КатегорияРиска КАК гкс_ПриоритетОР");
	
	НЭлем = Элементы.Вставить("гкс_ПриоритетОР", Тип("ПолеФормы"), Элементы.Список, Элементы.Код);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Список.гкс_ПриоритетОР";
	// гкс+ [] Деснол 16.08.2022
	НЭлем.Заголовок = НСтр("ru='Категория риска';
	// гкс- [] Деснол 16.08.2022
							|en='Repair object priority';
							|es='Prioridad de objeto de reparación'");
	
	гкс_УстановитьУсловноеОформлениеНаПриоритетОР(Список);
	// гкс- [8220] Тарасов 19.10.2020
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьФМ(Команда)
	Если Этаформа.ТекущийЭлемент = Элементы.Дерево Тогда 
		ТекДанные = Элементы.Дерево.ТекущиеДанные;
	Иначе
		ТекДанные = Элементы.Список.ТекущиеДанные;
	КонецЕсли;
	Если Не ТекДанные = Неопределено Тогда 
		ТемпРодитель = ТекДанные.Ссылка;
		ОткрытьФорму("Справочник.торо_ОбъектыРемонта.Форма.ФормаЭлемента",
		Новый Структура("СтруктураИерархии, РодительИерархии, СоздатьФМ", ТекСтруктураИерархии, ТемпРодитель, Истина));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФМИзДругойИерархии()
	Если Этаформа.ТекущийЭлемент = Элементы.Дерево Тогда 
		ТекДанные = Элементы.Дерево.ТекущиеДанные;
	Иначе
		ТекДанные = Элементы.Список.ТекущиеДанные;
	КонецЕсли;

	Если Не ТекДанные = Неопределено Тогда 
		ТемпРодитель = ТекДанные.Ссылка;
		СтруктураОпОп = Новый Структура("Родитель, Иерархия", ТемпРодитель, ТекСтруктураИерархии);
		ОписаниеОповещенияФормыВыбора = Новый ОписаниеОповещения("ДобавитьФМВИерархию", ЭтотОбъект, СтруктураОпОп);
		СтрПарметрыФормы = Новый Структура("ОтборТипОбъекта,ИспользоватьОтборТипОбъекта",
				торо_ОбщегоНазначенияКлиентПовтИсп.ПолучитьПеречисление("торо_ТипыОбъектовRCM", "ФункциональноеМесто"), Истина);
		ОткрытьФорму("Справочник.торо_ОбъектыРемонта.ФормаВыбора",СтрПарметрыФормы,,,,, 
			ОписаниеОповещенияФормыВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФМВИерархию(Результат, ДопПараметры)Экспорт
	Если ЗначениеЗаполнено(Результат) Тогда 
		Если ДопПараметры.Родитель = Результат Тогда 
			Возврат;
		КонецЕсли;
		ДобавитьФМВИерархиюНаСервере(Результат, ДопПараметры.Родитель, ДопПараметры.Иерархия);
		
		торо_РаботаСИерархией20Клиент.ОбновитьДеревоИерархии(ЭтаФорма, "Дерево");
		Если КореньПолногоДерева <> Неопределено Тогда 
			ОбновитьПолноеДерево(Неопределено);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьФМВИерархиюНаСервере(ФМ, Родитель, Иерархия)
	Если ТипЗнч(ФМ) = Тип("Массив") Тогда 
		Для Каждого СтрокаМассива Из ФМ Цикл
			Если Иерархия.ИзменяетсяДокументами Тогда 
				НовыйДокумент = Документы.торо_ИзменениеПоложенияВСтруктуреИерархии.СоздатьДокумент();
				НовыйДокумент.Дата = ТекущаяДата();
				НовыйДокумент.Комментарий = НСтр("ru = 'Добавлен из другой иерархии';"
				+ " en = 'Added from a different hierarchy'; es = 'Agregado de una jerarquía diferente'");
				НовыйДокумент.СтруктураИерархии = Иерархия;
				НовыйДокумент.Ответственный = ПараметрыСеанса.ТекущийПользователь;
				НоваяСтрока = НовыйДокумент.ПоложенияВСтруктуреИерархии.Добавить();
				НоваяСтрока.ОбъектИерархии = СтрокаМассива;
				НоваяСтрока.РодительИерархии = Родитель;
				НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				НаборЗаписей = РегистрыСведений.торо_ИерархическиеСтруктурыОР.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ОбъектИерархии.Установить(СтрокаМассива);
				НаборЗаписей.Отбор.СтруктураИерархии.Установить(Иерархия);
				НоваяСтрока = НаборЗаписей.Добавить();
				НоваяСтрока.ОбъектИерархии = СтрокаМассива;
				НоваяСтрока.СтруктураИерархии = Иерархия;
				НоваяСтрока.РодительИерархии = Родитель;
				НаборЗаписей.Записать();
			КонецЕсли;
		КонецЦикла;
	Иначе
		Если Иерархия.ИзменяетсяДокументами Тогда 
			НовыйДокумент = Документы.торо_ИзменениеПоложенияВСтруктуреИерархии.СоздатьДокумент();
			НовыйДокумент.Дата = ТекущаяДата();
			НовыйДокумент.Комментарий = НСтр("ru = 'Добавлен из другой иерархии';"
			+ " en = 'Added from a different hierarchy'; es = 'Agregado de una jerarquía diferente'");
			НовыйДокумент.СтруктураИерархии = Иерархия;
			НовыйДокумент.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			НоваяСтрока = НовыйДокумент.ПоложенияВСтруктуреИерархии.Добавить();
			НоваяСтрока.ОбъектИерархии = ФМ;
			НоваяСтрока.РодительИерархии = Родитель;
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			НаборЗаписей = РегистрыСведений.торо_ИерархическиеСтруктурыОР.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ОбъектИерархии.Установить(ФМ);
			НаборЗаписей.Отбор.СтруктураИерархии.Установить(Иерархия);
			НоваяСтрока = НаборЗаписей.Добавить();
			НоваяСтрока.ОбъектИерархии = ФМ;
			НоваяСтрока.СтруктураИерархии = Иерархия;
			НоваяСтрока.РодительИерархии = Родитель;
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// гкс+ [8220] Тарасов 19.10.2020
&НаСервереБезКонтекста
Процедура гкс_УстановитьУсловноеОформлениеНаПриоритетОР(Список)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_КатегорииРиска.Ссылка КАК КатегорииРиска,
	|	торо_КатегорииРиска.Представление КАК Представление,
	|	торо_КатегорииРиска.Цвет КАК Цвет
	|ИЗ
	|	Справочник.торо_КатегорииРиска КАК торо_КатегорииРиска";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЭлементУсловногоОформления = Список.УсловноеОформление.Элементы.Добавить();
		ЭлементУсловногоОформления.Представление = ""+Выборка.Представление;
		
		ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("гкс_ПриоритетОР"); 
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
		ЭлементОтбора.ПравоеЗначение = Выборка.КатегорииРиска;
		
		ЦветФона = Выборка.Цвет.Получить();
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФона);
		  
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить(); 
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("гкс_ПриоритетОР");
		
	КонецЦикла;
	
КонецПроцедуры// гкс- [8220] Тарасов 19.10.2020

#КонецОбласти