
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("сзСтатусОР") Тогда
		сзСтатусОР = Параметры.сзСтатусОР;
	Иначе 
		сзСтатусОР = Новый СписокЗначений;
	КонецЕсли;
	
	дз = Новый ДеревоЗначений;
	дз.Колонки.Добавить("СостояниеОР");
	дз.Колонки.Добавить("ТехИмя");
	
	стрРодитель = дз.Строки.Добавить();
	// >> [Деснол] [Ушаков А.Д.] [03.10.2019] 
	стрРодитель.СостояниеОР = НСтр("es='El documento ""Detectado el defecto""';ru='Документ ""Выявленный дефект""';en='The document ""the defect""'");
	нс = стрРодитель.Строки.Добавить();
	нс.СостояниеОР = НСтр("es='Registrado';ru='Зарегистрирован';en='Registered'"); 
	нс.ТехИмя = НСтр("es='Registrado (detectado el defecto)';ru='Зарегистрирован (выявленный дефект)';en='Registered (detected defect)'");
	нс = стрРодитель.Строки.Добавить();
	нс.СостояниеОР = НСтр("es='Está prevista la eliminación de';ru='Запланировано устранение';en='Scheduled for elimination'"); 
	нс.ТехИмя = НСтр("es='Está prevista la solución de (detectado el defecto)';ru='Запланировано устранение (выявленный дефект)';en='The planned elimination of (detected defect)'");
	нс = стрРодитель.Строки.Добавить();
	нс.СостояниеОР = НСтр("es='Se soluciona';ru='Устраняется';en='Is eliminated'");
	нс.ТехИмя = НСтр("es='Resuelve el problema (descripción defecto)';ru='Устраняется (выявленный дефект)';en='Eliminated (revealed defect)'");
	нс = стрРодитель.Строки.Добавить();
	нс.СостояниеОР = НСтр("es='Eliminado';ru='Устранен';en='Fixed'");
	нс.ТехИмя = НСтр("es='Eliminado (detectado el defecto)';ru='Устранен (выявленный дефект)';en='Eliminated (revealed defect)'");

	стрРодитель = дз.Строки.Добавить();
	стрРодитель.СостояниеОР = НСтр("es='El documento ""Externa de base para los trabajos""';ru='Документ ""Внешнее основание для работ""';en='The document ""the External basis for the work""'");
	нс = стрРодитель.Строки.Добавить();
	нс.СостояниеОР = НСтр("es='Registrado';ru='Зарегистрирован';en='Registered'"); 
	нс.ТехИмя = НСтр("es='Registrado (externa de la base)';ru='Зарегистрирован (внешнее основание)';en='Registered (external base)'");
	нс = стрРодитель.Строки.Добавить(); 
	нс.СостояниеОР = НСтр("es='Está prevista la eliminación de';ru='Запланировано устранение';en='Scheduled for elimination'"); 
	нс.ТехИмя = НСтр("es='Está prevista la solución de (externa de la base)';ru='Запланировано устранение (внешнее основание)';en='The planned elimination of (outer base)'");
	нс = стрРодитель.Строки.Добавить(); 
	нс.СостояниеОР = НСтр("es='Se soluciona';ru='Устраняется';en='Is eliminated'"); 
	нс.ТехИмя = НСтр("es='Resuelve el problema (externa de la base)';ru='Устраняется (внешнее основание)';en='Eliminated (external base)'");
	нс = стрРодитель.Строки.Добавить(); 
	нс.СостояниеОР = НСтр("es='Eliminado';ru='Устранен';en='Fixed'"); 
	нс.ТехИмя = НСтр("es='Eliminado (externa de la base)';ru='Устранен (внешнее основание)';en='Eliminated (external base)'");
	стрРодитель = дз.Строки.Добавить();
	стрРодитель.СостояниеОР = НСтр("es='El documento ""el horario de la parada""';ru='Документ ""План-график ППР""';en='The document ""plan-schedule PPM""'");
	нс = стрРодитель.Строки.Добавить(); 
	нс.СостояниеОР = НСтр("en='Introduced PPM';es='Introducido parada';ru='Введен ППР'"); 
	нс.ТехИмя = НСтр("en='Introduced PPM (plan-schedule PPM)';es='Introducido parada (el horario de la parada)';ru='Введен ППР (план-график ППР)'");
	нс = стрРодитель.Строки.Добавить(); 
	нс.СостояниеОР = НСтр("es='Está prevista la ejecución de';ru='Запланировано выполнение';en='Scheduled execution'"); 
	нс.ТехИмя = НСтр("es='Está prevista la ejecución (el horario de la parada)';ru='Запланировано выполнение (план-график ППР)';en='Scheduled execution (plan-schedule PPM)'");
	нс = стрРодитель.Строки.Добавить(); 
	нс.СостояниеОР = НСтр("es='Se';ru='Выполняется';en='Performed'"); 
	нс.ТехИмя = НСтр("en='Hold true (plan-schedule PPM)';es='Se ejecuta (el horario de la parada)';ru='Выполняется (план-график ППР)'");
	нс = стрРодитель.Строки.Добавить(); 
	нс.СостояниеОР = НСтр("es='Ejecutado';ru='Выполнен';en='Completed'"); 
	нс.ТехИмя = НСтр("en='Done (plan-schedule PPM)';es='Ejecutado (el horario de la parada)';ru='Выполнен (план-график ППР)'");

	//стрРодитель.СостояниеОР = "Документ ""Выявленный дефект""";
	//нс = стрРодитель.Строки.Добавить();	нс.СостояниеОР = "Зарегистрирован"; нс.ТехИмя = "Зарегистрирован (выявленный дефект)";
	//нс = стрРодитель.Строки.Добавить();	нс.СостояниеОР = "Запланировано устранение"; нс.ТехИмя = "Запланировано устранение (выявленный дефект)";
	//нс = стрРодитель.Строки.Добавить();	нс.СостояниеОР = "Устраняется"; нс.ТехИмя = "Устраняется (выявленный дефект)";
	//нс = стрРодитель.Строки.Добавить();	нс.СостояниеОР = "Устранен"; нс.ТехИмя = "Устранен (выявленный дефект)";
	//
	//стрРодитель = дз.Строки.Добавить();
	//стрРодитель.СостояниеОР = "Документ ""Внешнее основание для работ""";
	//нс = стрРодитель.Строки.Добавить(); нс.СостояниеОР = "Зарегистрирован"; нс.ТехИмя = "Зарегистрирован (внешнее основание)";
	//нс = стрРодитель.Строки.Добавить(); нс.СостояниеОР = "Запланировано устранение"; нс.ТехИмя = "Запланировано устранение (внешнее основание)";
	//нс = стрРодитель.Строки.Добавить(); нс.СостояниеОР = "Устраняется"; нс.ТехИмя = "Устраняется (внешнее основание)";
	//нс = стрРодитель.Строки.Добавить(); нс.СостояниеОР = "Устранен"; нс.ТехИмя = "Устранен (внешнее основание)";

	//стрРодитель = дз.Строки.Добавить();
	//стрРодитель.СостояниеОР = "Документ ""План-график ППР""";
	//нс = стрРодитель.Строки.Добавить(); нс.СостояниеОР = "Введен ППР"; нс.ТехИмя = "Введен ППР (план-график ППР)";
	//нс = стрРодитель.Строки.Добавить(); нс.СостояниеОР = "Запланировано выполнение"; нс.ТехИмя = "Запланировано выполнение (план-график ППР)";
	//нс = стрРодитель.Строки.Добавить(); нс.СостояниеОР = "Выполняется"; нс.ТехИмя = "Выполняется (план-график ППР)";
	//нс = стрРодитель.Строки.Добавить(); нс.СостояниеОР = "Выполнен"; нс.ТехИмя = "Выполнен (план-график ППР)";
	// << [Деснол] [Ушаков А.Д.] [03.10.2019] 
	
	тДерево = РеквизитФормыВЗначение("Состояния");
	Для каждого СтрокаР из дз.Строки Цикл
		стрРодитель = тДерево.Строки.Добавить();
		стрРодитель.Состояние = СтрокаР.СостояниеОР;
		стрРодитель.ТехИмя = СтрокаР.ТехИмя;
		ВсеВыбраны = Истина;
		
		Для каждого текСтрока из СтрокаР.Строки Цикл
			НайС = сзСтатусОР.НайтиПоЗначению(текСтрока.ТехИмя);
			нс = стрРодитель.Строки.Добавить();
			нс.Состояние = текСтрока.СостояниеОР;
			нс.ТехИмя = текСтрока.ТехИмя;
			Если НайС <> Неопределено И НайС.Пометка ТОгда
				нс.Выбрать = Истина;
			Иначе 
				нс.Выбрать = Ложь;
				ВсеВыбраны = Ложь;
			КонецЕсли;
		КонецЦикла;
		
		стрРодитель.Выбрать = ВсеВыбраны;
	КонецЦикла;
	ЗначениеВРеквизитФормы(тДерево, "Состояния");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Уровень1 = Состояния.ПолучитьЭлементы();
	Для каждого текСтрока из Уровень1 Цикл
		Элементы.Состояния.Развернуть(текСтрока.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыделитьВсе(Команда)
	Уровень1 = Состояния.ПолучитьЭлементы();
	Для каждого СтрокаУ1 из Уровень1 Цикл
		СтрокаУ1.Выбрать = Истина;
		РаспространитьНаПодчиненные(СтрокаУ1);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВыделение(Команда)
	Уровень1 = Состояния.ПолучитьЭлементы();
	Для каждого СтрокаУ1 из Уровень1 Цикл
		СтрокаУ1.Выбрать = Ложь;
		РаспространитьНаПодчиненные(СтрокаУ1);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Передать(Команда)
	
	сз = Новый СписокЗначений;
	
	Уровень1 = Состояния.ПолучитьЭлементы();
	Для каждого СтрокаУ1 из Уровень1 цикл
		Уровень2 = СтрокаУ1.ПолучитьЭлементы();
		Для каждого СтрокаУ2 из Уровень2 Цикл
			сз.Добавить(СтрокаУ2.ТехИмя, СтрокаУ2.ТехИмя, СтрокаУ2.Выбрать);
		КонецЦикла;
	КонецЦикла;
	
	Закрыть(сз);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СостоянияВыбратьПриИзменении(Элемент)
	
	текСтрока = Элементы.Состояния.ТекущаяСтрока;
	Если текСтрока <> Неопределено Тогда
		СтрокаДерева = Состояния.НайтиПоИдентификатору(текСтрока);
		РаспространитьНаПодчиненные(СтрокаДерева);
		
		стрРодитель = СтрокаДерева.ПолучитьРодителя();
		Если стрРодитель <> Неопределено Тогда
			Уровень1 = стрРодитель.ПолучитьЭлементы();
			ВсеВыбраны = Истина;
			Для каждого СтрокаУ1 из Уровень1 Цикл
				Если НЕ СтрокаУ1.Выбрать Тогда
					ВсеВыбраны = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			стрРодитель.Выбрать = ВсеВыбраны;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РаспространитьНаПодчиненные(СтрокаДерева)
	
	Уровень1 = СтрокаДерева.ПолучитьЭлементы();
	Для каждого СтрокаУ1 из Уровень1 Цикл
		СтрокаУ1.Выбрать = СтрокаДерева.Выбрать;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
