///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОписаниеПеременных

// Хранение контекста взаимодействия с сервисом
&НаКлиенте
Перем КонтекстВзаимодействия Экспорт;

&НаКлиенте
Перем КонтекстРегистрации;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.НадписьЛогина.Заголовок = НСтр("es='El login:';ru='Логин:';en='Login:'") + " " + Параметры.login;
	
	Если КлиентскоеПриложение.ТекущийВариантИнтерфейса() = ВариантИнтерфейсаКлиентскогоПриложения.Такси Тогда
		Элементы.ГруппаЗаголовка.Отображение = ОтображениеОбычнойГруппы.Нет;
		Элементы.ГруппаКонтента.Отображение = ОтображениеОбычнойГруппы.Нет;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Подключение1СТакскомКлиент.ОбработатьОткрытиеФормы(КонтекстВзаимодействия, ЭтотОбъект);
	
	КонтекстРегистрации = КонтекстВзаимодействия.КСКонтекст.КонтекстРегистрации;
	// В дальнейшем контекст регистрации не используется
	КонтекстВзаимодействия.КСКонтекст.КонтекстРегистрации = Неопределено;
	
	НастроитьОтображениеФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Не ПрограммноеЗакрытие Тогда
		Подключение1СТакскомКлиент.ЗавершитьБизнесПроцесс(КонтекстВзаимодействия, ЗавершениеРаботы);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если ОрганизацияПередИзменением = Организация Тогда
		Возврат;
	КонецЕсли;
	
	// В зависимости от того, выполняется ли добавление новой организации
	// или указывается существующая, настроить отображение полей формы.
	
	Если Организация = "-1" Тогда
		УстановитьТолькоПросмотрПолейОрганизации(Ложь);
	Иначе
		УстановитьТолькоПросмотрПолейОрганизации(Истина);
	КонецЕсли;
	
	Если ОрганизацияПередИзменением = "-1" Тогда
		КонтекстРегистрации.ДанныеОрганизаций["-1"] = ДанныеНовойОрганизации();
	КонецЕсли;
	
	ЗаполнитьДанныеПолейОрганизации();
	
	ОрганизацияПередИзменением = Организация;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИмяФормыАдреса = "Обработка.Подключение1СТакском.Форма.ПочтовыйАдрес";
	
	ПараметрыФормы = Новый Структура("ТолькоПросмотр", (Организация <> "-1"));
	
	Если ПараметрыФормы.ТолькоПросмотр Тогда
		ОписаниеОповещения = Неопределено;
	Иначе
		ОписаниеОповещения = Новый ОписаниеОповещения("ПриВводеАдреса", ЭтотОбъект);
	КонецЕсли;
	
	ФормаАдреса = ОткрытьФорму(
		ИмяФормыАдреса,
		ПараметрыФормы,
		ЭтотОбъект,
		,
		,
		,
		ОписаниеОповещения);
	
	ФормаАдреса.КонтекстРегистрации = КонтекстРегистрации;
	
	Подключение1СТакскомКлиент.СкопироватьСписокЗначенийИтерационно(
		КонтекстРегистрации.Страны,
		ФормаАдреса.Элементы.Страна.СписокВыбора);
	
	РегионыСтраны = КонтекстРегистрации.РегионыСтран[ДанныеПочтовогоАдреса.Страна];
	Если РегионыСтраны = Неопределено Тогда
		РегионыСтраны = Новый СписокЗначений;
		РегионыСтраны.Добавить("-1", НСтр("es='<no es escogido>';ru='<не выбран>';en='<не выбран>'"));
	КонецЕсли;
	
	Подключение1СТакскомКлиент.СкопироватьСписокЗначенийИтерационно(
		РегионыСтраны,
		ФормаАдреса.Элементы.КодРегиона.СписокВыбора);
	
	ЗаполнитьЗначенияСвойств(ФормаАдреса, ДанныеПочтовогоАдреса);
	
	ФормаАдреса.ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьВыходНажатие(Элемент)
	
	Подключение1СТакскомКлиент.ОбработатьВыходПользователя(КонтекстВзаимодействия, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПояснениеКЗаголовкуОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "TechSupport" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ТекстСообщения =
			НСтр("es='No logra introducir la información sobre la organización al registro del producto informático. "
""
"El nombre de la organización: %1 "
"Tipo de la actividad: %2 "
"INN: %3 "
"КПП: %4 "
"Dirigentes: %5 "
"Teléfono: %6 "
"Dirección del correo electrónico: %7 "
"Fax: %8';ru='Не получается ввести информацию об организации при регистрации программного продукта."
""
"Название организации: %1"
"Тип деятельности: %2"
"ИНН: %3"
"КПП: %4"
"Руководитель: %5"
"Телефон: %6"
"Адрес электронной почты: %7"
"Факс: %8';en='I cannot enter information about the organization when registering a software product."
""
"Organization name:%1"
"Type of activity:%2"
"INN:%3"
"PPC:%4"
"Manager:%5"
"Phone:%6"
"Email Address:%7"
"Fax:%8'");
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ТекстСообщения,
			НазваниеОрганизации,
			ТипДеятельности,
			ИНН,
			КПП,
			Руководитель,
			Телефон,
			АдресЭлектроннойПочты,
			Факс);
		
		ТекстСообщенияПродолжение = НСтр("es='La dirección: %1 "
"Lugar de la compra: %2 "
"Fecha de la compra: %3 "
"Número de los puestos de trabajo: %4 "
"el empleado Responsable: %5';ru='Адрес: %1"
"Место покупки: %2"
"Дата покупки: %3"
"Число рабочих мест: %4"
"Ответственный сотрудник: %5';en='Address:% 1"
"Place of purchase:% 2"
"Date of purchase:% 3"
"Number of jobs:% 4"
"Responsible employee:% 5'");
		
		ТекстСообщенияПродолжение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ТекстСообщенияПродолжение,
			ПредставлениеАдреса,
			ГдеПриобретенаПрограмма,
			Формат(ДатаПриобретенияПрограммы, "ДЛФ=D"),
			Строка(ЧислоРабочихМест),
			Ответственный);
		
		ИнтернетПоддержкаПользователейКлиент.ОтправитьСообщениеВТехПоддержку(
			НСтр("es='El apoyo de Internet. La introducción de la información sobre la organización.';ru='Интернет-поддержка. Ввод информации об организации.';en='Online support. Enter information about the organization.'"),
			ТекстСообщения + Символы.ПС + ТекстСообщенияПродолжение,
			,
			,
			Новый Структура("Логин, Пароль",
				Подключение1СТакскомКлиент.ЗначениеСессионногоПараметра(
					КонтекстВзаимодействия.КСКонтекст,
					"login"),
				Подключение1СТакскомКлиент.ЗначениеСессионногоПараметра(
					КонтекстВзаимодействия.КСКонтекст,
					"password")));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтправитьАнкету(Команда)
	
	Если НЕ ЗаполнениеПолейКорректно() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗапроса = Новый Массив;
	
	organizationId = ?(Организация = "-1", Неопределено, Организация);
	
	ПараметрыЗапроса.Добавить(Новый Структура("Имя, Значение", "organizationId", organizationId));
	
	Если organizationId = Неопределено Тогда
		
		// Добавить данные новой организации
		ПараметрыЗапроса.Добавить(Новый Структура("Имя, Значение", "organizationName", НазваниеОрганизации));
		ПараметрыЗапроса.Добавить(Новый Структура("Имя, Значение", "typeActivity"    , ТипДеятельности));
		ПараметрыЗапроса.Добавить(Новый Структура("Имя, Значение", "inn"             , СтрЗаменить(ИНН, " ", "")));
		ПараметрыЗапроса.Добавить(Новый Структура("Имя, Значение", "kpp"             , СтрЗаменить(КПП, " ", "")));
		ПараметрыЗапроса.Добавить(Новый Структура("Имя, Значение", "director"        , Руководитель));
		ПараметрыЗапроса.Добавить(Новый Структура("Имя, Значение", "phoneNumber"     , Телефон));
		ПараметрыЗапроса.Добавить(Новый Структура("Имя, Значение", "email"           , АдресЭлектроннойПочты));
		ПараметрыЗапроса.Добавить(Новый Структура("Имя, Значение", "fax"             , Факс));
		
		ПараметрыЗапроса.Добавить(Новый Структура("Имя, Значение",
			"postIndex",
			ДанныеПочтовогоАдреса.Индекс));
		
		ПараметрыЗапроса.Добавить(Новый Структура("Имя, Значение",
			"countryId",
			?(ДанныеПочтовогоАдреса.Страна = "-1", Неопределено, ДанныеПочтовогоАдреса.Страна)));
		
		ПараметрыЗапроса.Добавить(Новый Структура("Имя, Значение",
			"regionId",
			?(ДанныеПочтовогоАдреса.КодРегиона = "-1", Неопределено, ДанныеПочтовогоАдреса.КодРегиона)));
		
		ПараметрыЗапроса.Добавить(Новый Структура("Имя, Значение",
			"area",
			ДанныеПочтовогоАдреса.Район));
		
		ПараметрыЗапроса.Добавить(Новый Структура("Имя, Значение",
			"city",
			ДанныеПочтовогоАдреса.Город));
		
		ПараметрыЗапроса.Добавить(Новый Структура("Имя, Значение",
			"street",
			ДанныеПочтовогоАдреса.Улица));
		
		ПараметрыЗапроса.Добавить(Новый Структура("Имя, Значение",
			"building",
			ДанныеПочтовогоАдреса.Дом));
		
		ПараметрыЗапроса.Добавить(Новый Структура("Имя, Значение",
			"housing",
			ДанныеПочтовогоАдреса.Строение));
		
		ПараметрыЗапроса.Добавить(Новый Структура("Имя, Значение",
			"apartment",
			ДанныеПочтовогоАдреса.Квартира));
		
	КонецЕсли;
	
	ПараметрыЗапроса.Добавить(Новый Структура("Имя, Значение", "buyingPlace", ГдеПриобретенаПрограмма));
	ПараметрыЗапроса.Добавить(Новый Структура("Имя, Значение", "buyingDate", XMLСтрокаЗначения(ДатаПриобретенияПрограммы)));
	ПараметрыЗапроса.Добавить(Новый Структура("Имя, Значение",
		"workPlaceCount",
		СтрЗаменить(Строка(ЧислоРабочихМест), Символ(160), "")));
	ПараметрыЗапроса.Добавить(Новый Структура("Имя, Значение", "responsibleWorker", Ответственный));
	
	Подключение1СТакскомКлиент.ОбработкаКомандСервиса(
		КонтекстВзаимодействия,
		ЭтотОбъект,
		ПараметрыЗапроса);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриОтветеНаВопросОбОтказеОтРегистрации", ЭтотОбъект);
	
	ПоказатьВопрос(ОписаниеОповещения,
		НСтр("es='¿Estáis seguros que queréis negarse al registro del producto informático?';ru='Вы уверены, что хотите отказаться от регистрации программного продукта?';en='Are you sure you want to refuse to register a software product?'"),
		РежимДиалогаВопрос.ДаНет,
		,
		,
		НСтр("es='El registro del producto informático';ru='Регистрация программного продукта';en='Software Product Registration'"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НастроитьОтображениеФормы()
	
	СписокВыбораОрганизаций = Элементы.Организация.СписокВыбора;
	
	Подключение1СТакскомКлиент.СкопироватьСписокЗначенийИтерационно(
		КонтекстРегистрации.СписокОрганизаций,
		СписокВыбораОрганизаций);
	
	Организация = "-1";
	
	ДанныеПочтовогоАдреса = НовыйДанныеПочтовогоАдреса();
	ПредставлениеАдреса   = НСтр("es='<introduzcan la dirección>';ru='<введите адрес>';en='<введите адрес>'");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТолькоПросмотрПолейОрганизации(ТолькоПросмотрПолей)
	
	Элементы.НазваниеОрганизации.ТолькоПросмотр     = ТолькоПросмотрПолей;
	Элементы.ТипДеятельности.ТолькоПросмотр         = ТолькоПросмотрПолей;
	Элементы.ИНН.ТолькоПросмотр                     = ТолькоПросмотрПолей;
	Элементы.КПП.ТолькоПросмотр                     = ТолькоПросмотрПолей;
	Элементы.Руководитель.ТолькоПросмотр            = ТолькоПросмотрПолей;
	Элементы.Телефон.ТолькоПросмотр                 = ТолькоПросмотрПолей;
	Элементы.АдресЭлектроннойПочты.ТолькоПросмотр   = ТолькоПросмотрПолей;
	Элементы.Факс.ТолькоПросмотр                    = ТолькоПросмотрПолей;
	
КонецПроцедуры

&НаКлиенте
Функция ЗаполнениеПолейКорректно()
	
	Отказ = Ложь;
	
	Если Организация = "-1" Тогда
		
		Если ПустаяСтрока(НазваниеОрганизации) Тогда
			СообщитьОбОшибкеЗаполненияПоля(НСтр("es='Campo ""el Nombre de la organización"" no es rellenado.';ru='Поле ""Название организации"" не заполнено.';en='""Organization Name"" field is empty.'"),
				"НазваниеОрганизации",
				Отказ);
		КонецЕсли;
		
		Если ПустаяСтрока(ТипДеятельности) Тогда
			СообщитьОбОшибкеЗаполненияПоля(НСтр("es='Campo ""el Tipo de la actividad"" no es rellenado.';ru='Поле ""Тип деятельности"" не заполнено.';en='The field ""Type of activity"" is empty.'"),
				"ТипДеятельности",
				Отказ);
		КонецЕсли;
		
		Если ПустаяСтрока(ИНН) Тогда
			СообщитьОбОшибкеЗаполненияПоля(НСтр("es='Campo ""el INN"" no es rellenado.';ru='Поле ""ИНН"" не заполнено.';en='""TIN"" field is empty.'"),
				"ИНН",
				Отказ);
		КонецЕсли;
		
		Если ПустаяСтрока(Руководитель) Тогда
			СообщитьОбОшибкеЗаполненияПоля(НСтр("es='Campo ""el Dirigente"" no es rellenado.';ru='Поле ""Руководитель"" не заполнено.';en='""Leader"" field is not filled.'"),
				"Руководитель",
				Отказ);
		КонецЕсли;
		
		Если ПустаяСтрока(Телефон) Тогда
			СообщитьОбОшибкеЗаполненияПоля(НСтр("es='Campo ""Teléfono"" no es rellenado.';ru='Поле ""Телефон"" не заполнено.';en='""Phone"" field is not filled.'"),
				"Телефон",
				Отказ);
		КонецЕсли;
		
		Если ПустаяСтрока(АдресЭлектроннойПочты) Тогда
			СообщитьОбОшибкеЗаполненияПоля(НСтр("es='Campo ""la Dirección del correo electrónico"" no es rellenado.';ru='Поле ""Адрес электронной почты"" не заполнено.';en='Field ""Email Address"" is not filled.'"),
				"АдресЭлектроннойПочты",
				Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПустаяСтрока(ГдеПриобретенаПрограмма) Тогда
		СообщитьОбОшибкеЗаполненияПоля(НСтр("es='Campo ""el Lugar de la compra"" no es rellenado.';ru='Поле ""Место покупки"" не заполнено.';en='Field ""Place of purchase"" is empty.'"),
			"ГдеПриобретенаПрограмма",
			Отказ);
	КонецЕсли;
	
	Если ДатаПриобретенияПрограммы = '00010101' Тогда
		СообщитьОбОшибкеЗаполненияПоля(НСтр("es='Campo ""la Fecha de la compra"" no es rellenado.';ru='Поле ""Дата покупки"" не заполнено.';en='Field ""Date of purchase"" is not filled.'"),
			"ДатаПриобретенияПрограммы",
			Отказ);
	КонецЕсли;
	
	Если ЧислоРабочихМест = 0 Тогда
		СообщитьОбОшибкеЗаполненияПоля(НСтр("es='Campo ""el Número de los puestos de trabajo"" no es rellenado.';ru='Поле ""Число рабочих мест"" не заполнено.';en='The field ""Number of jobs"" is empty.'"),
			"ЧислоРабочихМест",
			Отказ);
	КонецЕсли;
	
	Если ПустаяСтрока(Ответственный) Тогда
		СообщитьОбОшибкеЗаполненияПоля(НСтр("es='Campo ""el empleado Responsable"" no es rellenado.';ru='Поле ""Ответственный сотрудник"" не заполнено.';en='Field ""Responsible employee"" is not filled.'"),
			"Ответственный",
			Отказ);
	КонецЕсли;
	
	Возврат (НЕ Отказ);
	
КонецФункции

&НаКлиенте
Процедура СообщитьОбОшибкеЗаполненияПоля(ТекстСообщения, ИмяПоля, Отказ)
	
	Отказ = Истина;
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Поле  = ИмяПоля;
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОтветеНаВопросОбОтказеОтРегистрации(РезультатВопроса, ДопПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЭтотОбъект.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриВводеАдреса(ОтредактированныеДанныеАдреса, ДопПараметры) Экспорт
	
	Если ТипЗнч(ОтредактированныеДанныеАдреса) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеПочтовогоАдреса = ОтредактированныеДанныеАдреса;
	СформироватьПредставлениеАдреса();
	
КонецПроцедуры

&НаКлиенте
Функция ДанныеНовойОрганизации()
	
	Результат = Новый Структура;
	
	Результат.Вставить("НазваниеОрганизации", НазваниеОрганизации);
	Результат.Вставить("typeActivity"       , ТипДеятельности);
	Результат.Вставить("inn"                , ИНН);
	Результат.Вставить("kpp"                , КПП);
	Результат.Вставить("director "          , Руководитель);
	Результат.Вставить("phoneNumber"        , Телефон);
	Результат.Вставить("email"              , АдресЭлектроннойПочты);
	Результат.Вставить("fax"                , Факс);
	
	Результат.Вставить("countryId"          , ДанныеПочтовогоАдреса.Страна);
	Результат.Вставить("regionId"           , ДанныеПочтовогоАдреса.КодРегиона);
	Результат.Вставить("area"               , ДанныеПочтовогоАдреса.Район);
	Результат.Вставить("postindex"          , ДанныеПочтовогоАдреса.Индекс);
	Результат.Вставить("city"               , ДанныеПочтовогоАдреса.Город);
	Результат.Вставить("street"             , ДанныеПочтовогоАдреса.Улица);
	Результат.Вставить("building"           , ДанныеПочтовогоАдреса.Дом);
	Результат.Вставить("housing"            , ДанныеПочтовогоАдреса.Строение);
	Результат.Вставить("apartment"          , ДанныеПочтовогоАдреса.Квартира);
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция НовыйДанныеПочтовогоАдреса()
	
	Результат = Новый Структура;
	Результат.Вставить("Страна"    , "-1");
	Результат.Вставить("Индекс"    , "");
	Результат.Вставить("КодРегиона", "-1");
	Результат.Вставить("Район"     , "");
	Результат.Вставить("Город"     , "");
	Результат.Вставить("Улица"     , "");
	Результат.Вставить("Дом"       , "");
	Результат.Вставить("Строение"  , "");
	Результат.Вставить("Квартира"  , "");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьДанныеПолейОрганизации()
	
	ДанныеТекОрганизации  = КонтекстРегистрации.ДанныеОрганизаций[Организация];
	ДанныеПочтовогоАдреса = НовыйДанныеПочтовогоАдреса();
	
	Если ДанныеТекОрганизации = Неопределено Тогда
		
		НазваниеОрганизации     = "";
		ТипДеятельности         = "";
		ИНН                     = "";
		КПП                     = "";
		Руководитель            = "";
		Телефон                 = "";
		АдресЭлектроннойПочты   = "";
		Факс                    = "";
		
	Иначе
		
		ДанныеТекОрганизации.Свойство("НазваниеОрганизации"    , НазваниеОрганизации);
		ДанныеТекОрганизации.Свойство("typeActivity"           , ТипДеятельности);
		ДанныеТекОрганизации.Свойство("inn"                    , ИНН);
		ДанныеТекОрганизации.Свойство("kpp"                    , КПП);
		ДанныеТекОрганизации.Свойство("director"               , Руководитель);
		ДанныеТекОрганизации.Свойство("phoneNumber"            , Телефон);
		ДанныеТекОрганизации.Свойство("email"                  , АдресЭлектроннойПочты);
		ДанныеТекОрганизации.Свойство("fax"                    , Факс);
		
		Если ДанныеТекОрганизации.Свойство("countryId") Тогда
			ДанныеПочтовогоАдреса.Вставить("Страна",
				?(ЗначениеЗаполнено(ДанныеТекОрганизации.countryId), ДанныеТекОрганизации.countryId, "-1"));
		Иначе
			ДанныеПочтовогоАдреса.Вставить("Страна", "-1");
		КонецЕсли;
		
		Если ДанныеПочтовогоАдреса.Страна = "-1" Тогда
			ДанныеПочтовогоАдреса.Вставить("КодРегиона", "-1");
		Иначе
			Если ДанныеТекОрганизации.Свойство("regionId") Тогда
				ДанныеПочтовогоАдреса.Вставить("КодРегиона",
					?(ЗначениеЗаполнено(ДанныеТекОрганизации.regionId), ДанныеТекОрганизации.regionId, "-1"));
			Иначе
				ДанныеПочтовогоАдреса.Вставить("КодРегиона", "-1");
			КонецЕсли;
		КонецЕсли;
		
		Если ДанныеТекОрганизации.Свойство("postindex") Тогда
			ДанныеПочтовогоАдреса.Вставить("Индекс", ДанныеТекОрганизации.postindex);
		КонецЕсли;
		
		Если ДанныеТекОрганизации.Свойство("area") Тогда
			ДанныеПочтовогоАдреса.Вставить("Район", ДанныеТекОрганизации.area);
		КонецЕсли;
		
		Если ДанныеТекОрганизации.Свойство("city") Тогда
			ДанныеПочтовогоАдреса.Вставить("Город", ДанныеТекОрганизации.city);
		КонецЕсли;
		
		Если ДанныеТекОрганизации.Свойство("street") Тогда
			ДанныеПочтовогоАдреса.Вставить("Улица", ДанныеТекОрганизации.street);
		КонецЕсли;
		
		Если ДанныеТекОрганизации.Свойство("building") Тогда
			ДанныеПочтовогоАдреса.Вставить("Дом", ДанныеТекОрганизации.building);
		КонецЕсли;
		
		Если ДанныеТекОрганизации.Свойство("housing") Тогда
			ДанныеПочтовогоАдреса.Вставить("Строение", ДанныеТекОрганизации.housing);
		КонецЕсли;
		
		Если ДанныеТекОрганизации.Свойство("apartment") Тогда
			ДанныеПочтовогоАдреса.Вставить("Квартира", ДанныеТекОрганизации.apartment);
		КонецЕсли;
		
	КонецЕсли;
	
	СформироватьПредставлениеАдреса();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПредставлениеАдреса()
	
	ПредставлениеАдреса = "";
	Если ДанныеПочтовогоАдреса.Страна <> "-1" Тогда
		ЭлементСпискаСтрана = КонтекстРегистрации.Страны.НайтиПоЗначению(ДанныеПочтовогоАдреса.Страна);
		Если ЭлементСпискаСтрана <> Неопределено Тогда
			ПредставлениеАдреса = ЭлементСпискаСтрана.Представление;
		КонецЕсли;
	КонецЕсли;
	
	ДобавитьПодстроку(ПредставлениеАдреса, ДанныеПочтовогоАдреса.Индекс);
	
	ПредставлениеРегиона = "";
	Если ДанныеПочтовогоАдреса.КодРегиона <> "-1" Тогда
		РегионыСтраны = КонтекстРегистрации.РегионыСтран[ДанныеПочтовогоАдреса.Страна];
		Если РегионыСтраны <> Неопределено Тогда
			ЭлементРегион = РегионыСтраны.НайтиПоЗначению(ДанныеПочтовогоАдреса.КодРегиона);
			Если ЭлементРегион <> Неопределено Тогда
				ПредставлениеРегиона = ЭлементРегион.Представление;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ДобавитьПодстроку(ПредставлениеАдреса, ПредставлениеРегиона);
	
	ДобавитьПодстроку(ПредставлениеАдреса, ДанныеПочтовогоАдреса.Район, НСтр("es='La región';ru='район';en='area'") + " ");
	ДобавитьПодстроку(ПредставлениеАдреса, ДанныеПочтовогоАдреса.Город, НСтр("ru='г.';en='г.'") + " ");
	ДобавитьПодстроку(ПредставлениеАдреса, ДанныеПочтовогоАдреса.Улица, НСтр("es='La calle';ru='ул.';en='st.'") + " ");
	ДобавитьПодстроку(ПредставлениеАдреса, ДанныеПочтовогоАдреса.Дом, НСтр("es='д.';ru='д.';en='d.'") + " ");
	ДобавитьПодстроку(ПредставлениеАдреса, ДанныеПочтовогоАдреса.Строение, НСтр("es='P.';ru='стр.';en='page'") + " ");
	ДобавитьПодстроку(ПредставлениеАдреса, ДанныеПочтовогоАдреса.Квартира, НСтр("es='Sq.';ru='кв.';en='qualification'") + " ");
	
	Если ПустаяСтрока(ПредставлениеАдреса) Тогда
		Если Организация = "-1" Тогда
			ПредставлениеАдреса = НСтр("es='<introduzcan la dirección>';ru='<введите адрес>';en='<введите адрес>'");
		Иначе
			ПредставлениеАдреса = НСтр("es='<no es rellenado>';ru='<не заполнен>';en='<не заполнен>'");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция XMLСтрокаЗначения(Знач Значение)
	Возврат XMLСтрока(Значение);
КонецФункции

// Процедура добавления подстроки к строке
// Параметры:
//     ИсходнаяСтрока - Строка - исходная строка;
//     Подстрока      - Строка - строка, которая должна быть добавлена в конец исходной строки;
//     Префикс        - Строка - строка, которая добавляется перед подстрокой;
//     Разделитель    - строка - строка, которая служит разделителем между строкой и подстрокой.
//
&НаКлиенте
Процедура ДобавитьПодстроку(ИсходнаяСтрока, Знач Подстрока, Префикс = "", Разделитель = ", ")
	
	Если НЕ ПустаяСтрока(ИсходнаяСтрока) И НЕ ПустаяСтрока(Подстрока) Тогда
		ИсходнаяСтрока = ИсходнаяСтрока + Разделитель;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(Подстрока) Тогда
		ИсходнаяСтрока = ИсходнаяСтрока + Префикс + Подстрока;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
