#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Отчет.Период.ДатаНачала = НачалоГода(ТекущаяДатаСеанса());
	Отчет.Период.ДатаОкончания = ТекущаяДатаСеанса();
	Отчет.ВыявленныеДефекты = Истина;
	Отчет.АктыОВыполненииЭтапаРабот = Истина;
	Отчет.ЗаявкиНаРемонт = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ИсходныйПериод = Отчет.Период;
	
	Если Отчет.Период.ДатаОкончания = Дата(1, 1, 1) Тогда
		Отчет.Период.ДатаОкончания = ТекущаяДата();		
	КонецЕсли; 
	СекундВГоду = 31622399;
	Если (Отчет.Период.ДатаОкончания - Отчет.Период.ДатаНачала) > СекундВГоду Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(нСтр("ru='Период отчета не может превышать один год.'", "ru"), ,
													"Отчет.Период");
		Отчет.Период.ДатаНачала = НачалоГода(ТекущаяДата());
		Отчет.Период.ДатаОкончания = ТекущаяДата();
	КонецЕсли;       	
	
КонецПроцедуры

&НаСервере
Процедура ТолькСФайламиПриИзмененииНаСервере()
	
	ОтборПоФайламУстановлен = Ложь;
	ОтборФайлИД = Новый ПолеКомпоновкиДанных("ФайлИД");
	Для каждого ТекОтбор Из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ТекОтбор.ЛевоеЗначение = ОтборФайлИД Тогда
			Если Отчет.ТолькоСФайлами Тогда
				ТекОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
				ТекОтбор.Использование = Истина;
			Иначе
				ТекОтбор.Использование = Ложь;
			КонецЕсли; 
			ОтборПоФайламУстановлен = Отчет.ТолькоСФайлами;
		КонецЕсли; 
	КонецЦикла; 
	
	Если Не ОтборПоФайламУстановлен 
		И Отчет.ТолькоСФайлами Тогда
		НовыйЭлементОтбора 
			= Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлементОтбора.ЛевоеЗначение 
			= Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ФайлИД")).Поле;
		НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТолькСФайламиПриИзменении(Элемент)
	ТолькСФайламиПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

