// гкс+ [КПИ] Куст 24.11.2020
&НаСервере
Процедура Расш_гкс_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	ДобавитьНовыеЭлементы();
КонецПроцедуры
// гкс- [КПИ] Куст 24.11.2020

// гкс+ [КПИ] Куст 24.11.2020
&НаСервере
Процедура ДобавитьНовыеЭлементы()
	НЭлем = Элементы.Добавить("гкс_НеВыбиратьРазличные",Тип("ПолеФормы"),Элементы.ГруппаСортировка);
	НЭлем.Вид = ВидПоляФормы.ПолеФлажка;
	НЭлем.ПутьКДанным = "Объект.гкс_НеВыбиратьРазличные";
	
	НЭлем = Элементы.Добавить("гкс_ЗначениеАнализаПодразделения",Тип("ПолеФормы"),Элементы.ГруппаЗначение);
	НЭлем.Вид = ВидПоляФормы.ПолеФлажка;
	НЭлем.ПутьКДанным = "Объект.гкс_ЗначениеАнализаПодразделения";
	
	НЭлем = Элементы.Добавить("гкс_ЗначениеАнализаОР",Тип("ПолеФормы"),Элементы.ГруппаЗначение);
	НЭлем.Вид = ВидПоляФормы.ПолеФлажка;
	НЭлем.ПутьКДанным = "Объект.гкс_ЗначениеАнализаОР";
	
	НЭлем = Элементы.Добавить("гкс_ЗначениеАнализаТипов",Тип("ПолеФормы"),Элементы.ГруппаЗначение);
	НЭлем.Вид = ВидПоляФормы.ПолеФлажка;
	НЭлем.ПутьКДанным = "Объект.гкс_ЗначениеАнализаТипов";
	
	НЭлем = Элементы.Добавить("гкс_ЗначениеАнализаСлужб",Тип("ПолеФормы"),Элементы.ГруппаЗначение);
	НЭлем.Вид = ВидПоляФормы.ПолеФлажка;
	НЭлем.ПутьКДанным = "Объект.гкс_ЗначениеАнализаСлужб";
КонецПроцедуры
// гкс- [КПИ] Куст 24.11.2020