#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеФормой();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РазделятьПолучателейПоПодразделениямПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОповещаемые

&НаКлиенте
Процедура ОповещаемыеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если Элемент.ТекущийЭлемент.Имя = Элементы.ОповещаемыеПользователь.Имя Тогда
		ВыбратьТипПолучателя();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОповещаемыеПользовательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Оповещаемые.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И ТипЗнч(ТекущиеДанные.Пользователь) <> Тип("СправочникСсылка.Пользователи") Тогда
		ВыбратьТипПолучателя();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УправлениеФормой()
	
	Элементы.ОповещаемыеПодразделение.Видимость = Объект.РазделятьПолучателейПоПодразделениям;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьТипПолучателя()
	
	СписокДоступныхТипов = Новый СписокЗначений;
	
	СписокДоступныхТипов.Добавить("Пользователи");
	СписокДоступныхТипов.Добавить("Ответственный по документу");
	
	Если торо_РаботаССогласованиями.ПроверитьИспользованиеСогласованияДокументов() Тогда
		
		СписокДоступныхТипов.Добавить("Согласующие");
		СписокДоступныхТипов.Добавить("Оповещаемые");
		
	КонецЕсли;
	
	СписокДоступныхТипов.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ВыбратьТипПолучателяЗавершение", ЭтотОбъект), НСтр("en='To whom to form notices';es='A quien formar los avisos';ru='Кому формировать уведомления'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьТипПолучателяЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
    
    ВыбранныйТип = ВыбранныйЭлемент;
    
    Если ВыбранныйТип <> Неопределено Тогда	
        Если ВыбранныйТип.Значение = "Пользователи" Тогда
            Элементы.Оповещаемые.ТекущиеДанные.Пользователь = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
        Иначе
            Элементы.Оповещаемые.ТекущиеДанные.Пользователь = ВыбранныйТип;
        КонецЕсли;
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти