#Область ОбработчикиСобытийФормы

&НаСервере
Процедура Расш_гкс_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// гкс+ [Часовые пояса] Куст 15.04.2020
	гкс_ЧасовыеПоясаВызовСервера.ДобавитьНовыеЭлементы(ЭтаФорма, Элементы.ДатаИНомер,
		Новый Структура("гкс_РеквизитыДаты", "Дата,НаработкаОбъектов.ДатаРаботыС,НаработкаОбъектов.ДатаРаботыПо"
		+ ",НаработкаПодчиненныхОбъектов.ДатаРаботыС,НаработкаПодчиненныхОбъектов.ДатаРаботыПо"));
	// гкс- [Часовые пояса] Куст 15.04.2020
КонецПроцедуры

&НаСервере
Процедура Расш_гкс_ПриЧтенииНаСервереПосле(ТекущийОбъект)
	// гкс+ [Часовые пояса] Куст 15.04.2020
	СтруктураПроверки = Новый Структура("гкс_СдвигЧП", Неопределено);
	ЗаполнитьЗначенияСвойств(СтруктураПроверки, ЭтотОбъект);
	Если Не СтруктураПроверки.гкс_СдвигЧП = Неопределено Тогда 
		гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПКлиента(ЭтаФорма,, Объект);
	КонецЕсли;
	// гкс- [Часовые пояса] Куст 15.04.2020
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере(ДатаКлиента)
	Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда 
		Объект.Дата = ТекущаяДата();
	КонецЕсли;
	// гкс+ [Часовые пояса] Куст 14.04.2020
	гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПКлиента(ЭтаФорма,,,);
	// Заголовок формы++
	торо_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(Объект, ЭтаФорма, "");
	// Заголовок формы--
	// гкс- [Часовые пояса] Куст 14.04.2020
КонецПроцедуры

&НаКлиенте
Процедура Расш_гкс_ПриОткрытииПосле(Отказ)
	ПриОткрытииНаСервере(ТекущаяДата());
КонецПроцедуры

&НаСервере
Процедура Расш_гкс_ПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// гкс+ [Часовые пояса] Куст 15.04.2020
	гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПСервера(ЭтаФорма,, ТекущийОбъект);
	// гкс- [Часовые пояса] Куст 15.04.2020
КонецПроцедуры

&НаСервере
Процедура Расш_гкс_ПриЗаписиНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// гкс+ [Часовые пояса] Куст 15.04.2020
	гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПКлиента(ЭтаФорма,, ТекущийОбъект);
	// гкс- [Часовые пояса] Куст 15.04.2020
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("НаработкаОбъектовОбработкаВыбора")
Процедура Расш_гкс_НаработкаОбъектовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда

		ШаблонСообщения = НСтр("es='Es imposible añadir la línea del registro de la elaboración, ya que el objeto de la reparación %1 con el índice %2 es añadido ya en el documento.';ru='Невозможно добавить строку регистрации наработки, поскольку объект ремонта %1 с показателем %2 уже добавлен в документ.';en='Unable to add an operating time registration line because the repair object%1 with indicator%2 has already been added to the document.'");

		Если ВыбранноеЗначение.Свойство("ОбъектРемонта") И ЗначениеЗаполнено(ВыбранноеЗначение.ОбъектРемонта) Тогда

			Если ВыбранноеЗначение.Свойство("ПоказателиНаработки") Тогда
				ТаблицаПодобранныхОР.Очистить();
				Для каждого СтрокаПоказателя из ВыбранноеЗначение.ПоказателиНаработки Цикл
					НайденныеСтроки = Объект.НаработкаОбъектов.НайтиСтроки(Новый Структура("Объект, Показатель",ВыбранноеЗначение.ОбъектРемонта,СтрокаПоказателя.Показатель));
					Если НайденныеСтроки.Количество() = 0 Тогда
						НоваяСтрока = Объект.НаработкаОбъектов.Добавить();
						НоваяСтрока.Объект = ВыбранноеЗначение.ОбъектРемонта;
						НоваяСтрока.Показатель = СтрокаПоказателя.Показатель;
						НоваяСтрока.ДатаРаботыПо = ТекущаяДата();
						НоваяСтрока.Иерархия = ТекСтруктураИерархии;
						// изменяем начальное значение наработки	
						ЗначениеНаработки = торо_РаботаСНаработкой.ПолучитьТекущееЗначениеНаработки(НоваяСтрока.Объект, НоваяСтрока.Показатель, Объект.Ссылка);	
						НоваяСтрока.ДатаРаботыС = ЗначениеНаработки.НаработаноДата;
						НоваяСтрока.СтароеЗначение = ЗначениеНаработки.НаработаноЗначение;
						НоваяСтрока.НаработкаСНачалаЭксплуатацииНачало = ЗначениеНаработки.НаработаноЗначение;
						НоваяСтрока.НаработкаСНачалаЭксплуатации = НоваяСтрока.Наработка + НоваяСтрока.НаработкаСНачалаЭксплуатацииНачало;
						НоваяСтрока.НовоеЗначение = НоваяСтрока.Наработка + НоваяСтрока.СтароеЗначение;
						#Вставка
						Если Не ЭтотОбъект["гкс_СдвигЧП"] = 0 Тогда 
							НоваяСтрока.ДатаРаботыС = НоваяСтрока.ДатаРаботыС + (ЭтотОбъект["гкс_СдвигЧП"] * 3600);
							НоваяСтрока.ДатаРаботыПо = НоваяСтрока.ДатаРаботыПо + (ЭтотОбъект["гкс_СдвигЧП"] * 3600);
						КонецЕсли;
						#КонецВставки

						Если мОтображатьПоложение Тогда 			
							ЗаполнитьПоложениеОРВстроке(НоваяСтрока, ТекСтруктураИерархии);
						КонецЕсли;

						Если ВыбранноеЗначение.ПроставлятьПлановуюНаработку Тогда			
							НС = ТаблицаПодобранныхОР.Добавить();
							НС.Объект = НоваяСтрока.Объект;
							НС.НомерСтроки = ТаблицаПодобранныхОР.Количество();
							НС.ПлановыйГрафикРаботы = торо_РаботаСНаработкой.ПолучитьЗначениеПлановогоГрафикаРаботОбъектаРемонта(НоваяСтрока.Объект);
							НС.Показатель = НоваяСтрока.Показатель;
							НС.ДатаРаботыС = НоваяСтрока.ДатаРаботыС;
							НС.ДатаРаботыПо = НоваяСтрока.ДатаРаботыПо;
						КонецЕсли; 

						Модифицированность = Истина;

					Иначе
						ТекстСообщения = СтрШаблон(ШаблонСообщения, ВыбранноеЗначение.ОбъектРемонта, СтрокаПоказателя.Показатель);
						ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
					КонецЕсли;
				КонецЦикла;

				Если ВыбранноеЗначение.ПроставлятьПлановуюНаработку Тогда
					ЗаполнитьПлановуюНаработку(Истина, ВыбранноеЗначение.УчитыватьПростои);
				КонецЕсли;

			Иначе
				Если НЕ ОбъектРемонтаУжеДобавлен(ВыбранноеЗначение.ОбъектРемонта) Тогда
					НоваяСтрока = Объект.НаработкаОбъектов.Добавить();
					НоваяСтрока.Объект = ВыбранноеЗначение.ОбъектРемонта;
					НоваяСтрока.Иерархия = ТекСтруктураИерархии;

					Если мОтображатьПоложение Тогда 			
						ЗаполнитьПоложениеОРВстроке(НоваяСтрока, ТекСтруктураИерархии);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;

		ИначеЕсли ВыбранноеЗначение.Свойство("СоответствиеОбъектовРемонта") Тогда

			ТаблицаПодобранныхОР.Очистить();

			Для каждого КлючИЗначение из ВыбранноеЗначение.СоответствиеОбъектовРемонта Цикл
				ОбъектРемонта = КлючИЗначение.Ключ;
				Для каждого ПоказательНаработки из КлючИЗначение.Значение Цикл

					НайденныеСтроки = Объект.НаработкаОбъектов.НайтиСтроки(Новый Структура("Объект, Показатель", ОбъектРемонта, ПоказательНаработки));
					Если НайденныеСтроки.Количество() = 0 Тогда
						НоваяСтрока = Объект.НаработкаОбъектов.Добавить();
						НоваяСтрока.Объект = ОбъектРемонта;
						НоваяСтрока.Показатель = ПоказательНаработки;
						НоваяСтрока.ДатаРаботыПо = ?(ЗначениеЗаполнено(ВыбранноеЗначение.ДатаСнятия), ВыбранноеЗначение.ДатаСнятия, ТекущаяДата());
						НоваяСтрока.Иерархия = ТекСтруктураИерархии;
						// изменяем начальное значение наработки	
						ЗначениеНаработки = торо_РаботаСНаработкой.ПолучитьТекущееЗначениеНаработки(НоваяСтрока.Объект, НоваяСтрока.Показатель, Объект.Ссылка);	
						НоваяСтрока.ДатаРаботыС = ЗначениеНаработки.НаработаноДата;
						НоваяСтрока.СтароеЗначение = ЗначениеНаработки.НаработаноЗначение;
						НоваяСтрока.НаработкаСНачалаЭксплуатации = НоваяСтрока.Наработка + НоваяСтрока.НаработкаСНачалаЭксплуатацииНачало;
						НоваяСтрока.НовоеЗначение = НоваяСтрока.Наработка + НоваяСтрока.СтароеЗначение;
						#Вставка
						Если Не ЭтотОбъект["гкс_СдвигЧП"] = 0 Тогда 
							НоваяСтрока.ДатаРаботыС = НоваяСтрока.ДатаРаботыС + (ЭтотОбъект["гкс_СдвигЧП"] * 3600);
							НоваяСтрока.ДатаРаботыПо = НоваяСтрока.ДатаРаботыПо + (ЭтотОбъект["гкс_СдвигЧП"] * 3600);
						КонецЕсли;
						#КонецВставки

						Если мОтображатьПоложение Тогда 			
							ЗаполнитьПоложениеОРВстроке(НоваяСтрока, ТекСтруктураИерархии);
						КонецЕсли;

						Если ВыбранноеЗначение.ПроставлятьПлановуюНаработку Тогда			
							НС = ТаблицаПодобранныхОР.Добавить();
							НС.Объект = НоваяСтрока.Объект;
							НС.НомерСтроки = ТаблицаПодобранныхОР.Количество();
							НС.ПлановыйГрафикРаботы = торо_РаботаСНаработкой.ПолучитьЗначениеПлановогоГрафикаРаботОбъектаРемонта(НоваяСтрока.Объект);
							НС.Показатель = НоваяСтрока.Показатель;
							НС.ДатаРаботыС = НоваяСтрока.ДатаРаботыС;
							НС.ДатаРаботыПо = НоваяСтрока.ДатаРаботыПо;
						КонецЕсли; 

						Модифицированность = Истина;

					Иначе
						ТекстСообщения = СтрШаблон(ШаблонСообщения, ОбъектРемонта, ПоказательНаработки);
						ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
					КонецЕсли;

				КонецЦикла;
			КонецЦикла;

			Если ВыбранноеЗначение.ПроставлятьПлановуюНаработку Тогда
				ЗаполнитьПлановуюНаработку(Истина, ВыбранноеЗначение.УчитыватьПростои);
			КонецЕсли;

		КонецЕсли;

	Иначе

		ОбработкаВыбораОРПользователем(ВыбранноеЗначение, Неопределено);

	КонецЕсли;

КонецПроцедуры

#КонецОбласти