
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	ЗарегистрироватьСвязанныеЗаявкиВПриложениеМобильныеБригады(Замещение, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗарегистрироватьСвязанныеЗаявкиВПриложениеМобильныеБригады(Замещение, Отказ)
	
	ЗаявкиВСоответствии = Новый Соответствие;
	
	Если Замещение Тогда
		СтруктураОтбора = Новый Структура;
		ТекстыУсловия = Новый Массив;
		Для Каждого ЭлементОтбора Из Отбор Цикл
			Если ЭлементОтбора.Использование Тогда
				СтруктураОтбора.Вставить(ЭлементОтбора.Имя, ЭлементОтбора.Значение);
				ТекстыУсловия.Добавить(СтрШаблон("%1 = &%1", ЭлементОтбора.Имя));
			КонецЕсли;
		КонецЦикла;
		
		Запрос = Новый Запрос(СтрЗаменить(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_СтатусыДокументовЗаявокУстановленные.ИзменяемыйДокумент КАК ЗаявкаНаРемонт
		|ИЗ
		|	РегистрСведений.торо_СтатусыДокументовЗаявокУстановленные КАК торо_СтатусыДокументовЗаявокУстановленные
		|ГДЕ
		|	&Условие",
		"&Условие",
		СтрСоединить(ТекстыУсловия, " И ")
		));
		Для Каждого КлючЗначение Из СтруктураОтбора Цикл
			Запрос.УстановитьПараметр(КлючЗначение.Ключ, КлючЗначение.Значение);
		КонецЦикла;
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				ЗаявкиВСоответствии.Вставить(Выборка.ЗаявкаНаРемонт, "Истина");
				
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		ЗаявкиВСоответствии.Вставить(Запись.ИзменяемыйДокумент, Истина);
	КонецЦикла;
	
	Для Каждого КлючЗнач Из ЗаявкиВСоответствии Цикл
		ДокОбъект = КлючЗнач.Ключ.ПолучитьОбъект();
		ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью("mobileBrigades", ДокОбъект, Отказ);
		Получатели = Новый Массив;
		Для Каждого Узел Из ДокОбъект.ОбменДанными.Получатели Цикл
			Получатели.Добавить(Узел);
		КонецЦикла;
		
		Если Получатели.Количество() > 0 Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(Получатели, ДокОбъект.Ссылка);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти