
&НаСервере
&ИзменениеИКонтроль("РезультатФормированияОтчета")
Функция Расш_гкс_РезультатФормированияОтчета(Знач ФормированиеПриОткрытии, Непосредственно)

	Если ЗначениеЗаполнено(ФоновоеЗаданиеИдентификатор) Тогда
		ДлительныеОперации.ОтменитьВыполнениеЗадания(ФоновоеЗаданиеИдентификатор);
		ФоновоеЗаданиеИдентификатор = Неопределено;
	КонецЕсли;

	Если Не ПроверитьЗаполнение() Тогда
		Если ФормированиеПриОткрытии Тогда
			ТекстОшибки = "";
			Сообщения = ПолучитьСообщенияПользователю(Истина);
			Для Каждого Сообщение Из Сообщения Цикл
				ТекстОшибки = ТекстОшибки + ?(ТекстОшибки = "", "", ";" + Символы.ПС + Символы.ПС) + Сообщение.Текст;
			КонецЦикла;
			ПоказатьОшибкиФормирования(ТекстОшибки);
		КонецЕсли;
		Возврат Неопределено;
	КонецЕсли;

	ИмяОтчета = СтрРазделить(НастройкиОтчета.ПолноеИмя, ".")[1];
	ПараметрыФормирования = ПараметрыФормированияОтчета(ИмяОтчета, Непосредственно);
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("es='La ejecución del informe: %1';ru='Выполнение отчета: %1';en='Report Execution:%1'"),
	ИмяОтчета);
	ПараметрыВыполнения.ЗапуститьНеВФоне = Непосредственно;
	#Вставка
	ПараметрыФормирования.Вставить("СдвигЧП", Час(ТекущаяДатаСеанса()) - Час(ТекущаяДата()));
	#КонецВставки

	Результат = ДлительныеОперации.ВыполнитьВФоне(
	"ВариантыОтчетов.СформироватьОтчетВФоне",
	ПараметрыФормирования,
	ПараметрыВыполнения);

	ФоновоеЗаданиеИдентификатор = Результат.ИдентификаторЗадания;
	ФоновоеЗаданиеАдресХранилища = Результат.АдресРезультата;

	Если Результат.Статус <> "Выполняется" Тогда
		ЗагрузитьРезультатФормированияОтчета();
	Иначе	
		ОтобразитьСостояниеОтчета(НСтр("es='El informe se forma...';ru='Отчет формируется...';en='Report is being formed ...'"), БиблиотекаКартинок.ДлительнаяОперация48);
	КонецЕсли;
	Возврат Результат;

КонецФункции
