#Область ОбработчикиСобытий

&Вместо("ОбработкаПроведения")
Процедура гкс_ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	&Период КАК Период,
		|	&Организация КАК Организация,
		|	&Подразделение КАК Подразделение,
		|	Соответствия.Должность КАК Должность,
		|	Соответствия.Квалификация КАК Квалификация
		|ИЗ
		|	Документ.гкс_УстановкаСоответствийДолжностейИКвалификаций.Квалификации КАК Соответствия
		|ГДЕ
		|	Соответствия.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;		
	КонецЕсли; 
	
	Выборка = РезультатЗапроса.Выбрать();
	
	// РС гкс_СоответствияДолжностейИКвалификаций
	Движения.гкс_СоответствияДолжностейИКвалификаций.Записывать = Истина;
	Движения.гкс_СоответствияДолжностейИКвалификаций.Очистить();
	Пока Выборка.Следующий() Цикл
		Движение = Движения.гкс_СоответствияДолжностейИКвалификаций.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выборка); 				
	КонецЦикла;
	
КонецПроцедуры

&Вместо("ОбработкаЗаполнения")
Процедура гкс_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	торо_ЗаполнениеДокументов.ЗаполнитьСтандартныеРеквизитыШапкиПоУмолчанию(ЭтотОбъект);
		
КонецПроцедуры

&Вместо("ПриКопировании")
Процедура гкс_ПриКопировании(ОбъектКопирования)
	Квалификации.Очистить();	
	Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
КонецПроцедуры

#КонецОбласти

