
#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Не (АктыОВыполненииЭтапаРабот ИЛИ ВыявленныеДефекты ИЛИ ЗаявкиНаРемонт) Тогда
		Возврат;		
	КонецЕсли; 
	
	ТзСсылкыНаДокументы = Новый ТаблицаЗначений;
	ТзСсылкыНаДокументы.Колонки.Добавить("СсылкаНаДокумент");
	ТзСсылкыНаДокументы.Колонки.Добавить("ГУИД");
 	ТзСсылкыНаДокументы.Колонки.Добавить("Порядок");
   
	Прокси = ИнтеграцияС1СДокументооборотПовтИсп.ПолучитьПрокси();
	
	ЗапросДО = ИнтеграцияС1СДокументооборот.СоздатьОбъект(Прокси, "DMGetFileListRequest");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНач", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон", Период.ДатаОкончания);
	
	Запрос.Текст = СформироватьТекстЗапроса();
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
		
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ГУИД = Строка(ВыборкаДетальныеЗаписи.Ссылка.УникальныйИдентификатор());
		
		СтрокаТЗ = ТзСсылкыНаДокументы.Добавить();
		СтрокаТЗ.СсылкаНаДокумент = ВыборкаДетальныеЗаписи.Ссылка; 
		СтрокаТЗ.ГУИД = ГУИД;
		СтрокаТЗ.Порядок = ВыборкаДетальныеЗаписи.Порядок;
		
		ОбъектВладелец = ИнтеграцияС1СДокументооборот.СоздатьОбъект(Прокси, "ExternalObject");  		
		ОбъектВладелец.name = ВыборкаДетальныеЗаписи.Представление;
		ОбъектВладелец.id = ГУИД;
		ОбъектВладелец.type = "Документ." + ВыборкаДетальныеЗаписи.Ссылка.Метаданные().Имя;
		
		ЗапросДО.externalObjects.Добавить(ОбъектВладелец);
		
	КонецЦикла;
	
	ЗапросДО.columnSet.Добавить("objectId");
	ЗапросДО.columnSet.Добавить("owner");
	
	Файлы = Прокси.execute(ЗапросДО);		
	
	МояТаблица = ВернутьТаблицу(Файлы);
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("СсылкиНаДокументы", ТзСсылкыНаДокументы);
	ВнешниеНаборыДанных.Вставить("ИДФайлы", МояТаблица);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	ДокументРезультат.Очистить();
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);

	ДокументРезультат.ПоказатьУровеньГруппировокСтрок(1);	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьТекстЗапроса()
	
	ТекстЗапроса = "";
	Если АктыОВыполненииЭтапаРабот Тогда
		ТекстЗапроса =	"ВЫБРАТЬ
		              	|	торо_АктОВыполненииЭтапаРабот.Ссылка КАК Ссылка,
		              	|	торо_АктОВыполненииЭтапаРабот.Представление КАК Представление,
		              	|	торо_АктОВыполненииЭтапаРабот.МоментВремени КАК МоментВремени,
		              	|	1 КАК Порядок
		              	|ИЗ
		              	|	Документ.торо_АктОВыполненииЭтапаРабот КАК торо_АктОВыполненииЭтапаРабот
		              	|ГДЕ
		              	|	торо_АктОВыполненииЭтапаРабот.Дата МЕЖДУ &ДатаНач И &ДатаКон";
 		
	КонецЕсли; 
	
	Если ВыявленныеДефекты Тогда
		Если ТекстЗапроса <> "" Тогда
			ТекстЗапроса = ТекстЗапроса + 	"
											 |ОБЪЕДИНИТЬ ВСЕ
											 |";			
		КонецЕсли; 		
		ТекстЗапроса = ТекстЗапроса + "ВЫБРАТЬ
		                              |	торо_ВыявленныеДефекты.Ссылка КАК Ссылка,
		                              |	торо_ВыявленныеДефекты.Представление КАК Представление,
		                              |	торо_ВыявленныеДефекты.МоментВремени КАК МоментВремени,
		                              |	2 КАК Порядок
		                              |ИЗ
		                              |	Документ.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефекты
		                              |ГДЕ
		                              |	торо_ВыявленныеДефекты.Дата МЕЖДУ &ДатаНач И &ДатаКон";

	КонецЕсли; 
	
	Если ЗаявкиНаРемонт Тогда
		Если ТекстЗапроса <> "" Тогда
			ТекстЗапроса = ТекстЗапроса + 	"
											 |ОБЪЕДИНИТЬ ВСЕ
											 |";			
		КонецЕсли; 		
		ТекстЗапроса = ТекстЗапроса + "	ВЫБРАТЬ
										|	торо_ЗаявкаНаРемонт.Ссылка,
										|	торо_ЗаявкаНаРемонт.Представление,
										|	торо_ЗаявкаНаРемонт.МоментВремени,
		                                |	3 КАК Порядок
										|ИЗ
										|	Документ.торо_ЗаявкаНаРемонт КАК торо_ЗаявкаНаРемонт
										|ГДЕ
										|	торо_ЗаявкаНаРемонт.Дата МЕЖДУ &ДатаНач И &ДатаКон ";

	КонецЕсли; 
	
	ТекстЗапроса = ТекстЗапроса + "
								|УПОРЯДОЧИТЬ ПО
								|	МоментВремени УБЫВ";
	
	Возврат ТекстЗапроса;
									
КонецФункции

Функция ВернутьТаблицу(Файлы)
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ГУИД");
	ТЗ.Колонки.Добавить("ФайлИД");
	
	Для каждого ТекФайл Из Файлы.files Цикл
		НоваяСтрока = ТЗ.Добавить();	
		НоваяСтрока.ГУИД = ТекФайл.owner.externalObject.id;
		НоваяСтрока.ФайлИД = ТекФайл.objectID.id;
	КонецЦикла;
	
	Возврат ТЗ; 
		
КонецФункции
 
#КонецОбласти
