#Область ОбработчикиСобытийФормы

&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура гкс_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    #Вставка
	// Гкс+[TOIR20-622] Оселедько В.С. от 25.07.2025. Добавлено:{
	Если Параметры.Свойство("ВремяНачалаОткрытияФормы") Тогда
		ВремяНачалаЗамера = Параметры.ВремяНачалаОткрытияФормы;		
	КонецЕсли; 
	// } Гкс-[TOIR20-622]
	#КонецВставки
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаГлобальные;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	торо_СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка, Новый Структура("УстановитьСвойствоЭлементовФормыОтПрав", Истина));

	// >> [Деснол] [Ушаков А.Д.] [23.10.2019]
	дс_УстановитьЗаголовкиЭлементов();
	// << [Деснол] [Ушаков А.Д.] [23.10.2019] 
	#Вставка
	ДополнитьФормуЭлементами();
	#КонецВставки 
КонецПроцедуры

// Гкс+[TOIR20-622] Оселедько В.С. от 25.07.2025. Добавлено:{
&НаКлиенте
Процедура гкс_ПриОткрытииПосле(Отказ)
	гкс_ПриОткрытииПослеНаСервере(ВремяНачалаЗамера);
КонецПроцедуры // } Гкс-[TOIR20-622]

// Гкс+[TOIR20-622] Оселедько В.С. от 25.07.2025. Добавлено:{
&НаСервереБезКонтекста
Процедура гкс_ПриОткрытииПослеНаСервере(ВремяНачалаЗамера)
	ЗавершитьЗамерОткрытияФормы(ВремяНачалаЗамера);	
КонецПроцедуры // } Гкс-[TOIR20-622]

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИмяТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

// Гкс+[TOIR20-109] Селимов от 02.06.2020. Добавлено:{
&НаКлиенте
Процедура гкс_ОткрытьИсториюДанныхВместо(Команда)

	ИдентификаторТехКарты = Элементы.Список.ТекущиеДанные.Ссылка;
	ТехнологическаяКарта = ТехКартаПоИдентификатору(ИдентификаторТехКарты);
	Если ЗначениеЗаполнено(ТехнологическаяКарта) Тогда
		// гкс+ [03.23] Деснол 13.03.2023
		//Отбор = Новый Структура("Data", ТехнологическаяКарта); 				
		//ОткрытьФорму("sysForm:DataHistoryVersions", Отбор, ЭтаФорма, , , , ,
		//	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ссылка", ТехнологическаяКарта);
		ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
		
		ОткрытьФорму("РегистрСведений.ВерсииОбъектов.Форма.ВыборХранимыхВерсий",
								ПараметрыФормы,);
		// гкс- [03.23] Деснол 13.03.2023
	КонецЕсли; 

КонецПроцедуры // } Гкс-[TOIR20-109] 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Гкс+[TOIR20-109] Селимов от 02.06.2020. Добавлено:{
&НаСервере
Функция ТехКартаПоИдентификатору(ИдентификаторТехКарты)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ВерсииТехКартСрезПоследних.ТехКарта КАК ТехКарта
		|ИЗ
		|	РегистрСведений.торо_ВерсииТехКарт.СрезПоследних КАК торо_ВерсииТехКартСрезПоследних
		|ГДЕ
		|	торо_ВерсииТехКартСрезПоследних.ИдентификаторТехКарты = &ИдентификаторТехКарты";
	
	Запрос.УстановитьПараметр("ИдентификаторТехКарты", ИдентификаторТехКарты);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.ТехКарта;	
	
КонецФункции // } Гкс-[TOIR20-109] 

// Гкс+[TOIR20-116] Селимов от 04.06.2020. Добавлено:{
&НаСервере
Процедура ДополнитьФормуЭлементами()
	
	// Создадим команду
    Команда		= ЭтаФорма.Команды.Добавить("ОткрытьИсториюДанных");
    Команда.Действие	= "гкс_ОткрытьИсториюДанныхВместо";

    // Создадим кнопку и привяжем к ней команду
    Кнопка		= ЭтаФорма.Элементы.Добавить(Команда, Тип("КнопкаФормы"), ЭтаФорма.Элементы.ФормаКоманднаяПанель);
    Кнопка.Заголовок	= "История изменений";
    Кнопка.ИмяКоманды	= "ОткрытьИсториюДанных";
	Кнопка.Отображение	= ОтображениеКнопки.КартинкаИТекст;
	Кнопка.Картинка		= БиблиотекаКартинок.ИсторияДанных;
	
	Элементы.Переместить(Кнопка, Элементы.ФормаКоманднаяПанель, Элементы.ДополнениеСтрокаПоиска); 
	
КонецПроцедуры // } Гкс-[TOIR20-116] 

// Гкс+[TOIR20-622] Оселедько В.С. от 25.07.2025. Добавлено:{
&НаСервереБезКонтекста
Процедура ЗавершитьЗамерОткрытияФормы(ВремяНачалаЗамера)
	
    ОценкаПроизводительности.ЗакончитьЗамерВремени("Справочник.торо_ИдентификаторыТехКарт.ОткрытиеФормыСписка", ВремяНачалаЗамера); 
	
КонецПроцедуры // } Гкс-[TOIR20-622]

#КонецОбласти
