#Область СлужебныйПрограммныйИнтерфейс

&Вместо("ПометитьНаУдалениеВыделенные")
Процедура Расш_гкс_ПометитьНаУдалениеВыделенные(Форма, СПодчиненными)
	МассивДанныхСтрок = ПолучитьМассивДанныхВыделенныхСтрок(Форма);

	Если ПроверитьПравоНаКлиенте("ИнтерактивнаяПометкаУдаления") Тогда

		ЕстьПомеченныеНаУдаление = Ложь;
		Для каждого ДанныеСтроки из МассивДанныхСтрок Цикл
			Если ДанныеСтроки.ПометкаУдаления Тогда
				ЕстьПомеченныеНаУдаление = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;

		Если ЕстьПомеченныеНаУдаление Тогда
			ТекстВопроса = НСтр("es='¿Quitar de los elementos la marca a la desaparición?';ru='Снять с элементов пометку на удаление?';en='Unmark deletion?'");
		Иначе
			Если СПодчиненными Тогда
				ТекстВопроса = НСтр("es='¿Marcar los elementos a la desaparición?';ru='Пометить элементы на удаление?';en='Mark items for deletion?'");
			Иначе
				ТекстВопроса = НСтр("es='¿Marcar los elementos a la desaparición? Los elementos subordinados en todas las jerarquías "
				+ "serán llevados en la raíz de la jerarquía correspondiente.';ru='Пометить элементы на удаление? Подчиненные элементы во всех иерархиях "
				+ "будут перенесены в корень соответствующей иерархии.';en='Mark items for deletion? Subordinate items in all hierarchies"
				+ "will be moved to the root of the corresponding hierarchy. '");
			КонецЕсли;
		КонецЕсли;

		ДопПараметры = Новый Структура("МассивДанныхСтрок, ЭтаФорма, НовоеЗначениеПометки, СПодчиненными", 
		МассивДанныхСтрок, Форма, НЕ ЕстьПомеченныеНаУдаление, СПодчиненными);
		ОписаниеОповещения = Новый ОписаниеОповещения("ПометкаУдаленияОтветНаВопрос", ЭтотОбъект, ДопПараметры);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);

	Иначе
		ПоказатьПредупреждение(Неопределено, НСтр("es='¡La infracción de los derechos de admisión!';"
		+ "ru='Нарушение прав доступа!';en='Access violation!'"));
	КонецЕсли;
КонецПроцедуры

&Вместо("ПередНачаломДобавления")
Процедура Расш_гкс_ПередНачаломДобавления(Отказ, Копирование, Форма, Группа, ИмяЭлементаСписок, ИмяЭлементаДерево)
	Отказ = Истина;

	Если Форма.СтруктураПараметровИерархии.СтроитсяАвтоматически ИЛИ Копирование И НЕ Форма.СтруктураПараметровИерархии.РазрешенВводНовыхОР Тогда
		Возврат;
	КонецЕсли; 

	ТекущиеДанныеДерева = Форма.Элементы[ИмяЭлементаДерево].ТекущиеДанные;
	ТекущийРодитель = ?(ТекущиеДанныеДерева = Неопределено, Неопределено, ТекущиеДанныеДерева.Ссылка);

	ТекущиеДанныеСписка = Форма.Элементы[ИмяЭлементаСписок].ТекущиеДанные;
	ТекущаяСсылка = ?(ТекущиеДанныеСписка = Неопределено, Неопределено, ТекущиеДанныеСписка.Ссылка);

	Если Форма.СтруктураПараметровИерархии.РазрешенВводНовыхОР ИЛИ Группа Тогда

		Если торо_ОбщегоНазначенияКлиентПовтИсп.ЕстьПраво("ИнтерактивноеДобавление", "Справочники", "торо_ОбъектыРемонта") Тогда
			Если Не Копирование Тогда

				ПараметрыФормы = Новый Структура("СтруктураИерархии, РодительИерархии", Форма.ТекСтруктураИерархии, ТекущийРодитель);

				Если Группа Тогда
					ПараметрыФормы.Вставить("ЭтоГруппа", Истина);
					ОткрытьФорму("Справочник.торо_ОбъектыРемонта.ФормаГруппы", ПараметрыФормы,	Форма);
				Иначе
					ОткрытьФорму("Справочник.торо_ОбъектыРемонта.ФормаОбъекта", ПараметрыФормы, Форма);
				КонецЕсли;

			Иначе

				Если НЕ ТекущиеДанныеСписка = Неопределено и ТипЗнч(ТекущиеДанныеСписка.Ссылка) = Тип("СправочникСсылка.торо_ОбъектыРемонта") Тогда

					Если торо_РаботаСИерархией20КлиентСервер.ЭтоОбъектСподчиненнымиПоКартинке(ТекущиеДанныеСписка.ИндексКартинки) Тогда
						ДопПараметры = Новый Структура("Форма, СтруктураИерархии, РодительИерархии, ЗначениеКопирования, ЭтоГруппа", 
						Форма, Форма.ТекСтруктураИерархии, ТекущийРодитель, ТекущиеДанныеСписка.Ссылка, Группа);
						ОписаниеОповещения = Новый ОписаниеОповещения("Скопировать_ПослеВопросаОПодчиненных", ЭтотОбъект, ДопПараметры);
						
						ПоказатьВопрос(ОписаниеОповещения, НСтр("es='¿Copiar objetos cualesquiera de la reparación que forman "
						+ "parte escogida?';ru='Скопировать какие-либо объекты ремонта, входящие в состав выбранного?';"
						+ "en='Copy any repair objects that are part of the selected?'"), РежимДиалогаВопрос.ДаНет);
						
					Иначе 
						СоздатьОбъектРемонтаКопированием(Форма, ТекущиеДанныеСписка.Ссылка, Группа, Форма.ТекСтруктураИерархии, ТекущийРодитель);
					КонецЕсли;

				КонецЕсли;

			КонецЕсли;
		КонецЕсли;

	Иначе

		ТекСтруктураИерархии = Форма.ТекСтруктураИерархии;
		Если торо_ОбщегоНазначенияКлиентПовтИсп.ЕстьПраво("Редактирование", "Справочники", "торо_ОбъектыРемонта") Тогда
			СписокИерархийОР = торо_РаботаСИерархией20.ПолучитьСписокИерархий(ТекСтруктураИерархии);
			КолЭлемВСписке = СписокИерархийОР.Количество();

			ДопПараметры = Новый Структура("Форма, ТекЭлемент, ИмяЭлементаДерево", Форма, ТекущаяСсылка, ИмяЭлементаДерево);

			Если КолЭлемВСписке > 1 Тогда
				ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьВИерархиюЗавершение", ЭтотОбъект, ДопПараметры);
				ПараметрыОткрытия = Новый Структура("СписокИерархийОР, ТекСтруктураИерархии", СписокИерархийОР, ТекСтруктураИерархии);
				ОткрытьФорму("Справочник.торо_ОбъектыРемонта.Форма.ФормаНастройкиВидаИерархии",ПараметрыОткрытия,Форма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			ИначеЕсли КолЭлемВСписке = 1 Тогда
				РезультатЗакрытия = Новый Структура("СтруктураИерархии", СписокИерархийОР[0].Значение);
				ДобавитьВИерархиюЗавершение(РезультатЗакрытия, ДопПараметры);
			Иначе
				ПоказатьПредупреждение(Неопределено, НСтр("es='¡No hay otras jerarquías para la adición de ellos de los objetos "
				+ "de la reparación!';ru='Нет других иерархий для добавления из них объектов ремонта!';"
				+ "en='There are no other hierarchies for adding repair objects from them!'"));
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;
КонецПроцедуры

&Вместо("ПередНачаломДобавленияВПолноеДерево")
Процедура Расш_гкс_ПередНачаломДобавленияВПолноеДерево(Отказ, Копирование, Форма, Группа, ИмяЭлементаДерево)
	Отказ = Истина;

	Если Форма.СтруктураПараметровИерархии.СтроитсяАвтоматически ИЛИ Копирование И НЕ Форма.СтруктураПараметровИерархии.РазрешенВводНовыхОР Тогда
		Возврат;
	КонецЕсли; 

	ДеревоЭлемент = Форма.Элементы[ИмяЭлементаДерево];
	ДеревоРеквизит = Форма[ИмяЭлементаДерево];

	ТекущиеДанныеДерева = ДеревоЭлемент.ТекущиеДанные;

	Если ТекущиеДанныеДерева = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если НЕ Копирование Тогда
		ТекущийРодитель = ТекущиеДанныеДерева.Ссылка;
		ТекущаяСсылка = Неопределено;
	Иначе
		ТекущаяСсылка = ТекущиеДанныеДерева.Ссылка;
		СтрокаРодителя = ТекущиеДанныеДерева.ПолучитьРодителя();
		ТекущийРодитель = ?(СтрокаРодителя = Неопределено, Неопределено, СтрокаРодителя.Ссылка);
	КонецЕсли;

	Если Форма.СтруктураПараметровИерархии.РазрешенВводНовыхОР ИЛИ Группа Тогда

		Если торо_ОбщегоНазначенияКлиентПовтИсп.ЕстьПраво("ИнтерактивноеДобавление", "Справочники", "торо_ОбъектыРемонта") Тогда
			Если Не Копирование Тогда

				ПараметрыФормы = Новый Структура("СтруктураИерархии, РодительИерархии", Форма.ТекСтруктураИерархии, ТекущийРодитель);

				Если Группа Тогда
					ПараметрыФормы.Вставить("ЭтоГруппа", Истина);
					ОткрытьФорму("Справочник.торо_ОбъектыРемонта.ФормаГруппы", ПараметрыФормы,	Форма);
				Иначе
					ОткрытьФорму("Справочник.торо_ОбъектыРемонта.ФормаОбъекта", ПараметрыФормы, Форма);
				КонецЕсли;

			Иначе

				Если ТипЗнч(ТекущаяСсылка) = Тип("СправочникСсылка.торо_ОбъектыРемонта") Тогда

					Если торо_РаботаСИерархией20КлиентСервер.ЭтоОбъектСподчиненнымиПоКартинке(ТекущиеДанныеДерева.Картинка) Тогда
						ДопПараметры = Новый Структура("Форма, СтруктураИерархии, РодительИерархии, ЗначениеКопирования, ЭтоГруппа", 
						Форма, Форма.ТекСтруктураИерархии, ТекущийРодитель, ТекущаяСсылка, Группа);
						ОписаниеОповещения = Новый ОписаниеОповещения("Скопировать_ПослеВопросаОПодчиненных", ЭтотОбъект, ДопПараметры);
						ПоказатьВопрос(ОписаниеОповещения, 
						НСтр("es='¿Copiar objetos cualesquiera de la reparación que forman parte escogida?';
						|ru='Скопировать какие-либо объекты ремонта, входящие в состав выбранного?';
						|en='Copy any repair objects that are part of the selected?'"), РежимДиалогаВопрос.ДаНет);
					Иначе 
						СоздатьОбъектРемонтаКопированием(Форма, ТекущаяСсылка, Группа, Форма.ТекСтруктураИерархии, ТекущийРодитель);
					КонецЕсли;

				КонецЕсли;

			КонецЕсли;
		КонецЕсли;

	Иначе

		ТекСтруктураИерархии = Форма.ТекСтруктураИерархии;
		Если торо_ОбщегоНазначенияКлиентПовтИсп.ЕстьПраво("Редактирование", "Справочники", "торо_ОбъектыРемонта") Тогда
			СписокИерархийОР = торо_РаботаСИерархией20.ПолучитьСписокИерархий(ТекСтруктураИерархии);
			КолЭлемВСписке = СписокИерархийОР.Количество();

			ДопПараметры = Новый Структура("Форма, ТекЭлемент, ИмяЭлементаДерево", Форма, ТекущаяСсылка, ИмяЭлементаДерево);

			Если КолЭлемВСписке > 1 Тогда
				ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьВИерархиюЗавершение", ЭтотОбъект, ДопПараметры);
				ПараметрыОткрытия = Новый Структура("СписокИерархийОР, ТекСтруктураИерархии", СписокИерархийОР, ТекСтруктураИерархии);
				ОткрытьФорму("Справочник.торо_ОбъектыРемонта.Форма.ФормаНастройкиВидаИерархии",ПараметрыОткрытия,Форма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			ИначеЕсли КолЭлемВСписке = 1 Тогда
				РезультатЗакрытия = Новый Структура("СтруктураИерархии", СписокИерархийОР[0].Значение);
				ДобавитьВИерархиюЗавершение(РезультатЗакрытия, ДопПараметры);
			Иначе
				ПоказатьПредупреждение(Неопределено, НСтр("es='¡No hay otras jerarquías para la adición de ellos de los objetos "
				+ "de la reparación!';ru='Нет других иерархий для добавления из них объектов ремонта!';"
				+ "en='There are no other hierarchies for adding repair objects from them!'"));
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&Вместо("ОбработкаОповещенияОбИзмененииПометкиУдаленияОбъектаРемонта")
Процедура Расш_гкс_ОбработкаОповещенияОбИзмененииПометкиУдаленияОбъектаРемонта(Форма, Параметр, ИмяРеквизитаДерево, Знач СтруктураПараметровИерархии, Знач ПустойРодитель)
	Если СтруктураПараметровИерархии = Неопределено Тогда
		СтруктураПараметровИерархии = Форма.СтруктураПараметровИерархии;
	КонецЕсли;

	Если ПустойРодитель = Неопределено Тогда
		ПустойРодитель = Форма.ПустойРодитель;
	КонецЕсли;

	Если СтруктураПараметровИерархии.СтроитсяАвтоматически И НЕ СтруктураПараметровИерархии.КонечныеЭлементыВДереве Тогда
		Возврат;
	КонецЕсли;

	Дерево = Форма[ИмяРеквизитаДерево];
	Для каждого ОбъектРемонта из Параметр.МассивСсылок Цикл
		СтрокаДерева = торо_РаботаСИерархией20КлиентСервер.НайтиСсылкуВДеревеБезДостраивания(Дерево.ПолучитьЭлементы(), ОбъектРемонта, СтруктураПараметровИерархии, ПустойРодитель);
		Если СтрокаДерева <> Неопределено Тогда
			СтрокаДерева.ПометкаУдаления = Параметр.НовоеЗначениеПометки;
			ЭтоСоставной = торо_РаботаСИерархией20КлиентСервер.ЭтоОРГруппаПоКартинке(СтрокаДерева.Картинка);
			Если СтрокаДерева.Свойство("ТипОбъекта") Тогда 	
				СтрокаДерева.Картинка = торо_РаботаСИерархией20КлиентСервер.гкс_ПолучитьИндексКартинкиДереваНеавтоматическойИерархии(
				СтрокаДерева.ПометкаУдаления, СтрокаДерева.ЭтоГруппа, ЭтоСоставной, 
				СтрокаДерева.ТипОбъекта = торо_ОбщегоНазначенияКлиентПовтИсп.ПолучитьПеречисление("торо_ТипыОбъектовRCM", 
				"ФункциональноеМесто"));
			Иначе
				СтрокаДерева.Картинка = торо_РаботаСИерархией20КлиентСервер.ПолучитьИндексКартинкиДереваНеавтоматическойИерархии(
				СтрокаДерева.ПометкаУдаления, СтрокаДерева.ЭтоГруппа, ЭтоСоставной);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&Вместо("ОбработкаОповещенияОЗаписиОбъектаРемонта")
Процедура Расш_гкс_ОбработкаОповещенияОЗаписиОбъектаРемонта(Форма, Параметр, ИмяРеквизитаДерево, Знач СтруктураПараметровИерархии, Знач ПустойРодитель)
	Если СтруктураПараметровИерархии = Неопределено Тогда
		СтруктураПараметровИерархии = Форма.СтруктураПараметровИерархии;
	КонецЕсли;

	Если ПустойРодитель = Неопределено Тогда
		ПустойРодитель = Форма.ПустойРодитель;
	КонецЕсли;

	Дерево = Форма[ИмяРеквизитаДерево];
	СтрокаДерева = торо_РаботаСИерархией20КлиентСервер.НайтиСсылкуВДеревеБезДостраивания(Дерево.ПолучитьЭлементы(), Параметр.Ссылка, СтруктураПараметровИерархии, ПустойРодитель);
	Если СтрокаДерева <> Неопределено Тогда
		СтрокаДерева.ПометкаУдаления = Параметр.ПометкаУдаления;
		ЭтоСоставной = торо_РаботаСИерархией20КлиентСервер.ЭтоОРГруппаПоКартинке(СтрокаДерева.Картинка);
		Если СтрокаДерева.Свойство("ТипОбъекта") Тогда 
			Если Параметр.Свойство("ТипОбъекта") Тогда 
				СтрокаДерева.ТипОбъекта = Параметр.ТипОбъекта;
			КонецЕсли;
			СтрокаДерева.Картинка = 
			торо_РаботаСИерархией20КлиентСервер.гкс_ПолучитьИндексКартинкиДереваНеавтоматическойИерархии(
			СтрокаДерева.ПометкаУдаления, СтрокаДерева.ЭтоГруппа, ЭтоСоставной, СтрокаДерева.ТипОбъекта = 
			торо_ОбщегоНазначенияКлиентПовтИсп.ПолучитьПеречисление("торо_ТипыОбъектовRCM","ФункциональноеМесто"));
		Иначе
			СтрокаДерева.Картинка = 
			торо_РаботаСИерархией20КлиентСервер.ПолучитьИндексКартинкиДереваНеавтоматическойИерархии(
			СтрокаДерева.ПометкаУдаления, СтрокаДерева.ЭтоГруппа, ЭтоСоставной);
		КонецЕсли;
		СтрокаДерева.Наименование = Строка(Параметр.Ссылка);

	ИначеЕсли Параметр.Свойство("ЭтоНовый") И Параметр.ЭтоНовый = Истина 
		И Параметр.Свойство("СтруктураИерархии") И Параметр.СтруктураИерархии = СтруктураПараметровИерархии.ТекСтруктураИерархии Тогда

		СтрокаРодителя = торо_РаботаСИерархией20КлиентСервер.НайтиСсылкуВДеревеБезДостраивания(Дерево.ПолучитьЭлементы(), Параметр.РодительИерархии, СтруктураПараметровИерархии, ПустойРодитель);

		// Добавлем только по одной строке, т.к. следующая добавится при разворачивании дерева
		Если СтрокаРодителя = Неопределено Тогда
			РодительРодителя = торо_РаботаСИерархией20.ПолучитьТекущегоРодителяВИерархии(Параметр.РодительИерархии, СтруктураПараметровИерархии.ТекСтруктураИерархии,,Истина,Истина);
			СтрокаРодителяРодителя = торо_РаботаСИерархией20КлиентСервер.НайтиСсылкуВДеревеБезДостраивания(Дерево.ПолучитьЭлементы(), РодительРодителя, СтруктураПараметровИерархии, ПустойРодитель);
			Если СтрокаРодителяРодителя <> Неопределено Тогда
				ДанныеСтрокиРодителя = торо_РаботаСИерархией20.ПолучитьСтруктуруДанныхСтрокиДляДереваОР(СтруктураПараметровИерархии, Параметр.РодительИерархии, СтруктураПараметровИерархии.КонечныеЭлементыВДереве);
				Если ДанныеСтрокиРодителя <> Неопределено Тогда
					СтрокаРодителя = торо_РаботаСИерархией20КлиентСервер.ДобавитьСтрокуВДеревоИерархии(СтрокаРодителяРодителя, ДанныеСтрокиРодителя);
				КонецЕсли;
			КонецЕсли;

		ИначеЕсли СтрокаРодителя <> Неопределено Тогда
			Если Не СтрокаРодителя.Картинка = 4 Тогда
				Если СтрокаРодителя.Свойство("ТипОбъекта") Тогда 
					СтрокаРодителя.Картинка = 
					торо_РаботаСИерархией20КлиентСервер.гкс_ПолучитьИндексКартинкиДереваНеавтоматическойИерархии(
					СтрокаРодителя.ПометкаУдаления, СтрокаРодителя.ЭтоГруппа, Истина, СтрокаРодителя.ТипОбъекта = 
					торо_ОбщегоНазначенияКлиентПовтИсп.ПолучитьПеречисление("торо_ТипыОбъектовRCM","ФункциональноеМесто"));
				Иначе
					СтрокаРодителя.Картинка = 
					торо_РаботаСИерархией20КлиентСервер.ПолучитьИндексКартинкиДереваНеавтоматическойИерархии(
					СтрокаРодителя.ПометкаУдаления, СтрокаРодителя.ЭтоГруппа, Истина);
				КонецЕсли;
			КонецЕсли;
			ДанныеСтроки = торо_РаботаСИерархией20.ПолучитьСтруктуруДанныхСтрокиДляДереваОР(СтруктураПараметровИерархии, Параметр.Ссылка, СтруктураПараметровИерархии.КонечныеЭлементыВДереве);
			Если ДанныеСтроки <> Неопределено Тогда
				НоваяСтрока = торо_РаботаСИерархией20КлиентСервер.ДобавитьСтрокуВДеревоИерархии(СтрокаРодителя, ДанныеСтроки);
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;
КонецПроцедуры


#КонецОбласти