#Область ОбработчикиСобытий

&После("ПередЗаписью")
Процедура Расш_гкс_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	МассивОР = ОбследованноеОборудование.ВыгрузитьКолонку("ОбъектРемонта");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ОбъектыРемонта.Ссылка КАК ОР
		|ИЗ
		|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|ГДЕ
		|	торо_ОбъектыРемонта.Ссылка В(&Ссылка)
		|	И торо_ОбъектыРемонта.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто)";
	Запрос.УстановитьПараметр("Ссылка", МассивОР);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() = Ложь Тогда 
		Отказ = истина;
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru = """ + Выборка.ОР 
			+ " является функциональным местом! Выберите объект ремонта."";");
			Сообщение.Сообщить();
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаПроверкиЗаполнения")
Процедура Расш_гкс_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если ОбследованноеОборудование.Количество() = 0 Тогда
		ТекстСообщения = НСтр("es='En el documento no es rellenada la parte tabular de la maquinaria inquirida.';ru='В документе не заполнена табличная часть обследованного оборудования.';en='The document does not fill out the tabular part of the inspected equipment.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		Возврат;
	КонецЕсли;

	ПроверитьЗаполнениеТабличнойЧастиОбследованноеОборудование(Отказ);
	#Удаление
	ПроверитьЗаполнениеТабличнойЧастиРемонтныеРаботы(Отказ);
	#КонецУдаления

КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура гкс_ОбработкаПроведения(Отказ, Режим)

	// регистр торо_Предписания
	Движения.торо_ВнешниеОснованияДляРабот.Записывать = Истина;
	Движения.торо_ВнешниеОснованияДляРабот.Очистить();

	// регистр торо_Ремонты
	Движения.торо_Ремонты.Записывать = Истина;
	Движения.торо_Ремонты.Очистить();	

	Для Каждого ТекСтрокаОбследованноеОборудование Из ОбследованноеОборудование Цикл
		// регистр торо_Предписания
		Движение = Движения.торо_ВнешниеОснованияДляРабот.Добавить();
		Движение.Период                    = Дата;
		Движение.ОбъектРемонта             = ТекСтрокаОбследованноеОборудование.ОбъектРемонта;
		Движение.ID                        = ТекСтрокаОбследованноеОборудование.ID;
		Движение.Описание                  = ТекСтрокаОбследованноеОборудование.Описание;
		#Вставка
		Движение.гкс_ДатаОкончания       = ТекСтрокаОбследованноеОборудование.гкс_ДатаОкончания;
		#КонецВставки
		Движение.ПлановаяДатаРемонта       = ТекСтрокаОбследованноеОборудование.ПлановаяДатаРемонта;
		Движение.Организация               = Организация;
		Движение.Подразделение             = Подразделение;

		// регистр торо_Ремонты
		Движение = Движения.торо_Ремонты.Добавить();
		Движение.Период                    = Дата;
		Движение.ID                        = ТекСтрокаОбследованноеОборудование.ID;
		Движение.ОбъектРемонта             = ТекСтрокаОбследованноеОборудование.ОбъектРемонта;
		#Удаление
		Движение.ДатаОкончанияПлан         = ТекСтрокаОбследованноеОборудование.ПлановаяДатаРемонта;
		#КонецУдаления
		#Вставка
		Движение.ДатаНачалаПлан         = ТекСтрокаОбследованноеОборудование.ПлановаяДатаРемонта;
		Движение.ДатаОкончанияПлан         = ТекСтрокаОбследованноеОборудование.гкс_ДатаОкончания;
		#КонецВставки
		Движение.ГарантийныйРемонт         = ТекСтрокаОбследованноеОборудование.ГарантийныйРемонт;

	КонецЦикла;

	// регистр торо_ОперацииПредписаний
	Движения.торо_ОперацииВнешнихОснованийДляРабот.Записывать = Истина;
	Движения.торо_ОперацииВнешнихОснованийДляРабот.Очистить();

	Для Каждого ТекСтрокаРемонтныеРаботы Из РемонтныеРаботы Цикл
		Движение = Движения.торо_ОперацииВнешнихОснованийДляРабот.Добавить();
		Движение.Предписание_ID  = ТекСтрокаРемонтныеРаботы.Предписание_ID;
		Движение.РемонтнаяРабота = ТекСтрокаРемонтныеРаботы.РемонтнаяРабота;
		Движение.ID              = ТекСтрокаРемонтныеРаботы.ID;
		Движение.Родитель_ID     = ТекСтрокаРемонтныеРаботы.Родитель_ID;
		Движение.Количество      = ТекСтрокаРемонтныеРаботы.Количество;
	КонецЦикла;

	Движения.торо_СтатусыДокументовВнешнихОснований.Записывать = Истина;
	торо_РаботаСоСтатусамиДокументовСервер.УстановитьСтатусДокумента(Ссылка, Ссылка, Движения, Перечисления.торо_СтатусыДокументов.Зарегистрирован);

КонецПроцедуры

#КонецОбласти