
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КоличествоТипов = 1;
	ТекЗначение = Неопределено;
	Если НЕ Параметры.Свойство("КоличествоТипов", КоличествоТипов) Тогда
		КоличествоТипов = 3;
	КонецЕсли;
	ВыбранныеЗначения = 0;
	ТекВладелец = Неопределено;
	
	Если Параметры.Свойство("Ключ", ТекЗначение) Тогда
		СписокВыбранных = Элементы.ВыбранныеЗначения.СписокВыбора;
		СписокВыбранных.Очистить();
		// Объект номенклатуры.
		Если ЗначениеЗаполнено(ТекЗначение) И ТипЗнч(ТекЗначение) = Тип("СправочникСсылка.ОбъектыНоменклатуры") Тогда
			СписокВыбранных.Добавить(2, Строка(ТекЗначение));
			Элементы.СписокОбъектовНоменклатуры.ТекущаяСтрока = ТекЗначение;
			ТекЗначение = УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначениеРеквизитаОбъекта(ТекЗначение, "НоменклатураКласса");
			ТекВладелец = ТекЗначение;
			УправлениеНСИФункцииКлиентСерверПереопределяемый.УстановитьЭлементОтбораДинамическогоСписка(
				СписокОбъектовНоменклатуры, "НоменклатураКласса", ТекВладелец,,, Истина);
			ВыбранныеЗначения = 2;
		КонецЕсли;
		// Номенклатура класса.
		Если ЗначениеЗаполнено(ТекЗначение) И ТипЗнч(ТекЗначение) = Тип("СправочникСсылка.НоменклатураКласса") Тогда
			СписокВыбранных.Вставить(0, 1, Строка(ТекЗначение)); 
			Элементы.СписокНоменклатуры.ТекущаяСтрока = ТекЗначение;
			ТекЗначение = УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначениеРеквизитаОбъекта(ТекЗначение, "Класс");
			Если ВыбранныеЗначения = 0 Тогда
				ТекВладелец = ТекЗначение;
				ВыбранныеЗначения = 1;
				УправлениеНСИФункцииКлиентСерверПереопределяемый.УстановитьЭлементОтбораДинамическогоСписка(
					СписокНоменклатуры, "Класс", ТекВладелец,,, Истина);
			КонецЕсли;
		КонецЕсли;
		// Класс.
		Если ТипЗнч(ТекЗначение) = Тип("СправочникСсылка.Классы") ИЛИ НЕ ЗначениеЗаполнено(ТекЗначение) Тогда
			ПредставлениеЗначения = ?(ЗначениеЗаполнено(ТекЗначение), Строка(ТекЗначение), НСтр("ru='(Выберите класс)'"));
			СписокВыбранных.Вставить(0, 0, ПредставлениеЗначения); 
			Если ЗначениеЗаполнено(ТекЗначение) Тогда
				Элементы.СписокКлассов.ТекущаяСтрока = ТекЗначение;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьОтображениеЭлементов(Элементы, ВыбранныеЗначения, КоличествоТипов);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВыбранныеЗначенияПриИзменении(Элемент)
	
	ПерейтиНаУровеньВыше();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыСписокКлассов

&НаКлиенте
Процедура СписокКлассовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбратьЗнаениеНаКлиенте();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыСписокНоменклатуры

&НаКлиенте
Процедура СписокНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбратьЗнаениеНаКлиенте();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыСписокОбъектовНоменклатуры

&НаКлиенте
Процедура СписокОбъектовНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбратьЗнаениеНаКлиенте();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьВыбор(Команда)
	
	ВыбратьЗнаениеНаКлиенте(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗначение(Команда)
	
	ВыбратьЗнаениеНаКлиенте();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыбратьЗнаениеНаКлиенте(ЗавершитьВыбор=Ложь)
	
	ЭлементыПоУровням = ПолучитьЭлементыПоУровням(Элементы);
	ТекЭлементы = ЭлементыПоУровням[ВыбранныеЗначения];
	ТекЗначение = ТекЭлементы.СписокВыбора.ТекущаяСтрока;
	Если НЕ ЗначениеЗаполнено(ТекЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗавершитьВыбор ИЛИ ВыбранныеЗначения = КоличествоТипов - 1 Тогда
		ОповеститьОВыборе(ТекЗначение);
	Иначе
		ВыбратьЗначениеНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыбратьЗначениеНаСервере()
	
	ЭлементыПоУровням = ПолучитьЭлементыПоУровням(Элементы);
	ТекЭлементы = ЭлементыПоУровням[ВыбранныеЗначения];
	ТекЗначение = ТекЭлементы.СписокВыбора.ТекущаяСтрока;
	Если НЕ ЗначениеЗаполнено(ТекЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранныеЗначения = 0 Тогда
		РеквизитыКласса = УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначенияРеквизитовОбъекта(
			ТекЗначение, "НоменклатураКласса, ОбъектыНоменклатуры");
		Если КоличествоТипов = 3 И НЕ РеквизитыКласса.ОбъектыНоменклатуры Тогда
			Возврат;
		ИначеЕсли КоличествоТипов = 2 И НЕ РеквизитыКласса.НоменклатураКласса Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	СписокВыбора = Элементы.ВыбранныеЗначения.СписокВыбора;
	СписокВыбора[ВыбранныеЗначения].Представление = Строка(ТекЗначение);
	
	ВыбранныеЗначения = ВыбранныеЗначения + 1;
	
	ТекВладелец = ТекЗначение;
	ТекЭлементы = ЭлементыПоУровням[ВыбранныеЗначения];
	
	УправлениеНСИФункцииКлиентСерверПереопределяемый.УстановитьЭлементОтбораДинамическогоСписка(
		ЭтаФорма[ТекЭлементы.СписокВыбора.ПутьКДанным], ТекЭлементы.ПолеОтбора, ТекВладелец, , , Истина);
	
	СписокВыбора.Добавить(ВыбранныеЗначения, ТекЭлементы.ПредставлениеЗначения);
	
	УстановитьОтображениеЭлементов(Элементы, ВыбранныеЗначения, КоличествоТипов);
	
	ТекущийЭлемент = ТекЭлементы.СписокВыбора;
	
КонецПроцедуры

&НаСервере
Процедура ПерейтиНаУровеньВыше()
	
	ЭлементыПоУровням = ПолучитьЭлементыПоУровням(Элементы);
	ТекЭлементы = ЭлементыПоУровням[ВыбранныеЗначения];
	
	ВладелецНоменклатура = (ТипЗнч(ТекВладелец) = Тип("СправочникСсылка.НоменклатураКласса"));
	ТекЭлементы.СписокВыбора.ТекущаяСтрока = ?(ВладелецНоменклатура И ВыбранныеЗначения = 0, 
		УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначениеРеквизитаОбъекта(ТекВладелец, "Класс"), ТекВладелец);
	
	СписокВыбора = Элементы.ВыбранныеЗначения.СписокВыбора;
	КолВо = СписокВыбора.Количество();
	Для Н = 1 По КолВо - ВыбранныеЗначения - 1 Цикл
		СписокВыбора.Удалить(КолВо - Н);
	КонецЦикла;
	
	СписокВыбора[ВыбранныеЗначения].Представление = ТекЭлементы.ПредставлениеЗначения;
	
	УстановитьОтображениеЭлементов(Элементы, ВыбранныеЗначения, КоличествоТипов);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтображениеЭлементов(Элементы, ВыбранныеЗначения, КоличествоТипов)
	
	ЭлементыПоУровням = ПолучитьЭлементыПоУровням(Элементы);
	
	Для Каждого КлючИЗначение ИЗ ЭлементыПоУровням Цикл
		КлючИЗначение.Значение.КоманднаяПанель.Видимость = (КлючИЗначение.Ключ = ВыбранныеЗначения);
		КлючИЗначение.Значение.КоманднаяПанель.Доступность = (КлючИЗначение.Ключ = ВыбранныеЗначения);
	КонецЦикла;
	
	ТекЭлементы = ЭлементыПоУровням[ВыбранныеЗначения];
	Элементы.ГруппаСтраницы.ТекущаяСтраница = ТекЭлементы.СтраницаФормы;
	Элементы.ФормаВыбратьЗначение.Заголовок = ТекЭлементы.ПредставлениеКнопкиВыбора;
	
	Элементы.ФормаЗавершитьВыбор.Видимость = (ВыбранныеЗначения < КоличествоТипов - 1);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьЭлементыПоУровням(Элементы)
	
	ЭлементыПоУровням = Новый Соответствие;
	ЭлементыПоУровням.Вставить(0, Новый Структура(
		"КоманднаяПанель, СтраницаФормы, СписокВыбора, ПредставлениеКнопкиВыбора, ПредставлениеЗначения", 
		Элементы.ФормаКомандыСпискаКлассов, Элементы.ГруппаСписокКлассов,
		Элементы.СписокКлассов, НСтр("ru='Выбрать класс'"), НСтр("ru='(Выберите класс)'")));
	ЭлементыПоУровням.Вставить(1, Новый Структура(
		"КоманднаяПанель, СтраницаФормы, СписокВыбора, ПолеОтбора, ПредставлениеКнопкиВыбора, ПредставлениеЗначения", 
		Элементы.ФормаКомандыСпискаНоменклатуры, Элементы.ГруппаСписокНоменклатуры,
		Элементы.СписокНоменклатуры, "Класс", НСтр("ru='Выбрать номенклатуру'"), НСтр("ru='(Выберите номенклатуру)'")));
	ЭлементыПоУровням.Вставить(2, Новый Структура(
		"КоманднаяПанель, СтраницаФормы, СписокВыбора, ПолеОтбора, ПредставлениеКнопкиВыбора, ПредставлениеЗначения", 
		Элементы.ФормаКомандыСпискаОбъектовНоменклатуры, Элементы.ГруппаСписокОбъектов,
		Элементы.СписокОбъектовНоменклатуры, "НоменклатураКласса", НСтр("ru='Выбрать объект'"), НСтр("ru='(Выберите объект номенклатуры)'")));
	
	Возврат ЭлементыПоУровням;
	
КонецФункции

#КонецОбласти
