
&ИзменениеИКонтроль("ДобавитьКомандыПечати")
Процедура гкс_ДобавитьКомандыПечати(КомандыПечати)

	ФО_УправлениеПерсоналом = ПолучитьФункциональнуюОпцию("торо_ИспользоватьУправлениеПерсоналом");
	
	#Удаление
	Если Пользователи.РолиДоступны("ДобавлениеИзменениеДанныхДляНачисленияЗарплаты,ЧтениеДанныхДляНачисленияЗарплаты", , Ложь) 
	#КонецУдаления
	#Вставка     
	Если Пользователи.РолиДоступны("ДобавлениеИзменениеПроведениеПометкаУдаленияКадровыхПереводов,
			|ЧтениеКадровыхПереводов,гкс_РедактированиеЗаявкиНаРемонт", , Ложь) 
	#КонецВставки
		И ФО_УправлениеПерсоналом Тогда

		// Приказ о переводе
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Обработка.торо_ПечатьКадровыхПриказов";
		КомандаПечати.Идентификатор = "ПФ_MXL_Т5";
		КомандаПечати.Представление = НСтр("es='La orden de la traducción';ru='Приказ о переводе';en='Transfer order'");
		КомандаПечати.ДополнительныеПараметры.Вставить("ТребуетсяЧтениеБезОграничений", Истина);
		КомандаПечати.ПроверкаПроведенияПередПечатью = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
		"НастройкиТОиР",
		"ПечатьДокументовБезПредварительногоПросмотра",
		Ложь);

	КонецЕсли;

КонецПроцедуры

&ИзменениеИКонтроль("ПолныеПраваНаДокумент")
Функция гкс_ПолныеПраваНаДокумент()

	#Удаление
	Возврат Пользователи.РолиДоступны("ДобавлениеИзменениеДанныхДляНачисленияЗарплатыРасширенная, ЧтениеДанныхДляНачисленияЗарплатыРасширенная", , Ложь);
	#КонецУдаления
	#Вставка     
	Возврат Пользователи.РолиДоступны("ДобавлениеИзменениеПроведениеПометкаУдаленияКадровыхПереводов, 
		|ЧтениеКадровыхПереводов, гкс_РедактированиеЗаявкиНаРемонт", , Ложь);
	#КонецВставки

КонецФункции
