#Область СлужебныеПроцедурыИФункции

// Заполняет список команд печати.
//
// Параметры:
// КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Акт на приемку оборудования из ремонта
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_АктПриемкиОборудования";
	КомандаПечати.Идентификатор = "АктНаПриемкуОборудованияИзРемонта";
	КомандаПечати.Представление = НСтр("es='El acta a la recepción de la maquinaria de la reparación';ru='Акт на приемку оборудования из ремонта';en='Act on acceptance of equipment from repair'");
	КомандаПечати.Обработчик = "торо_Печать.ЗапроситьУПользователяДополнительныеПараметрыПередПечатью";
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	
КонецПроцедуры

// Сформировать печатные формы объектов.
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую.
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать.
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати.
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы.
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктНаПриемкуОборудованияИзРемонта") Тогда		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"АктНаПриемкуОборудованияИзРемонта", 
		"Акт на приемку оборудования из ремонта", 
		ПечатьАктНаПриемкуОборудованияИзРемонта(МассивОбъектов, ПараметрыПечати),
		,
		"Документ.торо_АктПриемкиОборудования.ПФ_MXL_АктНаПриемкуОборудованияИзРемонта");
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьАктНаПриемкуОборудованияИзРемонта(МассивОбъектов, ПараметрыПечати)
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_АктПриемкиОборудования.ПФ_MXL_АктНаПриемкуОборудованияИзРемонта");
	ШапкаАкта = Макет.ПолучитьОбласть("Шапка");
	ЧленыКомиссии = Макет.ПолучитьОбласть("ЧленыКомиссии");
	ТекстАкта = Макет.ПолучитьОбласть("АктНаПриемку");
	Комиссия = Макет.ПолучитьОбласть("Комиссия");	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_АктПриемкиОборудованияРемонтыОборудования.Ссылка КАК Ссылка,
	|	торо_АктПриемкиОборудованияРемонтыОборудования.Ссылка.Номер КАК Номер,
	|	торо_АктПриемкиОборудованияРемонтыОборудования.Ссылка.Дата КАК Дата,
	|	торо_АктПриемкиОборудованияРемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_Комиссии.Председатель КАК Председатель,
	|	торо_Комиссии.СоставКомиссии.(
	|		ЧленКомиссии КАК ЧленКомиссии
	|	) КАК СоставКомиссии,
	|	торо_АктПриемкиОборудованияРемонтыОборудования.ДатаНачала КАК ДатаНачала,
	|	торо_АктПриемкиОборудованияРемонтыОборудования.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	Документ.торо_АктПриемкиОборудования.РемонтыОборудования КАК торо_АктПриемкиОборудованияРемонтыОборудования
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_Комиссии КАК торо_Комиссии
	|		ПО торо_АктПриемкиОборудованияРемонтыОборудования.Ссылка.Комиссия = торо_Комиссии.Ссылка
	|ГДЕ
	|	торо_АктПриемкиОборудованияРемонтыОборудования.Ссылка В(&Ссылка)
	|	И торо_АктПриемкиОборудованияРемонтыОборудования.ID В(&МассивID)";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	Если ПараметрыПечати.Свойство("МассивID") Тогда
		Запрос.УстановитьПараметр("МассивID", ПараметрыПечати.МассивID);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И торо_АктПриемкиОборудованияРемонтыОборудования.ID В(&МассивID)", "");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	ЭтоПервый = Истина;
	
	Пока Выборка.Следующий() Цикл
		Если НЕ ЭтоПервый Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ЭтоПервый = Ложь;
			
		ШапкаАкта.Параметры.Номер = Выборка.Номер;
		ШапкаАкта.Параметры.Дата = Формат(Выборка.Дата,"ДЛФ=Д");	
		ШапкаАкта.Параметры.ПредседательКомиссии = Выборка.Председатель;
		ШапкаАкта.Параметры.ОбъектРемонта =  торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(Выборка.ОбъектРемонта);
		ТабДок.Вывести(ШапкаАкта);
		
		СписокЧленовКомиссии = Новый Массив;
		СоставКомиссии = Выборка.СоставКомиссии.Выбрать();
		Пока СоставКомиссии.Следующий() Цикл 
			ЧленыКомиссии.Параметры.ЧленКомиссии = СоставКомиссии.ЧленКомиссии;
			СписокЧленовКомиссии.Добавить(СоставКомиссии.ЧленКомиссии);
			ТабДок.Вывести(ЧленыКомиссии);
		КонецЦикла;

		ТекстАкта.Параметры.ОбъектРемонта = торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(Выборка.ОбъектРемонта);
		ТекстАкта.Параметры.ДатаНачала = Выборка.ДатаНачала;
		ТекстАкта.Параметры.ДатаОкончания = Выборка.ДатаОкончания;
		ТекстАкта.Параметры.ПредседательКомиссии = Выборка.Председатель;
		
		ТабДок.Вывести(ТекстАкта);
			
		Для каждого Элемент Из СписокЧленовКомиссии Цикл
			Комиссия.Параметры.ЧленКомиссии = Элемент;
			ТабДок.Вывести(Комиссия); 
		КонецЦикла; 	
		
	КонецЦикла;
		
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;

	ТабДок.ТолькоПросмотр = Истина;
	Возврат ТабДок;
	
КонецФункции

#КонецОбласти