

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Перем БезусловнаяЗапись Экспорт;	// Отключает проверки при записи документа
перем СтруктураДанных Экспорт;  // Структура, хранящая данные для работы с уведомлениями.

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(Основание, СтандартнаяОбработка)
	
	торо_ЗаполнениеДокументов20.ЗаполнениеНаОсновании(Основание, ЭтотОбъект, Ложь);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если РемонтыОборудования.Количество() = 0 Тогда
		ТекстСообщения = НСтр("es='En la parte tabular ""las Reparaciones de la maquinaria"" no hay líneas.';ru='В табличной части ""Ремонты оборудования"" нет строк.';en='There are no lines in the tabular section ""Equipment Repairs"".'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если Не Отказ Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	РемонтыОборудования.ОбъектРемонта,
		|	РемонтыОборудования.ВидРемонтныхРабот,
		|	РемонтыОборудования.ID КАК ID
		|ПОМЕСТИТЬ РемонтыОборудования
		|ИЗ
		|	Документ.торо_АктПриемкиОборудования.РемонтыОборудования КАК РемонтыОборудования
		|ГДЕ
		|	РемонтыОборудования.Ссылка = &Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_АктыПоРемонтам.IDРемонта КАК ID,
		|	торо_АктыПоРемонтам.Регистратор КАК Ссылка
		|ПОМЕСТИТЬ АктыПоРемонтам
		|ИЗ
		|	РегистрСведений.торо_АктыПоРемонтам.СрезПоследних(
		|			,
		|			IDРемонта В
		|				(ВЫБРАТЬ
		|					РемонтыОборудования.ID
		|				ИЗ
		|					РемонтыОборудования КАК РемонтыОборудования)) КАК торо_АктыПоРемонтам
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	торо_АктыПоРемонтам.IDРемонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АктыПоРемонтам.ID,
		|	АктыПоРемонтам.Ссылка,
		|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ЗавершитьРемонт КАК РемонтЗавершен
		|ПОМЕСТИТЬ торо_АктОВыполненииЭтапаРаботРемонтыОборудования
		|ИЗ
		|	АктыПоРемонтам КАК АктыПоРемонтам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК торо_АктОВыполненииЭтапаРаботРемонтыОборудования
		|		ПО АктыПоРемонтам.Ссылка = торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка
		|			И АктыПоРемонтам.ID = торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ID
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	АктыПоРемонтам.ID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РемонтыОборудования.ОбъектРемонта,
		|	РемонтыОборудования.ВидРемонтныхРабот,
		|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка КАК ДокументАкт,
		|	РемонтыОборудования.ID,
		|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.РемонтЗавершен КАК РемонтЗавершен,
		|	ВЫБОР
		|		КОГДА торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК АктыОтсутствуют
		|ИЗ
		|	РемонтыОборудования КАК РемонтыОборудования
		|		ЛЕВОЕ СОЕДИНЕНИЕ торо_АктОВыполненииЭтапаРаботРемонтыОборудования КАК торо_АктОВыполненииЭтапаРаботРемонтыОборудования
		|		ПО РемонтыОборудования.ID = торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ID";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		ТабРезультат = Запрос.Выполнить().Выгрузить();
		
		ПрисутствуютВсеАкты = Истина;
		Для Каждого Строка Из ТабРезультат Цикл
			
			Ошибка = Ложь;
			Если Строка.АктыОтсутствуют Тогда
				Ошибка = Истина;
				ТекстСообщения = СтрШаблон(
				НСтр("es='¡Es imposible pasar el documento por razón de lo que para la reparación ""%1"" para ""%2"" faltan las actas sobre la ejecución de la etapa de los trabajos!';ru='Невозможно провести документ по причине того, что для ремонта ""%1"" для ""%2"" отсутствуют акты о выполнении этапа работ!';en='Unable to post a document due to the fact that there are no acts on the completion of the work stage to repair ""%1"" for ""%2""!'"),
				Строка.ВидРемонтныхРабот,Строка.ОбъектРемонта);
			ИначеЕсли ЗакрываемыеАкты.НайтиСтроки(Новый Структура("ID, ДокументАкт", Строка.ID, Строка.ДокументАкт)).Количество() = 0 Тогда
				Ошибка = Истина;
				ТекстСообщения = СтрШаблон(
				НСтр("es='¡Es imposible pasar el documento por razón de lo que para la reparación ""%1"" para ""%2"" en el documento falta ""%3""! ¡Es necesario renovar la tabla de las actas, cerradas por la reparación!';ru='Невозможно провести документ по причине того, что для ремонта ""%1"" для ""%2"" в документе отсутствует ""%3""! Необходимо обновить таблицу закрываемых по ремонту актов!';en='Unable to post a document because the document “%3” is missing in the document for repair “%1” for “%2”! It is necessary to update the table of acts closed for repair!'"),
				Строка.ВидРемонтныхРабот,Строка.ОбъектРемонта,Строка.ДокументАкт);
			КонецЕсли;
			
			Если Ошибка Тогда
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			КонецЕсли;
			
		КонецЦикла;
		
		Если Не Отказ Тогда
			IDРемонтов = ОбщегоНазначения.ВыгрузитьКолонку(РемонтыОборудования, "ID");
			
			Для Каждого Ремонт Из IDРемонтов Цикл
				НайденныеСтроки = ТабРезультат.НайтиСтроки(Новый Структура("ID", Ремонт));
				Если НайденныеСтроки.Количество() > 0 Тогда
					Ошибка = Истина;
					Для Каждого Строка Из НайденныеСтроки Цикл
						Если ЗначениеЗаполнено(Строка.РемонтЗавершен) И Строка.РемонтЗавершен Тогда
							Ошибка = Ложь;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					Если Ошибка Тогда
						ШаблонСообщения = НСтр("es='¡Es imposible pasar el documento por razón de lo que para la reparación ""%1"" por el objeto ""%2"" falta por lo menos una acta sobre la ejecución de la etapa de los trabajos con el indicio de la terminación!';ru='Невозможно провести документ по причине того, что для ремонта ""%1"" по объекту ""%2"" отсутствует хотя бы один акт о выполнении этапа работ с признаком завершения!';en='Unable to post a document due to the fact that at least one act on the completion of the work phase with a sign of completion is missing for the repair ""%1"" on the object ""%2""!'");
						ТекстСообщения = СтрШаблон(ШаблонСообщения, НайденныеСтроки[0].ВидРемонтныхРабот,НайденныеСтроки[0].ОбъектРемонта);
						ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли