#Область ОбработчикиСобытий

&После("ПриЗаписи")
Процедура Расш_гкс_ПриЗаписи(Отказ)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_ГруппыХарактеристикОборудованияСписокХарактеристик.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ПоСсылке
		|ИЗ
		|	ПланВидовХарактеристик.торо_ГруппыХарактеристикОборудования.СписокХарактеристик
		|	КАК торо_ГруппыХарактеристикОборудованияСписокХарактеристик
		|ГДЕ
		|	торо_ГруппыХарактеристикОборудованияСписокХарактеристик.Характеристика = &Ссылка
		|	И торо_ГруппыХарактеристикОборудованияСписокХарактеристик.Ссылка.ЗаполнятьАвтоматически = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_ГруппыХарактеристикОборудованияПараметрыАвтозаполнения.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ПоЗаголовку
		|ИЗ
		|	ПланВидовХарактеристик.торо_ГруппыХарактеристикОборудования.ПараметрыАвтозаполнения
		|	КАК торо_ГруппыХарактеристикОборудованияПараметрыАвтозаполнения
		|ГДЕ
		|	торо_ГруппыХарактеристикОборудованияПараметрыАвтозаполнения.НаименованиеХарактеристики = &Заголовок
		|	И торо_ГруппыХарактеристикОборудованияПараметрыАвтозаполнения.Ссылка.ЗаполнятьАвтоматически = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЕСТЬNULL(ПоЗаголовку.Ссылка, ПоСсылке.Ссылка) КАК Ссылка
		|ИЗ
		|	ПоЗаголовку КАК ПоЗаголовку
		|		ПОЛНОЕ СОЕДИНЕНИЕ ПоСсылке КАК ПоСсылке
		|		ПО ПоЗаголовку.Ссылка = ПоСсылке.Ссылка
		|ГДЕ
		|	(ПоСсылке.Ссылка ЕСТЬ NULL
		|			ИЛИ ПоЗаголовку.Ссылка ЕСТЬ NULL)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Заголовок", Заголовок);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() = Ложь Тогда 
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ТекущийОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ТекущийОбъект.Записать();
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти