
&НаСервере
&ИзменениеИКонтроль("СоздатьИзФайлаНаДискеСервер")
Функция гкс_СоздатьИзФайлаНаДискеСервер(ПараметрыСоздания)

	Прокси = ИнтеграцияС1СДокументооборотПовтИсп.ПолучитьПрокси();

	Запрос = ИнтеграцияС1СДокументооборот.СоздатьОбъект(Прокси, "DMAddLinkedFileRequest");

	Запрос.rootFolderID = ИдентификаторКорневойПапки1СДокументооборот;

	Запрос.file = ИнтеграцияС1СДокументооборот.СоздатьОбъект(Прокси, "DMFile");

	Запрос.file.externalObject = ИнтеграцияС1СДокументооборот.СоздатьОбъект(Прокси, "ExternalObject");
	Запрос.file.externalObject.name = Строка(ВнешнийОбъект);
	Запрос.file.externalObject.id = Строка(ВнешнийОбъект.УникальныйИдентификатор());
	Запрос.file.externalObject.type = ВнешнийОбъект.Метаданные().ПолноеИмя();

	Запрос.file.objectId = ИнтеграцияС1СДокументооборот.СоздатьObjectID(Прокси, "", "DMFile");
	Запрос.file.binaryData = ПолучитьИзВременногоХранилища(ПараметрыСоздания.АдресВременногоХранилищаФайла);
	Запрос.file.extension = ПараметрыСоздания.Расширение;
	Запрос.file.modificationDate = ПараметрыСоздания.ВремяИзменения;
	Запрос.file.modificationDateUniversal = ПараметрыСоздания.ВремяИзмененияУниверсальное;
	Запрос.file.name = ПараметрыСоздания.Имя;
	Запрос.file.size = ПараметрыСоздания.Размер;

	МаксРазмерФайла = ИнтеграцияС1СДокументооборотВызовСервера.МаксимальныйРазмерПередаваемогоФайла();
	Если ПараметрыСоздания.Размер > МаксРазмерФайла Тогда
		РазмерВМб = ПараметрыСоздания.Размер / (1024 * 1024);
		РазмерВМбМакс = МаксРазмерФайла / (1024 * 1024);
		ВызватьИсключение
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("es='La dimensión del fichero ""%1"" (%2 Mb) supera máximamente admisible (%3 Mb).';ru='Размер файла ""%1"" (%2 Мб) превышает максимально допустимый (%3 Мб).';en='File size ""%1"" (%2 Mb) exceeds the maximum allowed (%3 Mb).'"),
		ПараметрыСоздания.Имя, 
		РаботаСФайламиСлужебныйКлиентСервер.ПолучитьСтрокуСРазмеромФайла(РазмерВМб),
		РаботаСФайламиСлужебныйКлиентСервер.ПолучитьСтрокуСРазмеромФайла(РазмерВМбМакс));
	КонецЕсли;

	Если НЕ ПустаяСтрока(ПараметрыСоздания.Текст) Тогда
		Запрос.file.text = ПараметрыСоздания.Текст;
	КонецЕсли;

	Ответ = Прокси.execute(Запрос);
	ИнтеграцияС1СДокументооборот.ПроверитьВозвратВебСервиса(Прокси, Ответ);
    #Вставка
	// Гкс+[TOIR20-469/TOIR20-591] Зозуля А.В. от 18.11.2024/31.07.2025. Добавлено:{
	ТипЗначенияВнешнегоОбъекта = ТипЗнч(ВнешнийОбъект); 
	Если ТипЗначенияВнешнегоОбъекта = Тип("ДокументСсылка.торо_ВыявленныеДефекты")
		Или ТипЗначенияВнешнегоОбъекта = Тип("ДокументСсылка.торо_АктОВыполненииЭтапаРабот") Тогда
		СтруктураЗаписи = Новый Структура;
		СтруктураЗаписи.Вставить("ВладелецФайла", ВнешнийОбъект);
		СтруктураЗаписи.Вставить("ИдентификаторВладельцаФайла", Строка(ВнешнийОбъект.УникальныйИдентификатор()));
		СтруктураЗаписи.Вставить("ИдентификаторФайла", Ответ.file.objectId.id);
		
		гкс_ОбменДаннымиСервер.ДобавитьЗаписьВРегистрСведений(СтруктураЗаписи, "гкс_НаличиеПрикрепленныхФайловВДокументообороте");
	КонецЕсли;
	// } Гкс-[TOIR20-469/TOIR20-591] Зозуля А.В. от 18.11.2024/31.07.2025.
	#КонецВставки
	Возврат Ответ.file.objectId.id;

КонецФункции

&НаСервере
&ИзменениеИКонтроль("ОбновитьСписокФайлов")
Процедура гкс_ОбновитьСписокФайлов()

	СписокФайлов.Очистить();

	Файлы = ИнтеграцияС1СДокументооборотВызовСервера.ФайлыПоОбъектуПотребителю(
	ВнешнийОбъект.УникальныйИдентификатор(),
	Строка(ВнешнийОбъект),
	ВнешнийОбъект.Метаданные().ПолноеИмя());

	Для каждого СведенияОФайле Из Файлы.files Цикл
		НоваяСтрока = СписокФайлов.Добавить();

		НоваяСтрока.Наименование = СведенияОФайле.name;
		НоваяСтрока.Расширение = СведенияОФайле.extension;
		НоваяСтрока.Описание = СведенияОФайле.description;
		НоваяСтрока.Размер = Окр(СведенияОФайле.size/1024, 0);
		НоваяСтрока.ПодписанЭП = СведенияОФайле.signed;
		НоваяСтрока.Автор = СведенияОФайле.author.name;
		НоваяСтрока.ID = СведенияОФайле.objectId.id;
		НоваяСтрока.ДатаСоздания = СведенияОФайле.creationDate;
		НоваяСтрока.ДатаМодификацииУниверсальная = СведенияОФайле.modificationDateUniversal;

		НоваяСтрока.ИндексКартинки = РаботаСФайламиСлужебныйКлиентСервер.ПолучитьИндексПиктограммыФайла(
		НоваяСтрока.Расширение);

		Для Каждого ПодписьXDTO Из СведенияОФайле.signatures Цикл
			Подпись = НоваяСтрока.ТаблицаПодписей.Добавить();

			Подпись.КомуВыданСертификат = ПодписьXDTO.author;
			Подпись.ДатаПодписи = ПодписьXDTO.date;
			Подпись.Комментарий = ПодписьXDTO.comment;
			Подпись.Отпечаток = ПодписьXDTO.thumbprint;

			ДвоичныеДанные = ПодписьXDTO.signature;
			Подпись.АдресПодписи = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);

			ДвоичныеДанныеСертификата = ПодписьXDTO.certificate;
			Если ДвоичныеДанныеСертификата <> Неопределено Тогда 
				Подпись.АдресСертификата = ПоместитьВоВременноеХранилище(
				ДвоичныеДанныеСертификата, УникальныйИдентификатор);
			КонецЕсли;

			Подпись.ИмяФайлаПодписи = ПодписьXDTO.signatureFileName;
			Подпись.УстановившийПодпись = ПодписьXDTO.signer.name;
			Подпись.УстановившийПодписьИд = ПодписьXDTO.signer.objectId.id;
		КонецЦикла;

	КонецЦикла;
    #Вставка
	// Гкс+[TOIR20-469/TOIR20-591] Зозуля А.В. от 18.11.2024/31.07.2025. Добавлено:{
	ТипЗначенияВнешнегоОбъекта = ТипЗнч(ВнешнийОбъект); 
	Если ТипЗначенияВнешнегоОбъекта = Тип("ДокументСсылка.торо_ВыявленныеДефекты")
		Или ТипЗначенияВнешнегоОбъекта = Тип("ДокументСсылка.торо_АктОВыполненииЭтапаРабот") Тогда
		МассивИдентификаторовФайлов = Новый Массив;
		Для Каждого СведенияОФайле Из Файлы.files Цикл
			МассивИдентификаторовФайлов.Добавить(СведенияОФайле.objectId.id);	
		КонецЦикла;
		РегистрыСведений.гкс_НаличиеПрикрепленныхФайловВДокументообороте.УдалитьНесуществующиеВДокументооборотеЗаписи(ВнешнийОбъект, МассивИдентификаторовФайлов);
	КонецЕсли;
	// } Гкс-[TOIR20-469/TOIR20-591] Зозуля А.В. от 18.11.2024/31.07.2025.
	#КонецВставки
КонецПроцедуры
