
Процедура ПередЗаписью(Отказ)
	Если ЗаполнятьАвтоматически И Не(ДополнительныеСвойства.Свойство("ТолькоЗапись") И ДополнительныеСвойства.ТолькоЗапись=Истина) Тогда 
		СписокХарактеристик.Очистить();
		//
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	торо_ГруппыХарактеристикОборудованияПараметрыАвтозаполнения.НаименованиеХарактеристики КАК Имя
			|ПОМЕСТИТЬ Искомые
			|ИЗ
			|	ПланВидовХарактеристик.торо_ГруппыХарактеристикОборудования.ПараметрыАвтозаполнения КАК торо_ГруппыХарактеристикОборудованияПараметрыАвтозаполнения
			|ГДЕ
			|	торо_ГруппыХарактеристикОборудованияПараметрыАвтозаполнения.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
			|ИЗ
			|	Искомые КАК Искомые
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
			|		ПО Искомые.Имя = ДополнительныеРеквизитыИСведения.Заголовок";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой()=Ложь Тогда 
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				НС = СписокХарактеристик.Добавить();
				НС.Характеристика = Выборка.Ссылка;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
