
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ТПОтборПечатнойФормыЗначение.ВыбиратьТип = Ложь;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НоваяСтрока = ТПОтборПечатнойФормы.Добавить();	
	НоваяСтрока.Имя = "Объект ремонта";
	
	НоваяСтрока= ТПОтборПечатнойФормы.Добавить();
	НоваяСтрока.Имя = "Вид ремонта";
	
	Если ЗначениеЗаполнено(Параметры.ДатаНачала) Тогда
		ПериодНач = Параметры.ДатаНачала;
	Иначе
		ПериодНач = Дата(0001,01,1);
	КонецЕслИ;
	
	Если ЗначениеЗаполнено(Параметры.Датаокончания) Тогда
		ПериодКон = Параметры.Датаокончания;
	Иначе
		ПериодКон = Дата(3999,11,1);
	КонецЕслИ;
	
	ИнтервалРазбиения = Параметры.ИнтервалРазбиения;
	
	ТекГод = Год(ТекущаяДата());
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодНачПриИзменении(Элемент)
	ПериодНачПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПериодНачПриИзмененииНаСервере()
	Если ПериодНач > ПериодКон И ЗначениеЗаполнено(ПериодКон) Тогда
		ТекстСообщения = НСтр("es='La fecha del comienzo del período no puede ser más de fechas de su comienzo.';ru='Дата начала периода не может быть больше даты его начала.';en='The start date of the period cannot be greater than the start date.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		ПериодНач = НачПерПоян;
		Возврат;
	КонецЕсли;	
	Если ПериодНач < НачПерПоян или ПериодНач > КонПерПоян Тогда
		ТекстСообщения = НСтр("es='La fecha introducida se encuentra fuera de los límites de la banda posible.';ru='Введенная дата находится за пределами возможного диапазона.';en='The entered date is out of range.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		ПериодНач = НачПерПоян;
		Возврат;
	КонецЕсли;
	Если ((НачалоДня(ПериодКон) - НачалоДня(ПериодНач))/(60 * 60 * 24) >= 31 * 3) И
		(ИнтервалРазбиения = Перечисления.Периодичность.День) Тогда
			ТекстСообщения = НСтр("es='¡Los detalles para tal período no son admisible por días!';ru='Детализация для такого периода не допустима по дням!';en='Detailing for such a period is not allowed by the day!'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Элементы.ПолеВыбораИнтервала.Значение = "Неделя";
			ИнтервалРазбиения = Перечисления.Периодичность.Неделя;	
		Возврат;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПериодКонПриИзменении(Элемент)
	ПериодКонПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПериодКонПриИзмененииНаСервере()
	Если ПериодКон < ПериодНач Тогда
		ТекстСообщения = НСтр("es='La fecha del fin del período no puede ser menos de fechas de su comienzo.';ru='Дата конца периода не может быть меньше даты его начала.';en='The end date of a period cannot be less than the start date.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		ПериодКон = КонПерПоян;
		Возврат;
	КонецЕсли;	
	Если ПериодКон < НачПерПоян Или ПериодКон > КонПерПоян Тогда
		ТекстСообщения = НСтр("es='La fecha introducida se encuentra fuera de los límites de la banda posible.';ru='Введенная дата находится за пределами возможного диапазона.';en='The entered date is out of range.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		ПериодКон = КонПерПоян;
		Возврат;
	КонецЕсли;
	Если ((НачалоДня(ПериодКон) - НачалоДня(ПериодНач))/(60 * 60 * 24) >= 31 * 3) И
		(ИнтервалРазбиения = Перечисления.Периодичность.День) Тогда
			ТекстСообщения = НСтр("es='¡Los detalles para tal período no son admisible por días!';ru='Детализация для такого периода не допустима по дням!';en='Detailing for such a period is not allowed by the day!'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Элементы.ПолеВыбораИнтервала.Значение = "Неделя";
			ИнтервалРазбиения = Перечисления.Периодичность.Неделя;
			Возврат;
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТПОтборПечатнойФормы

&НаКлиенте
Процедура ТПОтборПечатнойФормыЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ТПОтборПечатнойФормы.ТекущиеДанные;
	Если ТекДанные <> Неопределено И ТекДанные.Значение = Неопределено Тогда
		
		НеобходимСписок = (ТекДанные.ВидСравнения = ВидСравнения.ВСписке Или ТекДанные.ВидСравнения = ВидСравнения.НеВСписке Или ТекДанные.ВидСравнения = ВидСравнения.ВСпискеПоИерархии);
		
		Если ТекДанные.Имя = "Объект ремонта" Тогда
			Если НеобходимСписок Тогда
				НеобходимыйСписок = Новый СписокЗначений;
				НеобходимыйСписок.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта, СправочникСсылка.торо_СписокОбъектовРегламентногоМероприятия");
				ТекДанные.Значение = НеобходимыйСписок;
			Иначе
				СписокТипов = Новый СписокЗначений;
				СписокТипов.Добавить(Тип("СправочникСсылка.торо_ОбъектыРемонта"));
				СписокТипов.Добавить(Тип("СправочникСсылка.торо_СписокОбъектовРегламентногоМероприятия"));
				СписокТипов.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ПоказВыбораТипаТПОтборПечатнойФормыЗначениеНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("ТекДанные", ТекДанные)), "Выберите тип");
			КонецЕсли;
		ИначеЕсли ТекДанные.Имя = "Вид ремонта" Тогда
			Если НеобходимСписок Тогда
				НеобходимыйСписок = Новый СписокЗначений;
				НеобходимыйСписок.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.торо_ВидыРемонтов");
				ТекДанные.Значение = НеобходимыйСписок;
			Иначе
				ТекДанные.Значение = ПредопределенноеЗначение("Справочник.торо_ВидыРемонтов.ПустаяСсылка");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПоказВыбораТипаТПОтборПечатнойФормыЗначениеНачалоВыбораЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора <> Неопределено Тогда
		Если РезультатВыбора.Значение = Тип("СправочникСсылка.торо_ОбъектыРемонта") Тогда
			ДопПараметры.ТекДанные.Значение = ПредопределенноеЗначение("Справочник.торо_ОбъектыРемонта.ПустаяСсылка");
		ИначеЕсли РезультатВыбора.Значение = Тип("СправочникСсылка.торо_СписокОбъектовРегламентногоМероприятия") Тогда
			ДопПараметры.ТекДанные.Значение = ПредопределенноеЗначение("Справочник.торо_СписокОбъектовРегламентногоМероприятия.ПустаяСсылка");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТПОтборПечатнойФормыЗначениеОчистка(Элемент, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ТПОтборПечатнойФормы.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ТекДанные.Значение = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТПОтборПечатнойФормыВидСравненияПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТПОтборПечатнойФормы.ТекущиеДанные;
	Если ТекДанные <> Неопределено И ТекДанные.Значение <> Неопределено Тогда
		НеобходимСписок = (ТекДанные.ВидСравнения = ВидСравнения.ВСписке Или ТекДанные.ВидСравнения = ВидСравнения.НеВСписке Или ТекДанные.ВидСравнения = ВидСравнения.ВСпискеПоИерархии);
		
		Если Не НеобходимСписок И ТипЗнч(ТекДанные.Значение) = Тип("СписокЗначений") Тогда
			Если ТекДанные.Значение.Количество() > 0 Тогда
				ТекДанные.Значение = ТекДанные.Значение[0].Значение;
			Иначе
				ТекДанные.Значение = ?(ТекДанные.Имя = "Объект ремонта", Неопределено, ПредопределенноеЗначение("Справочник.торо_ВидыРемонтов.ПустаяСсылка"));
			КонецЕсли;
		ИначеЕсли НеобходимСписок И Не ТипЗнч(ТекДанные.Значение) = Тип("СписокЗначений") Тогда
			НеобходимыйСписок = Новый СписокЗначений;
			НеобходимыйСписок.ТипЗначения = ?(ТекДанные.Имя = "Объект ремонта",Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта, СправочникСсылка.торо_СписокОбъектовРегламентногоМероприятия"), Новый ОписаниеТипов("СправочникСсылка.торо_ВидыРемонтов"));
			Если ЗначениеЗаполнено(ТекДанные.Значение) Тогда
				НеобходимыйСписок.Добавить(ТекДанные.Значение);
			КонецЕсли;
			ТекДанные.Значение = НеобходимыйСписок;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Печать(Команда)
	
	ПередатьПараметр = Новый Структура;
	Если ЗначениеЗаполнено(ПериодНач) Тогда
		ПередатьПараметр.Вставить("ДатаНачала", ПериодНач);
	Иначе
		ТекстСообщения = НСтр("es='La prensa es imposible - rellenen la fecha ha comenzado en el campo ""el Período""';ru='Печать невозможна - заполните дату начала в поле ""Период""';en='Printing is not possible - fill in the start date in the ""Period"" field'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;	
	Если ЗначениеЗаполнено(ПериодКон) Тогда
		ПередатьПараметр.Вставить("ДатаКонца", ПериодКон);
	Иначе
		ТекстСообщения = НСтр("es='La prensa es imposible - rellenen la fecha de la terminación en el campo ""el Período""';ru='Печать невозможна - заполните дату окончания в поле ""Период""';en='Printing is not possible - fill in the end date in the ""Period"" field'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ПередатьПараметр.Вставить("ОтборФормы", ТПОтборПечатнойФормы); 	
	
	Оповестить(КлючНазначенияИспользования, ПередатьПараметр, ЭтаФорма.ВладелецФормы);
	Закрыть();	
КонецПроцедуры

#КонецОбласти


