
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АдресДерева", АдресДерева) Тогда
		ДеревоЗначений = ПолучитьИзВременногоХранилища(АдресДерева);
		ЗначениеВРеквизитФормы(ДеревоЗначений, "ДеревоВыбора");
		ТекОбъект = Неопределено;
		Если Параметры.Свойство("ТекущаяСтрока", ТекОбъект) Тогда
			ИДТекСтроки = НайтиВДереве(ДеревоВыбора, ТекОбъект);
			Если НЕ ИДТекСтроки = Неопределено Тогда
				Элементы.ДеревоВыбора.ТекущаяСтрока = ИДТекСтроки;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	КартинкаСтрок = Неопределено;
	Если Параметры.Свойство("КартинкаСтрок", КартинкаСтрок) Тогда
		Элементы.ДеревоВыбора.КартинкаСтрок = КартинкаСтрок;
	КонецЕсли;
	
	Параметры.Свойство("Заголовок", Заголовок);
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	ТекДанные = Элементы.ДеревоВыбора.ТекущиеДанные;
	Если НЕ ТекДанные = Неопределено Тогда
		ОповеститьОВыборе(ТекДанные.Объект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВыбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОповеститьОВыборе(Элементы.ДеревоВыбора.ТекущиеДанные.Объект);
	
КонецПроцедуры

&НаСервере
Функция НайтиВДереве(ДанныеФормыДерево, Объект)
	
	ЭлементыДерева = ДанныеФормыДерево.ПолучитьЭлементы();
	ЭлементыДляПоиска = Новый Массив;
	ЭлементыДляПоиска.Добавить(ЭлементыДерева);
	
	Пока ЭлементыДляПоиска.Количество() > 0 Цикл
		
		ТекЭлементыДерева = ЭлементыДляПоиска[0];
		Для Каждого СтрокаДерева ИЗ ТекЭлементыДерева Цикл
			Если СтрокаДерева.Объект = Объект Тогда
				Возврат СтрокаДерева.ПолучитьИдентификатор();
			КонецЕсли;
			ВложенныеЭлементыДерева = СтрокаДерева.ПолучитьЭлементы();
			Если ВложенныеЭлементыДерева.Количество() > 0 Тогда
				ЭлементыДляПоиска.Добавить(ВложенныеЭлементыДерева);
			КонецЕсли;
		КонецЦикла;
		
		ЭлементыДляПоиска.Удалить(0);
		
	КонецЦикла;
	
КонецФункции