
Функция ПолучитьСведенияОНоменклатуре(Ссылка) Экспорт
	
	СведенияОНоменклатуре = Новый Структура("Автор, ДатаСоздания, АвторИзменения, ДатаИзменения");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", Ссылка);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияОНоменклатуреКлассов.Автор,
		|	СведенияОНоменклатуреКлассов.ДатаСоздания,
		|	СведенияОНоменклатуреКлассов.АвторИзменения,
		|	СведенияОНоменклатуреКлассов.ДатаИзменения
		|ИЗ
		|	РегистрСведений.СведенияОНоменклатуреКлассов КАК СведенияОНоменклатуреКлассов
		|ГДЕ
		|	СведенияОНоменклатуреКлассов.Объект = &Объект";
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СведенияОНоменклатуре, Результат);
	КонецЕсли;
	
	Возврат СведенияОНоменклатуре;
	
КонецФункции

Функция ЗаписатьСведенияОНоменклатуре(Ссылка, Автор, Дата, ЭтоНовый) Экспорт
	
	Запись = РегистрыСведений.СведенияОНоменклатуреКлассов.СоздатьМенеджерЗаписи();
	Запись.Объект = Ссылка;
	Если ЭтоНовый Тогда
		Запись.Автор        = Автор;
		Запись.ДатаСоздания = Дата;
	Иначе
		СведенияОНоменклатуре = ПолучитьСведенияОНоменклатуре(Ссылка);
		ЗаполнитьЗначенияСвойств(Запись, СведенияОНоменклатуре);
		Запись.АвторИзменения = Автор;
		Запись.ДатаИзменения  = Дата;
	КонецЕсли;
	Запись.Записать();
	
КонецФункции